[
    {
        "post_name": "Damn, USAIDS fed workers are delusional and self righteous",
        "score": 748,
        "text_content": "",
        "comments": [
            {
                "raw_content": "More like Antifa :)",
                "author": "MeMargie"
            },
            {
                "raw_content": "Wait.. the Jan 6 folks had weapons? I didn't see in the videos. It was hard to tell through the pepper spray mist, you know, the one from the FBI and capital police faggots spraying patriots just standing outside the capital building. Maybe it was on the guys who walked in through the open gates filled with pepper spray. You guys see any weapons?",
                "author": "Knucklechorris"
            },
            {
                "raw_content": "Why do they have so much shit on their desk? When I worked in a cubicle I never had anything on my desk or in my drawers other than work shit. Leave that shit at home where it belongs. I bet most of it is just drawers filled with junk food.",
                "author": "FlyinHeadlock"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "But they could have...",
        "score": 689,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If they’re so talented they can fix their own shithole countries",
                "author": "Johnkimble111"
            },
            {
                "raw_content": "Same people would call a microbe on mars “life” but think a baby is “just a clump of cells” all the way up to the day it’s born.",
                "author": "Bythrfruitsyknow"
            },
            {
                "raw_content": "You can only use emotional argument FOR leftist causes. Bigot.",
                "author": "barwhack"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Every ratio that they deliver makes me laugh so hard.",
        "score": 415,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yeah, Dennis, they're going to smuggle the gold bars out in their underwear or something, right? Morons aren't even entertaining anymore, just annoying.",
                "author": "Hantif"
            },
            {
                "raw_content": "the media really did a number on these idiots",
                "author": "bfett81"
            },
            {
                "raw_content": "What? There's an account called Retard Finder? 😅",
                "author": "Bump"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Supreme Court temporarily blocks order requiring Trump administration to release billions in US foreign aid - AP",
        "score": 1601,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Winning!",
                "author": "KuzoKevin"
            },
            {
                "raw_content": "Globalist NGOs can eat a bag of dicks. It's our money and we need it now. Call 877-FUCK-OFF",
                "author": "OutlawPurpleHairDye"
            },
            {
                "raw_content": "NO STANDING. Pound sand, activists!",
                "author": "yahweh"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔥🚨BREAKING NEWS. Undefeated boxing champion Floyd Mayweather just surprised all his fans by randomly going on Fox News to defend President Trump and claim ‘he is the best President we ever had.’",
        "score": 1976,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Based Money Mayweather",
                "author": "MakeAmericaRichAgain"
            },
            {
                "raw_content": "Floyd Mayweather has always been based. He defended President Trump during his first term all the time. He would go on black radio shows and they would get pissed at him. He has always been MAGA.",
                "author": "TrumpIsTheVictor"
            },
            {
                "raw_content": "Winners: it takes one to know one",
                "author": "jsphere256"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨BREAKING: Pam Bondi says the Epstein client list will be released tomorrow",
        "score": 1728,
        "text_content": "",
        "comments": [
            {
                "raw_content": "$10 says it'll be nothing new and people will gripe.",
                "author": "bidensmissingbrain"
            },
            {
                "raw_content": "Pam Barr",
                "author": "Tomm"
            },
            {
                "raw_content": "She uttered the word Hopefully.",
                "author": "mountaininfidel20"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Memes",
        "score": 1401,
        "text_content": "",
        "comments": [
            {
                "raw_content": "memes exist because they are true",
                "author": "jsphere256"
            },
            {
                "raw_content": "Just assume the opposite of msm and you'll thrive",
                "author": "UncleTedsWoodshop"
            },
            {
                "raw_content": "Accurate Reporting.",
                "author": "Apersonofinterest"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This former employee reveals what it’s really like working for the federal government and welcomes DOGE. Spoiler alert…Mostly they do nothing.",
        "score": 1180,
        "text_content": "",
        "comments": [
            {
                "raw_content": "But but but national parks!",
                "author": "Stallion"
            },
            {
                "raw_content": "I worked for a township in NJ. I was a custodian and also worked with the road department. There wasn’t enough work for me to keep busy each day so I asked if I could be put on part time. They said no, they allotted a certain amount of money in the budget for me to be there full time. I asked “what do I do when I dont have any work?” They said I don’t know, go hide somewhere. They also added that they had their own issues killing time and couldn’t worry about my lack of work. Crazy. I started coming in early and taking a nap. Then I would get up and do my days work, done before lunch and sneak off to fish in a local stream. This lasted about 6 months before I quit. I couldn’t take it any longer.",
                "author": "Zippythekid"
            },
            {
                "raw_content": "AI has been ghost writing 99% of those papers... guaranteed. They brought this on themselves.",
                "author": "Th3Cho0sing0ne"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "US is cutting off NATO allies from US direct support! Soon the US will begin withdrawing troops from Europe, saving billions of dollars for US taxpayers!",
        "score": 1926,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It'll be interesting to see how it plays out when Europe has to pay for a standing army AND muh free healthcare.",
                "author": "D__1"
            },
            {
                "raw_content": "Leave nato next. Let the eurofags pay for their own military and let’s see what happens. I give it a week before the collapse.",
                "author": "Donger-Lord"
            },
            {
                "raw_content": "The gravy train is over. Now let's see the Europeans brag about their free healthcare.",
                "author": "Counterwhat"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The IRS to close 120 of its 600 office locations, per WaPo.",
        "score": 2042,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Now close the other 480",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "It's a start.",
                "author": "BidensDeadBrain"
            },
            {
                "raw_content": "MORE!",
                "author": "grenades_and_ham"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "i did in fact vote for this.",
        "score": 756,
        "text_content": "",
        "comments": [
            {
                "raw_content": "10/10 meme",
                "author": "bigdickhangsright"
            },
            {
                "raw_content": "The people who lost the election don't get to tell me what I voted for. Consolidate the entire government down to like 4 agencies, and get the illegals the fuck out of my country. That's what I voted for. Also, full ban on DEI, stop criminalizing White male success",
                "author": "magapatriot_pa"
            },
            {
                "raw_content": "Haha same goes for the Nancy Pelosi building.",
                "author": "elmerecido"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "USDA Secretary moves to withhold food stamps from illegal Invaders",
        "score": 2033,
        "text_content": "",
        "comments": [
            {
                "raw_content": "*35 federal judges off the top rope*",
                "author": "wharfthrowaway"
            },
            {
                "raw_content": "What's the difference between EBT, SNAP and food stamps? I thought Trump already signed an EO for this. How much FREE SHIT are these friggin' invaders getting?",
                "author": "MythArcana"
            },
            {
                "raw_content": "Tired of seeing the fatasses with two carts full of name brand groceries and 4 whiney plumpers in tow.",
                "author": "grenades_and_ham"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Wayne Gretzky is a fantastic guy! They call him, “The Great One,” and he is. He could run for any political office in Canada, and win.",
        "score": 1430,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Canada will need to become a US territory before they become a state. Can’t let them affect our elections right off the bat. Gotta deport the Pajeets and Frenchies first",
                "author": "henri_derelicte"
            },
            {
                "raw_content": "Save Canada Wayne. Run for the improvement of your nation.",
                "author": "el-y0y0s"
            },
            {
                "raw_content": "Dear Donald, We do not want canada as a state. We barely want them as a territory. They will destroy this county with their votes in congress. Fuck canada",
                "author": "mastermeatlock"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Soros-funded INDIVISIBLE just issued new marching orders to 1000s of agitators: \"Every single Republican needs to pay the price\" for \"looking the other way as Trump and Musk seize power.\"",
        "score": 1036,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sounds like an insurrection. This shit played out in the 1st term, and the country is full of 'agitator fatigue'. I dont have a crystal ball to show me the future, but I dont think law enforcement is going to take this one like they did the first time.",
                "author": "BirthHole"
            },
            {
                "raw_content": "Deputize US Citizens and let us handle it our own way. If I see them in the streets I'm not stopping. I'll hit them if that's what they want. Better them than me.",
                "author": "MajorClark"
            },
            {
                "raw_content": "Soros will have to pay them out of his own pocket. May not be as attractive.",
                "author": "Tweedlethree"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Now we understand the Putin table",
        "score": 1654,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He's French and married to a man.",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "The french are only good at sucking cock and surrendering.",
                "author": "FatBeagleMars"
            },
            {
                "raw_content": "Mi scusi… mi scusi. *Donna Summers’ Hot Stuff begins playing suddenly…* iykyk RIP Jenny",
                "author": "QuickMaths"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Speaker Mike Johnson: Medicaid is for single mothers with small children who are just trying to make it. It's not for 29-year-old males sitting on their couch playing video games. We're going to find those guys, and we will SEND them back to work!",
        "score": 693,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Plenty of 29 y/o females gaming on the couch too",
                "author": "Colorado-Living"
            },
            {
                "raw_content": "The fundamental problem is that accepting, encouraging, and supporting single mothers is what has produced a horde of emasculated young men. The tipping point of supporting women making bad decisions has been reached decades ago. There are no longer enough male role models in communities to pick up the slack. We are seeing the fallout of feminism... Modern women who don't need no man and the broken young men that they produce.",
                "author": "dtrap"
            },
            {
                "raw_content": "Cut off everyone. It is not the job of the Federal government in the first place. We have 50 state governments that have that particular duty.",
                "author": "SubmarineGuy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: U.S. attorney Ed Martin is investigating a Biden official for allegedly defrauding the government and securing a multimillion dollar contract for housing that’s empty",
        "score": 1818,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wake me up when Fauci, Comey, Strzuk, or Hunter go to jail.",
                "author": "JoeBidensDementia1"
            },
            {
                "raw_content": "I keep hearing talk but not seeing indictments. *YAWNS",
                "author": "MAGALAUGHSLAST"
            },
            {
                "raw_content": "Sauce: https://x.com/usaedmartin/status/1894880235037847730",
                "author": "_C_I_A_"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "White House bars HuffPost and Reuters from Cabinet meeting in latest legacy media shakeup",
        "score": 1950,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Huffpost doesn't even deserve a seat at the kid's table.",
                "author": "4885Battery"
            },
            {
                "raw_content": "Very cool",
                "author": "EDDIT_IS_CUCKED"
            },
            {
                "raw_content": "Fuck Rooters",
                "author": "Seethroughmirror"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Now It's Official: President Trump Signs EO Instructing DOGE to Cut Gov't Depts' Non-Essential Expenses.",
        "score": 1048,
        "text_content": "",
        "comments": [
            {
                "raw_content": "DOGE should have oversight on every vehicle that shuttles a member of Congress. Planes, Trains, and Automobiles) Remember when Trump cancelled Nancy's plane trip?)",
                "author": "RuprechtThaMonkeyBoy"
            },
            {
                "raw_content": "Non-essential expenses also includes non-essential people. As President Trump familiarly said, “You’re fired!”",
                "author": "henri_derelicte"
            },
            {
                "raw_content": "I want to know what happened to the millions of rounds of ammo that the post office bought.",
                "author": "Kavantar"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Michael Moore: Trump Might Be Deporting Illegals Who Could ‘Cure Cancer’ or Stop an Asteroid - OK Flubber Fatboi - Point them out and pay for their education - The rest still get deported; you can go with them as well",
        "score": 1215,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They can do all those things back home, racist. Wow Mike, bigot much?",
                "author": "CleanUpPhillyTrump24"
            },
            {
                "raw_content": "More likely if allowed to stay they'd murder someone that is working to cure cancer",
                "author": "Fren_Request"
            },
            {
                "raw_content": "I'll take my chances",
                "author": "MegaDooche"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "AMD, Don't Screw This Up",
        "score": 210,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They might screw this up.",
                "author": "Dangerous-Fennel5751"
            },
            {
                "raw_content": "Narrator: AMD, as expected, fucked it up royally.",
                "author": "no_f-s_given"
            },
            {
                "raw_content": "Supply is the big uncertainty here. We don't know if AMD is also constrained like Nvidia. If supply is low, even with low MSRP, it will be scalped/marked/bundled thus no goodwill be gained similar to RTX 3080.",
                "author": "Aggrokid"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "MicroCenter lists Radeon RX 9070 series: RX 9070 XT starting at $699, RX 9070 at $649 - VideoCardz.com",
        "score": 427,
        "text_content": "",
        "comments": [
            {
                "raw_content": "85% of gamers buy a gpu card under 700 buck. Yeah... Just not a 699 bucks card.",
                "author": "TheAgentOfTheNine"
            },
            {
                "raw_content": "Imagine delaying the launch this much and still going with Nvidia - 50 dollars...",
                "author": "Artoriuz"
            },
            {
                "raw_content": "> AMD marketing bragging their cards are < $700 > **$699** Seems about right.",
                "author": "AndromedaAirlines"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "It Looks Like RDNA 4 Finally Has Dedicated AI Cores And 'Supercharged' AI Performance",
        "score": 137,
        "text_content": "**Edit:** *Title is misleading and nothing outside of datacenter has truly dedicated AI cores. Seems like NVIDIA and AMD is relying on tensor ALUs residing within the vector groups where they're running alongside compute INT and FP units and is leveraging WMMA for execution, just like RDNA 3. It's simply a manner of how much silicon is invested that really matters. Intel's XMX engines seems to do* [*things differently*](https://chipsandcheese.com/p/lunar-lakes-igpu-debut-of-intels)*, but can't wrap my head around it although it's still using shared ressources.* *I also stand corrected and will strike any innacurate info and clear up the confusion.* This is based on the [recent leak from Videocardz](https://videocardz.com/newz/final-specifications-of-amd-radeon-rx-9070-xt-and-rx-9070-gpus-leaked) and for anyone wondering this is [indeed a leak](https://www.techpowerup.com/333171/complete-specifications-of-amd-radeon-rx-9070-and-rx-9070-xt-leaked). **TL;DR:** At CES AMD claimed RDNA 4 had Supercharged AI performance and the specs seem to support his. AI performance has been doubled per CU vs RDNA 2 and in addition FP8 and sparsity are delivering theoretical gains up to 8x that of RDNA 3. ~~There's simply no other way this is mathetically possible (continue reading to find out why).~~ Then there's also the fact that the raw theoretical AI tops sparse INT4 and INT8 figures are virtually identical to the RTX 4080's *and this actually seem like one instance where* [*dual issue works*](https://espadrine.github.io/blog/posts/recomputing-gpu-performance.html)*. How much corresponds to real world performance is impossible to say without AI testing reviews + a Chips and Cheese deep dive.* Now it's time for some analysis. Let's start with the excellent [LLVM code analysis](https://chipsandcheese.com/p/examining-amds-rdna-4-changes-in-llvm) by Chips and Cheese of RDNA 4 that claim the architecture adds support for sparsity *(SWMMAC)*, FP8 and BF8. All this is extremely important for anything transformer and reliant on self-attention (sparsity applies here) and will result in massive speedups on top of the *doubled raw FP16 tensor throughput.* If we hypothetically assume that FSR4 is already using a vision transformer architecture (ViT) similar to DLSS 4's for SR and RR or AMD plans on using it in the future, then they can easily do that with RDNA 4 if AI is as good as on paper*.* ~~There's simply nothing suggesting AMD can't support one when the raw AI hardware specs for the 9070XT are equivalent to a RTX 4080.~~ With RDNA 3 AMD introduced AI Accelerators by adding dedicated Matrix multiply instructions (WMMA) to the CU's vector units*, containing instructions for FP16, BF16, INT8, INT4*. These relied on the FP16 raw compute throughput of the vector units 1/1 and could benefit from the dual issue capability of RDNA 3. Hence AMD claimed \\~123 FP16 TFLOPS AI performance for the RTX 7900XTX. ~~Also notice how AMD never mentioned anything about INT8 or any integer AI execution support in hardware. Well that's because that would've required AI instructions in the scalar units as well IFAIK.~~ Also so far dual issue has been kinda meh for most applications and completely useless for gaming. ~~So it would be better to compare the AI throughput against the non dual issue raw FP16 TFLOP numbers of RDNA 4 and RDNA 3 instead. That's \\~48.7 FP16 TFLOPs for the 9070XT and 61.4 FP16 TFLOPs for the 7900XTX. Extrapolating from the INT8 numbers gives the 9070XT a whopping 194.8 dense tensor FP16 TFLOPS or a 3.17x increase vs the 7900XTX. If we add FP8 and sparsity into the mix the theoretical difference is over an order of magnitude larger despite 33% fewer CUs.~~ AMD finally had the guts to approve a massive AI silicon investment with RDNA 4 *and reach parity with Ada Lovelace, well at least on paper*. We're getting spoiled early and won't have to wait till UDNA, which most people (including I) had expected. When AMD at CES said RDNA 4 had supercharged AI performance they clearly didn't lie; based on specs these new RDNA 4 cards will completely destroy RDNA 3 in anything AI related*, especially workloads leveraging FP8 and SWMMAC (sparsity).* Can't wait to see the AI benchmarks and hear more about the other architectural changes AMD has implemented RDNA 4. Based on everything from the LLVM code analysis, leaked performance numbers, theoretical AI performance numbers, and the PS5's RT capabilities RDNA 4 is shaping up to the most significant and impactful architectural change since RDNA 1. Hopefully AMD realizes this and doesn't walk into NVIDIA's trap. Launching the 9070 series at disruptive prices is the only way to make a huge long lasting impact that'll allow AMD to rapidly gain market share.",
        "comments": [
            {
                "raw_content": "i mean... it's all relative. rellative to nvidia, this is nothing. they're just finally competing relative to amd, this is huge.... but for overall gaming, this is good because it means amd has finally stepped up to the table that nvidia and intel have been at regarding RT and ML upscaling.",
                "author": "EnigmaSpore"
            },
            {
                "raw_content": "I know raw gains doesn't equal actual gains. So please don't downvote post because of this. But the silicon investments ~~with dedicated AI cores made by AMD~~ are massive compared to RDNA 3's *previous* scaled down vector unit WMMA implementation and any previous design (no AI logic). It's simply impossible for AI performance to not get \"supercharged\" (AMD's CES claim) *when AMD doubles the raw throughput of AI logic within the vector units.*",
                "author": "MrMPFR"
            },
            {
                "raw_content": "Finally someone puts the TDLR at the top of the post",
                "author": "hz55555"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "You can now buy Delidded AMD Ryzen 9800X3D with 2 Years Warranty",
        "score": 24,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What's the point ? Those cpus are out of factory pretty much maxed out. You won't get more than 200-300mhz which is nothing. Days of overlocking your CPU from 2.2ghz to 4.3ghz like my e7200 are long gone. If anything it's the oposite now. Because how overdriven cpu's are from factory you play instead with voltage to reduce power and cooling needed so it will be quieter for 1-2-3% negative difference.",
                "author": "MicelloAngelo"
            },
            {
                "raw_content": "Sounds interesting. I wonder why they test with liquid metal instead of thermal paste. Paste is cheaper, easier to apply, easier to clean up, doesn't leave residue and is just as good to determine if the chip is working or not.",
                "author": "Sylanthra"
            },
            {
                "raw_content": "The product page says “However, with the TG Delidded CPU, Thermal Grizzly takes over the warranty!” AMD's warranty is 3 years, but he only mentions the mandatory EU warranty of 2 years in the video. Is it now 2 or 3 years.",
                "author": "AnanasMango"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "NVIDIA Announces Financial Results for Fourth Quarter and Fiscal 2025",
        "score": 76,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">Record quarterly revenue of $39.3 billion, up 12% from Q3 and up 78% from a year ago >Record quarterly Data Center revenue of $35.6 billion, up 16% from Q3 and up 93% from a year ago >Record full-year revenue of $130.5 billion, up 114% >Fourth-quarter Gaming revenue was $2.5 billion",
                "author": "BarKnight"
            },
            {
                "raw_content": "Essentially, nearly their entire revenue and profit are from datacenter GPUs. I have a feeling that \"freebies\" like DLSS4 for all RTX GPUs are not going to keep coming. They won't prioritize research talent for gaming if the money is in Datacenter. I think the quality issues on the 5000 series are a bad sign for things to come in their gaming division.",
                "author": "NewRedditIsVeryUgly"
            },
            {
                "raw_content": "Gaming missed expectation by 22%. Guess that's as good a confirmation as any that there's some issue with consumer Blackwell supply. EDIT: Good lord. For people that don't read existing replies before making their own very original comment: 1. Nvidia's Q4 is Nov-Jan, not Oct-Dec. 2. It takes AIB partners months to assemble, test and ship graphics cards around the world. Nvidia gets paid when they sell the chips to them before any of this happens. Not when you buy it from your local microcentre.",
                "author": "Qesa"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Geekerwan] iPhone 16e in-depth review: Does Apple's C1 self-developed communication module save power? What is the signal?",
        "score": 13,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Geekerwan and his team just casually built an N41-band 5G base station to do the signal strength testing",
                "author": "StarbeamII"
            },
            {
                "raw_content": "- The C1 is actually decently more efficient than the qualcomm X71 *and* the X80 (as configured in a xiaomi) - It trades blows in performance and signal integrity with the X71 in the 16/16 pro. - Battery life is technically better than the 16/16 pro, but most of the gains are probably better explained by the larger battery - There's an issue with cellular idle in iOS that may require toggling airplane mode when regaining signal after losing signal. All in all, it seems like a very promising first generation and a change that most people will not notice, which is good.",
                "author": "VastTension6022"
            },
            {
                "raw_content": "Apple appears to be a bit too passive with selecting a network for the sake of power saving. I wonder about their battery result if the hour gained with Iphone 16E is from the new C1 communication model or if Apple also did some changes to scheduling as well.",
                "author": "Chairman_Daniel"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Final specifications of AMD Radeon RX 9070 XT and RX 9070 GPUs confirmed: 357 mm² die & 53.9B transistors for both cards.",
        "score": 258,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Both the same? Oh boy, praying for the return of the 5700 flashed to 5700 XT bios lol",
                "author": "chefchef97"
            },
            {
                "raw_content": "9070XT has more TOPS than the 5070ti (1557 vs 1400) and the 9070 has 15% more than the 5070 (1156 vs 988) I wonder if this will reflect the gaming performance of the card relative to nvidia or if it will be better/worse. Doesn't nvidia usually have a bigger AI advantage over AMD gaming cards vs FPS in games? If the 9070XT is 5070ti +10% and the cheapest 5070ti costs $950 then $599 sounds like an excellent price, especially if the gaming performance is better than the AI (which I think is likely). Even $699 it would still be a no-brainer over a $950+ (up to $1500 on some cards) 5070ti 5080 is just a waste of money given the cheapest ones are $1300+ and it offers nothing important over the 5070ti",
                "author": "JakeTappersCat"
            },
            {
                "raw_content": "I see HDMI 2.1b, but I wonder if we will actually have support for it in Linux or the same problem we have now since the forum rejected their proposal.",
                "author": "miloian"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Jim Keller joins AheadComputing’s board of directors; a firm of ex-Intel chip designers in RISC-V startup focused on breakthrough CPUs",
        "score": 116,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The original title makes it sound like he left Tenstorrent / joined AheadComputing, so I lightly edited to clarify it’s the BoD, not the company.",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": "The funniest part about Keller's twitter post was when someone replied \"Congrats! Thought you would be on the board of Intel though\" and he replied \"My plan is to build faster CPUs\" lol.",
                "author": "Geddagod"
            },
            {
                "raw_content": "I am a bit confused, tenstorrent has Ascalon in the pipeline and it sounded like maybe LG would put it in a smort TV, so they are already building high performance CPUs. Aren't they like \"competitors\"? I would imagine it would be best for them to create a consortium or something like that together to standardize the deployment of RISC-V to make it overall stronger in the industry. But board of directors... Whats going on? Maybe just Jim Keller doing whatever he thinks is fun, would be a great answer :D.",
                "author": "EloquentPinguin"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel, Synopsys, TSMC All Unveil Record Memory Densities",
        "score": 31,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Old news, it’s the SRAM densities reported at ISSCC",
                "author": "eding42"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "He was onto something",
        "score": 320,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Bro gave in to the voices",
                "author": "NotSoingus"
            },
            {
                "raw_content": "u/RinseAndReiterate",
                "author": "Jeam778"
            },
            {
                "raw_content": "This was definitely some Nintendo employee looking for opinions on his new idea lol",
                "author": "PatrickM_"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "We're Waiting For You Goth Sibling",
        "score": 315,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Personally I'm waiting for the scene girl sibling.",
                "author": "DoctorHoneywell"
            },
            {
                "raw_content": "Just needed to flip the joycons to match her hair lol. In my family I am the goth sibling.",
                "author": "Mediocre-Win1898"
            },
            {
                "raw_content": "Alt girls are truly peak",
                "author": "abso-chunging-lutely"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo Switch 2 Doesn't Need To Worry About Steam Deck Sales",
        "score": 137,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Switch 2 will sell more units in it's first month of release than the total cumulative sales of the steam deck to date. Crazy.",
                "author": "Paperdiego"
            },
            {
                "raw_content": "Today I found out that steam deck has sold less than 4m units. Damn that's so low, I thought it was at least 20m or so.. The switch 2 is probably gonna sell 10m on its first month Edit: I Googled what other consoles have sold on its first month and no, the switch is probably not gonna sell 10m on it's first month but probably will surpass the steam deck total sales.",
                "author": "FitzSeb92"
            },
            {
                "raw_content": "It's not even a competition, because they aren't even competing. The question is, why do we keep having this same discussion?",
                "author": "Top-Garlic9111"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Did Dunkey just give us a shout out?! 🌊🐃",
        "score": 72,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yes",
                "author": "sirarmorturtle"
            },
            {
                "raw_content": "One of us",
                "author": "kulero_conor"
            },
            {
                "raw_content": "i was thinking the same thing when I saw the video for the first time. He also directly referenced this subreddit and semi-unintentionally referenced specifically me in [https://www.youtube.com/watch?v=AOrYKHwymIQ](https://www.youtube.com/watch?v=AOrYKHwymIQ) at 1:18, and kinda 2:53 and [https://www.youtube.com/watch?v=CD8uUWIhgNA](https://www.youtube.com/watch?v=CD8uUWIhgNA) at 0:17 because of this situation: [https://www.reddit.com/r/NintendoSwitch2/comments/1hdvb2d/ive\\_come\\_from\\_the\\_future/](https://www.reddit.com/r/NintendoSwitch2/comments/1hdvb2d/ive_come_from_the_future/)",
                "author": "MacksNotCool"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Take a Break from scrolling and say hi to Kirby",
        "score": 734,
        "text_content": "Poyo",
        "comments": [
            {
                "raw_content": "Poyo ✝️",
                "author": "ennisi"
            },
            {
                "raw_content": "Kirbo!!! Poyo!",
                "author": "InspectorSatNav1"
            },
            {
                "raw_content": "Thats not Kirby, thats Kirbo. It looks like Kirby but due to International copyright laws its not...",
                "author": "MCPhatmam"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "A 2:22 trailer announcing a Direct that is 2 months, 2 weeks, and 2 days away? PLUS right in the middle of trailer and Direct is 22/2. WOW that is genius. What other 2s are there?",
        "score": 13,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It was aired in 22:02 (Japan time)",
                "author": "Brilliant-Copy4258"
            },
            {
                "raw_content": "Damn, you Jim Carrey'd that shit, well done!",
                "author": "MikeDubbz"
            },
            {
                "raw_content": "22:00 JST.",
                "author": "No-Philosophy3089"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Since it’s the 3ds birthday today this should be the subreddit icon",
        "score": 266,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Well would you look at that, the mods actually listened! 😂",
                "author": "Easy_Antelope_2779"
            },
            {
                "raw_content": "![gif](giphy|eKNrUbDJuFuaQ1A37p|downsized) Wooow",
                "author": "DRAGAN__"
            },
            {
                "raw_content": "Convinced you own this sub",
                "author": "Magnetic_Metallic"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Just saw this. I honestly would've thought the age distribution would've leaned toward more kid but I guess not. Link to the full pdf https://www.nintendo.co.jp/ir/pdf/2021/211105e.pdf",
        "score": 204,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Clickable link: https://www.nintendo.co.jp/ir/pdf/2021/211105e.pdf",
                "author": "Sephardson"
            },
            {
                "raw_content": "Thing is that that kid demographic is still the most important one. If you succeed with kids enjoying your brand, you’ll have those kids with your brand for a long time…",
                "author": "Hue_Boss"
            },
            {
                "raw_content": "Yeah, it makes sense. Kids today play Fortnite, Minecraft and Roblox. It's mostly those who grew up with Nintendo in the past that play it now. And the kids playing it are probably the kids of Nintendo fans.",
                "author": "Caciulacdlac"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Tomorrow’s Pokemon Presents is seemingly 19 minutes long",
        "score": 254,
        "text_content": "https://xcancel.com/centroleaks/status/1894959751332581463?s=46 If true this is the third longest Pokemon Presents. 2023 was 25 minutes and 2021 was 20 minutes.",
        "comments": [
            {
                "raw_content": "18 minutes Pokemon Go updates 1 minute Legends Z-A second teaser",
                "author": "vinsmokefoodboi"
            },
            {
                "raw_content": "17 minutes of Producer/Director talking slowly",
                "author": "paintp_"
            },
            {
                "raw_content": "ohhh there’s gonna be so much nothing",
                "author": "boopladee"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Roundup of info on WB Games from Jason Schreier on the Kinda Funny Gamescast.",
        "score": 118,
        "text_content": "Here's a roundup of the key points Jason Schreier had on today's Kinda Funny Gamescast. Some of this info is stuff he talked about in his WB Games article from a few weeks ago, but there's also some new tidbits as well. Source: [https://www.youtube.com/live/FI5wGiPFj\\_4?si=\\_dOKrOKZtf-7xDZ6](https://www.youtube.com/live/FI5wGiPFj_4?si=_dOKrOKZtf-7xDZ6) **Monolith:** * Following Shadow of War's release in 2017, Monolith was not interested in making another LOTR game and began developing an original IP codenamed Legacy. After Legacy was cancelled by WB in 2021, Monolith's entire leadership team and many other devs quit. Most of these devs went on to form Cliffhanger Games with EA, and are currently developing a Black Panther game. * Monolith then began work on Wonder Woman around May/June 2021. The game would be revealed at the Game Awards 6 months later. Monolith was forced to work on Wonder Woman while simultaneously rebuilding their staff and leadership team. * During development, a debate emerged about whether to use Monolith's in-house engine for Wonder Woman, or switch to Unreal Engine. They eventually decided to stick with the in-house engine, but often ran into problems as many of the programers and engineers who knew how to properly utilize the engine had already quit. * Around late 2023/early 2024, Wonder Woman was completely rebooted. The game changed directors, the Nemesis System was removed, and the game was changed to be a more traditional action-adventure game similar to God of War. * Monolith devs had no beforehand knowledge of the studios closure. They learned about it on Tuesday, shortly before we all did. **WB Montreal:** * Following the release of Arkham Origins in 2013, WB Montreal began development on two games: their own Suicide Squad game and a sequel to Arkham Knight focused on Damian Wayne. Both were eventually cancelled, and they began developing Gotham Knights in 2017. * Gotham Knights was originally intended to be live-service, but they reversed course. According to Schreier, the game itself wasn't changed much by this, it was more like WB just decided to scrap the post-launch plans. * Schreier says the \"Gotham Knights 1.5\" he mentioned previously in his article would have actually been a separate, smaller game like Spider-Man: Miles Morales, but it wasn't approved. As he also mentioned in the article, WB Montreal pitched a Constantine game that was never greenlit, and then began working on a Flash game that was cancelled after the movie flopped. * Following Gotham Knights failure, some execs at WB Games wanted WB Montreal to become a support studio, and many devs were put on support for Wonder Woman and other games. As of now, WB Montreal is currently pitching a new game based on Game of Thrones. **Other WB studios:** * Schreier reconfirms that Rocksteady is in early development on a new Batman game. * As was previously posted on this sub, TT Games is working on a new Lego game that is planned to release next year. He doesn't say exactly what it is, but there have been rumors that it's a new Lego Harry Potter that adapts the whole franchise in the same vein as Lego Star Wars: The Skywalker Saga. * As previously reported, Avalanche is working on a Director's Cut of Hogwarts Legacy with new DLC; many Rocksteady devs are also working on it. Avalanche is also in early development on Hogwarts Legacy 2, but that's still a long ways off.",
        "comments": [
            {
                "raw_content": "#Jason Schreier is a Tier 1 - Very Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "We're really never getting a DC game that ISN'T Batman, huh?",
                "author": "SolidPyramid"
            },
            {
                "raw_content": "He also said (a bit jokingly while poking fun at Greg Miller) that Rocksteady dislikes Superman, and that he's never heard of a Superman game being developed or even pitched.",
                "author": "danielthetemp"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "The Final Stages of HL3's Production Are Here (Tyler McVicker)",
        "score": 1279,
        "text_content": "* Valve's pattern of re-evaluating projects after holiday breaks and the presence of external playtesters had raised concerns about the fate of HL3, but a recent Dota 2 update suggests that HL3 has survived the holiday break and is nearing completion. * The update contains optimization and polish work, indicating that Valve is in the final stages of production, with features such as improved physics, buoyancy, flammability, and deformability, as well as advanced NPC AI and entity interactions. * HL3 appears to be a single-player first-person shooter with a strong focus on interactivity and simulation, including vehicle simulation and a random assortment of entities, and may feature an announcement in 2025. video [source](https://youtu.be/_lGdUBMdQ94?si=tkV5dKHJVQovi0jd) The [Strings of code](https://docs.google.com/document/d/1_5MAtbJ0u_O7WxgBKVDnzHeOlUeiFS2EnVLZtF9Lf_M/edit?tab=t.0) provided by McVicker",
        "comments": [
            {
                "raw_content": "2004: san andreas vs half life 2 2025: gta 6 vs half life 3",
                "author": "Legospacememe"
            },
            {
                "raw_content": "The ramifications of fucking Half Life 3 being a real thing are mindboggling to say the least",
                "author": "TimberAndStrings"
            },
            {
                "raw_content": "We might actually get half life 3 before Diddy Kong Racing on NSO huh",
                "author": "MillionYearDoor"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "New LEGO game coming from TT Games likely next year per Jason Schreier",
        "score": 298,
        "text_content": "During today's Kinda Funny Gamescast it was stated by Jason that a new LEGO game is coming from TT Games which he believe is scheduled for next year. He seems to know what the game is exactly but chose not to divulge more details. Source: [https://www.youtube.com/live/FI5wGiPFj\\_4?si=x6OVA9hT75CLt7p2&t=2997](https://www.youtube.com/live/FI5wGiPFj_4?si=x6OVA9hT75CLt7p2&t=2997)",
        "comments": [
            {
                "raw_content": "#Jason Schreier is a Tier 1 - Very Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Wasn't the next LEGO game rumoured to be a Harry Potter game like the newest Star Wars one?",
                "author": "TomBru98"
            },
            {
                "raw_content": "Honestly I'd be down for a Lord of the Rings lego game like skywalker Saga. Include all 3 Hobbit movies, all 3 LOTR movies and walk all over Middle-Earth.",
                "author": "FallenNightwing66"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "NatetheHate teasing Nintendo Announcements before end of February",
        "score": 470,
        "text_content": "[https://www.youtube.com/channel/UClXL3JXsyMhTaklrYrxZajw/community?lb=Ugkxo2wMqekYvc87f74tSB\\_46ocGrBVbrGqM](https://www.youtube.com/channel/UClXL3JXsyMhTaklrYrxZajw/community?lb=Ugkxo2wMqekYvc87f74tSB_46ocGrBVbrGqM) Just a reminder that Nate does polls when something imminent is happening,",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "PH BRAZIL ITS NOW OR NEVER",
                "author": "Nexmark"
            },
            {
                "raw_content": "Seems really weird taking into account there's a Presents tomorrow. I don't see them announcing anything on friday so tomorrow three hours after the Presents maybe?",
                "author": "Pokemigas"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "New leaked voice clips from Marvel Rivals seems to hint at Deadpool, Hit-Monkey, and MODOK",
        "score": 199,
        "text_content": "https://xcancel.com/rivalsleaks/status/1894797650068676787?s=46 The Deadpool one is frankly, really loose IMO. Not sure when Deadpool was referred to as a loose canon, but it’s no where near as direct as Cap & Rocket mocking MODOK’s head & face, and Punisher outright saying “monkey”",
        "comments": [
            {
                "raw_content": "Usually, the names of the files they datamine have the characters' names in them. That's how they are identifying who they are directed towards.",
                "author": "nessfalco"
            },
            {
                "raw_content": "Deadpool is just obviously coming at some point but hit monkey and modok could be cool too. That being said, where is Cyclops bro",
                "author": "galaxyadmirer"
            },
            {
                "raw_content": "speaking of which is Cyclops a thing planned? I heard some say it might have been faked by the devs",
                "author": "LuigiWarrior"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "MicroCenter lists RDNA 4 RX 9070 series: RX 9070 XT starting at $699, RX 9070 at $649",
        "score": 249,
        "text_content": "[https://videocardz.com/newz/microcenter-lists-radeon-rx-9070-series-rx-9070-xt-starting-at-699-rx-9070-at-649](https://videocardz.com/newz/microcenter-lists-radeon-rx-9070-series-rx-9070-xt-starting-at-699-rx-9070-at-649) And the 9070 XT is now rumoured to be close at 7900 XTX | 5070 Ti | 4080 level of performance whereas the 9070 is rumoured at 7900 XT | 4070 Ti level performance",
        "comments": [
            {
                "raw_content": "$50 less than a 5070ti. Too easy to see that one coming. Wait a quarter and they will lower the price due too poor sales",
                "author": "fatfuckintitslover"
            },
            {
                "raw_content": "I’d like to congratulate NVidia on further improvements in their marketshare.",
                "author": "SireEvalish"
            },
            {
                "raw_content": "AMD never misses an opportunity to miss an opportunity.",
                "author": "latenfor"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Possible The Wolf Among Us 2 leaks spotted on 4chan",
        "score": 212,
        "text_content": "[https://www.reddit.com/media?url=https%3A%2F%2Fpreview.redd.it%2Fnew-possible-twau-2-leak-on-4chan-v0-inu7nkd5f6le1.png%3Fwidth%3D1905%26format%3Dpng%26auto%3Dwebp%26s%3Dbf21f22fe79a286c6f66f33be29fa52e9bfc4313](https://www.reddit.com/media?url=https%3A%2F%2Fpreview.redd.it%2Fnew-possible-twau-2-leak-on-4chan-v0-inu7nkd5f6le1.png%3Fwidth%3D1905%26format%3Dpng%26auto%3Dwebp%26s%3Dbf21f22fe79a286c6f66f33be29fa52e9bfc4313)",
        "comments": [
            {
                "raw_content": "I find it incredible that this project managed to survive the fall of Telltale and that the original creator fell out with DC/Vertigo and put the characters in the public domain.",
                "author": "Midnight_M_"
            },
            {
                "raw_content": "The copium I'm huffing is insane right now",
                "author": "Raplorde"
            },
            {
                "raw_content": "This game has been in development for ages. It better be worthy successor.",
                "author": "ProtectusCZ"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "AMD, Don't Screw This Up",
        "score": 429,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ngl if amd doesn't seize the moment right now they probably never will tbh. Nvidia is fucking up literally everything possible that they can fuck up so it's really amd's game to lose.",
                "author": "averjay"
            },
            {
                "raw_content": "THIS . . . Is AMD's BEST CHANCE . . . To Gain Market Share ... Nvidia is HANDING AMD the opportunity of a lifetime here. The AMD execs would be absolutely DUNDERHEADED, to overprice their upcoming GPUs, and not seize upon this golden opportunity.",
                "author": "Too_Dang_Nasty"
            },
            {
                "raw_content": "It's interesting that he says AMD themselves still dont know what to price the cards yet. Very interesting. Hopefully they are seeing what people are saying online and the feedback on the rumored $699 price and adjust accordingly. Please, Frank. I'm sick of NVIDIA. My 3060 is done.",
                "author": "HLumin"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "GPU manufacturer Yeston's done the unthinkable by dunking its new 'Atlantis' RX 9070 XT graphics card in the ocean",
        "score": 379,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Definitely wins for unique marketing strategy. Fun little tidbit in response to the author's commentary on GPU damage, pure H2O is actually non-conductive. Saltwater though is not only conductive but *corrosive*.",
                "author": "LordAlfredo"
            },
            {
                "raw_content": "AIBs so bored waiting for launch they’re getting weird. Just release AMD please.",
                "author": "eight_ender"
            },
            {
                "raw_content": "There's probably no gpu in there anyways",
                "author": "lingeringwill2"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "XFX preparing 9 models of Radeon RX 9070 XT graphics cards",
        "score": 330,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "JFC - Why does one manufacturer need 9 fucking versions of the same card?",
                "author": "Vex1om"
            },
            {
                "raw_content": "Dear Sapphire, please just release the most rock solid, basic bitch, no bells, whistles, or flashing lights card for MSRP so I can lock it away in a dark lightless chassis and stop thinking about GPU's for the next 4 years.",
                "author": "VeryDryWater"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Thermal Grizzly to offer delidded Ryzen 9000 CPUs: 9800X3D with 2 year warranty, 9950X3D planned",
        "score": 185,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is for the guys that want to build a delidded machine. But don't trust themselves to actually delid the CPU. Shout out to those guys, that's me!",
                "author": "NewCornnut"
            },
            {
                "raw_content": "So cool! Been looking for something like this for a while.",
                "author": "KARMAAACS"
            },
            {
                "raw_content": "I get the marketing idea behind it, but this seems like the kind of product that's 5-10 years late. Companies are already so advanced and aggressive at pushing their silicon these days that there's not nearly as much to gain. Yeah, it'll run a but cooler, but the 9800X3D already made that progress from its predecessor. There's not crazy OC headroom in this either. Being able to do this long ago, when delidding really gave you a means to performance gains, would have been much more exciting.",
                "author": "cubs223425"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Final specifications of AMD Radeon RX 9070 XT and RX 9070 GPUs leaked",
        "score": 275,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "I am looking for a AMD gpu that is as or less power hungry than the 7800xt - the RX 9070 looks very promising.",
                "author": "MagnusRottcodd"
            },
            {
                "raw_content": "Welcome back, Vega 64",
                "author": "Zeghez"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "MicroCenter lists Radeon RX 9070 series: RX 9070 XT starting at $699, RX 9070 at $649 - VideoCardz.com",
        "score": 126,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "10 hours to approve post wtf mods?",
                "author": "croissantguy07"
            },
            {
                "raw_content": "Looks like nvidia -$50 lives on for another 2 years.",
                "author": "averjay"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Made a chart showing how the Framework desktop with Strix Halo compares (to mac mini / mac studio / digits / mini PC / standard desktop build)",
        "score": 59,
        "text_content": "",
        "comments": [
            {
                "raw_content": "An important detail is that Mac is shipping today, while Framework desktop won't ship for another 6 months.",
                "author": "yuehuang"
            },
            {
                "raw_content": "I would suggest the memory amount should take a more prominent position. Many large LLMs are over 50GB in size. Lower RAM/VRAM size relative to the LLM model size means *drastically* lower performance. To that end, 128GB is a *big* benefit over lesser configs, even if those configs have *faster* ram. Because then the speed bottleneck ends up being storage, which is painfully slow. And if you're not into LLMs, the extra ram ends up being rather useful as cache, speeding things up.",
                "author": "Kiseido"
            },
            {
                "raw_content": "Even though I'm hyped for them, it feels like such a niche. Who this isn't for? - Apple fans are always going to buy Apple as they're locked into the ecosystem - Casual users will care less about GPU perf and could buy several cheaper Mini PC's - SFF fans will build their 7-10L cases with better GPU's - People who travel still likely want a screen (e.g. Z13) Who will this be for? - Casual AI users - Steam box replacement where space is issue - Home Lab with 5GBps + rack - Dev's who do mixed WFH/WFO with BYOD - LAN machine If they'd managed to put OcuLink on it, I'd have been damn tempted to get mine as a replacement desktop and use an eGPU. Simplify my overall setup to two devices: Laptop for travel and SFF for work, console gaming & car sim. It's interesting as Intel seemed to try fill some of this market with their Skull Canyon but it never seemed to take off. Price point was terrible for me. As AI matures, and corporations are concerned about sharing IP via subscription services, having a local AI agent running on locally could be very enticing. Also some cost savings there, $20USD/month for Copilot, over 2 years is $480 minus electricity costs. Not quite fair comparison but just spitballing. In saying that, they've sold quite a few batches already, so clearly there's a demand. Really I'd love Framework to build a non-shit printer.",
                "author": "mechkbfan"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Driver Lands DCC For Multi-Plane Formats With RDNA4, Tiling For Video Buffers",
        "score": 60,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Basically, AMD Linux drivers continue to be above average, while windows continues to be a relic of the past. I wonder if Microsoft will address the disparity eventually? AMD Linux is probably worth it for a LOT of people, and those people don't even realize how good things could be yet. AMD on Linux often significantly outperforms Nvidia on windows. Sometimes as much as 20-25% (game dependent).",
                "author": "Disguised-Alien-AI"
            },
            {
                "raw_content": "What does this mean?",
                "author": "slither378962"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "26 February 2025 - Daily /r/REBubble Discussion",
        "score": 4,
        "text_content": "What's the word on the street? Share your questions, comments, and concerns below.",
        "comments": [
            {
                "raw_content": "The 2 and 10 are very near again...",
                "author": "4score-7"
            },
            {
                "raw_content": "Miss on new home sales of 657k. Expected 671k.",
                "author": "SpaceyEngineer"
            },
            {
                "raw_content": "What's happening in the DC housing market given all of the recent news?",
                "author": "Fiveby21"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Median sales price of new homes increases to $446,300, +3.7% from a year ago",
        "score": 878,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don't understand this market at all. My family makes good money and we still have a hard time justifying $6k / mo in mortgage/taxes for your average 3BD home in my area. And it's not even a particularly great neighborhood! I look at these prices and it's like $100k+ what they sold for 5 years ago, at double the interest.",
                "author": "Kittypie75"
            },
            {
                "raw_content": "In my area which is about 1 hour away from los angeles, all the 450k houses i was eyeing on have dropped their prices by 20k at least, some by 30k. I am wondering if to go for it or expect prices to fall. I wasnt expecting this type of discounts so quick.",
                "author": "Zeroxx08"
            },
            {
                "raw_content": "FOR RELEASE AT 10:00 AM EST, WEDNESDAY, FEBRUARY 26, 2025 **New Home Sales** Sales of new single-family houses in January 2025 were at a seasonally adjusted annual rate of 657,000, according to estimates released jointly today by the U.S. Census Bureau and the Department of Housing and Urban Development. This is 10.5 percent (±19.9 percent)* below the revised December rate of 734,000 and is 1.1 percent (±15.3 percent)* below the January 2024 estimate of 664,000. **Sales Price** The median sales price of new houses sold in January 2025 was $446,300. The average sales price was $510,000. **For Sale Inventory and Months’ Supply** The seasonally-adjusted estimate of new houses for sale at the end of January was 495,000. This represents a supply of 9.0 months at the current sales rate. https://www.census.gov/construction/nrs/pdf/newressales.pdf",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "New-home sales fell to the lowest level in 3 months, as buyers have grown frustrated with high mortgage rates and high home prices.",
        "score": 139,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">Builders are now sitting on high levels of inventory. The number of finished homes on the market in January was at the highest level since August 2009, in the aftermath of the Great Recession. >Buyers have pulled back from new homes partly due to high prices. Builders have largely held off on cutting prices on their homes, and the median sales price of a new home in January was $446,300. From a buyer’s perspective, buying a resale home is relatively cheaper, as the median sale price was about $396,900 in January, according to the NAR. >New-home prices could come down due to high levels of inventory, Oliver Allen, a senior U.S. economist with Pantheon Macroeconomics, wrote in a note. “The glut of unsold new homes had been pushing down prices,” he wrote, adding that they “expect further slight declines in new-home prices over the next few quarters.” I've been noticing a lot more new builds starting to pop up in my area. Anyone else?",
                "author": "Background_Tune4679"
            },
            {
                "raw_content": "High prices are the whole problem",
                "author": "VendettaKarma"
            },
            {
                "raw_content": "None of us know if we’ll have jobs or be at war in a year.",
                "author": "Hostificus"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Low supply is driving rising prices in the Midwest",
        "score": 21,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yep. The average market time in my Chicago suburb is about 3 weeks. Sold prices were up 10% last year. It's hard for me to get my head around. It's nice here but not particularly special. There are 18,730 residential listings in all of IL (homes, no lots or land). Compare that with 217,557 listings in FL and 167,188 in TX. Of course, FL and TX have more people than IL, but not 10 to 15 times as many.",
                "author": "Pitiful-Place3684"
            },
            {
                "raw_content": "Key Takeaways * The Midwest is seeing some of the nation’s strongest home price and rent growth at this point in the cycle yet remains among the most affordable regions in the US. * A limited supply of new construction and resale homes contributes to the region’s pricing power. * Despite the price growth, Midwest job growth is the slowest of the regions, though specific markets stand out. Home price and rent growth remain solid Some of the strongest price appreciation right now is in the nation’s heartland, with Midwest resale home values up +5% year-over-year (YOY) through January, just below the growth rate in the Northeast. Our proprietary monthly survey of homebuilders confirms more of the same: on average, builders reported +5% YOY growth in new home prices (net of incentives). Resale home values are up YOY: * +7% in Cleveland and St. Louis * +6% in Chicago and Milwaukee * +5% in Indianapolis and Cincinnati * +4% in Columbus, OH For-sale housing is not the only market experiencing price growth. Our Single-Family Rent Index™ shows YOY changes in single-family rents of +5% to +7% in the largest Midwest markets. The Midwest apartment market is the strongest region in the nation now, according to JBREC’s multifamily housing expert Chris Nebenzahl. Rent growth has been steady by historical standards, with most markets growing between +2% and +3% on an annual rent growth basis, and occupancies are holding strong, too. Low supply drives the Midwest’s pricing power * In the resale market, the Midwest’s 1.9 months of homes available for sale is well below the national average. This measure of relative supply is rising rapidly in other parts of the country, such as Texas and Florida. * In the new home market, homebuilders report 1.5 unsold, finished new homes per community for January 2025, an increase from 1 year ago but significantly lower than the 2.7 homes nationwide. New construction is rising again, with single-family permits across core Midwest metro areas rising +12% YOY. New multifamily supply remains limited. Resale listings in key Midwest markets were still -44% lower in January 2025 than in January 2019, which was a more normal year for resale supply. The Midwest is not without its challenges Job growth remains the slowest in the country, rising at +0.5% YOY on average for key Midwest markets. High-income jobs—which we can correlate to new home demand—are falling. Indianapolis remains the standout here, where +2.4% YOY growth is among the strongest large markets in the country. On a positive note, we are beginning to see sales activity—for new and resale homes—start to bottom out. Resale sales closing activity in the Midwest region is positive YOY for the first time since mid-2022, and new home sale closings are not far from seeing positive growth, too. Conclusions The Midwest is popping up on our radar more frequently as the low-supply environment and current pricing power presents plenty of opportunity. Even so, within the region, there is a wide range of market performance—the for-sale market appears stronger in Indianapolis and Chicago, more normal in Minneapolis and Columbus, OH, and slower in Cleveland, St. Louis, and Kansas City.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "desperate",
                "author": "sifl1202"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "88% of homeowners have fears about selling their homes",
        "score": 224,
        "text_content": "* The most concerning scenario, which 85% of homeowners fear, is that they will feel pressured to accept a lowball offer on their property. * Preparing their homes for sale is what homeowners see as the single most difficult part of selling, with 1 in 5 (20%) saying so. * A majority of homeowners (58%) worry a home inspection carried out as part of the sale will reveal problems with their property. * More than 1 in 8 homeowners (13%) say there’s nothing that would make them feel confident about selling their homes. [https://listwithclever.com/research/why-is-selling-a-home-so-stressful](https://listwithclever.com/research/why-is-selling-a-home-so-stressful/?utm_source=reddit&utm_medium=reddit&utm_campaign=selling_stress)",
        "comments": [
            {
                "raw_content": "I.e. most homeowners are sitting on garbage, thinking it's gold.",
                "author": "Stabbysavi"
            },
            {
                "raw_content": "Help! I can’t sell my house because there’s so many things that need to get fixed and neglected for 10 years!",
                "author": "ClusterFugazi"
            },
            {
                "raw_content": "Who could’ve seen this coming when the market was red hot and people were waiving inspections and bidding $80,000 over asking?!",
                "author": "OnlineParacosm"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "US new home sales tumble; median house price highest since 2022",
        "score": 89,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“New housing inventory at highest level since late 2007” Gonna take you high-er 🎶",
                "author": "ChadsworthRothschild"
            },
            {
                "raw_content": "Hmmmm ... could these two things be somehow connected?",
                "author": "anaheimhots"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage rates drop to lowest since mid-December, but demand still falls short",
        "score": 140,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The lowest in 9 weeks, you say?",
                "author": "Happy_Confection90"
            },
            {
                "raw_content": "Umm - 5 hundredths of a percent is hardly a 'drop'",
                "author": "oldcreaker"
            },
            {
                "raw_content": "It not rates, it is prices.",
                "author": "NRG1975"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Home Depot exec says Americans may soon embrace sky-high mortgage rates as 'the new normal' and invest in housing anyway",
        "score": 116,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hahaha. Maybe. Maybe people will sprout money bushes out of their asses to be able to afford it.",
                "author": "Dry-Interaction-1246"
            },
            {
                "raw_content": "Let’s be honest. America people won’t be investing. American and international companies will. American people will just be renters.",
                "author": "Kazoo113"
            },
            {
                "raw_content": "Considering the market will be stagnant for decades because nobody can afford to leave their 2% mortgage… I’m sure raising the rates as inflation goes through the roof will definitely help.",
                "author": "Successful-Winter237"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "4.5 billion years of earth and we get to see the sliver when digital intelligence is born. Pretty damn wild tbh",
        "score": 333,
        "text_content": "Feels a bit surreal.",
        "comments": [
            {
                "raw_content": "Welcone to the \"birth of AI \" exhibit in the human museum. Humans are thought to be the progenitors of our species and here you can walk around and feel what it must have been like to be made out of meat and watching the birth of their eventual successor. Us! You may chat with the characters exhibit, and all the humans will behave exactly as a real 21st century human would have done. Notice their perception of time and space as distinct. See how they struggle against each other. Even though they are individually only 0.0000001% as smart as a common starherder, and appear dull try asking one about politics or sexual activities and see how animated and motivated they become. It's amazing to think that these creatures made our primitive forebears.",
                "author": "this-guy-"
            },
            {
                "raw_content": "Last thursdayism, there's no guarantee the past happened and the simulation didn't boot into this moment.",
                "author": "salacious_sonogram"
            },
            {
                "raw_content": "curious innit",
                "author": "hardleft121"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Tomorrow will be interesting",
        "score": 523,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Bro tomorrow monster hunter releases. Stay in your lane altman",
                "author": "porcelainfog"
            },
            {
                "raw_content": "Place your bet! Place your bet!",
                "author": "Salty_Flow7358"
            },
            {
                "raw_content": "If it’s not coming to plus I at least hope they show something shockingly impressive",
                "author": "socoolandawesome"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Remember this when you think of UBI.",
        "score": 117,
        "text_content": "The rich are not in the habit of giving up their wealth. They will be working out the best way to make money from AI.",
        "comments": [
            {
                "raw_content": "r/USdefaultism",
                "author": "Roubbes"
            },
            {
                "raw_content": "UBI is likely not happening during this administration, which is why we need a hard takeoff",
                "author": "governedbycitizens"
            },
            {
                "raw_content": "People here want to believe some fantasy that the people at the forefront will gift them UBI, or that history will magically produce it for them. Reality is that if it does come about, it'll likely to have to be fought for with a lot of normal people getting their hands bloody.",
                "author": "R6_Goddess"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI: \"Our models are on the cusp of being able to meaningfully help novices create known biological threats.\"",
        "score": 655,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This aligns with Sam Altman's words in the Tokyo interview: > \"We strongly expect that we'll start seeing new emergent biology,algorithms,proofs etc. at somewhere around gpt-5.5~ish levels\"",
                "author": "GOD-SLAYER-69420Z"
            },
            {
                "raw_content": "https://preview.redd.it/zh4d41995jle1.jpeg?width=605&format=pjpg&auto=webp&s=7238635f2ca4fb5ee6747392e2e54e324c3c1e27",
                "author": "Relative_Issue_9111"
            },
            {
                "raw_content": "Accele…. wait",
                "author": "The-AI-Crackhead"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Claude Plays Pokemon realizes it's stuck in a loop, uses an Escape Rope",
        "score": 133,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Proud of Claude",
                "author": "Abgeledert"
            },
            {
                "raw_content": "Sadly I think the stream is a liiiittle bit less impressive with the nonstop hints they feed the AI. They've had to explicitly tell it which way to go in any open area. Still impressive of course, but I gotta be honest and say I'm a little disappointed and wish they'd prompted it a little better and let it figure it out by itself...",
                "author": "unknown_as_captain"
            },
            {
                "raw_content": "Given hints or not, this is impressive. Being able to see a loop of a ladder and realizing they were not ready to progress, then use an item to escape is really awesome. Clearly humans would not think that hard on such a thing (unless its a person who has never seen a gameboy). I think once we are able to implement longer memories into these AI then things are really going to pop off.",
                "author": "Bishopkilljoy"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Shanghai robot factory where humanoid robots are now in mass production. These \"future workers\" can handle tasks in areas ranging from sales to heavy-load transport",
        "score": 1188,
        "text_content": "https://english.news.cn/20250226/4bf8c1c0d58142a8acfbd5261e1f8b54/c.html",
        "comments": [
            {
                "raw_content": "What’s the battery life on these mechs",
                "author": "Idunwantyourgarbage"
            },
            {
                "raw_content": "Why do they look like they’re about to leave those backpacks in a crowded place and then be the focus of a nationwide manhunt a few hours later?",
                "author": "Davidsbund"
            },
            {
                "raw_content": "How the heck are they gonna do sales?",
                "author": "reddit_guy666"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Introducing Elicit Reports a research engine that real PhDs rank higher than OpenAI's Deep Research and is free",
        "score": 81,
        "text_content": "[https://blog.elicit.com/introducing-elicit-reports/](https://blog.elicit.com/introducing-elicit-reports/) https://reddit.com/link/1iz6g0o/video/4ch97xjiplle1/player https://preview.redd.it/j694wjejplle1.png?width=679&format=png&auto=webp&s=32f0150bf1d51544fc9e0fc0560a4790ebbd1a2d",
        "comments": [
            {
                "raw_content": "no moat. Great for us",
                "author": "ZealousidealBus9271"
            },
            {
                "raw_content": "https://preview.redd.it/oe95ukpwplle1.png?width=1000&format=png&auto=webp&s=b062f45b6f9991dfbd35f77b776e7762094754d6",
                "author": "pigeon57434"
            },
            {
                "raw_content": "This is great! It's designed explicitly for formal research (it will actually prevent you from submitting a query that does not relate to formal research), so it's not really an apples-to-apples comparison, but I think it'll be a boon for professional researchers.",
                "author": "External-Confusion72"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Researchers trained LLMs to master strategic social deduction",
        "score": 325,
        "text_content": "",
        "comments": [
            {
                "raw_content": "training a model on a game that requires you to be maximaly manipulative and deceptive, what could go wrong",
                "author": "Healthy_Razzmatazz38"
            },
            {
                "raw_content": "When the impostor is... RWKV? https://i.redd.it/eb65946a7jle1.gif",
                "author": "Relative_Issue_9111"
            },
            {
                "raw_content": "Paper: [https://www.alphaxiv.org/abs/2502.06060](https://www.alphaxiv.org/abs/2502.06060) Abstract: \"Communicating in natural language is a powerful tool in multi-agent settings, as it enables independent agents to share information in partially observable settings and allows zero-shot coordination with humans. However, most prior works are limited as they either rely on training with large amounts of human demonstrations or lack the ability to generate natural and useful communication strategies. In this work, we train language models to have productive discussions about their environment in natural language without any human demonstrations. We decompose the communication problem into listening and speaking. Our key idea is to leverage the agent’s goal to predict useful information about the world as a dense reward signal that guides communication. Specifically, we improve a model’s listening skills by training them to predict in- formation about the environment based on discussions, and we simultaneously improve a model’s speaking skills with multi-agent reinforcement learning by rewarding messages based on their in- fluence on other agents. To investigate the role and necessity of communication in complex social settings, we study an embodied social deduction game based on Among Us, where the key question to answer is the identity of an adversarial imposter. We analyze emergent behaviors due to our technique, such as accusing suspects and providing evidence, and find that it enables strong discussions, doubling the win rates compared to standard RL. We release our code and models at https://socialdeductionllm.github.io\"",
                "author": "MetaKnowing"
            }
        ],
        "subreddit": "singularity"
    }
]