[
    {
        "post_name": "Islamic Republic close to collapse in Iran, civil war possible after US, Israeli decimation of nuclear capabilities: experts",
        "score": 729,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Straight up propaganda. BiBi is still trying to save face because Trump told him \"No , we will not invade Iran for you\".",
                "author": "RationalThought"
            },
            {
                "raw_content": "Great, all the refugees can go to fucking Israel.",
                "author": "stillbringingitback"
            },
            {
                "raw_content": "Put the Shah back in there and ban hijabs.",
                "author": "NYforTrump"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "HUGE. HUD to require proof of U.S. citizenship to receive section 8 housing benefits.",
        "score": 959,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Call me crazy, but I would've expected that this was already a thing they would check.",
                "author": "Kendoextendo"
            },
            {
                "raw_content": "Section 8 also needs expiration. There are generations that are entirely on s8 and snap",
                "author": "PapaPepe"
            },
            {
                "raw_content": "Good.. I'm reporting the 300+ apartment complex where my mother lives. The number of hijab wearing inbreds where she lives has increased dramatically the last few years. The whole fucking place is getting reported.",
                "author": "KE948_U2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The momentum is clear — America is shifting RED.",
        "score": 700,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We'll see in the mid-terms about all this won't we.",
                "author": "MemphisMontoya71"
            },
            {
                "raw_content": "Nice but don't get cocky. Talk to friends at this weekend's get-togethers about getting everybody to the polls. It will take some determination and mutual help.",
                "author": "LaptopDied"
            },
            {
                "raw_content": "So what about all the alarm from Scott Pressler this morning?",
                "author": "bleeje"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Chicago Mayor Brandon Johnson signs executive order to limit Chicago authorities from working with federal law enforcement and to try to stop Trump from sending the national guard",
        "score": 495,
        "text_content": "",
        "comments": [
            {
                "raw_content": "dude is retarded",
                "author": "T471"
            },
            {
                "raw_content": "How hasn't anyone attempted a recall yet?",
                "author": "bananafone"
            },
            {
                "raw_content": "Look at all those affirmative action hires in that office, LOL. That's why it's called Chicongo.",
                "author": "knnbccb"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Gen Mike Flynn: Shut the entire FEDERAL RESERVE down. No longer allow it to \"FIX\" our financial system. It is neither FEDERAL, nor is it a RESERVE.",
        "score": 618,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Add abolish the IRS and start the ERS to fund government. MAGA AF",
                "author": "Mulletgunning"
            },
            {
                "raw_content": "We don’t need to create money as DEBT!! We COULD just create it.",
                "author": "Texar1991"
            },
            {
                "raw_content": "That's what is in motion. Trump's using crypto-currency, a CBDC ban, and encouraging a stable coin economy to undermine the Fed and make it irrelevant. If you are anti-crypto, then you are pro-fed.",
                "author": "tuaris"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Donald Trump banning mail in ballots?",
        "score": 862,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Congress is 100% worthless. Trump has to do everything via EO.",
                "author": "2000mules2000arrests"
            },
            {
                "raw_content": "The Civil War wasn't even the end of the Democrat party. They'll live to cheat another day.",
                "author": "FromTheTopRope"
            },
            {
                "raw_content": "The Judges are waking up to strike this one down because it racists or some other BS they will make, but it will always backfire onto them. This is basically most people's first or second most important thing on their list.",
                "author": "DT170x"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "What age is targeted here?",
        "score": 825,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Age doesn't matter, it's wasted ad dollars: Goats can't read.",
                "author": "IllIllIll"
            },
            {
                "raw_content": "A FUCKING MILLION?? IN LONDON?!?!?",
                "author": "hackinthebox"
            },
            {
                "raw_content": "Muzz sounds like a slur lol.",
                "author": "LaPastillaEscarlata"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Left",
        "score": 880,
        "text_content": "",
        "comments": [
            {
                "raw_content": "kek",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "They'll still want to ban White men.",
                "author": "UMAthemovement"
            },
            {
                "raw_content": "Whatever interpretation that gives them the most powerful is always the answer",
                "author": "Formerlurker92"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🤔",
        "score": 692,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://patriots.win/p/19BtUYAkg1/no-clear-motive-starter-pack/c/ 🤔",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Reopening asylums would help.",
                "author": "shadowbanana"
            },
            {
                "raw_content": "\"Love is Love\"",
                "author": "schnazzmizzle"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Why?",
        "score": 1306,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Or when Luigi Mangione blasted that United Healthcare CEO",
                "author": "PunchbowlTurd"
            },
            {
                "raw_content": "Are you fuckin kiddin me? They called for more gun violence because they missed",
                "author": "Colorado-Living"
            },
            {
                "raw_content": "Also, they only called for gun bans when these Christians were shot, in order to change the subject away from the mentally ill leftist tranny faggot freak who shot them.",
                "author": "Tigger_Lovin_Pooh"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "No more rainbow brick road.",
        "score": 747,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Um... call me dumb but is painting over them not a quicker, less expensive option?",
                "author": "Mcrumples"
            },
            {
                "raw_content": "Why didn't they just pressure wash it?",
                "author": "EDDIT_IS_CUCKED"
            },
            {
                "raw_content": "Could have just used a power washer.",
                "author": "MoreVanceMemes"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "How much money did Bernie Sanders get from Pharma?",
        "score": 1219,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Bernie needs to live out his remaining days in a gulag. The only good commie is a _ _ _ _ commie",
                "author": "Deadpool"
            },
            {
                "raw_content": "Quite honestly communist we're done with your kind of science. Take your vaccines and shove them up your bum hole.",
                "author": "JayKay1776"
            },
            {
                "raw_content": "# The best part about being a conspiracy theorist is no myocarditis.",
                "author": "tpactionchasethevote"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Nayib Bukele: 1,000 days without homicides",
        "score": 1122,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Proof that if you lock up ALL the criminals we can have a civil society.",
                "author": "Deadpool"
            },
            {
                "raw_content": "Here it is in American: 1,000 days without homicides I was advised to host a national broadcast and give a speech to commemorate this historic milestone: 1,000 days without homicides since the beginning of our administration. But I think instead of speeches, it's best for us to reflect today on what our country has experienced and on all the forces that tried to prevent us from getting this far. Those who always say \"impossible!\" ignore the power of asking God for wisdom and accepting to be His instruments. Thank you, God! Without your will, NOTHING is possible. Thanks also to the best Security Cabinet our country has ever had and to the thousands of men and women of our National Civil Police and our Armed Forces, who risked their lives so that we can finally live in true PEACE.",
                "author": "LLP2"
            },
            {
                "raw_content": "I love Bukele but how is 1000 days without a murder even remotely possible? That's almost 3 years. Edit: \"this includes non-consecutive days and excludes gang member deaths in security operations\" That explains it better. I had assumed he meant 1000 days in a row which would have been insane.",
                "author": "victory2024"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🦄 California to Provide Kamala Harris with Security 🛡️",
        "score": 633,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"My house burned down, and it'll take years to get the charity money and permits to rebuild, but at least my tax dollars have been committed to Kamala in less than a week.\"",
                "author": "KuzoKevin"
            },
            {
                "raw_content": "Surprise! Californians get fucked yet again. 💩🚽",
                "author": "MythArcana"
            },
            {
                "raw_content": "Waste of money. No one, and I mean NO ONE, gives a shit about Kumula any more, let alone enough of a shit to do her harm. EDIT: Except maybe those 1000 or so people she put away for minor weed offenses. Forgot about them.",
                "author": "2016TrumpMAGA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Liberal get triggered by a handsome conservative wearing a shirt with Punisher Skull American Flag in support of Trump while wearing his “Fund Abortion” T-shirt.",
        "score": 548,
        "text_content": "",
        "comments": [
            {
                "raw_content": "what a fucking faggot",
                "author": "SimplyRedPills"
            },
            {
                "raw_content": "He has more diseases than there are letters on his shirt.",
                "author": "LaPastillaEscarlata"
            },
            {
                "raw_content": "Gay boy mad his dream man is actually a MAGA Conservative.",
                "author": "HowardsBaldHead"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The White House : President Trump is back, and so is MORE money in your pocket. Wages are SKYROCKETING, and American workers are winning BIG! 💸",
        "score": 969,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Energy bills are also doubling, because of the massive data centers that are quietly being built in towns all across America due to the $500 billion deal Trump did with Peter Thiel on day 1. Remember? Project Stargate? It’s your build MASSIVE data centers all over, for AI. And these require massive amounts of power. And so they are taking from the public power grid, and passing the costs onto the tex layer and consumer. Look into it. I have not seen wages rise at ALL in my midwestern town- but I have seen my electric and gas bills shoot way the fuck up for no reason on my part. MAGA is ignoring the Data Centers and AI shit that Trump is pushing through.",
                "author": "SaltyTitties4"
            },
            {
                "raw_content": "I like everything you are doing Trump, but I don't have more money, my taxes are still high, my groceries are still high, and gas is still high. I am a patient man, and honestly I could live with it all as long as he ships back all the illegals and visa street shitting hordes.",
                "author": "invalid_data"
            },
            {
                "raw_content": "Where are these wages, sir? Where Im at were still behind from all the inflation and prices haven't gone down.",
                "author": "IslandMan69"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 Newsom says the quiet part out loud: “Do you think ICE is not gonna show up around voting and polling booths to chill participation? You know that!” He just admitted that Democrats bank on illegal aliens voting in elections.",
        "score": 1523,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yeah we have body scanners to get on an airplane. Schools with metal detectors. You can’t even bring a cell phone into some federal buildings. Why can’t we have a guy who checks your citizenship to fucking vote?",
                "author": "lefty295"
            },
            {
                "raw_content": "For some reason Miami/Dade county is reporting 13,000 fewer students in its' schools this year. Can anyone think of a reason that might be.....? I voted for this.",
                "author": "phibetared"
            },
            {
                "raw_content": "Honestly, I don’t think many illegals vote in person, I think they fill out a bunch of ballots and stuff them. I’m waiting for Trump to return us to sanity- one day, ID, paper ballots, ENGLISH ONLY.",
                "author": "Pickles76"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BET co-founder backs GOP nominee Winsome Earle-Sears for VA governor with massive donation after woke racist sign incident",
        "score": 1086,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This dude has been a conservative and conservative donor for quite some time.",
                "author": "Yignuced"
            },
            {
                "raw_content": "B.E.T shouldn't exist.",
                "author": "Covfefe_And_Justice"
            },
            {
                "raw_content": "So blacks can support candidates because of their race but when whites do it, it’s “racist”?",
                "author": "SurfandTurf"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: Now, the SUPREME COURT might be forced into stopping Democrat Fed Governor Lisa Cook from attending the upcoming Fed",
        "score": 1072,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lisa Crook",
                "author": "AnnieMm"
            },
            {
                "raw_content": "If any of us did what she did, we would be in jail already Same with lard ass Tish and Schitt",
                "author": "Sea_Still"
            },
            {
                "raw_content": "Why is the Supreme Court of the United States needed to keep a fat dumb bitch from acting as if she wasn’t fired?!",
                "author": "Easzq8"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump To REMOVE All Illegal Allen’s From Section 8! (It’s About Friggen Time….)",
        "score": 464,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Remove Section 8 period",
                "author": "TrumpWonByALandslide"
            },
            {
                "raw_content": "Remove the blacks. Welfare was meant to be temporary relief not a free ride that continues for generations.",
                "author": "JoeMcCarthyWasRight"
            },
            {
                "raw_content": "He needs to kick off any immigrant the Ethiopians the Venezuelans all of them legal or illegal you shouldn't be coming here to be put on housing.",
                "author": "JayKay1776"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Nvidia says two mystery customers accounted for 39% of Q2 revenue",
        "score": 199,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Mystery at that percentage? Lol",
                "author": "dkizzy"
            },
            {
                "raw_content": "Melon Husk and Zark Muckerberg",
                "author": "_extruded"
            },
            {
                "raw_content": "Elon and _____ ? (im guessing thiel or altman)",
                "author": "Andr0id_Paran0id"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "(LTT, Switch 2 USB C compatibility) Nintendo's Greed could Infect the Tech Industry",
        "score": 341,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The device they used to read the communication between the switch and dock was pretty cool.",
                "author": "Axisl"
            },
            {
                "raw_content": "usb consortium can fix this with a spec. they should say implementers shall not reimplement existing usb features. IE. since display over usb-c is already an existing spec, vendors are not allowed to reimplement it a non-standard way. and for those of you who say, \"but display over usb-c isn't a spec\", then usb consortium can fix that too! there is clearly a defacto spec that everybody else is using. apple has a similar rule for their appstore. this prevents companies to reimplementing existing ios features with a paywall",
                "author": "Pyrolistical"
            },
            {
                "raw_content": "Switch 1 pulled the same horseshit, so I'm far from surprised. Nintendo gonna Nintendo 🤷‍♂️ At this point if you buy their hardware you know what you're getting into. They far went past being worth it putting up with their bullshit to play their games for me years ago, up to you and you alone when/if you get to that point to just stop buying their shit.",
                "author": "Logical-Database4510"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "ANTGAMER teases 1000Hz monitor with 2026 release plans",
        "score": 93,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">Now, the fastest screens are becoming too fast to be maxed out by today’s CPUs and GPUs. That said, this is where Nvidia’s Multi-Frame Generation tech can step in to deliver higher levels of gaming fluidity. Ah yes, E-Sport players are totally going to turn on frame gen.",
                "author": "BlueGoliath"
            },
            {
                "raw_content": "You're looking forward to ever higher refresh rates for the motion clarity and BFI/CRT shader ratio benefits, I'm looking forward to it because it's the only obvious solution to OLED VRR flicker on the horizon (side-stepping VRR altogether by making it obsolete with raw refresh rate).",
                "author": "rubiconlexicon"
            },
            {
                "raw_content": "Geez….I used to meme people that bragged about their high refresh monitor by exaggerating the refresh rate….now it’s an actual thing.",
                "author": "AgentUnknown821"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Three months since it was released - Why are there still no reviews of Thermalright's new flagship CPU air cooler, Royal Pretor 130 Ultra?",
        "score": 101,
        "text_content": "Does anyone know why tech YouTubers and tech news websites still have not made any reviews of the Thermalright Royal Pretor 130 Ultra? It is their new flagship and has been available for purchase for three months now. According to Thermalright themselves, it performs better than their previous flagship, the Phantom Spirit 120, but without any thorough reviews, it is hard to confirm.",
        "comments": [
            {
                "raw_content": "\"Oh, there's a new Thermalright flagship cooler?\" Probably the reaction of every content creator learning that Thermalright did that. Interesting. Have you seen stuff like Thermalright's sections at Computex 2025 & 2024? They've probably got over a hundred CPU coolers on the market now. It's insane, and incredibly hard to keep up with. People are still buying Peerless Assassin 120 because it's still a beast.",
                "author": "DiatomicCanadian"
            },
            {
                "raw_content": "Can you even buy it yet from an official distribution? Newegg doesn't have it, neither does amazon. Aliexpress seems to have it, but well, it's Aliexpress. It just seems it didn't have a global release yet.",
                "author": "kaszak696"
            },
            {
                "raw_content": "Thermalright really needs to sort its stack out. The AIO and cooler lists of products is enormous and its really hard to work out what the differences are. Its just adding a bunch of confusion they need to trim the product lines down.",
                "author": "BrightCandle"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Branch Education] How does EUV Lithography Work? Inside the Most Advanced Machine Ever Made",
        "score": 79,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Absolute banger. ASML actually sponsored the video too",
                "author": "Earthborn92"
            },
            {
                "raw_content": "Generating UV light by creating plasma with a laser in a droplet of tin moving at 100 m/s is crazy. > Any sufficiently advanced technology is indistinguishable from magic",
                "author": "Eremita_Urbano_1655"
            },
            {
                "raw_content": "China be like : WRITE THAT DOWN!! WRITE THAT DOWN... Seriously who needs corporate espionage when you got videos like that",
                "author": "No_Hornet_1227"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[SomeTechGuy] WD Ultrastar vs Red Pro 18TB - Which should you buy?",
        "score": 2,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Condor’s Cuzco RISC-V Core at Hot Chips 2025",
        "score": 19,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nice to see RVA23, but that TRM scheduler is a bold idea for a general purpose CPU. I could see it working out well for highly optimized kernels with a small working set, but the moment you start chasing pointers or streaming out of cache, half your instructions are going to be mispredicted and need replay. If they can improve that 7% replay rate, it could be something. But it's looking like a first prototype that might need a little more time to cook..",
                "author": "tux-lpi"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Star Wars Outlaws isn't Great on Switch 2",
        "score": 183,
        "text_content": "GVG got to try out Star Wars Outlaws at PAX West 2025 and unfortunately it's not looking great...",
        "comments": [
            {
                "raw_content": "Shocker",
                "author": "levitikush"
            },
            {
                "raw_content": "That's not surprising considering that the game has RTGI, so all the lighting is handled by RT, and Switch 2's RT capabilities are very lacking",
                "author": "s7ealth"
            },
            {
                "raw_content": "I hear it's not great when it's running on something else too.",
                "author": "Williekins"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Ni no Kuni: Wrath of the White Witch on sale",
        "score": 94,
        "text_content": "For those of you who have never played, this is a fantastic RPG. Really like able characters and a charming world. The cutscenes are animated by Studio Ghibli too!",
        "comments": [
            {
                "raw_content": "I could never get into it. I love the second one tho.",
                "author": "myshon"
            },
            {
                "raw_content": "10/10 game for sure",
                "author": "blckhead423"
            },
            {
                "raw_content": "What's the difference between this and the Remastered version on steam.",
                "author": "TheCrach"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Story of Seasons Grand Bazar comes with a booklet.",
        "score": 137,
        "text_content": "Has been so long since I've seen one.",
        "comments": [
            {
                "raw_content": "Rune factory did too!",
                "author": "TransThrowaway120"
            },
            {
                "raw_content": "Well that might be the push I needed",
                "author": "0scar_Goldmann"
            },
            {
                "raw_content": "I’m pretty sure all the Story of Seasons games do. Rune Factory as well.",
                "author": "JetstreamGW"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Elden Ring Switch 2 portable mode: Judge for yourself!",
        "score": 79,
        "text_content": "Well thats it boys",
        "comments": [
            {
                "raw_content": "dust and fog part really bad fps .... I don't want to imagine what will happen later when the big magic and other graphic effects start ... oh dear oh dear",
                "author": "seppe0815"
            },
            {
                "raw_content": "Can’t tell anything from this video other than game looks really nice - but impossible to tell framerate.",
                "author": "ShotAcanthocephala8"
            },
            {
                "raw_content": "Looks fine and perfectly playable",
                "author": "quantaeterna"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "So, how come no one talks about how Chibi Robo is the Dark Souls of the friendly robot cleaning up and making people happy genre?",
        "score": 76,
        "text_content": "Seriously though, this game is really fun. I'd never played it and thought I'd just load it up on NSO and check out the beginning to see quite what it is (cause as the title of this topic probably tells you, it defies easy description), but I'm finding it a hell of a lot of fun! And what an incredibly curious and unique little game it is. Whether it's commiserating with Mrs Sanderson over tea, matchmaking between a dog's chewtoy and a planetary defence mechsuit guy, or simply using a toothbrush to clean up dirty paw prints, I don't think I've ever played anything quite like it. Particularly in how it's structured, which so far, in my opinion, has been astonishingly clever. One thing, though, that's really making me appreciate an aspect of modern game design we probably all take for granted today, is the slow text speed and inability to hurry through it. Like, really, I do not need 10 seconds to read half a dozen words. Overall, though, this is a 'hidden gem' that's actually living up to its reputation for me so far.",
        "comments": [
            {
                "raw_content": "I think the only thing I wish was different was asking to save every time I charge at a plug. Really unnecessary.",
                "author": "newcanadianjuice"
            },
            {
                "raw_content": "I did the same. I started it up to check it out. 4 hours later I went to bed wanting to know what happened next in the story. Its kinda a wild story. It felt like katamari mixed with metroid, and then mixed with toy story. I finished it last night and I have a few complaints. The first is the same as you. It takes so long to get through dialogue. My second complaint is that it repeats dialogue alot when you wake up in the chibi house, and it asks if you want to save every time you charge. Other than that I actually enjoyed the game lol",
                "author": "willzor7"
            },
            {
                "raw_content": "Just started it an hour ago but found the cutscenes unskippable and couldn’t accelerate the text… after hearing how much fun you are having, I’ll give it another go",
                "author": "Shleepy1"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Some 3rd party games are cheaper on the Eshop",
        "score": 10,
        "text_content": "…in Australia at least. I’ve seen it since launch, where a bunch of 3rd party games are 10-30 dollars cheaper on the eshop than physically. An example would be Bravely Default that would be 54.99 on the eshop and 60 in the store. Thats a small discount, so an even larger one would be Story of Seasons being 89 on the eshop and 110 in store. Some other games have also had price differences. Australia has never truly had consistent pricing but they do tend to be consistent from storefront to storefront, so I’m surprised to see these price differences. Do you think this is the start of the digital being cheaper than physical? IMO I’d say this is just another way to incentivise people to go digital.",
        "comments": [
            {
                "raw_content": "Games should be way cheaper on the eshop, it completely eliminates manufacturing and distribution costs, and you don’t actually “own” the game (I know you don’t “own” physical media either but I say that for simplicity’s sake). I’m more surprised that more games DON’T have a price difference between physical/digital.",
                "author": "Imaginary_Egg_3282"
            },
            {
                "raw_content": "Then you have this: * au$93 - https://ec.nintendo.com/AU/en/bundles/70070000027363 * au$80 - https://www.ebgames.com.au/product/nintendo-switch-2/325329-street-fighter-6-year-1-2-fighters-edition I think the lesson is that if you are price sensitive and format agnostic then you have to look around.",
                "author": "orlec"
            },
            {
                "raw_content": "The most wild example is Stardew Valley, imho. $16 on the eShop, $70 physical. I get that it costs more to publish physical games but $70 is first party pricing. EDIT: Not Switch 2 obviously. 😂 But that said I've found the Zelda S2 edition games new for $80 each vs $110 full price digital.",
                "author": "crocicorn"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The switch 2 expansion of Kirby and the forgotten land is fantastic",
        "score": 112,
        "text_content": "The best mouth trasforms and best level designs in the entire game. The better frame rate is nice too. The only issue is that there's just not enough of it but overall for $20 I think I'm getting $20 worth of fun from it and Kirby has decent replay value.",
        "comments": [
            {
                "raw_content": "Calling the levels remixes also doesn't do the levels justice too. They were REALLY fun to play. The new arena is brutally difficult too. Still haven't managed to get through it yet.",
                "author": "Twinkiman"
            },
            {
                "raw_content": "This game is so great I bought a switch 2 today JUST TO PLAY KIRBY DLC. \"Kirby is a baby game\" You have no idea what star roads and boss fights will do to a mother fucker.",
                "author": "Plane_Finger_4126"
            },
            {
                "raw_content": "Great music, and fun remixed levels, the dlc boss I cheesed with morpho sword just like the other final boss. It’s pretty short (3-5 hrs), buts lots of polish. And there’s another Colosseum… idk if I have the muscle memory for all those bosses again lol [Ultimate Cup Z Ex]>!Yea no man, it’s beefier bosses, the 12th fight is 2 phases of the DLC boss, PLUS a 13th fight with 2 new phases of Chaos Elfilis. Only can get a few hits every 15 seconds kinda annoying!< As for Nintendo Paid DLC I rank it. * Xenoblade DLC * Splatoon DLC * Kirby DLC * BotW dlc = Pokemon SV dlc",
                "author": "animepig"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Billbil-Kun: Hollow Knight Silksong price is $19.99",
        "score": 801,
        "text_content": "[https://www.dealabs.com/magazine/hollow-knight-silksong-on-vous-devoile-le-prix-de-sa-version-pc-60443](https://www.dealabs.com/magazine/hollow-knight-silksong-on-vous-devoile-le-prix-de-sa-version-pc-60443) The prices are for the Steam version (PC). |Region|Price| |:-|:-| |Europe|€19.50| |United States|$19.99| |United Kingdom|£16.75| |Canada|$25.99| |Australia|$29.50| |New Zealand|$28.99|",
        "comments": [
            {
                "raw_content": "really great to see they’ll stay consistent and a rare sight to see these days in gaming 5 DAYS REMAIN",
                "author": "chopsfps"
            },
            {
                "raw_content": "That's a hell of a deal",
                "author": "A_Uniqueusername444"
            },
            {
                "raw_content": "That UK price holy shit what the fuck. Guess I can afford a couple of extra coffees this month!",
                "author": "Kyomukai"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Battlefield 6 Operation Firestorm Gameplay on YouTube",
        "score": 189,
        "text_content": "[https://www.youtube.com/watch?v=CSkuU8Wq2UQ](https://www.youtube.com/watch?v=CSkuU8Wq2UQ) Edit: Another one [https://www.youtube.com/watch?v=5pPlLoYjxTo](https://www.youtube.com/watch?v=5pPlLoYjxTo)",
        "comments": [
            {
                "raw_content": "I just hope Strike at Karkand will return in this game.",
                "author": "ThemosttrustedFries"
            },
            {
                "raw_content": "Cannot wait for this game man",
                "author": "ChimmyMama"
            },
            {
                "raw_content": "Wow that Chinese radio VO is excellent. I wish there was a setting that would allow authentic languages for each map. I don't necessarily want my Egyptian squad to be speaking English.",
                "author": "According_Loss_1768"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Arc Pro B50 spotted on Geekbench, 16.5% to 19% slower than B570",
        "score": 90,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not surprising It has 16Xe Cores (equivalent to 32CU/SM) 14Gbps GDDR6 memory ~2.3Ghz core clocks B580 has: 20Xe cores 19Gbps memory 2850mhz core clocks",
                "author": "SherbertExisting3509"
            },
            {
                "raw_content": "This is a workstation card. Its drivers won't be optimized for games -- they will be tuned for things like Autodesk Maya and AI. This rumor is totally immaterial.",
                "author": "Fabulous-Pangolin-74"
            },
            {
                "raw_content": "That colorway is actually... Cool.",
                "author": "Midiamp"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "MaxSun puts GPU PCIe slot to the back of the B760 motherboard",
        "score": 9,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I was actually considering either this board of the H770-YTX MAXSUN also sells for my next build. I have a spare i9-12900 that needs a home, so it's actually quite a decision to make :)",
                "author": "Nilithium"
            },
            {
                "raw_content": "Well, any thoughts, or are you just a bot?",
                "author": "D4m4geInc"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "So I built another PC for another friend",
        "score": 594,
        "text_content": "* Ryzen 7 9800X3D CPU * Noctua NH-D15 G2 CPU Cooler * Zotac GeForce RTX 5080 Solid Core GPU * ASUS TUF GAMING X870-PLUS WIFI Motherboard * Kingston FURY Beast 64GB (2x32GB) DDR5 RAM * Fractal Design Torrent with Glass Panels Case * CORSAIR RM850x PSU * Crucial T500 2TB SSD PCIe Gen4 NVMe And a bonus that I haven't got a photo of: * Gigabyte MO32U 32\" 3840x2160 4K UHD OLED 165Hz Monitor Total cost £3150 excluding labour. Took me about 2-3h to put it all together + another day of testing, benchmarking, and fine tuning everything. I know I could have saved on some parts here and there but he insisted I spend the whole budget he had, so not gonna argue.",
        "comments": [
            {
                "raw_content": "Love the build, the Fractal Torrent is quite a nice case. Their smaller Torrent Nano I think is the perfect form factor, with not a lot of empty space left over. It does seem a bit empty even with a humongous Noctua NH-D15 G2 and 5080 in there.",
                "author": "Symphonic7"
            },
            {
                "raw_content": "Expensive, but I like your style 🙂",
                "author": "Freeco80"
            },
            {
                "raw_content": "Clean",
                "author": "orbitpro"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "OG Focus G Build",
        "score": 60,
        "text_content": "Hacksaw was to cut the front left leg of that frame to fit the case under the desk, lol",
        "comments": [
            {
                "raw_content": "Forgot to add specs. It’s just yesteryears best. 5800x3d 7900xtx 32gb ram 1000 watt psu A ton of arctic fans and a few 3d printed ducts",
                "author": "Avapire"
            },
            {
                "raw_content": "The reference 7900XTX fits nicely into the build. Does it have 3 extra fans underneath it or am I seeing things?",
                "author": "Symphonic7"
            },
            {
                "raw_content": "Love the sleeved cables",
                "author": "Solution_Anxious"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD TressFX 5.0 for Unreal Engine 5 is now available - AMD GPUOpen",
        "score": 279,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is this like Hairworks, but for AMD gpus?",
                "author": "I_think_Im_hollow"
            },
            {
                "raw_content": "Hopefully we'll see more attention brought to smaller details like this now that it's more accessible. TressFX is amazing.... just rarely utilised",
                "author": "First-Junket124"
            },
            {
                "raw_content": "More stutter. YEAAAAH",
                "author": "SagnolThGangster"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "PS6 Dockable Handheld Leak: AMD Canis Specs CRUSH XBOX Ally X!",
        "score": 0,
        "text_content": "",
        "comments": [
            {
                "raw_content": "i cant wait to install SteamOS/other Linux Distos and Windows on it to play around....... I think Sony has taken the significantly stronger hardware into account through strong subsidies, after all it will remain in the Playstation ecosystem",
                "author": "S0ltan82"
            },
            {
                "raw_content": "4 x Zen 6c ( Dense Core ) + 2 Low Power cores ....that's gonna be Switch Killer...in term of power consumption, this is something good,...AMD Epyc 192 \"Dense\" cores, beats out High-end Ampere 192 cores, even in power consumption level.... can't wait for this",
                "author": "Zealousideal_Two_221"
            },
            {
                "raw_content": "Why I posted this here is to talk about RDNA5 leaks Kepler_L2 claims that RDNA5 will: Merge 2 CU into 1 discrete unit replacing the WGP Merge L0, L1 and LDS together as a single L1 cache Implement per CU Work Group Scheduling (reducing branch divergence) Massively reworked and improved RT pipeline Massive raster and RT performance uplift **My thoughts** This is way too much for a single generation of improvements To put this into perspective: It took Intel **two years** to add the discrete RT pipeline and hardware short stack BVH traversal hardware + XMX ALU's + dedicated L1 cache functionality to the existing shared local memory (scratchpad for wavefronts) into Xe-LP to make it Xe-HPG Then putting in the work to make it scale up. **IF AMD's Radeon engineers are actually doing this big of a uarch rework then it's a recipe for disaster** There's a reason why companies don't usually do these massive uarch overhauls Because if it goes badly then you get screwed for years. Such reworks include: Netburst (Pentium-4) Bulldozer Intel Core Zen RDNA **You would only do such a massive uarch rework only if you absolutely must do it** **I honestly believe MLID's leaks more, which is:** ~10-15% raster performance uplift Massively reworked RT pipeline with huge RT gains Conclusion: AMD is far behind Intel and Nvidia in **heavy RT and path traced** workloads because I believe the local data share would never be as good for BVH traversal as Intel's approach where the BVH is kept in registers. Regardless of Alchemist's flaws it had a very advanced RT pipeline that rivaled Nvidia's Ampere uarch in sophistication. Battlemage had a 80% RT performance uplift. Regardless of the improvements AMD throws at their current approach it will always be a losing fight. That's why I believe MLID's leaks because they make sense. Fight Nvidia and Intel by fixing their poor heavy RT performance since it hurts their sales and reputation.",
                "author": "SherbertExisting3509"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "How small brokerages — and an open housing market — could collapse",
        "score": 30,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And when those publicly traded brokerages with their private listings are purchased by private equity...? It seems to be the way -everything- is going.",
                "author": "SpacemanLost"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Zillow Home Value and Home Sales Forecast (July 2025)",
        "score": 3,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "\"1m context\" models after 32k tokens",
        "score": 896,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I honestly find it's more about the number of turns in your conversation. I've dropped huge 800k token documentation for new frameworks (agno) which Gemini was not trained on. And it is spot on with it. It doesn't seem to be RAG to me. But LLM sessions are kind of like old yeller. After a while they start to get a little too rabid and you have to take them out back and put them down. But the bright side is you just press that \"new\" button and you get a bright happy puppy again.",
                "author": "SilasTalbot"
            },
            {
                "raw_content": "2.5 Pro is good up to 300-400K and then falls off hard. I'm not complaining.",
                "author": "Rivarr"
            },
            {
                "raw_content": "Not true for Gemini 2.5 Pro or GPT-5. Somewhat true for Claude. Absolutely true for most open source models that hack in \"1m context\".",
                "author": "jonydevidson"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "A 12sec result with just a single line of prompt (we're doomed 💀)",
        "score": 145,
        "text_content": "https://preview.redd.it/fwatuakui9mf1.png?width=671&format=png&auto=webp&s=c05e9ffbab0791e616188581cc951cc1f89d0e4f https://preview.redd.it/ou6foesyi9mf1.jpg?width=832&format=pjpg&auto=webp&s=4e02bc71f0ae634d574799ed50cfb2269d0955e0 I can confirm this is Arthur (from heaven) 🐥",
        "comments": [
            {
                "raw_content": "Damn crazy result boah",
                "author": "llkj11"
            },
            {
                "raw_content": "Is this RDR2 character? Pretty amazing actually how it can just fill in the blank like that.",
                "author": "Disastrous-River-366"
            },
            {
                "raw_content": "A single prompt could save you money that you would pay the artist afterwards, it’s awesome",
                "author": "Beeehives"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Would you choose to live indefinitely in a robot body?",
        "score": 602,
        "text_content": "In the year 2040, you get the chance to become a robot to avoid dying. Your mind is moved into the robot, and even though you no longer have any organs, it is still you. **PERKS** * **Immortality:** As long as your robotic body remains intact, you can live forever without aging or worrying about diseases or illness. * **Invulnerability:** Your steel body is reinforced with diamond plating in your chest and helmet, making you completely resistant to bullets, knives, and most firearms. Only powerful military-grade weapons can harm you. * **Advanced Intelligence:** You think and process information like an advanced AI, capable of solving complex problems, learning instantly, and recalling information perfectly. * **Super Strength:** Your robotic frame gives you strength far beyond that of a human, allowing you to lift and move heavy objects with ease. * **Enhanced Senses:** Your vision, hearing, and scanning capabilities far exceed human limits, making it nearly impossible to catch you off guard. **CONS** * **No Enjoyment of Food:** You will never experience taste or the satisfaction of eating again. * **Recharge Requirement:** Instead of sleep, you must recharge your systems for at least three hours every day. * **Emotional Disconnect:** Your robotic body may make it harder for you to feel emotions naturally or connect with others on a human level. * **Upkeep Needed:** Over time, parts may need maintenance or replacement, and repairs could be difficult if you take serious damage.",
        "comments": [
            {
                "raw_content": "I would, organs are overrated",
                "author": "rookan"
            },
            {
                "raw_content": "Yes. No hesitation even",
                "author": "RehabKitchen"
            },
            {
                "raw_content": "No IBS? Sure. No jonesing for nicotine. Please and thank you. No sex? …. crap",
                "author": "johnjmcmillion"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The week that Google ate Adobe",
        "score": 646,
        "text_content": "\"I tried this new Gemini image-editing tool with Business Insider's Hugh Langley. It was fast, easy to use, and free. Why would you pay $23 a month for Photoshop when Google offers similar capabilities, either for free or for less money?\"",
        "comments": [
            {
                "raw_content": "After photoshop went monthly I used my old stuff forever and eventually used gimp for stuff I need it for or really even a phone app. Free canva handles a lot too when I need something a little more and I’m happier to give canva one month of a sub to avoid adobe’s cancellation fee type bullshit.",
                "author": "fitm3"
            },
            {
                "raw_content": "Google has become amazing, and good on them. I’m super impressed and work with their tools often. But they’re *part* of a workflow, just as Creative Cloud is. At the same time, while the majority of professionals with Photoshop in their workflow will use it even more, the majority of *human* don’t have Photoshop. Google is playing a bit of catchup to OpenAI, who at like 85% of all public AI usage, is the “Kleenex” of AI. But Google’s advantage is search and Android both of which dwarf ChatGPT’s 700MM weekly actives. And Google is continuing to show up huge on those. Photoshop’s fine, though other parts of Firefly are now less compelling (though they smartly and quickly added nano-b to Firefly partner models), so corpos will negotiate more favorable renewal rates. But people forget about the value corporations hold in copyright protections, and Adobe has been *way* more consistently reliable as an enterprise provider than Google over the decades. Like, crazy significantly so, which is one main reason Firefly 4 is both great but limited.",
                "author": "Vo_Mimbre"
            },
            {
                "raw_content": "This is nonsense and anyone who uses Photoshop every day knows exactly why. Perhaps a better version of the headline would be “The week that Google ate a very (very!) tiny part of Adobe”.",
                "author": "Motion-to-Photons"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Digit and Aimoga humanoid robots seems prepping for supermarkets",
        "score": 142,
        "text_content": "More footage on Agility Robotics: \"We've trained the robot equivalent of the motor cortex in the human brain.\" https://x.com/agilityrobotics/status/1961522521918115952 Recall digit had past year footage on amazon and it was faster, this last video seems a more general training for more actions",
        "comments": [
            {
                "raw_content": "...did they put a giant ass on that robot?",
                "author": "SeveredEmployee01"
            },
            {
                "raw_content": "If you play the video at 200× speed it's like looking into the future",
                "author": "_MKVA_"
            },
            {
                "raw_content": "Can it do that a little bit slower?",
                "author": "Error_404_403"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "What's the point of college in 2025 and forward?",
        "score": 74,
        "text_content": "I don't buy the whole 2027 thing but even if it takes till mid-late 2030s, what's the point of busting my behind for almost half a decade and going tens of thousands into debt only to work for a decade at best before being replaced. This is also assuming I can find a job straight out of college which is pretty much a fantasy today. I know college was always a questionable proposition, but at least before if you majored in the right thing and made the right moves, your likelihood of having a long fruitful career was decent. Now it just seems like a complete gamble with bad odds no matter what you do. So what exactly is the point?",
        "comments": [
            {
                "raw_content": "Well if your degree is moot as an investment, what do you want to learn how to do? You are going to get older anyway so just pick skills that are personally meaningful.",
                "author": "Striking_Ad_2630"
            },
            {
                "raw_content": "To structure your mind in such a way as to give yourself the best chance at a pleasant existence. To understand how the world works, how people operate and to know the limits at which pleasure turns to permanent injury. Should be clear. There are no free lunches in this world, pre-singularity or post-singularity. A good life requires work. Reward requires risk.",
                "author": "magic-theater"
            },
            {
                "raw_content": "If you can afford it, go anyway, and meet as many people from different backgrounds that you can. May be the best benefit from college in the coming years.",
                "author": "jekd"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Meta's latest innovation",
        "score": 26,
        "text_content": "[https://www.nature.com/articles/s41586-025-09107-7](https://www.nature.com/articles/s41586-025-09107-7) \"Laser-based displays are highly sought after for their superior brightness and colour performance[^(1)](https://www.nature.com/articles/s41586-025-09107-7#ref-CR1), especially in advanced applications such as augmented reality (AR)[^(2)](https://www.nature.com/articles/s41586-025-09107-7#ref-CR2). However, their broader use has been hindered by bulky projector designs and complex optical module assemblies[^(3)](https://www.nature.com/articles/s41586-025-09107-7#ref-CR3). Here we introduce a laser display architecture enabled by large-scale visible photonic integrated circuits (PICs)[^(4)](https://www.nature.com/articles/s41586-025-09107-7#ref-CR4)^(,)[^(5)](https://www.nature.com/articles/s41586-025-09107-7#ref-CR5)^(,)[^(6)](https://www.nature.com/articles/s41586-025-09107-7#ref-CR6)^(,)[^(7)](https://www.nature.com/articles/s41586-025-09107-7#ref-CR7) to address these challenges. Unlike previous projector-style laser displays, this architecture features an ultra-thin, flat-panel form factor, replacing bulky free-space illumination modules with a single, high-performance photonic chip. Centimetre-scale PIC devices, which integrate thousands of distinct optical components on-chip, are carefully tailored to achieve high display uniformity, contrast and efficiency. We demonstrate a 2-mm-thick flat-panel laser display combining the PIC with a liquid-crystal-on-silicon (LCoS) panel[^(8)](https://www.nature.com/articles/s41586-025-09107-7#ref-CR8)^(,)[^(9)](https://www.nature.com/articles/s41586-025-09107-7#ref-CR9), achieving 211% of the colour gamut and more than 80% volume reduction compared with traditional LCoS displays. We further showcase its application in a see-through AR system. Our work represents an advancement in the integration of nanophotonics with display technologies, enabling a range of new display concepts, from high-performance immersive displays to slim-panel 3D holography.\"",
        "comments": [
            {
                "raw_content": "amazing, now shelve the project and spend another $billion on buying out openai employees😭😭",
                "author": "Intelligent_Tour826"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Artificial neuron merges DRAM with MoS₂ circuits to better emulate brain-like adaptability",
        "score": 107,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This will be the future of AI. Precise matrix multiplication just takes too much hardware space.",
                "author": "TheJzuken"
            },
            {
                "raw_content": "W ai progression",
                "author": "Psychological_Bell48"
            }
        ],
        "subreddit": "singularity"
    }
]