[
    {
        "post_name": "An influencer who raised nearly €500k while claiming to fundraise for Palestinians in need spent donations on expensive cars, luxury watches, and designer bags.",
        "score": 579,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is brilliant.",
                "author": "CaptainPenguin"
            },
            {
                "raw_content": "All he had to do to get away with it was throw a few galas and hire a couple of 6 figure employees with 3 letter titles, no one would have cared.",
                "author": "usernamechecksout"
            },
            {
                "raw_content": "There's a sucker born every minute, and I don't mean Kamala Harris.",
                "author": "mass55th"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "JD Vance: The thing that will bankrupt this country more than any other policy is flooding the country with illegal immigration and then giving those migrants generous benefits.",
        "score": 665,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The Obbb tried to fix it and then you rolled over and let a democrat cut those parts. YOU can literally fix this, JD",
                "author": "Zskills"
            },
            {
                "raw_content": "Maybe the PRESIDENT OF THE SENATE could fire some unelected cunt?",
                "author": "Chickensaurus"
            },
            {
                "raw_content": "But sanctuary businesses are ok? Are you retarded, son? Anyone with a brain sees how this administration is, there will be no massive deportations but rather a bullshit amnesty instead.",
                "author": "Snowmexican"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Republicans, the One Big Beautiful Bill, perhaps the greatest and most important of its kind in history, gives the largest Tax Cuts and Border Security ever, Jobs by the Millions, Military/Vets increases, and so much more. The failure to pass means a whopping 68% Tax increase, the largest in history",
        "score": 508,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Joke's on me, I'm getting that tax increase in Washington state no matter what",
                "author": "RedditIs4Retards"
            },
            {
                "raw_content": "There ain't no tax cuts.",
                "author": "Jonnywalker"
            },
            {
                "raw_content": "yeah ok - now what are the poison pills? iow i have zero trust for the gop",
                "author": "perma-maga"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "J.K. Rowling: Stephen Ireland, who targeted me with endless abuse on here because I oppose the chemical castration of children and the removal of protected spaces for women and girls, has just been sentenced to 30 years in jail for child rape.",
        "score": 647,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Every.Single.FUCKING.TIME.",
                "author": "darkmodeforgotpass"
            },
            {
                "raw_content": "Another statistic. Poor kid. Jail not enough.",
                "author": "Wtf_socialismreally"
            },
            {
                "raw_content": "Homos can be safely assumed to be pedos until proven otherwise.",
                "author": "knnbccb"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Elon may get more subsidy than any human being in history, by far, and without subsidies, Elon would probably have to close up shop and head back home to South Africa.",
        "score": 302,
        "text_content": "",
        "comments": [
            {
                "raw_content": "*Dayummm!* GEOTUS just went scorched Earth! I really enjoy these late night mean tweets - Always have.",
                "author": "kek-is-tan"
            },
            {
                "raw_content": "Deport pajeet H1B lover.",
                "author": "TakingCoatsWIN"
            },
            {
                "raw_content": "Yes exactly, he knew damn well about you wanting to end mandates for EVs and subsidiaries as well... and yet he still endorsed you wholeheartedly, only for you to call him a fucking grifter and claim he was only concerned about EV mandates when he spoke out against your ridiculous big bullshit bill. But if that was true then why in the hell would he bother endorsing you in the first place? He would have been better off endorsing your opponents if he was just looking to get rich. PS: whatever DOGE uncovered we know damn well your shit attorney general wouldn't do a fucking thing about it!",
                "author": "BlackPilledMAGA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: The Idaho firefighter who underwent emergency surgery and was “fighting for his life” last night has just been UPGRADED to stable condition FANTASTIC news! Keep praying! 🙏🏻",
        "score": 1123,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Thank God",
                "author": "DJT_MFers1"
            },
            {
                "raw_content": "Trump to visit him soon most likely.",
                "author": "JoeBidensDementia1"
            },
            {
                "raw_content": "Fire Fighters are a class of men that are sometimes forgotten.",
                "author": "Tokens_Worth"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Attorney General Pam Bondi reveals the DOJ is investigating Joshua Aaron, the creator of a new app called ICEBlock that warns illegal immigrants if ICE is near them.",
        "score": 1025,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Say the line PDW",
                "author": "IvIA6A"
            },
            {
                "raw_content": "How many Fox appearances does this make for her?",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "“He better watch out” we might maybe possibly arrest somebody someday in the far off future.",
                "author": "Snoman"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The U.S. Department of Justice has begun to prioritize stripping naturalized Americans of their citizenship when charged with crimes, according to a recent memo — Axios",
        "score": 1575,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Cool, start with the ones in congress",
                "author": "inksday"
            },
            {
                "raw_content": "Headline is ragebait. Even the linked Guardian article below has a headline that lies through omission. - **Headline:** \"Trump’s justice department issues directive to strip naturalized Americans of citizenship for criminal offenses\" - **Reality:** DOJ will pursue denaturalization if you lied or otherwise illegally procured your citizenship. It makes sense; if you committed fraud, then the citizenship was granted based on that fraud and should be revoked. A realistic headline might've been \"Trump’s justice department issues directive to strip naturalized Americans of citizenship for lying on their application\" but that wouldn't have gotten the clicks. This is actually not news, but was reported months ago. I think it was in one of the EO's Trump released some time ago. https://www.theguardian.com/us-news/2025/jun/30/trump-birthright-citizenship-naturalized-citizens",
                "author": "dissledat"
            },
            {
                "raw_content": "Voted for—->This",
                "author": "AstroLonghorn"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Senate just voted to keep funding free healthcare for illegals",
        "score": 1201,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm so done with all of this! The Senate GOP can choke and swallow on Chuck Schumers cum.",
                "author": "MajorClark"
            },
            {
                "raw_content": "Vance refused to overrule her. WHY??",
                "author": "Here_we_go"
            },
            {
                "raw_content": "Are you kidding me!! You assholes! I didn't have insurance for years and you FUCKERs are giving it to fucking non Americans!!! How do you sleep at night!!! Your GARAGE!!",
                "author": "Lynnforthetruth56"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Scott Adams update video. Cancer pain is gone, may have 2-3 years left due to new cancer drug.",
        "score": 651,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He believes the clot shot gave him cancer. He's probably not wrong. I'm happy he's got some comfort, and I'm glad he may have more time.",
                "author": "DannibusX"
            },
            {
                "raw_content": "Happy for him! I know too much about this battle, glad they have found something that will work better. Edit: This is hard to hear, a very brave man. What I have learned along the way, being told three times before that I was going to die, and soon, is this. No one has a guarantee of tomorrow, next month or next year. Like Scott is doing, every day give it your best. Swing for the fences. Tell people you love how you feel. And decide what’s important to you in the remaining time. For me, all I ever wanted was a decade of ordinary days. I’ve been lucky to have about 2 1/2 decades of ordinary days. Yep, some are really tough but I’m still here. Anyone else in the battle, you know what he feels like. Keep fighting and keep living. We need you.",
                "author": "DeplorableLA"
            },
            {
                "raw_content": "Congrats Scott. I can't imagine the feeling know that your last few weeks of excruciating pain just turned overnight into a couple years of relatively painless living. That's a real rags to riches story.",
                "author": "mykillk"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "REPORTER: \"A 75-year-old Cuban national died in ICE custody. He had lived in the U.S. for 60 years...\" HOMAN: \"People die in ICE custody. People die in county jails. People die in state prisons.\" \"The question should be, 'how many lives does ICE save?'\"",
        "score": 1284,
        "text_content": "",
        "comments": [
            {
                "raw_content": "60 years and he couldn’t be bothered to get legal? No shits given.",
                "author": "DogFart_"
            },
            {
                "raw_content": "I wish all of trumps picks were as solid as Homan.",
                "author": "TommyLasordasBallBag"
            },
            {
                "raw_content": "I wish they would target all the Illegal Mexicans and muslims and Chinese first.",
                "author": "Bullet3250"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "'Alligator Alcatraz\" 🐊🐊🐊",
        "score": 1049,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Aie carumba!",
                "author": "Mitzhatzmakoph"
            },
            {
                "raw_content": "Link to Ben Garrison / Tina Toon https://gab.com/GrrrGraphics/posts/114773560824969562",
                "author": "I-am-Orlando"
            },
            {
                "raw_content": "All we need now are sharks with laser beams",
                "author": "Tookens"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "With Illegal Aliens Like These, Who Needs Sleeper Cells? Iranian National and U.S. Wife Finally Indicted...",
        "score": 847,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Muslims do not belong in America",
                "author": "Fagrt"
            },
            {
                "raw_content": "&#65038; Almost all of these people know an illegal. Watch their cell phone numbers and then find out which cell phone numbers they interact and/or people they cohabitate with. &#65038;",
                "author": "BallotsOnRubysUSB"
            },
            {
                "raw_content": "I'm so sick of this fascism, I cannot believe Trump is enforcing gun control laws!! My fellow liberals are outraged, free guns for everyone!!!",
                "author": "itspancakees"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "GEOTUS is right, Powell is costing us tens of BILLIONS even though inflation is low it is seems he wants to sabotage MAGA for the mid-terms. He has got to go.",
        "score": 1701,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Powell is right, inflation is KILLING me and instead of lowering rates how about we spend A LOT less. Why is it so hard to go back to pre pandemic spending? GOP & Trump want to spend like drunken liberal sailors and that thinking and action is why everything is so fucking expensive. Trump is AWESOME on everything except he is a lib spender when it comes to bills.",
                "author": "destroyedman"
            },
            {
                "raw_content": "I'd rather not reignite inflationary forces that are only now finally being put to rest. I appreciate where DJT is coming from but he is also, whether by desire or mere coincidence, trying to goose asset bubbles when calling for an acceleration of the timeline for lowering rates. Later this year we'll get 50bps across two cuts. restrictive rate policies cannot evaporate overnight when we put 40% of the monetary supply into circulation <5 years ago and we're only now starting to see signs of prices stabilizing/flattening out.",
                "author": "PROCIsAsshoe"
            },
            {
                "raw_content": "I’m sorry but this is retard cope. If Trump and the rest of the GOP really gave a shit about the interest expense, they would stop spending trillions of dollar deficits. I’m not giving him any leeway on this. This is EXACTLY what causes inflation. We need DEFLATION. Crank up the rates higher. I’m sorry you faggots won’t be able to finance your chipotle burritos anymore.",
                "author": "Train_w_no_brakes"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Tennessee Magistrate Judge Barbara D. Holmes has ruled that MS-13 member Kilmar Abrego Garcia will remain in detention in a ploy to prevent ICE from arresting him upon release and deporting him to a Third World country.",
        "score": 1347,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So now it's OK to keep this literal human trafficker to be held in Detention? So confused.",
                "author": "SparkleMTN"
            },
            {
                "raw_content": "Interesting. Last week he wasnt a danger to society and there wasn't any reason to hold him. Today, the lawless judiciary decides to keep him detained solely to thwart the law enforcement efforts of an executive agency. Seems to me like that's obstruction of justice, and the judge should be indicted.",
                "author": "proud_semi_fascist"
            },
            {
                "raw_content": "Have a DHS representative file a response to the court that the US promises not to deport him. Then send him to Alligator Alcatraz.",
                "author": "fluffykitten"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Jaun-Tanamo Bay",
        "score": 881,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Needs more alligators",
                "author": "TommyLasordasBallBag"
            },
            {
                "raw_content": "I moated for this.",
                "author": "Lol_Garrus"
            },
            {
                "raw_content": "The Swamp We Need instead of The Swamp We Got",
                "author": "caKAG"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: U.S. Senate rejects measure to kick illegal aliens off Medicaid, 56-44.",
        "score": 1498,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why hasn't the Parliamentarian been overruled or replaced?",
                "author": "AmericanJawa"
            },
            {
                "raw_content": "What a fucking joke.",
                "author": "darkmodeforgotpass"
            },
            {
                "raw_content": "Why are we paying healthcare for invaders?",
                "author": "dirtysanchez69"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Bryan Kohberger, who kiIIed multiple college students in Idaho in 2022, has just pled GUILTY to the m*rder charges. This will allow him to avoid the de*th penalty, and there will be no trial. He will serve life in prison.",
        "score": 987,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Thats nice. Lets talk about why vance didnt overrule the parliamentarian suggestions allowing illegals to still receive medicaid. Now billions to them yet single Americans get booted off. Downvote me. But answer the question.",
                "author": "Here_we_go"
            },
            {
                "raw_content": "Gay. So another faggot who gets to live out his life on the tax payers dime. Our legal system is too soft.",
                "author": "TheShowMeState"
            },
            {
                "raw_content": "Dude - are you missing the \"u\" and \"a\" on your keyboard?",
                "author": "Antenna"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Shawn Farash @Shawn_Farash This is why the idea of starting a \"Third Party\", while nice in theory, isn't practical, and is actually quite dangerous.",
        "score": 424,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This why you don’t start another party, you create a political coalition that promises to only vote for those who uphold core values. You get 5-10% to agree to that, and you swing almost every election. And then we destroy the party system.",
                "author": "War_Hamster"
            },
            {
                "raw_content": "False. There is only one party. Starting another would in fact mean there are now two parties. Sadly we all know who they would soon be beholden to.",
                "author": "Viewer01"
            },
            {
                "raw_content": "It can be done, see what Farage has done in the UK with Reform. almost completely replaced the Tories and taken a good chunk of Labour.",
                "author": "Scuffers"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Sortor, \"The White House is currently working on ways to EXCLUDE illegal aliens from the US census, per Stephen Miller. This would take away SEVERAL House seats from places like California, as seats are determined by population. California would lose 5 to 6 seats.\"",
        "score": 2019,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They should have never been counted to begin with",
                "author": "Sea_Still"
            },
            {
                "raw_content": "This should NOT include ANY non-citizens. It doesn't matter if they're here legally or not, they shouldn't be counted for representation. Representation (house members/electoral votes) should ONLY be based on the number of citizens! Edit to add: if they do this, it IS WAY BETTER than what we have now, but we still won't be where we need to be.",
                "author": "ModernKnight"
            },
            {
                "raw_content": "To aid in this battle, everyone on the right should not fill out the census if they live in blue states.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Nvidia is ending support for Maxwell, Pascal, and Volta in the upcoming driver branch",
        "score": 209,
        "text_content": "",
        "comments": [
            {
                "raw_content": "End of an era. The 1080 Ti was an absolute trooper of a GPU & if you don't play modern AAA games, it will still go on for years to come",
                "author": "Vaxtez"
            },
            {
                "raw_content": "10 series finally being put to pasture. I would update to the latest driver but those all have problem for me anyway.",
                "author": "kuddlesworth9419"
            },
            {
                "raw_content": "For Unix, no indication I see about Windows.",
                "author": "mduell"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "China could be the world's top semiconductor foundry hub by 2030 — despite US curbs, nation to hold 30% of global installed capacity, surpassing Taiwan",
        "score": 85,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> despite US curbs I'd go so far as to say it's in part *because* of US curbs. Probably provided them a sense of urgency to fund development.",
                "author": "MiloIsTheBest"
            },
            {
                "raw_content": "But good news, the president says we're all in on coal.",
                "author": "Ancillas"
            },
            {
                "raw_content": "Seems inevitable that they would end up at the top of capacity just to support their downstream industries, the rest really depends on their competitors more than anything",
                "author": "Limited_Distractions"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nikkei Asia: 'Taiwan's No. 2 chipmaker UMC eyes entering cutting-edge race [6 nm]\"",
        "score": 27,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Here's the [archive](https://archive.is/gEqVX) of the Nikkei Asia article.",
                "author": "Dakhil"
            },
            {
                "raw_content": "Interesting. A partnership with Intel could make some sense. UMC brings contacts and existing customers while Intel provides the cutting edge nodes and takes a cut. Either way I expect the industry to consolidate due to TSMC's dominance at the cutting edge and China's flooding at the lower end. Global Foundry is another one that I fear may not survive in the long run. AI chips require maximum performance and as low power consumption as possible due to shortage of electricity going to data centers. The world is insatiable for cutting edge nodes due to AI. And here comes China eroding GF's 7nm and above market. Both GF and UMC are in a tough spot. I'd bet good money that GF/UMC and Intel will merge or have a deep partnership at some point in the near future.",
                "author": "auradragon1"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Kuo: Apple to release cheaper MacBook powered by iPhone processor",
        "score": 240,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why iPhone chips? I'd think they have plenty of M4 chips to bin for broken cores. Like when they bin the M4 4+6 to a 2+4 you probably can almost use all of the produced chips and get the same core layout of the iPhone chip.",
                "author": "EloquentPinguin"
            },
            {
                "raw_content": "Return of the \"MacBook\" I presume? Doesn't seem that bad of a preposition.",
                "author": "Dreamerlax"
            },
            {
                "raw_content": "Maybe create a Mac without a metal unibody and replace the $700 M2 that is often on sale. Might not be bad if it can be priced under $700 ( which means it will go on sale for $550-600). Perfect upgrade for older Intel Macbook users that want a basic PC.",
                "author": "funny_lyfe"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "VideoCardz and Slimeball Journalism",
        "score": 0,
        "text_content": "This is just a (small) PSA: please don't support slimeball hardware related publications / journalists / YouTubers. Recently I broke first here that Nvidia was going to drop support for Maxwell, Pascal, and Volta GPUs here: [https://www.reddit.com/r/hardware/comments/1lopxnc/nvidia\\_is\\_ending\\_support\\_for\\_maxwell\\_pascal\\_and/](https://www.reddit.com/r/hardware/comments/1lopxnc/nvidia_is_ending_support_for_maxwell_pascal_and/) This was just a little over two hours(according to the Nvidia developer forum date indicator) after Nvidia made the announcement. I noticed it while reading the Linux GPU driver forum completely by chance. A few hours later, VideoCardz published an article here: [https://archive.is/I4x4f#selection-1537.27-1537.35](https://archive.is/I4x4f#selection-1537.27-1537.35) You may be asking: \"So? Anyone could have found that post. It's a public forum!\". Unfortunately, it's *crystal clear* that they originally gotten the information from my post: 1. Conflicting, nonsensical information: In their article they state: >NVIDIA has officially confirmed that the next major driver branch (580) will be the last to support three GPU architectures, affecting several GeForce and professional products. >Starting with version 580 (currently at 576.80), NVIDIA will no longer support Maxwell-based cards (GeForce GTX 700, GTX 900) and Pascal-based GTX 10 series. The list also includes the TITAN V, a limited release and the only consumer-oriented GPU based on the Volta architecture. The first sentence conflicts with the first. The 580 driver cannot both support the 580 driver(first sentence) and not(second two sentences). This is presumably because of my title, which I admitted was a mistake here: [https://www.reddit.com/r/hardware/comments/1lopxnc/comment/n0otxx1/?context=3](https://www.reddit.com/r/hardware/comments/1lopxnc/comment/n0otxx1/?context=3) To be crystal clear, the 580 series will be the last driver branch to support those generations. It was my mistake. The point is, this makes zero sense and is garbage journalism. 2. Repeating questions / answers asked/answered in my Reddit thread: >While the update refers to UNIX systems, the driver branches are shared across both Windows and UNIX-based platforms. First off, who normally refers to Linux support as Unix? Yes Nvidia technically supports BSD but no one really cares(sorry BSD people). Anyway, this is clearly information from this exchange: [https://www.reddit.com/r/hardware/comments/1lopxnc/comment/n0ou3j3/?context=3](https://www.reddit.com/r/hardware/comments/1lopxnc/comment/n0ou3j3/?context=3) It's bad enough to regurgitate what other people have said and pass it off as if you said it, but it's especially bad when you don't know what you're copy/pasting and it comes from places like *Reddit*. EDIT: 3. No additional information Thanks to /u/[hackenclaw](https://www.reddit.com/user/hackenclaw/) for making me think of this, but the lack of curiosity as to why all 3 generations are getting deprecated it itself eye-brow raising. If they knew anything, they would have known that Nvidia is deprecating support in order to align with GPUs that support the \"GPU System Processor\"(GSP) and included it in their article. You can read more here: [https://github.com/NVIDIA/open-gpu-kernel-modules/issues/19](https://github.com/NVIDIA/open-gpu-kernel-modules/issues/19) ... I could care less about fake internet points(it's Reddit, lmao). The point of this post is to bring awareness to crappy journalism vomited out in order to drive site traffic. The opinions and information they vomit out is not theirs and it doesn't even make sense. You just know that B-tier normally rumor-mill YouTubers who make clickbait thumbnails and titles are going to cover this and they're going to use the trashy VideoCardz article. Please, if you're reading this, don't support this bad journalism from any publication or YouTuber.",
        "comments": [
            {
                "raw_content": "Hello! It looks like this might be a question or a request for help that violates [our rules](http://www.reddit.com/r/hardware/about/rules) on /r/hardware. If your post is about a computer build or tech support, please delete this post and resubmit it to /r/buildapc or /r/techsupport. If not please click report on this comment and the moderators will take a look. Thanks! *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[TechPowerUp] AVerMedia CamStream 4K review",
        "score": 21,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> If you're looking to repurpose a real camera as a webcam, you're exactly the type of user AVerMedia aims at with this product. That's pretty cool, considering even most high end webcams suck.",
                "author": "SmileyBMM"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Orion O6 + RX570] Gaming on ARM Shouldn’t Be This GOOD!",
        "score": 14,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I mean for comparison back on my old FX8320 and RX570 I was getting like at least 6x the FPS on HL2/Portal and I remember getting ~60 fps in Doom 2016 at 1440p with close to max settings. Calling this \"GOOD\" is pretty stupid honestly.",
                "author": "AreYouAWiiizard"
            },
            {
                "raw_content": "Import fees pushes the cost of it way too high especially if you factor in the cost of cooler/case and other accessories. I wonder how it stacks up against [Orin Nano Super.](https://www.nvidia.com/en-us/autonomous-machines/embedded-systems/jetson-orin/nano-super-developer-kit/) You can get a mini pc with Radeon 780m for not [much more](https://www.amazon.com/MINISFORUM-Ryzen-7940HS-2xHDMI2-1-2xPCIe4-0/dp/B0DCG6CZSS/) or an even [cheaper one](https://www.amazon.com/MINISFORUM-Processor-Computers-HDMI2-1-Renewed/dp/B0F9PG67Y6) with Radeon 760m.",
                "author": "lintstah1337"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "The 2nd half of 2025",
        "score": 4645,
        "text_content": "Nintendo is taking good care of us. Nintendo Direct in July?",
        "comments": [
            {
                "raw_content": "Splatoon raiders is not releasing in 2025 It does not have any confirmed release window yet",
                "author": "Sinomsinom"
            },
            {
                "raw_content": "As someone who has been waiting for MP4 for over 10 years, I still won't believe it's actually coming out until I see a release date.",
                "author": "StockHumor4768"
            },
            {
                "raw_content": "Is Air Rider coming in 2025? Has that been confirmed?",
                "author": "nohumanape"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I’m sorry, Wario’s Premium WHAT?!",
        "score": 1840,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I love how Wario is totally happy to sabotage his own brand ad.",
                "author": "Natto_Ebonos"
            },
            {
                "raw_content": "Dunno, seems on brand.",
                "author": "simply_not_edible"
            },
            {
                "raw_content": "Wario’s Premium Cut Rate Auto Parts What…? 😁",
                "author": "rud2020"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Is the pro controller for the switch 2 worth the extra money?",
        "score": 618,
        "text_content": "Wallmart right know has the switch 1 pro controller for 45 bucks should i just run with this or save more to the the switch 2 one?",
        "comments": [
            {
                "raw_content": "the new one is sick (i own both), the controller feels premium, the sticks are incredible, and the back mappable buttons are awesome, places will price match costco and give you it for $75, it’s absolutely worth it",
                "author": "DungDefender1115"
            },
            {
                "raw_content": "Be careful ordering online from Walmart. Make sure the controller is sold and shipped by Walmart and not a third-party seller. I've heard bad things about those sellers that are allowed to post listings online at Walmart.",
                "author": "bingthebongerryday"
            },
            {
                "raw_content": "I think so. The S1 Pro is still plenty good but the comfort of the grip and the smoothness of the sticks alone is next level on the S2. Factor in crazy battery life and the mappable per game GL/GR buttons that don’t feel like an inconvenience and it’s one of my favorite controllers. Plus it’s nice to be able to wake it from sleep mode lol",
                "author": "Wernershnitzl"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Lexar 1TB does exist",
        "score": 228,
        "text_content": "After extremely long wait and then it was delayed for another month. It actually arrived today. I noticed It has a serial number. I didn’t know these cards came with serial numbers or at least I’ve never noticed it before.",
        "comments": [
            {
                "raw_content": "How much was it? How's it running in the switch 2?",
                "author": "Low-Recognition-7293"
            },
            {
                "raw_content": "Still waiting for Sandisk 1TB SDExpeess",
                "author": "FitFarmer5597"
            },
            {
                "raw_content": "On Amazon, it's now a myth since the product listing was removed",
                "author": "LongjumpingMeaning5"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Switch 2 screen is honestly not that bad",
        "score": 1262,
        "text_content": "Spending some time with it and then comparing it to the Switch OLED. No the colours aren't quite as punchy as the OLED but it looks good to me overall. Not as good as my LG OLED TV but not the humongous difference of the base Switch 1 Vs my TV. I've not seen any ghosting yet either. I saw that Nintendo did some tricks like adding a red filter to boost red contrast. Whatever they did, it worked on me",
        "comments": [
            {
                "raw_content": "What is the last game pictured here?",
                "author": "OkAdvantage7032"
            },
            {
                "raw_content": "What racing game is that? It looks like Virtua Racing but it definitely isn’t.",
                "author": "OneManFreakShow"
            },
            {
                "raw_content": "Coming from a Switch Lite, I have nothing but praise for the display on my Switch 2",
                "author": "bigsithenergy99"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Yakuza 0 in docked mode feels underrated visually.",
        "score": 46,
        "text_content": "Sure its bones are essentially the ps3 game but i easily forget that in some scenes.",
        "comments": [
            {
                "raw_content": "First time Yakuza player on Switch loved both games so far and think your right the games fire, The graphics are smooth even when there’s loads of characters on screen.. Fun character arcs and skill trees too",
                "author": "EddieBlizario"
            },
            {
                "raw_content": "I really hope they port Judgment over. It’s my favorite game set in this universe. I’d buy it again to play on Switch 2.",
                "author": "zoozoo4567"
            },
            {
                "raw_content": "I wish I could experience more of the game but currently the Hostess Club requires my undivided attention.",
                "author": "WearingFin"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "This game is fucking rigged man",
        "score": 56,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The power of Cow is more than our mortal minds can comprehend.",
                "author": "StockHumor4768"
            },
            {
                "raw_content": "Yeah? Well, you know, that's just like, uh, your opinion, man.",
                "author": "antisp1n"
            },
            {
                "raw_content": "well you got Best Course anyway so you can't complain",
                "author": "PancakesTheDragoncat"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Buyer beware: Antank S3 Max Switch 2 Dock blocks the bottom airflow",
        "score": 277,
        "text_content": "The original Switch 2 dock has cutouts to let air flow through so it’s part of the intended design and the Antank S3 Max Switch 2 dock closes those shut since the console sits flush on it. I have to do extended testing but it seems to get warmer to the touch than with the real dock.",
        "comments": [
            {
                "raw_content": "Thanks for this info. I was just looking at this dock. Likely to pass for now until I hear some reviews.",
                "author": "sportdan30"
            },
            {
                "raw_content": "What the hell were they thinking?! 🤦🏼‍♂️🤦🏼‍♂️",
                "author": "usagora1"
            },
            {
                "raw_content": "Honest question here, why are so many people getting rid of the regular dock and choosing these instead?",
                "author": "Lerschie"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Jason Schreier: Mass layoffs at Xbox are expected to hit on Wednesday",
        "score": 1042,
        "text_content": "https://bsky.app/profile/jasonschreier.bsky.social/post/3lstr3pbp3k2x > Xbox's fiscal year ends today but the mass layoffs that Bloomberg News reported on last week are expected to hit on Wednesday, for people wondering.",
        "comments": [
            {
                "raw_content": "#Jason Schreier is a Tier 1 - Very Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Tim Schafer from Double Fine had an ominous Blue Sky post yesterday that makes it seems like they're about to get hit this week... Really hope it's not as bad as the rumours are saying, but Wednesday is shaping up to be a bloodbath.",
                "author": "MuptonBossman"
            },
            {
                "raw_content": "Microsoft's gonna post another 17% increase in revenue over the previous financial year, Nadella walks away with his pay package, and then they bring the hammer down on \"redundancies\". Heinous",
                "author": "MyMouthisCancerous"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Bloomberg: Nintendo stopped selling products on Amazon US due to disagreements over unauthorized sales (third party game sellers undercut Nintendo on pricing)",
        "score": 800,
        "text_content": "https://www.bloomberg.com/news/articles/2025-06-30/amazon-lost-right-to-sell-nintendo-switch-2-amid-sales-dispute > Nintendo Co. pulled its products from Amazon.com Inc.’s US site after a disagreement over unauthorized sales, meaning the e-commerce company missed out on the recent debut of Nintendo’s Switch 2 — the biggest game console launch of all time. > > The Japanese company stopped selling on Amazon after noticing that third-party merchants were offering games for sale in the US at prices that undercut Nintendo’s advertised rates, according to a person familiar with the situation. Enterprising sellers were buying Nintendo products in bulk in Southeast Asia and exporting them to the US, said the person, who requested anonymity to discuss confidential information. ‎ > Amazon tried to assuage Nintendo by offering to attach labels to products that guarantee they’re authentic. Amazon uses the technique to assure shoppers products aren’t counterfeits and to help it track merchandise. But the offer wasn’t sufficient, the person said, and Nintendo ultimately opted to pull its products from Amazon in the US. Both Nintendo and Amazon denied the report: > \"There is no such fact. We do not disclose details of negotiations or contracts with retailers,\" a Nintendo spokesperson said in an e-mailed response, declining to elaborate further. > > An Amazon spokesperson said \"the claims made by Bloomberg regarding our relationship with Nintendo are inaccurate\" but declined to specify how. \"Amazon is pleased to offer Nintendo products directly to our customers as part of our commitment to providing an exceptional shopping experience with the widest selection possible,\" the spokesperson said.",
        "comments": [
            {
                "raw_content": "Reminder that video game companies merely tolerate used/3rd party sellers. They would love nothing more than for all of them to be expunged forever.",
                "author": "foodisyumyummy"
            },
            {
                "raw_content": "Wario64 did say it was a boring reason And this certainly is a boring reason",
                "author": "Joshdabozz"
            },
            {
                "raw_content": "Third party sellers on Amazon also send you the wrong fucking region too, regardless of what the listing shows.",
                "author": "drumjolter01"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Microsoft invested approximately £182.5 million into Ninja Theory between the acquisition and 30 June 2023 (my own estimates)",
        "score": 251,
        "text_content": "Hello, TL:DR, Microsoft’s acquisition of Ninja Theory probably cost approximately £90.3 million and subsequent investment into Ninja Theory amounted to £92.2 million. Total revenue during this period amounted to approximately £23 million. Ninja Theory’s accounts are publicly available at the UK government’s Companies House service. https://find-and-update.company-information.service.gov.uk/company/05240956 I have investigated these accounts and my findings are as below: - Within the Full Accounts up to 30 June 2019, Ninja Theory’s report a sale of IP to Microsoft at a value of £90.3 million (interpreted as the cost of acquiring the studio itself). - Subsequent inter company income from Microsoft amounts to £90.2 million during the time frame. Combined with the gain on sale of IP and the total is £182.5 million. - Revenue during the time frame amounts to £30 million (not including intercompany income). Item | One time cost | Intercompany income | Revenue | Net ---|---|----|----|---- Sale of IP | 90.3 | N/A | N/A | -90.3 June 2019 | N/A | 20.1 | 12.7 | -7.4 June 2020 | N/A | 16.1 | 5 | -11.1 June 2021 | N/A | 14.2 | 2.4 | -11.8 June 2022 | N/A | 19 | 1.6 | -17.4 June 2023 | N/A | 22.8 | 1.2 | -21.6 Total | -90.3 | -92.2 | 22.9 | -159.6 * Revenue includes contract income (likely from their mocap studio and other projects) as well as their self-published income (presumably Hellblade I and previous projects). NOTES: - **I AM NOT AN ACCOUNTANT, THIS POST IS CRUDE, RUDIMENTARY AND AMATEUR** - Doesn’t include the last 2 years, which would include the last year of intercompany income to fund the last year of Hellblade II development. - This presumably does not take into account revenue to Microsoft via other means (GamePass for example). - That said, I think this is all in all, a reasonable estimate for the cost of Microsoft’s acquisition of Ninja Theory. The last two years of Ninja Theory have likely also cost a further £40 million based upon the trend but that is not taken into account. Thank you, if anything in this post is wrong or I am misinformed in anyway, please feel free to call me out on it.",
        "comments": [
            {
                "raw_content": "Their survival hinges on how useful they are as a mocap studio/technical support honestly",
                "author": "PM_ME_STEAMKEYS_PLS"
            },
            {
                "raw_content": "They got a pretty awful return on investment then.",
                "author": "SecretTraining4082"
            },
            {
                "raw_content": "90 million pounds to develop Bleeding Edge and Hellblade 2 seems pretty brutal, especially considering Hellblade 1 was acclaimed for coming in under [10 million dollars in total budget.](https://www.vg247.com/hellblades-budget-required-ninja-theory-to-use-their-own-boardroom-as-a-motion-capture-studio) Appreciate the effort OP, definitely interesting to get some more insight into the financials of a modern studio.",
                "author": "Apollospig"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "World's End Club coming to PlayStation 5",
        "score": 76,
        "text_content": "The PlayStation Store just put up a listing for a [PlayStation 5 port](https://store.playstation.com/en-us/concept/10013955) of *World's End Club*, one of the earliest games developed by Too Kyo Games, the studio jointly conceived by Kazukata Kodaka and Kotaro Uchikoshi, the respective creators of *Danganronpa* and *Zero Escape*. The game launched as an Apple Arcade exclusive in 2020 for iOS and macOS devices, before being ported to Nintendo Switch and PC (it's actually [on sale on Steam](https://store.steampowered.com/app/1570020/Worlds_End_Club/) right now if you're interested) the following year. The PS5 version has not been officially announced by publisher IzanagiGames as of yet. The game is a hybrid of side-scrolling puzzle-platformer and narrative adventure. Other than that the plot setup is basically *Danganronpa* with a crazed clown instead of sadistic bear. It's decent, the game's actually pretty visually stimulating with the comic book-esque art style, but it's honestly not the best post-Chunsoft game Kodaka's done so far, especially in terms of design and structure (Hundred Line is really good).",
        "comments": [
            {
                "raw_content": "Hope Hundred Line gets one, or a native Switch 2 version in the near future",
                "author": "robertman21"
            },
            {
                "raw_content": "It's not a bad game but probably my least favorite Kodaka project",
                "author": "Farnic"
            },
            {
                "raw_content": "The game was divided in two parts when it launched on Apple Arcade. The story is good but having played a few Kodaka games, it felt a bit like eating some food that has been clearly reheated. The gameplay was definitely the worst part of the experience. It's serviceable at best, but I feel like it would have been more enjoyable without.",
                "author": "Cetais"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Halo Studios will show \"what they're working on\" during the Halo World Championships in October",
        "score": 379,
        "text_content": "Just now, the Halo Waypoint has been updated with[ a new post](https://www.halowaypoint.com/news/halowc25-june) from eSports lead Tashi detailing the roadmap leading into the upcoming Halo World Championships in October. They also briefly address the mountain of speculation that was kickstarted with [RebsGaming's claim](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1kyzsdf/big_halo_annoucement_in_october/) that the franchise would be due for a bigger announcement of sorts that month. While citing how last year marked a turning point for the developer with the reveal that the series would be [shifting to Unreal Engine 5 development for future entries](https://news.xbox.com/en-us/2024/10/06/halo-studios-unreal-engine-interview/), Tashi indirectly confirms that \"at this year’s HaloWC, we look forward to continuing the conversation.\" Obviously, the elephant in the room is that since last year, reports have been abound that the newly rechristened studio is looking to repeat history by [remaking the original Combat Evolved yet again](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1ijag10/tom_warren_notepad_microsoft_considering_gears_of/) and potentially use it to bring Xbox's flagship to multiple other platforms like PlayStation 5. Rumors also emerged earlier this year that *The Master Chief Collection*, which collects every main entry in the series from *Combat Evolved* up to 343 Industries' *Halo 4*, would be [getting ported to both PlayStation 5 and the Nintendo Switch 2 ](https://www.videogameschronicle.com/news/nintendo-switch-2-is-reportedly-getting-two-major-xbox-games-including-halo/#google_vignette)this year as part of Microsoft's pivot towards agnostic games publishing. More recently, an ID linked to a potential *Halo* release of some kind was alleged to be [found on the PlayStation Network backend](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1l823jo/gruntapi_halo_dataminer_a_halo_game_is_coming/), suggesting some future project in the works that would release imminently.",
        "comments": [
            {
                "raw_content": "Halo CE remake reveal Interesting to see how Halo plays on UE5 Also Rebs Gaming reported on Halo having a bigger reveal at World’s a month or two ago, he’s turning out to be quite the reliable Halo leaker",
                "author": "HomeMadeShock"
            },
            {
                "raw_content": "I’ll forever be on copium when it comes to Halo I love the games too much",
                "author": "TRUFFELX"
            },
            {
                "raw_content": ">Obviously, the elephant in the room is that since last year, reports have been abound that the newly rechristened studio is looking to repeat history by remaking the original Combat Evolved **yet again** Yet again? Combat Evolved has never been remade. It was *remastered* in 2011, but that's not the same things as a remake.",
                "author": "Hot-Software-9396"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Elden Ring Tarnished Edition for Switch 2 has been rated by the ESRB",
        "score": 568,
        "text_content": "https://mynintendonews.com/2025/06/30/elden-ring-tarnished-edition-has-now-been-rated-by-esrb/ This could definitely be in the next Nintendo Direct.",
        "comments": [
            {
                "raw_content": "Bandai Namco also has their own show happening in a couple of days. It could also show up there.",
                "author": "Treesnip"
            },
            {
                "raw_content": "It'll probably be out sometime in the fall, Nintendo and FromSoftware likely both want it out before Duskbloods releases so that Nintendo fans who try Elden Ring for the first time will play Duskbloods next year.",
                "author": "timelordoftheimpala"
            },
            {
                "raw_content": "It would be hilarious if FromSoft added Nintendo-themed content for this special edition, like Hitman Switch 2 edition. On one hand, it might take you out of the game. On the other hand, imaging fighting a Miranda Flower that's been reskinned as a Piranha Plant.",
                "author": "Gwynthehunter"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Next Mainline Ghost Recon Game is Heading to Internal Alpha Later This Year - Insider Gaming",
        "score": 277,
        "text_content": "From Insider Gaming: \\- Next Ghost Recon hits internal Alpha this year with it targeted to last around 12 months. \\- Also current plans call for a new Ubisoft Forward in 2026 Source: [https://insider-gaming.com/ghost-recon-mainline-alpha/](https://insider-gaming.com/ghost-recon-mainline-alpha/)",
        "comments": [
            {
                "raw_content": "#Insider Gaming is a Tier 2 - Generally Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Is this still open world? Wildlands and sequel were still the only games that were inspired by MGS5. Really wish someone would make a military open world stealth game like Phantom Pain just without the anime sci fi stuff",
                "author": "Dodo1610"
            },
            {
                "raw_content": "how abour advanced warfighter 3.Been to long",
                "author": "Bootybandit6989"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "College Licensing Company recommends NCAA schools accept EA’s bid to bring back the College Basketball series",
        "score": 181,
        "text_content": "First release would be for the 2028-29 season and would include both men’s and women’s teams Source: https://www.extrapointsmb.com/p/memo-ea-sports-looks-to-bring-back-college-basketball-video-games-starting-in-2028-2029-0ef3",
        "comments": [
            {
                "raw_content": "Seems like [EA is already involved](https://www.instagram.com/p/DLh41E7AJ6v/?igsh=eTY0bDF3NXpuM3N2)",
                "author": "skyline7284"
            },
            {
                "raw_content": "Remember when ncaa 14 was absurdly expensive? Glad those days are past us",
                "author": "Legospacememe"
            },
            {
                "raw_content": "I wonder what this means for NBA Live then. I'd love a Road to Glory/Superstar save.",
                "author": "Andrew_Waples"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "SPARKLE announces Arc Pro B60 Passive and Blower GPUs, confirms dual-GPU version with 48GB and 300W TBP",
        "score": 41,
        "text_content": "",
        "comments": [
            {
                "raw_content": "unfortunately the 48GB card won't be priced for mere mortals https://www.reddit.com/r/LocalLLaMA/comments/1lokp88/intel_arc_pro_b60_dual_48g_turbo_maxsun_gpu/",
                "author": "tassa-yoniso-manasi"
            },
            {
                "raw_content": "\"passive\" is a huge technicality here as it still requires loud case flow-through fans to push enough case air to make it matter.",
                "author": "PsyOmega"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Samsung acquires rights to Intel semiconductor patents in strategic bid to avoid global IP disputes",
        "score": 28,
        "text_content": "Samsung Electronics has secured a broad license to a portfolio of semiconductor patents originally developed by Intel.",
        "comments": [
            {
                "raw_content": "They need to. Intel to be frank is one of the most innovative companies and I hope they will refocus on their core and disrupt again",
                "author": "Haunting_Salad8423"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "PC Build Questions, Purchase Advice and Technical Support Megathread — Q3 2025 Edition",
        "score": 6,
        "text_content": "Welcome to the r/AMD Q3 2025 PC build questions, purchase advice and technical support megathread — if you have questions about AMD hardware, need help with a purchasing decision, PC build question or require technical support, **please read this post in full, as the majority of issues or queries can be resolved or answered by trying the steps outlined in this post or visiting one of the recommended websites, subreddits or forums linked below.** Remember that r/AMD **is not** a technical support, purchase advice or PC building help subreddit. r/AMD is community run and does not represent AMD in any capacity unless specified — there is no guarantee anything posted in this thread or subreddit will be seen by AMD. If you want your query or issue is seen by AMD, please visit the [AMD Community Forums](https://community.amd.com/) or by contacting [AMD Support.](https://www.amd.com/en/support.html) If you've **discovered a bug and want to report it**, use the [AMD Bug Report Tool](https://www.amd.com/en/resources/support-articles/faqs/AMDBRT.html) and include as much information as possible — AMD can't fix something unless they know it exists and have enough information to reproduce it. The [AMD Community](https://discord.com/invite/012GQHBzIwq1ipkDg) and [AMD Red Team](https://discord.com/invite/k4wtjuQ) Discord servers are also available to ask questions and get help from other AMD users and PC enthusiasts. The [Wikipedia](https://www.reddit.com/r/Amd/wiki/index) also contains answers to common questions, troubleshooting tips, how you can check if your PC is stable, a jargon buster for FSR, RSR, EXPO, SAM, HYPR-RX and more. It's strongly recommended to read the [Wikipedia](https://www.reddit.com/r/Amd/wiki/index), in addition to what is detailed below, before you make any post in this thread. AMD Support also has many solutions and troubleshooting guides you may find helpful: * [AMD Software Help Center](https://www.amd.com/en/support/graphics/software.html) * [Troubleshooting Tips for Resolving System Stability Issues](https://www.amd.com/en/resources/support-articles/faqs/TS-TIPS.html) * [Troubleshooting System Stability Issues](https://www.amd.com/en/resources/support-articles/faqs/PIBRMATS2.html) * [Troubleshooting Common Boot Failures](https://www.amd.com/en/resources/support-articles/faqs/PIBRMATS1.html) * [How to Troubleshoot Power Supply Issues](https://www.amd.com/en/resources/support-articles/faqs/GPU-104.html) * [Troubleshooting CPU Performance and Temperature Issues](https://www.amd.com/en/resources/support-articles/faqs/PIBRMATS3.html) * [Information About PCIe Riser Cable and Extender Compatibility with PCIe Gen 4.0 Desktop Systems](https://www.amd.com/en/resources/support-articles/faqs/PA-270.html) **You may also want to consider the following subreddits, websites and forums, which may be more appropriate for your question or issue and may increase the chances of getting a helpful response**. --- r/AMDHelp: Troubleshooting help Subreddit for all things AMD! [PCPartPicker](https://pcpartpicker.com/): PCPartPicker provides computer part selection, compatibility, and pricing guidance for do-it-yourself computer builders. Assemble your virtual part lists with PCPartPicker and we'll provide compatibility guidance with up-to-date pricing from dozens of the most popular online retailers. We make it easy to share your part list with others, and our community forums provide a great place to discuss ideas and solicit feedback. r/buildapc: Planning on building a computer but need some advice? This is the place to ask! /r/buildapc is a community-driven subreddit dedicated to custom PC assembly. Anyone is welcome to seek the input of our helpful community as they piece together their desktop. r/pcmasterrace: Welcome to the official subreddit of the PC Master Race / PCMR! All PC-related content is welcome, including build help, tech support, and any doubt one might have about PC ownership. You don't necessarily need a PC to be a member of the PCMR. You just have to love PCs. It's not about the hardware in your rig, but the software in your heart! Join us in celebrating and promoting tech, knowledge, and the best gaming, study, and work platform there exists. The Personal Computer. [OBS (Open Broadcaster Software) Forums](https://obsproject.com/forum/): Discussion forums for OBS Studio, the free and open source software for video recording and live streaming. r/overclocking: All things overclocking go here. Learn to overclock, ask experienced users your questions, boast your rock-stable, sky-high OC and help others! r/techsupport: Stumped on a tech problem? Ask the community and try to help others with their problems as well. [ASRock Forum](https://www.asrock.com/support/forum.asp): Wanna discuss or find out something for your ASRock products? Come and get in ASRock worldwide forums to chat with ASRock global users! [ASUS Republic of Gamers (ROG) Forums](https://rog-forum.asus.com/): Discuss and discover the best ways to make the most out of your ROG gear. [MSI Global English Forum](https://forum-en.msi.com/index.php): Need more people to discuss with? Click here to find help. r/buildapcforme: A subreddit dedicated to helping those looking to assemble their own PC without having to spend weeks researching and trying to find the right parts. From basic budget PCs to HTPCs to high end gaming rigs and workstations, get the help you need designing a build that precisely fits your needs and budget. r/GamingLaptops: Definitive hub for gaming laptop enthusiasts—insights, reviews, news, expert advice, and latest trends. r/SuggestALaptop: A place for prospective laptop buyers to get suggestions from people who know the intimate details of the hardware. --- If you are having an issue with or need to raise an RMA for a product not directly from AMD, you may want to consider contacting the manufacturer of your laptop, graphics card, motherboard or system. Below we have linked the support pages for the most common brands and manufacturers that sell AMD graphics cards, motherboards and systems. --- [XFX Support](https://www.xfxforce.com/support/contact-us) [SAPPHIRE Customer Service](https://support.sapphiretech.com/Default.asp?lang=eng) [PowerColor Service Support](https://www.powercolor.com/contact) [MSI Service And Support](https://www.msi.com/support) [Gigabyte Support Services Center](https://www.gigabyte.com/Support) [ASRock Support](https://www.asrock.com/support/) [ASUS Support](https://www.asus.com/support/) [Dell/Alienware Support](https://www.dell.com/support/home/) [HP Customer Support](https://support.hp.com/) [Lenovo Technical Support](https://support.lenovo.com/) [ACER Support](https://www.acer.com/support) --- # READ BEFORE POSTING — READ BEFORE POSTING — READ BEFORE POSTING If you are experiencing any issues, including, but not limited to; games or programs crashing, system crashes, hangs, blue screens of death (BSoD), driver timeouts, system not starting, system freezes, data corruption, system shutting down unexpectedly, visual artifacts, lower than expected performance or any other issue, **please read and try the following before making a post** — the majority of problems can be resolved by trying the steps listed below. The suggestions below are not necessarily in any particular order, if a step has already been performed or is not relevant, please move to the next step. * If your system won't power on, make sure all cables are plugged in and seated correctly, that the power supply is plugged into a working wall outlet and any switches on the wall outlet and/or power supply are in the ON position. It's also worth check your front panel connectors to make sure they are connected properly and trying a different wall outlet. * If you have any power related issues, like your system not starting, shutting down, sleeping, restarting or waking from sleep, try to test with another power supply, as unstable voltages (such as on the 12V, 5V, 5VSB and 3.3V rails) can cause a myriad of issues that can be inconsistent and hard to diagnose. * Make sure your memory modules (RAM) are installed in the primary DIMM slots, as some motherboards will not POST (Power-on self-test) if the memory is installed in the secondary DIMM slots. The primary DIMM slots should be labelled on the motherboard or specified in the motherboard manual. * If your system does power on, but won't get past the POST screen, please ensure your CPU, RAM and GPU are installed correctly and try clearing the CMOS. This can usually be done by disconnecting the motherboard from power and removing the CMOS battery for a few minutes. Some motherboards may also have clear CMOS reset jumpers or buttons you can use, please consult your motherboard or system manual on how to clear the CMOS. * If your system still won't POST, check if your motherboard has a Debug LED and consult your motherboard manual to check what step it's stuck on. * Make your motherboard is compatible with the CPU you have — most AM4 and AM5 motherboards should have BIOS flashback, which will allow you to update the BIOS without needing a CPU or RAM installed. Consult your motherboard manual as the BIOS flashback procedure will very depending on the make and model. When using BIOS flashback, we recommend using a USB 2.0 drive that is 8GB or less and formatted as FAT32, as some implementations of BIOS flashback don't work reliably with USB 3.0 drives and/or USB drives that are larger than 8GB. * If you are using an AMD Radeon RX 6000, RX 7000, RX 9000 or NVIDIA GeForce RTX 30, RTX 40 or RTX 50 GPU, please ensure you are using separate 6 - 8pin PCIe cables or dedicated 12VHPWR/12V-2x6 cables and not using daisy-chained or splitter cables, as these may not be able to supply adequate power to the GPU — some cards may have LED indicators by the connector to let you know if the GPU isn't receiving enough power. Please consult your GPU and PSU manual for information on how to correctly connect your GPU. * Make sure your Monitor or TV is plugged into the HDMI or DisplayPort output from your graphics card and not the motherboard. If this still doesn't work, try a different Monitor or TV and if you are using any HDMI or DisplayPort adapters, converters or splitters, remove these and use a direct connection, try switching between HDMI and DisplayPort and try different HDMI or DisplayPort cables to rule out any problems here. For best results, always use certified HDMI or DisplayPort cables. * Make sure you are running the latest software updates for your operating system, games and applications. * Scan your PC for any viruses or malware using Windows Security (formerly Windows Defender) or other reputable Anti-Virus or Anti-Malware solution, as malware, viruses, adware and other unwanted software can cause crashes, freezes, hangs and other performance, security, stability and compatibility issues. * Make sure you are running the latest [AMD Chipset or Graphics Drivers](https://www.amd.com/en/support/download/drivers.html). Some devices, such as laptops and handhelds may have custom hardware IDs or other manufacturer changes, in which case, you may have to download drivers from the device manufacturer's support page. * If you need to reinstall GPU drivers, we recommend using the [AMD Cleanup Utility](https://www.amd.com/en/resources/support-articles/faqs/GPU-601.html) or [Display Driver Uninstaller (DDU)](https://www.wagnardsoft.com/display-driver-uninstaller-DDU-) to perform a clean installation of the GPU drivers, a guide on how to use DDU can be found [here](https://docs.google.com/document/d/1xRRx_3r8GgCpBAMuhT9n5kK6Zse_DYKWvjsW0rLcYQ0/edit) * If you have installed GPU drivers after using the AMD Cleanup Utility or DDU, you may experience stutter in some games while the shaders are cached again. * If Windows Update is replacing your GPU drivers (example of what that looks like [here](https://imgur.com/a/DLLMZ3L)) please [view the following thread](https://www.reddit.com/r/Amd/comments/1hdjxba/guide_how_to_resolve_windows_update_installing/) on the steps you can take to resolve and prevent this happening in future. * If you are on Windows 10 or Windows 11 and experience flickering, stuttering or brightness issues during gaming or video playback with hardware acceleration enabled, try disabling Multiplane Overlay (MPO), as some users have reported this has resolved their issues — more information on disabling MPO is available in this [thread](https://www.reddit.com/r/Amd/comments/yvyqc7/disabling_multiplane_overlay_mpo_fixed_all/). * If a game is crashing, freezing, not starting, performing poorly or having other issues, please verify and repair the game files through [Steam](https://help.steampowered.com/en/faqs/view/0C48-FCBD-DA71-93EB), [Epic Games Store](https://www.epicgames.com/help/en-US/c-Category_EpicGamesStore/c-EpicGamesStore_LauncherSupport/how-do-i-verify-game-files-in-the-epic-games-launcher-a000084923#:~:text=Find%20the%20game%20in%20your,Click%20the%20Verify%20button), [Ubisoft Connect](https://www.ubisoft.com/en-us/help/connectivity-and-performance/article/verifying-game-files-in-ubisoft-connect-pc/000060529), [EA App](https://answers.ea.com/t5/EA-Services-General-Questions/How-to-verify-game-files-of-installed-games/m-p/6578960), [GOG Galaxy](https://support.gog.com/hc/en-us/articles/360003930017-My-game-data-is-corrupt-How-can-I-repair-my-game), [Battle.net](https://battle.net/support/article/7655) or whichever game client you are using. * If a program is crashing, freezing, not starting, performing poorly or having other issues, please reinstall the program or attempt to repair the installation using the program installer/uninstaller. * If you are on Windows and are experiencing stuttering or lower than expected performance, make sure you are using the Balanced or High Performance power plan and restore them to their default values, this can be checked under Control Panel > System and Security > Power Options. * Make sure you are using the latest BIOS, Firmware and Drivers for your motherboard, laptop, desktop and any other components and peripherals you have connected to your system. These updates often contain bug fixes, new features and improve compatibility and interoperability. * If you have any overclocks, underclocks, overvolts, undervolts, custom power curves or similar: **revert everything to stock clocks, timings, voltages and settings**, this includes disabling XMP/EXPO/DOCP — to do this, go into your BIOS and restore the factory settings — this is typically labelled 'Restore Default', 'Restore Optimized Defaults', 'Load Optimized Defaults' or some similar variation. If you are using other utilities like MSI Afterburner or Ryzen Master, you may also have to restore default settings in those utilities as well. * If you are using Windows 10 or Windows 11, use the built-in System File Checker (SFC) and Deployment Image Servicing and Management (DISM) commands to check for any corrupt or missing operating system files and attempt to repair them, a guide is available here * If you have a custom built PC, recently upgraded, started overclocking or want to know if your current PSU will support a hardware upgrade, please use one of the *below PSU calculators* and make sure the PSU you have (or intend to buy) can supply enough power when your system is under full load — If your PSU isn't able to supply enough power, you are likely to have issues starting your system and may experience system shutdown when under load. * PSU Calculators: [FSP](https://www.fsplifestyle.com/landing/calculator.html) — [Cooler Master](https://www.coolermaster.com/power-supply-calculator/) — [Seasonic](https://seasonic.com/wattage-calculator) — [Newegg](https://www.newegg.com/tools/power-supply-calculator/) — [be quiet!](https://www.bequiet.com/en/psucalculator) — [MSI](https://www.msi.com/power-supply-calculator) — You can also add all your components into [PCPartPicker](https://pcpartpicker.com/list/) and it will provide an estimate wattage. * Try and apply common sense to an issue, for example if you have flickering on your TV or Monitor, try simple things like changing the HDMI or DisplayPort cable and port on the GPU and display you are using. If you've recently installed a mod and that game now crashes, uninstall that mod. If one of your memory modules is no longer being detected, is there any physical damage to the memory module, DIMM slot on the motherboard or pins, have you tried reseating it etc... * If you experience crashes, freezes, unexpected shutdown or just want to check if your system is stable, you can stability test your system with the utilities linked below. Remember that **just because your system turns on, doesn't make it stable** and that overclocking is not guaranteed and can vary depending on the setup you have and the silicon lottery of your CPU/GPU/RAM, you should always thoroughly stability test your system — many reading this post will have unstable systems and won't even know it. --- [OCCT](https://www.ocbase.com/occt/personal) — OCCT is the only comprehensive stability testing software available. 20 years of experience have proved OCCT to be the community's software of choice in terms of stability and performance testing. CPU, GPU, Memory, VRAM, Power supplies are tested in the most efficient and accurate way possible. If there's anything wrong, we'll find it and report it. OCCT includes many advanced features, ranging from per-core CPU testing, varying GPU loads, and much more. [Prime95](https://www.mersenne.org/download/) — Prime95 has been a popular choice for stress / torture testing a CPU since its introduction, especially with overclockers and system builders. Since the software makes heavy use of the processor's integer and floating point instructions, it feeds the processor a consistent and verifiable workload to test the stability of the CPU and the L1/L2/L3 processor cache. Additionally, it uses all of the cores of a multi-CPU / multi-core system to ensure a high-load stress test environment. [AIDA64 Extreme](https://www.aida64.com/downloads/latesta64xe) — AIDA64 Extreme is an industry-leading system information tool, loved by PC enthusiasts around the world, which not only provides extremely detailed information about both hardware and installed software, but also helps users diagnose issues and offers benchmarks to measure the performance of the computer. [Furmark 2](https://geeks3d.com/furmark/downloads/) — FurMark 2 is the successor of the venerable FurMark 1 and is a very intensive GPU stress test on Windows (32-bit and 64-bit) and Linux (32-bit and 64-bit) platforms. It's also a quick OpenGL and Vulkan graphics benchmark with online scores. FurMark 2 has an improved command line support and is built with GeeXLab. [MSI Kombustor](https://geeks3d.com/furmark/kombustor/downloads/) — MSI Kombustor is MSI's exclusive burn-in benchmarking tool based on the well-known FurMark software. This program is specifically designed to push your graphics card to the limits to test stability and thermal performance. Kombustor supports cutting edge 3D APIs such as OpenGL or Vulkan. [MemTest86](https://www.memtest86.com/download.htm) — MemTest86 boots from a USB flash drive and tests the RAM in your computer for faults using a series of comprehensive algorithms and test patterns. Bad RAM is one of the most frustrating computer problems to have as symptoms are often random and hard to pin down. MemTest86 can help diagnose faulty RAM (or rule it out as a cause of system instability). As such it is often used by system builders, PC repair stores, overclockers & PC manufacturers. [MemTest86+](https://memtest.org/) — Memtest86+ is a stand-alone memory tester for x86 and x86-64 architecture computers. It provides a more thorough memory check than that provided by BIOS memory tests. Memtest86+ can be loaded and run either directly by a PC BIOS (legacy or UEFI) or via an intermediate bootloader that supports the Linux 16-bit, 32-bit, 64-bit, or EFI handover boot protocol. It should work on any Pentium class or later 32-bit or 64-bit x86 CPU. [SeaTools](https://www.seagate.com/support/downloads/) — Quickly determine the condition of the drive in your computer with this comprehensive, easy-to-use diagnostic. --- For more advanced SSD/HDD diagnostic utilities, please check the website of your SSD/HDD manufacturer, as they usually offer manufacturer specific software to check the health of the drive and update drive firmware, some examples include [Samsung Magician](https://semiconductor.samsung.com/consumer-storage/magician/), [SanDisk Dashboard](https://support-en.sandisk.com/app/answers/detailweb/a_id/31759), [Western Digital Kitfox](https://support-en.wd.com/app/answers/detailweb/a_id/51537/~/download%2C-install%2C-test-drive-and-erase-using-western-digital-kitfox), [Corsair SSD Toolbox](https://www.corsair.com/downloads) and [Crucial Storage Executive](https://www.crucial.com/support/storage-executive). Some motherboards, laptops and desktops may also have built-in BIOS diagnostic utilities to stress test certain components or the entire system. Please consult your motherboard or system manual for more information. A truly stable system should be able to run any of these utilities or built-in diagnostics without any crashes, freezes, errors or other issues. These utilities can help you narrow down which component(s) in your system are faulty, aren't installed correctly or have unstable overclocks, underclocks, overvolts, undervolts, custom power curves etc... If you require help using any of these programs, please read the help sections on each website or use Google and YouTube, as there are a plethora of guides and tutorials available. If you have tried all of the above and are still facing the same issue, please **backup any important files/data** and perform a reinstall/clean install of Windows, using a USB or DVD. **Only use Windows ISO images that come directly from Microsoft.** The latest Windows 10 and Windows 11 ISO images can be downloaded from the Microsoft [Software Download](https://www.microsoft.com/software-download/) page and you can create a bootable USB or DVD by using the Media Creation Tool. It's not recommended to use utilities or programs which modify Windows or to use 3rd party, custom or slimmed Windows ISO images, as these are non-standard ISO images, they could have viruses, malware and may cause stability and compatibility issues. If you have done all the above steps and are still facing an issue, please follow the below template for submitting a request, the more detail you can include the better. **If you post something like 'pc crashes', don't list your PC specifications, what you've tried to resolve the issue or don't provide any helpful information, then don't expect a response, as there's not enough useful information to go on and it will be assumed you haven't read this post or tried any of the steps outlined above.** *Below is an example template you could use...* **Summary of the issue**: The Last of Us Part II Remastered will crash when compiling shaders with Adrenalin 25.6.2, this is not an issue if you revert to the WHQL Adrenalin 25.6.1 drivers **What I've tried to solve the issue**: I have reinstalled 25.6.2 with the AMD Cleanup Utility, reset my in-game graphics settings, verified game files in Steam and re-compiled shaders to confirm the issue. **System specifications:** * Operating System: Windows 11 24H2, OS Build 26100.4482 (Windows Key + R and type winver) * CPU: AMD Ryzen 5 9600X, default settings, cooled by Cooler Master MasterAir MA824 Stealth * GPU: Sapphire Radeon RX RX 9060 XT Nitro+, default settings * Motherboard: MSI MAG B850M MORTAR WIFI with 7E61v1A4 BIOS * RAM: G.Skill Trident Z5 Neo RGB (F5-6000J3238F16GX2-TZ5NR) 32GB DDR5-6000 CL32 with EXPO enabled * Storage: 1TB Samsung 9100 PRO, using motherboard heatsink * PSU: be quiet! Power Zone 2 750W * Display: MSI 27\" MAG 271QPX QD-OLED E2 240Hz OLED with Certified Ultra High Speed HDMI Cable If you are using a prebuilt PC or don't know your full specifications, please include as much information as you can, e.g, HP Z2 Mini G1a workstation with an AMD Ryzen AI MAX+ PRO 395, AMD Radeon 8060S Graphics, 128GB RAM, 2TB SSD and Windows 11. Please include any logs, dump files, videos, screenshots and images of the inside of your case and setup, as this will assist in answering questions relating to airflow, cabling and component installation. We would like to reiterate that r/AMD is community run and does not represent AMD in any capacity unless specified — there is **no guarantee anything posted in this thread or subreddit will be seen by AMD.** If you have any suggestions on how to improve this megathread or the Wikipedia, please [message us](https://www.reddit.com/message/compose/?to=/r/Amd) with your suggestion.",
        "comments": [
            {
                "raw_content": "Any news on when the AMD 5500X3D is going on sale? Like anywhere,m",
                "author": "Healthy_Wasabi_8623"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Software: Adrenalin Edition 25.6.3 Optional Update Release Notes",
        "score": 213,
        "text_content": "**Highlights** * New Game Support for AMD FidelityFX™ Super Resolution 4 (FSR 4) * Monster Hunter Wilds * Grand Theft Auto V Enhanced * See the complete list of supported AMD FSR 4 games [here](https://community.amd.com/t5/gaming-discussions/latest-amd-fsr-2-3-4-amp-radeon-anti-lag-2-supported-games-list/m-p/549534) **Fixed Issues and Improvements** * AMD FidelityFX™ Super Resolution 4 (FSR 4) is not enabled while playing DragonKin: The Banished, Blades of Fire, RoadCraft, The Alters, and S.T.A.L.K.E.R. 2: Heart of Chornobyl on Radeon™ RX 9000 series graphics products. * Intermittent system or application crash maybe observed while playing Black Myth: WuKong on Radeon™ RX 7650 GRE graphics products. * Texture flickering or corruption may appear while playing The Elder Scrolls IV: Oblivion Remastered with AMD FidelityFX™ Super Resolution enabled on Radeon™ RX 9070 XT. **Known Issues** * Stutter may be observed while playing games with some VR headsets at 80Hz or 90Hz refresh rate on some AMD Radeon™ Graphics Products such as the Radeon™ RX 7000 series. Users experiencing this issue are recommended to change the refresh rate as a temporary workaround. * Intermittent system or application crash may be observed while playing Cyberpunk 2077 on some AMD Radeon™ Graphics Products such as the Radeon™ RX 7000 series and Radeon™ RX 9000 series. * Intermittent application crash or driver timeout may be observed while playing Monster Hunter Wilds with Radeon™ Anti-Lag and Instant Replay enabled. * Stutter may be observed while playing Call of Duty®: Warzone™ Season 03 ‘Verdansk’ map on some AMD Graphics Products. * Stutter and lower than expected performance may be observed while playing 4K resolution YouTube videos in Chrome. Users experiencing this issue are recommended to play videos in full screen as a temporary workaround. **Package Contents** * AMD Software: Adrenalin Edition 25.6.3 Driver Version [25.10.13.09](http://25.10.13.09) for Windows® 10 and Windows® 11 (Windows Driver Store Version 32.0.21013.9005). * Ryzen™ AI NPU MCDM Driver version 32.00.0203.280 (Date: 2025-05-16)",
        "comments": [
            {
                "raw_content": "I'm assuming AMD FSR4 is only for 9000 series cards?",
                "author": "icanttinkofaname"
            },
            {
                "raw_content": "I thought MHWilds already had FSR4 support? Or is this different to the override?",
                "author": "superjake"
            },
            {
                "raw_content": "I'm so far not having any crashes in Cyberpunk on my 9060 XT on 25.6.1. I wonder if I should hold off on upgrading until I am done with it",
                "author": "acewing905"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Condo crisis grows as 75-year-old HOA goes bankrupt under $50M debt... experts warn more at risk",
        "score": 864,
        "text_content": "",
        "comments": [
            {
                "raw_content": "From the article: > According to an online filing, the Sunset Palm Villas Condominium Association in Miami filed for Chapter 11 bankruptcy, listing debts of up to $50 million, while holding no more than $1 million in assets. > While the court documents don't reveal exactly what triggered the financial collapse, experts say HOA bankruptcies usually stem from a toxic mix of problems: poor financial planning, underfunded reserves, emergency repairs, missed dues, and sometimes even fraud or embezzlement. > **The list of creditors after the HOA is exhaustive.** > **It includes** multiple law firms, engineering companies, **The United States Internal Revenue Service**, Miami-Dade County’s Department of Regulatory and Economic Resources, **Miami-Dade County Tax Collector**, Miami-Dade County Water & Sewer Department, **The United States Attorney General**, and more > **The homeowners in the community will now be held accountable for a portion of the debts of the HOA**, and the HOA may seek to recoup its losses through special assessments, which homeowners are legally obligated to pay. > If they refuse to or can’t afford to, **the HOA may pursue collections or even liquidate personal property to pay down debts.** Yeah, there is no way in hell I am going anywhere near a Florida condo. This is way beyond insane.",
                "author": "ColorMonochrome"
            },
            {
                "raw_content": "The photo shows high dollar condos in south beach. The article refers to these low priced condos far from the beach. [https://maps.app.goo.gl/53tTiDfHJKB5j64G9](https://maps.app.goo.gl/53tTiDfHJKB5j64G9)",
                "author": "trapped_in_florida"
            },
            {
                "raw_content": "At 75 years old that means the condos were built in 1950. In Florida. They probably need to be demolished and rebuilt. And that's gonna involve an asbestos cleanup. Just get every owner to pony up another $1.5 mil and get to it. Here is another problem with condos. In a SFH you at least own the land under and can do a California Remodel in place.",
                "author": "aquarain"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Housing Market Warning Issued: 'No One Is Buying New Homes'",
        "score": 237,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If my area is anything like the rest of the country, it’s because they’re all “luxury homes” in the $1M+ range that are built like trash and in random desolate parts of town.",
                "author": "Jaggleson"
            },
            {
                "raw_content": "Not exactly surprising, given that the new builds tend to be priced on the higher side and also poorly located relative to existing homes. Having a glut of homes that *must* sell is great for price discovery in the local market, though.",
                "author": "Fresh-String6226"
            },
            {
                "raw_content": "Guys people are buying homes, they just have to be priced correctly. Home builders aren't having a problem selling homes right now. They're cutting prices.",
                "author": "RedParaglider"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The Worst Housing Market in America Is Now Florida’s Cape Coral",
        "score": 38,
        "text_content": "[https://archive.ph/PpnMn](https://archive.ph/PpnMn) * The city saw a massive boom during the pandemic, attracting remote buyers via Zoom showings and sight-unseen purchases. * Overbuilding during the housing rush has now outpaced demand. * Skyrocketing insurance premiums and hurricane risk have added significant cost burdens for homeowners. * Many properties are now worth less than what buyers paid just a few years ago. * Local real estate professionals expect continued price declines, especially in overbuilt areas. * Some fear this trend will mirror the 2008 crash, though broader economic fundamentals differ.",
        "comments": [
            {
                "raw_content": "The canary in a shitty coal mine full of overpriced trash.",
                "author": "Dry-Interaction-1246"
            },
            {
                "raw_content": "It was kinda obvious, doubt is gonna be like 08, this more like Florida/Texas problems",
                "author": "Mr-cacahead"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Spent way too much time analyzing this housing market and I think we’re in trouble",
        "score": 301,
        "text_content": "I’ve been tracking this market like a hawk. Prices, inventory, income ratios, builder sentiment, delinquencies, and I’ll just say it: 2025 looks *worse* than 2006 by most metrics. Here’s a breakdown of what I’m seeing that nobody on CNBC wants to talk about: # Affordability is completely broken * Median home price is now $356,000. Back in 2000? [It was $119K.](https://www.fixr.com/articles/single-family-home-affordability) * But incomes didn’t even come close to keeping up. It's up just 40% since 2000. * In CA, you now need **$234K/year** to afford a [median home.](https://lao.ca.gov/LAOEconTax/Article/Detail/793) * Nationally, monthly housing costs are averaging **$2,412**, which is **35% of income** for the *average* buyer. * That’s *insane*. The historical cap for sustainable affordability has always been \\~30%. People aren’t just stretched...they’re drowning. Especially if they bought in the last 12 months. # Inventory is spiking… and so are price cuts This is one of the clearest red flags right now: * Active inventory is up 31.5% YoY, now over 1 million listings**.** First time [since 2019](https://www.realtor.com/research/may-2025-data/) * 1 in 5 homes listed in May had a price cut. That’s the highest ever tracked * In Arizona and Texas, we’re seeing 35–37% price cut rates It’s not that people *don’t* want to buy. They just *can’t* at these prices with 6.8% mortgage rates. # Sunbelt is leading the crash The pandemic darlings are crumbling first: * Austin has [91% more](https://jbrec.com/insights/supply-demand-shapes-regional-housing-trends-2025/) homes for sale than in 2019, prices falling * Florida home values are actually down YoY * Tampa and Charlotte are overloaded with new construction and underwater flippers Compare that to places like Boston or NYC? Inventory is still tight. But those markets didn’t balloon as hard post-COVID. # Builders are slamming the brakes Developer sentiment is collapsing: * Builder confidence dropped to 32 on the HMI—third lowest since 2012 * Housing starts are down 9.8% * There are now 285,000 more homes being completed than started Translation: builders are finishing what they started, then getting the hell out of the way. # Mortgage market is flashing warnings * 30-year rates are hovering around 6.85% * VA loan foreclosure rate is the highest since 2019 * Total household debt hit $18.2 TRILLION in Q1 * Mortgage delinquencies just ticked up again We’re not in 2008 subprime territory, but the cracks are showing. Especially for maxed-out DTI borrowers in bubble markets. # This is a bubble…just a different flavor than 2008 * Lending is cleaner (better credit scores, real down payments) * But affordability is worse * Inventory is rising * Buyer demand is collapsing in key regions * And the Fed isn’t cutting anytime soon People keep asking *“where’s the crash?”* but IMO we’re already in a slow-motion correction that’s just starting to pick up speed. I see three possible paths from here: 1. Gradual deflation (most likely): 10–15% national decline, deeper in Sunbelt 2. Hard crash: 20–30% drop over 2–3 years if unemployment spikes 3. Sideways grind: 0–5% growth, but with affordability getting even worse Either way, I don’t think this ends with prices just going sideways forever. Something’s gotta give. Curious what everyone else is seeing. Especially in the Sunbelt or second-tier markets. Anyone seeing panic selling yet? Builders offering deep incentives? Inventory sitting longer than expected? Btw, I run something called [Dealsletter](http://www.dealsletter.io). Where I track distressed or investor-ready deals (mostly BRRRRs, flips, etc.), but I’ve also started using it to flag regional cracks and overpriced listings. Happy to share if you’re into data-heavy stuff like this.",
        "comments": [
            {
                "raw_content": "Did you actually research or did you tell ChatGPT deep research to do it? No offense, but this post is a direct copy and paste from an AI chatbot",
                "author": "Longjumping-Speed511"
            },
            {
                "raw_content": "Just my estimation but I think a larger problem coming up is that we haven’t built enough variety in housing. We’ve become too reliant on these two story neighborhood housing that all look alike but are also priced to sell at 200,000 or more but there won’t be a lot of takers in the next decade as COL keeps rising in other areas and climate change. white collar job displacement from tech level out. A modern version of the one story and a basement housing a lot of us grew up in should have been more prevalent in an America with less smaller families",
                "author": "Content_Source_878"
            },
            {
                "raw_content": "Honestly, I don’t think housing will crash in the foreseeable future, but I also doubt it will appreciate in line with inflation. There are a lot of structural issues with housing that people aren’t talking about. This isn’t just a bubble from low rates, it’s also tied deeply to demographics. Baby boomers are retiring en masse, and a huge portion of their net worth is tied up in housing. Many also own rental homes because it was such a popular investment over the past few decades. The biggest issue almost no one talks about is the skilled trades shortage that’s set to explode in the 2030s. Maintaining all these oversized McMansions is going to become extremely expensive when there simply aren’t enough electricians, HVAC techs, plumbers, or roofers to go around. That’s not something interest rates can fix. Speaking of rates, there’s honestly no realistic way the Fed can drop them back to ZIRP (zero interest rate policy) levels without tanking the dollar or reigniting runaway inflation. Most serious forecasts see a new normal of higher-for-longer, think 4–5% mortgage rates at best, not 2–3% again. If we do see a true crash, it’ll likely be in the 2030s, driven by maintenance costs spiraling and boomers selling off properties as they shift into assisted living. Aging in place is getting more expensive, not less. Ironically, homes designed for downsizing, smaller, efficient layouts in walkable areas, could actually appreciate heavily, because they’ll match what the market needs. Bottom line: the entire narrative that “housing always goes up” ignores both demographics and the trades crunch. Long term, that’s going to reshape what types of homes actually hold value.",
                "author": "cookiekid6"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Surprising rise in mortgage delinquencies: Here's what to know (CNBC)",
        "score": 127,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Here's what we know: people be broke.",
                "author": "New-Acadia-6496"
            },
            {
                "raw_content": "Given that Americans are carrying bigger credit card balances, credit card delinquencies are on the rise, and auto loan delinquencies are on the rise, I would love to see a Venn Diagram of those who took out mortgages between October 2022 - Present and those who are delinquent on credit card payments and/or auto loan payments. My hypothesis is that a ton of households took out bad (ie. risky) mortgages just to get into a house hoping to refinance at a more attractive (ie. affordable) interest rate in the very near future. Since mortgage rates aren't going to be decreasing to below 4% anytime soon, they are choosing to go into credit card and/or auto loan debt instead of defaulting on the mortgage. This, of course, is not a recipe for success and will only last so long before sh\\*t hits the fan.",
                "author": "wes7946"
            },
            {
                "raw_content": "I have said here many times mortgage delinquencies and foreclosures are very very lagging indicator in 06 we were at near all time lows and we all know what happened in span of 2 years. It’s always better to look at metrics like Consume debt, CC delinquency, savings rate and late payments. All of which were degrading rapidly.",
                "author": "Dmoan"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Residential real estate over/undervaluation since 1890",
        "score": 18,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's almost like the gold standard mattered",
                "author": "LBC1109"
            },
            {
                "raw_content": "Basically you need a recession for home prices to correct. At that point you're probably out of a job and can't get a loan so you're not buying anyway.",
                "author": "Sufficient-Flower775"
            },
            {
                "raw_content": "2026 market correction.",
                "author": "Global_Plastic_6428"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Exit from the “Lock-in” Effect Slowed in Q1 as Home Sales Deteriorated Further and Supply Spiked",
        "score": 13,
        "text_content": "https://wolfstreet.com/2025/06/30/exit-from-the-lock-in-effect-slowed-in-q1-as-home-sales-deteriorated-further-and-supply-spiked/ Exit from the “Lock-in” Effect Slowed in Q1 as Home Sales Deteriorated Further and Supply Spiked | Wolf Street By the time they finally wanted to sell their home, it wasn’t easy anymore because demand had plunged, and fewer of those mortgages got paid off. By Wolf Richter for WOLF STREET.",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The Depression of 2026, by Fred Foldvary, Ph.D. | Progress.org",
        "score": 74,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Whoa. From 2012. Pretty accurate in how it described the reasons why, and seemingly spot on in when. The piece left out is what is the mechanism to do it. It’s my contention that 2020 would have done more damage, but political indifference allowed for massive inflation to take the place of economic recession (or worse).",
                "author": "Sunny1-5"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Men are opening up about mental health to AI instead of humans",
        "score": 391,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If you tell another man they say “damn that sucks” They don’t tell women out of fear of them getting “the ick” Ai says “I’m sorry to hear you’re experiencing that. Here is a list of some of the things that help:”",
                "author": "Coochiespook"
            },
            {
                "raw_content": "What do you expect when most men are ridiculed for showing weakness there whole lives.",
                "author": "dachloe"
            },
            {
                "raw_content": "Im just happy men (or people in general) are seeking ANY kind of therapy!",
                "author": "YouAboutToLoseYoJob"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "He wants the AGI first meaning he wants the AGI first",
        "score": 308,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ai researchers are becoming pro athletes 🤣",
                "author": "Kriyative108"
            },
            {
                "raw_content": "lol - these look like trading cards for AI leaders. They should list their AI experience, specialties, education, and salaries on the back.",
                "author": "AppropriateScience71"
            },
            {
                "raw_content": "https://preview.redd.it/01pxmdbkk5af1.jpeg?width=500&format=pjpg&auto=webp&s=dfa580635d36a0a5cfe87322baf8773a9430d3bc",
                "author": "IlustriousCoffee"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OAI researcher Jason Wei says fast takeoff unlikely, will be gradual over a decade for self improving AI",
        "score": 455,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What a random time to see something about Tlingit. The people in my hometown speak that.",
                "author": "IllustriousWorld823"
            },
            {
                "raw_content": "Singularity by 2035 doesn't sound too bad. If we make it...",
                "author": "Atlantyan"
            },
            {
                "raw_content": "Any amount of years will appear as a fast take off when We look back at the charts 100 years from now.",
                "author": "JSouthlake"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Meta's new superintelligence team will receive a $10M+/yr package each.",
        "score": 502,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fuck me they got Jack Rae, I did not expect that...",
                "author": "manubfr"
            },
            {
                "raw_content": "Jeez isn’t this a disaster for OpenAI?",
                "author": "Glizzock22"
            },
            {
                "raw_content": "This is basically proof that OpenAI doesn’t have some internal model that’s much more advanced than the released ones let alone an internal AGI",
                "author": "DaedricApple"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Why are people so against AI ?",
        "score": 1694,
        "text_content": "37k people disliking AI in disgust is not a good thing :/ AI helped us with so many things already, while true some people use it to promote their lazy ess and for other questionable things most people use AI to advance technology and well-being. Why are people like this ?",
        "comments": [
            {
                "raw_content": "your 37k interpretation from karma makes no sense",
                "author": "UnableMight"
            },
            {
                "raw_content": "Because there is no explicit intent by anyone to make these technologies benefit the working class, people see it as a way for capitalists to widen the wealth gap. And the environmental impact doesn’t seem justified to most at this point. And humans still want humans to create things that require creativity, having a machine do it makes it lose authenticity and just screams dystopia",
                "author": "TriscuitTime"
            },
            {
                "raw_content": "People don't hate AI, they hate the current world plus, AI, and that is very different",
                "author": "Adventurous_Hair_599"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Alexandr is now the Chief AI Officer of Meta",
        "score": 68,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Are all the new Poached employees reporting to wang?? Seems like a lot of the poached employees are more qualified, no?",
                "author": "Illustrious_Safe7658"
            },
            {
                "raw_content": "https://i.redd.it/he2fipybk6af1.gif",
                "author": "thegoldengoober"
            },
            {
                "raw_content": "I can’t help but think that OpenAI made the mistake of giving the best models to the public through ChatGPT. And now we can finally go back to being stooges of Meta, consuming AI generated slop and clicking on AI generated ads and interacting with AI generate avatars.",
                "author": "AntNew2592"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Apple is considering using AI technology from Anthropic or OpenAI to power Siri!",
        "score": 183,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I posted this elsewhere; their failure with Siri is pretty legendary. 15 years ago they launched it. Ahead of the curve. Mostly novelty. But functional. Somehow 15 years later its less competent, less useful, less everything. And this is during the rise of AI. Its truly an impressive blunder.",
                "author": "faithOver"
            },
            {
                "raw_content": "Guess they finally admitted defeat. Still remember that interview from an exec being all smug \"oh we're not worried\"",
                "author": "ComatoseSnake"
            },
            {
                "raw_content": "anyone read the article before commenting? \\- Apple has talked to and already worked with both Anthropic and OpenAI to test their models in Apple cloud compute \\- This allows Siri to use these models for world knowledge and Apple to use its own models (cloud and local) for Siri app context \\- the only thing missing from Apple models was world knowledge and using either Anthropic or OpenAI Solves so user doesn't need to go to external server.",
                "author": "hasanahmad"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "4 out of the top 10 YouTube channels are now AI-generated",
        "score": 424,
        "text_content": "That was fast…",
        "comments": [
            {
                "raw_content": "Stealing the dreams of all the Gen Alpha kids who's dream job is being a youtuber.",
                "author": "SeaBearsFoam"
            },
            {
                "raw_content": "I checked out those channels and I just don’t understand. There’s nothing compelling about them. The comments are bizarre and barely legible. These aren’t useful contributions to the overall media landscape. If there are that many people out there legitimately entertained by this (when so much other high quality content already exists) then we’re soooo cooked and it’s not AI’s fault. Or there’s some fuckery happening with the subscribers and comments",
                "author": "Myomyw"
            },
            {
                "raw_content": "The secret? It's just fraud. This [Chick of Honor](https://www.youtube.com/@ChickofHonor-t3i/shorts) account mentioned has 10 million subscribers and 4.2 million views. This [Masters of Prophecy](https://www.youtube.com/@MastersOfProphecy) account has 30 million subscribers and 263 million views which is a preposterous view to subscriber count.",
                "author": "WorldcupTicketR16"
            }
        ],
        "subreddit": "singularity"
    }
]