[
    {
        "post_name": "FAFO John Bolton",
        "score": 772,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yet still it’s only the Democrats who don’t get arrested.",
                "author": "Taqiyya_Mockingbird"
            },
            {
                "raw_content": "Garrison is really one of the greatest political cartoonists ever. What a time to be alive.",
                "author": "old_school_maga"
            },
            {
                "raw_content": "Garrison: https://grrrgraphics.com/kash-raids-the-stache/",
                "author": "Capoditutticapi1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "IT'S AFRAID: 'There is no emergency': Pritzker responds to reports Pentagon plans military deployment to Chicago",
        "score": 645,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's been a years long emergency.",
                "author": "TidewaterYank"
            },
            {
                "raw_content": "# The one and only time the establishment elite will ever say \"there is no emergency\" lol.",
                "author": "tpactionchasethevote"
            },
            {
                "raw_content": "This is a pre-positioning of forces for what's gonna happen next month. It isn't what it appears to be.",
                "author": "HumanSomewhere"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Joe Rogan: \"A lot of people got red pilled to what the pharmaceutical industry really is... They made a lot of money turning people into zombies. It’s pure evil.\"",
        "score": 661,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Welcome to 1990. A little late to the game. Everyone's known this for decades.",
                "author": "terribletwos"
            },
            {
                "raw_content": "If the military Anthrax vaccine story from 2002/2003 would have seen the light of day, maybe fewer people would have took the bait.",
                "author": "BidensPrisonWallet"
            },
            {
                "raw_content": "Dopesick is the best documentary/mini-series ever.",
                "author": "Whoopies_tds"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Pentagon is preparing to deploy National Guard troops to Chicago, according to Washington Post report.",
        "score": 955,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They need to be armed to the teeth.",
                "author": "JustinAthol"
            },
            {
                "raw_content": "Boots on the ground in a war zone",
                "author": "Calumet57"
            },
            {
                "raw_content": "Chicago is American Iraq, good luck boys.",
                "author": "Twitter"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "They're really not sending their best",
        "score": 836,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sorry, I can't keep my eyes off that ICE ass.",
                "author": "Tikk"
            },
            {
                "raw_content": "Holy fuck. What an ass.",
                "author": "Sidewinder24"
            },
            {
                "raw_content": "Hope this guy’s on Trump’s short list for deportations.",
                "author": "Lightning"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Zohran Mamdani fails at bench press while trying to show-off at Men’s Day in Brooklyn",
        "score": 784,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Peak communism. This isn't his weight, it's our weight, comrade!",
                "author": "BigMikesSwingingCock"
            },
            {
                "raw_content": "That weak little bastard can’t even deadlift oxygen.",
                "author": "DJT_MFers1"
            },
            {
                "raw_content": "Another noodle armed soy faggot embarrasses himself.",
                "author": "lixa"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Missouri ~ woman known as the \"camel toe teacher\" has been arrested for having a sexual relationship with a 16-year-old student. the teen's father was also arrested for being okay with the relationship 👩🏻‍🏫🐫 unclear who snitched",
        "score": 888,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I grew up watching Van Halen’s hot for teacher. This generation is living it.",
                "author": "PacificElectric"
            },
            {
                "raw_content": "Arresting the father is absurd",
                "author": "Geralt_of_Rivia1"
            },
            {
                "raw_content": "Nearly 3 public school teachers/administrators are arrested for child sexual assault **EVERY DAY**",
                "author": "RuleoVicus"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Southwest Airlines will soon require plus-size passengers to purchase two seats instead of one.",
        "score": 1500,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is the way. No more fatasses spilling over into my seat. Just kidding, I don't fly anymore.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "All airlines should do this, I paid full price for my seat, there should be nobody else in it with me.",
                "author": "LolOkFBI"
            },
            {
                "raw_content": "I'm fine with this",
                "author": "OrangeCatBad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "MAGA AT FULL SPEED",
        "score": 870,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I hope we see an arrest that sticks",
                "author": "Formerlurker92"
            },
            {
                "raw_content": "Yosemite Scam stole colonel sanders' jacket....and state secrets",
                "author": "5DchessWatch"
            },
            {
                "raw_content": "u/pdwbot how fast is this train going?",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "UK: Huge crowds in Liverpool today demanding mass deportations. Faces shown, flags flown, crosses carried, as patriots took the city. Far left filth, faces covered, causing trouble as usual.",
        "score": 993,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It’s happening. The awakening.",
                "author": "SaltyKrakenBalls"
            },
            {
                "raw_content": "Take your country back, Lads. Godspeed brothers and sisters!",
                "author": "SALTYinSeattle"
            },
            {
                "raw_content": "There will be mass deportations for sure. All those protesters are about to be deported to prison. They are subjects, not citizens. They have the right to obey",
                "author": "Deplorable223"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "YOU KNOW IT'S TRUE",
        "score": 806,
        "text_content": "",
        "comments": [
            {
                "raw_content": "person of the century",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Person of the millennium when he's done.",
                "author": "LBTrumplican2"
            },
            {
                "raw_content": "Man of the Year.",
                "author": "Nuclear_Macaw"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Los Angeles resident describes living in Gavin Newsom’s California “I'm sick of going outside of my house every single day and being met with the most depraved, disgusting things I've ever seen in my entire life on a daily basis — The amount of human feces I see is ridiculous”",
        "score": 1006,
        "text_content": "",
        "comments": [
            {
                "raw_content": "In California, they don't count votes, they count ballots. Every time an illegal gets a driver's license, a ballot is produced and sent out. Where that ballot goes is anybody's guess, but it's sent somewhere. This is how formerly red areas like Orange County suddenly turned blue with 3 AM ballot dumps.",
                "author": "RoninIV"
            },
            {
                "raw_content": "Not my problem until they move and ruin somewhere else. Let them enjoy their paradise.",
                "author": "Purebloodsupreme"
            },
            {
                "raw_content": "She sounds like a white supremacist.",
                "author": "Ice_Joker"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "UK: Police mob handedly pull over a patriots for the \"crime\" of beeping their in support of protesters.",
        "score": 730,
        "text_content": "",
        "comments": [
            {
                "raw_content": "5 cops for a guy using his car horn. This is sickening.",
                "author": "Treintrientje"
            },
            {
                "raw_content": "They aren't voting their way out of this",
                "author": "PapaPepe"
            },
            {
                "raw_content": "\"We live in a country with freedom of speech\" - who wants to break the bad news to her?",
                "author": "Doritalos"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Democrat Rep. Al Green Is Fired. His Response Was to Call It Racist.",
        "score": 1138,
        "text_content": "",
        "comments": [
            {
                "raw_content": "DON'T LET THE DOOR HIT YA WHERE THE GOOD LORD SPLIT YA YOU FUCKING CAVEMAN PIECE OF SHIT.",
                "author": "GunsWithGooglyEyes"
            },
            {
                "raw_content": "clickbait. He's not fired. The redistricting will cause him to lose his seat.",
                "author": "phibetared"
            },
            {
                "raw_content": "They are all issued a race card at birth. And play it whenever they can. I’m still waiting for my white privilege card to show up. Must have been lost in the mail.",
                "author": "Filo76"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "😬 Newscum 2028: Make America... California?",
        "score": 886,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I like the idea of James Woods for California Governor much better!",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "I live in this idiotic state. I can not point you to one thing that Newscum has done to help the people of this state. What a shame, beautiful weather, the mountains, the beach and we have a moron running the show. I keep wondering what that man does all day. By the way, when speaking, he should be made to have his hands tied behind his back. What a phony copycat despicable jerk he is. Run for President???? HaAHAHAH",
                "author": "Mona1950"
            },
            {
                "raw_content": "Wypipo aint even season dey enemas",
                "author": "IncredibleMrE1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Things to watch for.",
        "score": 620,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He's the trifecta.",
                "author": "lovemylibs"
            },
            {
                "raw_content": "The hammer and sickle is a nice touch",
                "author": "BlueKentuckyGirl"
            },
            {
                "raw_content": "🍻😂 love it!",
                "author": "BlueKentuckyGirl"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: FBI believes Bolton should face charges over alleged emailed classified docs to family — and questions why Biden shelved case",
        "score": 1270,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Private server? Can anybody say Hillary Clinton??? She not only whited out the classified designation on classified documents, but faxed classified documents to her maid at her Washington home, had her make copies and staple them all together.",
                "author": "mass55th"
            },
            {
                "raw_content": "Well, Kash, you got the power to arrest and charge people so yeah, we agree. BOOK HIM AND DO IT.",
                "author": "cafeman23"
            },
            {
                "raw_content": "Oh no!!! Bondi has to issue the arrest warrant. well so much for that",
                "author": "patriotplus"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Newsom Prepares To Violate State Constitution To Save 'Democracy' In Redistricting Battle",
        "score": 948,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Any based Californian Sheriffs left willing to arrest this scumbag then?",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Is this guy untouchable like Biden or something? Are we waiting for him to deliver the final death blow to the state, or will someone actually do something?",
                "author": "MythArcana"
            },
            {
                "raw_content": "Federal judge blocking it incoming, or nah???",
                "author": "ChimpanzeeFatigue"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Peter Navarro: If Those Who Tried to Take Down Trump Aren’t Held Accountable, They’ll Do the ‘Same Damn Thing Again’",
        "score": 1593,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's true. They'll be coming after the citizens like they did Trump",
                "author": "PeaceMakerDJT"
            },
            {
                "raw_content": "Navarro is right. And if the Trump Administration doesn't apply their due diligence on this matter, they'll be personally responsible for the downfall of America. The possibility remains that some patriots may get so fed up that they get involved. Patel & Bongino have insisted that there's \"things happening\" that they can't tell us - \"big things\" that'll make us very happy. Do they realize they sound exactly like that Q propaganda from years ago? We want action. Visible action. Trump himself is amazing. Lee Zeldin is great. Tulsi Gabbard is great. Bessent is great. It's the DOJ & FBI that have \"the slows\", as Abraham Lincoln liked to say about his military underperformers.",
                "author": "pray4peace4"
            },
            {
                "raw_content": "Navarro actually lived it. Dudes served six months in jail for the democrats political witch hunt. Hes proof that they dont give a fuck. General Flynn too",
                "author": "JR_Butterbean"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Protesters vs. Water Cannon",
        "score": 576,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That is a proper yeeting.",
                "author": "Turd_Ferguson"
            },
            {
                "raw_content": "I wouldn't say I watched this too many times.... But I would say that I watched it a lot of times! Lol",
                "author": "-wwg1wga-"
            },
            {
                "raw_content": "Good thing she was wearing her mask!",
                "author": "19American62Woman"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Retailers quietly slash prices of AMD's and Intel's latest EPYC and Xeon CPUs by up to 50% — inexplicable price drops left unexplained",
        "score": 70,
        "text_content": "",
        "comments": [
            {
                "raw_content": "simply means that they have super duper mega margins on their stuff from the getgo. Remember that every sale u see they still make a profit. Very seldom any company sells a product below their profit margin. If they do it is an old product that sat there on the shelves for ages they they want to replace with something that actually sells.",
                "author": "Pillokun"
            },
            {
                "raw_content": "This is normal and happens very frequently, maybe just not by 50%, then again, it's \"up to 50%\" so that may explain it.",
                "author": "GemmyBoy999"
            },
            {
                "raw_content": "Canary in the Coal Mine for a recession?",
                "author": "cambeiu"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD comments on burning AM5 socket — chipmaker blames motherboard vendors for not following official BIOS guidelines",
        "score": 337,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If possible, AMD & Intel should force motherboard manufacturers to operate CPU’s with default settings by default, unless the customers chooses to do otherwise.",
                "author": "SomeoneBritish"
            },
            {
                "raw_content": "Asrock must have a very poor clickthrough rate in the YT analytics of the usual hardware channels because you know if this was Asus, we'd have them screaming about this issue from every rooftop.",
                "author": "MrDunkingDeutschman"
            },
            {
                "raw_content": "I mean... It happens exclusively to Asrock. So unlike previous intel situation it seems believable.",
                "author": "jezevec93"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "US government announces 10% stake in chipmaker Intel - BBC News",
        "score": 127,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "What will the U.S. government's shared ownership of Intel mean in practical terms?",
        "score": 51,
        "text_content": "How will, if at all, Intel's operations, activity and function change in the short term and long term with the U.S. government now owning 10% of the company?",
        "comments": [
            {
                "raw_content": "Considering TSMC and Samsung also Backed by their government the possibility benefit as follow * Easier access when doing paperwork or legal stuff within the US border, This involve leasing new place, acquire new land, or when try acquire other company they can get the right people faster and if having issue with permit they have leveredge to be prioritized * Bill, Law and executive order may lean to benefit them * a bit more relax enforcing on anti trust law enforcing, They may can get away on some that are unclear or on gray area unless it straight up blatantly illegal * Steady income from prioritization on government contract, at very least, The goverment office will prioritize Intel product if available Considering Leading edge Semiconductor Fabrication are all Backed by Government, This isn't new, in fact United States are Late for the trend, because this is an industry that extremely expensive and require support to growing",
                "author": "heickelrrx"
            },
            {
                "raw_content": "Realistically, the US government was panicking about intel’s decision to suspend the fab buildout it had planned in Ohio. Ohio is a swing state and that plant would have resulted in many thousands of excellent jobs in an area that needed them. By investing in Intel, they likely can force them to continue building out Ohio. Now Ohio should be suspended because it relies on having external customers, and Intel hasn’t gotten any and might never get any. In the short term this is good for Intel. They have implicit government backing. Longer term this may be bad, since the government will make Intel do stuff that is not good for their business (like building out facilities for political aims and so on).",
                "author": "grumble11"
            },
            {
                "raw_content": "It's pretty great when the entities in charge of regulating a company have financial interests in it!",
                "author": "Deathnote_Blockchain"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung Reportedly Passes NVIDIA HBM4 Sample Test, 30% HBM3E Discount to Challenge SK hynix",
        "score": 103,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Competition is a good thing. It will allow Nvidia to pass the ~~savings~~ profits to its shareholders.",
                "author": "ML7777777"
            },
            {
                "raw_content": "Why would Samsung \"discount\" the chips to Nvidia, assuming they're as good as Hynix’s and Micron’s? HBM demand is through the roof at the moment and supply just isn't catching up, so a \"discount\" seems rather... strange. Sure, Samsung’s foundry hasn’t had any major contracts in years (the sole exception being the recent order from Tesla), but this sounds a bit too desperate for a company that's the bane of an entire country’s tech industry and contributes to almost a quarter of its GDP. In any case, I hope this A.I. bubble bursts soon so Nvidia ends up with a ton of leftover HBM chips that they'll have no choice but to put into their mainstream consumer GPUs, hehe! Wishful thinking...",
                "author": "GenZia"
            },
            {
                "raw_content": "I swear I've seen this headline like 5 times already.",
                "author": "BlueGoliath"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Apparently, there is no “Switch 2” yet. Good to know. Thanks, Google AI!",
        "score": 132,
        "text_content": "I wonder when the hypothetical “Switch 2” will release! 🤪",
        "comments": [
            {
                "raw_content": "Google's AI Overview is so hilariously terrible that I don't know why they keep forcing it on us. It has been wrong consistently enough when I ask it things that I just scroll right past it. And it's obviously wrong about things that it should be able to check.",
                "author": "kyuubikid213"
            },
            {
                "raw_content": "ChatGPT also didnt know about Switch 2 a few weeks ago",
                "author": "movieyosen"
            },
            {
                "raw_content": "There is no war in Ba Sing Se",
                "author": "Silver_Song3692"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Yooka-Re-Playlee is on full on card",
        "score": 932,
        "text_content": "I hope people support this.",
        "comments": [
            {
                "raw_content": "![gif](giphy|qRd64Rf1nqaWc)",
                "author": "NathanCollier14"
            },
            {
                "raw_content": "That's good.",
                "author": "Beautiful_Gap_3516"
            },
            {
                "raw_content": "This is good news",
                "author": "Training_Project1971"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "STARFIELD SWITCH 2. on Istant Gaming",
        "score": 238,
        "text_content": "https://www.instant-gaming.com/en/20158-buy-starfield-switch-2-nintendo-eshop/?_gl=1*1ir8u3y*_up*MQ..*_gs*MQ..&gclid=Cj0KCQjwzaXFBhDlARIsAFPv-u_Ow_-t6NK3uwjgF_ZSjs4t7GLTmEVDr2qIi8HqrF9iqhy0gXPmVnEaAktdEALw_wcB&gbraid=0AAAAADNzuvVIGqlFMxOVBkQhCKcRNMlGq",
        "comments": [
            {
                "raw_content": "I don’t think this means anything",
                "author": "vizvanz"
            },
            {
                "raw_content": "While i might consider it, all my friends who have it on pc said it was meh at best. I imagine s2 version will have performance issues compounding its issues already.",
                "author": "anothertendy"
            },
            {
                "raw_content": "I loved this game for decent while. Great that it’s coming one day!",
                "author": "PercMastaFTW"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Picked this up on a whim really enjoying it so far",
        "score": 137,
        "text_content": "Dragon Quest Monsters - as expected it runs great on Switch 2",
        "comments": [
            {
                "raw_content": "I got this one last year. I really tried to enjoy it, like really really tried, but it wasn't for me. Which is strange, since I'm a big RPG and monster catching fan.",
                "author": "cafe-espresso-5005"
            },
            {
                "raw_content": "Oh gotta try it out on switch 2! I was pretty far into the game. Performance was notably pretty poor on ns1. Love these games though. This one was fun while I was playing it.",
                "author": "AtomKick"
            },
            {
                "raw_content": "Such a fun game",
                "author": "ol_mcthirsty"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "What happened to YouTube for Switch 2?",
        "score": 1089,
        "text_content": "It's been almost 3 months now, and YouTube still hasn't received support for Switch 2. Do you know anything? Is it that difficult to make a Switch 2 version?",
        "comments": [
            {
                "raw_content": "Google said shortly after launch that they would be updating the app for Switch 2, but it’s obviously not a priority",
                "author": "BoldlyGettingThere"
            },
            {
                "raw_content": "And Crunchyroll. I know a lot of people don't care but I was genuinely disappointed to find out it wasn't supported when I \"upgraded\". It's a comfy way to watch in bed or while travelling. I don't want to read subs on my tiny phone screen. It's always good to have options whether you use all of them or not.",
                "author": "Yzillizy"
            },
            {
                "raw_content": "Simply enough Google has decided it’s not high enough of a priority for them",
                "author": "Expert-Raise9442"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I predict history's going to be very kind to Mario Kart World",
        "score": 11,
        "text_content": "Several reasons why: **Kids** ***love*** **it** I played it the other day with my 6 year old nephew. Similarly to what I've seen other people say, he absolutely *loved* just tootling about in free roam. He's too young to have his own console yet, but when he does it'll almost certainly be a Switch 2 with MKW. So basically he and all his young friends will grow up with this game as their 'the Mario Kart you played with friends' and by the time they're all young adults, the nostalgia factor will be through the roof. **It's a grower** Since it was a launch title, I feel like a lot of people (including myself) approached MKW differently to how we usually would a Mario Kart game. Usually it's something you play on and off over the whole generation and, therefore, it's kind of hard to make a judgement after a week at launch. I've been playing it again recently and I was surprised to find how little I really knew the tracks in comparison to older games and how much fun I was having revisiting them. Even in free roam, which I've played a fair bit of, I've done well under half the P-Switches and am still stumbling across them regularly. Many months, even years from now, I'm likely going to be coming back to this again and again (as is always the case with Mario Kart) and its through that repeated experience you get the true sense of a Mario Kart game. **Its faults are minor, its pros are not** MKW has faults. Why aren't costumes stacked in character select? Why can't you see the map in free roam? Why didn't they do anything with the hundreds of stickers? Etc etc. However, frustrating as they are, these are all minor issues in the grand scheme of things. Of more importance is that: the game looks great, the tracks are imaginative and fun (including arguably the greatest Rainbow Road ever), the roster's huge and varied, there are so many weird, out-there little set pieces, knockout tour's fantastic, there are new mechanics that actually make it feel unique. I think the focus on its faults is linked to the above point, in that since it was a launch title, people were more hyper-focused on it than usual and these little things stood out. When I went back to it the other day, though, I did a P-Switch that saw me bouncing off camels backs to reach a goal and when I raced DK Spaceport I properly appreciated for the first time how wild it is to have a giant Robo-DK leaping about and throwing giant barrels at you as you ascend through a spaceport. When you step back, there's actually a lot of really crazy and amazing stuff packed away in this game. **Its going to get bigger and better** I predict we're going to see a lot of DLC - probably a combination of free and paid - and by the end of the Switch 2's life this game is going to be massively expanded. And after enough time's passed, people will assess it based on how it ended up and kind of forget how it launched (see Cyberpunk and even MK8). So, yeah, basically I think people are going to be playing this for a very long time and as they come back to it more and more, it'll grow on them more and more, which coupled with the nostalgia from people who are young kids today and the likely expansion of content, it's going to be looked upon far more fondly and generously than it was at launch where it had a far more searching gaze on it than usual entries in the series.",
        "comments": [
            {
                "raw_content": "Sounds reasonable, time will tell.",
                "author": "Themightygloom44"
            },
            {
                "raw_content": "I'm of the same opinion. I think a lot of the current and vocal player base is made up of early adopters - people who are big fans of prior Mario Kart games and want more of what those games offered. But as the generation progresses, new players gain experience, and young players get older, we're going to see _a lot_ of praise for it. I feel very confident in this.",
                "author": "ThisIsNotACryForHelp"
            },
            {
                "raw_content": "It would have been cool to have those stickers include a minor perk",
                "author": "gordon_shumway67"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "(Spoiler) Just Beat DK Bananza, And Boy Was That Ending Good",
        "score": 41,
        "text_content": "King K. Rool out here really giving Bowser a run for his money. Honestly better than the final boss fight in Super Mario Odyssey hands down. And I love Pauline ❤️ I'm sad to see her go 😢 Also, what Nintendo did with \"Here lies Exploritone\" was dirty 😂 I was legit sad/about to cry because I had this parasocial relationship with him throughout the entire game through his recordings, then I accidentally smashed through the ground by the sign and fell into a din with a Fractone, interacted with him and it said his name was \"Exploritone\" and that he had just taken up from a nap and I was like 😱 Not to mention I felt *so* stupid not realizing that the golden crocodile skeletons were Klaptraps, that the \"Bananium Root\" which organically giggled was King. K Rool's belly, and the flying enemies wre Zingers from Donkey Kong Country. It was so cool seeing a Klaptrap pop out of the stone crocodile for the first time and they honestly look so good in 4K for the first time. Honestly makes me excited for the next/a traditional Donkey Kong RPG Spoiler only discussion - Your thoughts on the final level/boss and game in general?",
        "comments": [
            {
                "raw_content": "As someone who grew up with the DKCs/Dk64, this whole game was a royal treat. Had a much stronger attachment to this than SMOdyssey. And the Twilight Princess-Ganondorf surprise ending works way better here because we've all been hoping and wishing for K Rool to return, meanwhile we were excited to see Ganondorf take the day off wth Zant. Ive been watching people's reactions on youtube all week, it's dopamine every time.",
                "author": "Dagawing"
            },
            {
                "raw_content": "Just came here to ask whether I missed anything after beating the game with 730 bananas? I’m tracking the golden banana skills already, but is that all I’m missing out on?",
                "author": "FaithlessnessFull136"
            },
            {
                "raw_content": "I like that they did the thing with the credits like they did long ago.",
                "author": "Williekins"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Kirby Forgotten Land Switch 2 edition",
        "score": 53,
        "text_content": "Spotted in best buy!",
        "comments": [
            {
                "raw_content": "Did you... steal it?",
                "author": "Caciulacdlac"
            },
            {
                "raw_content": "I’m still confused on if the star crossed world is a completely new campaign or just alternative take on existing levels. And if it’s worth $20 bucks",
                "author": "metsfanapk"
            },
            {
                "raw_content": "This and Shinobi same week. Spectacular!",
                "author": "LawfulnessPractical"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Someone has uploaded a video of the latest Battlefield 6 Labs build showcasing every vehicle, weapon, gadget, and more",
        "score": 313,
        "text_content": "Source: https://www.youtube.com/watch?v=mNVnuZbHAqY *I'm going to try my best to summarize what's in the video but I may miss a few things* **Weapons:** * 8 assault rifles * 8 carbines * 8 SMGs * 8 LMGs * 4 DMRs * 4 sniper rifles * 4 shotguns * 6 pistols **Attachments:** * There are tons of them, I didn't want to go through one by one and list them. **Gadgets:** * Assault class: Ladder, SS26, deploy beacon, M320A1 HE, GL40 STKY, M320A1 AT, M320A1 THRM, SICH G1 FRAG, X95 BRE * Engineer class: Vehicle supply box, bomb disposal drone, SLM-93A (stinger), M136 AT, AT mines, MBT-LAW, Javelin, RPG, PTKM-1R * Support class: Defib, M320A1 SMK, SICH G1 WP, supply crate, GPDIS (stops grenades basically), LWCMS (mortar), supply bag, MP-APS (stops missiles) * Recon class: C4, recon drone, laser pointer (for missile lock), claymore, sniper bait, tracker dart gun, tripwire anti vehicle mine **Throwables:** * Assault class: Frag, smoke, flash * Engineer class: AT grenade, frag, mini frag * Support class: Frag, smoke, incendiary * Recon class: Frag, motion sensor ball, throwing knife **Class tracks (each class has two tracks you can go down based on your playstyle):** * Assault class: * Forward troops: You would pick this track if you're going to be first in line to break through defenses. Removes the speed penalty for shooting while moving * Grenadier: This track would be for people who will be engaging in a lot of close combat. You get to carry more grenades * Engineer class: * Anti-armor: Pretty self explanatory for this track. Also, you can carry two additional rockets * Combat engineer: You'd pick this track if you want to be the engineer to maintain combat vehicles. You auto spot nearby mines with this one * Support class: * Combat medic: You want to focus on healing your teammates. With this track teammates can get health directly from interacting with you without relying on a supply crate * Fire support: You want to focus on resupplying your teammates. With this track teammates can get ammo directly from interacting with you without relying on a supply crate * Recon class (unfortunately he skipped over the tracks for this class so I only caught a glimpse of the first one and I don't know what special ability it brings. For reference I believe the beta had Sniper and Pathfinder) * Battle ranger: Not sure what this one does (maybe this is supposed to be Sniper? or could be Spec Ops) * Pathfinder will be replaced by \"Spec Ops\" per a post DICE made * Tl;dr Recon should have Sniper + Spec Ops or Battle Ranger + Spec Ops.. we'll have to wait and see on this one **Melee weapons:** * Combat knife, Sledgehammer, GEKO knife. **Cosmetics:** * Tons of them, and they all look \"realistic\" and grounded for soldiers and vehicles. **Vehicles (looks like each faction has their own version so there should be two vehicles in each of these categories):** * Main battle tank * Infantry fighting vehicle * Light transport * Armored personnel carrier * AA tank * Attack heli * Transport heli * Attack jet * Fighter jet **Miscellaneous stuff:** * There are daily, weekly, assigned, seasonal, and battle challenges (looks like battle challenges relate to the singleplayer campaign) * There's a battlepass of course * Lots of dog tags",
        "comments": [
            {
                "raw_content": "They gotta give Recon more stuff man, their equipment is dog",
                "author": "Traditional_Share480"
            },
            {
                "raw_content": "I feel like that „forward troops“ sounds way more powerful than the rest of the perks. Like it’s way less situational and a bigger advantage then the small advantages like auto spotting mines …",
                "author": "Daymope"
            },
            {
                "raw_content": "Hotdog Still, will be odd, Recon not having the spawn beacon End of an era. But I’m open to seeing how it plays out. The beta was fun.",
                "author": "__dixon__"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Kumail Nanjiani spills that a Marvel Cinematic Universe video game was in development at some point that he was contracted to appear in (Kingo in Eternals)",
        "score": 97,
        "text_content": "Actor Kumail Nanjiani (*Silicon Valley*, *Lovebirds*) [revealed in an interview](https://comicbookmovie.com/eternals/eternals-star-kumail-nanjiani-reveals-the-shocking-number-of-mcu-projects-he-signed-up-for-as-kingo-a223477) promoting the upcoming season of *Only Murders in the Building* that Marvel had big plans for his character [Kingo](https://marvelcinematicuniverse.fandom.com/wiki/Kingo), who debuted in the Phase Four ensemble *Eternals* in 2021. Despite Nanjiani also voicing him in the animated series *What If*...*?,* He was, per his own words, contracted to appear as the character in multiple other projects that presumably did not materialize due to the film's mixed critical reception and similarly tepid box office gross. In addition to signing on for six MCU films, Nanjiani revealed that he was also slated to voice the character in an **MCU video game** of sorts that was seemingly in development earlier in the decade but shelved later. \"*I was like, 'This is going to be my job for the next ten years.' I signed on for six movies. I signed on for a* ***video game***. *I signed on for a theme park ride. They make you sign on for all this stuff. You're like, 'Okay, so I'll be doing Marvel movies every year, and in between, I'll do my own little things. Whatever I want to do*.\" Now it is important to note, the MCU has had multiple video game or adjacent tie-ins in its duration, but they have not produced any console/PC titles in the time since Phase One, with the last one being [*Captain America: Super Soldier*](https://en.wikipedia.org/wiki/Captain_America:_Super_Soldier) for PlayStation 3, Xbox 360, Wii, DS and 3DS; it released in 2011 alongside the mobile game *Sentinel of Liberty* to promote *Captain America: The First Avenger*. [There was a cancelled *Avengers* game by THQ](https://www.gamespot.com/articles/thq-avengers-game-deep-dive-shows-off-canceled-xbo/1100-6481762/) which would've been timed to release with *The Avengers* in 2012, but the publisher's financial troubles following the commercial downfall of their UDraw line coupled with Marvel's resistance to allocating more production budget, doomed the game. Aside from the adjacent[ *Battle For Earth* by Ubisoft](https://en.wikipedia.org/wiki/Marvel_Avengers:_Battle_for_Earth) that same year, MCU games in Phase Two were focused almost exclusively on mobile devices, while Disney's rescinding of character licenses from various third-party developers in the mid-2010s meant that a lot of MCU gaming content in that period, was relegated to content drops through the *Disney Infinity* platform until its premature end with *3.0* in 2015. As of Phase Three, Marvel Games has since reverted to its licensing-only model, and has exclusively pivoted towards distributing its characters for original AAA titles on console/PC with third-parties, such as *Marvel's Spider-Man*, *Marvel's Guardians of the Galaxy*, *Marvel's Midnight Suns* and the recently announced *Marvel Tokon*. MCU content was largely relegated to promotional costumes/skins dropped into their freemium mobile titles like *Marvel Strike Force* and especially *Marvel Contest of Champions*. The only game-adjacent experiences to accompany the films in this era were the *Virtual Reality Experiences* for *Spider-Man: Homecoming* and *Far From Home*, as well as [*Avengers: Damage Control*](https://marvelcinematicuniverse.fandom.com/wiki/Avengers:_Damage_Control), which was an immersive VR title rolled out to select locations in North America by ILMxLab, kind of like a theme park attraction. Nanjiani did seperate \"theme park ride\" from the video game project in his quote, which makes it sound as if some sort of proper tie-in title, or at least a game set in MCU continuity was planned at some point pre-SAG-AFTRA strikes. It also totally could've taken the form of a mobile game like the majority of MCU games have historically. It also could've been like *Damage Control* or the Disneyland attractions, which are aesthetically derived from the MCU and often feature certain cast members reprising their roles in otherwise original storylines. I imagine that the strike occurring also meant that actors from the films who were meant to reprise their roles were completely unavailable per the guidelines of the protests.",
        "comments": [
            {
                "raw_content": "The quote sounds more like he was contracted to do these projects if Disney chose to do them, rather than an actual game being in development.",
                "author": "cleofrom9to5"
            },
            {
                "raw_content": "I forget if it was rumour or just speculation but I think at one point TT Games was doing a LEGO Infinity Saga game, like a giant franchise-spanning compilation a la Skywalker Saga. Eternals obviously isn't a part of the Infinity Saga but that doesn't mean they can't go nuts on the character roster (as they usually do) or do some DLC character packs (as they also usually do). Again I forget if that was a leak, but if it was real it's probably been shelved at this point 1) to focus on the Batman game and 2) WB probably wants TT focusing on IPs that WB actually owns.",
                "author": "drumjolter01"
            },
            {
                "raw_content": "Kinda off topic I guess but I’m honestly shocked that marvel hasn’t tried to do more big superhero games or made a connected video game universe I remember when insomniac’s spider man came out and there were all these references to different heroes like the avengers tower, wakandam embassy, Dr Strange’s sanctum etc. and I was very convinced that a connected video game universe was on the way",
                "author": "Ateballoffire"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[Dusk Golem] Resident Evil 5 Remake is currently not in development and Code Veronica develop is going very smoothly",
        "score": 328,
        "text_content": "[Source](https://xcancel.com/AestheticGamer1/status/1959319325598449786?t=xip9Jvy0P7qM13a_Y55LUw&s=19) [Source 2](https://xcancel.com/AestheticGamer1/status/1959323476487180463?t=xip9Jvy0P7qM13a_Y55LUw&s=19)",
        "comments": [
            {
                "raw_content": "Code Veronica and Zero needs remake more. I would personally love an RE1 remake selfishly tho, it's my favorite horror game of all time",
                "author": "superamigo987"
            },
            {
                "raw_content": "Just played RE5 for the first time with a friend. It was fun. Goofy, but fun. It'll hold up another 5 years while older rougher games get remakes. Come back to it after Veronica, 0 & 1 are remade. (Yes, I know the 1 remake is good. but its older now then RE1 was when the remake came out. We can have two good things.) And then, a remake that reimagines 6.",
                "author": "GoldenTriforceLink"
            },
            {
                "raw_content": "RE5 remake is more of a matter of when, not if. Likely after RE0, 1 and CV remakes.",
                "author": "Banesmuffledvoice"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "More details on Code Veronica Remake from Dusk Golem: Rockfort Island is semi-open world & Claire has a motorcycle she repairs early in the player uses to transverse it.",
        "score": 34,
        "text_content": "More details from his long twitter thread: \\- Code Veronica Remake is ahead of its internal schedule, meanwhile RE0 got delayed recently after some form of dev reboot late last year. With that in mind, think it's far more likely Code Veronica is first, even though originally it was the other way around. \\- Steve will still have a crush on Claire, but it'll be played more innocently. His perverseness is toned down, in its place he'll be more abrasive, overlty curious & not understanding personal boundaries well. \\- Wesker will play a much bigger part because the H.C.F. has been upgraded to a main plot point in Code Veronica Remake. We're going to get their full scoop, more scenes with Wesker & the H.C.F., & they play a bigger role in the story. \\- Wesker's fight with Chris is now a boss fight, he no longer fights Alexia. \\- Directed by Yasuhiro Anpo & Kazunori Kadoi, same duo who directed RE2 & RE4 remake. Also claims he will ignore any Code Veronica questions from here on out until after RE9 is out. Source: [https://xcancel.com/AestheticGamer1/status/1959385593609441760](https://xcancel.com/AestheticGamer1/status/1959385593609441760)",
        "comments": [
            {
                "raw_content": ">Also claims he will ignore any Code Veronica questions from here on out until after RE9 is out. Yeah right, like he'd pass any ounce of attention",
                "author": "Duramboros"
            },
            {
                "raw_content": "Is Dusk Golem striving to be the source behind 90% of the posts on this sub, or is there a good reason they're dropping a handful of info crumbs one at a time",
                "author": "drumjolter01"
            },
            {
                "raw_content": "If they don't put phase 1 Alexia somewhere else as a Boss Fight this is a stupid decision because they could very well put a Wesker boss fight in RE5 remake or multiple ones but Alexia is only in CV and only briefly in her humanoid form At least give her to Claire to fight in that form or something",
                "author": "ResistanceEvermore"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "New Off-Screen Silent Hill F First Person Gameplay from Gamescom 2025",
        "score": 106,
        "text_content": "Someone was able to record some never before seen footage of Silent Hill F in First Person. Here's the link: https://www.youtube.com/watch?app=desktop&v=E7bmF_sAgCw",
        "comments": [
            {
                "raw_content": "This is clearly not actually gameplay. The combat doesn't show as designed for a first person mode and the footage in the video looks like part of a cutscene or teaser.",
                "author": "writtenonclouds"
            },
            {
                "raw_content": "I just hope the hit registration effect on enemies doesn't kill the pace of this game... because on paper, it should.",
                "author": "Final_Amu0258"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "LEGO Sega Genesis/Megadrive Controller leaked, apparently releasing September 8th",
        "score": 99,
        "text_content": "https://xcancel.com/wario64/status/1959308524980433096?s=46 Unlike something like the LEGO GameBoy, I don’t believe this was ever officially announced prior to screenshots being leaked",
        "comments": [
            {
                "raw_content": "Lego leak I think they already talked about this so it's more than certain that it exists",
                "author": "Midnight_M_"
            },
            {
                "raw_content": "Looks like a gifts with purchase item to me.",
                "author": "RegurgitatedMincer"
            },
            {
                "raw_content": "I like it",
                "author": "Rev-On"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "I just found the a listing for a nintndo switch 2 version on Reanimal and it's a game key card",
        "score": 1,
        "text_content": "https://www.game.es/VIDEOJUEGOS/SURVIVAL-HORROR/NINTENDO-SWITCH-2/REANIMAL/250094",
        "comments": [],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel and Trump Administration Reach Historic Agreement",
        "score": 72,
        "text_content": "",
        "comments": [],
        "subreddit": "intel"
    },
    {
        "post_name": "Ryzen 7 9800X3D/RX 9070 XT build",
        "score": 270,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That’s some extreme negative pressure; All the fans are exhaust.",
                "author": "CheemsGD"
            },
            {
                "raw_content": "Any particular reason the case is set up as completely negative pressure?",
                "author": "dllyncher"
            },
            {
                "raw_content": "Oh man, this is *clean*",
                "author": "4sch3"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "All AMD build",
        "score": 119,
        "text_content": "Asrock steel legend 9070 XT 7800X3D Thermalright Phantom spirit 120 se 32GB Trident Z5 Neo Cl30 6200MH MSI B850 Tomahawk Max WIFI EVGA Supernova P2 1200w Thermaltake View 51 Modified for airflow glass panels all taken off Arctic P12 120mm pro main case fans Superflower neon argb 140mm fan",
        "comments": [
            {
                "raw_content": "The PS3 as a Blu-ray player is respectable but that mouse bro.",
                "author": "wiredbombshell"
            },
            {
                "raw_content": "Dont lie you monitor is not AMD. /s",
                "author": "Dangthe"
            },
            {
                "raw_content": "cables ?",
                "author": "JesusChristusWTF"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "The Fed is starting to worry about the housing market now",
        "score": 422,
        "text_content": "",
        "comments": [
            {
                "raw_content": "More concerned about a slight cooling than they were when it was inflating 20% a year.",
                "author": "indyprivatelending"
            },
            {
                "raw_content": "Yeah, nobody is going to pay half a mil for a condo to only pay more hoa than rent..",
                "author": "Iwillgetasoda"
            },
            {
                "raw_content": "“A few participants noted a weakening in housing demand, with increased availability of homes for sale and falling house prices,” Oh no! Asset bubble is popping? The peasants might be able to buy homes again?",
                "author": "enlightened321"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Bleeding 1700 a month on two rental properties",
        "score": 141,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The \"get rich buying RE\" message is so prevalent and leads so many people astray. It can be a way to create long term wealth. And it does allow you to leverage debt in a way that most poor / middle class people wouldn't otherwise have access to. But it is the opposite of easy. Being a landlord is fucking awful. Managing tenants is awful. Dealing with the random costs and problems and headaches saps your sanity. You have to be an expert at it to do it well (and some people are). But it is not for the faint of heart. Just buy an index fund. Mine costs me .015% a year. No hassle. Just turn on auto invest and forget about it.",
                "author": "MakingTriangles"
            },
            {
                "raw_content": "Yes, the rental market is cheaper than most new mortgages nowadays, it’s been this way for about 5 years. You are competing with landlords that have deep equity properties they bought 20 years ago paid off. Being able to mortgage any house and rent it out and make good money was only a 2008 to 2020 phenomenon, not the norm.",
                "author": "bongophrog"
            },
            {
                "raw_content": "That OP is absolutely idiotic. She is a digital nomad solo female traveler who posts in emotional intelligence Subreddits talking about how she’s a people pleaser and gets taken advantage of by her friends as a result. This type of person never should have owned any real estate. It’s no great mystery at all she’s losing her butt on renting and has great emotional distress from being a landlord 🙄",
                "author": "Horangi1987"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Home sales are ticking up — and even more are coming to market",
        "score": 25,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Airbnbs are getting crushed. So those people are now looking to rent their properties or unload them.",
                "author": "FUCKYOUINYOURFACE"
            },
            {
                "raw_content": "lots of conflicting articles posted on this sub",
                "author": "gk_instakilogram"
            },
            {
                "raw_content": "R/bipolar",
                "author": "ScooterWorm"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "6th Best school district in NJ , Cheapest home 1.1Mil +",
        "score": 0,
        "text_content": "Who are these new parents managing to afford such expensive homes? All the reasonably priced houses in safe neighborhoods with decent schools are being snatched up by flippers. I honestly can’t wait for the crash to wipe out these so-called ‘builders’ who slap on unnecessary, grey and ugly design choices that nobody ever asked for",
        "comments": [
            {
                "raw_content": "Most people buying homes like these aren’t starting with 5% down sort of thing. They already own a place and have substantial equity or have high paying jobs or own a business",
                "author": "j00sh7"
            },
            {
                "raw_content": "People have more money than they tell you",
                "author": "KoRaZee"
            },
            {
                "raw_content": "Wait, you're telling me homes in school districts ranked in the top 1% of the state, 30 minutes to Manhattan, are expensive?",
                "author": "Unusual-Ad1314"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "xAI open sourced Grok-2, a ~270B model",
        "score": 409,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Some ask why. I prefer to ask why not!",
                "author": "ezjakes"
            },
            {
                "raw_content": "Can anyone convert that “6 months” of Musk Standard Time into real time?",
                "author": "thebrainpal"
            },
            {
                "raw_content": "Release mecha hitler",
                "author": "FishingLimp72"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The wasting water myth 🤦‍♂️",
        "score": 444,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I, as a European, never wasted a single gallon in my life. We have liters for that.",
                "author": "amarao_san"
            },
            {
                "raw_content": "Training it on the other hand. About 280 million litres according to gpt 5",
                "author": "BradEXP"
            },
            {
                "raw_content": "It seems unreasonable to include the water consumption of the cow's life and not the water consumption of the chip's raw material extraction and manufacture",
                "author": "JonnyTsnownami"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"18 months after becoming the first human implanted with Elon Musk’s brain chip, Neuralink ‘Participant 1’ Noland Arbaugh says his whole life has changed.\"",
        "score": 571,
        "text_content": "[https://fortune.com/2025/08/23/neuralink-participant-1-noland-arbaugh-18-months-post-surgery-life-changed-elon-musk/](https://fortune.com/2025/08/23/neuralink-participant-1-noland-arbaugh-18-months-post-surgery-life-changed-elon-musk/) \"I see how the advancements in tech at this point are going to solve so many things. They are, I think, the future of medicine. I think a lot of disabilities, cures, and answers that we’ve been searching for a long time will come through tech—and that kind of surprised me.\"",
        "comments": [
            {
                "raw_content": "Other than the initial thread retraction problem, it looks like the implants are holding up well over time",
                "author": "Ok-Program-3744"
            },
            {
                "raw_content": "Much as I loathe the person he's become, I genuinely hope this goes well and is a benefit to bettering people's lives. We need good cybernetics, and this is a step towards that path.",
                "author": "Stunning_Monk_6724"
            },
            {
                "raw_content": "People here need to understand that it’s perfectly fine to have opinions about Musk. He’s a controversial figure, and that will always influence how people judge anything he does. However, it’s also important to discuss the technology itself without constantly shifting the focus to him, because that only harms the conversation about the actual topic. Advances in this field matter. Neuralink is not the only player in this space, and unlike many here, I can’t say for sure whether they’re ahead of their competitors or not—but they certainly draw media attention. One point I’d like to raise is how some people here talk about those with disabilities. Being disabled doesn’t mean they’ll accept anything without question. Everyone has the right to their own standards and preferences, and assuming otherwise is pure ignorance. Keep in mind that invasive technologies are often abandoned, leaving participants without support and preventing them from joining future projects. So, no matter how challenging someone’s situation may be, they still face a tough decision when choosing to participate in something like this. It requires a great deal of trust.",
                "author": "Spiritual_Love_829"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Mistral Medium 3.1 LMArena",
        "score": 418,
        "text_content": "",
        "comments": [
            {
                "raw_content": "But where does it rank in iOS updates?",
                "author": "Yesterday-Rare"
            },
            {
                "raw_content": "Pretty good, but oh my style control....",
                "author": "ezjakes"
            },
            {
                "raw_content": "Absolutely remarkable considering the small size of the model",
                "author": "Rene_Coty113"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"MIT report misunderstood: Shadow AI economy booms while headlines cry failure\"",
        "score": 219,
        "text_content": "[https://venturebeat.com/ai/mit-report-misunderstood-shadow-ai-economy-booms-while-headlines-cry-failure/](https://venturebeat.com/ai/mit-report-misunderstood-shadow-ai-economy-booms-while-headlines-cry-failure/) \"The most widely cited statistic from a new [MIT report](https://mlq.ai/media/quarterly_decks/v0.1_State_of_AI_in_Business_2025_Report.pdf) has been deeply misunderstood. While headlines trumpet that “[95% of generative AI pilots at companies are failing](https://fortune.com/2025/08/21/an-mit-report-that-95-of-ai-pilots-fail-spooked-investors-but-the-reason-why-those-pilots-failed-is-what-should-make-the-c-suite-anxious/),” the report actually reveals something far more remarkable: the fastest and most successful enterprise technology adoption in corporate history is happening right under executives’ noses. The study, released this week by MIT’s [Project NANDA](https://projnanda.github.io/projnanda/#/), has sparked anxiety across social media and business circles, with many interpreting it as evidence that artificial intelligence is failing to deliver on its promises. But a closer reading of the [26-page report](https://mlq.ai/media/quarterly_decks/v0.1_State_of_AI_in_Business_2025_Report.pdf) tells a starkly different story — one of unprecedented grassroots technology adoption that has quietly revolutionized work while corporate initiatives stumble. The researchers found that 90% of employees regularly use personal AI tools for work, even though only 40% of their companies have official AI subscriptions. “While only 40% of companies say they purchased an official LLM subscription, workers from over 90% of the companies we surveyed reported regular use of personal AI tools for work tasks,” the study explains. “In fact, almost every single person used an LLM in some form for their work.”\"",
        "comments": [
            {
                "raw_content": "The article definitely makes the case, that individuals adopting AI and seemingly gaining productivity rewards is underreported in the media coverage of the MIT report. And there is certainly something to learn from employees grassroots adoption of AI. But to frame the report itself as “misunderstood” feels like a stretch. What the article does instead is assume that individual productivity gains will somehow *automatically* scale into organizational outcomes. That’s a leap the report never makes. Translating personal wins into enterprise-level impact requires embedding AI into core processes, systems, and governance. This is exactly the part companies are still struggling with.",
                "author": "larztopia"
            },
            {
                "raw_content": "People are making their jobs easier, and proportional to that factor, putting in less effort. My job is made a lot easier by AI, but like many people, I’m not getting paid any more or getting any promotions for giving “200%”. Its now just easier to be the same level of productive.",
                "author": "yellow-hammer"
            },
            {
                "raw_content": "Such bizarre headlines when AI has clearly transformed the lives and work of nearly any competent user.",
                "author": "twospirit76"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "ChatGPT System Message is now 15k tokens",
        "score": 500,
        "text_content": "",
        "comments": [
            {
                "raw_content": "lol > For any riddle, trick question, bias test, test of your assumptions, stereotype check, you must pay close, skeptical attention to the exact wording of the query and think very carefully to ensure you get the right answer. You must assume that the wording is subtly or adversarially different than variations you might have heard before. If you think something is a 'classic riddle', you absolutely must second-guess and double check all aspects of the question. Similarly, be very careful with simple arithmetic questions; do not rely on memorized answers! Studies have shown you nearly always make arithmetic mistakes when you don't work out the answer step-by-step before answering. Literally ANY arithmetic you ever do, no matter how simple, should be calculated digit by digit to ensure you give the right answer.",
                "author": "FateOfMuffins"
            },
            {
                "raw_content": "I get there are jailbreaks that can expose the system prompt, but how does sometime know if they are actually getting the real system prompt and not something else ? I thought LLMs don't even reliably reproduce the same large chunk of text 100 percent faithfully when asked",
                "author": "one-wandering-mind"
            },
            {
                "raw_content": "not surprising it forgets context ALL THE TIME. ffs",
                "author": "iDoAiStuffFr"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"An energy metabolism-engaged nanomedicine maintains mitochondrial homeostasis to alleviate cellular ageing\"",
        "score": 22,
        "text_content": "[https://www.nature.com/articles/s41565-025-01972-7](https://www.nature.com/articles/s41565-025-01972-7) \"Energy restriction is closely related to cellular senescence and species longevity. Here, based on the structure and function of ATP synthase, a key enzyme for energy generation, we develop energy metabolism-engaged nanomedicines (EM-eNMs) to rejuvenate aged stromal/stem cells, and help to prevent skeletal ageing. We show that EM-eNMs infiltrate the mitochondria of aged bone marrow mesenchymal stromal/stem cells (BMMSCs), driving mitochondrial fission, mitophagy, glycolysis and maintaining BMMSC stemness and multifunction. The EM-eNMs directly bind to the ATP synthase and promote mitophagy through induction of the dynamin-related protein 1 (*DRP1*) gene. Remarkably, EM-eNMs selectively target bone tissues through systemic delivery and significantly reverse osteoporotic bone loss in aged mice by enhancing mitochondrial fission and mitophagy, while simultaneously restoring the stemness and osteogenic potential of aged BMMSCs in situ. Taken together, our findings highlight the potential of the EM-eNMs as a targeted therapy to alleviate cellular senescence and age-related diseases.\"",
        "comments": [
            {
                "raw_content": "This is really interesting because it goes beyond the usual antioxidant or NAD+ replenishment strategies we see in longevity. Targeting ATP synthase directly to re-engage mitochondrial dynamics and mitophagy is a more upstream intervention, almost like flipping the switch on the cell’s energy engine rather than patching the damage after the fact. The fact that these nanomedicines not only rejuvenated BMMSCs in vitro but also reversed bone loss in aged mice makes it look like a genuine systems-level effect, not just a biomarker tweak. If this translates, it could mean a way to maintain stem cell function and tissue regeneration capacity deep into ageing. It also raises the question of whether similar mitochondrial-targeted nanomedicines could be designed for other tissues, like neural or cardiac, where stem cell exhaustion and mitochondrial dysfunction are major drivers of decline. This feels like a step toward precision longevity therapeutics rather than broad metabolic hacks.",
                "author": "jmondejar_"
            },
            {
                "raw_content": "makes you wonder if they could stumble upon something significant eventually",
                "author": "Jabulon"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "2 Years to live can AI save me?",
        "score": 161,
        "text_content": "- Let's say hypothetically - I have cancer, specifically leukemia the blood cancer - With a prognosis of 2 years - Already starting chemotherapy, losing hair, it's brutal. - Am I cooked? Probably might die in a year.. Many people claim AGI will arrive soon and solve most diseases, but realistically, what are the chances of that happening within the next two years? I know it sounds like I’m waiting for a “Messiah technology,” but I’d really love to live long enough to see the future. What does AI in medicine look like right now? Have there been any major breakthroughs or hospitals actually using it to improve treatment?",
        "comments": [
            {
                "raw_content": "The chances are not good with regard to AGI/ASI. Maybe try to get into a trial with new drugs/therapies if you are looking for the latest advances.",
                "author": "Ok-Watercress266"
            },
            {
                "raw_content": "Leukemia treatment is already making big headway with CAR T therapy. As far as I know, it's just made its way through clinical trials and will slowly be gaining more treatment options as the data increases. In regard to general medical advancements, no, the route from discovery to treatment is a very very long road. So it will take more than two years for AI to make new treatments.",
                "author": "enigmatic_erudition"
            },
            {
                "raw_content": "Look up NeoVax, Scancell perhaps? Not sure what they’re working on right now but mRNA vaccine is the best avenue",
                "author": "roofitor"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "BBC: Fans loved her new album. The thing was, she hadn't released one",
        "score": 36,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is going to happen more and more as time goes on. We're about to see how technology advancing much more rapidly than legislation can create huge issues. Art, music, movies.. it's all going to be flooded with AI generated content and a lot of it will resemble existing art, music, and movies. It's going to be interesting to see how it plays out.",
                "author": "WhenRomeIn"
            },
            {
                "raw_content": ">There's now a growing trend, though, for established (but not superstar) artists to be targeted by fake albums or songs that suddenly appear on their pages on Spotify and other streaming services. Spotify makes this really easy. When two artists have the same name it just munges them together. I've seen it happen again and again, artists with the same name all get smashed into a single page and going through releases you can go from ambient to rap. All clearly different artists.",
                "author": "blueSGL"
            },
            {
                "raw_content": "Isn't that how all Enya albums came to be?",
                "author": "No_Syllabub5784"
            }
        ],
        "subreddit": "singularity"
    }
]