[
    {
        "post_name": "BREAKING: The Big Beautiful Bill has just ADVANCED in the House, 219-213. Massie flipped to a YES. NEXT UP: FULL FLOOR VOTE (following debate)",
        "score": 40,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Primary threats work, apparently.",
                "author": "OldGreg"
            },
            {
                "raw_content": "https://x.com/nicksortor/status/1940673350956995039",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "Still Primary him. He is a faggot playing games with America's future.",
                "author": "KennyKetchem"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Howie Mandel: They never said you won't get COVID. RFK Jr: I saw a tape yesterday of them all saying it...Can I play it for you? Howie: Well it doesn't matter...",
        "score": 1258,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It doesn’t matter cause everyone’s injected and it sheds so everyone gets it and that’s that. Jesus Christ is Lord and Savior. 🤗",
                "author": "PatriotSkorzeny"
            },
            {
                "raw_content": ">well it doesn't matter Means he knew he was lying the whole time and didn't expect to be called out in such an effective manner",
                "author": "IonlyReplytoBots"
            },
            {
                "raw_content": "You know Howie got the Vax and the boosters, He is trying to convince himself he wasn't a brain dead idiot for taken them.",
                "author": "TheGreenDragon"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔴DOGE: Contracts Update! Over the last 4 days, agencies terminated 256 wasteful contracts with a ceiling value of $14.3B and savings of $11.5B, including an $850k USAID professional services contract for a “resilience advisor” in Somalia",
        "score": 1185,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Can't wait for DOGE to tear apart the Department of Defense. That entire section of the government is full of leeches and parasites that are contractors that are giving our brave soldiers terrible value for the amount of money we spend there.",
                "author": "wharfthrowaway"
            },
            {
                "raw_content": "\"Resilience advisor\" I'll give that guy prop for finding a decent job title. How will he survive without that 850k however lol?",
                "author": "canada_is_communist"
            },
            {
                "raw_content": "think of how many people had to be stolen from to get that 14 BILLION dollars and how many lives that could change it's not a trillion, but this is a meaningful amount of money that was being scooped up out of real people's pockets",
                "author": "flashersenpai"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The President of the United States says Rep. Jamie Raskin (D-Md.) has an \"ugly face\" & is a \"total loser.\"",
        "score": 937,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nose protruding. Very disrespectful.",
                "author": "JackOfAllTirades"
            },
            {
                "raw_content": "Jamin Ben Raskin is Jewish. this has to be antisematic",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "He looks like a RAT !",
                "author": "2020TrumpTrain"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump: The USA is on track to break every record on GROWTH. Go Republicans, beat the Crooked Democrats tonight! PRO-GROWTH Tax Cuts never fail. MAKE AMERICA GREAT AGAIN!",
        "score": 916,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is there any MAGA left in the bill besides some crumbs for the border and ICE?",
                "author": "Corn_Pop_Is_Bad_Dude"
            },
            {
                "raw_content": "who doesn’t like tax cuts?",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "We're gonna need Jason Statham to fix this country, aren't we?",
                "author": "RockyBalboa"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🪞 SELFISH: Rep. Keith Self was ENDORSED by Trump, now he's backstabbing 77 million+ Trump voters who want their campaign promises fulfilled.",
        "score": 662,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The house passed their version. The senate changed shit an sent it back. The house has no obligation to accept the senate version just like the senate didn't care about the house version. I'm will to bet the senate version is trash cuz they're all garbage in the senate. The senate is where conservative legislation goes to die.",
                "author": "DaayTerkErJerbs"
            },
            {
                "raw_content": "The fuck are you on about? This vote was to rush the bill through the house so they couldn’t fix and of the Senate’s bullshit alterations.",
                "author": "GabeC1997"
            },
            {
                "raw_content": "God some single digit IQs up in here. EVERYTHING MAGA WAS REMOVED FROM THE BILL. By voting no there is now time to fix it before it is pushed forward....",
                "author": "GrumpyPete"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨#BREAKING: Republicans no longer have the votes to needed to pass President Donald Trump “Big Beautiful Bill” this comes after four republicans voted no",
        "score": 799,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Faggots",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "I went to X to verbally abuse him, but then read his reasons, which sound reasonable if true - Rep. Keith Self @RepKeithSelf · 38m I came to Washington to help rein in our national debt. In negotiations with House leadership, commitments were made to ensure the One Big Beautiful Bill would include key provisions, such as: - Matching every $1 of tax cuts with $1 of spending cuts. - Terminating Biden's Green New Scam. - Prohibiting taxpayer-funded experimental gender transition procedures. The Senate broke the House framework, and then they stomped all over it. Now, House leadership wants to cram this broken bill down our throats by rushing it to the floor while in the middle of discussions, completely disregarding their promises. The only way of making this right is by leadership adhering to their commitments and restoring, at a minimum, these three important issues from the House version.",
                "author": "Bullgod"
            },
            {
                "raw_content": "[BREAKING: THREE Republicans have just voted NO on advancing the Big Beautiful Bill](https://x.com/nicksortor/status/1940588604415426589) - Andrew Clyde - Victoria Spartz - Keith Self Massie also expected to vote no on advancing. Negotiations ongoing on the House floor to make sure this proceeds. [BREAKING: Rep. Keith Self is ALL THE SUDDEN deciding he’s going to attempt to BLOCK the Big Beautiful Bill. He’s been a yes all along, but now that it looked like OBBB was going to pass, he’s decided he’s a NO. THIS IS WHAT GRANDSTANDING LOOKS LIKE! VOTE YES, @RepKeithSelf](https://x.com/nicksortor/status/1940591991571767497)",
                "author": "Mr_Rightside"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING - Rep. Thomas Massie just changed from “Yea” to “Nay.” It’s over… Trump is about to go ballistic.",
        "score": 601,
        "text_content": "",
        "comments": [
            {
                "raw_content": "See how dems don't have a problem with people showing up and voting exactly how they want them to?",
                "author": "PapaPepe"
            },
            {
                "raw_content": "you know there can be a re-vote tomorrow you little panicans trembling in your panties, WE ONLY WIN",
                "author": "YodaBannon"
            },
            {
                "raw_content": "bill is a disaster anyway. Still keeps in NFA provisions.",
                "author": "FBIsurveillance"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔴 Trump Truth: CONGRATULATIONS AMERICA! The June Border Statistics are in and, once again, they are the LOWEST RECORDED NUMBERS IN UNITED STATES HISTORY. The U.S. Border Patrol reported ZERO releases of Illegal Aliens into the Country.",
        "score": 1315,
        "text_content": "",
        "comments": [
            {
                "raw_content": "ZERO is the correct number",
                "author": "me-no-likely3"
            },
            {
                "raw_content": "Arrest Mayorkas now!!",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Fucking Biden.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Why isn't Trump's DOJ just releasing FISA records showing Biden targeted Trump? Why force a lawsuit to obtain them?",
        "score": 599,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Same reason we aren’t getting Epstein",
                "author": "BidenSniffsLittleKid"
            },
            {
                "raw_content": "Epstein stuff when?",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "And same question on attempts to get Biden era records that show Biden targeted Trump with lawfare in 'Operation Arctic Frost'? https://www.judicialwatch.org/biden-lawfare-scheme/",
                "author": "LolitaExpressPilot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "LMFAO: \"Operation Mongorian Beef\"",
        "score": 1064,
        "text_content": "",
        "comments": [
            {
                "raw_content": "ooooh mongorians always attack my shitty wall!",
                "author": "VirTW"
            },
            {
                "raw_content": "We need an Operation Chop Suey that arrests the deep state actors enabling these people",
                "author": "gunteh"
            },
            {
                "raw_content": "So they can arrest people for rioting. Good to know.",
                "author": "LostElf"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Brain Fitzpatrick who voted against the rule to advance the Big Beautiful Bill has left the Capital. This means they will be unable to flip his vote. He is a member of the Main Street GOP.",
        "score": 553,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This dude is furious because we cut off Ukraine today; not a coincidence",
                "author": "BidenSniffsLittleKid"
            },
            {
                "raw_content": "Epstein client confirmed. Didn't get a perk in the bill and voted NO. Primary.",
                "author": "MAGA_VANGUARD"
            },
            {
                "raw_content": "Is his name Brain or Brian? Either way he's a massive faggot.",
                "author": "Hangemh1gh"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "PRESIDENT TRUMP: \"What are the Republicans waiting for??? What are you trying to prove??? MAGA IS NOT HAPPY, AND IT’S COSTING YOU VOTES!!!\"",
        "score": 438,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They don't know what the fuck they're doing",
                "author": "Wrexxis780"
            },
            {
                "raw_content": "keep them at work for July 3 and 4th if we have to",
                "author": "spinometer2"
            },
            {
                "raw_content": "It’s a fucking disaster of the bill that contains a bunch of bloated garbage. All the good stuff was taken out.",
                "author": "Executarian2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Liberalism Is A Mental Disease",
        "score": 1180,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It’s cancer.",
                "author": "SomecatsareMAGA"
            },
            {
                "raw_content": "Ellen looks like something out of Lord of the Rings.",
                "author": "Svaap"
            },
            {
                "raw_content": "Kathy Griffin looks like a scary clown in a wig.",
                "author": "endthefed11"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "More Reports Of Sexual Assaults On Underage Girls In German And Austrian Swimming Pools",
        "score": 904,
        "text_content": "",
        "comments": [
            {
                "raw_content": "everywhere you have islam you have this shit. because islam is shit.",
                "author": "stick_in_the_eye"
            },
            {
                "raw_content": "This isn't new. Been going on for quite some time now. Migrants were getting pamphlets, back in 2016, about how to behave in public pools. Germany's solution? Let in millions more.",
                "author": "airborne3502"
            },
            {
                "raw_content": "That's because they're never punished for it. The \"I didn't know there was a law against that\" excuse needs to be ended. Letting these perverts off only emboldens them.",
                "author": "mass55th"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "It looks like the House is ready to vote tonight. We had GREAT conversations all day, and the Republican House Majority is UNITED, for the Good of our Country, delivering the Biggest Tax Cuts in History and MASSIVE Growth. Let’s go Republicans, and everyone else - MAKE AMERICA GREAT AGAIN!",
        "score": 715,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Now is not the time to complain about budget deficits. We have other means to address that. Now is the time to shut up, toe the party line, and **Make America Great Again!**",
                "author": "henri_derelicte"
            },
            {
                "raw_content": "Get fucked faggot Massie",
                "author": "Axiom502"
            },
            {
                "raw_content": "There are a dozen rinos who need to be primaried. They've made it clear they're only worried about foreigners. We don't need that kind of trash in our govt.",
                "author": "MajorClark"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Democrat Doctors Caucus tries to womansplain their opposition to the Big Beutiful Bill. Nobody cares.",
        "score": 817,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And not a single fuck was given that day.",
                "author": "DemocratMath"
            },
            {
                "raw_content": "I'm a little tired of hearing about women's \"needs\" and all the bullshit they want.",
                "author": "slimcoat"
            },
            {
                "raw_content": "It's truly amazing that they so profoundly warped people's minds during the scamdemic that they were able to make these people seem in any way worthy of respect. Objectively they're just the most contemptible dorks.",
                "author": "flp999"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "CBP's social media admin is undefeated 😆",
        "score": 797,
        "text_content": "",
        "comments": [
            {
                "raw_content": "deport them all. no daca, no citizenship, no free phones, no free education, no sweet mortgages or sba loans, no free rides, no more free healthcare, no more free shit! you snuck in here like thieves, commit crimes, suppress wages, increase the cost of living, harbor disease, eat our pets, start riots, speak no english, refuse to assimilate, hate americans, have no knowledge of even the most basic tenets of freedom, and generally just stink up the place. time to go home you ungrateful bastards!",
                "author": "stick_in_the_eye"
            },
            {
                "raw_content": "Less capture, more strafing.",
                "author": "RealWomenLoveTrump"
            },
            {
                "raw_content": "Didn't see one airdrop into the Gulf of America.",
                "author": "airborne3502"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "House Republicans now say they have secured enough votes to pass President Donald Trump’s signature ‘One Big Beautiful Bill",
        "score": 1395,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Will an Obama judge allow this?",
                "author": "ToxicAvengerOhio"
            },
            {
                "raw_content": "I hate all omnibus bills, including this one, but without a 60 vote margin, this seems to be the only way to prevent the tax cuts from sunsetting. I HATE POLITICIANS.",
                "author": "GuerillaYourDreams"
            },
            {
                "raw_content": "room temp IQ click-bait lacking the context of its a vote to get it to the floor for a passage vote",
                "author": "OTher55"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨#BREAKING: Now United States House of Representatives Speaker Mike Johnson said he has the votes to advance the Big Beautiful Bill",
        "score": 254,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Any time something like this happens, I’m waiting 72 hours to believe anything.",
                "author": "madeaprofilejustforu"
            },
            {
                "raw_content": "Git-R-Dun",
                "author": "OpusX"
            },
            {
                "raw_content": "[Nick Sortor: Speaker Johnson just said he “has the votes” to advance the Big Beautiful Bill. This comes after he just met with Burchett, Spartz, and Massie.](https://x.com/nicksortor/status/1940650339579068551)",
                "author": "Mr_Rightside"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Steam Hardware & Software Survey (June 2025)",
        "score": 114,
        "text_content": "Steam has published its Hardware and Software Survey for June 2025. Almost all of Nvidia's Blackwell 50-series GPUs have appeared, and the RTX 5090 has finally shown up on the list. Surprisingly, the RTX 5060 also made an appearance, despite launching recently on May 19th. In contrast, AMD's RDNA 4 GPUs, including the RX 9070 and RX 9060 XT are still missing from the survey. https://store.steampowered.com/hwsurvey/",
        "comments": [
            {
                "raw_content": "AMD finally crossed 40% in CPUs (and so, Intel dropped below 60%)",
                "author": "SmashStrider"
            },
            {
                "raw_content": "wonder what is this - NVIDIA Graphics Device----**0.41%**\\+0.41%",
                "author": "hsien88"
            },
            {
                "raw_content": "Everyone is focusing on individual cards, but AMD’s overall share is up despite the no-show of 9070 and 9060. Where is that coming from, just a bunch of people gaming on iGPUs?",
                "author": "Lisaismyfav"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "GeForce RTX 5050 falls behind Arc B580 and RTX 4060 in first review - VideoCardz.com",
        "score": 34,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Same price as B580 with lower performance, 4GB less vram and 128 bit bus. A round of applause for Nvidia",
                "author": "Wonderful-Lack3846"
            },
            {
                "raw_content": "Now that we have a third-party review, it pretty much confirms what Inno3D said the other day, it's definitively slower than the RTX 4060 by about 5-7%.",
                "author": "KARMAAACS"
            },
            {
                "raw_content": "Hello KARMAAACS! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "PS5 Pro is getting a big upgrade in 2026 — I asked Mark Cerny what’s coming, and why AMD’s future PC GPUs feel more 'PlayStation' than ever",
        "score": 177,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Cerny said all of this exact same stuff back in March in a long interview with Digital Foundry and everyone got mixed up then and I’m seeing the exact same thing happen again. After PSSR was finished in 2023, Sony and AMD started a collaboration called Project Amethyst and the first product of it was FSR4. The PS5 Pro is NOT getting FSR4, it’s getting a new version of PSSR that uses work from that collaboration, a reimplementation of the FSR4 training and model using a different algorithm. This is because FSR4 relies on hardware features of RDNA4 which Pro does not have, it has a custom Sony developed ML solution instead. Cerny says that PSSR2 or whatever they end up calling it will be just as efficient as FSR4 and will net the same results, it’s just not straight up FSR4. Their short term plans for Project Amethyst are to collab together on neural networks and training for graphics which resulted in FSR4 and the upcoming PSSR2, and their longer term goal is to collab on future hardware to make it better at ML and RT. Sony had to roll their own ML/RT solutions for PS5 Pro and both companies realized it’s better if they work together, which is why Cerny is working on RDNA5. The idea is to work together on these things so they aren’t separately working on the same problems and coming up with redundant solutions. They aren’t in competition with each other so more convergence between AMD’s GPUs and Playstation in both hardware and software makes a lot of sense and will make both better.",
                "author": "shoneysbreakfast"
            },
            {
                "raw_content": "Summary of an interview with Mark Cerny and AMD execs. Main insights: * FSR4 confirmed to be coming to PS5 Pro in 2026. Claimed to be \"a drop-in replacement for the current PSSR\" and \"the full-fat version of the co-developed super resolution\", i.e. no quality compromises. * Reiterating heavy Sony involvement with RDNA5/UDNA development via Project Amethyst, on both the software and hardware side. > \"Big chunks of RDNA 5, or whatever AMD ends up calling it, are coming out of engineering I am doing on the project,\" said Cerny.",
                "author": "PorchettaM"
            },
            {
                "raw_content": "Nvidia got ai warchest for r&D amd got xbox & sony Intel got?",
                "author": "NeroClaudius199907"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Hardware Unboxed] The Radeon RX 9070 XT is Now Faster, AMD FineWine",
        "score": 380,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Now 3% faster than a 5070 Ti at 1440p in HUB's 16 game average, pretty cool for regions like mine where the 9070 XT is a lot cheaper than the 5070 TI",
                "author": "RealOxygen"
            },
            {
                "raw_content": "9% faster than launch is no joke. And some of the individual games are 20+%, that's like more than the difference between a base model and an overclocked one. I wonder how the 9070 non XT fared",
                "author": "TheCatOfWar"
            },
            {
                "raw_content": "would it be foolish to expect a change in performance on a 9060xt as well?",
                "author": "tyezwyldadvntrz"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Tech Power Up] Intel Abandons In‑House Glass Substrate R&D, Leans on External Suppliers",
        "score": 26,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Should probably post the ComputerBase link vs the techpowerup one, at least since the original tweets aren't allowed. https://www.computerbase.de/news/wirtschaft/weitere-umbauten-intel-soll-den-alleingang-bei-glassubstrat-beenden.93357/",
                "author": "Exist50"
            },
            {
                "raw_content": "Intel adopting the strategy of canceling everything but at the same time saying that thing is somehow coming",
                "author": "Quatro_Leches"
            },
            {
                "raw_content": "Glass substrates along with silicon photonics are the future of advanced packaging. Intel canceling glass substrates is not great long term. But if cutting glass substrates means that more funding can be allocated to CPU or GPU design then cutting it is a great idea. AMD is rapidly eating away at Intel's server and client desktop market share and they need to really pull out the stops in R and D money to beat back the AMD tsunami. Intel's lack of funding in it's product division has also allowed AMD to make inroads with laptop OEM's. Dell making business AMD laptops is a huge win for them and it probably scares Intel. RCA invested too much into future looking technologies and it wrecked their company, ergo the CED. focusing on the near term isn't a bad idea.",
                "author": "Healthy-Doughnut4939"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Was Intel Evo just a rushed anti-Apple campaign?",
        "score": 11,
        "text_content": "I’m starting to feel like Intel Evo was more of a marketing scramble than a genuine standard. Right around the time Apple dropped the M1 and shocked the world with insane battery life and performance per watt, Intel suddenly rolled out “Evo” branding with its OEM partners. Sleek ultrabooks, “verified” for responsiveness, battery life, instant wake, yadda yadda. But for anyone who’s actually owned one of these Evo laptops… you probably already know where this is going. I’m currently typing this from a so-called Evo-certified laptop — a Core i7-1260P machine. And I’m here to tell you: the battery life is atrocious. We’re talking 3 hours max, and that’s with me trying to keep things under control. 30Wh/hr consumption if I want anything close to “MacBook-smooth.” What happened to “9+ hours of real-world battery life” that Intel and the OEMs were touting? The worst part? It *lags*. You’d expect short battery life to at least come with some performance kick — nope. Thermal throttling, high idle power, and fans constantly spinning even while browsing. So was Evo ever about actual user experience? Or was it just a desperate attempt to slap a badge on premium Windows ultrabooks and call them a MacBook killer? Would love to hear from others: Has anyone had a good Evo experience, or are we all just pretending?",
        "comments": [
            {
                "raw_content": "I don't think so Intel EVO is a genealogy of the certification system that Intel has done in the past. For example, Core2 generation \"Intel Centrino\"… For example, intel UltraBook... https://youtu.be/3yahuqXS3r8?si=GJSX9iRCtQMN1zGS https://youtu.be/2N2I9FP3JOw?si=6a3PI8dhUX_7_QuM It is a commercial for the Japanese localization of the above brand.",
                "author": "Illustrious_Bank2005"
            },
            {
                "raw_content": "Intel Evo 11th gen i7 in my thinkpad running mx Linux has great battery life for me. No official tests but I can play stardew unplugged for hours",
                "author": "captky22"
            },
            {
                "raw_content": "Intel has been trying to make laptops with phone-like features since forever. \"[Ultrabook](https://en.wikipedia.org/wiki/Ultrabook)\" was an Intel invention in 2011 to raise the quality of Windows laptops. Then Intel made [Project Athena](https://www.theverge.com/2019/5/28/18642213/intel-project-athena-specification-year-1) in 2019 to enforce stricter standards, that eventually became Evo. The problem is that it's really hard to make the laptop industry rally around a single standard. Some companies make really great Windows laptops that fit the standard well, but there will be some that will find every opportunity to cut costs while still being able to pass the bare minimum standard, or just have absolutely horrendous QC. One shitty model from one shitty brand can tarnish the whole program. Apple doesn't have that problem because not only do they only sell only two laptop models, but they have insane control over their computers from the OS down to the chip and so can optimize the hell out of them. Also, tbh Intel, especially around the time of the 1260P, wasn't known for having really great performance per watt anyway. You'd probably get a much better experience getting AMD.",
                "author": "Some-Dog5000"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nintendo should just buy these two beloved Franchises: Banjo-Kazooie & Perfect Dark",
        "score": 371,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Rare was practically begging Nintendo to buy them when Microsoft did. They could have had them for pennies on the dollar if they wanted them… they don’t.",
                "author": "joe-is-cool"
            },
            {
                "raw_content": "It's absolutely insane how Xbox has continuously dropped the ball with Rare and all of its beloved franchises over the last 20+ years",
                "author": "Daddy_Fire21"
            },
            {
                "raw_content": "Why do that when they can just create something new that doesn't have the baggage? You can do a spiritual successor, but the IP itself hasn't been relevant for multiple generations.",
                "author": "FrequentFailer"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Are you guys keeping your Nintendo Switch 2 box?",
        "score": 1266,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I keep the boxes for all of my electronics. Never know if I need to do a return, RMA, a move where it's safer or more convenient to transport it in the box, etc.",
                "author": "Mcdohl337"
            },
            {
                "raw_content": "Yeah I always keep my boxes for big purchases",
                "author": "Organae"
            },
            {
                "raw_content": "Yes",
                "author": "PrussianGeneral1815"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The Verge has found Nintendo is using proprietary handshakes with docks, breaking compatibility",
        "score": 184,
        "text_content": "It turns out that before the Switch 2 dock outputs video, more than 30 messages are exchanged between Switch 2 and the dock. This authentication process is what is blocking 3rd party docks. JSAux says “We do expect Nintendo may further limit third-party docks and accessories via system updates to maintain device and system security.” Verge tested the Antank dock and verified that it was sending the same proprietary messages as the Switch 2 official dock. Antank believes this key could change, but they support software updates for their dock so they think they can continue to patch in support if needed. One section I want to highlight is this: >But before you suggest that the vents and fan are strictly necessary, **please know that the cooling fan in the Switch 2 dock** [**doesn’t actually cool the Switch 2**](https://www.reddit.com/r/NintendoSwitch/comments/1jtjt7r/apparently_the_docking_stations_fan_does_not/)**, and that Antank’s dock doesn’t seem to make a Switch 2 run hotter than the official dock**. I ran *Cyberpunk 2077* for an hour straight with each dock, then pulled out a thermal camera, and Antank’s actually seems slightly cooler. Perhaps having more airflow across the screen and back of the console offsets the impact of blocked vents. They shared thermal images of the Switch 2 console after an hour of running Cyberpunk 2077, and Switch 2 was 3ºC cooler after being used with the Antank dock. While docked, Antank was 4º cooler. I think this is the first official testing to confirm there's no negative thermal consequences to using an Antank dock, despite the vents seemingly blocked.",
        "comments": [
            {
                "raw_content": "I wonder if they taking measures to avoid cheap third party docks breaking the system. I remember in the first few years, using third party dock for Switch 1 was a huge risk and one update bricked a couple consoles.",
                "author": "linkling1039"
            },
            {
                "raw_content": "GameStop is selling preorders of their own travel dock. I wonder what the fallout is going to be if they ever stop working due to an update",
                "author": "skip-bo"
            },
            {
                "raw_content": "Hello EU, where are you when we need you?",
                "author": "N2-Ainz"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Launch Month Pick-Ups",
        "score": 214,
        "text_content": "Pleased to say every game has been really fun, just got BoTW today and I’m excited to try it for the first time! How’s everyone’s pick-ups looking for launch month?",
        "comments": [
            {
                "raw_content": "Huh, I didn't know Switch 2 games had art on the spines. That's cool.",
                "author": "NickVersus"
            },
            {
                "raw_content": "Fuck me BotW was so good! If you haven’t played those Switch 1 Zelda titles then you’re in for a treat. Happy gaming!",
                "author": "four_star"
            },
            {
                "raw_content": "Cyberpunk is the only game that I don't already own.",
                "author": "F34RTEHR34PER"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I printed an angled stand to make the Switch easy to access.",
        "score": 336,
        "text_content": "I was having trouble getting my Switch in and out of its spot on my entertainment stand since there wasn’t much clearing from the shelf above. When looking for a solution I stumbled on this free stl file and decided to give it a shot. Here’s the file if any of you with access to a 3D printer want to try it out. https://www.printables.com/model/1320804-nintendo-switch-2-horizontal-dock-stand It’s basically a small wedge with attachment points at the back. Put some rubber feet on it so it doesn’t slide around and it works really well! Makes getting the whole thing out a breeze and I don’t have to fiddle with it anymore.",
        "comments": [
            {
                "raw_content": "I just keep mine behind the TV where it can stand up straight.",
                "author": "Williekins"
            },
            {
                "raw_content": "Can you make one that shoots it out like a toaster?",
                "author": "Pomps8a"
            },
            {
                "raw_content": "My main concern would be that you’re now trapping any exhausted heat under the console, but it’s hard to tell from your picture how much of an issue that might be.",
                "author": "cuntpuncherexpress"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Double ultra-shortcut found",
        "score": 1320,
        "text_content": "The game is fast fusion, please LMK if you have a lower time than me! Y'all should also check out r/FASTFUSION.",
        "comments": [
            {
                "raw_content": "So glad this game doesn’t have online. Y’all are crazy lol",
                "author": "PaleFondant2488"
            },
            {
                "raw_content": "I always thought these games tie you to the track, didn't know you could actually leave and do this",
                "author": "BlueberryNeko_"
            },
            {
                "raw_content": "So glad the sub is finally shilling this game",
                "author": "Icalivy"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "PEOPLE ARE SELLING BRICKED SWITCH 2'S ON EBAY!",
        "score": 537,
        "text_content": "If you are trying to get your hands on this console, please buy it from Target, Walmart, or a big store in your country, as on ebay people are selling bricked Switch 2 consoles! Please watch out!",
        "comments": [
            {
                "raw_content": "Anyone buying a bricked console not clearly marked as such on ebay will have an easy time getting their money back (and making life more miserable for the seller). Anyone buying a bricked console on FB marketplace or craiglist will probably have a much tougher time getting their money back",
                "author": "M1Lance"
            },
            {
                "raw_content": "Whomever is selling these on eBay, if true, will end up having to refund the buyers and pay for return postage and get negative feedback. A bit pointless to try this. If there’s one area eBay excels at is refunding buyers.",
                "author": "NintendoWhich"
            },
            {
                "raw_content": "Might be those taken in the heist. [https://www.cbsnews.com/colorado/news/investigation-colorado-nintendo-switch-2-heist/](https://www.cbsnews.com/colorado/news/investigation-colorado-nintendo-switch-2-heist/)",
                "author": "Zendroid1"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Yesssssssss",
        "score": 46,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Widescreen makes it feel like a new game.",
                "author": "Itsacone"
            },
            {
                "raw_content": "It’s honestly so much fun! I have over an hour already on day 1. That doesn’t usually happen for NSO drops.",
                "author": "Pokeguy211"
            },
            {
                "raw_content": "This game got me really interested in trying out MSBL again to see if maybe I was a little harsh… Nope. In fact, I was a little too lenient. My only complaint used to be the field size. I still stand by that being a major issue for the game. But Boom Boom is straight doodoo as a goalkeeper and the in-match music is missing a bit of edge and intensity. Now, though, I have a bigger primary complaint. Scoring a goal, the end of the match, and even the moments immediately after the hyper strike animations feel so flaccid. I’m so happy Strikers is on GC NSO now because I had almost forgotten how amazing it is!!",
                "author": "Parzival127"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "No one at Halo Studios is confident with their next project currently, Microsoft trying to replace many jobs with AI, says Rebs Gaming",
        "score": 877,
        "text_content": "[https://xcancel.com/Mr\\_Rebs\\_/status/1940574521221607597#m](https://xcancel.com/Mr_Rebs_/status/1940574521221607597#m) •At least 5 employees were laid off, they received an invite to a meeting with organization leaders, and two (very long) hours later, the Teams call began. •The mood at the studio is tense, especially when it comes to one project that was recently in crisis, according to the developer. **\"I don't think anybody is really happy about the quality of the product right now,\" they said \"There's been a lot of tension and pep talks trying to rally folks to ship.\"** •Since 2023, there's been a general shift toward working with contracted studios — rather than individual contractors — in the United States and Europe to speed up Halo production. •Developer says Microsoft is trying their damndest to replace as many jobs as they can with AI agents. **Edit:** *Real source is Engadget* [Full report via Engadget](https://www.engadget.com/gaming/xbox/even-before-the-xbox-layoffs-there-was-tension-at-halo-studios-002031995.html?guccounter=1)",
        "comments": [
            {
                "raw_content": "> •Developer says Microsoft is trying their damndest to replace as many jobs as they can with AI agents. Nope, don't like that",
                "author": "vaena"
            },
            {
                "raw_content": "I get that greedy executives want to continue making their gargantuan profits without having to pay the people who facilitated that by laying them all off and replacing them with ai, but what I dont understand is who they expect to buy their products when everyone is laid off and has no income",
                "author": "johncitizen69420"
            },
            {
                "raw_content": ">Developer says Microsoft is trying their damndest to replace as many jobs as they can with AI agents gonna be real, there are so many damn games out there I still haven't played that Microsoft and other publishers going all in on AI would just mean I might actually get through my \"made by actual people\" backlog",
                "author": "blackthorn_orion"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Windows Central: Xbox is closing The Initiative, Perfect Dark is cancelled",
        "score": 3138,
        "text_content": "https://www.windowscentral.com/gaming/xbox/microsoft-is-closing-down-xbox-studio-the-initiative Matt Booty's email to staff: > > \"Following Phil’s note, I want to share more about the changes to the Studios business units. > > We have made the decision to stop development of Perfect Dark and Everwild as well as wind down several unannounced projects across our portfolio. As part of this, we are closing one of our studios, The Initiative. These decisions, along with other changes across our teams, reflect a broader effort to adjust priorities and focus resources to set up our teams for greater success within a changing industry landscape. We did not make these choices lightly, as each project and team represent years of effort, imagination, and commitment. > > Our overall portfolio strategy is unchanged: build games that excite our players, continue to grow our biggest franchises, and create new stories, worlds, and characters. We have more than 40 projects in active development, continued momentum on titles shipping this fall, and a strong slate headed into 2026. > > For those directly affected, we are working closely with HR and studio leadership to provide support, including severance, career transition assistance, and where possible, opportunities to explore roles on other teams. > > To everyone across our studios: thank you. Your creativity and resilience continue to define who we are. I believe in the strength of our teams and the direction we're taking on the path ahead.\" — Matt Booty, Xbox Game Studios Previous rumor: https://www.reddit.com/r/GamingLeaksAndRumours/comments/1lq0b5b/jez_thinks_perfect_dark_is_cancelled/",
        "comments": [
            {
                "raw_content": "RIP",
                "author": "YottaEngineer"
            },
            {
                "raw_content": "The Initiative was supposed to be a \"Dream Team\" of developers with proven experience working on AAA games... It's crazy how badly they fucked up here.",
                "author": "MuptonBossman"
            },
            {
                "raw_content": "Absolute bloodbath",
                "author": "sufferingphilliesfan"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Layoffs at Halo Studios",
        "score": 636,
        "text_content": "https://bsky.app/profile/did:plc:apsk7dfeuy3ehuua7wh5dpfr/post/3lsyo4cifms2w > I was let go from Halo Studios. Sucks.",
        "comments": [
            {
                "raw_content": "Goddamn look at their most recent retweet too. ‘Has Xbox considered laying off one person instead of thousands’-And it’s a picture of Phil Spencer…",
                "author": "Gen6V"
            },
            {
                "raw_content": "To be a Halo fan is to suffer. (the books are fire tho😳❗)",
                "author": "ArcherInPosition"
            },
            {
                "raw_content": "Layoffs suck but I’m surprised 343 lasted this long putting out mediocre game after mediocre game.",
                "author": "__TheWaySheGoes"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "ResetEra: Two users claim that Kojima Productions OD's publishing contract with Xbox is over",
        "score": 573,
        "text_content": "Would be nice if any journalist can investigate if it is true or false. Quotes: \"I'm hearing from the grapevine (so please take with a big, potentially massive grain of salt) that Kojima OD's publishing contract with MS might be up in flames. KJP owns the IP and will shop for a new publisher.\" In response to the first quote: \"I have heard the same for a while now.\" Source: https://www.resetera.com/threads/schreier-deep-job-cuts-across-xbox-everwild-zenimax-online-ip-perfect-dark-unannounced-projects-cancelled-t10-50-cut-the-initiative-closed.1233783/post-142206228 https://www.resetera.com/threads/schreier-deep-job-cuts-across-xbox-everwild-zenimax-online-ip-perfect-dark-unannounced-projects-cancelled-t10-50-cut-the-initiative-closed.1233783/post-142206294",
        "comments": [
            {
                "raw_content": "Given the game was allegedly designed around cloud tech, hence Google's initial involvement, I'm curious where it will go now if this is true",
                "author": "Coolman_Rosso"
            },
            {
                "raw_content": "So this is just two random people making claims that have a chance to be true because of what happened today?",
                "author": "stavroszaras"
            },
            {
                "raw_content": "I feel like some bigger journalist would have confirmed this by now. That’s a big story to break.",
                "author": "Gen6V"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Kotaku editor : Perfect Dark sizzle reel was \"basically fake\".",
        "score": 1186,
        "text_content": "\"The Perfect Dark sizzle reel at last year's Xbox showcase looked awesome. Someone at the time also told me it was basically fake. This was a joint project with Crystal Dynamics, a studio that's also struggling with Tomb Raider.\" https://bsky.app/profile/did:plc:idpr7cxv2u34lmpvap62t7kp/post/3lsypye2edk2v?ref_src=embed",
        "comments": [
            {
                "raw_content": "It was obvious by the way the camera worked in it.",
                "author": "FransD98"
            },
            {
                "raw_content": "![gif](giphy|AaQYP9zh24UFi)",
                "author": "TopBoog"
            },
            {
                "raw_content": ">a studio that's also struggling with Tomb Raider.\" Maybe we just shouldn't bother with next gen consoles, because whatever leaps tech its gonna give us will finish off whatever remains of the western AAA space due to their inability to get their shit together.",
                "author": "Animegamingnerd"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Banjo-Kazooie and Sea of Thieves director Gregg Mayles is leaving Rare after more than 35 years following the cancellation of Everwild",
        "score": 873,
        "text_content": "[https://www.videogameschronicle.com/news/sources-banjo-kazooie-sea-of-thieves-director-leaves-rare-after-35-years-following-everwild-cancellation/](https://www.videogameschronicle.com/news/sources-banjo-kazooie-sea-of-thieves-director-leaves-rare-after-35-years-following-everwild-cancellation/) >According to multiple people at the studio, who spoke to VGC anonymously, Mayles will leave [Rare](https://www.videogameschronicle.com/companies/microsoft/rare/) following news of [Everwild](https://www.videogameschronicle.com/games/everwild/)’s cancellation on Wednesday. The designer had been directing the project [since its team was restructured](https://www.videogameschronicle.com/news/why-wasnt-everwild-at-e3-its-been-completely-rebooted/) in 2021. >According to the sources, executive producer [Louise O’Connor](https://www.videogameschronicle.com/people/louise-oconnor/), another Rare veteran whose first project was Conker’s Bad Fur Day for [Nintendo 64](https://www.videogameschronicle.com/platforms/nintendo/nintendo-64/), will also leave the company following Everwild’s cancellation.",
        "comments": [
            {
                "raw_content": "It is now officially Rare in name only. He was like the last major vet of the company who had been there since their days as a Nintendo second-party Considering how much of a proponent he was for doing original games and not relying on revisiting their older franchises, this kind of shake up definitely plays into the idea that Microsoft's gonna probably mine the shit out of their old stuff now no matter what because it's just more safe and assured in this new climate where they want \"priority games\"",
                "author": "MyMouthisCancerous"
            },
            {
                "raw_content": "Wonder if he goes to Playtonic or does the \"I'm a recognizable name and can start my own studio with venture capital\" route Either way, real end of an era. People have said Rare hasn't been Rare for a long time, but I think that's actually the last of the old guard that worked on the classics people love the studio for",
                "author": "blackthorn_orion"
            },
            {
                "raw_content": "35 years. Long time.",
                "author": "SelectivelyGood"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[The Verge] The Xbox user research team has been hit hard by today’s layoffs, with “nearly half” the team affected. The head of Xbox family and child safety has also been laid off",
        "score": 520,
        "text_content": ">News of Microsoft’s major layoffs today keep rolling in, as the company informs around 9,000 employees of the cuts. I’ve heard from sources that the Xbox user research team has been hit hard, with nearly half the team affected. It’s a key team that focuses on ensuring quality across Xbox games, the platform, and developer tools. Even the head of Xbox family and child safety has also been laid off. [Source](https://www.theverge.com/news/697111/microsoft-xbox-layoffs-user-research-child-safety)",
        "comments": [
            {
                "raw_content": "Yeah, they're just betting on AI taking care of this stuff.",
                "author": "phznmshr"
            },
            {
                "raw_content": "Xbox quality control will be run by Copilot",
                "author": "4000kd"
            },
            {
                "raw_content": "Fuck them kids",
                "author": "sufferingphilliesfan"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Microsoft says that Phil Spencer, Microsoft Gaming CEO and the head of Xbox, isn’t retiring “anytime soon.”",
        "score": 518,
        "text_content": "[https://www.theverge.com/news/696922/phil-spencer-xbox-microsoft-gaming-retiring](https://www.theverge.com/news/696922/phil-spencer-xbox-microsoft-gaming-retiring) >“Phil is not retiring anytime soon,” says Kari Perez, head of Xbox communications, in a statement to The Verge. The denial comes after Call of Duty leaker GhostOfHope claimed “Phil Spencer will be retiring from his role as CEO of Microsoft Gaming after the launch of the next generation Xbox” and that Xbox president Sarah Bond would be taking over as CEO of Microsoft Gaming. >While Microsoft’s comment doesn’t address the rumor fully, it makes it clear Spencer isn’t retiring imminently. Separately, Microsoft communications chief, Frank Shaw, took to X to claim that at least part of the rumor was made up. Previous rumour: [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1lq1rxu/phil\\_spencer\\_will\\_be\\_retiring\\_from\\_his\\_role\\_as/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1lq1rxu/phil_spencer_will_be_retiring_from_his_role_as/)",
        "comments": [
            {
                "raw_content": "I can’t help but feel like Microsoft didn’t completely think out the optics of making a “Phil isn’t going anywhere” statement while laying off tons of people. Just don’t think it looks great imo",
                "author": "pkoswald"
            },
            {
                "raw_content": "Hey guys, I speak corporate. They didn’t actually say he isn’t retiring. They said “anytime soon” which in corporate can be a minute or a decade. The original claim is he was retiring at next Xbox launch.",
                "author": "GoldenTriforceLink"
            },
            {
                "raw_content": "Wow, another fake «inside» from TheGhostOfHope, no way",
                "author": "obaobab"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "The Radeon RX 9070 XT is Now Faster, AMD FineWine",
        "score": 578,
        "text_content": "",
        "comments": [
            {
                "raw_content": "9% faster at 1440p and 4% faster at 4K on average Some games saw almost 30% improvement at 1440p while other games saw no improvement",
                "author": "mockingbird-"
            },
            {
                "raw_content": "9070XTX is here /s how about 9070 non XT? same uplift?",
                "author": "pecche"
            },
            {
                "raw_content": "Did they finally fix the RDNA 4 performance issue in CS2? Congratulations, AMD. Hats off to them, it seems they didn't ignore the problems this time. ![gif](giphy|L8bArPs6V1ToYn45m5)",
                "author": "Crazy-Repeat-2006"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD FSR4-like algorithm coming to PlayStation 5 Pro PSSR update next year",
        "score": 222,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I can't help but giggle every time I see \"PSSR\" mentioned, best upscaler name fr",
                "author": "Afraid_Union_8451"
            },
            {
                "raw_content": "It's not exactly a statement of well-developed foresight that they had to use a different upscaler on the \"Pro\" in the first place. Development time and extra work for the game devs resulted in questionable outcomes (depending on the game) which aren't even going to last. And the (desirable!) change to a FSR4-like solution won't benefit much from previous efforts. Still, if they can make the Playstation GPU work, maybe there's \"some\" hope for RDNA3 owners. Them being (officially) stuck at FSR3 is quite a dent in the user satisfaction regime.",
                "author": "28874559260134F"
            },
            {
                "raw_content": "So will we see a lot more fast support in games now? Considering barely anything supported FSR 3 and it seems like the same with FSR 4",
                "author": "Current-Row1444"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Gamers say no to 8GB GPUs: 16GB RX 9060XT & RTX 5060Ti cards lead in sales over 8GB variants",
        "score": 255,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Doesn’t mean the 8GB variants won’t generate revenue and find its way into pre-built.",
                "author": "usual_suspect82"
            },
            {
                "raw_content": "Cause 8gb cards are a joke in 2025 lol. You're incredibly limited in what u can play with 8gbs and they asking a ton for it. 300+ dollars for an 8gb card is a crime in 2025.",
                "author": "averjay"
            },
            {
                "raw_content": "Remember that time I bought an 8GB RX480 in 2016? That was like... 9 whole years ago.",
                "author": "earlgeorge"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Condo prices are falling. Gen Z and millennials: This could be your shot to break into the housing market 🤡",
        "score": 596,
        "text_content": "[https://archive.ph/xdqXK](https://archive.ph/xdqXK) NO NO NO, do NOT catch a falling knife! These are the same assholes who had no problem telling you to shove it when you wanted to buy during the boom, but now that *they're* in trouble, they want to offload their overpriced shitshack condo onto you, before the expenses completely drains whatever gains they were hoping for.",
        "comments": [
            {
                "raw_content": "In Florida, yeah, condos are collapsing (literally!) Sure, you can get a beach front condo with an ocean view for 250k. Sweet! Just don’t pay attention for the $1250/mo HOA fee that could go up even further at literally any time. Fuck condos",
                "author": "GCsurfstar"
            },
            {
                "raw_content": "And how are they expected to get the loan that allows them to break into the housing market… FHA loans more often than not don’t allow for condo purchases. You can go for a conventional loan, but they have much higher credit requirements… but sure lol",
                "author": "thatone_guy2"
            },
            {
                "raw_content": "Don't be boomer exit liquidity",
                "author": "memecoinlegend"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The private sector lost 33,000 jobs in June, badly missing expectations for a 100,000 increase, ADP says",
        "score": 407,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Even the news of a nuke hitting Wall Street would lead to a green day in the market. What a load of simulated AI horsecrap we live in now.",
                "author": "Lojic_team"
            },
            {
                "raw_content": "So the revision will be more like a 70,000 job loss.",
                "author": "LBishop28"
            },
            {
                "raw_content": "Next month: “US economy outperforms by adding 125k jobs! Last month’s terrible report was further revised down to -150k jobs lost.” Markets go up.",
                "author": "rubyred-2016"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage refinance demand surges, as interest rates drop further",
        "score": 157,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Who is refinancing at 6.7% ? Unless you bought in 2022 there’s been basically no point in time in the past 20 yrs the rates were 1 point higher than now",
                "author": "DesignerCalendar5104"
            },
            {
                "raw_content": "Refinance applications rose 7% last week and are up 40% year over year, but that increase comes from a historically low base. Refi activity collapsed last year due to high rates, so even modest movement looks dramatic in percentage terms. It’s a rebound, not a \"surge\". Purchase applications which are a better indicator of housing market health were basically flat with just a 0.1% increase. That says more about the real state of the market: it is still stagnant. The article lacks any regional breakdown or affordability context. It gives the impression that real estate is picking up when in reality most of the movement is existing homeowners trying to cut costs.",
                "author": "danchoe"
            },
            {
                "raw_content": "How much of that application demand was simply due to marketing: “OMG rates are dropping refinance NOW!”",
                "author": "FailChemical5149"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Homebuyers Gain $16,000 in Purchasing Power As Mortgage Rates Dip to Lowest Level in 3 Months",
        "score": 98,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Prices increase 32k in response to.",
                "author": "OpeningAd447"
            },
            {
                "raw_content": "Lowest level in 3 months! Wow! Anyway.",
                "author": "Guy0naBUFFA10"
            },
            {
                "raw_content": "Company that profits off of purchases and sales says now is the time/prices and rates marginally less than laughable for a short period of time.",
                "author": "PlayItAgainSusan"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Redin under Rocket has removed price history graph",
        "score": 33,
        "text_content": "I was introduced to Redfin last year when i noticed most of the Zillow listings has the same agent listing all the houses in my area, Milwaukee WI, and have enjoyed their data availability and presentation. I remember kidding with some friend that the agents probably hate the graph as it revealas how ridiculous the proces of house are becasue you see for example 200k in 2021 then 2025 lising for 350k. Sudenly, I notice Redfin has removed the graph, and aftrer further inspection I noticed the logo now has a 'powered by Rocket' This is so shady!",
        "comments": [
            {
                "raw_content": "Wonder if it's a regional thing.. or if they're just rolling it out slowly and it will soon take over. I'm in the Chicago area and I can still see the sale history and tax history. Not as a graph, but as a list.",
                "author": "barge_gee"
            },
            {
                "raw_content": "Features appear and disappear on Redfin for no apparent reason. For a while the flood map overlay -- the most important aspect of the site for Florida listings -- disappeared. Then it came back, but you had to click / tap the map icon and then the Flood tab to see it. Realtor.com is and has always been more accurate and complete for price histories. It also has a crime map overlay.",
                "author": "Judge_Wapner"
            },
            {
                "raw_content": "They removed price history when the places relist, about a year ago. [Realtor.com](http://Realtor.com) seems to have all the data.",
                "author": "PresidentAdolphMusk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "It's just math.... Like us",
        "score": 362,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Would the 2% dumbest part of the population know what a \"stochastic parrot\" is? Even expressed in simpler words would they have such a concept?",
                "author": "1morgondag1"
            },
            {
                "raw_content": "What I actually think https://preview.redd.it/51ydapo6zkaf1.png?width=675&format=png&auto=webp&s=452c96ffb28deeef95e2dc5e7444390ff0bf0db6",
                "author": "ZCEyPFOYr0MWyHDQJZO4"
            },
            {
                "raw_content": "https://preview.redd.it/x0mgalhe0laf1.png?width=675&format=png&auto=webp&s=d45a1357dd9fe2438dd983c0d770a25d1610b303 found the accurate one.",
                "author": "saintkamus"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "POST-SCARCITY BLUES",
        "score": 620,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is the kind of AI assisted art we want",
                "author": "Alainx277"
            },
            {
                "raw_content": "Beautiful piece of art that wouldn't exist without you playing with AI and putting together something solid and complete. Hope to see more stuff like it.",
                "author": "RequiemOfTheSun"
            },
            {
                "raw_content": "Holy sh*t.🔥🔥🔥🔥🔥",
                "author": "Ay0_King"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Brick-laying robots in action, “All the brickwork was entirely done with a fleet of 5 of Monumental's robots (yes, including the corners) working together, a first in the world” Ceo says",
        "score": 269,
        "text_content": "https://x.com/salar/status/1938518920878596486?s=46",
        "comments": [
            {
                "raw_content": "\"Entirely done with a fleet of robots\" reminds me of \"contains 100% pure orange juice\"",
                "author": "Ok-Lengthiness-3988"
            },
            {
                "raw_content": "Wait, they build a wooden house then put bricks around it? Why am I just now realizing this.",
                "author": "wyldcraft"
            },
            {
                "raw_content": "What an unserious looking system. There needs to be a hopper/chute. A robotic brick laying system should be doing over 1000 bricks an hour. And not need a full time person. Look at brick road robots. They do like 10000 bricks an hour.",
                "author": "Ambiwlans"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Almost everybody in the 2030s will have a humanoid robot at home",
        "score": 366,
        "text_content": "How fast is robotics with ai progressing? Will we all have house bots? I-robot gave us a look at a possible future of this kind. Upgrade your roomba? Let an android watch your kids? Tutor them? It’s said that robotics has an ai problem not a hardware problem, when our ai is generalized our androids and gynoids will be also. I’m looking forward to this. You?",
        "comments": [
            {
                "raw_content": "Can't get a home. Jokes on him.",
                "author": "Classic-Choice3618"
            },
            {
                "raw_content": "https://i.redd.it/mqbfvvay0iaf1.gif",
                "author": "viavxy"
            },
            {
                "raw_content": "No way. We have different types of adopters. Innovators adopts tech straight away the moment it is released. It is very low percentage like 2.5% of all users. Early adopters. Maybe will wait for a year or so and will adopt second version. 16% Early majority. 30% can wait around 5 years to adopt. Late majority. 30%. Can wait 10 years to adobt. For example, me. Only few months back I bought my first smart watch. While it has been around for a while. Laggards. The rest. May or may not adobt at all. For example. My grandparents still don’t have a smart phone So saying that everyone will have by 2030 is ridiculous.",
                "author": "StrikingImportance39"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The robot uprising is near… give or take a few bug fixes.",
        "score": 1421,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We're laughing now, but these things are seriously impressive. It didn't even fall over.",
                "author": "PilotKnob"
            },
            {
                "raw_content": "Hey, he didn't fall. How many humans have you seen run into things and knock themselves over?",
                "author": "ReasonablyBadass"
            },
            {
                "raw_content": "This is awesome.",
                "author": "Tobxes2030"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI sign with Oracle for an additional 4.5 gigawatts of Stargate capacity with sites being considered in eight states",
        "score": 34,
        "text_content": "New potential Stargate sites: Texas, Michigan, Wisconsin, Wyoming, New Mexico, Georgia, Ohio and Pennsylvania, Oracle recently announced a single cloud deal worth $30 billion in annual revenue, at least a part of it must come from Stargate. Looks like NVIDIA is not the only company whose fortune skyrocketed after the AI boom. [https://www.bloomberg.com/news/articles/2025-07-02/oracle-openai-ink-stargate-deal-for-4-5-gigawatts-of-us-data-center-power](https://www.bloomberg.com/news/articles/2025-07-02/oracle-openai-ink-stargate-deal-for-4-5-gigawatts-of-us-data-center-power) [https://www.bloomberg.com/news/articles/2025-06-30/oracle-signed-cloud-services-deal-worth-30-billion-a-year](https://www.bloomberg.com/news/articles/2025-06-30/oracle-signed-cloud-services-deal-worth-30-billion-a-year)",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/52ueakf3jlaf1.jpeg?width=1178&format=pjpg&auto=webp&s=f2ceeea4121117344eb422630e318173ed35abdd",
                "author": "Beeehives"
            },
            {
                "raw_content": "Almost enough to run 4 DeLoreans",
                "author": "JeelyPiece"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Amazon deploys its 1 millionth robot in a sign of more job automation",
        "score": 303,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Bout time. Let’s talk about UBI Now!!!",
                "author": "etakerns"
            },
            {
                "raw_content": "Amazon is a huge beneficiary of AI and robotics. I expect them to be a $5 trillion company in 2030.",
                "author": "FarrisAT"
            },
            {
                "raw_content": "I wonder how its going to work out for them when the consumers run out of money from lack of jobs at scale? If your ROI on a robot is a few years and the markets start to dry up before the cost is returned, was it worth it? This is going to lead to some fun stuff in our future /s",
                "author": "Feisty-Hope4640"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Why is Zuckerberg so desperate?",
        "score": 192,
        "text_content": "There recent news about Meta paying a bomb to acquire AI talent makes one think of two possibilities? 1. Zuck thinks that internet & the marketing ad market behind it is already dead or going to decline fast? He was smart with mobile shift, buying good companies. AI companies are becoming more expensive to buy. 2. And current team at FAIR is bad? The Cognitive Internet that is going to emerge will need good agents (may not need ASI), but without that positioning best talent might join Ilya or Mira? They won’t come to Meta. Or does he or his board really thinks critically about ASI? Or there is a third possibility that we are missing out?",
        "comments": [
            {
                "raw_content": "for big tech, AI may be the only area that matters in the medium to long term. It may / likely will eat everything else. If zuck doesn’t win in AI, his entire business may be clipped. Meta google Microsoft etc all know this and are all going all in on it.",
                "author": "floodgater"
            },
            {
                "raw_content": "You're in the singularity subreddit and wondering why he's desperate for AI talent?",
                "author": "csAxer8"
            },
            {
                "raw_content": "Zuck already has more money than you can ever dream of. In his position it makes perfect sense to want to reach ASI first, which would unlocks rewards he can only dream of.",
                "author": "Silver-Chipmunk7744"
            }
        ],
        "subreddit": "singularity"
    }
]