[
    {
        "post_name": "And it will only get worse!",
        "score": 617,
        "text_content": "",
        "comments": [
            {
                "raw_content": "BREAKING - A young man from Dalton, UK has been arrested after shouting “we love bacon” during a protest at a mosque. https://x.com/Rightanglenews/status/1958147629839188277",
                "author": "GunToast"
            },
            {
                "raw_content": "I love bacon! 1776 was so amazing. Brits have never recovered from their monarchy.",
                "author": "TrancePhreak"
            },
            {
                "raw_content": "Can the Brits even afford bacon these days?",
                "author": "UsernameChexOut"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "With all the female referees and coaches... the NFL deserves LOTS of green dildo's.",
        "score": 221,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lombardi is spinning in his grave. SHAME on them for promoting gays and lesbians.",
                "author": "MAGALOVER"
            },
            {
                "raw_content": "Half this site still watches it. More than half probably. Faggots.",
                "author": "EgregiousPhilbin"
            },
            {
                "raw_content": "\"... female referees and coaches...\" - Surely they be lost on their way to feminist camp.",
                "author": "Okannah"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Documents were manufactured and altered in order to get the Maralago raid approved. This is not the same. No Judge being watched this closely would have signed off on a warrant for Boltons house without cause. You can’t have it both ways.",
        "score": 236,
        "text_content": "",
        "comments": [
            {
                "raw_content": "With such a target rich environment, raiding Bolton's house came as a surprise. The Russia hoaxers have had plenty of time to cover their tracks. We know what they did, but it still has to be proven. While Bolton's barely a blip on the political radar, he may connect a lot of dots. May end up being a brilliant first move. Like a back door into a heavily encrypted and secure software program.",
                "author": "airborne3502"
            },
            {
                "raw_content": "They got Orville Redenbacher first so you know to make the popcorn. 🍿",
                "author": "YodaBannon"
            },
            {
                "raw_content": "It's part of the progressives MO To have it both ways. I call it simple hypocrisy, but I believe they have erased that word out of the dictionary along with so many others.",
                "author": "Ihateallliars"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "3rd male cheerleader added to Vikings",
        "score": 186,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Tampon Tim is a gifted WIDE receiver.",
                "author": "M1kes_Cock"
            },
            {
                "raw_content": "Best two-handed wave in the league.",
                "author": "GuidedDisinfo"
            },
            {
                "raw_content": "The NFL was asking for green dildos on the field without actually asking for them.",
                "author": "airborne3502"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "THIS YEAR: Gavin Newsom’s 10-year plan to end homelessness in San Francisco will mark its 22-year anniversary.",
        "score": 909,
        "text_content": "",
        "comments": [
            {
                "raw_content": "By Democrat Standards, They're On Schedule.",
                "author": "MericaFukYeah"
            },
            {
                "raw_content": "Now, what were the projected costs and how much has been spent so far?",
                "author": "GuidedDisinfo"
            },
            {
                "raw_content": "Well, at least they tried.",
                "author": "HelluvaEngineer"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Jeff Bezos Washington Post Bureau Chief is BUSTED on Camera Admitting their Paper absolutely WILL NOT Run any Positive Trump Stories",
        "score": 872,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How is this surprising to anyone? The media is still too coddled and needs to be dealt with.",
                "author": "MotherCoconuts"
            },
            {
                "raw_content": "Enemy of the people. They deserve medieval punishments broadcast worldwide.",
                "author": "A_Colostomy_Bag"
            },
            {
                "raw_content": "If they ask pageant people about Trump, and they have good things to say, there is no story according to the Washington Post reporter. That is not journalism. It is activism in the guise of journalism. It directly undermines the basis of a civil society, which is trust. So damaging. Probably will be a Pulitzer in store for the weasel.",
                "author": "Mamapedia"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "FUCK GAVIN",
        "score": 868,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Communists and Muslims have no place in society. Imagine America without them.",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "[Tom MacDonald dissed Greasy Gavin Newscum in his new song - The Devil Is A Democrat: \"The devil lives in California. He a politician. He passin' bills that bring chaos and division. Yeah the devil lives in California, should be in prison. He got horns but he tries to keep em hidden. The devil lives in California. Hundred dollar bills. He knows everyone in Hollywood, and parties in The Hills. Give you everything you ever wanted, plus a couple mil, for your soul and your vote...it's a deal.\"](https://m.youtube.com/watch?v=wKdFeZTnAK0) It'll most likely end up being #1 Billboard. Tom mentioned in a Community Post 5 days ago that the song took the #1 spot on Billboard from Cardi B, so he just has to hold it.",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "Commie Oldscum.",
                "author": "GodIsPerfect"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump announces the nomination of 4 Judges to the Western and Middle Districts of North Carolina.",
        "score": 819,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good, NC is one of those nice southern states that’s teetering on the edge of becoming fully retarded.",
                "author": "ecto_coolest"
            },
            {
                "raw_content": "Two women, does he never learn?",
                "author": "rtav"
            },
            {
                "raw_content": "[It is my Great Honor to announce the nomination of David Bragdon to serve as Judge on the United States District Court for the Middle District of North Carolina.](https://truthsocial.com/@realDonaldTrump/posts/115074853922882875) [It is my Great Honor to nominate Lindsey Freeman to serve as Judge on the United States District Court for the Middle District of North Carolina.](https://truthsocial.com/@realDonaldTrump/posts/115074855100531685) [I am pleased to nominate Matthew Orso to serve as Judge on the United States District Court for the Western District of North Carolina.](https://truthsocial.com/@realDonaldTrump/posts/115074851803012151) [I am pleased to nominate Susan Courtwright Rodriguez to serve as Judge on the United States District Court for the Western District of North Carolina.](https://truthsocial.com/@realDonaldTrump/posts/115074852826314245)",
                "author": "Mr_Rightside"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: ICE is preparing to potentially deport Kilmar Abrego Garcia to UGANDA as soon as Monday, per emails DHS sent to Garcia’s counsel, obtained by @BillMelugin. This comes just hours after activist judge Barbara Holmes in Tennessee released Kilmar Abrego Garcia back on the streets.",
        "score": 1429,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Best timeline tbh",
                "author": "JebediahBush"
            },
            {
                "raw_content": "Uganda Knuckles will not like that. I want That illegal vs Uganda Knuckles in a cage match and make it Pay per view at the Gorilla Channel. The US debt will pay itself off in no time.",
                "author": "DT170x"
            },
            {
                "raw_content": "WE SHOULD NEVER TAKEN HIM BACK INTO AMERICA. Fucking bs. People can get killed apprehending this piece of shit.",
                "author": "Here_we_go"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Senator Chris Van Hollen has reportedly contacted Kilmar Abrego-Garcia’s legal team, offering to shelter Garcia in his Kensington, MD residence—believing ICE would not dare raid the home of a sitting U.S. Senator.",
        "score": 1368,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Van Hollen is smitten. He needs to tranquil', baby. He comes on a little too hard. He'll stop at nothing to get this guy to come to his house.",
                "author": "CleanUpPhillyTrump24"
            },
            {
                "raw_content": "🤣That’s a good one.I don’t think Von Hollen is reading the room here! I can imagine Tom Holman making it his business to arrest him for obstruction.It’s going to be glorious.I mean,is he planning to keep this dude for the next decade or what? I think this guy is being super protected by these criminal democrats..",
                "author": "KarenLukasik"
            },
            {
                "raw_content": "Noem and Homan: Hold our beer.",
                "author": "Scatter-Shot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "👇👇👇",
        "score": 1324,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TAXATION IS THEFT.",
                "author": "Wexit-Delecto"
            },
            {
                "raw_content": "Somehow we are ending up with both, and that's bullshit",
                "author": "Formerlurker92"
            },
            {
                "raw_content": "I hate the IRS so fucking much",
                "author": "Zippitydoodah"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "HOLY SMOKES: Journalist Michael Shellenberger says after raiding John Bolton’s House— the FBI could be coming for BRENNAN, CLAPPER, AND COMEY NEXT",
        "score": 757,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Do it now before they have time to react. Why is this faggot giving them warning?",
                "author": "BlackPilledMAGA"
            },
            {
                "raw_content": "Should’ve done them all simultaneously today, instead of giving the order traitors a chance to move or destroy files.",
                "author": "POTUS_DonnieJ"
            },
            {
                "raw_content": "I want to see some ladies join in this fun, like Susan Rice, Samantha Power, Valerie Jarrett, and Side-O-Beef Hillster, to name a few.",
                "author": "4886Battery"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Someone just launched a green diIdo on the NFL field..",
        "score": 512,
        "text_content": "",
        "comments": [
            {
                "raw_content": "NFL is gay. KEK at throwing green dildos at them.",
                "author": "jaeger"
            },
            {
                "raw_content": "Yeah, because the NFL is just as gay as every other professional sport ran by anti-American fucks.",
                "author": "TrumpIsMyyPresident"
            },
            {
                "raw_content": "YES!!! Let's go!!! Wait, green dildo, green field? That won't work. Make them yellow like the refs' penalty flags and the cameras will zoom in on them.",
                "author": "GallowsTime"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Nigel Farage announces a new policy of mass-deportations. Reform UK is adopting remigration as one of its main policy goals once in power",
        "score": 1416,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If it doesn’t involve stripping foreign hordes of citizenship, then he’s wasting his time",
                "author": "henri_derelicte"
            },
            {
                "raw_content": "Too late Farage, you tried reading the room thinking the people were against Tommy Robinson, you kicked out your only politicians who supported this and have on numerous occasions said that mass deportations is an impossibility. You've lost the good faith of anyone who is for making the UK a better place, opportunistic snake.",
                "author": "suitwo_wtr"
            },
            {
                "raw_content": "Used to be based but is now a CLOWN. So sad.",
                "author": "ConGrande1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The reality of Downtown LA.",
        "score": 723,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"The American Dream\" - a visual essay by Gavin Newsom",
                "author": "UnknownKaller"
            },
            {
                "raw_content": "Import the third world, live like the third world.",
                "author": "MikesDong"
            },
            {
                "raw_content": "Ive been around here, in fact I once took a wrong turn while walking and wound up almost entering skid row a few years ago, the homelessno longer ask for money, they threaten you until you give them something. Also when I was young (some 30 years ago) I broke down in the same area, being a kid and poor I was waiting for my brother to drive 2 hours to help us. It was around 9pm. A cab drove by and bust a U like the dang police, ask us what in the world we are doing there, we explain, and he says you can't be here. He pushed us with his cab a few blocks and then explained that in about an hour we would a been dead and GF getting train on her... People say Guardian Angels don't exist, but rando cab driver driving by, stops to help and gets us out of danger... can't explain.",
                "author": "FuckU/Spez"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Welcome",
        "score": 1285,
        "text_content": "",
        "comments": [
            {
                "raw_content": "so many layers to this",
                "author": "spinometer2"
            },
            {
                "raw_content": "# One of the best memes this year",
                "author": "redditadminssuckit"
            },
            {
                "raw_content": "Cracker Barrel man is gonna get robbed in that neighborhood",
                "author": "ecto_coolest"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Former Adams Aide Winnie Greco Bizarrely Claims Cash-Stuffed Potato Chip Bag Handed to NYC Reporter Was ‘Birthday Gift’ – But Her Birthday’s Months Away -- WATCH",
        "score": 666,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Desperate Lies - Tales of the Deep State",
                "author": "MAGAguitar"
            },
            {
                "raw_content": "Birthday gift? That's what birthday cards IN ENVELOPES are for.",
                "author": "billybaldwin2"
            },
            {
                "raw_content": "I feel like a $300 payoff in NYC in 2025 isn't the flex it was 40 years ago.",
                "author": "EJay_Scott"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Shocking NEW Documents Expose Multi-Front Effort To Protect Clintons While Framing Trump. IRS agents reviewed the evidence, and at least one agent concluded it meant that the \"entire [Clinton Foundation] enterprise is a fraud.\"",
        "score": 1171,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wow I remember knowing this like a decade ago",
                "author": "Wrexxis780"
            },
            {
                "raw_content": "just remember folks: \"Absolutely nothing will come of this release, AND that cannot be emphasized enough; because in the final analysis, evidence released to John Solomon – is, by its nature – never going to be used in court proceedings. If the DOJ and FBI planned to use the evidence in court, they would not be giving it to their clickbait friends in media.\" source: https://theconservativetreehouse.com/blog/2025/08/22/the-great-leak-hunt-of-term-1-fbi-director-kash-patel-gives-another-mostly-declassified-release-to-john-solomon/ i'm all for what Solomon is doing to get the word out to people that weren't aware of this stuff, too bad the mainstream will still bury it. but getting it out there in the open is a net good. I wonder what DOJ has that they will use to hold those that broke the law and took a shit on the constitution accountable. only time will tell. if you are building a case you don't put your evidence out to the general public before the trial.",
                "author": "lotxe777"
            },
            {
                "raw_content": "From the article: Five FBI field offices had been involved before being shut down, including a satellite office in Africa. Schweizer called the saga proof of a new kind of corruption — \"offshored, globalized corruption,\" complete with political dynasties selling access and foreign oligarchs buying influence. The contrast between the scuttled investigation of the Clinton Foundation and the \"Crossfire Hurricane\" investigation into the Trump campaign's purported ties to Russia is glaring. While the Clinton probes were heavily throttled, the FBI raced to open a full investigation into Trump's campaign on the flimsiest of tips — a conversation in a London wine bar — green-lighting it within three days. Clinton's Russia vulnerabilities were turned into Trump's burden, projected onto his campaign in a haze of innuendo.",
                "author": "TEXinLA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: President Trump announces the U.S. now fully owns and controls 10% of INTEL in a deal negotiated with CEO Lip-Bu Tan—acquired for FREE and valued at ~$11 BILLION.",
        "score": 1070,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Governments taking control of private corporations and telling them what to charge for their products. Isnt that why they do in socialist/communist shitholes?",
                "author": "HankScorpio"
            },
            {
                "raw_content": "Owning the means of production, eh. Nationalizing. Sounds familiar. We’d be irate if it were Obama.",
                "author": "HoganT"
            },
            {
                "raw_content": "How about NOT making woke, floundering companies too big to fail?",
                "author": "explodejoystick"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING 🚨 GHISLAINE MAXWELL SAYS SHE NEVER SAW TRUMP 'IN ANY INAPPROPRIATE SETTING' — MAXWELL SAYS TRUMP AND EPSTEIN WERE NOT CLOSE FRIENDS: TRANSCRIPT",
        "score": 1408,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I mean if there was anything it would have come out by now. No surprises",
                "author": "IslandMan69"
            },
            {
                "raw_content": "And yet, I can hear the responses from the left, \"SHE'S JUST HOPING FOR A PARDON!\" or \"ARE WE REALLY GONNA TRUST THE WORD OF A CHILD TRAFFICKER?!!\" People are very good about explaining away inconvenient evidence, always have been. I pray the Lord opens their eyes before it's too late, on this and so much more. With God, all things are possible.",
                "author": "TheMrStone"
            },
            {
                "raw_content": "Doesn’t matter. The libshits will just claim she only said that in hopes of immunity form the Trump admin.",
                "author": "SurfandTurf"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump says Intel agreed to give US a stake in its company",
        "score": 390,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Just curious, why do they need to agree to anything? Intel is a public company, can’t the govt just purchase shares from the market?",
                "author": "stupidbullsht"
            },
            {
                "raw_content": "Y'know, for as much as the current President loves to rail against China, he certainly seems fine with the overall model of state capitalism",
                "author": "MC_chrome"
            },
            {
                "raw_content": "Party of small government",
                "author": "Slabbed1738"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nvidia Tapped To Accelerate RIKEN’s FugakuNext Supercomputer",
        "score": 21,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is only for the GPU part. The software libraries that will run on the CPU is using parts of Intel's OneAPI and various DL libraries and MKL - being ported over to Arm, and the CPU in it will be the successor to the A64FX, dubbed Monaka.",
                "author": "Professional-Tear996"
            },
            {
                "raw_content": "This marks the end of Japan exclusively using Japanese technology for its flagship supercomputers. I cannot stress how significant a shift this is. Japan's been designing their own supercomputers since the late 1970s. The tremendous investment that GPUs have received from AI has finally forced Japan to concede and join the herd in adopting them.",
                "author": "NamelessVegetable"
            },
            {
                "raw_content": "Quote from article: \"FugakuNEXT answers that call, drawing on NVIDIA’s whole software stack — from NVIDIA CUDA-X libraries such as **NVIDIA cuQuantum for quantum simulation**, RAPIDS for data science, NVIDIA TensorRT for high-performance inference and NVIDIA NeMo for large language model development, to other domain-specific software development kits tailored for science and industry.\" https://developer.nvidia.com/cuquantum-sdk https://blogs.nvidia.com/blog/fugakunext/",
                "author": "donutloop"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "First MRDIMMs are to come out - friggin 12800MHz. At 2x capacity",
        "score": 10,
        "text_content": "Yes, this stuff is for servers, but it is god given solution for off-the-shelf APUs, which are staved for bandwidth. Some go for LPDDRx, but that kills expandability and capacity. This seems to solve all that and then some. It is effectively a speed doubler - it combines 2 sets of chips ( that would complete ordinary UDIMM stick) in a \"RAID0\" way - it interlieves them. Special high-speed \"register\" chip on M/C/RDIMM takes care of all that: unloading the data lines for optimal transfer speed, doubling the speed over the bus, registering and de/multiplexing data stream and serving TWO banks of RAM. BTW, 12.800MHz is just the start. This thing is poised to reach much higher. 18000 MHz wouldn't surprise me. Looks like win-win-win-win all around. Only downside is that de/multipexer/register introduces extra 1 CLK latency. But at DDR5's existing latencies, that is going to be negligagble, I reckon. It'd be so awesome if we could see AMD's APUs using this. Along with 3D cache on UDNA1, that extra bandwidth would make whole thing shine brightly not only for gaming and CAD, AI would benefit from it, too. But AMD wouldn't be AMD if it hadn't missed that boat, too...🙄 * [InnoDisk Shows DDR5-12800 MRDIMMs at FMS 2025](https://www.servethehome.com/innodisk-shows-ddr5-12800-mrdimms-at-fms-2025/)",
        "comments": [
            {
                "raw_content": "Why should AMD build datacenter memory IP into a laptop chip? There’s next to 0 business case when regular LPDDR5X is at 9600+ over that thing’s lifetime.",
                "author": "SteakandChickenMan"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "South Korea says there are no plans for the U.S. to acquire Samsung shares — denial comes amid talks about Washington acquiring a 10% equity stake in Intel for CHIPS Act funds",
        "score": 27,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hello snowfordessert! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "TSMC N3B/E \"High Performance\" Cores Compared",
        "score": 20,
        "text_content": "**Area** |Core Name|Node + Logic Lib + Metal Layer Count|Core without \"L2 block\"|Core without L2 SRAM arrays|Core|Hypothetical 4C \"CCX\"| |:-|:-|:-|:-|:-|:-| |Apple M4 P-Core|N3E + 3-2 + 19 DT, 17 mobile|^(1)3.09 |\\-|3.09|18.62 (16MB)| |Apple M3 P-core|N3B + 2-2? + 19 DT|^(1)2.62 |\\-|2.62|17.16 (16MB)| |Intel Lion Cove ARL|N3B + ? + ?|^(5)2.62 |^(2)3.12?/3.26 |4.54|27.79 (12MB)| |Intel Lion Cove LNL|N3B + ? + 20|^(5)2.62 |^(2)3.13?/3.26 |4.26|23.62 (12MB)| |AMD Zen 5 Dense|N3E + ? + ?|^(5)2.20 |2.60|2.99|16.65 (8MB)| |Qcom Oryon V2L|N3E + 2-2 + 17|^(1)2.11 |\\-|2.11|^(3)20.02 (24MB) | |Mediatek X925|N3E + 3-2 + 15|1.85|2.38|2.93|^(3,4)16.52 (12MB) | |Xiaomi X925|N3E + ? + 17|1.70|1.96|2.56|^(3,4)16.88 (16MB) | |Intel Skymont|N3E + ? + 20|^(1)1.09 |\\-|1.09|^(4)11.63 (3MB) | 1: Not sure if cores with shared L2s have any, or nearly as much of the logic surrounding handling the L2 cache in the core itself. The cores with shared L2 blocks are just the core area. 2: The first number is without the L1 or L1.5 SRAM array, the second one is including that. 3: Likely an over estimate in comparison to the phone SOCs as the phone SOCs don't have the interconnect \"fabric\" included for their area, just the cores and the cache blocks themselves. 4: The L3 capacity here is completely arbitrary. The L3 capacities were chosen for ease of measurement given how the L3 slices were distributed. 5: A small but sizable chunk of the area of these cores seem to be from the CPL/clock section of the core, which may not have to be so large, but just are that large due to the geometry of the rest of the core. |Core|Revised Core without L2 Block Area| |:-|:-| |Intel Lion Cove|2.33| |AMD Zen 5 Dense|2.08| I would not take any of the numbers are \"hard numbers\" but I do think the general ranking of the cores in area are fairly accurate. **The cores have the following configs:** |Core|Cache Hierarchy (fastest to LLC)|Total Cache Capacity in a 4x CCX| |:-|:-|:-| |Intel Lion Cove ARL|48KB L0 + 192KB L1 + 3MB L2 + 3MB L3|24.96 MB| |Qcom Oryon V2L|192KB L1 + 24MB SL2|24.768 MB| |Xiaomi X925|64KB L1 + 2MB L2 + 4 MB L3|24.256 MB| |Intel Lion Cove LNL|48KB L0 + 192KB L1 + 2.5MB L2 + 3MB L3|22.96 MB| |Mediatek X925|64 KB L1 + 2MB L2 + 3MB L3|20.256 MB| |Apple M4 P-core|128KB L1 + 16MB SL2|16.512 MB| |Apple M3 P-core|128KB L1 + 16MB SL2|16.512 MB| |AMD Zen 5C|48KB L1 + 1MB L2 + 2MB L3|12.192 MB| |Intel Skymont|32KB L1 + 4MB SL2 + 4MB CL3|8.128 MB| The total cache capacity is a bit of a meme since it doesn't include latency, but I do think some interesting things can be noticed regardless. **Performance** Specint, Cinebench 2024 is from Geekerwan, Skymont ARL and LNL is from the 265K and 258V from Huang GB6 is from the Geekbench browser website |Core|Specint2017|GB6|Cinebench 2024| |:-|:-|:-|:-| |Apple M4 P-Core|132|148|124| |Intel LNC ARL|120|129|100| |Apple M3 P-core|113|118|99| |Qcom Oryon V2L|100|108|\\-| |Xiaomi X925|100|104|\\-| |Mediatek X925|100|100|\\-| |Intel LNC LNL|95|111|81| |Intel Skymont ARL|92|\\-|\\-| The difference between form factors: **Mobile to Laptop (Geekbench 6 scores)** From the Geekbench browser website |Core|Laptop|Ipad|Mobile| |:-|:-|:-|:-| |Apple M4 P-core|113|107|100| |Apple M3 P-core|108|\\-|100| **Laptop to Desktop (Geekbench 6 scores)** From Notebookcheck (averages used for mobile platforms) |Core|Desktop|Mobile| |:-|:-|:-| |LNC ARL|115|100| |Zen 5|119|100| **IPC differences in SpecInt2017 between form factors** David Huang |Core|Form Factor|Difference| |:-|:-|:-| |Zen 4|Desktop vs Mobile|13%| |Zen 5|Desktop vs Mobile|12%| While I do believe that the P-cores from AMD and Intel have to be designed to take advantage of the higher power budget that larger form factors afford, I also think that placing the mobile cores into those same form factors will also lead to an, at least, marginal perf improvement. **Zen 5C performance question marks** In the previous dense server core product, the Fmax of the server sku was dramatically lower than what the core could achieve in other products. |Core|Server|Mobile|OC'd| |:-|:-|:-|:-| |Zen 4 Dense|3.1GHz|3.7GHz|\\~4GHz| |Zen 5 Dense|3.7GHz|\\-|\\-| This may be the case for Zen5C as well. **Power** Perf/watt curves (in Geekerwans videos) are the only way to get a full picture of power, but as a generalization: Both the Apple M4 and M3 P-cores (as well as their implementation in the iphones) have better perf/watt than the X925 and Oryon-L. The *best* case for Intel's P-core is that its perf/watt is as good as the X925 and Oryon-L. I think it is likely much, much worse. According to Geekerwan, at a package power of \\~5 watts, the M3 performs \\~40% better than LNL. At around \\~7-8 watts, the M4 performs closer to \\~50% better. Meanwhile we have David Huang showing that a M4 Pro at \\~3.7 watts per core scoring \\~33% better than a 9950x, and the 9950x has an outright better curve than the 265K LNC. The gap is no where near as large compared to Apple's cores and the other ARM cores in the mobile space. Power is, IMO, by far the hardest to really quantify, because one has to deal with how to measure \"core only power\" while trying to isolate the power of the rest of the SOC. Then there's also the problem of software measurements vs hardware measurements... I imagine only engineers at their respective companies would really know the power draw of a specific core. **Core Overview** Apple seems to have the best N3 cores in both perf and power. The **M4's P-core** is pretty large by any standard, however it saves a bit of area due to it's cache hierarchy, making a hypothetical 4x CCX not that large. The shared L2 cache really only seems to be present in client mobile systems though so far, and I think it presents its own challenges in server. All the chips that use this hierarchy (Qcomm and Apple) both have very high mem bandwidth per core, which could be an issue scaling it up to server. The cache-per-core capacity, when all the cores are running and competing for the shared cache, would be lower than the competition. The **M3's and ARL's P-cores** have pretty much the same perf, and similar area, however the M3 P-core is almost certainly dramatically more power efficient than a LNC P-core. Additionally, in terms of CCX area, LNC ends up being way, way larger thanks to the different cache hierarchy. **Zen 5** dense is pretty interesting, as I really, really doubt it's Fmax only goes up to 3.7GHz. Performance is an unknown, as is power, however from purely an area perspective, it seems pretty comparable to the ARM P-cores. Meaning to get comparable performance to those cores, Zen 5C would have to have an Fmax of \\~4.7GHz, a 30% boost from what it clocks in server parts. Which... I mean isn't extremely unexpected ig considering that a similar percent boost was seen with Zen 4 dense in server and OC'd Zen 4, however it still seems pretty hard to believe. To be fair to the x86 cores though, they have 256/512 bit vector width, unlike the ARM cores listed only having 128 bit vector width. This does really seem to cost a decent bit of area, especially for Zen 5. AFAIK, Zen5C in server has the full Zen 5 AVX-512 implementation, and we have already seen how much area can be shaved off Zen 5 from just choosing not to go for the full AVX-512 implementation: |Core|Core| |:-|:-| |Zen 5 DT (N4P)|4.46 (+12%)| |Zen 5 MBL (N4P)|3.99| **Qualcomm's custom cores** honestly don't seem like they afford any sort of distinct advantage over ARM's stock cores on N3 (being implemented by different companies). Perhaps I am missing something, but there seems to be no meaningful area advantage (even considering the larger cache capacity), and no meaningful performance or power advantage. I also think Qualcomm's cache hierarchy transferring over to server, unchanged, would be pretty unique in the server space, seeing how no other major or even relatively smaller companies seem to be offering that sort of setup in servers. Maybe Qualcomm's P-cores would scale up at higher power better than ARM's cores in a laptop/desktop form factor? It is interesting to see Qualcomm choosing to presumably sacrifice IPC for greater clocks vs the stock ARM cores, perhaps they think perf at even more power would be greater, or maybe Vmin is lower? It's wild to see Mediatek's **X925** both end up being larger and slower than Xiaomi's implementation. No idea why or how. In terms of the comparison to the rest of the cores though, they aren't nearly as powerful as the rest of the P-cores, but they are also a decent bit smaller than the other P-cores as well. The lower performance may as well be due to the fact that they are all in a phone form factor, so it might be pretty interesting to see how the X925 in Nvidia's upcoming DG10 chip performs.",
        "comments": [
            {
                "raw_content": "Just and FYI, IP and structure sizing within die, for latest gen SKUs tend to be rather confidential data. So you should take the area data with a huge grain of salt, as the error will be tremendous. Usually the only data we can sort of be confident about is total SoC power consumption (ant that is only if the reviewer/study had the equipment to isolate socket power, for example. otherwise re vert to full system power data, which may include DDR, UFS/SSD, Display, etc) and performance data reported from benchmarks.",
                "author": "xternocleidomastoide"
            },
            {
                "raw_content": "Credit to [this post](https://www.reddit.com/r/hardware/comments/1gvo28c/latest_arm_cpu_cores_compared_performanceperarea/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) for the idea, die shots measurements are found by pixel peeping from Kurnal's die shots on his twitter, the Geekerwan video for the perf/watt curves for all the ARM chips are [here](https://www.youtube.com/watch?v=cB510ZeFe8w&t=664s), numbers from David Huang are from [here](https://blog.hjc.im/spec-cpu-2017) and his twitter. Metal Layer and lib type are from Techinsights (non paywalled).",
                "author": "Geddagod"
            },
            {
                "raw_content": "Your calculations are wrong for the \"4c CCX\" config area size for QC. their logic is that the L2 is shared up to 6 cores in a single CCX like structure, so they have 12MB for 2 cores on the 8 Elite, but on the X Elite it's going to 6 cores sharing those 12MB. X Elite Gen 2 for example it's 3x 12MB L2s, each for 1 CCX, each with 6 cores. 1 of those CCX is with Oryon M and not L",
                "author": "DerpSenpai"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Gaming Laptops are in Trouble - VRAM Testing w/ ‪@Hardwareunboxed‬",
        "score": 59,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It is a crime that 70 tier laptop chips are coming with 8GB. Gaming laptops with an adequate amount of VRAM are very expensive, you have to go for a 5070Ti at a minimum. A 4080 laptop is almost certainly a better buy right now, there's still some for sale with good discounts.",
                "author": "shugthedug3"
            },
            {
                "raw_content": "For laptops, it seems like you either go with \"budget\" options like xx60 tier cards and accept you're gonna sacrifice some visuals or just go all out with some top of line models for adequate vram. xx70 class laptops are not worth it over xx60 imo.",
                "author": "Salty_Tonight8521"
            },
            {
                "raw_content": "8GB 5070 Laptop at 115W vs 16GB 5060 Ti Desktop at ~140W 8GB VRAM is butchering performance in some modern titles at totally playable settings. And those \"midrange\" laptops are already north of $2500. If you can't afford more than 8GB VRAM laptop you'll probably have to upgrade sooner. (I would advice going for the cheapest 8GB VRAM laptop you can find if it's going to be replaced quickly)",
                "author": "kyp-d"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Silicon Motion: None of Our Controllers Affected by the Windows 11 Bug",
        "score": 79,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">In a statement to TechPowerUp, Silicon Motion says that thus far, none of its SSD controllers are affected by the Windows 11 update bug. \"Regarding the Windows 11 update issue: so far, none of the SMI controllers have experienced such a problem,\" the company said.",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "Does anyone know what the actual issue is? Something to do with power management?",
                "author": "Constellation16"
            },
            {
                "raw_content": "Only Phison controllers are affected? do we know more about the technical reason for the fault? The article is short on details",
                "author": "SyzygeticHarmony"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Amazon Joins AMD to Back South Korean AI Startup Upstage",
        "score": 23,
        "text_content": "",
        "comments": [
            {
                "raw_content": "FYI: Upstage was chosen by the Korean government's top 5 list of AI LLM startups that will receive astronomical financial backing to produce frontier AI models. That list will be reduced to top 2 and Upstage and their Solar model is a strong contender alongside LG AI (Exaone) Samsung wasn't even shortlisted in the top 15 btw.",
                "author": "self-fix"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "NVIDIA: \"Inside NVIDIA Blackwell Ultra: The Chip Powering the AI Factory Era\"",
        "score": 8,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Borderlands 4 with Performance Issues on Nintendo Switch 2",
        "score": 815,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Man all the shitty 3rd party stuff for S2 these last few days is really bumming me out. For years the question was always \"how will it run on Switch?\" And I was so hoping that the Switch 2 would allow that question to be asked a hell of a lot less. Guess we ain't there yet.",
                "author": "kaydeejay1995"
            },
            {
                "raw_content": "Lmfao it's hilarious and ironic how it has come full circle. When Cyberpunk first released it was an unoptimized mess on pretty much every single console. Now it runs perfectly on pretty much every console and now everybody is using it as a prime example of what the switch is capable of. But it truly does beg the question why does cyberpunk run so smoothly on switch but these other \"Next Gen\" 3rd party games look and run like dog water??",
                "author": "TDAJ5"
            },
            {
                "raw_content": "Honestly wasn't expecting much from this considering they still haven't gotten around to fixing Borderlands 3 yet for the Switch 2.",
                "author": "StockHumor4768"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Ongoing coverage of GamesCom by Nintendo YouTubers",
        "score": 452,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's definitely nice to see FF7 being a smooth, clean looking port, but it's a totally different beast to Elden Ring. It ran relatively smoothly on PS4 and lagged in later segments of the game there, while Elden Ring drops frames on every platform. It was From's first attempt at open world and they didn't stick the landing technologically speaking. It's possible FF7 will also chug in later segments on Switch 2. We'll need to wait for both games to actually release before passing judgement imo.",
                "author": "nftesenutz"
            },
            {
                "raw_content": "FromSoft Game Reviews Be Like: “This game is incredibly unoptimized and runs like garbage. 10/10 best game ever made”",
                "author": "BulkDarthDan"
            },
            {
                "raw_content": "FF7R has the whole Square Enix quality assurance and attention to detail behind it, probably had a separate team doing optimalization alone. FromSoft is way smaller and doesn't really focus on those aspects. Just look at how those games run on PC. One of the worst ports I have ever seen.",
                "author": "Murky_Structure_7208"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "So according to Nintendo Life Final Fantasy 7 remake actually runs at 40fps",
        "score": 200,
        "text_content": "Unless the staff was uninformed or straight up lying for some reason which i really doubt of course this is really good news. 30fps is fine for some games, like yea stuff like borderlands 4 and hogwarts legacy capping at 30fps is disappointing. But considering it's relatively low price compares to other handhelds and the fact that it's well, a handheld, i think it's ok as long as frame drops arent too common. Just happy switch 2 seems to run a ton of current games. 40fps performances modes would be ideal like with apparently this and cyberpunk if the game is wayy too demanding for 60fps but unfortunately most ports yet don't have settings like those. And yea 60fps seems almost impossible for any recently released AAA particularly the super ambitious open world ones which is fair enough. But hopefully some smaller games will have it, a few of them like street fighter 6 and Shadow gens with the performance mode",
        "comments": [
            {
                "raw_content": "Event staff at these events often have no idea what’s going on fwiw.",
                "author": "terran1212"
            },
            {
                "raw_content": "Hoping 40FPS will be normalized on Switch 2 for AAA games. Playing games like FF14 and the dragon engine Yakuza games on my Steam Deck, at 40FPS was like the right balance between performance, visual fiuldity, and battery life.",
                "author": "Animegamingnerd"
            },
            {
                "raw_content": "The jump from 30 to 40 really is noticeable",
                "author": "big_bear07"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "All of Digital Eclipse's compilations seem to be 1080p on Switch 2 in handheld",
        "score": 38,
        "text_content": "I have a lot of Digital Eclipse compilations and they all seem to run at 1080p on Switch 2 in handheld. I've tested: * Atari 50 * Tetris Forever * Llamasoft: the Jeff Minter Story * TMNT: the Cowabunga Collection * Mega Man Legacy Collection * Street Fighter 30th Anniversary Collection * SNK 40th Anniversary Collection * The Making of Karateka Note that they did not make Mega Man Legacy Collection 2, but it does seem to also be 1080p.",
        "comments": [
            {
                "raw_content": "Stardew Valley also in 1080p. We should make a compilation of unpatched games with unlocked resolution.",
                "author": "duragonn98"
            },
            {
                "raw_content": "Essentially this is because the games were still trying to render at 1080p in handheld and the system was downscaling it. This resulted in worse performance for the games on Switch 1 but allowed for these seamless upgrades for Switch 2.",
                "author": "Zyvyn"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Finished DK Bananza! What an incredible game! Some thoughts. [NO SPOILERS]",
        "score": 94,
        "text_content": "The post is spoiler free. I finally completed DK Bananza today. It was not 100% but close to 90%. Sufficient to experience the game completely, including the post-game in full. It took 50 hours in total. The game is one of the most incredible experiences that I have ever had. This is once again Nintendo at its finest. I am so glad that Super Mario Odyssey team tried to do something different and they truly delivered a masterpiece. The end game is a true delight. One of the greatest final levels ever done in a 3D game by Nintendo, and some of the greatest twists that you cannot see coming. I feel truly sorry for those for whom this game was spoiled. To experience the end game without being spoiled was one of the major highlights for me. It was shocking and delightful at the same time, on multiple occasions. The game was not easy. At the end it was quite challenging, and you need to play truly smart. Nintendo outdid themselves in the endgame and created a truly difficult final level and boss fight after a long time. It was truly satisfying to finish the game. The game is different. Really different from normal platformers. Personally, I enjoy run and jump type platformers more, and would rate Odyssey higher than Bananza. It took a little bit of time before this game clicked for me, but once it clicked there was no going back. It is one of the finest games ever made by Nintendo. It was such a pleasure to experience it. I cried at the end. The ending was so beautiful that crying was natural. It was worth it! Thank you Nintendo for creating this masterpiece.",
        "comments": [
            {
                "raw_content": "Honestly one of my favorite platformers ever! Up there with Banjo Kazooie/Mario Galaxy all time.",
                "author": "PaleFondant2488"
            },
            {
                "raw_content": "I'm at the after end game right now and I'm really liking it, it seems a DLC of the game due the after end game \"continue\" the main story > It took a little bit of time before this game clicked for me, but once it clicked there was no going back. 100% agree, the first level is used to let the players learn the DK's smash ability but after in the next levels you learn it you have a lot of fun by destroying almost everything Thank you Nintendo for this masterpiece from me too",
                "author": "echoess84"
            },
            {
                "raw_content": "Im still struggling to get into it. Im maybe 2 -3 hours into it. Can't play 15 - 20 mins without getting bored. Everything just seems so chaotic and with lack of purpose, especially the bashing of terrain. Im like, why did i just bash that entire area, it didn't progress the game and all the \"stuff\" i gathered doesn't seems to be of any use.",
                "author": "JesusElSuperstar"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Looking to hear from people who’ve played hollow knight on their switch 2",
        "score": 25,
        "text_content": "In all the posts I could find (only a couple), most people were saying hollow knight looks somewhat blurry on the switch 2. Since we’re getting silksong in a couple weeks, I wanted to try and play though hollow knight - as long as the issues it has on switch 2 aren’t debilitating/detrimental to the experience in general. To my knowledge, the game has not received a switch 2 upgrade/update. I would play it on my OLED if I still had it, but I sold it back in April to prepare for the switch 2 launch.",
        "comments": [
            {
                "raw_content": "It's seriously fine. If you're feeling the draw to play it right now then you absolutely should. It's a wonderful game, and it's nothing more than marginally suboptimal on Switch 2. Enjoy it! Hopefully Silksong measures up to HK's very high bar",
                "author": "Versucher42"
            },
            {
                "raw_content": "Like most unpatched switch 1 games it is a little blurry on the switch 2, but it's more than playable",
                "author": "volcano_slayer9"
            },
            {
                "raw_content": "It's ok, the scaling issues are not something most people will notice except maybe with text.",
                "author": "QuinSanguine"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Switch 2 will support Polish this year! Games in Polish coming not too long later",
        "score": 7,
        "text_content": "A reputable Polish game journalist YouTuber - Michał Pisarski created a short directly from Gamesom saying that according to multiple sources there Switch 2 will get a Polish menu and Nintendo will start releasing games in Polish not too long later! That's a huge win for the dedicated Polish community! It took Nintendo only 20 years longer than Microsoft and Playstation to do it! With Nintendo advertising Switch 1 for many years in Poland it was bizarre that it took them so, so long since Poland has 35 million population and a rapidly growing economy. More population than Portugal and The Netherlands (both have their language versions) combined with GDP Per capita similar to Portugal. The source: https://youtube.com/shorts/MKhB4kPnS0w?si=SAcLuNt7c8i3PXWR",
        "comments": [
            {
                "raw_content": "Finally this console will be popular in Poland!!!",
                "author": "Short-Piano-1319"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Which switch games did you play the most",
        "score": 10,
        "text_content": "I bought an NS2 on launch, and it is my first Nintendo console since the DSI. I skipped the switch 1 generation of games. That being said, I've played quite a few games so far, those being Mario Odyssey, DK Bananza, DK Tropical Freeze, Mario Wonder, etc. These games were really good; however, I'm not really the kind of player to go back and try and 100% games or anything like that. I am looking for some inspiration on what game to play next, and I was hoping for it to be a game I can play dozens to hundreds of hours on. So, what switch games have had the most hours on your system, or which games do you recommend I buy?",
        "comments": [
            {
                "raw_content": "Zelda BOTW and TOTK. Combined for a few hundred hours of game time for me.",
                "author": "Steamdecker"
            },
            {
                "raw_content": "Just completed Persona 5 Royal at 130hrs",
                "author": "NoRedditorOnlyZuul"
            },
            {
                "raw_content": "Animal Crossing New Horizon. Played it practically every day since release. I sunk a lot of hours into the Xenoblade Chronicles games too. As well as Vampire Survivors, the two 3D Zelda games and Splatoon 3.",
                "author": "andthegeekshall"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Battlefield 6 Phantom Edition and other skins leak (and no goofy-looking ones!)",
        "score": 220,
        "text_content": "Source: [https://mp1st.com/news/battlefield-6-phantom-edition-other-skins-unearthed-grounded-look](https://mp1st.com/news/battlefield-6-phantom-edition-other-skins-unearthed-grounded-look) Phantom Edition skins look alright. The other ones are pretty cut and dry. Maybe the most COD-lookig one is the one with the masks? But even that isn't bordering on stupid. Really hope EA doesn't interfere and put Madden-themed soldier skins or whatever.",
        "comments": [
            {
                "raw_content": "well let´s see what the situation is come season 3 or 4. remember how it started in MW2019. It was a slow, but steady development until we reached the madness of BO6. People were actually complaining that MW2019s mastery camos and stuff weren´t flashy enough.",
                "author": "Phil_Montana_91"
            },
            {
                "raw_content": "The uncomfortable truth that people don’t want to consider is the fact that the average consumer just does not buy military-style skins. It’s why cod continues to do goofy ass skins. I’ll sum up how the average consumer thinks about these skins: “Oh a military skin…but I’m already a military guy. Why would I spend another $20 on a skin that looks so similar to my current one? VS “Wait…I can be Peter Griffin?!? That’s the goofiest shit I’ve ever seen, I’ve got to kill people as him to annoy them ahahaha”",
                "author": "Dull-Caterpillar3153"
            },
            {
                "raw_content": "No joke, I so want the classic Battlefield classes as skins.",
                "author": "Lotus_630"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Trump says the US is taking a 10 percent stake in Intel",
        "score": 181,
        "text_content": "",
        "comments": [
            {
                "raw_content": "President Donald Trump has confirmed that the US will take a 10 percent stake in Intel. During a press conference on Friday, Trump said Intel CEO Lip-Bu Tan agreed to give the government the stake, which is valued at around $10 billion. Earlier this month, Trump called on Tan to resign over his ties to China, and today he positioned the deal as a way for the executive to “keep his job.” Trump told reporters that he floated the offer during negotiations with Tan. “I said, ‘I think it would be good having the United States as your partner,’” Trump said. “They’ve agreed to do it, and I think it’s a great deal for them.” The confirmation of the deal comes just days after SoftBank announced plans to invest $2 billion into Intel to “further expand” chipmaking in the US. Trump is expected to formally announce the agreement with Intel later today. Read more: [https://www.theverge.com/news/764480/intel-donald-trump-lip-bu-tan-deal](https://www.theverge.com/news/764480/intel-donald-trump-lip-bu-tan-deal)",
                "author": "theverge"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "AOOSTAR Ryzen 9 9955HX3D MoTD Motherboard Unleashes Zen 5 CPU Performance on Desktop",
        "score": 114,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Happy to see more of this in the market. However, I do wish they would put out a Mini-ITX like the Minisforum.",
                "author": "0riginal-Syn"
            },
            {
                "raw_content": "I tried to look up information about it, it seems to be a 9950X3D just with lower clocks. So is the appeal that it is cheaper than buying separate Motherboard and 9950X3D, or am I missing something like it having a better memory controller or something?",
                "author": "Themash360"
            },
            {
                "raw_content": "TIL MoTD means mobile on desktop :-) > The 9955HX3D MoTD combo sells for about $50 less than the desktop Ryzen 9 9950X3D CPU by itself for context. The standard 9955HX version for $100 less has specs virtually identical to the desktop 9950X, making these very attractive considerations for performance-based builds.",
                "author": "WarEagleGo"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Minisforum MS-S1 MAX to feature Ryzen AI MAX+ 395 up to 160W and USB4 V2",
        "score": 43,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Dual 10g and dual 80g usb 4????? This thing is going to be hyper expensive. But it’s gunna be sick. I have a gmk version and gaming performance is shockingly good, even at 1800p. My only real complaint is driver support is really bad. AI doesn’t use the npu and rocm is slower than Vulcan in most cases. On top of that, games have issues. Doom dark ages and tony hawk 3/4 weren’t playable for me at all. I had a bunch of crashes. On the other hand…bazzite performance was crazy good. Some games like selaco were a good 30% faster on bazzite.",
                "author": "sittingmongoose"
            },
            {
                "raw_content": "is there anything that uses 80gbps USB?",
                "author": "get_homebrewed"
            },
            {
                "raw_content": "Why must they all use bloody blower fans? How about a low profile cooler with a regular 120mm fan and a 8mm fan on the rear end of the case as an exhaust?",
                "author": "Worldly-Ingenuity843"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "ASRock Confirms RX 9070 XT Taichi White LCD will remain a concept, not a retail product",
        "score": 47,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Asrock should really prioritize fixing their motherboards. To this day people on the asrock sub have people reporting that their cpus are still dying on the latest bios revision.",
                "author": "averjay"
            },
            {
                "raw_content": "big if true",
                "author": "Niwrats"
            },
            {
                "raw_content": "Tell them to keep their concepts to themselves...",
                "author": "Doom2pro"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "When will the housing market crash again?",
        "score": 62,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Right after I buy a house, as is tradition.",
                "author": "These-Bedroom-5694"
            },
            {
                "raw_content": "My area is having a lot of price reductions but I can't tell you if it s because properties are coming down or simply because listings were obviously overpriced.",
                "author": "Strange-Tension6589"
            },
            {
                "raw_content": "I do not know. But I will say, American loans are backed for 30 years. Other countries do not do that. There is much more expensive real estate markets across the world. There very easily could be a crash, but things could also get worse, inflation could grow, dollar could be devalued.",
                "author": "thomasrat1"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Powell Sends Strongest Signal Yet That Interest Rate Cuts Are Coming",
        "score": 127,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Did inflation go down?",
                "author": "homebrew_1"
            },
            {
                "raw_content": "So tech vc money goes higher",
                "author": "Van-van"
            },
            {
                "raw_content": "Dunno why the markets think it's such great news If the fed believes rate cuts are needed after only 2-3 years of hikes to average levels (and 15 years of near 0/super low prior) that's not a good sign IMO But I'm just some regarded guy that knows nothing The roaring 20's all over again",
                "author": "Commercial_Soft6833"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage rates hit year-to-date lows after Powell comments",
        "score": 64,
        "text_content": "",
        "comments": [
            {
                "raw_content": "[https://fred.stlouisfed.org/series/MORTGAGE30US](https://fred.stlouisfed.org/series/MORTGAGE30US)",
                "author": "tigger19687"
            },
            {
                "raw_content": "10Y is at lows not seen since the beginning of July, lol",
                "author": "NRG1975"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Buyers bail on record number of purchases",
        "score": 63,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’m an appraiser and anecdotally I’ve noticed this. Might get 1 or 2 cancellations a month. Had 3 this week. On the 3rd, I asked the lender what was going on and they said they have had a ton of cancellations. He said he processed 5 cancellations that day (this was on Wednesday) when that’s how many he would do in a week",
                "author": "rastadreadj"
            },
            {
                "raw_content": "Fed is teasing September rate cuts. They probably won't due to the inflation from terrifs. It's the dream of rate cuts next month that is causing cold feet.",
                "author": "These-Bedroom-5694"
            },
            {
                "raw_content": "Why would anyone close on a house while the fed teases rate cuts? You'd have to be brain dead.",
                "author": "FistsFullofSteal1"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Dow Hits New Record After Powell's Jackson Hole Speech",
        "score": 120,
        "text_content": "Rate cuts on the menu- I know the bond vigilantes will likely increase mortgage rates but we’ll see what happens.",
        "comments": [
            {
                "raw_content": "so much irrational exuberance over the possibility of maybe getting a -.25% rate cut that won't even impact mortgage rates in any meaningful way lol.",
                "author": "HormoneDemon"
            },
            {
                "raw_content": "I still don’t understand why stocks would go up, a rate decrease would indicate a market weakness",
                "author": "Mustangfast85"
            },
            {
                "raw_content": "*Powell farts* dow hit new highs!!!!",
                "author": "adrian123456879"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Google keeps cooking.",
        "score": 639,
        "text_content": "",
        "comments": [
            {
                "raw_content": "All I need is Gemini 3.",
                "author": "Friendly_Willingness"
            },
            {
                "raw_content": "*tips black fedora*",
                "author": "ClickF0rDick"
            },
            {
                "raw_content": "Anyone who thought Google wasn't coming in like a wrecking ball, forgot that they have been playing the AI game the longest behind closed doors.",
                "author": "Busterlimes"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "They nailed it, per usual.",
        "score": 620,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I think the gpt pop sound was made with a mouth",
                "author": "Distinct-Question-16"
            },
            {
                "raw_content": "Imagine he opens Ani instead 😆",
                "author": "ezjakes"
            },
            {
                "raw_content": "This is so great",
                "author": "superdariom"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "an ex-Meta employee summed it up nicely",
        "score": 685,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So much money spent and they are so far behind.",
                "author": "Delicious-Finding-97"
            },
            {
                "raw_content": "![gif](giphy|opP9JMYfG9a1y)",
                "author": "Dizzy-Ease4193"
            },
            {
                "raw_content": "Didn't Meta have a video gen with audio BEFORE anyone else and long before veo3? What happened to all that?",
                "author": "InvestigatorHefty799"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "If Demis is watching..",
        "score": 722,
        "text_content": "",
        "comments": [
            {
                "raw_content": "15 days actually, my mistake, but the meme still stands !",
                "author": "Middle_Cod_6011"
            },
            {
                "raw_content": "Don’t interrupt your enemies when they’re making a mistake or whatever",
                "author": "Tennis-Affectionate"
            },
            {
                "raw_content": "GPT 5 High is sorta insane I can’t lie. Better than Sonnet for my use.",
                "author": "Solid_Anxiety8176"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Founder of Google's Generative AI Team Says Don't Even Bother Getting a Law or Medical Degree, Because AI's Going to Destroy Both Those Careers Before You Can Even Graduate",
        "score": 962,
        "text_content": "\"Either get into something niche like AI for biology... or just don't get into anything at all.\"",
        "comments": [
            {
                "raw_content": "Should we just die",
                "author": "_bold_and_brash"
            },
            {
                "raw_content": "Law degree, maybe I get his argument because the field is already pretty saturated so any pressure from AI is going to quickly eat up entry-level opportunities, but we have a severe shortage of doctors right now. The regulatory hurdles alone will stop AI from replacing human doctors for quite some time, and I think it is borderline dangerous to tell people not to become doctors given the ballooning population of elderly people.",
                "author": "Cryptizard"
            },
            {
                "raw_content": "Damn these AI leaders really are huffing their own farts now. Of course AI is going to radically change the world, but the idea that it’s going to replace doctors anytime soon is laughable. Of course doctors will be using more and more AI, but hospitals are pretty risk averse and slow to adapt, so it’ll be a minute. They really want us all to just skip college and be braindead consumers in a world where they control not just the means of production but also all intelligence.",
                "author": "seekfitness"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Announcement:",
        "score": 119,
        "text_content": "",
        "comments": [
            {
                "raw_content": "(It's Veo3 fast) Sources: [https://x.com/GeminiApp/status/1959035394483503581](https://x.com/GeminiApp/status/1959035394483503581) [https://xcancel.com/GeminiApp/status/1959035394483503581](https://xcancel.com/GeminiApp/status/1959035394483503581) **Try it yourself**: [http://gemini.google.com/veo](http://gemini.google.com/veo) 1 Test: [https://g.co/gemini/share/97e5c1d53ccf](https://g.co/gemini/share/97e5c1d53ccf) The audio quality leaves a little to be desired but otherwise it's quite good.",
                "author": "GraceToSentience"
            },
            {
                "raw_content": "The video I generated on flash didn’t have audio 😭",
                "author": "Crafty_Escape9320"
            },
            {
                "raw_content": "Meh",
                "author": "Dizzy-Ease4193"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Boris Power, Head of Applied Research at OAI, has announced their custom model has designed improved variants of Yamanaka proteins with a 50x increase in reprogramming efficiency and enhanced DNA damage repair capabilities",
        "score": 341,
        "text_content": "",
        "comments": [
            {
                "raw_content": "can someone explain this in plain English please? What's the significance? (I'm a brainlet)",
                "author": "borntosneed123456"
            },
            {
                "raw_content": "Noam Brown tweeted >This result was achieved several months ago, with a non-reasoning mini model. Our latest models are much more capable and general. I suspect we'll see many more results like this over the next year or so. So hopefully there's a lot of headroom for relatively easy gains over the next few years.",
                "author": "deleafir"
            },
            {
                "raw_content": "Guys the future companies are forming. Definitely “Alien Earth” vibes.",
                "author": "Worldly_Evidence9113"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "First method to achieve 99.9% on AIME 2025 with open-source models!",
        "score": 60,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">[Deep Think with Confidence](https://jiaweizzhao.github.io/deepconf)",
                "author": "SteppenAxolotl"
            },
            {
                "raw_content": "Is this verified?",
                "author": "FarrisAT"
            },
            {
                "raw_content": "very cool!",
                "author": "One-Construction6303"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Robot: \"What is my purpose?\" Me: \"You wok chicken.\" Robot: \"Oh my god.\"",
        "score": 97,
        "text_content": "\"Chicken and rice... again? Oh sure, let me cancel my plans for lobster thermidor and soufflé. My circuits were just dying for déjà vu cuisine.\"",
        "comments": [
            {
                "raw_content": "why does that look so funny to me",
                "author": "Jabulon"
            },
            {
                "raw_content": "Honestly better than me",
                "author": "pentacontagon"
            },
            {
                "raw_content": "You: I'll have a ermm... chicken Squidward: How Original You: With Rice Squidward: Daring today aren't we",
                "author": "SharpCartographer831"
            }
        ],
        "subreddit": "singularity"
    }
]