[
    {
        "post_name": "Mark Mitchell, head pollster at Rasmussen Reports: My mom's dying of vaccine cancer this week ... Can Republicans cut the performative BS please?",
        "score": 458,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"Best we can do is let illegals stay.\" Rand Paul :p",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "Rand Paul is the last person I’d expect to do anything besides obstruct Trumps policies. He’s the gayer version of do nothing Trey Gowdy",
                "author": "COnDEMnED"
            },
            {
                "raw_content": "Said a prayer for his Mom, hope she pulls through.",
                "author": "MSG1000"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Why are names like this being redacted?",
        "score": 466,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ask Pam Bondi, Blanche and Co. who are breaking the law ... *STILL!!!* ... and not releasing/unredacting all documents for the public to see. Once again ... they're blatantly breaking the fucking law ... the Trump administration. 🤓",
                "author": "drmrboy"
            },
            {
                "raw_content": "This redaction is protecting the perpetrator, not protecting the victim.",
                "author": "Scatter-Shot"
            },
            {
                "raw_content": "https://x.com/i/status/2018829335084593406",
                "author": "SALTYinSeattle"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Two animals who kidnapped, a woman at an Oklahoma casino repeatedly raped and sodomized her. The animals were identified as 35-year-old Luis Miguel Dominguez and 24-year-old Jose Fernandez-Lux Morales, both now on ICE detainers. These are the animals that Democrats are organizing and funding...",
        "score": 379,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\" we should not judge their cultural norms, they might have been confused on our laws\" - probably some libtard",
                "author": "FLIBS"
            },
            {
                "raw_content": "Last week Governor Stitt of OK said on CNN do we really need to remove every \"non-citizen\" out of the country? HELL YES GOVERNOR, HELL YES WE DO!!!!! He will hearing from me tomorrow.",
                "author": "Jimboslice73"
            },
            {
                "raw_content": "Show libtards shit like this when the whine about ICE, \"Being mean...\"",
                "author": "patrioticwinning3"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Imam Texas: \"Mamdani is victory. We didn't succeed to conquer Vienna by the sword for 200 years and now it's 10% Muslims. We need to enlarge the Muslim population in America.\" Same modality they use in Europe.",
        "score": 336,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Start by deporting every muslim in American politics - Abdelnasser Rashid - Illinois House of Representatives from the 21st district - Abdullah Hammoud - Mayor of Dearborn, Michigan - Aboul Khan - New Hampshire House of Representatives from the Rockingham 20th district - Aisha Wahab - California State Senate from the 10th district - Al Abdelaziz - New Jersey General Assembly from the 35th district - Ambureen Rana - Maine House of Representatives from the 21st district - Amer Ghalib - Mayor of Hamtramck, Michigan - Amir Ali - United States district Judge of the United States District Court for the District of Columbia - Amir Omar - Mayor of Richardson, Dallas Texas - André Carson - Indiana's 7th congressional district - Anquam Mahamoud - Minnesota House of Representatives from the 62B district - Atoosa Reaser - Virginia House of Delegates from the 27th District - Deqa Dhalac - Maine House of Representatives from the 120th district - Fady Qaddoura - Indiana State Senate from the 30th district - Faizul Kabir - Mayor of College Park, Maryland - Ghazala Hashmi - Virginia's Lt. Governor - Hanadi Nadeem - Nevada Assembly from the 34th district - Ilhan Omar - Minnesota's 5th congressional district - Iman Jodeh - Colorado State Senate from the 29th district - Keith Ellison - Minnesota Attorney General - Kayse Jama - Oregon's 24th Senate district - Lateefah Simon - California's 12th congressional district - Madinah Wilson-Anton - Delaware House of Representatives from the 26th district - Mana Abdi - Maine House of Representatives from the 95th district - Maryam Khan - Connecticut House of Representatives from the 5th district - Mo Baydoun - Mayor of Dearborn Heights, Michigan - Mohamud Noor - Minnesota House of Representatives from the 60B district - Munira Abdullahi - Ohio House of Representatives from the 9th district - Mustafa Taher Kasubhai - United States district Judge of the United States District Court for the District of Oregon - Mujtaba Mohammed - North Carolina Senate from the 38th district - Nabeela Syed - Illinois House of Representatives from the 51st district - Nabilah Islam Parkes - Georgia State Senate from the 7th district - Nadia Kahf - State Superior Court Judge in Passaic County, New Jersey - Nasif Majeed - North Carolina House of Representatives from the 99th district - Nusrat Jahan Choudhury - United States district Judge of the United States District Court for the Eastern District of New York - Omar Fateh - Minnesota Senate from the 62nd district - Osman Salahuddin - Washington House of Representatives from the 48th district - Rashida Tlaib - Michigan's 12th congressional district - Ruwa Romman - Georgia House of Representatives from the 97th district - Saddam Azlan Salim - Virginia Senate from the 37th district - Salman Bhojani - Texas House of Representatives from the 92nd district - Sam Rasoul - Virginia House of Delegates from the 38th district - Samakab Hussein - Minnesota House of Representatives from the 65A district - Shama Haider - New Jersey General Assembly from the 37th district - Suleman Lalani - Texas House of Representatives from the 76th district - Tarik Khan - Pennsylvania House of Representatives from the 194th district - Ted Green - Mayor of East Orange, New Jersey - Zahid Quraishi - United States district Judge of the United States District Court for the District of New Jersey - Zaynab Mohamed - Minnesota Senate from the 63rd district - Zohran Mamdani - Mayor of NYC",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "the mohamadan cult must be outlawed",
                "author": "perma-maga"
            },
            {
                "raw_content": "there is another...",
                "author": "Raetchel"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "JD Vance: “I find it INTERESTING the people constantly attacking our immigration policy completely IGNORE that m*rders went DOWN 20% in the United States of America in 2025!\"",
        "score": 1006,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is because democrats are extremely ignorant by nature and they are very gay. 😉",
                "author": "MythArcana"
            },
            {
                "raw_content": "Murders are at a one hundred year low, violent crime, including rape is way down, and you have \"the podcast bros\" saying, \"We need to keep *some* of the murders and rapist! I want muh cheap lawncare!\" I hope the Administration sees through the Bullshit and continues to DEPORT THEM ALL! The VAST MAJORITY OF AMERICANS WANT IT! Don't forget the families!",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "JD. Murders *were the point*. Of whypeepo.",
                "author": "barwhack"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING - DEI judge Kandice Pickett has released Steven Tyler Whitehead on bond after he killed Alabama high school cheerleader Kimber Mills at a party, where prosecutors say he opened fire on 40 to 50 teens, killing one and wounding others, including a victim shot 10 times.",
        "score": 856,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If I was her daddy, I'd find him.",
                "author": "TequilaWizard"
            },
            {
                "raw_content": "Why are we allowing this to happen?",
                "author": "MythArcana"
            },
            {
                "raw_content": "this country is so beyond fucked its not even funny. way too many scumbag judges , commie fucks , and terrorists all over the place without a care in the world never face any type of consequence makes me sick",
                "author": "Zarlino"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "No point in trying to calm them down, they're already as extreme and violent as it gets",
        "score": 1067,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They will never be calm...only eternally grievanced",
                "author": "MAGAguitar"
            },
            {
                "raw_content": "There’s a subtle, deeper meaning to this; The Left can be neither mollified nor further antagonized - they’re calling for blood - the President’s blood and those of us who will not prevaricate from his cause. All that remains is this - when are we going to understand, on a nationwide unified basis, that the United States and its radicalized Leftists can no longer coexist?",
                "author": "1MonkeyJr"
            },
            {
                "raw_content": "Love it.",
                "author": "Parhelion12"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Mitch McConnell (R-KY) has once again been HOSPITALIZED. McConnell has experience NUMEROUS medical episodes recently, freezing up, collapsing, and being unable to do his job.",
        "score": 993,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Diane Fienstien. They pushed her into the Senate in a wheelchair so she could vote. She died that very day. People mean nothing to them. Power is the only thing they care about.",
                "author": "SubmarineGuy"
            },
            {
                "raw_content": "pass SAVE and then you can croak",
                "author": "magaspif"
            },
            {
                "raw_content": "He needs to be deported",
                "author": "f_bastiat"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ICE confirms that they’ve arrested a New Orleans Police Department recruit who they say is an illegal alien from Cameroon with an active deportation order & no work authorization. He was illegally given a gun by New Orleans PD.",
        "score": 1588,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What should happen: Everyone involved in making this happen in the New Orleans Police Depeartment is fired and thrown in jail. What will happen: Crickets.",
                "author": "Dizzy77"
            },
            {
                "raw_content": "It's a crime for a company to hire illegal aliens to pick crops and stock shelves. What should happen to police departments who hire illegal aliens and give them a gun and badge?",
                "author": "Beat_to_Quarters"
            },
            {
                "raw_content": "Examples need to be set. There is an inordinate amount of paperwork tied to that gun. Charge whomever issued it to him with providing guns to criminals.",
                "author": "CLF3"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "👺Senator Richard Blumenthal (D-CT): Won’t Support More DHS Money Unless DHS Is Reimagined 🛠️",
        "score": 644,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Reimagined? Ok, now they can deport Democrats!!!",
                "author": "1776take2"
            },
            {
                "raw_content": "The real question is why the Republicans are siding with Da Nang Dick?",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "i.e. We need it to replace USAID somehow.",
                "author": "anon2309011"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "💃 After Impressive $1 Million Monday Box Office Haul, Amazon MGM Expanding ‘Melania’ into 200 More Theaters 💰",
        "score": 985,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A million on a monday. Impressive.",
                "author": "Datamancer"
            },
            {
                "raw_content": "Southern Cal checking in. Went today @ 1:30 with 60 people in the theater. Applause at the end!",
                "author": "CaliBlonde"
            },
            {
                "raw_content": "Melania is not popular Ok, a lot of people are going to see the movie but it hasn't made enough to pay for it's budget Ok, the movie has made enough to surpass it's budget but it's just a bad movie Ok, most agree it is a good movie but, um, oh screw it, release the, uh, we are running out of things",
                "author": "tpactionchasethevote"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "HIGH ENERGY: Please deport all the low-energy non-frens. Thank you.",
        "score": 800,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Deploy the nonfren booper 5000",
                "author": "DangerousAmerican76"
            },
            {
                "raw_content": "The kids on Roblox are raiding houses and pretending they're ICE. The kids will be alright.",
                "author": "donkeyKang"
            },
            {
                "raw_content": "Shills...black pills...concern trolls...",
                "author": "MAGAguitar"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "What would Jesus do?",
        "score": 756,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Jesus was the first to kick the banker jews out",
                "author": "laredditarmy"
            },
            {
                "raw_content": "He also told his followers to sell their cloak and buy a sword if they lacked one.",
                "author": "Konsaki"
            },
            {
                "raw_content": "Jesus said it’s time to sell your cloak and buy a sword…",
                "author": "Seventhson74"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Four charged w/ alleged fraud scheme that used 115 stolen identities to obtain millions in SNAP and PUA benefits across multiple states. Allegedly used SNAP cards to stock restaurant; wired proceeds to Venezuela and the Dominican Republic.",
        "score": 1250,
        "text_content": "",
        "comments": [
            {
                "raw_content": "To a large extent our immigrants today are nothing like our immigrants from yesteryear. My ancestors went right from Scandinavia to the farm, had children and never asked for or received anything from the government and served in various wars.",
                "author": "FORMERCHILDSTAR"
            },
            {
                "raw_content": "But I was told that Democrats wanted to flood us with illegal invaders because they’re hard working people!",
                "author": "seattlerunner"
            },
            {
                "raw_content": "I think it's more than 4, guys",
                "author": "jsphere256"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Stunning new statistics showcase the ongoing triumph of President Trump’s law-and-order agenda. Washington DC year-to-date homicides down 80%, robberies down 58%, burglaries down 28%, car thefts down 57%, and overall crime dropping 26%!",
        "score": 1173,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wow... If you actually police the streets, arrest and prosecute criminals... the crime goes down?! Mind - blown! 🤯",
                "author": "Taxation_Is_Rape"
            },
            {
                "raw_content": "Pending arrests for high profile pedo 1%'ers that broke the law including stealing elections = 0%",
                "author": "saltyviewer123"
            },
            {
                "raw_content": "Democrats outraged!",
                "author": "Sea_Still"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Bill's getting a jump on the narrative",
        "score": 1081,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It depends ‘on what the definition of on is.",
                "author": "Grindelwald"
            },
            {
                "raw_content": "\"That depends on what your definition of the word \"is\" is\" :p",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "At least two famous Bills are std ridden dirty old white men.",
                "author": "10gauge"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "👺 Rep. Jerry Nadler (D-NY) Slammed for Appearing to Suggest Citizens Justified In Shooting Masked ICE Agents 🧊",
        "score": 825,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Dang.. he got SLAMMED when nothing happened to him!",
                "author": "darkmodeforgotpass"
            },
            {
                "raw_content": "Fuck you Humpty Dumpty, you pants shitter.",
                "author": "CaptainWinston"
            },
            {
                "raw_content": "They tell you to shoot federal agents because they want federal agents shot.",
                "author": "infinitysupreme"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This is a political attack on X",
        "score": 1368,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Amazing how easy everone else seems to be able to conduct raids and arrests",
                "author": "Krat"
            },
            {
                "raw_content": "Funny that never happened when Jack Dorsey was running it as a propaganda arm of the deep state.",
                "author": "airborne3502"
            },
            {
                "raw_content": "It's the French...the slightest pushback and they'll wave the white flag!",
                "author": "MericaFukYeah"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "DNI Tulsi Gabbard has officially been selected by President Trump to oversee ELECTION SECURITY and voter fraud — THAT'S why the Left is panicked right now",
        "score": 1764,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Get Em Tulsi",
                "author": "Logan051361"
            },
            {
                "raw_content": "Tulsi and Marco carrying the team. For sure thought it was going to be Kash and Homan. Pam, we expected nothing from her and she somehow delivered worse.",
                "author": "MAG-n-KAG"
            },
            {
                "raw_content": "It's sad that I trust the two Democrats over the rest of the cabinet to get things done.",
                "author": "TrumpWonByALandslide"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This beautiful building will be, when complete, the much anticipated White House Ballroom — The Greatest of its kind ever built!",
        "score": 726,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yay, how about someone gets arrested or it will be torn down for a George Floyd memorial in 3 years.",
                "author": "Aggrieved03"
            },
            {
                "raw_content": "It’s Trump 1.0 all over again. His “staff” distract him with shiny things and help the dems run out the clock. Fell For it Again.",
                "author": "navycuda"
            },
            {
                "raw_content": "**FUCK THE FUCKING BALLROOM**",
                "author": "Sexual_Assault_Rifle"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "CNBC: \"Intel is moving into GPUs and has hired a chief [GPU] architect, CEO Lip-Bu Tan says\"",
        "score": 414,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Did Lip-Bu Tan just find out about Arc today?",
                "author": "MiloIsTheBest"
            },
            {
                "raw_content": "Recently got an Arc Pro B50 because it supports SR-IOV as a ~400€ card. If their direction is providing great features at costs that absolutely obliterate the competition then I say keep em coming.",
                "author": "SoilMassive6850"
            },
            {
                "raw_content": ">Tan told the audience at the Cisco AI Summit that it took “some persuasion” to convince the new executive to join the chipmaker. Tan did not name the new hire. Eric Demers? [https://www.tomshardware.com/pc-components/gpus/eric-demers-leaves-for-intel-after-14-years-at-qualcomm-father-of-radeon-and-adreno-gpus-now-sits-at-lip-bu-tans-table](https://www.tomshardware.com/pc-components/gpus/eric-demers-leaves-for-intel-after-14-years-at-qualcomm-father-of-radeon-and-adreno-gpus-now-sits-at-lip-bu-tans-table)",
                "author": "Forsaken_Arm5698"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Western Digital Designs High-Bandwidth HDDs That Quadruple I/O Speeds",
        "score": 64,
        "text_content": "FINALLY !!! Someone dared to implement the obvious, wich was HDD's Achille's heel for so long. Not one, but TWO (obvious), but radical changes: * two independent head stacks - so TWO heads per surface. Awesome not just for redundancy but also seek time and performance * multi head R/W capability on within the same stack THis means that HDDs are finally to get WAY better transfer speeds, that are likely finally to saturate at least SATA-3 and later get over 1GB/s and several GB/s. Only things still missing: * much smarter SMART with advanced diagnostics, like head wobble data, track signal/noise ratio, spindle speed stability etc etc. * RAID5/6 in-drive capability * better DIY serviceability, like drive electronics interchangeability There might be some light in the end of this dark tunnel, crated by AI crowd... 😏",
        "comments": [
            {
                "raw_content": "Redundancy as in double the probability of a head crash?",
                "author": "alexforencich"
            },
            {
                "raw_content": "The Harddrive vs SSD comparisons are like vacuum tubes vs transistors. Except somehow the vacuum tube technology remained ultra cheap for a long time. I think one of the biggest issues was HDDs wasn’t their read speed in use, raid arrays can easily compensate. No it was the bottleneck of rebuilding the array after a dead drive because a 500MB/s sustained write will take 11hrs straight to rebuild a 20TB drive. All while the 60TB NVMe drive saturating a Gen4x4 interface at 8GB/s will only take two. And a Gen5x4 interface would only take 1.",
                "author": "titanking4"
            },
            {
                "raw_content": "Personally, random read/writes are HDD's biggest Achilles heel. Even my Chinese 120GB SSD that I got for like 8 bucks, brand new, ate my Raptor 10K for breakfast in terms of boot-up times and noise (you can't compete with zero noise). And while I'm glad that HDDs are putting up a fight, with NAND projected to hit a 1,000 layers or more by early 2030s, I think we all know where things are heading, at least for the consumer market. Of course, this AI boom muddies things up a bit as fabs would rather churn out DRAMs than NAND, but that's another can of worms.",
                "author": "GenZia"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "NAND and RAM Spot Pricing is Completely out of Control",
        "score": 91,
        "text_content": "**- Tip:** skip the wall of text and just go to Latest Average Spot Price or Charts with Spot Pricing History. **TL;DR** [DRAMeXchange's](https://www.dramexchange.com/) latest spot prices for GDDR6 8Gb and 16Gb, 512Gb TLC, DDR5 16Gb 4800/5600, and DDR4 16Gb 3200 are extremely inflated. That's even when compared to the peak of a normal memory/NAND cycle and in some cases exceeding Pandemic highs by multiple times. for example 3X for TLC NAND. The widely reporting price shock is indeed real and far worse than I expected. Hate to bring bad news but unfortunately a peak in spot pricing hasn't been observed yet. With no signs of slowing down spot pricing is likely to continue rising even further, but right now we still don't know by how much. # Latest Average Spot Price * DDR5 16Gb 4800/5600 (Feb 3rd 2026) = ***$38*** or ***$19/GB, 32GB = $608*** * DDR4 16Gb 3200 (Feb 3rd 2026) = ***$77.21*** or ***$38.60/GB, 32GB = $1235*** * 512Gb TLC (Jan 26th 2026) = ***$16.31*** or ***$261/TB*** * GDDR6 8Gb (Jan 26th 2026) = **$8.87/GB** * GDDR6 16Gb (Jan 26th 2025) = ***$30.62*** or ***$15.31/GB, 16GB = $245*** # Charts with Spot Pricing History * DDR5 16Gb 4800/5600 (Mar 2024 - Jan 2026): [https://imgur.com/a/J36F06s](https://imgur.com/a/J36F06s) * DDR4 16Gb 2666 (Aug 2021 - April 2023): [https://imgur.com/a/PxzHMya](https://imgur.com/a/PxzHMya) * DDR4 16Gb 3200 (May 2023 - Jan 2026): [https://imgur.com/rYWtOlC](https://imgur.com/rYWtOlC) * TLC 512Gb (Dec 2020 - Mar 2024): [https://imgur.com/QQKiS4R](https://imgur.com/QQKiS4R) * TLC 512Gb (Jan 2024 - Jan 2026): [https://imgur.com/a/Xv3ndwq](https://imgur.com/a/Xv3ndwq) * GDDR6 8Gb (Jan 2022 - Jan 2026): [https://imgur.com/ApmnkOn](https://imgur.com/ApmnkOn) # Chart Report & Analysis **DDR5 16Gb:** They only quote it from March 2024 where pricing starts at $4.7. Pricing remains at or below $5 until March 2025 where it begins to rise and reaches \\~$6 by early Summer 2025. In September quotes climb from $6 to $8, in October from $8 to >$13 and in November to \\~$26. Pricing climbs towards $30 at EoY 2025. From early January to early February 2026 pricing climbed from $30.5 to ***$38***. This ***\\~6-8X above pre-September 2025 pricing***. **DDR4 16Gb:** I'll start with 2666 then move on to 3200. From August 2021 to March 2022 pricing was elevated at ***$7.5-8.5***. From April 2022 - April 2023 spot price more than halved from \\~$7.5 to $3.2. 3200 quoting begins in May 2023 where pricing continued to drop and reached a minimum of \\~$2.9 in September 2023. Pricing remained in a stable $3-3.5 range for over 1.5 years, only to begin to sharply rise in May - August 2025 where it more than doubled from \\~$4 to \\~$9.3. In September and October pricing more than doubles to >$21. Towards EoY 2025 we see almost a tripling to >$61. Pricing rises further in January to early February where avg spot price climbs to an absurd ***$77***. ***9-10X the late Pandemic highs*** and ***22-26X*** the 2023-2025 stable prices. **TLC NAND:** During the Pandemic 512Gb TLC avg spot pricing was hovering around ***$4-5***. Then later it plummeted to \\~$1.5 during the Spring/Summer of 2023. Later it climbed to ***$3.7*** in Spring 2024 before stabilizing around $2.4-2.8 until late September 2025 when pricing began to spiral out of control. Rising from $3 to $5 in October, in November from $5 to $9, and in December from $9 to $13. Latest quote from late January 2026 stands at ***$16 or >3X peak Pandemic pricing***. **GDDR6 8Gb:** Quotes only go back to 2022 but show a peak GDDR6 8Gb ***$12.96*** avg spot pricing in January 2022. Later plummeted for +2.5 years and reaching a minimum of $2.27 in October 2024. Pricing began to climb in October 2025 from $2.6 to \\~$3. In November pricing increased from \\~$3 to \\~4, in December from $4 to $5.5. Latest quote from late January has pricing at ***$8.87*** or ***\\~31.56% less than January 2022 maximum during the Cryptomining Boom***. **GDDR6 16Gb:** Unfortunately GDDR6 16Gb pricing wasn't scraped but in Dec 2024 I was told that spot pricing for 16Gb GDDR6 was at 8$. Didn't verify it myself at the time so don't take it as fact. I can now confirm they quote GDDR6 16Gb modules at a staggering ***$30.615 or a >4x increase*** in just 13 months. This translates to ***$245*** for the VRAM portion of a 9070XT BOM kit. An inferred ratio from late 2024 8Gb/16Gb pricing suggests a 1.74 ratio $/GB. The current quotes align almost perfectly with that as it has a 1.73 ratio. By comparing that against Jan 2022 maximum for 8Gb I estimate the 16Gb pricing back then to \\~$44.5-45 or +45-47% above current levels. # Implications Unless I'm missing something I've yet to see a single indication in these price charts that suggesting the current price shocks have reached their peaks. If anyting it's the complete opposite unfortunately and spot pricing continues to climb higher each month unrelentingly and at a rapid pace. While spot pricing is likely more severe than contract pricing as soon as those agreements (LTAs and shorter term) expire in large numbers and the vendor stockpiles run out then we'll begin to see the severe negative impacts of the price shock materialize across nearly if not all markets pretty much overnight. We're already starting to see that right now but looks it unfortunately looks like that's not even the beginning of what's to come. Things will get much worse before they get any better. All this is unfortunately in line with what has been widely reported the last 2-3 months, we're indeed heading towards something really bad. I can only speculate when spot pricing peaks or what will happen with DC Capex in the following years, but right now pricing is only heading in one direction and at an unprecendented pace, and that's not good news for anyone except the DRAM and NAND manufacturers. # NOTES * To access 16Gb GDDR6 pricing, in case you want to verify the numbers yourself, you need to make a free account at DRAMeXchange. * Credit to u/Balance- for compiling TLC pricing for Dec 2020 - March 2024 here: [https://www.reddit.com/r/hardware/comments/1bt2vs6/nand\\_spot\\_prices\\_keep\\_rising\\_gddr6\\_spot\\_price/](https://www.reddit.com/r/hardware/comments/1bt2vs6/nand_spot_prices_keep_rising_gddr6_spot_price/) * Internet Archive's Wayback Machine used to retrieve old spot price quotes: [https://web.archive.org/web/20260000000000\\*/https://www.dramexchange.com/](https://web.archive.org/web/20260000000000*/https://www.dramexchange.com/) * For both DDR4 and DDR5 eTT memory the price increases are far less inflated on [DRAMeXchange.com](http://DRAMeXchange.com) for reasons beyond me. If anyone knows what this is about please enlighten us. * Internet Archive scrapes are getting rarer for the website so I could only choose biweekly sampling frequency.",
        "comments": [
            {
                "raw_content": "I won't forget this after the Chinese suppliers up and coming mature their processes during this time of upheaval",
                "author": "rchiwawa"
            },
            {
                "raw_content": "This is the only time I cheer for Chinese manufacturers to kick some ass.",
                "author": "Dapper_Committee3659"
            },
            {
                "raw_content": "Fuck this shit. Hope your rigs can last another 3 years team",
                "author": "delph0r"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD Radeon RX 9000 GPUs begin to appear in the Steam Hardware Survey at last — RX 9070 arrives with paltry 0.16% market share, less than the GeForce GT 730",
        "score": 82,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No prebuilt no laptop, no real life presence. DIY is utterly irrelevant no matter how loud redditors roar.",
                "author": "996forever"
            },
            {
                "raw_content": "If you guys want to know everytime how small diy pc gaming share is and on top of that radeons is. Look no further. Guessing that 95% or more prebuilts just come nvidia. And this is considering that misreading hardware name bug doesnt exist on steam. Which it misread my friends rx6800 a year ago. Even with that. Amd is happy where its at making bank on AI sales and ryzen sales to shift fabs into more consumer radeon. And considering Q1 report and stock price Shareholders want even more. Leaving us to get duopolised by amd and nvidia. While nobody looks back on intel because gamers are dumb.",
                "author": "Sevastous-of-Caria"
            },
            {
                "raw_content": "AMD had chance to comeback market share with MSRP prices instead they went ye old Nvidia -% or -100 strategy before the current AI market eating up all the DRAM",
                "author": "DarkFlameShadowNinja"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Tom's Hardware: \"AMD reveals next-gen Xbox could launch in 2027 — CEO says semi-custom SoC ready to 'support launch in 2027'\"",
        "score": 62,
        "text_content": "",
        "comments": [
            {
                "raw_content": "On one hand, I'm surprised Xbox is still making the \"box\" - You'd think that with Gamepass and Microsoft making all their games available on PC, making a console that has very little margins can't be that worthwhile to them. On the other hand, with how expensive PC gaming is getting, Microsoft might have to flex their buying power and offer a subsidized device just to get a gamepass capable device in the hands of their customers.",
                "author": "Uptons_BJs"
            },
            {
                "raw_content": "Really curious how RDNA5 delivers when it comes to RT/PT. The Sony/AMD made it sound like a huge focus for next generation PlayStation. Wonder if next generation will finally have it go mainstream",
                "author": "dabocx"
            },
            {
                "raw_content": ">CEO says semi-custom SoC ready RDNA 3.5",
                "author": "BarKnight"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Western Digital blows hard disk drive future wide open",
        "score": 215,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I've learned to take roadmaps with a grain of salt. https://www.kitguru.net/components/hard-drives/anton-shilov/industry-consortium-predicts-100tb-hard-drives-in-2025/",
                "author": "Frexxia"
            },
            {
                "raw_content": "For the average person, I care less about a HDD that can store 50-100TB and more about the cost per TB. That hasn't changed much (if at all) in at least 5-6 years.",
                "author": "_unfortuN8"
            },
            {
                "raw_content": "Good for you, WD. Now let me know when I can get NAS/Server >14TB drives for less than $15/TB brand new. I built a 3x14TB NAS in 2023 and the price per GB/TB hasn't gone down.",
                "author": "InflammableAccount"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD Reports Fourth Quarter and Full Year 2025 Financial Results",
        "score": 47,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How on earth do you get revenue to drop next quarter in this AI boom?",
                "author": "From-UoM"
            },
            {
                "raw_content": "Lol the usual suspect tryin with the dishonest comment again 1. Revenue is down q1 because client and gaming are down 2. Dc is guided up, both cpu and gpu for q1 3. There's an extra $360m this quarter because they finally dumped the mi308 which was stuck in inventory to china, this accounts for the roughly $300m lower revenue for q1 4. Amd said that dc growth is expected to be >60% in 2026 and 2027 5. Amd not including any potential mi325x figures to china in guidance just to be safe tldr q1 revenue excluding china ai revenue is about the same or potentially higher even with seasonality decline in client, some users didn't read. **Q4 was guided with $9.6b and q1 at $9.8b**",
                "author": "SirActionhaHAA"
            },
            {
                "raw_content": "Only embedded segment didn't grow compared to the other segments. Was that Xilinx that didn't grow, so was that a bad purchase on AMD's part?",
                "author": "jedrider"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD board partners said to plan 5–10% Radeon price rise while prioritizing 8GB models",
        "score": 81,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Considering the price of DRAM has sky rocketed, an increase of 5-10% seems very reasonable to me. It's not like the AIB partners control the price of RAM.",
                "author": "flumpfortress"
            },
            {
                "raw_content": "Hello Hero_Sharma! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "I thought AMD promised that they will not raise prices?",
                "author": "imaginary_num6er"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "DRAM prices expected to double in Q1 as AI ambitions push memory fabs to their limit",
        "score": 36,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If it doubles you'd have to pay 800 euro for garbage 16GB kit. Currently the kit I wanted is not even available to buy anymore but last price was 1400 euro for 48GB.",
                "author": "The-Choo-Choo-Shoe"
            },
            {
                "raw_content": "is RAM even selling to consumers at the current prices? I'd have expected the market to be dead already, bar people who are in an emergency.",
                "author": "Sopel97"
            },
            {
                "raw_content": "Glad i got my 64gb kit.",
                "author": "arryporter"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "The Switch 2 has officially outsold the Wii U in just 7 months",
        "score": 2199,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I was one of those 13M too.",
                "author": "reigninblood7"
            },
            {
                "raw_content": "I don't think it even took 7 months. It's already 4 million over the Wii U, so it likely surpassed it a few months ago. It's catching up to the GameCube now.",
                "author": "Almightyderek"
            },
            {
                "raw_content": "Keep in mind the FY goal was originally 15M units, then revised to 19M. I think it's gonna crack 20M by the end of this FY (end of March). I keep seeing restocks of the console. https://preview.redd.it/8a76la5lwdhg1.png?width=1228&format=png&auto=webp&s=1981ac6f0215d3c7fdc177d815ba351bbd7687be Edit: Whoever got me to 69 up votes, thank you for your service. 🫡",
                "author": "FatBoyDiesuru"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Borderlands 4 delayed indefinitely on Nintendo Switch 2, statement released",
        "score": 414,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ok. Now fix Borderlands 3 on the Switch 2.",
                "author": "ChaossssMark666"
            },
            {
                "raw_content": "https://preview.redd.it/xdz30g7yvchg1.png?width=1440&format=png&auto=webp&s=35086ddd60d6c1328eb3f966c6b7a559a1f7b9e1 RANDY THAT GREASY BASTARD LIED AGAIN",
                "author": "RealGazelle"
            },
            {
                "raw_content": "We really about to live in a timeline, Capcom's Monster Hunter team got their shit together and are fixing Wild's optimization to the point that a Switch 2 port is an open secret. While Take-Two and Gearbox are struggling so much at fixing Borderlands 4's issues in general, that they aren't touching the Switch 2 version at this point. Despite being shown at multiple directs, given a creator's voice and been playable at several events. 💀",
                "author": "Animegamingnerd"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "This might be the worst pre-order \"bonus\" I have EVER seen.",
        "score": 568,
        "text_content": "",
        "comments": [
            {
                "raw_content": "i can think of a worse one. the 25 or something extra lives for preordering sonic lost world on the wii u through amazon.",
                "author": "Inhalemydong"
            },
            {
                "raw_content": "Wasn’t getting this game, but this pushed me over the edge. Preordered, at Amazon!!!!",
                "author": "JustinAndFeena"
            },
            {
                "raw_content": "The worst one I’ve personally seen was 25 extra lives for preordering Sonic Lost Worlds from Amazon back in 2013.",
                "author": "MegaDitto13"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Adhoc's (DIspatch) Developer Continues Their Awful PR Streak (Keep those refunds going!)",
        "score": 213,
        "text_content": "Earlier today, Adhoc stated that they are not going to release an uncensored version on the Switch physically. Why are they talking about physical when the game is not even done yet on any platform? Plus, the first season is not even available physically on the PS5. Instead of just stating that the update (to make the game uncensored) for the DIGITAL Switch/Switch 2 versions is in the works, this company keeps shooting themselves in the foot. At this point, they should be quiet until they patch/update the Switch/Switch 2 versions so that they are uncensored. If you bought the game on the Switch/Switch 2, please refund it until they fix the game by releasing the uncensored version. Refunds are now available, if you live in the Americas here is the link: [https://en-americas-support.nintendo.com/app/contact](https://en-americas-support.nintendo.com/app/contact) If you live in the UK, here is a phone number to contact Nintendo in regards to your refund +443456050247",
        "comments": [
            {
                "raw_content": "It’s simple: separate SKUs for Japan which is what cyberpunk did. Everything else is just PR noise.",
                "author": "OK_Commodor64"
            },
            {
                "raw_content": "As I stated on other posts, this release was rushed and sloppy and they only have themselves to blame. Even if Nintendo demanded a complete grotesque censored version, the studio had the moral duty to let consumers know the state of the game they were pre-ordering. But they didn't... because they didn't want people to know. Also, apparently they queerbaited their fans by putting LGBT tag on Steam and telling people to \"wait and see\". When nothing happened, they just deleted the tag for the game's page.",
                "author": "kahabraham"
            },
            {
                "raw_content": "If physical is impossible because of submitted game ID, then create a \"new\" game and call it the full experience edition or blatantly the uncensored version. Release that and make a separate eShop listing. Give eShop owners of the \"normal\" 100% discount and add an update to the normal version to claim the other for free like Hogwarts Legacy did. Everybody happy and JP still got their censored version only.",
                "author": "Rynelan"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "An oled is a MUST",
        "score": 378,
        "text_content": "Odyssey oled g5 g50sf Hdr is off cause it made the colors insanely washed out (I tried calibration but to no avail) Rainbow road looks amaing and my phone + compression doesn't do it any justice",
        "comments": [
            {
                "raw_content": "Looking at your pictures on my LCD screen",
                "author": "Phos-Lux"
            },
            {
                "raw_content": "I really wish the switch 2 had an OLED display. It's game changing.",
                "author": "ShakeAndBakeThatCake"
            },
            {
                "raw_content": "I have a Sony A80J 65\" and Mario Kart world looks substantially better than on my mom's hisense.(Even with the absolutely abysmal HDR calibration tool on the switch). It's way more washed out on her TV. The OLED is definitely more vibrant and the contrast is ridiculous.",
                "author": "IbanezCharlie"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Is there any planet where this graph TIES to the “sales are down” reporting from December?",
        "score": 115,
        "text_content": "My understanding was that the \"console sales are massively down, S2 is selling worse than S1 last year\" reports that came out late last year were based on a reputable source. And it was less of a rumour and more based on real sales figures. Which is why all reaction I saw (including major outlets) were treating the report as fact. But then I see this graph and it seems like sales are spiking in December, not slowing down. So was it all a load of nonsense? Why is no one saying this source can never be trusted again? Or am I missing something and this graph doesn't give the full picture so both the graph AND the report can be accurate?",
        "comments": [
            {
                "raw_content": "switch 2 sold marginally less than switch 1 during holiday season switch 1 sold 7.23 million during q3 2017, switch 2 sold 7.01 million during q3 2025 some people like making mountains out of anthills",
                "author": "TiocStudios"
            },
            {
                "raw_content": "I have no clue why that rumour gained traction and who started it in the first place",
                "author": "Loose_Society9485"
            },
            {
                "raw_content": "Why should any average joe care about sales figures?",
                "author": "EpilepticBatman"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Rumor: Caitlin Thorburn's Spotlight profile updated referencing a Xenoblade Chronicles game coming in 2026",
        "score": 37,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Note someone's linkin page did something like this for fire emblem some months before fire emblem was announced",
                "author": "LuigiWarrior"
            },
            {
                "raw_content": "LET'S FUCKING GOOOOOOO",
                "author": "buttsecks42069"
            },
            {
                "raw_content": "She was on the voice cast for Xenoblade 2, maybe it’s a Switch 2 edition with some new content",
                "author": "computerCoptor"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Super Mario Party Jamboree Version 2.3.0 is now available",
        "score": 53,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yet another win for the Polish",
                "author": "Bobokay12"
            },
            {
                "raw_content": "The following updates have been made when playing the game on Nintendo Switch 2: **General:** * Support added for Thai and Polish. * Several other adjustments and fixes have been made to improve the gameplay experience. The following updates have been made when playing the game on Nintendo Switch: **General:** * Several other adjustments and fixes have been made to improve the gameplay experience.",
                "author": "Amiibofan101"
            },
            {
                "raw_content": "surprise patch with no clear changes amazing. Figured they would've made the base game 4k on switch 2 instead of it being split into an alt mode",
                "author": "Entire_Paramedic_389"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Caitlin Thorburn just updated her Spotlight page to say she worked on a Xenoblade game coming out in 2026",
        "score": 441,
        "text_content": "[https://famiboards.com/threads/monolith-soft-development-and-speculation-st.51/page-55#post-2165560](https://famiboards.com/threads/monolith-soft-development-and-speculation-st.51/page-55#post-2165560) From what I understand, only the person who is the subject of said page can update the page. Also, considering she voiced KOS-MOS, T-elos, and Nim in Xenoblade 2, I'm only expecting a Nintendo Switch 2/Definitive Edition with additional content.",
        "comments": [
            {
                "raw_content": "Voice actors and accidentally spoiling upcoming games, name a more iconic duo.",
                "author": "FewWatermelonlesson0"
            },
            {
                "raw_content": "Welcome back Jenna Coleman accidentally revealing Xenoblade 3",
                "author": "KooTheBird"
            },
            {
                "raw_content": "I just want a 60fps patch for Xenoblade Chronicles X : Definitive Edition. And I guess the others but X is the one I care about the most.",
                "author": "Greatsnes"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Resident Evil Requiem physical copy leaked. Watch out for spoilers",
        "score": 223,
        "text_content": "https://xcancel.com/Gamer\\_Snack/status/2018744891761684942#m",
        "comments": [
            {
                "raw_content": "Nearly a month early is actually absurd",
                "author": "SwordsAndTurt"
            },
            {
                "raw_content": "I heard there’s a new enemy type called the >! Evil Residents !< and man that’s some spooky stuff",
                "author": "WarCrimeGaming"
            },
            {
                "raw_content": "oh fuuuuuck me. I knew it'd break street date early, but a fuckin month ahead?",
                "author": "butreallythobruh"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "AMD CEO confirms next-gen Xbox hardware is on track for 2027 release. Featuring AMD semi-custom SoC.",
        "score": 307,
        "text_content": "Key Quote: AMD CEO Dr. Lisa Su let out a hint about when a next-gen Xbox could launch during the company's Q4 2025 earnings call. Providing commentary on client revenue, the top executive said, \"Development of Microsoft's next-gen Xbox featuring an AMD semi-custom SoC is progressing well to support a launch in 2027.\" Source: https://www.tomshardware.com/pc-components/cpus/amd-reveals-next-gen-xbox-could-launch-in-2027-ceo-says-semi-custom-soc-ready-to-support-launch-in-2027 Previous rumour: https://www.reddit.com/r/GamingLeaksAndRumours/s/CM0mx2RN3i",
        "comments": [
            {
                "raw_content": "This things going to be expensive",
                "author": "Blanketshaper"
            },
            {
                "raw_content": "$1000 USD at the minimum",
                "author": "TTBurger88"
            },
            {
                "raw_content": "Does that mean Microsoft will release their newest console first before the PS6? Or does that mean this will encourage Sony to release their newest console (PS6) in 2027 rather than 2029? I’m a bit confused.",
                "author": "coco_puffsz"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Natethehate: Borderlands 4 for Switch 2 has been on pause for a couple of months. Challenging to port for the studio.",
        "score": 380,
        "text_content": "Quote \"The port of the Switch 2 version has been paused for a couple of months now. It's proven to be a challenge & has likely crossed over into the realm of investment/time needed to port it well being too high in comparison to sales potential.\" Source: https://www.resetera.com/threads/take-two-pauses-%E2%80%98borderlands-4%E2%80%99-switch-2-release-ceo-addresses-%E2%80%98gta-online%E2%80%99-user-created-charlie-kirk-mission-will-not-delay-gta-6-physical-copies.1424563/post-150857335",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "![gif](giphy|Z9zv5sdc7g6BH8tSbW) We need this Randy to make borderlands 5",
                "author": "MakaButterfly"
            },
            {
                "raw_content": "we got jumpscared by Randy Pitchford in the Switch 2 Direct for nothing",
                "author": "moneycity_maniac"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Next Xbox dropping 2027 at the earliest according to Jez Corden",
        "score": 458,
        "text_content": "According to recent information he's heard, the next Xbox is not expected to drop until at least 2027, both as a result of RAM prices and MS trying to improve the Xbox Full Screen Experience (Windows 11 setting), as he further restates that the next Xbox will be a full Windows PC. [The next Xbox may inherit Windows’ weaknesses | Windows Central](https://www.windowscentral.com/gaming/xbox/the-next-xbox-is-a-pc-with-all-of-windows-strengths-will-it-come-with-its-weaknesses-too)",
        "comments": [
            {
                "raw_content": "#Jez Corden is a Tier 2 - Generally Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "...not that I'm questioning Jez on that being true, but uh, was anybody seriously expecting it any sooner?",
                "author": "failingwinter"
            },
            {
                "raw_content": "2028 it is.",
                "author": "Lz537"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Kingdom come Deliverance next gen update most likely releasing on February 13!",
        "score": 458,
        "text_content": "https://xcancel.com/i/status/2018685975946199194 After the Playstation store mistake, where the description got updated to include 60fps, 4k and updated visuals, the game is now coming to Xbox Game Pass in 10 days! As it happens, exactly on the day of its anniversary. The gamepass haul for the first half has games releasing on multiple dates. I think they've picked that date for kcd for a reason. This makes the most sense and things are lining up to well for it to be coincidental. Ps store mistake mentioning graphical and performance updates, game's anniversary happening in 10 days, and the release on gamepass on that very same day.",
        "comments": [
            {
                "raw_content": "Yeah i think this is highly likely",
                "author": "Severe-Committee6240"
            },
            {
                "raw_content": "I’m extremely exited for this because i haven’t played KCD2 yet, it would be nice to go through both games!",
                "author": "Loose_Society9485"
            },
            {
                "raw_content": "I wonder if the Switch version also gets an upgrade for S2",
                "author": "KMoosetoe"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "The \"Nintendo preview event\" was for previews of Virtual Boy, Mario Tennis Fever, Super Mario Bros Wonder Nintendo Switc 2 Edition, Resident Evil Requiem and Pragmata.",
        "score": 271,
        "text_content": "Multiple articles are out now for each item, but as confirmed by multiple publications that's the \"Nintendo event\" previously attributed to Pokémon that people were flying to. Previous rumor: https://old.reddit.com/r/GamingLeaksAndRumours/comments/1qqaud7/the_press_event_at_nintendo_concerns_a_pokemon/",
        "comments": [
            {
                "raw_content": "Capcom really like promoting their games huh. Hopefully they deliver",
                "author": "Aftermoonic"
            },
            {
                "raw_content": "Everyone was crying about Persona on Switch for 3 years meanwhile I was like \"WHEN'S JACK BROS THE MEGATEN GOAT\"",
                "author": "MyMouthisCancerous"
            },
            {
                "raw_content": "Previews seem largely positive especially for Mario Tennis Fever and RE Requiem. The Mario Wonder DLC previews only looked at the multiplayer content which is a shame as I really want to know how much it has for singleplayer with the remixed levels for the Koopalings.",
                "author": "Dapperblook22"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Panther Lake Shows Strong Linux CPU Performance & Power Efficiency With Core Ultra X7 358H Benchmarks Review",
        "score": 51,
        "text_content": "",
        "comments": [],
        "subreddit": "intel"
    },
    {
        "post_name": "Core Ultra 250KF Plus \"Arrow Lake Refresh\" CPU appears in retailer listings",
        "score": 14,
        "text_content": "",
        "comments": [
            {
                "raw_content": "its $400 for 270k…",
                "author": "maxim0si"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Sapphire Radeon RX 7900 XT with blower-style cooler spotted at $699",
        "score": 68,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Reminds me of AMD'S old reference cards for RX 570, RX 580, and Vega 56 and 64",
                "author": "AskJeevesIsBest"
            },
            {
                "raw_content": "Is sapphire using internet explorer or sum?",
                "author": "glizzygobbler247"
            },
            {
                "raw_content": "New old new old new stock now coming to a Newegg near you",
                "author": "mycheese"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "The World’s First Ryzen AI 470 Mini PC! X1 Ai Pro Hands On",
        "score": 13,
        "text_content": "",
        "comments": [
            {
                "raw_content": "As always, quality content from ETA! Will be interested to see the power scaling beyond 65w, but at the same time doesn't seem much an upgrade VS 300 series.",
                "author": "pioprofhd1"
            },
            {
                "raw_content": "Oh look another mini PC.. where are the laptops????",
                "author": "G305_Enjoyer"
            },
            {
                "raw_content": "I would love one of these for testing, but damn it's expensive!",
                "author": "flemtone"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Five Ryzen 9000 CPUs reportedly died on ASRock boards in a single day",
        "score": 37,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Does journalism in tech media nowadays mean that you just copy Reddit comments?",
                "author": "Jumpy-Dinner-5001"
            },
            {
                "raw_content": "*Reportedly* This is an article about the ASRock sub Reddit, where there are people making fake accounts to pretend their CPU has died for some bizarre and ridiculous reason. If you've spent any amount of time on the ASRock sub, you'll realise the issue *looks* to be much more common and prevalent than outside of the sub, and it's because it's not happening as commonly as some weird people there are making it out to be.",
                "author": "FlarblesGarbles"
            },
            {
                "raw_content": "another re post of we got no legal prof!",
                "author": "firedrakes"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD board partners said to plan 5–10% Radeon price rise while prioritizing 8GB models",
        "score": 26,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "They said this months ago but in Australia prices have decreased instead and we're currently getting 9070XTs for under US MSRP and almost $100 AUD under Australia's MSRP...",
                "author": "AreYouAWiiizard"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Sapphire to launch Radeon RX 9070 NITRO+ Crimson Desert Edition",
        "score": 60,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Cool to see cool designs back to GPUs. Too bad this one will probably use the 12pin.",
                "author": "costafilh0"
            },
            {
                "raw_content": "Hopefully the connectir isnt as hot as a desert",
                "author": "JamesDoesGaming902"
            },
            {
                "raw_content": "We need the motherboard X870EA Nitro+ Phantom Link to enjoy the new feature associated to the graphic card to check the thermal statut of the connector, too bad for nitro+ users...",
                "author": "Mysterious_Frenchy"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Everyone in the Blue thinks they can sell to the people in Red in the next 10 years. Good luck!",
        "score": 807,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Boomers are just selling houses to each other right now. The next decade will be interesting",
                "author": "clem_kruczynsk"
            },
            {
                "raw_content": "And its all gonna go to the senior care industrial complex.",
                "author": "teleheaddawgfan"
            },
            {
                "raw_content": "There will be alot of inherited properties",
                "author": "Majestic-Parsnip-279"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Manhattan closed 2025 with the highest number of foreclosures in at least 15 years",
        "score": 105,
        "text_content": "original study: [https://www.propertyshark.com/Real-Estate-Reports/nyc-foreclosure-report/](https://www.propertyshark.com/Real-Estate-Reports/nyc-foreclosure-report/)",
        "comments": [
            {
                "raw_content": "Manhattan closes record year with 208 residential foreclosures. In 2019 it was 151? Ok.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "Foreclosures are up in my area in PA as well. Outpacing new listings for homes.",
                "author": "GreenGardenTarot"
            },
            {
                "raw_content": "Always relevant to compare national real estate trends with... Manhattan.",
                "author": "TheUserDifferent"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Luxury Home Prices Keep Climbing Despite Sluggish Demand, prices rose 4.6% year over year to $1.31 million",
        "score": 4,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I said it in another thread, and I'll say it here. The economy has become a tale of two groups, those who have a lot of stocks, and those who don't. Those with a lot of stocks, like the upper middle class boomers who had a $2 million portfolio in 2009 now have $20 million, and are richer than they ever thought possible. They are driving up the cost of everything, housing, cars, hotels, food, restaurants, cruises, and everything else by spending money with no thought. If you don't have a lot of stocks (and no, the measly $150k the average American has in his 401K is not moving the needle), you think the economy sucks.",
                "author": "BaluZana"
            },
            {
                "raw_content": "Those are not for Goyim.",
                "author": "aw33com"
            },
            {
                "raw_content": "K shaped economy. Your more likely to be poor or wealthy at this point.",
                "author": "Nullspark"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "This… could be something…",
        "score": 1215,
        "text_content": "This could allow AI to perform many more tasks with the help of one or more humans, basically, the ai could coordinate humans for large scale operations…",
        "comments": [
            {
                "raw_content": "Use my body autonomously while I sleep, that way I can wake up sore with a paycheck",
                "author": "jestina123"
            },
            {
                "raw_content": "HAAS",
                "author": "AiDigitalPlayland"
            },
            {
                "raw_content": "So long CAPTCHA, our last line of defence has fallen 🫡",
                "author": "JeelyPiece"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI seems to have subjected GPT 5.2 to some pretty crazy nerfing.",
        "score": 628,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I just switched back to ChatGPT after testing Gemini for a few months and I instantly canceled the free trial they gave me. I don't know if Gemini has spoiled me or if they **really** dumbed it down but it was not a good experience.",
                "author": "BurtingOff"
            },
            {
                "raw_content": "Just means they are going to release GPT 5.3 which is 300% better than its predecessor.",
                "author": "LucidOndine"
            },
            {
                "raw_content": "OP, whenever you see a downward spike of this magnitude in a graph about a technical service, \"partial or total service outage\" is the most likely explanation.",
                "author": "xirzon"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "NVIDIA Director of Robotics Dr. Jim Fan article: The Second Pre-training Paradigm",
        "score": 120,
        "text_content": "From the his following tweet: https://x.com/DrJimFan/status/2018754323141054786?s=20 “Next word prediction was the first pre-training paradigm. Now we are living through the second paradigm shift: world modeling, or “next physical state prediction”. Very few understand how far-reaching this shift is, because unfortunately, the most hyped use case of world models right now is AI video slop (and coming up, game slop). I bet with full confidence that 2026 will mark the first year that Large World Models lay real foundations for robotics, and for multimodal AI more broadly. In this context, I define world modeling as predicting the next plausible world state (or a longer duration of states) conditioned on an action. Video generative models are one instantiation of it, where “next states” is a sequence of RGB frames (mostly 8-10 seconds, up to a few minutes) and “action” is a textual description of what to do. Training involves modeling the future changes in billions of hours of video pixels. At the core, video WMs are learnable physics simulators and rendering engines. They capture the counterfactuals, a fancier word for reasoning about how the future would have unfolded differently given an alternative action. WMs fundamentally put vision first. VLMs, in contrast, are fundamentally language-first. From the earliest prototypes (e.g. LLaVA, Liu et al. 2023), the story has mostly been the same: vision enters at the encoder, then gets routed into a language backbone. Over time, encoders improve, architectures get cleaner, vision tries to grow more “native” (as in omni models). Yet it remains a second-class citizen, dwarfed by the muscles the field has spent years building for LLMs. This path is convenient. We know LLMs scale. Our architectural instincts, data recipe design, and benchmark guidance (VQAs) are all highly optimized for language. For physical AI, 2025 was dominated by VLAs: graft a robot motor action decoder on top of a pre-trained VLM checkpoint. It’s really “LVAs”: language > vision > action, in decreasing order of citizenship. Again, this path is convenient, because we are fluent in VLM recipes. Yet most parameters in VLMs are allocated to knowledge (e.g. “this blob of pixels is a Coca Cola brand”), not to physics (“if you tip the coke bottle, it spreads into a brown puddle, stains the white tablecloth, and ruins the electric motor”). VLAs are quite good in knowledge retrieval by design, but head-heavy in the wrong places. The multi-stage grafting design also runs counter to my taste for simplicity and elegance. Biologically, vision dominates our cortical computation. Roughly a third of our cortex is devoted to processing pixels over occipital, temporal, and parietal regions. In contrast, language relies on a relatively compact area. Vision is by far the highest-bandwidth channel linking our brain, our motors, and the physical world. It closes the “sensorimotor loop” — the most important loop to solve for robotics, and requires zero language in the middle. Nature gives us an existential proof of a highly dexterous physical intelligence with minimal language capability. The ape. I’ve seen apes drive golf carts and change brake pads with screwdrivers like human mechanics. Their language understanding is no more than BERT or GPT-1, yet their physical skills are far beyond anything our SOTA robots can do. Apes may not have good LMs, but they surely have a robust mental picture of \"what if\"s: how the physical world works and reacts to their intervention. The era of world modeling is here. It is bitter lesson-pilled. As Jitendra likes to remind us, the scaling addicts, “Supervision is the opium of the AI researcher.” The whole of YouTube and the rise of smart glasses will capture raw visual streams of our world at a scale far beyond all the texts we ever train on. We shall see a new type of pretraining: next world states could include more than RGBs - 3D spatial motions, proprioception, and tactile sensing are just getting started. We shall see a new type of reasoning: chain of thought in visual space rather than language space. You can solve a physical puzzle by simulating geometry and contact, imagining how pieces move and collide, without ever translating into strings. Language is a bottleneck, a scaffold, not a foundation. We shall face a new Pandora’s box of open questions: even with perfect future simulation, how should motor actions be decoded? Is pixel reconstruction really the best objective, or shall we go into alternative latent spaces? How much robot data do we need, and is scaling teleoperation still the answer? And after all these exercises, are we finally inching towards the GPT-3 moment for robotics? Ilya is right after all. AGI has not converged. We are back to the age of research, and nothing is more thrilling than challenging first principles.”",
        "comments": [
            {
                "raw_content": "Awesome post. Thank you. Especially thanks for putting all the text here.",
                "author": "BrennusSokol"
            },
            {
                "raw_content": "I've been saying this for years by this point. It really sucks these labs only hire doctorates from top-5 universities. Language is an abstraction that attempts to describe abstractions. The latent space of language models is not going to map to the depth and scope of all data that makes up reality/the world. LLMs will never get us to AGI alone. The mapping is vastly inadequate. No amount of faux-reasoning 'gamified loops' are going to fix that. As his article points out - even gorillas exhibit actual agency, LLMs + reasoning can't even do that. It's what grinds my gears about the coopting of the term \"agent\". It's not a fucking agent. It tragically sells real agency short. Oh yeah, Yan LeCunn was right all along.",
                "author": "emteedub"
            },
            {
                "raw_content": "Thanks for posting the full text here. I found this thread via chatgpt (which cannot read X).",
                "author": "immanuelg"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Seems like the lower juice level rumor has been fabricated",
        "score": 97,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nikunj like the OP from OpenAI Developers is referring specifically to the model in the API, not ChatGPT.",
                "author": "RevolutionaryWeek812"
            },
            {
                "raw_content": "This may just be for the API though, whereas it was supposedly for chatgpt where the juice was lowered according to Tibor https://x.com/btibor91/status/2018754586123890717?s=20",
                "author": "socoolandawesome"
            },
            {
                "raw_content": "I’m just a tourist in this sub trying to understand what the hell juice is…",
                "author": "Not-Banksy"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "New SOTA achieved on ARC-AGI",
        "score": 322,
        "text_content": "New SOTA public submission to ARC-AGI: - V1: 94.5%, $11.4/task - V2: 72.9%, $38.9/task Based on GPT 5.2, this bespoke refinement submission by @LandJohan ensembles many approaches together",
        "comments": [
            {
                "raw_content": "reminder that this benchmark didn't even exist one year ago. and the highest result on its release ~10 months ago was o3 at 4%.",
                "author": "my_shiny_new_account"
            },
            {
                "raw_content": "Thats wild how quickly we got >70% on this $40 a task is kinda steep though. I'll be impressed when we can get >90% for $1",
                "author": "WorldlinessGrand3878"
            },
            {
                "raw_content": "Edit: also, the previous score was 54.2% so this is quite a jump! Thanks for posting I'm eager for ARC-AGI-3 to come out as it's looking like 2 is nearing saturation 3 is Launching March 25, 2026",
                "author": "BrennusSokol"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Chatgpt models nerfed across the board",
        "score": 281,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We passed the tests! Time to downgrade it for users!",
                "author": "xiko"
            },
            {
                "raw_content": "Gotta divert some compute toward keeping the lights on I guess",
                "author": "awesomedan24"
            },
            {
                "raw_content": "Everyone running into compute constraints Google has been nerfing their own context counts for free API tier accounts on AI Studio.",
                "author": "FarrisAT"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Why Anthropic's latest AI tool is hammering legal-software stocks",
        "score": 60,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Anthropic has been on a roll laser focused on enterprise. I think we'll be seeing this kind of dynamics more and more where general tools like Cowork are going to absolutely obliterate AI wrappers. Other SaaS stocks sold off heavily too, but legaltech ones were absolutely clobbered.",
                "author": "Singularity-42"
            },
            {
                "raw_content": "It feels like 2026 is the year where even doubters and normal people and skeptics and haters will have to admit that something big is happening. I’m not saying we hit AGI this year necessarily. But the tools are getting good enough that they could have a huge effect on knowledge work even before AGI.",
                "author": "BrennusSokol"
            },
            {
                "raw_content": "The \"we're a front end into a foundation model\" startups seemed doomed from the start. Harvey anyone? My law firm tested it out but basically found that it offered just fancy front ends into things you can largely do with the foundation models. Most attorneys said it saved them little time. That said, they also said that about the foundation models though contract review is an area ripe for it but largely the domain of the in-house lawyer.",
                "author": "chespirito2"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Anthropic's CEO says we're 12 months away from AI replacing software engineers. I spent time analyzing the benchmarks and actual usage",
        "score": 13,
        "text_content": "Dario Amodei recently claimed we're 6-12 months from AI doing everything software engineers do. Bold claim, specific timeline. I dug into the Claude Opus 4.5 benchmarks and compared them to what's actually happening in real development work. The gap between \"solves well-defined problems in controlled repos\" and \"navigates production systems with vague requirements and legacy code\" is huge. Wrote up my analysis here: [See here](https://medium.com/ai-ai-oh/will-ai-really-replace-software-engineers-in-12-months-c447fe37d541) TL;DR: AI is getting scary good at implementation. But engineering isn't just typing code. It's deciding what code should exist, owning consequences, and navigating organisational chaos. What are you seeing in your own work? Are the AI tools making you more productive or actually replacing what you do?",
        "comments": [
            {
                "raw_content": "In my previous organization which is not AI first but some projects that I was driving, I can see AI significantly reducing the number of software developers. You need few expert senior developers who help AI orchestration",
                "author": "InfinitelyNone"
            },
            {
                "raw_content": ">Anthropic's CEO says we're 12 months away from AI replacing software engineers And yet, according to many on this forum and the media, this happened at least 6 months ago.",
                "author": "trisul-108"
            },
            {
                "raw_content": "He’s never ever said replace - don’t mislead people",
                "author": "Tiny_Marketing5558"
            }
        ],
        "subreddit": "singularity"
    }
]