[
    {
        "post_name": "Large anti-Trump account \"Ron Smith\" just self-deleted after it was revealed that the account is based in Kenya",
        "score": 415,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nice, wish the democrat party, illegal aliens, and joggers would self delete",
                "author": "Doritalos"
            },
            {
                "raw_content": "Kenya lend a brutha a dime?",
                "author": "BuSpocky"
            },
            {
                "raw_content": "Kenya huh. Isn't Obama's dad from Kenya?",
                "author": "lixa"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This is bullshit. I don't think they need financial incentives to breed like fucking rabbits.",
        "score": 319,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The whole point is Muslim takeover by outbreeding and immigration. Now that Muslims have captured the local government, extra gibs for people with children means the primary beneficiary will be other Muslims.",
                "author": "fskfsk"
            },
            {
                "raw_content": "The mayor is Muslim. Go figure.",
                "author": "KuzoKevin"
            },
            {
                "raw_content": "White people are facing persecution, enslavement, genocide, and extinction. Everyone else hates us. Speak up and you will be called a “racist,” canceled, bankrupted, and probably violently attacked. Many people on our own “side” are cucked including many people on this very site. Earlier today, the top comment on a post about a black dude lighting a white woman on fire was something to the effect: > muh based blacks dindu nuffin! Then evil whites segregated them and Democrats made them violent! Segregation had nothing to do with violence. Blacks were more conservative than whites until 1970. MLK is my hero! I can’t believe how bad the brainwashing is. The situation is about as bad as it can be. If, in the next 75 years, the same trends continue that occurred from 1950-2025, we don’t have any chance. Charlie Kirk was doing more than anyone to fight back. It’s no wonder they targeted him. Now there’s basically nobody with a big platform on our side besides 80 year old Trump. The future is dark.",
                "author": "ModsAreCucked"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Makes sense",
        "score": 320,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Canada's not a real country anyways",
                "author": "LeRiverDanube"
            },
            {
                "raw_content": "Based Jesus",
                "author": "TakingCoatsWIN"
            },
            {
                "raw_content": "[X was forced to roll-back their \"Date joined location\" after thousands of lsraeIi bots were caught staging false flag antіsemіtіc hate crimes.](https://media.scored.co/post/kBFiuT6usLKc.jpeg) X disabled Auto-translate from Hеbrеw for similar reasons, because what lsraeIis were saying about mass murdering women and children was making them seem demonic.",
                "author": "Oliphaunt"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "White Privilege - the Privilege of being murdered for being white, by career criminal blacks who aren't in prison because liberals think that'd be racist.",
        "score": 1131,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Situational awareness month is 12 months of the year.",
                "author": "OutlawPurpleHairDye"
            },
            {
                "raw_content": "Stay strapped lads, because these pussy ass bitches will attack innocent girls while every other cuck watches. But then again, Penny did something about it and they ran him through the wringer.",
                "author": "FuckU/Spez"
            },
            {
                "raw_content": "It's all so tiresome.",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: President Trump announces he will PULL all U.S. taxpayer dollars from Nig-eria due to the \"GENOCIDE\" of Christians",
        "score": 1426,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why do we have to send them money anyways?",
                "author": "mailinvoter"
            },
            {
                "raw_content": "PLEASE JUST STOP SENDING MY MONEY TO OTHER COUNTRIES. PLEASE PLEASE PLEASE YOU FUCKING BASTARDS.",
                "author": "HiimHillaryClinton"
            },
            {
                "raw_content": "Alex Soros most affected.",
                "author": "Dereliction"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING - Mass users on X are now calling on Elon Musk to reduce the reach and visibility of foreign accounts pretending to be American in U.S.-based users’ feeds after it was revealed that numerous Democrat agitprop accounts are actually foreign-run and foreign-based.",
        "score": 1023,
        "text_content": "",
        "comments": [
            {
                "raw_content": "doubt it... that would be a form of censorship",
                "author": "rsxstock"
            },
            {
                "raw_content": "He won’t because Israel also does that as well. Can’t do anything that would limit Israel from executing its propaganda, that’s antisemitism.",
                "author": "lifeisahologram"
            },
            {
                "raw_content": "Half of canadian media are already paid CIA",
                "author": "Chachiex"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Remember Slade Sohmer, the editor of leftwing news site “The Recount” who was arrested on child porn charges??? Well he pleaded guilty and received 5 years probation. NO PRISON TIME.",
        "score": 702,
        "text_content": "",
        "comments": [
            {
                "raw_content": "they're all pedos, protecting each other",
                "author": "ThePatriotGames2016"
            },
            {
                "raw_content": "These judges.. make Tar & Feathering a thing again.",
                "author": "HappyFunBall"
            },
            {
                "raw_content": "This demonic fuck had infant and toddler porn. We are in a fucked up timeline. A Crusade to clean sweep all of these evil fucks is the only way forward. We are being turned into Sodom and Gomorrah on steroids to continue allowing this shit. Satan laughing spreads his wings. MAGA AF",
                "author": "Mulletgunning"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨GOOD NEWS🚨 The low-life convicted of murder retired Police Captain David Dorn during the 2020 BLM riots tried to appeal the life sentence imposed. Thankfully his efforts have been blocked.",
        "score": 687,
        "text_content": "",
        "comments": [
            {
                "raw_content": "David Dorn was the epitome of an upstanding black citizen. It wasn't too many years ago when black men knew to be good examples. LBJ and gay rap culture (it's gay...research the pants down thing) ruined any chance these people had. Turned them to apes when they should be humans.",
                "author": "BeauHD"
            },
            {
                "raw_content": "RIP Mr. Dorn. I hope his wife has some comfort and peace.",
                "author": "YodaBannon"
            },
            {
                "raw_content": "RIP David Dorn. Such a shame he got senselessly murdered by greedy subhuman opportunists.",
                "author": "Than0sIII"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Every damn time",
        "score": 913,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why are they white??? Also, I have seen this happen with college funding.",
                "author": "AgnesDomini"
            },
            {
                "raw_content": "I have seen many cases of this myself, while working in banks and in retail. Awful fraud in our \"entitlements\" system and the only way to eliminate the fraud is to gut the system and start over.",
                "author": "GuerillaYourDreams"
            },
            {
                "raw_content": "don't judge, he might've gotten that during the riots",
                "author": "MudDog"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "My Niger!",
        "score": 1225,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Does his wife know he’s been in Nigers?",
                "author": "Viewer01"
            },
            {
                "raw_content": "niger please",
                "author": "throttlejohnson"
            },
            {
                "raw_content": "I have a hunch this identifying tag is going to popular on every platform soon.",
                "author": "BlackJack1776"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "AN ILLEGAL MIGRANT IS DEPORTED FROM JAPAN AFTER ASSAULTING SOMEONE He says \"I won't go back\" They say \"It doesn't matter, we're taking you, you're lucky we have a plane\"",
        "score": 1033,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sub-humans do not belong in civilized societies.",
                "author": "orange_kek_great"
            },
            {
                "raw_content": "I’m as offended by that animal being in Japan as I would be if he was in Ireland or America. Get them all out!",
                "author": "Zippythekid"
            },
            {
                "raw_content": "Outside of the USA, Japan and Poland are my favorite countries",
                "author": "geckogreen"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Minnesota Sheriff says he’s a police officer for Somalians first in the U.S. and abroad. \"We came to this country as refugees. There were no Somalian police officers. So now that we've been hired, it means we are working for our own people [Somalians].\"",
        "score": 610,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Denaturalize and deport. Enough of these faggots",
                "author": "Wrexxis780"
            },
            {
                "raw_content": "Remember this murder? https://en.wikipedia.org/wiki/Killing_of_Justine_Damond",
                "author": "Covfefebrulee"
            },
            {
                "raw_content": "Take over Hati. Turn Hati into a penal colony. Send these people there.",
                "author": "ThorsonTT"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING - Prominent DNC shill and “professional MAGA hunter” Ron Smith has been revealed to be Kenyan, despite his claims of knocking on doors for Kamala, contributing to her campaign, and encouraging others to do so.",
        "score": 1123,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Kenya Android App And just because he's in Kenya doesn't mean he isn't voting for Democrats.",
                "author": "TEXinLA"
            },
            {
                "raw_content": "Republicans against Trump is an Austrian account too",
                "author": "America_No_1"
            },
            {
                "raw_content": "Seems like a real hotspot for assholes.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Catturd ™ : Expose them all !!!",
        "score": 474,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It wasn’t some secret that Cheong is Malaysian",
                "author": "xanaxagoras"
            },
            {
                "raw_content": "I choose Alex Jones over Cartturd.",
                "author": "BobDolesBanana"
            },
            {
                "raw_content": "The dipshit plugging X and Elon all day is from India https://x.com/cb_doge",
                "author": "PiratePatriotParrot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Rep. Jasmine Crockett MELTS DOWN, Claims Republicans Are “Defunding the Police” (VIDEO)",
        "score": 752,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm so tired of this thing's retardation.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Why are we so obsessed with this ape?",
                "author": "JoeBidensDementia1"
            },
            {
                "raw_content": "Why do we give a fuck what this sheboon has to say?",
                "author": "TheRPatriot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Nikita Bier (head of product @x): In a couple hours, we'll be rolling out About This Account globally, allowing you to see the country or region where an account is based. And for those in countries where speech has penalties, we've included privacy toggles to only show your region.",
        "score": 1080,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Indian and Pakistani pretenders in shambles.",
                "author": "raptoris1"
            },
            {
                "raw_content": "I have been seeing accounts freaking out over this. Major dem accounts. \"Signed up in Canada / Europe\" Major 'MAGA' (fake MAGA) accounts signed up in pakistan and india. Its a bloodbath.",
                "author": "DRKMSTR"
            },
            {
                "raw_content": "This will be a game-changer. I'm assuming VPN work-arounds (at least the major ones) will be accounted for and noted in some way.",
                "author": "duehuckleberry"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔴An Iman in South Florida breaks down in TEARS, because people were eating bacon while he was praying.. “After the prayer ended we looked up to see them taunting us in our faces with bacon..”",
        "score": 1142,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Go home faggot.",
                "author": "Websitesdown"
            },
            {
                "raw_content": "Clearly, he’s never had a bacon cheeseburger before or a barbecued pulled pork sandwich!",
                "author": "Trooph-Hurts"
            },
            {
                "raw_content": "He worships a faggot pedophile and he is one, too.",
                "author": "EDDIT_IS_CUCKED"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: The United States is poised to launch a new phase of Venezuela-related operations in the coming days — Reuters Multiple airlines cancel flights to Venezuela after US warns of threats — industry group",
        "score": 912,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm fine with blowing up narco-terrorists but this is just dumb if true.",
                "author": "berserkerbarrage"
            },
            {
                "raw_content": "thanks for the heads-up?",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "What's the end goal here? Is it really about the drugs or are we going after their oil?",
                "author": "PeaceMakerDJT"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "TRUMP: Massive crime and rioting in the Chicago Loop area. Multiple Police Officers attacked and badly injured. 300 people rioting, 6 victims shot, one critical and one DEAD. ... The people are chanting, BRING IN TRUMP!!!",
        "score": 1273,
        "text_content": "",
        "comments": [
            {
                "raw_content": "send in Animal Control 🐿️🐒",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Multiple livestreams here: Chicago, NC, DC, Portland: https://www.youtube.com/watch?v=uyswFodZfuQ",
                "author": "Cuetardian"
            },
            {
                "raw_content": "Trump's Truth: https://truthsocial.com/@realDonaldTrump/posts/115595274389789024",
                "author": "TheGreatWhiteNorth"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This week, the Department of Homeland Security (DHS), announced U.S. Immigration and Customs Enforcement (ICE) arrested 3,593 criminal illegal aliens in Houston, Texas alone during the six weeks of the Democrats’ shutdown, including pedophiles, gang members, and murderers.",
        "score": 976,
        "text_content": "",
        "comments": [
            {
                "raw_content": "~86 per day not the flex they think it is by the way - how many deportations have there been? why do they never tell us deportation numbers - hard numbers, not estimates of self-deports.",
                "author": "perma-maga"
            },
            {
                "raw_content": "Because they only take the man and leave the woman and 6 kids... then the man comes back thru the border if hes even deported..",
                "author": "EvilGreed209"
            },
            {
                "raw_content": "That's cool and all, but having grown up around Houston I can guarantee there are a fucking lot more than 3600 illegal aliens there.",
                "author": "someguy7738"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ASML offered to spy for U.S. after breaking export ban to China in 2023, book claims",
        "score": 164,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So this is the reason China is rejecting the deals?",
                "author": "TK3600"
            },
            {
                "raw_content": "Wow I bet all the ASML employees laid off due to loss of sales will be proud that the loss of their jobs at least made the US president feel a bit better about maybe slowing down Chinese chip development a bit. You know you're \"winning\" when you model your economic strategy on a Tonya Harding-style kneecapping of your competition. Fair competition is for chumps!",
                "author": "JakeTappersCat"
            },
            {
                "raw_content": "I kind of hate writers that use abbreviations and acronyms, when they must realize.....not everyone will be familiar with the acronym abbreviation or in this case corporate name.",
                "author": "Liesthroughisteeth"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Discontinuation of ARM Notebook with Snapdragon X Elite SoC",
        "score": 159,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Completely expected. Qualcomm just doesn't seem that interested in supporting linux. Which makes me wonder what the software support (especially gpu drivers and hw accelerated video decode) looks like on the steam fame. I have a feeling they are going to rely on third party developed mesa drivers without much (if any) official support from qcom",
                "author": "MMyRRedditAAccount"
            },
            {
                "raw_content": ">Development turned out to be challenging due to the different architecture, and in the end, the first-generation X1E proved to be less suitable for Linux than expected. In particular, the long battery runtimes—usually one of the strong arguments for ARM devices—were not achieved under Linux. A viable approach for BIOS updates under Linux is also missing at this stage, as is fan control. Virtualization with KVM is not foreseeable on our model, nor are the high USB4 transfer rates. Video hardware decoding is technically possible, but most applications lack the necessary support.",
                "author": "ExeusV"
            },
            {
                "raw_content": "Qualcomm did not seem to want Linux on those things, for whatever reason. Of course they've been poor sellers in general even when running Windows, steep discounting and high return rate for the big brands.",
                "author": "jenny_905"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Advice To Become A PC Hardware Assembler/ Technician",
        "score": 0,
        "text_content": "I tried to search under this reddit group for previous posts in regards to my title and I couldn't find one that's recent. My sister is looking to go to college, and has mentioned how much she loves putting computers together. I used to do side gigs building custom PCs over 10 years ago, and some software services. She has NO interest in anything to do with software. Simply hardware building computers. Would there be specific certificates or degrees she would need? Or what kind of jobs/careers titles to look for? Thanks!!",
        "comments": [
            {
                "raw_content": "It's generally a pretty poorly paid job so it seems unlikely. You didn't specify which country you live in so that probably means your American? But it helps when asking these questions.",
                "author": "Logical_Strain_6165"
            },
            {
                "raw_content": "Hello! It looks like this might be a question or a request for help that violates [our rules](http://www.reddit.com/r/hardware/about/rules) on /r/hardware. If your post is about a computer build or tech support, please delete this post and resubmit it to /r/buildapc or /r/techsupport. If not please click report on this comment and the moderators will take a look. Thanks! *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "electrical engineering is the closest 'hardware' type university degree i can think of.",
                "author": "A5M"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Self-destructing portable SSD built to torch sensitive data",
        "score": 36,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">On the top surface of the drive, there’s a switch that you can use to initiate the kill process. To make sure you don’t trigger it by accident, you must perform a two-step process. First, you must slide the switch forward, revealing a red warning strip. Then you must press the switch down, after which point your drive will no longer be a functional piece of kit. Might as well just buy a regular SSD and throw it on a stove when the feds come knocking.",
                "author": "GenZia"
            },
            {
                "raw_content": ">There’s one key limitation to the destruction process. You need to have the drive plugged into the USB port of a PC or Mac to initiate it Is that not stupid? Couldn't you physically crush the chip instead?",
                "author": "vegetable__lasagne"
            },
            {
                "raw_content": "You could just make a ram-disk with battery backup that retains the data and a switch to disconnect the power to wipe it.",
                "author": "hurubaw"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "It was so surreal to finally play Metroid Prime 4! Demo at Walmart!",
        "score": 542,
        "text_content": "It was so sharp, so smooth, felt great to play. I’m so much more hyped for this game!",
        "comments": [
            {
                "raw_content": "Honey? Are you sure we didn't need anything from Walmart immediately?",
                "author": "CalypsoSauvin"
            },
            {
                "raw_content": "Is it the same demo of the opening 20 minutes with Samus at the Galactic Federation base that they showed at the Switch 2 events/PAX? Or is it a new demo/build?",
                "author": "MarvelManiac45213"
            },
            {
                "raw_content": "Let me download it wtf",
                "author": "RealCoolDad"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "A few selected stores already have Metroid Prime 4 demo kiosks.",
        "score": 421,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is the demo out?",
                "author": "Tebasaki"
            },
            {
                "raw_content": "I played it earlier today. Looked and played great! Super excited for it.",
                "author": "Steve_o_3000"
            },
            {
                "raw_content": "Cool.",
                "author": "_Tezzla_"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "New NS2 user, need tips and advices",
        "score": 455,
        "text_content": "Hello everyone! I just got my first ever Nintendo Switch 2 🥰 YAAAY! 🥳 Can I ask for your tips and advices on how can I maximize and take care my Switch 2, so that it can last longer and be able enjoy for a long time 🥺🥺🙏🙏 Looking forward for your suggestions 😍😍",
        "comments": [
            {
                "raw_content": "Do not put peanut butter in your switch. I repeat: Do NOT put peanut butter in your switch!",
                "author": "Malabingo"
            },
            {
                "raw_content": "Get a screen protector. They are very inexpensive. I've seen multiple reports of Switch 2 screens getting scratched by simply putting them in the dock.",
                "author": "me_not_at_work"
            },
            {
                "raw_content": "No clue about how to take care of it as best as you can so Ill just say if this is your first switch console then you gonna have a great time with it. Oh and set it so it never charges to 100% or something",
                "author": "mowgleeee"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Kirby Air Riders can go extremely hard, I just say",
        "score": 259,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“Akira” reference in case someone doesn’t know.",
                "author": "Futaba800"
            },
            {
                "raw_content": "That is Rick-diculous! Lmao!",
                "author": "NahumGardner"
            },
            {
                "raw_content": "Rick being a playable character is the best!",
                "author": "lemontrout85"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I Tried To Create A List Of All The Full Physicals Confirmed For Switch 2",
        "score": 142,
        "text_content": "This is not meant for people to get into arguments or anything this is purely to help those who care about it! Link if you want: https://docs.google.com/spreadsheets/d/1EbGHsJjxt4VrpD8_0jPZn2JMB7WNz945S1hFgfXWddg/edit?usp=drivesdk",
        "comments": [
            {
                "raw_content": "Very informative, thank you",
                "author": "Caciulacdlac"
            },
            {
                "raw_content": "What about harry potter?",
                "author": "chicago_rusty"
            },
            {
                "raw_content": "(Looks at list) Man, I would be missing out on a lot of games if I stuck to that list. Good thing I have zero issues with key cards or digital games. So the list is usefull regardless what side your on with this issue.",
                "author": "Garamenon"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Best games on NSO classics",
        "score": 26,
        "text_content": "Exactly what the title says! What are your must plays for any Nintendo fan from the various classic consoles available on Switch 2? I have humongous gaps in my Nintendo gaming history! Also, what are the best JRPGs that are available on these emulators?",
        "comments": [
            {
                "raw_content": "In answer to your first question, Super Mario World.",
                "author": "-Trippy"
            },
            {
                "raw_content": "Off the top of my head the ones I consider absolute must plays are: Super Mario World 3, Super Mario World, Yoshi’s Island, Super Metroid, The Legend of Zelda A Link to the Past, Earthbound, Metroid Zero Mission, Metroid Fusion, Golden Sun, Golden Sun The Lost Age, Super Mario 64, The Legend of Zelda Ocarina of Time, The Legend of Zelda Majora’s Mask, Banjo Kazooie, and The Legend of Zelda Wind Waker.",
                "author": "Outrageous_Meet2025"
            },
            {
                "raw_content": "If you have friends to play with, Mario super strikers is so much fun on the GameCube",
                "author": "Shrekboy555"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Donkey Kong Bonanza, final boss",
        "score": 74,
        "text_content": "Without spoiling for anyone.. Bloody hell it's sooo difficult!!! It got me pulling my hair out, had to come off the game and rant here argggghhhhhhhhh",
        "comments": [
            {
                "raw_content": "Probably my favorite boss fight ever out of Zelda Mario or DK. It was so well thought out and I wish there were some post game boss fights that make you switch between the Bananza powers like that one. Soulsborne games definitely helped prepare me for that one, but I feel you, it still took quite a few tries!",
                "author": "Boulder-Bear"
            },
            {
                "raw_content": ">! Just use the elephant bananza to suck up any terrain that's in your way, and the kong bananza to punch the Canon balls back at him. !< >! When the stage is about to be filled with the harmful goop, punch one of the Canon balls to create a type a platform you can stand on. Then shoot a a terrain ball from the elephant to turn the goop to gold so you can actually stand on it. !< I beat the boss pretty easily this way.",
                "author": "CANfilms"
            },
            {
                "raw_content": "Abuse the elephant bananza. It’s a very easy fight when you know what you’re doing.",
                "author": "UTDroo"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Colin Moriarty: Intergalactic reportedly content-complete, possible TGA Appearance, potential launch in 2026",
        "score": 522,
        "text_content": "EDIT: Jason Schreier [commented](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1p3zwoe/comment/nq8f5f9/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button): \"Can assure you that Intergalactic is not coming out in 2026.\" EDIT 2: Jeff Grubb [tweeted](https://xcancel.com/JeffGrubb/status/1992314144029036932) \"It will not be shown at The Game Awards\" EDIT 3: My bad, I misunderstood Colin's speculation for a rumor but hey at least we got actual info from Schreier and Grubb as a result. Based on some heated comments I'm guessing this isn't the first time someone misinterpreted Colin's words. Promise it wasn't intentional on my part. At least Naughty Dog fans can rest easy now. Original body text: Info from a recent podcast with Dan Allen. Colin Moriarty said that Intergalactic is basically content-complete and might be present at The Game Awards: \"I believe we'll see it at The Game Awards, I think next year it'll be good to go. Maybe they will delay it, but based on the way they're hiring and also things I'm hearing about people interacting with the game, and they're also hiring for localization now, they're getting into the end, and it's a sign that everything is kinda locked down and content complete. I won't be surprised if it was out this time next year.\" Source: https://youtu.be/oKkiw9KpgKA Skip to 1:09:45",
        "comments": [
            {
                "raw_content": "Where would they slot it in tho? It has to be summer, no way they will squeeze it in between GTA and Wolverine or December. And no way it's gonna be early 2026. This seems like a 2027 game to me though.",
                "author": "ayyybro123"
            },
            {
                "raw_content": "Can assure you that Intergalactic is not coming out in 2026.",
                "author": "jasonschreier"
            },
            {
                "raw_content": "\"Content complete\" no longer means that the game is coming out in the next year. He can be right about that and it still not come out in 2026.",
                "author": "NotTakenGreatName"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Stellar Blade potentially moving beyond PlayStation timed exclusivity for the sequel, according to a job listing",
        "score": 306,
        "text_content": "Shift Up is hiring for a Stellar Blade sequel, listed as a AAA multiplatform title using Unreal Engine 5. The job listing states: \"The next installment of ‘Stellar Blade’, currently under development at Shift Up, is a AAA **multiplatform** action game that expands the world of global hit ‘Stellar Blade’. Aiming for release on **various platforms**, including **consoles and PC**, the game will inherit the stylish action and narrative-driven world of its predecessor, while delivering an evolved action gameplay experience\" Interestingly one of the job openings calls for a \"PC battle designer\". A dedicated PC-centric role this early in development also suggests they might be aiming for a simultaneous launch on PC and consoles. Considering their sales numbers on PC (over 1 mil copies in 3 days) it all lines up quite well. So yeah, looks like they’re moving beyond PlayStation exclusivity for the sequel. Source: [https://shiftup.co.kr/news/news.php?ptype=view&idx=318&page=1&code=news](https://shiftup.co.kr/news/news.php?ptype=view&idx=318&page=1&code=news)",
        "comments": [
            {
                "raw_content": "The main reason that Stellar Blade was a timed exclusive is because Sony made considerable contributions to the project.",
                "author": "Zhukov-74"
            },
            {
                "raw_content": "This game was way better than I expected it to be. It was a pretty enjoyable experience. Very excited for a sequel",
                "author": "The_Lurking_Wanderer"
            },
            {
                "raw_content": "Makes sense. Stellar Blade was actually supposed to be a last-gen multiplatform game including Xbox One, and then after it went radiosilent for a few years Sony agreed to publish it worldwide and get some of the XDev folk to assist in development and marketing for them in exchange for exclusivity. My assumption is that the game doing well has probably afforded Shift Up the opportunity to self-publish going forward I hope they pull a Platinum with Wonderful 101 and get the rights to publish the first game. This would be sick on Switch 2",
                "author": "MyMouthisCancerous"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Arc B390 \"Panther Lake\" iGPU shows promising results in alleged 3DMark tests - VideoCardz.com",
        "score": 9,
        "text_content": "",
        "comments": [],
        "subreddit": "intel"
    },
    {
        "post_name": "Minisforum launches 4.8 liter PC with up to Core Ultra 9 285HX, 256GB RAM, PCIe slot and USB4 v2 - $2899 for highest config",
        "score": 7,
        "text_content": "",
        "comments": [],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel Core Ultra 300 \"Panther Lake\" engineering samples tested and listed for sale - VideoCardz.com",
        "score": 3,
        "text_content": "",
        "comments": [],
        "subreddit": "intel"
    },
    {
        "post_name": "22 November 2025 - Weekly /r/REBubble Discussion",
        "score": 6,
        "text_content": "What's the word on the street? Share your questions, comments, and concerns below.",
        "comments": [
            {
                "raw_content": "We really love a house that is on the market right now, but it is listed at top dollar, even beyond what it should be listed for. And all I keep seeing are job layoffs left and right. If we buy it, I am sure the bubble will burst the day afterwards, lol.",
                "author": "EstateGate"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "America’s huge mortgage market is slowly dying",
        "score": 136,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ain't nobody paying for that, lol Here is a non-paywall version: https://archive.ph/jCvC1",
                "author": "SnortingElk"
            },
            {
                "raw_content": "I, too, pay 460$ a year for the Economist",
                "author": "DIYThrowaway01"
            },
            {
                "raw_content": "There is another way.",
                "author": "Alone_Step_6304"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Bloomingdale's condos are selling at 1990s prices — and some for even less",
        "score": 46,
        "text_content": "Yes, condos in Chicago are selling at 1990s prices due to a stagnant downtown market influenced by the pandemic, crime, and a slow return to office work. One unit sold for $1.3 million in 2025, the same price it sold for in 1999, while another sold for less than its 1989 price.",
        "comments": [
            {
                "raw_content": "Lol im not from Chicago but this came across my feed and here I was thinking 1990’s prices meaning 89k not in the millys",
                "author": "ElCompaJC"
            },
            {
                "raw_content": "HOA fee is 10x what it was in 1990",
                "author": "These-Brick-7792"
            },
            {
                "raw_content": "These condos, not all condos. These were wildly overpriced when they came on the market. But these days no one wants to live in a 6 story mall. Sold prices for condos in Chicago are up 7.1% YOY, and that’s coming on the heels of a 7.6% increase in 2024.",
                "author": "Pitiful-Place3684"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "US Realtors — Want high-quality property videos without filming anything?",
        "score": 1,
        "text_content": "Hey everyone, I run **Thrayi Visuals**, and we help realtors create **premium listing videos** using only your **property photos** — no filming needed. We deliver: * Cinematic property videos * High-converting Instagram reels * AI-presenter listing videos * Quick turnaround + affordable pricing Perfect for agents who want to: * Stand out online * Increase listing inquiries * Save time by outsourcing video work If you want examples or a free sample for your next listing, comment or DM me. Happy to help!",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Dental revolution",
        "score": 2028,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This headline is wildly misleading. What they did is develop a gel that can regrow enamel on existing teeth. Basically a natural way to fill in cavities. Incredible if it actually works (and it would still revolutionize dental care), but it's still not even close to regrowing entire teeth.",
                "author": "NoCard1571"
            },
            {
                "raw_content": "Source?",
                "author": "MasterTheSoul"
            },
            {
                "raw_content": "Devs finally patched it",
                "author": "Moriffic"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Google Brain's reasoning founder",
        "score": 501,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They figured out how to stop \"it's not this, it's really that .. \" syntax. Definitely over.",
                "author": "Thinklikeachef"
            },
            {
                "raw_content": "Liverpool getting beat 3-0",
                "author": "SharpCartographer831"
            },
            {
                "raw_content": "I'm so tired of these cryptic tweets. Probably one of the worst things that evolved from this AI stuff.",
                "author": "Weekly-Trash-272"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini 3 Pro Image (Nano Banana Pro) takes #1 on LMArena with a record breaking +84 point lead over SOTA",
        "score": 110,
        "text_content": "The new LMArena leaderboard update just dropped and the numbers are statistically an outlier. **The Data (Official Breakdown):** **#1 Text to Image** (+84 pt lead) and **#1 Image Edit** (+41 pt lead) Usually, top models fight for a tiny 5-10 point lead (like the constant back and forth grinding between GPT-5.1 and Claude 4.5). A sudden **+84 point jump** is basically unheard of in this benchmark. It looks like Google didn't just inch past the competition, they completely gapped the field on prompt adherence. **The Kicker:** According to DeepMind, this is just the preview. The 2K and 4K resolution versions are coming soon. **Source:** [LMArena Leaderboard](https://lmarena.ai/leaderboard/image-edit) **Anyone here tested it with your own eval sets yet?**",
        "comments": [
            {
                "raw_content": "Fuck, what a come back by google",
                "author": "SharpCartographer831"
            },
            {
                "raw_content": "The list is very accurate, and nano banana pro is thoroughly king. But the door is still wide open for a potential seedream 5 since it'll be the uncensored alternative. Nano banana is on another level now that it has style transfer (amongst many new features).",
                "author": "Cagnazzo82"
            },
            {
                "raw_content": "https://preview.redd.it/fbk1wjinpx2g1.png?width=1080&format=png&auto=webp&s=2cd68869af661b1c4e2296fc24c6f807e4cfe520",
                "author": "TheoreticalClick"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Current Forecast about AGI trajectory",
        "score": 157,
        "text_content": "(MIT expecting between 2028 to 2047 - reports diverse) Here is current chart, singularity probably will happen just after the AGI.(max 5 years later) Source Ray Kurzweil says 2032 (in case 2029 claim): [https://www.wired.com/story/big-interview-ray-kurzweil/#:\\~:text=How%20will%20we%20know%20when,AGI%20is%20here](https://www.wired.com/story/big-interview-ray-kurzweil/#:~:text=How%20will%20we%20know%20when,AGI%20is%20here) All Sources * **When Will AGI/Singularity Happen? 8,590 Predictions Analyzed** [https://research.aimultiple.com/artificial-general-intelligence-singularity-timing/](https://research.aimultiple.com/artificial-general-intelligence-singularity-timing/) * **MITTR ArmEBrief V12 Final | Artificial Intelligence | Intelligence (AI) & Semantics** [https://www.scribd.com/document/906742806/MITTR-ArmEBrief-V12-Final](https://www.scribd.com/document/906742806/MITTR-ArmEBrief-V12-Final) * **Anthropic’s Recommendations to OSTP for the U.S. AI Action Plan** [https://www.anthropic.com/news/anthropic-s-recommendations-ostp-u-s-ai-action-plan](https://www.anthropic.com/news/anthropic-s-recommendations-ostp-u-s-ai-action-plan) * **What's up with Anthropic predicting AGI by early 2027? — LessWrong** [https://www.lesswrong.com/posts/gabPgK9e83QrmcvbK/what-s-up-with-anthropic-predicting-agi-by-early-2027-1](https://www.lesswrong.com/posts/gabPgK9e83QrmcvbK/what-s-up-with-anthropic-predicting-agi-by-early-2027-1) * **The Intelligence Age (Sam Altman)** [https://ia.samaltman.com/](https://ia.samaltman.com/) * **Google leaders Hassabis, Brin see AGI arriving around 2030** [https://www.axios.com/2025/05/21/google-sergey-brin-demis-hassabis-agi-2030](https://www.axios.com/2025/05/21/google-sergey-brin-demis-hassabis-agi-2030) * **Google DeepMind CEO Demis Hassabis: The Path To AGI, LLM Creativity, And Google Smart Glasses** [https://www.bigtechnology.com/p/google-deepmind-ceo-demis-hassabis](https://www.bigtechnology.com/p/google-deepmind-ceo-demis-hassabis) * **The case for AGI by 2030 — EA Forum** [https://forum.effectivealtruism.org/posts/7EoHMdsy39ssxtKEW/the-case-for-agi-by-2030-1](https://forum.effectivealtruism.org/posts/7EoHMdsy39ssxtKEW/the-case-for-agi-by-2030-1) * **Tesla's Musk predicts AI will be smarter than the smartest human next year | Reuters** [https://www.reuters.com/technology/teslas-musk-predicts-ai-will-be-smarter-than-smartest-human-next-year-2024-04-08/](https://www.reuters.com/technology/teslas-musk-predicts-ai-will-be-smarter-than-smartest-human-next-year-2024-04-08/) * **Elon Musk timelines for singularity are very short** [https://www.reddit.com/r/Futurology/comments/1kpj59z/elon\\_musk\\_timelines\\_for\\_singularity\\_are\\_very/](https://www.reddit.com/r/Futurology/comments/1kpj59z/elon_musk_timelines_for_singularity_are_very/) * **Nvidia CEO says AI could pass human tests in five years | Reuters** [https://www.reuters.com/technology/nvidia-ceo-says-ai-could-pass-human-tests-five-years-2024-03-01/](https://www.reuters.com/technology/nvidia-ceo-says-ai-could-pass-human-tests-five-years-2024-03-01/) * **If Ray Kurzweil Is Right (Again), You’ll Meet His Immortal Soul in the Cloud | WIRED** [https://www.wired.com/story/big-interview-ray-kurzweil/](https://www.wired.com/story/big-interview-ray-kurzweil/) * **\"Godfather of artificial intelligence\" weighs in on the past and potential of AI – CBS News** [https://www.cbsnews.com/news/godfather-of-artificial-intelligence-weighs-in-on-the-past-and-potential-of-artificial-intelligence/](https://www.cbsnews.com/news/godfather-of-artificial-intelligence-weighs-in-on-the-past-and-potential-of-artificial-intelligence/) * **Ultraman's Surprising U-Turn: MIT Predicts 50% Chance of AGI Arrival in 2028** [https://eu.36kr.com/en/p/3422324084018819](https://eu.36kr.com/en/p/3422324084018819)",
        "comments": [
            {
                "raw_content": "So much arguing about whether it’s 2030 or 2050. Regardless, probably 90% of people alive today will see it. I’m 67 and expect to see it. No one seems to be arguing it’s 100 years to never anymore.",
                "author": "KidKilobyte"
            },
            {
                "raw_content": "Anthropic CEO says 2026 but Anthropic models have been underwhelming",
                "author": "vasilenko93"
            },
            {
                "raw_content": "Wasn't Hassabis more ''realistic'', I didn't expect him to say ASI by 2030, if that's his prediction then AGI must come by end of next year or early 2028 Edit: Ok so the graph title may say Generalised Superintelligence, but the left is AGI, not ASI, makes more sense.",
                "author": "Daskaf129"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The data on which Gemini 3 was trained is really crazy",
        "score": 99,
        "text_content": "I almost even want to say that it's THE great strength of the model. It has a quality of precision on an enormous amount of specialized subjects that I've honestly never seen elsewhere. It finds answers to a multitude of questions whose answers are not accessible online and through public data. And it's even capable of going to get me the source. It's an LLM so there's always hallucination but the share of it is starting to be really increasingly small. It's capable of going to find numbers and stats that only exist in 3 articles all non-public. It's impressive. No idea if Google Docs, internal university libraries or others were used, but in + of the computing power that no competitor possesses Google has the best starting material to go collect data to design AIs. It's almost day and night going back to GPT-5.1 on precision questions, and I didn't even think I'd say that 5 days ago. What a crazy world!",
        "comments": [
            {
                "raw_content": "Incredibly hard to beat Google at data.",
                "author": "sdmat"
            },
            {
                "raw_content": "What's the current consensus on its tendency to hallucinate compared to other models?",
                "author": "CausalDiamond"
            },
            {
                "raw_content": "this is a rumor but I think gemini 3 is also a huge mixture of experts, at least 5 trillion parameters in total",
                "author": "Evening_Archer_2202"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"As Google pulls ahead, OpenAI's comeback plan is codenamed 'Shallotpeat'\"",
        "score": 392,
        "text_content": "[https://the-decoder.com/as-google-pulls-ahead-openais-comeback-plan-is-codenamed-shallotpeat/](https://the-decoder.com/as-google-pulls-ahead-openais-comeback-plan-is-codenamed-shallotpeat/) \"What's interesting is the role that pre-training played in Google's success. In his note, Altman admitted that Google has \"been doing excellent work recently,\" especially in pre-training. This fundamental phase, where an AI model learns from vast amounts of data, seemed to have hit its limits. But Google's success shows that while massive performance leaps may not be on the immediate horizon, effective advantages can still be gained.... ...In response to Google's progress, Altman assured his staff that OpenAI would catch up. A new language model codenamed \"Shallotpeat\" is currently in development. According to a person familiar with the matter, this model specifically aims to fix bugs that have occurred in the pre-training process.... ...Altman stressed that he wants to focus on \"very ambitious bets,\" even if it means OpenAI gets \"temporarily behind in the current regime.\" These bets likely include automating AI research itself to accelerate breakthroughs. \"We need to stay focused through short-term competitive pressure,\" Altman said in the memo. He added that it's \"critically important\" for the majority of the research team to stay focused on achieving superintelligence.\"",
        "comments": [
            {
                "raw_content": ">These bets likely include automating AI research itself Are they going to use Gemini?",
                "author": "WafflePartyOrgy"
            },
            {
                "raw_content": "My read is that Gemini 3 pro's gains in simpleQA show that it's a *massive* model, absolutely huge, with tons of parametric knowledge. That scalar still exists for sure, it's just really expensive. Google uses its own TPU hardware to not only infer but also train so they can afford to do it. But gemini 3 pro isn't a giant leap forward, it's just a much improved 2.5 pro, same knowledge cutoff. It isn't the fruit of all the google research papers like titans, alphaevolve, nested learning, etc.",
                "author": "jakegh"
            },
            {
                "raw_content": "yup, Google has access to a lot of training data, no doubt about it. Wonder how much of that is google docs Lol, who needs China when you have capitalism: \" \"We need to stay focused through short-term competitive pressure,\" Altman said in the memo. He added that it's \"critically important\" for the majority of the research team to stay focused on achieving superintelligence.\" Meanwhile, Anthropic: \"hey wait for me guys!\"",
                "author": "kaggleqrdl"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Anyone's experience with Gemini not matching the hype?",
        "score": 31,
        "text_content": "Have been throwing some fairly standard tests at it and it's not matching some of the hype-y posts I've been seeing on social media.",
        "comments": [
            {
                "raw_content": "I hate geminis confidence in being incorrect. You can correct it but it'll go \"oh sorry\" and then double down. Chatgpt doesn't seem to double down on a wrong train of though and pivots to try and be better. It's the main reason I stopped using gemini",
                "author": "Eisegetical"
            },
            {
                "raw_content": "Yeah, still unusable as a lawyer for me at least. But it's getting better quickly. https://g.co/gemini/share/fd68a2c38f31",
                "author": "Joey1038"
            },
            {
                "raw_content": "you asked it in nano banana... you need to use 3 Pro Thinking and upload the image there... total different ways to analyse an image.... for picture analysis you need to open a new window with Gemini 3 Pro Thinking selected and upload it as file (do **not** activate picture mode or something, then the generator engine for bananba will analyse)... everything within nano banana will be interpreted for further picture changes",
                "author": "ecnecn"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Using Nano Banana Pro to visualize “What If” scenarios like these is damn fun.",
        "score": 321,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Funnily enough, there's a minor scandal on The Boys subreddit right now from someone using nano banana to generate fake \"leaked\" screenshots of the next season of the show, where tons of people on the subreddit and Twitter fell for it and then found out they were AI. The amount of people still somehow unaware of the capabilities of AI is truly a sight to behold. The faster people get onboard with the reality that we now live in a post-truth society, the better. We are in \"don't believe your lying eyes\" territory.",
                "author": "Techwield"
            },
            {
                "raw_content": "https://preview.redd.it/q6k6k0xceu2g1.png?width=1024&format=png&auto=webp&s=15f5f3c46012886c2c32b29cdd8684a7ccc50e73 That's awesome - I'm surprised it lets us create stuff like this! When video gen is improved and can create an entire fight scene fans are gonna go nuts.",
                "author": "FakeTunaFromSubway"
            },
            {
                "raw_content": "Yeah I'll take one samus and master chief team up game please",
                "author": "bcuziambatman"
            }
        ],
        "subreddit": "singularity"
    }
]