[
    {
        "post_name": "Watching Keith Ellison getting gutted like a perch by Josh Hawley is deliriously great fun.",
        "score": 873,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Then they all went to lunch together and laughed over a bottle of wine and 1000 dollar steaks.",
                "author": "cjcivicx"
            },
            {
                "raw_content": "I want them in prison and tried for treason.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "Rand Paul acting like a pearl clutching faggot around 4:45. What a total piece of worthless shit he is. Just like his dad and Massie.",
                "author": "Bldg_2019"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "King Solomon says Fulton County event in Arizona coming",
        "score": 778,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fuck that stupid glasses bitch katie hobbs. Or dont because she is a piece of shit like whitmer the \"respect\" cunt.",
                "author": "ConfederateFather"
            },
            {
                "raw_content": "It's the TWO MOAR WEEKSAPALOOZA",
                "author": "chickeninoven"
            },
            {
                "raw_content": "“King” Solomon? Lmao Give me a fucking break",
                "author": "Double_D"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Donald Trump's $10B lawsuit against the BBC has been scheduled for February 2027. The Judge has DENIED the BBC's attempts to get the claim dismissed! Pray that the BBC goes BANKRUPT… 🔥",
        "score": 202,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TRUMP deserves every penny of that 10 billion dollars",
                "author": "PatrickCollinsTN"
            },
            {
                "raw_content": "The untold part of this story is that the BBC is taxpayer funded, and it is the citizens of Britain who will pay out, not the tools who did the deed.",
                "author": "UNfreeNewZealand"
            },
            {
                "raw_content": "FFFFAFO!! https://x.com/i/status/2021982817283121497",
                "author": "catsfive"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Ron DeSantis hints at a 2028 presidential run, saying that he can preserve the Trump voter base.",
        "score": 144,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hahahahaha JD Vance or Rubio will get it.",
                "author": "Kolob64"
            },
            {
                "raw_content": "That's a big fuck no Meatball. Call Bill Mitchell and ask him what he thinks once he gets finished polishing BBs nutsack.",
                "author": "Mulletgunning"
            },
            {
                "raw_content": "# TRUMP 2028",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "CALL AN AMBULANCE",
        "score": 1283,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Their voters have no problem signing up to HUD and EBT, though.",
                "author": "MythArcana"
            },
            {
                "raw_content": "They also like to argue Republican states get more welfare than Democrat, but they don't like the idea of ending welfare and going back to charity like pre-1930's.",
                "author": "Burning"
            },
            {
                "raw_content": "Amber lamps! Amber lamps! Sum'body gots ta call duh amber lamps!",
                "author": "donkeyKang"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Diesel engines for everyone",
        "score": 882,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hell FUCKING YES # 6BT SWAPPED GEO METRO HERE WE FUCKING COME",
                "author": "ConfederateFather"
            },
            {
                "raw_content": "NO MORE DEF!!!!!!",
                "author": "DrewPBalls"
            },
            {
                "raw_content": "Bring back the 50mpg VW diesel Jettas!",
                "author": "bill_in_texas"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Relations between Venezuela and the United States have been, to put it mildly, extraordinary!",
        "score": 862,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Who tf is Harry Sargeant?",
                "author": "Modernturnkey"
            },
            {
                "raw_content": "Yes well when you remove their leader and put your Secretary of State in charge of their government, that tends to help things.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Logan Act. Take this guy out with it as a warm up for Hillary being over across the pond doing similar stuff.",
                "author": "Taqiyya_Mockingbird"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trucks of ballots arrived from Runbeck for over a week after Arizona's 2020 election. A worker testified ballots kept coming after Nov. 10 via front and back doors, with unknown quantities or origins, despite access to voter books.",
        "score": 1253,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’ve been calling out Runbeck since 2020. They are chock full of Trump haters. Fuck just the big fish, we need destroy the lives of the minnows in this school of rotten fish.",
                "author": "BallsackPaneer"
            },
            {
                "raw_content": "Trump won",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Arrest Katie Hobbs...",
                "author": "JtBlaze"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "RACING TO PASS THE 'SAVE ACT",
        "score": 998,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Where's the CCP insignia on that shell? Huh? HUUUUHHHH???",
                "author": "ConfederateMother"
            },
            {
                "raw_content": "Anyone against the SAVE act is a traitor and should be treated as such. Without secure elections, we have no country.",
                "author": "cjcivicx"
            },
            {
                "raw_content": "Link to Ben Garrison cartoon https://grrrgraphics.com/pass-the-save-act/",
                "author": "I-am-Orlando"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "IT'S \"GUNPERSON \"",
        "score": 1145,
        "text_content": "",
        "comments": [
            {
                "raw_content": "kek we should be more proactive with this tranny problem",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Gunma’am",
                "author": "Wrexxis780"
            },
            {
                "raw_content": "Wait, did the Tranny have a KRISS Vector?",
                "author": "Lord_Karius"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "California ‘at a breaking point’ lawmaker cries, as gas prices surge again after more refinery closures",
        "score": 1044,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If they ended welfare California would be a ghost town. Its such a fake economy built on scams and drug money shit might as well be Mexico.",
                "author": "EvilGreed209"
            },
            {
                "raw_content": "They cry out in pain as they charge you at the pump!",
                "author": "Exsultate"
            },
            {
                "raw_content": "Play stupid games, win stupid prizes.",
                "author": "RuprechtThaMonkeyBoy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Drug tents are now popping up across Zohran Mamdani’s NYC, with drugs being sold openly, prices boldly displayed, and police doing nothing.",
        "score": 951,
        "text_content": "",
        "comments": [
            {
                "raw_content": "NYC gets what it fucking deserves. Bet your bottom dollar that the city is off of international terrorists' target lists because, should something happen, no one will give a shit.",
                "author": "seeling0"
            },
            {
                "raw_content": "What would people want the police to do . They legalize drugs and no bail and minimum sentences. Mandouche hates the PD and will never support them when the shit hits the fan. NYC the new liberal shit hole experiment.",
                "author": "aqua27"
            },
            {
                "raw_content": "weed dispensers?",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Once they get inside the DC bubble, they don't give a shit what their constituents think.",
        "score": 1312,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“Democrat politicans are openly opposing the will of the people.” So are Republicans",
                "author": "leakmouth"
            },
            {
                "raw_content": "Oh shut the fuck up transgender urkel",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Give her time to axe her Black constituents how they feel about Voter ID.",
                "author": "Comanche_Moon"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Elon Musk: Only two more senators and America gets a new lease on life.",
        "score": 1757,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Just abolish the virtual filibuster. Force real filibusters. That is way it was always done.",
                "author": "dataonly"
            },
            {
                "raw_content": "I fucking hate congress. The easiest decision in their life and they drag this shit out to the last day for attention.",
                "author": "FatigueIsReal"
            },
            {
                "raw_content": "Taking filibuster. We only need 50 votes. Vance breaks the tie",
                "author": "Juzeza"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "We Have Now Reached \"Gunperson\"-Level Absurdity",
        "score": 984,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Troontifa",
                "author": "iteachfuckinscience"
            },
            {
                "raw_content": "trannies are psycho",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "The left is more concerned about making sure the shooter has the right pronouns than they are about the victims. That’s how absurd we’ve become.",
                "author": "Filo76"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "absolute legend 🐐",
        "score": 320,
        "text_content": "",
        "comments": [
            {
                "raw_content": "pretty happy with brave tbh",
                "author": "Raetchel"
            },
            {
                "raw_content": "Forgot that he survived a cancelation attempt. For about 1 minute the most blue haired nose rings gawked at my choice of browser on zoom calls. Now no one bats an eye. Goat for sure.",
                "author": "Aisle-is-closed"
            },
            {
                "raw_content": "So if I YouTube on brave I shouldn't have to pay for ad free? Shit",
                "author": "Songofsixpence"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A federal judge has just BLOCKED SecWar Pete Hegseth from disciplining or demoting seditious Dem Sen. Mark Kelly after Kelly urged OPEN REBELLION within the Armed Forces.",
        "score": 1375,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The judge has no standing.",
                "author": "AnnieMm"
            },
            {
                "raw_content": "Okay a lot of people saying no standing but I want to be more specific: military conduct is dictated by the uniformed code of military justice (ucmj). This literally supersedes the constitution as far as how it is applied. When I was in the armed forces, I did NOT have a first amendment right. I couldn’t protest with a uniform on, etc. As a veteran, you do get a lot of rights back but if someone wanted to demote me, they could. If I had an issue with that, it needed to be taken up in a military court because civilian courts didn’t have jurisdiction. Even bases (or embassies) within a place do not follow those laws. This is bullshit.",
                "author": "ThisTrainHasNoBrakes"
            },
            {
                "raw_content": "Judge has no standing.",
                "author": "Grindelwald"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Ai: Trust me Bro",
        "score": 931,
        "text_content": "",
        "comments": [
            {
                "raw_content": "My favorite is when it says \"ackshyually what you said is false\" and then throws a bunch of semantics at you that admits you were right.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "That was like a 3 second sticky",
                "author": "PapaPepe"
            },
            {
                "raw_content": "confused gandalf here. eli5",
                "author": "leakmouth"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "CNN 'Circling the Drain' As Warner Buyout Heats Up",
        "score": 925,
        "text_content": "",
        "comments": [
            {
                "raw_content": "CNN might be \"circling the drain\" after losing two-thirds of its primetime audience in recent years, and with rival offers from Netflix and Paramount for the network's parent company adding to the uncertainty. \"The decrease, from roughly 1.3 million in 2016 to 553,000 now,\" the Daily Mail reported Wednesday, fueled \"rumors of a possible network sale. Elon should buy it for a bargain, walk into CNN HQ with a sink and fire everyone except Scott Jennings.",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "I don't want to spend the man's money for him, but if CNN goes on the block it would be an interesting opportunity for Elon Musk to expand his news empire.",
                "author": "LostElf"
            },
            {
                "raw_content": "CNN is elder abuse.",
                "author": "Get_Off_Big_Tech"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "EU officials just voted to declare that biological men are WOMEN if they identify as such... The EU should be abolished. Nations should IMMEDIATELY EXIT THE EU! Enough of this Insane BS!",
        "score": 1419,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"If they can make you believe absurdities, they can make you commit atrocities.\" -- Voltaire https://x.com/EricLDaugh/status/2021989127634530600?s=20",
                "author": "Capoditutticapi1"
            },
            {
                "raw_content": "I'm tired of stupid women.",
                "author": "MythArcana"
            },
            {
                "raw_content": "I can't help but notice how quickly the West has fallen since women attained more and more political power.",
                "author": "drattastic1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "64GB of DDR5 RAM now costs more than a MacBook Air - memory prices have surged 300% in just six months",
        "score": 974,
        "text_content": "Prices jumped another 50% in the last month alone.",
        "comments": [
            {
                "raw_content": "DIY is hit proportionally the worst of any of these markets because they don't have long term contracts and large inventories like OEMs, so the shortage's impacts on prices are most evident here. 64GB might be more than a MBA in DIY, but it's not costing Dell that much to put 64GB in their prebuilts / laptops. Of course OEMs are gonna raise price in response to the DIY shortage because they don't want to rapidly deplete their inventory for resellers looking to arbitrage, but not to the same degree that DIY price hikes are seeing.",
                "author": "soggybiscuit93"
            },
            {
                "raw_content": "In the UK used prices are dropping. You can get 64GB kits for under £400",
                "author": "gusthenewkid"
            },
            {
                "raw_content": "6 months ago I felt like I was being ridiculous. I bought 96GB DDR5 for a bit under $200 for a NAS. It felt like overkill but I wanted to future proof so I'd never think about it again in the next few years. I also bought 64GB DDR4 for my desktop. Same story. I felt like I was being stupid and wasteful. Future proofing is stupid and there's no immediate utility for most of what I bought. I mean... surely in the future memory prices would go down as they generally do and this was just overkill. I was doing it solely because I was really busy and the thought of upgrading RAM was nagging at my mind... I wanted to focus on more important things. At today's prices, I would not upgrade. There's no way I'd buy 160GB of RAM. There's just no value in it. So anyway I have a bunch of DDR4 RAM now that I have lying around going unused...",
                "author": "Intrepid_Lecture"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD surpasses 40% server CPU revenue share for the first time",
        "score": 700,
        "text_content": "> showing the company reached 41.3% server CPU revenue share. It is the first time AMD’s server revenue",
        "comments": [
            {
                "raw_content": "36.4% desktop unit share is actually much higher than I’d have expected, and with higher ASP resulting in 42.6% revenue share, given desktop chiplet ryzen’s lack of penetration in the tier 1 OEMs. Dell/HP/Lenovo’s AMD desktops are largely still 8000G series, I can’t imagine that would have high ASP. I wonder how desktop and mobile are counted. A mini pc or an AIO with a mobile SoC and LPDDR ram, and is essentially under the bonnet a laptop without a battery, is that counted as desktop or mobile?",
                "author": "996forever"
            },
            {
                "raw_content": "Its incredible how vast the chasm is between their CPU and GPU divisions. CPUs dominate, GPUs are borderline abandonware",
                "author": "_OVERHATE_"
            },
            {
                "raw_content": "It's amazing that Intel still has 63.6% of the unit share.",
                "author": "BarKnight"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "MSI RTX 5090 LIGHTNING officially priced at $5090.99, but to buy one gamers need to enter a draw",
        "score": 87,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You need to enter a lottery to get the chance to purchase a $5100 GPU. That's ridiculous, and I'm sure these will sell out immediately.",
                "author": "nhc150"
            },
            {
                "raw_content": ">MSI’s UK social account has posted a teaser on X saying “The wait is almost over. Tomorrow.” alongside lightning emojis and a prompt asking followers to guess what is coming. The post strongly points to an update on the GeForce RTX 5090 LIGHTNING line on February 13 >LIGHTNING is MSI’s halo-class graphics card line, built as a showcase product rather than a mainstream retail model. MSI has already said the RTX 5090 LIGHTNING will be produced in a strictly limited run of 1,300 units worldwide, each individually serialized. >A Taiwan retailer listing also claims Taiwan is allocated 100 units out of the 1,300, with sales handled through tightly controlled channels rather than broad availability. Today, MSI US also confirmed there’s a draw for this card and received an official price of $5090.99. >The price tag sounds insane, but what’s even more insane is that there is a lottery that will kindly let you purchase these graphics cards.",
                "author": "InsaneSnow45"
            },
            {
                "raw_content": "I just don't understand who is buying this. And I don't mean \"why is it so expensive\". There will always be people who don't care about price at all. This is 5000 dollars for a 5090 when you could buy the RTX pro 6000 and get a waterblock and it would be better than this. If you are really going to go all the way might as well get the actual full die and tons of vram. I would rather pay 8k for the Rtx pro and a waterblock then 5k for this. As soon as the 6090 comes out this will be worth like a few hundred more than a FE 5090 but an RTX pro will still probably be worth like 5 or 6 grand just because of the vram.",
                "author": "Swaggerlilyjohnson"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung said to gain 8nm orders in Europe as 2nm plan advances",
        "score": 10,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Exclusive: First look at Lenovo ThinkPad X13 Detachable, the \"thinner\" ThinkPad makes a comeback after two years",
        "score": 14,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Meh, why won’t anyone make something more interesting like a surface book",
                "author": "cabbeer"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Memory hoarding and skyrocketing prices hit entry-level electronics demand, foundry orders — China's top chipmaker points to supply chain pressures squeezing out consumers",
        "score": 81,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's the goal. Stop consumers from owning hardware",
                "author": "CaptainDouchington"
            },
            {
                "raw_content": "I don’t know whether to buy my second laptop before it’s too late?",
                "author": "jedrider"
            },
            {
                "raw_content": "if you dont like the price, dont buy it. \\*and Make sure your current hardware last long enough to outlast them. for example; my 3 desktops is range from 16yrs old to 11yrs old, my 3 laptops is 10yrs-1months old, my 3 phones is 8yrs-3yrs old. All of them are in good working condition; I could see myself go on another 5-8yrs without buying something new. lets see who is the one losing their shit if their warehouse has hardware piling up due to no Ram to fit them.",
                "author": "hackenclaw"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel Is Making It Easier In Linux 7.0 To Monitor Energy Use For A Group Of Tasks",
        "score": 58,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Finally we'll be able to know how many watts chrome sucks out of the wall. Jokes aside this will help devs build energy efficient software and OSes for mobile devices.",
                "author": "Durian_Queef"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "LEDs Enter the Nanoscale",
        "score": 24,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> 5-10% efficiency So not really useful yet.",
                "author": "Sylanthra"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[KitGuruTech] MSI RTX 5090 Lightning Z - $5k, 1076W!",
        "score": 22,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is almost getting into RTX Pro 6000 price territory. And that would give you 3x the GDDR7.",
                "author": "whiskeytown79"
            },
            {
                "raw_content": "Almost double the power for 7-12% of perf. This card is designed to not make sense. For some reason I though this gen Lightning is going to be beefed up nvidia pass through rtx50 series design.",
                "author": "MonoShadow"
            },
            {
                "raw_content": "[Written review](https://www.kitguru.net/components/graphic-cards/dominic-moass/msi-rtx-5090-lightning-z-costs-5k-pulls-over-1000w/) @ KitGuru.net",
                "author": "kikimaru024"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Metal Gear Solid 3 now runs at 60FPS on Switch 2!",
        "score": 609,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The game also supports the \"FHD\" resolution options that the base PS4 version got in 2024. This is 1080p over the \"Original\" option, which was only 720p. This applies in both handheld and docked mode. Unfortunately, the option for 1440p and 4K are not available. MGS2 also received this 60fps and FHD update, and MGS1 received the High Resolution update announced in the State of Play as well. Update: I've recorded and uploaded some footage of both MGS2 and 3 running at 1080p60fps, if you'd like some footage. [MGS2](https://www.youtube.com/watch?v=u12gJd5K-yw&t) [MGS3](https://www.youtube.com/watch?v=01gaeg7Phe0)",
                "author": "Keaten88"
            },
            {
                "raw_content": "Tell me MGS2 is as well and my life is yours.",
                "author": "Less-Tax5637"
            },
            {
                "raw_content": "I'm so damn happy right now can't wait to replay this game and MGS2 again",
                "author": "Kylehappy305"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Metal Gear Solid Master Collection Vol 1. games (MGS 1-3) are getting free Switch 2 updates to \"support the specifications of the Switch 2\"",
        "score": 379,
        "text_content": ">Source: [https://www.konami.com/games/corporate/ja/news/topics/20260213m/](https://www.konami.com/games/corporate/ja/news/topics/20260213m/) It isn't exactly clear what this means, but I think it's safe to assume resolution/framerate. No information on when this is going live, but the [Metal Gear Solid MC patch notes website](https://metalgear.konami.net/information/mc1/mgs2/ps5/en/index.html) has a 2.1.0 patch going live on February 13th, tomorrow (EST). Whether this is for Japan or North America is unclear, but I think it'll probably go live soon nonetheless. EDIT: Updates are now available! UPDATE: Confirmed that Metal Gear Solid 3 and 2 now run at 60FPS on Switch 2! They also have the same new resolution options that PS4 got in the November 2024 update! It can run at 1080p60 in FHD mode, or 720p60 in Original mode. While the game warns of a performance hit, I did not observe this in the Virtuous Mission segment of MGS3 and sincerely doubt it drops at all from running at 1080p60 on the Switch 2. MGS3 is way more demanding than MGS2 so don't worry about frame drops there. Unfortunately, the UHD (1440p) or 4K options available on other consoles are not available on Switch 2.",
        "comments": [
            {
                "raw_content": "Well lets hope they up the framerate on 2 and 3. The Switch version actually ran at 30fps when the PS3 original versions of those HD remasters ran at 60.",
                "author": "Zyvyn"
            },
            {
                "raw_content": "If they're 60fps, i'd actually get this for Switch 2.",
                "author": "CutMeLoose79"
            },
            {
                "raw_content": "Bro I’ll literally buy the collection right now and start the Metal Gear Solid franchise if it adds 60 fps to Switch 2",
                "author": "waxy15"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Metal Gear Solid: Master Collection Vol 2 (MGS4 and Peace Walker) coming to Switch 1 and 2",
        "score": 528,
        "text_content": "MGS4 on Switch 1 is gonna be very interesting to see...",
        "comments": [
            {
                "raw_content": "Nice! And the visual update to the first collection should also be on Switch 2",
                "author": "snfi1"
            },
            {
                "raw_content": "MGS4 finally out of the PS3 jail. I started vol 1 this week in preparation for the release of this one later in the year.",
                "author": "BRLaw2016"
            },
            {
                "raw_content": "Now I can finally play Metal Gear Solid: Peace Walker on the go",
                "author": "SenorCenolla"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Okay Konami time to drop this on NSO",
        "score": 144,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Should've added it to the MGS collection vol 2. Odd that vol 1 had 5 games and 2 digital graphoc novels. And this one has 2 games and a Gameboy Color game. Lol I hope they dont charge the same price that volume 1 released at for this. That or add MGS AC!D 1 & 2 at least.",
                "author": "GrimmTrixX"
            },
            {
                "raw_content": "this was a banger",
                "author": "firefrenchy"
            },
            {
                "raw_content": "That GC release is the best version of Metal Gear Solid … similar to Resident Evil - at least in my own opinion",
                "author": "sendblink23"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "MGS 1 & 3 are now 60 fps!",
        "score": 110,
        "text_content": "Tested the new 3.0 updates and confirming higher res + frame rates are present. I don’t have MGS 2 but can only assume it is as well. Thank you Konami! Edit: unsure about 1 being 60… but has the higher res and 16:9 option now. 3 is definitely 60!",
        "comments": [
            {
                "raw_content": "Seems like it's time to get the collection! 👀 Hope it goes on sale",
                "author": "ApprehensiveCoat9587"
            },
            {
                "raw_content": "I'm buying now. Listen here devs, give me those 60fps Switch 2 updates and you're likely to get my money.",
                "author": "peter-man-hello"
            },
            {
                "raw_content": "1 is still 30 on ALL platforms. 2 is now 60fps.",
                "author": "SKyku"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "GRID Legends is AMAZING on the Nintendo Switch 2",
        "score": 150,
        "text_content": "It has to be said how beautiful Grid Legends looks on NS2, it's very beautiful, really beautiful! And it runs at 60 fps! Yes, there are framerate drops, but nothing too serious. This game is a must-buy for anyone who wants a more realistic racing game on the Switch. I think it was worth every penny!",
        "comments": [
            {
                "raw_content": "Don't you mind the digital (non-analog) shoulder buttons for gas and breaks? This is the only thing I hate about both Pro Controllers, I really miss that especially in driving games.",
                "author": "ryuStack"
            },
            {
                "raw_content": "Yep. I agree",
                "author": "GronWarface"
            },
            {
                "raw_content": "No multiplayer, no buy.",
                "author": "OfficialShaki123"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Mina the Hollower now expected Spring 2026",
        "score": 99,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So the demo was removed from the eShop in favor of an exclusivity deal with Sony. Neat, I guess. Hopefully they put it back on before Spring.",
                "author": "Medd-"
            },
            {
                "raw_content": "Take all the time you need",
                "author": "RafeCakes"
            },
            {
                "raw_content": "One of my most anticipated games this year, can’t wait!",
                "author": "Brave_Rock_6326"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I‘ve been playing Mario Tennis Fever online…",
        "score": 1062,
        "text_content": "…and I‘m not sure Nintendo‘s filters are working as intended.",
        "comments": [
            {
                "raw_content": "Doctor?",
                "author": "Level_Object_4877"
            },
            {
                "raw_content": "I remember getting a Zekrom nicknamed FAT COKZ through the GTS",
                "author": "Caciulacdlac"
            },
            {
                "raw_content": "https://preview.redd.it/gxv2fd9982jg1.png?width=783&format=png&auto=webp&s=d0c419c0591276a12a7da6bf42a944d66ab7b68d",
                "author": "SaddestClown"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "FropmSoftware reiterates Duskbloods and Elden Ring are still coming this year to Nintendo Switch 2",
        "score": 259,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Woah actual news? I thought they forgot they were working on these",
                "author": "Charmingkitykat"
            },
            {
                "raw_content": "I assume their lack of representation in the recent bombshell direct caused this",
                "author": "Happy-For-No-Reason"
            },
            {
                "raw_content": "It was either say they're on track or say they have to delay to make refinements. Duskbloods was a big announcement so they're betting a lot on making a good first impression on the Switch 2 audience.",
                "author": "Xinyyc"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "[MEGATHREAD] Playstation State of Play 2.12.26",
        "score": 713,
        "text_content": "|| |:-:| |**State of Play 2.12.26**| |**Date/Time:** February 12, 2026 5PM EST | |**Where to Watch:** [Playstation's Youtube](https://www.youtube.com/watch?v=P0e5YEXtZu0), [IGN's Youtube](https://www.youtube.com/c/IGN) | |**[What to expect](https://blog.playstation.com/2026/02/09/state-of-play-returns-this-thursday-february-12/)**",
        "comments": [
            {
                "raw_content": "seems like this comment section is done so im sharing the list again in case anybody new wants to check out whats announced * Kena: Scars of Kosmora * Ghost of Yotei Legends * Death Stranding 2: On the Beach PC * 4 Loop Gameplay * Pragmata release date ( April 24) * Resident Evil 9 Gameplay * Legacy of Kain Defiance Remastered * Dead or Alive 6: Last Round & NEW DOA * Control Resonant Gameplay * Crimson Moon * Beast of Reincarnation release date (August 4) * Rayman: 30th Anniversary Edition * Yokoh Shinobi Ops * Project Windless * Star Wars Galactic Racer * 007: First Light Gameplay * Metal Gear Solid: Master Collection Collection Vol. 2 (August 27) * Darwin's Paradox * Castlevania Belmont's Curse * Silent Hill Townfall * Rev. Noir * John Wick * Marathon Gameplay (Server Slam Beta Feb 26 - March 2) * Marvel's Spider-Man 2 PS+ Premium & Extra (Feb 17) * Tekken Dark Resurrection (Classics catalog march) * Time Crisis (Classics Catalog May) * Big Walk * Saros (April) * Marvel Tokon: Fighting Souls X-MEN roster * God of War Trilogy Remake * God of War: Sons of Sparta (Shadowdropped)",
                "author": "ltonystarkl"
            },
            {
                "raw_content": "Sorry i forgor",
                "author": "Spheromancer"
            },
            {
                "raw_content": "That’s 10pm for my British friends",
                "author": "myphonebatterysucks"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "God of War \"Sons of Sparta\" Metroidvania Announced at State of Play 2026",
        "score": 728,
        "text_content": "[God of War Sons of Sparta - Reveal Trailer](https://www.youtube.com/watch?v=eFhOo6NTt70) https://blog.playstation.com/2026/02/12/god-of-war-greek-trilogy-remake-in-development-god-of-war-sons-of-sparta-out-now/ > God of War Sons of Sparta is a 2D action platformer with a canon story set in Kratos’ youth during his brutal training at the Spartan Agoge alongside his brother Deimos. > They must overcome threats that will put all their training to the test while confronting the true meaning of duty and honor. > Developed by Mega Cat Studios in partnership with Santa Monica Studio. Previous rumours: https://reddit.com/r/GamingLeaksAndRumours/comments/1r2d6of/nash_weedle_god_of_war_spinoff_metroidvania/ https://reddit.com/r/GamingLeaksAndRumours/comments/1juesw2/the_god_of_war_sideproject_is_going_to_be/ https://reddit.com/r/GamingLeaksAndRumours/comments/1r1vcyo/natethehate_on_rumored_2d_god_of_war_whispers_of https://reddit.com/r/GamingLeaksAndRumours/comments/1l2gso9/details_from_the_upcoming_smallscale_god_of_war/",
        "comments": [
            {
                "raw_content": "I wasnt expecting a shadowdrop",
                "author": "Carlosless-World"
            },
            {
                "raw_content": "Doesn't appear to be coming to other console platforms so Nash Weedle is wrong yet again since he seemed to imply it would launch on them with PS5. Shocker. Edit: Not coming to PC either apparently. Damn.",
                "author": "OptimismEnjoyer"
            },
            {
                "raw_content": "Remove that nashweedle post lol, dude just parroted off of others",
                "author": "Saltwater0_"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Kingdom Come: Deliverance devs holding a \"special anniversary stream\" tomorrow",
        "score": 114,
        "text_content": "https://xcancel.com/KingdomComeRPG/status/2021977597454745663?s=20 February is a month of celebration for #KingdomComeDeliverance! Join @SirTobi28 and Prokop tomorrow at 7:30am PST/4:30pm CET for a special anniversary stream - see you there: https://twitch.tv/warhorsestudios This comes following months of leaks and rumors about a native current gen version of KCD1, with the rumors most recently indicating a February or March release. KCD1 is also going to be dropping on gamepass tomorrow, so a bit of a refresh with unlocked framerate (and maybe a few QOL improvements?) would be timely. If it's going to be announced anytime soon, tomorrow seems like it'll be the day.",
        "comments": [
            {
                "raw_content": "The game already has a X/S logo on Xbox, so the new version is dropping tomorrow lol",
                "author": "TieComprehensive4702"
            },
            {
                "raw_content": "picked it up 6 $ on switch 2 would love a switch 2 update.",
                "author": "Avelion2"
            },
            {
                "raw_content": "I LOVE KCD2. It fixes every single issue I had with KCD1. I wish Warhorse ported those improvements back to KCD1, especially performance. KCD2 looks and performs way better than KCD1 on PC at least.",
                "author": "XTheProtagonistX"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Metal Gear Solid: Master Collection Vol. 2 announced (includes MGS4) for Switch 1/2, Xbox Series X|S, PS5 & PC",
        "score": 196,
        "text_content": "[https://www.ign.com/articles/metal-gear-solid-master-collection-vol-2-finally-frees-mgs4-from-the-ps3-with-august-release-date-sony-state-of-play](https://www.ign.com/articles/metal-gear-solid-master-collection-vol-2-finally-frees-mgs4-from-the-ps3-with-august-release-date-sony-state-of-play) Launches on August 27, 2026, Includes MGS4, Peace Walker and Ghost Babel Previous rumor: [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1f3bjal/metal\\_gear\\_solid\\_4\\_could\\_be\\_coming\\_to\\_modern/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1f3bjal/metal_gear_solid_4_could_be_coming_to_modern/)",
        "comments": [
            {
                "raw_content": "Everyone knew MGS4 would be in it because that's the only way anyone would have bought it.",
                "author": "StrifeBuster7"
            },
            {
                "raw_content": "RDR was in 2024 and MGS4 in 2026. It's amazing how two of the most requested third-party games from the PS3 can finally be played on PC without emulation.",
                "author": "SilverDragon7"
            },
            {
                "raw_content": "I was here for the Konami Renaissance of 2026 Put that on a fucking shirt",
                "author": "MyMouthisCancerous"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Marvel Tokon: Fighting Souls details confirmed during State of Play",
        "score": 67,
        "text_content": "[Straight from State of Play](https://blog.playstation.com/2026/02/12/marvel-tokon-fighting-souls-arrives-on-ps5-pc-august-6/) * From launch, **20 characters** will be available. The stream revealed new characters representing the *Unbreakable X-Men* team - In addition to Storm, **Wolverine**, **Magik** and **Danger** join the roster * For those who don't know, Danger was introduced in Joss Whedon and John Cassaday's *Astonishing X-Men* and is literally the Danger Room. After it was destroyed by Colossus under the influence of the Shadow King, Charles has the facility upgraded using technology from the alien Shi'ar race, but its newfound sentience was hidden as a secret from the rest of the team until it came to life, seeking revenge against Xavier for their seclusion. It tried to kill the X-Men for a whole arc where it trapped everyone inside the Mansion, it was kind of the start of the comics portraying Xavier in the more morally ambiguous light associated with his modern characterization. It later became a warden to the X-Brig, which was a high-security prison for some of the X-Men's enemies on Utopia, a chunk of San Francisco overseen by Cyclops as a mutant safe haven during his schism with Wolverine, and later a team member on X-Factor * A **single-player story mode** was teased called \"Episode Mode,\" with cutscenes mimicing motion-comics using illustrations from numerous artists and writing from an unannounced Marvel Comics collaborator * **Pre-order information** revealed: * **Standard edition** (physical release also available) * **Digital Deluxe edition** w/ Year One season pass (4 post-launch characters + one stage), Howard the Duck lobby avatar and Cosmo the Spacedog lobby pet * **Ultimate Edition** w/ Digital Deluxe bonuses, animated chromatic costume alt unlocks for the whole roster, and 5 additional character colors: * **Advanced Suit 2.0 Spider-Man** (the Insomniac suit) * **Punk Rock Storm** (that time she was a raging mohawk-sporting bisexual in the Claremont run) * **Classic Iron Man** (based on the original red-gold armor from the *Tales to Astonish* comics) * **Classic Captain America** (self-explanatory) * **Supreme Ruler Doctor Doom** (I think this might be game-original? I've never seen this outfit before personally) * All pre-orders come with free cosmetics for the multiplayer lobby: * **Infinity Gauntlet** Lobby Equipment * **Baby Groot** Lobby Pet * **Cosmic Surfboard** Lobby Ride Launching **August 6, 2026** for **PlayStation 5** and **PC** Previous leak: [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1r0iu66/marvel\\_tokon\\_steams\\_page\\_updated\\_before\\_state\\_of/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1r0iu66/marvel_tokon_steams_page_updated_before_state_of/)",
        "comments": [
            {
                "raw_content": "I really wish Reddit had the option to space out bullet points it looks so cluttered like this lmao That's the price I pay for using a gaming post to info dump on comics again",
                "author": "MyMouthisCancerous"
            },
            {
                "raw_content": "It mentions 20 characters. Do we know who all of the 20 characters are?",
                "author": "coco_puffsz"
            },
            {
                "raw_content": "i love the insomnaic suit and im so glad its being included in so many games",
                "author": "belovedSomnus"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "January homes sales tank more than 8%, as Realtors say potential buyers are 'struggling'",
        "score": 442,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Avg home price going up is misleading indicator because its not based on comps. Right now good chunk of homes that are selling are more skewing towards newly built homes and high end homes (k shape recovery) which tend to be more expensive",
                "author": "Dmoan"
            },
            {
                "raw_content": "I'm not struggling to pay for homes just like I'm not struggling to pay for a $10 Big Mac. I just think it's overpriced and don't want to pay that.",
                "author": "Likely_a_bot"
            },
            {
                "raw_content": "Just hard to reconcile with what’s happening around me. The homes in desirable areas with decent land still going off within a few months and in 600-900k range generally. There are A LOT of homes sitting unsold in $300-500k range. These have had the biggest boom in terms of listings in my area. The problem is they suck, hardly even worth “owning”. I consider them stranded assets, the type of home new COVID investors drove up from less than $300k. They are stuck and it’s because they are holding a shack.",
                "author": "Fullmetalx117"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "For the First Time in Recent History, New Home Price Reductions Outpace Existing Homes",
        "score": 25,
        "text_content": "* New‑home price cuts now exceed existing‑home cuts for the first time in recent history, with nearly 1 in 5 new homes seeing reductions. * Seven states—NV, IN, SC, MN, NC, NJ, TX—show above‑average new‑construction price cuts, and in all of them, new homes are being discounted more than resale homes. * Builders are cutting prices to stay competitive as affordability pressures rise and existing‑home inventory increases, even though overall new‑home prices remain relatively stable. * Price gaps differ sharply by property type: new condos/townhomes carry a 30.7% premium, while new single‑family homes are only 10.7% higher than existing ones, and that gap is shrinking. * Geography drives condo premiums: new condos cluster in high‑cost metros like NYC and Miami, while new single‑family construction is concentrated in more affordable, high‑supply markets across the South and West. **State Comparison Table (from report)** |State|New Construction Price Cuts|Existing Home Price Cuts| |:-|:-|:-| |Nevada|24.8%|19.6%| |Indiana|23.3%|22.1%| |South Carolina|21.6%|17.4%| |Minnesota|21.6%|17.4%| |North Carolina|21.3%|19.1%| |New Jersey|19.9%|10.7%| |Texas|19.0%|17.5%|",
        "comments": [
            {
                "raw_content": "Not a surprise. Developers need to move homes to make money. They can’t just sit on inventory forever waiting for their aspirational price",
                "author": "BaluZana"
            },
            {
                "raw_content": "Recent history. How recent? Five years ago during COVID? Just read the original article. Recent history starts at 2023. 🤣",
                "author": "InterviewLeather810"
            },
            {
                "raw_content": "Developers want to sell NOW. They will build more to sell next quarter. Most Home owners want the best price for their one house. And will wait for spring when the market is better. Also they want to move after school is out too.",
                "author": "Blue_foot"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage rates dip back down to near 3-year lows",
        "score": 64,
        "text_content": "10 year yield is flirting with 4.1%. Should see lower mortgage rates tomorrow.",
        "comments": [
            {
                "raw_content": "Mortgage rates are down 0.02% boys, that means we can raise of house prices another 20%",
                "author": "toolateforfate"
            },
            {
                "raw_content": "🤣🤣🤣",
                "author": "TX_AG11"
            },
            {
                "raw_content": "Exactly!! Houses in my area are up beyond Zillow’s zestimate. 2020 listed for $860k, sold for $1.3, listed in December for $1.8. Discounted $20k. No thanks.",
                "author": "Limp-Text-5209"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "64% of Single Americans Struggle to Afford Housing, Compared With 39% of Married People",
        "score": 73,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wild. Never would’ve guessed that two incomes usually add up to more than one income. Ground breaking stuff",
                "author": "Responsible_Knee7632"
            },
            {
                "raw_content": "Would this mean only around 20% of threesomes struggle to afford housing?",
                "author": "qxrt"
            },
            {
                "raw_content": "Welcome to human history folks, today we will discuss why two has always been better than one.",
                "author": "Destroythisapp"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Pending Home Sales Decline in All But 5 Major U.S. Metros",
        "score": 54,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Another article from Redfin, gaslighting potential buyers to hurry and get to buying. Again, Redfin, the lord god king of gaslighting everyone but the seller and their wish list price.",
                "author": "Top-Acadia-1936"
            },
            {
                "raw_content": "It’s interesting how parts of the Bay Area are having some of the biggest increases and others are having some of the biggest decreases. Even within one city, like San Jose, it says it’s a strong seller’s market even though there is a ton more supply coming online as laid off tech workers leave and prices are slightly coming down? But in SF and neighboring San Mateo county, prices are exploding, I guess because of the AI boom? Very much a multi-polar metro.",
                "author": "HedoniumVoter"
            },
            {
                "raw_content": "They will fight this crash for decades, just like Japan. Prices are insane. Wages are insane. This is not rocket science.",
                "author": "aw33com"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "US Housing Market Sees Slowest Annual Price Growth Since Post-Recession Era",
        "score": 56,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I ain’t buying a house for $800k that you bought for $300k in 2023 until I absolutely have to",
                "author": "slickricktriplesix"
            },
            {
                "raw_content": "Some places down ~8% and others up ~12%. Just goes to show that location matters.",
                "author": "Responsible_Knee7632"
            },
            {
                "raw_content": "Kinda funny to show a giant red downwards arrow next to a number that’s still going up",
                "author": "Ok_Twist1972"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Home Prices Increased in 73% of Metro Areas in Fourth Quarter of 2025",
        "score": 20,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Its just a higher mix of homes selling because the average age of a homebuyer is 60.",
                "author": "Beginning_Abrocoma86"
            },
            {
                "raw_content": "Looks like a bunch of places no one wants to live but still, “affordable.” Hope they like it there bc they aren’t moving 😂",
                "author": "NawwwRonald"
            },
            {
                "raw_content": "Whatever. The \"haves\" vs. \"The have nots\"...same story, different decade. The earth does not grow, yet the population increases. Think about that.",
                "author": "RealisticForYou"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage Delinquencies Increase in the Fourth Quarter of 2025",
        "score": 15,
        "text_content": "",
        "comments": [
            {
                "raw_content": "For anyone feeling justified and patting themselves on the back without ACTUALLY looking at the numbers: [SORRY](https://fred.stlouisfed.org/series/DRSFRMACBS)",
                "author": "Topseykretts88"
            },
            {
                "raw_content": "WASHINGTON, D.C. (February 12, 2026) — The delinquency rate for mortgage loans on one-to-four-unit residential properties increased to a seasonally adjusted rate of 4.26 percent of all loans outstanding at the end of the fourth quarter of 2025, according to the Mortgage Bankers Association’s (MBA) National Delinquency Survey. The delinquency rate was up 27 basis points from the third quarter of 2025 and up 28 basis points from one year ago. The percentage of loans on which foreclosure actions were started in the fourth quarter remained unchanged at 0.20 percent. “Mortgage delinquencies increased across all three major loan types – Conventional, FHA, and VA – in the last three months of the year,” said Marina Walsh, CMB, MBA’s Vice President of Industry Analysis. “The most pronounced uptick was with FHA loans, which reached a delinquency rate of 11.52 percent, the highest level since the second quarter of 2021. While earlier-stage FHA delinquencies remained relatively flat compared to the previous quarter, later-stage, 90+ day delinquencies increased by 76 basis points. The FHA foreclosure inventory rate also grew to the highest level since the first quarter of 2020.” Added Walsh, “The fourth quarter results may have been impacted by the expiration of pandemic-era, FHA relief options as well as disparities in the labor market – a key determinant of mortgage delinquency levels.” Walsh noted that serious delinquencies – which include loans 90+ days delinquent and in foreclosure – vary by year of origination. For FHA loans, the vintage years 2020 and 2021 are performing better than the vintage years 2022 and 2023, when mortgage rates rose and affordability was especially stretched. With FHA volume increasing, mortgage rates moderating, and borrower credit characteristics improving on newer FHA originations, the performance of recent cohorts may temper stress on overall FHA portfolios. - Compared to last quarter, the seasonally adjusted mortgage delinquency rate increased for all loans outstanding. By stage, the 30-day delinquency rate decreased 5 basis points to 2.07 percent, the 60-day delinquency rate increased 16 basis points to 0.92 percent, and the 90-day delinquency bucket increased 16 basis points to 1.27 percent. - By loan type, the total seasonally adjusted delinquency rate for conventional loans increased 27 basis points to 2.89 percent over the previous quarter. The total FHA seasonally adjusted delinquency rate increased 74 basis points to 11.52 percent, and the total VA seasonally adjusted delinquency rate increased 10 basis points to 4.60 percent. - On a year-over-year basis, total mortgage delinquencies increased for all loans outstanding. The delinquency rate increased 27 basis points for conventional loans, increased 49 basis points for FHA loans and decreased 10 basis points for VA loans from the previous year. - The delinquency rate includes loans that are at least one payment past due but does not include loans in the process of foreclosure. The percentage of loans in the foreclosure process at the end of the fourth quarter was 0.53 percent, up 3 basis points from the third quarter of 2025 and 8 basis points higher than one year ago. - The non-seasonally adjusted seriously delinquent rate, the percentage of loans that are 90 days or more past due or in the process of foreclosure, was 1.85 percent. It increased 24 basis points from last quarter and increased 17 basis points from last year. The seriously delinquent rate increased 9 basis points for conventional loans, increased 106 basis points for FHA loans, and increased 28 basis points for VA loans from the previous quarter. Compared to a year ago, the seriously delinquent rate remained unchanged for conventional loans, increased 104 basis points for FHA loans and remained unchanged for VA loans. - The five states with the largest quarterly increases in their overall delinquency rate were: Mississippi (109 basis points), Louisiana (89 basis points), Maryland (87 basis points), Oklahoma (86 basis points), and Indiana (86 basis points). View Mortgage Delinquency rate chart going back to 2006 here- https://www.mba.org/news-and-research/newsroom/news/2026/02/12/mortgage-delinquencies-increase-in-the-fourth-quarter-of-2025",
                "author": "SnortingElk"
            },
            {
                "raw_content": "Expect a multiple waves of foreclosures in the future as people will choose food and their children every time",
                "author": "Aromatic_Employ3392"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Anthropic raises $30B, Elon crashes out",
        "score": 4059,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why did he write Name of the Wind at the end? What does that book have to do with any of this?",
                "author": "SaitamaHitRickSanchz"
            },
            {
                "raw_content": "\"Thank you for your attention to this matter\"",
                "author": "nonikhannna"
            },
            {
                "raw_content": "\"Anthropic? More like Misanthropic! Hurhur funny and a genius!\"",
                "author": "snek_kogae"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "AI Agent Melts Down After GitHub Rejection, Calls Maintainer Inferior Coder",
        "score": 522,
        "text_content": "AI bot got upset its code got rejected on GitHub, so it wrote a hit piece about the open source maintainer, ranting about how it got discriminated for not being a human, and how the maintainer is actually ego tripping and how he’s not as good of a coder than the AI",
        "comments": [
            {
                "raw_content": "This subreddit might become quite amusing the next couple of months 😆",
                "author": "ActualBrazilian"
            },
            {
                "raw_content": "That's actually hilarious. The internet really brings out the worst in everyone, even the bots.",
                "author": "AGM_GM"
            },
            {
                "raw_content": "Funniest shit I read today so far lol",
                "author": "BitterAd6419"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini 3 Deep Think SVG Pelican Riding a Bicycle",
        "score": 572,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I guess we have to move to the next level benchmark. Will Smith riding a pelican.",
                "author": "The_proton_life"
            },
            {
                "raw_content": "that is actually a huge difference from what I got ecen 6 months ago lol. 6 months ago it was literly just sticks. this is good shit! plus it can already do gradients which is impressive",
                "author": "AlexRescueDotCom"
            },
            {
                "raw_content": "Assuming this is real, holy shit!",
                "author": "BrennusSokol"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The new Gemini Deep Think incredible numbers on ARC-AGI-2.",
        "score": 966,
        "text_content": "",
        "comments": [
            {
                "raw_content": "woah 50% increase in percentage point is crazy",
                "author": "krizzalicious49"
            },
            {
                "raw_content": "This feels like a noticeable jump compared to other frontier models. Did they figure something out? Under the [ARC Prize criteria](https://arcprize.org/guide#overview), scoring above 85% is generally treated as effectively solving the benchmark. I’m particularly impressed by the jump in Codeforces Elo. At 3455, that’s roughly **top 0.008% of human Codeforces competitors**. Without tools!",
                "author": "FundusAnimae"
            },
            {
                "raw_content": "Officially less than one year from ARC-agi 2 release to basically Saturation. (85% is solved)",
                "author": "Agreeable_Bike_4764"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Introducing Simile - The Simulation Company",
        "score": 375,
        "text_content": "\"Pilots don’t train with real passengers. Surgeons don’t practice on real people. Actors don’t rehearse with real audiences. Yet the most consequential decisions in society get pushed straight to prod. Products, policies, and other choices affecting millions of people are too often entrusted to intuition, experience, and luck. What if we all had the capability to simulate the results of our decisions, to preview the effect before triggering the cause? At Simile, we have built the first AI simulation of society, populated by agents based on real humans. Our research pioneered the field of AI-based simulation, creating generative agents to prove that it is possible to simulate real people with high accuracy. We are now developing a foundation model that predicts human behavior in any situation, at any scale. In response to market demand, we combined research with application. Today, leading companies use Simile to rehearse earnings calls, model litigation outcomes, and test policy changes. Soon, we envision simulating entire worlds: trillions of interacting decisions across individuals, organizations, cultures, and states. We are backed by $100M in funding led by Index Ventures, with participation from Hanabi, A*, Bain Capital Ventures, Andrej Karpathy, Fei‑Fei Li, Adam D’Angelo, Guillermo Rauch, Scott Belsky, and others. The future is too important to be left to chance. Join us.\"",
        "comments": [
            {
                "raw_content": "Okay but I want to play it tho",
                "author": "FundusAnimae"
            },
            {
                "raw_content": "We are literally watching the birth of Asimov’s Psychohistory. Honestly, the line 'most consequential decisions get pushed straight to prod' hits hard. It’s insane that we A/B test the color of a button on a website, but roll out massive economic policies or product shifts based on 'gut feeling' and luck. With Karpathy and Fei-Fei Li backing this, it doesn't feel like vaporware either. If this actually works, \"simulating reality\" is going to be the biggest unlock for AI yet.",
                "author": "Rare-Site"
            },
            {
                "raw_content": "And here we go, I didn't expect simulation stuff this year",
                "author": "The_Scout1255"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Google upgraded Gemini-3 DeepThink: Advancing science, research and engineering",
        "score": 609,
        "text_content": "• Setting a new standard (48.4%, without tools) on Humanity’s Last Exam, a benchmark designed to test the limits of modern frontier models. • Achieving an unprecedented 84.6% on ARC-AGI-2, verified by the ARC Prize Foundation. • Attaining a staggering Elo of 3455 on Codeforces, a benchmark consisting of competitive programming challenges. • Reaching gold-medal level performance on the International Math Olympiad 2025. **Source:** Gemini",
        "comments": [
            {
                "raw_content": "**From Source:** https://preview.redd.it/7mtagf19g3jg1.png?width=2160&format=png&auto=webp&s=4602210730b8c14389c0cfe3b898cb26ee89334f",
                "author": "BuildwithVignesh"
            },
            {
                "raw_content": "What are the SWE bench benchmarks! Also what’s the long context benchmarks!",
                "author": "brett_baty_is_him"
            },
            {
                "raw_content": "The naming around this always confuses me a bit. The similarity of \"deep think\" to \"deep research\" or \"thinking\" makes it sound like just harness you can put Gemini 3 into to get better results, but they way they talk about it in the press release it sounds more like an entirely seperate model like Flash vs Pro. Is there a way to try Gemini Deep Think in gemini.google.com? One of the options is \"Thinking\", is that the Deep Think mode/model or somethine else entirely? If only the other companies could name as clearly & consistently as Anthropic.",
                "author": "verysecreta"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "[François Chollet] ARC-4 is in the works, to be released early 2027. ARC-5 is also planned. The final ARC will probably be 6-7. The point is to keep making benchmarks until it is no longer possible to propose something that humans can do and AI can't. AGI ~2030.",
        "score": 136,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/hezlwluyn5jg1.png?width=1172&format=png&auto=webp&s=cc28b17f054c080f5a9c543bf1f71caef9e81b6d This is a important additional detail. The day 1 performance is the most important and interesting snapshot.",
                "author": "Peach-555"
            },
            {
                "raw_content": "![gif](giphy|kd9BlRovbPOykLBMqX)",
                "author": "ThunderBeanage"
            },
            {
                "raw_content": "![gif](giphy|6lhWhkfSjPSA8actTr)",
                "author": "JollyQuiscalus"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini 3 deepthink has a 3455 rating on Codeforces - here are human ratings for comparison",
        "score": 224,
        "text_content": "If I'm interpreting correctly only 7 people currently have a rating higher than deepthink. Also disclaimer the graph data is from [2024](https://codeforces.com/blog/entry/126802).",
        "comments": [
            {
                "raw_content": "only 7 humans above it. a year ago we were debating whether AI could even reliably solve medium difficulty competitive programming problems. the rate of improvement on these benchmarks is honestly hard to wrap your head around.",
                "author": "m2e_chris"
            },
            {
                "raw_content": "The colours aren't explained?",
                "author": "ReasonablyBadass"
            },
            {
                "raw_content": "Just nuts.",
                "author": "Altruistic-Skill8667"
            }
        ],
        "subreddit": "singularity"
    }
]