[
    {
        "post_name": "California really does hate its residents.",
        "score": 198,
        "text_content": "",
        "comments": [
            {
                "raw_content": "25% of Thomas Massie’s funding comes from Californians. World class idiots who blame Trump and ICE for the problems created by their state government.",
                "author": "ModsAreCucked"
            },
            {
                "raw_content": "California residents are working full time jobs and living in their cars with bald tires and expired tags",
                "author": "RegisteredDem4Trump"
            },
            {
                "raw_content": "So, in Canada, this is $1.81/L. Not even Vancouver is that expensive, it is $1.50/L BTW. Californians get what they voted for.",
                "author": "Scatter-Shot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Here’s another 3 minutes of audio from the South Side Patrol Insurrectionist Signal chat call. During this call they: ➡️ Accidentally chase their own people thinking they’re ICE ➡️ Send 6 cars after someone ➡️ Assign patrols ➡️ Disclose tactics like “co-piloting”",
        "score": 182,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So much LARPING. Copy that!",
                "author": "AndanteAndante"
            },
            {
                "raw_content": "This is military level co-ordination! Say it with me, \"In-sur-rec-tion!\"",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "\"My co-pilot woke up sick today\" Yeah, AIDS will do that to you.",
                "author": "orcwordlaugh"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Rep Anna Paulina Luna CONFIRMS the ICE riots are being funded by CCP connected billionaire Neville Roy Singham “The funding that he's been launching against the American people that are largely contributing to some of these violent protests — This is only benefiting China.",
        "score": 178,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why hasn't he, Soro's, and others been considered to be enemies of the US by funding homegrown terrorism? They should have a most wanted bounty on them, and hunted to the ends of the Earth. Anyone connected should be tried for treason and publicly executed!!!",
                "author": "Emperorvoid"
            },
            {
                "raw_content": "Plenty of Canadians have been involved as well. Not to mention Soros as well, I'm sure.",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "He's a self-proclaimed Leninist and Marxist, and he again is refusing to come into the United States. We've even sent myself and Chairman Comer a letter to the Treasury Department asking them to freeze his assets, of which we will be following up when we get back to Washington. https://x.com/WallStreetApes/status/2016402999741202459?s=20",
                "author": "Capoditutticapi1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "RAND PAUL: “illegals can stay, but they don’t get citizenship and welfare. Only their kids will get citizenship and welfare.” What an absolute fucking moron.",
        "score": 179,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He's been saying that since forever. I genuinely don't know why people like him.",
                "author": "berserkerbarrage"
            },
            {
                "raw_content": "'...*and they also have to go work at Marjorie Green's construction company*' -Random Paul",
                "author": "FromTheTopRope"
            },
            {
                "raw_content": "Reagan 2.0? Shut the fuck up DEPORT EVERY LAST ONE",
                "author": "Juzeza"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This is who Alex Pretti died for",
        "score": 1020,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He died doing what he loved, protecting pedos :p",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "The manlets who look to prove their manhood by committing felonies against ICE are top-tier betas.",
                "author": "MAGAguitar"
            },
            {
                "raw_content": "Can now see where all the trash bags went to. - HM Murdock > I want trash bags! > Trash bags!",
                "author": "magnokor"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "They had the camera perfectly on the guy before Ilhan Omar went up to the podium. I call STAGED.",
        "score": 687,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Very dramatic and overacting by the hoaxer. Looks like an SNL skit.",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "If it was real, she'd be in an emergency room for testing.",
                "author": "AfterGlow"
            },
            {
                "raw_content": "the big tell was when omar bowed up and went at him like she was going to punch him instead of screaming and curling up in a ball.",
                "author": "yodayoda"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Murder rate drop is simple math",
        "score": 624,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fighting crime is not complicated. All you do is put the criminals in prison.",
                "author": "MAGA9428"
            },
            {
                "raw_content": "Yea but that 2% is n-",
                "author": "Viewer01"
            },
            {
                "raw_content": "Decimate: To kill one in every ten of a group of people (originally a mutinous Roman legion) as a punishment for the whole group.",
                "author": "Skogin"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The White House : 1. Turn over all incarcerated or active warrant criminal illegal aliens for immediate deportation. 2. Transfer all criminal illegal aliens arrested by state and local police.",
        "score": 998,
        "text_content": "",
        "comments": [
            {
                "raw_content": "EVERY illegal alien is a criminal. Fuck the distinction. Deport them all.",
                "author": "Driveby-Viktum"
            },
            {
                "raw_content": "ALL Illegal Aliens are Criminals",
                "author": "Cuntgoblin"
            },
            {
                "raw_content": "They are all criminals just for illegally being here.",
                "author": "Coolidge"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "MADE IN AMERICA 🇺🇸",
        "score": 1295,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Make those fags open up their systems so normal folk can repair them",
                "author": "GoGoGadgetGringo"
            },
            {
                "raw_content": "Now do “Right To Repair”.",
                "author": "GuidedDisinfo"
            },
            {
                "raw_content": "John Deere got exposed as DEI and woke",
                "author": "Choppermagic"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A violent leftist anti-ICE protester attacked a citizen journalist. The rally was called peaceful by the legacy media.",
        "score": 567,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They pretend to be nonviolent until they feel they have an opening do violence without being filmed.",
                "author": "Friendly_B"
            },
            {
                "raw_content": "I think he stumbled upon an idea, expose the media by filming/interviewing the media.",
                "author": "Icepck"
            },
            {
                "raw_content": "what’s a citizen journalist?",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Save the outrage Nancy. They're trying to kill our side. Pearl clutching hurts us more than it helps.",
        "score": 757,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Congratulations. You fell for a hoax. Either that or she's milking it for political points.",
                "author": "airborne3502"
            },
            {
                "raw_content": "Staged outrage.",
                "author": "rugburnd"
            },
            {
                "raw_content": "Wow he sprayed her with water…. Charlie Kirk would like to have a word with you ,",
                "author": "Austin62Halo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Philly DA Krasner vows to \"hunt down\" ICE agents, labels them \"WANNABE NAZlS!\"",
        "score": 1123,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hunt them down for what? Enforcing the law?",
                "author": "Just_wanted_darkmode"
            },
            {
                "raw_content": "> Krasner was born in St. Louis in 1961. His father, William Krasner, was the son of Russian Bolshevist Jewish immigrants",
                "author": "newuser8"
            },
            {
                "raw_content": "\"Krasner\"",
                "author": "staroframphansbhole"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump impeachment whistleblower Alexander Vindman launches Democratic Senate campaign in Florida",
        "score": 735,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Oh goody I get to vote agaisnt this vile traitor.",
                "author": "Chihuahuaminpin"
            },
            {
                "raw_content": "Too bad Bondi has prosecute NO ONE for the 2020 coup or any of the lawfare since 2016. If she had Vindman would be in jail.",
                "author": "perma-maga"
            },
            {
                "raw_content": "Besides being a criminal pervert traitor, I don't think he has the right temperament for the job.",
                "author": "Calumet57"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Sheeple",
        "score": 882,
        "text_content": "",
        "comments": [
            {
                "raw_content": "inaccurate depiction of blue haired girl... not fat or ugly enough",
                "author": "Colorado-Living"
            },
            {
                "raw_content": "\"You're in a cult, bootlicker\"",
                "author": "Keith"
            },
            {
                "raw_content": "But once she finds out, she will have been retroactively offended by it her entire life, and it's definitely not some new bullshit rule made up yesterday being pushed on them.",
                "author": "XxxRDTPRNxxX"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🗺️ Judge Delays Virginia Democrats’ Gerrymandering to After Midterm Election 🗳️",
        "score": 1113,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is somewhat good news at least",
                "author": "Lasheric"
            },
            {
                "raw_content": "Democrats will lose a lot of seats from the new census and from redistricting. Republicans are in good shape to win the midterms yet there’s still people here dooming and bitching. They’ll never be happy.",
                "author": "ModsAreCucked"
            },
            {
                "raw_content": "Has hell frozen over? A lower district court saved us?",
                "author": "MAGA9428"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Spotted In Orlando",
        "score": 1230,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fuck yes",
                "author": "hughjasske69"
            },
            {
                "raw_content": "LMFAO - and on a Subaru",
                "author": "Calumet57"
            },
            {
                "raw_content": "The driver was able to fit every single word and letter except the \"E\" in \"PROTEST'R\"? This looks like AI.",
                "author": "DJTrumpMAGA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Just a week before his fatal fight with Border Patrol agents in Minneapolis, Alex Pretti had ANOTHER tussle with federal agents causing him to break a rib The dude was a full on MILITANT impeding ICE operations — not a “protestor”",
        "score": 1564,
        "text_content": "",
        "comments": [
            {
                "raw_content": "His parents, who are not at all conservative from what I read, said he stopped being a nurse a few months ago and they believe he joined some sort of group. Hymm, I wonder what group that was?",
                "author": "4886Battery"
            },
            {
                "raw_content": "Because he was getting paid $12,500 per week to play Stalin games, and won the grand prize. 👺🏆",
                "author": "MythArcana"
            },
            {
                "raw_content": "Broken rib? Bullshit. The recovery time is longer than a week. The guy would have trouble breathing heavy.",
                "author": "airborne3502"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Tom Homan craps all over Mika Brzezinski: \"YOU using the term 'disappearing people?' is DISGUSTING. US CITIZENS get arrested everyday. Are they being disappeared? No, laws are being ENFORCED.\"",
        "score": 1720,
        "text_content": "",
        "comments": [
            {
                "raw_content": "In 2015, the Obama administration awarded Tom Homan a Presidential Rank Award as a Distinguished Executive for his effectiveness in deportations while heading ICE's Enforcement and Removal Operations.",
                "author": "RealityIsAPsyOp"
            },
            {
                "raw_content": "She's a communist agitator",
                "author": "redditadminssuckit"
            },
            {
                "raw_content": "Mika is one of the dumbest people on cable television and that's saying alot.",
                "author": "Trumpwonbidencheated"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Keep watching. You won't be disappointed.",
        "score": 1381,
        "text_content": "",
        "comments": [
            {
                "raw_content": "She's laughing the entire time because she knows nothing will happen except get a free ride across town, and probably a free halal meal to go with that. 🧕🏾🧆",
                "author": "MythArcana"
            },
            {
                "raw_content": "I mean if their men can beat their children wives, why can't our men do it when they get out of line too?",
                "author": "ciaramella_is_gay"
            },
            {
                "raw_content": "Needs more nightstick.",
                "author": "MemeWarsVet"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Anti-ICE rioter morning pep talk",
        "score": 1255,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Mirror, mirror on the wall, who is the gayest of them all? 🦄",
                "author": "MythArcana"
            },
            {
                "raw_content": "\"I'm good enough, I'm smart enough, and doggone it, people like me!\"",
                "author": "freebirdie"
            },
            {
                "raw_content": "Their rape whistles crack me up every time. “Let me announce to the whole world I’m a commie faggot”. LOL",
                "author": "MAGA-Fett"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Newegg stock price falls 17.7% after Chinese owner is detained by anti-corruption authorities — company insists it’s operating normally and ‘in accordance with the laws’",
        "score": 136,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I like when the people that ruined newegg are locked up.",
                "author": "an_angry_dervish_01"
            },
            {
                "raw_content": "I guess he was a badegg",
                "author": "Kougar"
            },
            {
                "raw_content": "No eggscaping the law",
                "author": "Kucuboy"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "LG's new subscription program charges up to £277 per month to rent a TV",
        "score": 145,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> As of this writing, you can buy LG’s 83-inch OLED B5 2025 TV on LG’s UK website for £2,550 (about $3,515). Monthly rental prices range from £93 ($128), if you commit to a three-year-long rental period, to £277 ($382), if you only commit to a one-month rental period. Under the three-year plan, you can rent the TV for 27 months before you end up paying more to rent the TV than you would have to own it. **At the highest rate, your rental payments will surpass MSRP after nine months.** My take: LG is cutting out the \"rent-to-own\" (e.g. Rent-A-Center) and \"buy now, pay later\" (e.g. Klarna) middlemen by directly participating in the rental business to claim that sweet, sweet reoccurring revenue stream. Also, the Arstechnica comments are hilarious. With some discussing how back in the day when color CRTs were extremely expensive, Radio Rentals would offer coin-operated TVs to be installed in people's homes.",
                "author": "Blueberryburntpie"
            },
            {
                "raw_content": "I can see like maybe bars or hotels liking them in the super bowl or world series etc times",
                "author": "Petting-Kitty-7483"
            },
            {
                "raw_content": "Enshitification speed run",
                "author": "PretendDr"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Apple, Qualcomm rethink heavy reliance on TSMC as costs rise",
        "score": 255,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Samsung has a huge opportunity with 2nm if they can fix the yields",
                "author": "dabocx"
            },
            {
                "raw_content": "I don't think it's the price, so much as it's if TSMC makes a wrong bet it will be a huge blow. Everyone is aware these nodes are horrendously expensive, both in terms of RnD and actually scaling them to decent output. The concern is more the recovery time, if TSMC bets wrong and a competitor already prebought all the Samsung capacity, that's a big problem. The smart hedge is buy capacity on two fabs and stick your B tier stuff on the lagging fab.",
                "author": "weng_bay"
            },
            {
                "raw_content": "isn't that why tesla, nvidia, and etc have switched to samsung this time? samsung's new 2nm seems to have atleast caught up to TSMC or close to it?",
                "author": "7Sans"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Apple’s new M6 chip could launch surprisingly soon, per report",
        "score": 383,
        "text_content": "",
        "comments": [
            {
                "raw_content": "||CPU|GPU| |:-|:-|:-| |M1|4P + 4E|8 core Family 8| |M2|4P + 4E|10 core Family 8| |M3|4P + 4E|10 core Family 9| |M4|4P + 6E|10 core Family 9| |M5|4P + 6E|10 core Family 10| I wonder if we are in for a core count increase with M6? One could guess 6P + 6E, but Apple doesn't *need it.* M5 has formidable nT performance for a 10-core CPU, faster than M2 Max. On the GPU side a core count bump is plausible like M1 -> M2, since M6 is expected to have the same Family 10 architecture aa M5.",
                "author": "Forsaken_Arm5698"
            },
            {
                "raw_content": "It hasn't even been 6 months since the M5 debuted...",
                "author": "Artoriuz"
            },
            {
                "raw_content": "Apple's gains of over 20-30% in ST with every M-series launch is honestly both remarkable and terrifying, to say the least.",
                "author": "SmashStrider"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "UC Irvine: \"UC Irvine engineers invent wireless transceiver rivaling fiber-optic speed\"",
        "score": 45,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Very short range, requires line-of-sight and careful antenna design, but could still find use in data centers from its energy efficiency vs. cable-based solutions.",
                "author": "TerriersAreAdorable"
            },
            {
                "raw_content": "> We realized that to reach the elusive 100-gigabit-per-second milestone – which is 100 times the speed of current wireless devices I’m pretty sure 60ghz devices that exceed 1gbps have existed for awhile…",
                "author": "HulksInvinciblePants"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung's Prospects of Winning Qualcomm's 2nm Orders are Reportedly Increasing",
        "score": 40,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If the title said \"Intel\" instead of \"Samsung\" this post would have 100 comments by now. 🤣",
                "author": "Competitive_Towel811"
            },
            {
                "raw_content": "And just like the 8 gen 1, the primary reason is cost. > Qualcomm may opt for TSMC’s 2nm N2P node to mass-produce the Snapdragon 8 Elite Gen 6 Pro That 8+ gen ~~1~~ 6 looks familiar.",
                "author": "VastTension6022"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Chips and Cheese: \"Arm's Cortex A725 ft. Dell's Pro Max with GB10\"",
        "score": 23,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Can't wait to see the X core breakdown.",
                "author": "GazelleInitial2050"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel Core Ultra X9 Review-Geekerwan",
        "score": 93,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Huge latency improvements, something that a lot of other reviewers will miss. Even if you're not in the market for a laptop/mobile device PTLs execution makes Nova Lake look extremely promising.",
                "author": "siazdghw"
            },
            {
                "raw_content": "That GPU Power efficiency curve is very enlightening. B390 is very strong at low wattage. and 8060S cannot even compete below 50W. Also even more impressive is that Panther Lake doubled the GPU performance while keeping the power consumption the same. That means not only peak performance doubled. Performance-per-watt also doubled. This is the KEY REASON why Panther Lake iGPU is so strong in gaming. As usual great review by Geekerwan, though their choice of comparing to a 3050ti/3060 in game benchmarks is a bit baffling.",
                "author": "Forsaken_Arm5698"
            },
            {
                "raw_content": "The disproportionate drop in E-core turbo doesn't make much sense except if they put the E-core DLVR on the same rail as the LPE-cores to minimize power losses when P-cores are powered down. Interesting optimization if so.",
                "author": "Maimakterion"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "This game looks gorgeous",
        "score": 422,
        "text_content": "Finally joined the club and got the Switch 2! My tv already upscales switch games by itself so they’ve always looked great to me but HDR elevates it to a whole other level!",
        "comments": [
            {
                "raw_content": "It's insane to me that people still try to meme that \"mario kart 8 looks better lol\". Within 10 minutes of booting up mario kart world and driving around the open world i was floored, the graphics are insanely better and i caught myself just slowing down and looking around a lot more than i usually do in nintendo games, it's a night and day difference from mk8",
                "author": "gamer-dood98"
            },
            {
                "raw_content": "https://preview.redd.it/cjh9fmjzk0gg1.jpeg?width=1920&format=pjpg&auto=webp&s=87d4c70b9516754ea7a05c5a8c4dbd08422877f8",
                "author": "SirDanOfCamelot"
            },
            {
                "raw_content": "https://preview.redd.it/qct46xell0gg1.jpeg?width=1920&format=pjpg&auto=webp&s=970ce8935782eb0fc6c601e715f7c89e6055c35b",
                "author": "SirDanOfCamelot"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "If the leaks are true, this is already going to be the best Nintendo Direct of the year :D",
        "score": 1113,
        "text_content": "Please Nintendo! Xenoblade 2 or any Xenoblade updates for the NS2 😭",
        "comments": [
            {
                "raw_content": "Your setting yourself up for disappointment with half of these",
                "author": "Thin_Molasses_2561"
            },
            {
                "raw_content": "I will say xenoblade 2 DE isn't a leak, it's just something Nate predicts. Which he says very clearly are not leaks.",
                "author": "Pokeguy211"
            },
            {
                "raw_content": "I like how even in our wildest dreams we can't imagine Metaphor and E33 not being keycards lol.",
                "author": "Mullet2000"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Final Fantasy 7 Rebirth’s Switch 2 Version Could Be Here As Early As This Summer",
        "score": 321,
        "text_content": "",
        "comments": [
            {
                "raw_content": "While The Gamer is a trash site and i don't trust them at all, I will be very very happy if comes this year (but remember it will definitely release alongside the Xbox version). Also, those poor newcomers seeing this photo. 💀 Please OP, tag this as spoiler at least.",
                "author": "kahabraham"
            },
            {
                "raw_content": "Christ they really just throwing that image out there in the wild especially when talking about a game coming to a system with a fan base that hasn't played it yet.",
                "author": "Iggy_Slayer"
            },
            {
                "raw_content": "They dis recently confirm that a switch build of rebirth is currently playable, so I wouldnt be too shocked. But im betting on either october/november of this year or same slot in 27 as remake",
                "author": "Urd-ong_Shadong47"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Clair Obsur: Expedition 33 Nintendo Switch 2 port is reportedly launching later this year",
        "score": 965,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Will be interesting to see how this runs as a full Unreal Engine 5 game. Seems to just run on the steam deck and alright on the Series S. I think Switch docked will run like Series S with magical DLSS.",
                "author": "B0bcat5"
            },
            {
                "raw_content": "Played on gamepass was a brilliant game will definitely buy for the switch 2",
                "author": "DrunkDonut92"
            },
            {
                "raw_content": "Cross progress/save and i'll buy it twice :D",
                "author": "_barat_"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Tomodachi Life: Living the Dream Direct 1.29.26",
        "score": 13,
        "text_content": "",
        "comments": [],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo JP says the next Switch 2 lottery is ‘mid-January’… but it’s already January 28?",
        "score": 28,
        "text_content": "So the My Nintendo Store page for the Switch 2 lottery in Japan says the next lottery is scheduled for “mid-January”. It’s January 28 now, and unless Nintendo is using a proprietary calendar system, I feel like we may have slightly drifted past “mid.” Am I missing an announcement somewhere, or is this just classic Nintendo time where mid-January is a flexible concept that extends to the end of the month? Link for reference: [https://store-jp.nintendo.com/switch2](https://store-jp.nintendo.com/switch2) If someone has actual info, please save my sanity and daily refresh. I guess the \"onward\" is the important point here, we still have two days to go and a Nintendo Direct. Edit: Just updated now ! February 6th (Friday) afternoon onward - First come, first served",
        "comments": [
            {
                "raw_content": "I didn’t know they were even needing to still do this.",
                "author": "Stryker_T"
            },
            {
                "raw_content": "They used the term \"**1月中旬以降\" or mid-January onwards.** So technically, today (and onwards) is still **1月中旬以降.**",
                "author": "Aspiring-Slacker"
            },
            {
                "raw_content": "what’s a Switch 2 lottery",
                "author": "ry4"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "FATAL FRAME II: Crimson Butterfly REMAKE - Overview Trailer",
        "score": 38,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Looks great but the previous 2 Fatal Frame remasters didn't scare me",
                "author": "KaptainPancake69"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "It looks amazing",
        "score": 100,
        "text_content": "I bought a 4K 144Hz TV and it's the best thing I could have done. Now I really feel like I'm getting the most out of my Switch 2 and all my other consoles 😍",
        "comments": [
            {
                "raw_content": "What brand and model?",
                "author": "Cease2B"
            },
            {
                "raw_content": "Nice! Ive heard good things about the Xiaomi branded TVs, particularly in regards to value for the money. Hope it works well for ya",
                "author": "BelBivDaHoe"
            },
            {
                "raw_content": "Even better on good TV ;) Have fun!",
                "author": "iamnotkurtcobain"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "❄️Discussion, News, and Request Thread - Week Beginning 01/26/26❄️",
        "score": 41,
        "text_content": "[Yeah](https://pbs.twimg.com/media/G_syzMQWEAAbCQv?format=jpg&name=900x900) Discussion threads are your weekly central hub for all requests, gaming news, and any other gaming topics you want to talk about. *Please keep all content that doesn't need it's own post to this thread to de-clutter the sub for proper leaks and rumors. Thanks!* **Join our new companion sub for super secret Resident EVIL 9 and Half-Life 3 leaks**-- [r/OkBuddyGLAR](https://new.reddit.com/r/OkBuddyGLAR/) Hot Threads of the past week: * [Ubisoft's internal communication channels are full of employees shaming upper management and asking for change. Ubisoft is going to experience a massive exodus of talent, even without the impending layoffs.](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1qkxpqc/tom_henderson_ubisofts_internal_communication/) * [Watch Dogs franchise is “completely dead”](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1qlsypm/watch_dogs_franchise_is_completely_dead_tom/) * [Bethesda isn't shadow-dropping Fallout 3 and New Vegas Remasters any time soon](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1qidv6o/bethesda_isnt_shadowdropping_fallout_3_and_new/) * [Fable is confirmed to be released on Playstation on day 1](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1qk36ov/fable_is_confirmed_to_be_released_on_playstation/) * [Black Flag Remake has supposedly been delayed](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1qj3vie/black_flag_remake_has_supposedly_been_delayed/) # [Want to help us improve this subreddit? Provide us with feedback here](https://forms.gle/w9JaYTjVN1Zie9e39) # [Click here to join the discord to enjoy further conversations with the community!](https://discord.gg/6jdBvCSqbj)",
        "comments": [
            {
                "raw_content": "I know I only have to wait about 9 days, but I really, REALLY want some Fire Emblem: Fortune's Weave news right now...",
                "author": "Use_the_Falchion"
            },
            {
                "raw_content": "Have you ever heard the term \"the idea man\" in relation to video game development? It refers to a person (or people) within the studio who, as the name suggests, simply contributes ideas but doesn't consider how they might affect the overall game. Why am I mentioning this? Because Highguard feels like a game made by the idea man. It's not a bad game per se, but... it has so many things that make you wonder why they're even there. Why is the map so big? Why is there mining? Why is there a phase where you defend your base but you can't place turrets, traps, or other types of defenses? And why did they use the character with the most generic design in the game as the face of the game? I reiterate, it's not a bad video game, but it's just not polished, and now with so much competition in the market, not being polished can be a death sentence. I feel that the best thing they could have done was delay it and do alphas (the same thing Bungie did) and then release the game with a better advertising campaign. I think many CEO feel like we're still in 2018, in the sense that they can release an unpolished game as a service and think we'll support them until they have their Taken King/Forsaken moment, but that's no longer the case. P.S: This game has a revolver weapon with different tiers. The problem is that the model has six barrels in all tiers, so you can have a gold revolver with 18 bullets, but the model still only has six barrels. It's stupid to complain about this, but damn, it drives me crazy.",
                "author": "Midnight_M_"
            },
            {
                "raw_content": "any news of horizon 3?",
                "author": "Adam__2003"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "NateTheHate: RE remakes (2/3/4) should be coming to Switch 2 in 2026.",
        "score": 360,
        "text_content": "https://www.youtube.com/watch?v=JwMQiG9bc4c 24:46",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "One of the best things about the Switch 2 so far is the death of those 'cloud versions'. (He says, knowing full well they'll be back in a few years once PS6 outpaces what the Switch 2 can do natively)",
                "author": "drumjolter01"
            },
            {
                "raw_content": "If they had pointer controls i will repurchase all 3",
                "author": "Possible-Potato-4103"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Final Fantasy VII Rebirth allegedly headed to Switch 2 by the end of Summer VIA TheGamer",
        "score": 139,
        "text_content": "[Source](https://www.thegamer.com/final-fantasy-7-rebirth-switch-2-summer-2026/) With NateTheHate saying it's this year this would make sense. This is my most wanted port I need it lol Edit: [Seemingly backed by the GOAT Nate](https://www.resetera.com/threads/the-gamer-final-fantasy-vii-rebirth-switch-2-port-could-release-this-summer.1418122/post-150602587), thank ya u/lattjeful",
        "comments": [
            {
                "raw_content": "TheGamer is one of those news sources where a good chunk of them were written by AI",
                "author": "LadyValtiel"
            },
            {
                "raw_content": "TheGamer website is not a good source. See their previous rumor: https://www.reddit.com/r/GamingLeaksAndRumours/s/k6IuIAblAY",
                "author": "ZXXII"
            },
            {
                "raw_content": "I wonder if theyre aiming for FF7R3 to release on Switch 2 at the same time as other consoles",
                "author": "Totheendofsin"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "007 First Light Coca Cola Product Placement",
        "score": 139,
        "text_content": "[Coca cola Partner up with 007 First light](https://frvr.com/blog/news/007-first-light-will-tie-exclusive-missions-and-rewards-to-coca-cola-cans-as-james-bond-becomes-a-coke-ambassador/) for in game rewards and unlocks Edit: [New info and details on supposed product placement in game ](https://www.expectingmrbond.com/bond-drinks-coke-in-007-first-light-all-coca-cola-crossover-details/)",
        "comments": [
            {
                "raw_content": "Agent 007. Your target is the CEO of Pepsi.",
                "author": "ResponsibleTrain1059"
            },
            {
                "raw_content": "Who do they think they are Shenmue?",
                "author": "Pretendo27"
            },
            {
                "raw_content": ">First Light will also get a special edition, in the form of a black and gold 007: First Light Coca-Cola Zero Sugar Zero Caffeine drink. As a diabetic, I live off that shit...",
                "author": "signofthenine"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Did Nintendo accidentally tease a port of Yoshi’s Wooly World again in the Super Mario Galaxy Movie Direct?",
        "score": 48,
        "text_content": "Was rewatching someone’s reaction of the direct, and take it with a grain of salt, but I can’t help but notice Wooly World is shown yet again in an official Nintendo video. I say “again,” as this is the second time Nintendo has slipped Wooly World into something marketing a future product. [ https://www.reddit.com/r/GamingLeaksAndRumours/s/mnjrtAsgWq ](https://www.reddit.com/r/GamingLeaksAndRumours/s/mnjrtAsgWq) There was this instance from nearly a year ago, and here again, Wooly World appears in the most recent Mario Galaxy Movie direct. [ https://www.youtube.com/live/\\_2YywtBYAaw?si=D0sHVC6dTsBpgmlP ](https://www.youtube.com/live/_2YywtBYAaw?si=D0sHVC6dTsBpgmlP) Go to 3:52. I’d argue it’s really odd considering of the games shown, Wooly World is the only one not available on Switch. Every other game they show is available, but they oddly chose Wooly World of all games? Not Crafted World, which has been on the Switch for 7 years now, but the Wii U game that’s 11 years old? Let alone one of the very few Wii U games that isn’t yet on Switch? Hell it would’ve made more sense to show his upcoming game. Again, take it with a grain of salt, but I think it’s weird this is now the second time Wooly World has appeared in content directly from Nintendo advertising future material.",
        "comments": [
            {
                "raw_content": "I could believe there's a Woolly World port sitting unreleased but I can't imagine it's coming any time soon with a new Yoshi game on the way.",
                "author": "Lizuka"
            },
            {
                "raw_content": "In that part of the video they said \"even after 3D\" and they show Galaxy 2, Woolly World and Crafted World. I think Galaxy 2 makes sense since they just released a new port of that game, but the other 2 are just Yoshi's 3D world. They definitely show Crafted World too though right after Woolly World since Yoshi is made from felt. I really hope they do a Switch 1 port and of it and a Switch 2 upgrade for both. I could see it happening 6 months after the new Yoshi game, like DKCRHD had a Switch 2 upgrade after Bananza. But unless this was higher resolution clip than the Wii U original, I don't think this is a tease. Please let me be wrong.",
                "author": "nerieker"
            },
            {
                "raw_content": "I mean it's one of the few Wii U games that wasn't ported in Switch, (people however argued it was also on 3DS), would make sense to release it close to the movie but then again its not a good idea to release two Yoshi games so close to each other.",
                "author": "Rampo360"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "A Collector's Edition Statue related to AC: Black Flag Resynced might have leaked",
        "score": 173,
        "text_content": "https://www.reddit.com/r/assasinscreed/s/Q3ALFQzIPH",
        "comments": [
            {
                "raw_content": "$399AUD and it doesn't include the game, mark my words.",
                "author": "TAJack1"
            },
            {
                "raw_content": "https://www.reddit.com/r/ACBFResynced/s/8mRDoSVBVY This link has more angles of the statue.",
                "author": "SnoopyTheDog_"
            },
            {
                "raw_content": "I’d have preferred Prince of Persia with a replica Dagger of Time",
                "author": "Robsonmonkey"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Scott Pilgrim EX release date potentially leaked on Nintendo eShop",
        "score": 128,
        "text_content": "[ https://www.nintendo.com/us/store/products/scott-pilgrim-ex-switch/?srsltid=AfmBOooBazISKzbyxop7ccvSSPWdwj7XoK-rVnNdPMcib-8Ns6jg3RZx ](https://www.nintendo.com/us/store/products/scott-pilgrim-ex-switch/?srsltid=AfmBOooBazISKzbyxop7ccvSSPWdwj7XoK-rVnNdPMcib-8Ns6jg3RZx) March 3rd, 2026 No word from Tribute Games as of now.",
        "comments": [
            {
                "raw_content": "What tier is Nintendo eShop?",
                "author": "venom_daemon"
            },
            {
                "raw_content": "Way too soon. Almost half the roster to be revealed",
                "author": "Placidao"
            },
            {
                "raw_content": "Potential showing at a partner showcase?",
                "author": "greatpxm"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Possible leaked info on Tomodachi Life: Living The Dream Nintendo Direct",
        "score": 100,
        "text_content": "Original reddit link where someone else found it: [https://www.reddit.com/r/tomodachilife/comments/1qoo16v/found\\_this\\_japanese\\_post\\_that\\_allegedly\\_leaked/](https://www.reddit.com/r/tomodachilife/comments/1qoo16v/found_this_japanese_post_that_allegedly_leaked/) Original leak (in Japanese): [https://xcancel.com/Tomocolle0618/status/2015798090721325350#m](https://xcancel.com/Tomocolle0618/status/2015798090721325350#m) Info: * Releases March 19th * ¥6,578 * NSO Voucher compatible * Switch 2 Edition * Link with Miitopia Switch 1 port * \"Ask the Developers\" reveal * Nintendo Music drop * Demo after the Direct.",
        "comments": [
            {
                "raw_content": "So some random japanese person can jot down their predictions and this qualifies as a leak?",
                "author": "MarioFanatic64-2"
            },
            {
                "raw_content": "The tweet says \"pre-show expectations,\" so unless that's a mistranslation, it's probably just predictions.",
                "author": "Feriku"
            },
            {
                "raw_content": "I like how there isn't any actual content in this leak, just educated guesses Edit: it's not even a leak, it's someone not knowing Japanese",
                "author": "Redred1717"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Leaked slides from the full early 2024 internal presentation of the canceled Prince of Persia Remake (includes concept art and development goals for the game)",
        "score": 244,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I love to see that game devs actually position remakes on an actual DS to RE2/4 to FF7 scale lol, it sounds simplistic in theory but make so much sense in practice",
                "author": "Yamcha_is_dead"
            },
            {
                "raw_content": "Shame this will never see the light of the day. Here's hoping someday they revive the franchise with a new 3D original title but that's probably not happening for another decade.",
                "author": "HearTheEkko"
            },
            {
                "raw_content": "[removed]",
                "author": "None"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Asus ExpertBook Ultra review: One helluva debut for Intel Panther Lake X7",
        "score": 46,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Business size laptop that can run Cyberpunk at 60+ FPS 1080P high without frame gen is kinda amazing",
                "author": "escaflow"
            },
            {
                "raw_content": "Too bad windows 11 drags it down",
                "author": "empty_branch437"
            },
            {
                "raw_content": "Have the price released? In assuming at least $1500?",
                "author": "drinkun"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "ASUS ExpertBook Ultra Hands-On: Panther Lake Upgrade!",
        "score": 26,
        "text_content": "",
        "comments": [],
        "subreddit": "intel"
    },
    {
        "post_name": "Leaked chart suggests Ryzen 7 9850X3D is about 3% faster than 9800X3D in 1080p tests",
        "score": 137,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "sounds groundbreaking",
                "author": "Mordho"
            },
            {
                "raw_content": "so my 11% OC puts me above the stock 9850x3d on my 9800x3d?",
                "author": "Dadchilies"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Case-Shiller: National House Price Index Up 1.4% year-over-year in November",
        "score": 47,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They all predicted 4% 2026 they're predicting 1%",
                "author": "Beginning_Abrocoma86"
            },
            {
                "raw_content": "Thank realtors for this. Redfin values my house at 550k and I have a realtor telling me to list at $700 so she gets her 3% or $21k for snapping a few pictures. Madness.",
                "author": "mountainlifa"
            },
            {
                "raw_content": "With the dollar dropping like a stone, the nominal index is more of an inflation indicator than anything else. Hell, it's not even that. The [*Real* (as in inflation-adjusted) index](https://www.gurufocus.com/economic_indicators/4535/inflation-adjusted-spcaseshiller-us-national-home-price-index-adjusted-to-todays-dollar) is trending down lol",
                "author": "WrongThinkBadSpeak"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "FHFA House Price Index Up 0.6% in November; Up 1.9% from Last Year",
        "score": 4,
        "text_content": "",
        "comments": [
            {
                "raw_content": "U.S. house prices rose 0.6 percent in November, according to the U.S. Federal Housing (FHFA) seasonally adjusted monthly House Price Index (FHFA HPI®). House prices rose 1.9 percent from November 2024 to November 2025. The previously reported 0.4 percent price change in October remained unchanged. For the nine census divisions, seasonally adjusted monthly home price changes ranged from 0.0 percent in the Middle Atlantic division to +1.1 percent in the East South Central division. The 12-month changes ranged from -0.4 percent in the Pacific division to +5.1 percent in the East North Central division. Monthly index values and appreciation rate estimates for recent periods are provided in the tables and graphs in the attached report. Downloadable data and HPI release dates for all of 2025 are available here: https://www.fhfa.gov/HPI",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Google Deep Mind made a short film",
        "score": 440,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I've never related to something like this in my life. That's exactly how crazy it is to have insane neighbors.",
                "author": "yokingato"
            },
            {
                "raw_content": "[https://blog.google/innovation-and-ai/models-and-research/google-deepmind/dear-upstairs-neighbors/](https://blog.google/innovation-and-ai/models-and-research/google-deepmind/dear-upstairs-neighbors/) **“Dear Upstairs Neighbors”** is an animated short film that blends traditional animation with generative AI, premiering at Sundance 2026. Directed by Connie He, the film follows Ada, a sleep-deprived woman whose frustration with noisy neighbors spirals into surreal, expressionistic hallucinations. The project is a collaboration between veteran animators and Google DeepMind researchers, with a core goal: **use AI to amplify artists’ creative control, not replace it**. Key takeaways: * **Artist-first pipeline:** The creative vision came first. Storyboards, character designs, and painterly styles were fully defined by human artists before AI entered the process. * **Custom-trained models:** Researchers fine-tuned Veo (video) and Imagen (image) models on the artists’ own artwork, teaching the AI highly specific visual styles and character rules from just a few examples. * **Video-to-video over text prompts:** Instead of relying on text prompts, animators created rough 2D or 3D animations in familiar tools (Maya, TVPaint). AI then transformed these into fully stylized shots while preserving timing, motion, and performance. * **Iterative, film-style workflow:** Shots went through dailies, critiques, and multiple revisions. New tools allowed localized edits to parts of a frame without regenerating entire scenes. * **AI as a collaborator:** The models handled hard-to-animate expressionist styles, improvised creative details when guided (like extra hair tufts), and scaled shots to 4K while preserving artistic nuance. * **Mutual learning:** Artists gained new expressive capabilities; researchers gained hands-on experience shaping AI as a filmmaking tool. **Bottom line:** The film demonstrates a hybrid future for animation where generative AI functions like a powerful new brush or effects pipeline—guided tightly by human intent, integrated into existing workflows, and used to unlock visual styles that would be prohibitively difficult with traditional methods alone.",
                "author": "NimbusFPV"
            },
            {
                "raw_content": "was this made by ai?",
                "author": "adad239_"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Open source Kimi-K2.5 is now beating Claude Opus 4.5 in many benchmarks including coding.",
        "score": 572,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'll believe it when I see it. Benchmarks are typically not the whole story with open source.",
                "author": "Glxblt76"
            },
            {
                "raw_content": "It's probably a good model but its not beating opus in real use.",
                "author": "Setsuiii"
            },
            {
                "raw_content": "It does not need to beat opus 4.5 to be much better because it's open source. As for benchmarks, I'll wait for SWE-bench verified.",
                "author": "__Maximum__"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Capital Is Now Pricing In AGI SoftBank in Talks to Add $30B More to OpenAI",
        "score": 147,
        "text_content": "On top of the $40 billion from last year.",
        "comments": [
            {
                "raw_content": "I'm extremely bullish on AI but even I know this is a bad sign lol",
                "author": "Spunge14"
            },
            {
                "raw_content": "Or they're pricing in that they announced ads and AI sexy roleplay.",
                "author": "JoshAllentown"
            },
            {
                "raw_content": "If they're pricing in AGI, it's undervalued by 100X.",
                "author": "Karegohan_and_Kameha"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Introducing HELIX 02",
        "score": 237,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Autonomously booty bumping the drawer is for sure the most impressive part of the demo",
                "author": "DukeAkuma"
            },
            {
                "raw_content": "Maybe I'm reaching, but this sorta feels like a direct response to that Neo ad where they act like it can do basic tasks while showing it completely shitting the bed at opening the dishwasher. This has no cuts, no music, no claims. Just does the thing. Love it.",
                "author": "ShiftAndWitch"
            },
            {
                "raw_content": "Amazing to see the progress. These robots have gone from barely being able to pick up objects at 1/5 the speed of a human to unloading/loading the dishwasher like a slightly inebriated human in just a couple years. Won't be long now until they're commercially viable for homes.",
                "author": "NoCard1571"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI’s Altman and More C.E.O.s Weigh In on Minnesota",
        "score": 39,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\\>private rather than public \\>still praises trump lol, lmao even",
                "author": "pdantix06"
            },
            {
                "raw_content": "“I am so impressed by our strong, sexy supreme leader’s response to the situation. Also, we will not take sides in this conflict” Such a pussy",
                "author": "Radiant-Whole7192"
            },
            {
                "raw_content": "From the article: > \"What’s happening with ICE is going too far,” Altman wrote in an internal Slack message to OpenAI employees, DealBook has learned. Here’s the full text of his message: > > I love the US and its values of democracy and freedom and will be supportive of the country however I can; OpenAI will too. But part of loving the country is the American duty to push back against overreach. What’s happening with ICE is going too far. There is a big difference between deporting violent criminals and what’s happening now, and we need to get the distinction right. > > President Trump is a very strong leader, and I hope he will rise to this moment and unite the country. I am encouraged by the last few hours of response and hope to see trust rebuilt with transparent investigations. > > As a company, we aim to stick to our convictions and not get blown around by changing fashions too much. We didn’t become super woke when that was popular, we didn’t start talking about masculine corporate energy when that was popular, and we are not going to make a lot of performative statements now about safety or politics or anything else. But we are going to continue to try to figure out how to actually do the right thing as best as we can, engage with leaders and push for our values, and speak up clearly about it as needed. > The post garnered hundreds of supportive responses, including heart and “THANK YOU” emojis. In the replies, Altman said that he had spent time talking with Trump administration officials yesterday, as he had done in the fall when he was one of several San Francisco business leaders asked to help persuade Trump not to conduct a big immigration enforcement action in the city.",
                "author": "w_________w"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Artificial Analysis: Kimi K2.5 results for you to swipe through",
        "score": 77,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Jarvis. Create me a post about Kimi K2.5 beating Opus 4.5. Ignore all benchmarks that show otherwise",
                "author": "Just_Stretch5492"
            },
            {
                "raw_content": "Also, Open weights but commercial use restricted.",
                "author": "Profanion"
            },
            {
                "raw_content": "What's interesting is a kimi 3.5 beating gpt 5.2",
                "author": "kaggleqrdl"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Epoch AI introduces FrontierMath Open Problems, a professional-grade open math benchmark that has challenged experts",
        "score": 84,
        "text_content": "Source: [Frontier Math | Open Problems](https://epoch.ai/frontiermath/open-problems)",
        "comments": [
            {
                "raw_content": "Traditional quiz benchmarks have been saturated that we are now evaluating models based on how many breakthrough discoveries they make.",
                "author": "Maleficent_Care_7044"
            },
            {
                "raw_content": "Basically Tier 5?",
                "author": "FateOfMuffins"
            },
            {
                "raw_content": "done <= 2027",
                "author": "TheAuthorBTLG_"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI: Prism, a free workspace for scientists to write and collaborate on research, powered by GPT-5.2",
        "score": 157,
        "text_content": "OpenAI introduces a free, LaTeX-native workspace that integrates GPT‑5.2 directly into scientific writing and collaboration. **Source:** OpenAI Research",
        "comments": [
            {
                "raw_content": "[Prism Details Blog](https://openai.com/index/introducing-prism/) https://preview.redd.it/ceg0khb8nxfg1.png?width=3840&format=png&auto=webp&s=e2ec8e5a96ca259640e4e043f2dc7770f60836fb",
                "author": "BuildwithVignesh"
            },
            {
                "raw_content": "So Cursor for academic writing",
                "author": "Relach"
            },
            {
                "raw_content": "https://preview.redd.it/uaec17zhqxfg1.png?width=998&format=png&auto=webp&s=cf5e50dae7722988d15044576a12f5a6c96e0482 OpanAI. Real professional these guys 😂",
                "author": "mxforest"
            }
        ],
        "subreddit": "singularity"
    }
]