[
    {
        "post_name": "Every time",
        "score": 602,
        "text_content": "",
        "comments": [
            {
                "raw_content": "yes, he had an interesting dressing fetish and who knows how many more the cameras didn't show. constantly blocking traffic, spitting on cops, kicking out a taillight on an ice vehicle and resisting arrest the previous encounter didn't teach him anything. not even the pain of a broken rib woke this dufus up. some people walk to their own demise with their arms open wide.",
                "author": "snuggs316"
            },
            {
                "raw_content": "See also George Floyd, Trayvon Martin, pretty much anyone associated with BLM, or really anyone on the left honestly",
                "author": "magapatriot_pa"
            },
            {
                "raw_content": "It is time for the Insurrection Act and \"murder\" all the scumbag commies.",
                "author": "Cowboy888"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I WON 3 TIMES",
        "score": 523,
        "text_content": "",
        "comments": [
            {
                "raw_content": "…so far",
                "author": "Helmerj"
            },
            {
                "raw_content": "I’ve helped all 3 times",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "You know it, I know it, everyone knows it.",
                "author": "Get_Off_Big_Tech"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Minnesota’s largest paper, the Star Tribune, still hasn’t printed a single word about the Signal chats doxxing federal agents.",
        "score": 548,
        "text_content": "",
        "comments": [
            {
                "raw_content": "1) They don’t see anything wrong with it. 2) Their journalists were probably in the chats.",
                "author": "mygovisacommie"
            },
            {
                "raw_content": "They won't report on it because they are coordinating in the Signal chats.",
                "author": "MythArcana"
            },
            {
                "raw_content": "Minnesota has the longest streak voting for Democrats, last voting for a Republican president in 1972. I'd imagine that any levers of power/influence have been completely infiltrated and subverted.",
                "author": "trumpfan75"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Republican Senator Reveals Over A DOZEN US Senators Illegally STOLE Their Seats Through Fraud, 'Billions and Billions':",
        "score": 529,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Name names fucker!",
                "author": "Purple_Drank"
            },
            {
                "raw_content": "fire them all",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "yeah, we know. so what's going to be done about it? no hurry we'll wait",
                "author": "Cuetardian"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Multiple Polls Show Majority Of Americans Want All Illegals Deported",
        "score": 1124,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# I WANT ILLEGALS DEPORTED TO CECOT # AND CIVIL WAR RIGHT NOW",
                "author": "USNVET6541E5"
            },
            {
                "raw_content": "Including the poll that mattered, the 2024 election.",
                "author": "duckduck"
            },
            {
                "raw_content": "Despite democrat denial and gaslighting, Trump WAS NOT elected to lower the price of eggs. We want our country BACK",
                "author": "magapatriot_pa"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: President Trump Announces First Ever Assistant Attorney General to Investigate Fraud Nationwide",
        "score": 1452,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ah, Blondi's getting sidestepped.",
                "author": "julianReyes"
            },
            {
                "raw_content": "This is fine and all. But will we see real arrests (political figure heads) or just some random Joe Blow that has no clout? We know of so much fraud, that there should be about 10 arrests a day... If not more!",
                "author": "Bots_Play_Here"
            },
            {
                "raw_content": "Somali scammers, Jewish welfare scammers, Indian scammers. Our country is a joke thanks to the weak Biden admin.",
                "author": "Fecklessgod"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: President Trump just posted that the FBI left with 700 2020 ELECTION BALLOT BOXES in Fulton County, Georgia",
        "score": 800,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Those retards had 5 years and still didn't get rid of them all?",
                "author": "PapaPepe"
            },
            {
                "raw_content": "Trump Won 2020!",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "&#65038; I want to depose Ruby and her daughter. &#65038; On a police bodycam Ruby was talking about a USB port and a USB thumb drive. &#65038; >But the other part, the USB pull, that’s a totally different thing and to me, the County don’t care about clearing that because that was something I had in my name, so they say. At first, even though the County said doing ballots was the only. And that’s why I want an attorney because I know that my name needs to be cleared with that. It was on youtube videos and everything and I know I need an attorney.” &#65038; (57:09) RF: “It is serious. It is deep. It is so real, It is so…They will not. They will believe it because I’m good at explaining myself if I’m right.” “But the USB ports, but really, I really, I would love to go live with that because the ballots is history. Even though my name is still lingering but if they want to do it (Inaudible) But now it’s the USB ports, so I need an attorney, I want to go live, I’ll go live on every platform. And it will blow your mind. And you are going to be amazed at that picture…” “I want an attorney and I want to go live. And I need an attorney and I can tell you then....\". ( Georgia Record.): https://www.georgiarecord.com/elections/2022/12/25/ruby-freeman-body-cam-admissions-revealed-in-the-georgia-ballot-scanning-scandal/ &#65038;",
                "author": "BallotsOnRubysUSB"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 Tucker Carlson reveals the Offer the Trump Administration made to Minnesota Officials that hasn’t been made public yet — MN Officials said no",
        "score": 1045,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yeah, Walz isn’t going to let go of his pedo base that easily. This info should be blasted everywhere though…!",
                "author": "GodIsPerfect"
            },
            {
                "raw_content": "A disgusting offer that never should have been extended in the first place *Insurrection Act*",
                "author": "Dangerous"
            },
            {
                "raw_content": "Democrats ❤️ Rapists and Pedos",
                "author": "DingleBalls"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Theater Kid Communists",
        "score": 647,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So true... right out of Central Casting.",
                "author": "FearGodTheAlmighty"
            },
            {
                "raw_content": "Gen X-er here. Have no fucking idea what this means. Explanations appreciated.",
                "author": "justnoticingthings"
            },
            {
                "raw_content": "aka bad actors",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I love how mentally insane shitlib women make themselves so easy to spot so we can avoid them like the fucking plague.. Keep it up ladies.... I mean \"theys\" LOL",
        "score": 594,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Shave your eyebrows too since Renee Good's were hideous. ^ ^",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "\"I shaved my head for a woman I believe in so much that I spelled her last name wrong.\"",
                "author": "bringbackthe80s"
            },
            {
                "raw_content": "Ladies, if you want to have your Britney moment, go right ahead. It just makes you that much easier to spot and avoid.",
                "author": "Moose_Antlers"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Ilhan Omar just went FULL radical: “Voting no on DHS funding bill is the bare minimum. Backing the resolution to impeach Kristi Noem is the bare minimum. Holding law-breaking ICE agents legally accountable is the bare minimal. We must abolish ICE.”",
        "score": 929,
        "text_content": "",
        "comments": [
            {
                "raw_content": "She's just saying that because she's scared of ICE. This cunt is illegally in our country.",
                "author": "Trumpwonbidencheated"
            },
            {
                "raw_content": "Deporting Omar is the bare minimum",
                "author": "DingleBalls"
            },
            {
                "raw_content": "\"Someone needs to spray you to take attention off your fraud,\" said Ilhan's handler.",
                "author": "RadicalCovfefe"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "New Footage Appears to Show Alex Pretti Spitting on Federal Law Enforcement Officers and Kicking Tail Light of Their Vehicle One Week Before His Death - Cristina Laila",
        "score": 1172,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Imagine dying for a 68iq lightbulb head street shitter",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "Democrats never mature and grow up, they always act like dumb children.",
                "author": "38WendysHamSquare79"
            },
            {
                "raw_content": "He was just a nurse! (Please ignore his Antifa qualities) -MSM, probably",
                "author": "Chuj"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Melania was a guest on \"The Five\" earlier tonight. Here is her full 10-minute appearance, for those who missed it. Topics of discussion include her new film in theaters January 30, Donald's dance moves, Barron, and more!",
        "score": 790,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ty for this - i love when she speaks but she doesnt enough (probably to not take the spot light off the king which i respect)",
                "author": "America_No_1"
            },
            {
                "raw_content": "If you have trouble with the video embedded above from catbox.moe and can't see the video, you can also try this youtube link to watch it: https://www.youtube.com/watch?v=XxRcSdTFzh0",
                "author": "ItsFunToSay-M-A-G-A"
            },
            {
                "raw_content": "There are some more nice photos of FLOTUS from her visit to the New York Stock Exchange this morning over on this post that links to the Daily Mail: https://patriots.win/p/1ARwnUjgDJ/melania-trump-stuns-in-businessc/c",
                "author": "ItsFunToSay-M-A-G-A"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Governor @GregAbbott_TX directed the Office of the Attorney General to launch an investigation into the Council on American-Islamic Relations.",
        "score": 466,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"investigation\" = \"do nothing\"",
                "author": "itsallascam6"
            },
            {
                "raw_content": "https://x.com/GovAbbottPress/status/2016549417986248734?s=20",
                "author": "Belleoffreedom"
            },
            {
                "raw_content": "Collect, probe, document, gather, index, count, record, and photograph. It’ll all be very important when the pisslamics start flying off the handle about it.",
                "author": "YaharaRiver"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Sorry, sir. \"We are at or beyond that point\"",
        "score": 888,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No shit. But you suggest anything resembling a legitimate solution and get shouted down as a glowie.",
                "author": "Rydanovich"
            },
            {
                "raw_content": "Many of us WANT shit to go down Because right now things are getting worse and it appears that their side is getting away with far too much and that 'brat' has become much too dangerous",
                "author": "5DchessWatch"
            },
            {
                "raw_content": "I am well past that point. There is no talking to these creatures. Smash those fucking losers. Grind them to dust under heel and sort the situation after, without their input.",
                "author": "DoMe22"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Fucking legend",
        "score": 1312,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Top kek, can you lower taxes now please I just want to live",
                "author": "Modernturnkey"
            },
            {
                "raw_content": "😀😀😀😀😀",
                "author": "TEXinLA"
            },
            {
                "raw_content": "It IS fucking awesome. This is how Americans pass the time!! 😂😂😂👍 i love it to pieces",
                "author": "YaharaRiver"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Leader John Thune promises the SAVE ACT WILL be brought to a floor vote. The House is currently ADDING to the SAVE Act to not just include citizenship to vote — but PHOTO ID to vote.",
        "score": 1663,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Will Rand Paul or Massee complain it violates civil liberties?",
                "author": "Shitsbrokeyo"
            },
            {
                "raw_content": "He's acting all tough and \"Republican\" when he probably knows there are not enough votes for this to get to Trump's desk to sign.",
                "author": "Colorado-Living"
            },
            {
                "raw_content": "Brought to the floor. That means he knows for sure Collins, Murkowski and the usual traitors will vote it down.",
                "author": "PapaPepe"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Actress Molly Ringwald: If You Support Trump's 'Fascist' Policies You'll Be Found Guilty of Treason When Leftists Take Over. (and WE'RE the nazis?)",
        "score": 1325,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Simple. The left must never allowed to gain power ever again. IF they do, immediate revolution",
                "author": "5DchessWatch"
            },
            {
                "raw_content": "Fuck this has been cunt bitch!!!!!!!!!",
                "author": "redneckrevival"
            },
            {
                "raw_content": "Where were you for the murder of thousands of Americans at the hands of filthy invading scum? ANSWER THE QUESTION, CLAIRE.",
                "author": "Mike_Hoxbigg"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Newly obtained BBC footage shows a man who looks like Alex Petti, armed, spitting at federal agents, and kicking out a taillight one week before the CBP incident that resulted in his death.",
        "score": 1322,
        "text_content": "",
        "comments": [
            {
                "raw_content": "ahh yes, another peaceful \"observer\"...",
                "author": "abstr4ct"
            },
            {
                "raw_content": "Got what he deserved.",
                "author": "MrMcGreenGenes"
            },
            {
                "raw_content": "Yep. That's him. Same getup and everything. Interesting how when he was shot, he was what their signal chat calls \"recorder,\" but one week prior he was what they call \"engager.\" Creating something worthy of being recorded. His hair is very thin here, and not thick like that AI photo of him on his knees that's been going around. So he brought a gun to both this prior incident and his final incident?",
                "author": "billybaldwin2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "NEW - Head of the U.S. cyber defense agency CISA, Madhu Gottumukkala, uploaded sensitive contracting documents into a public version of ChatGPT, triggering a DHS security review",
        "score": 1178,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Just another H‐1B traitor",
                "author": "DiamondDroid"
            },
            {
                "raw_content": "fucking H1B pajeet.",
                "author": "bigrex64"
            },
            {
                "raw_content": "What a common American name. Totally normal",
                "author": "ToxicAvengerOhio"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Exclusive: Nvidia to reportedly shift 2028 chip production to Intel, reshaping TSMC strategy",
        "score": 407,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The title is a bit misleading as this is only the I/O die and advanced packaging, but probably the best Intel could have hoped for. INTC up 11% today on the news.",
                "author": "Visible-Advice-5109"
            },
            {
                "raw_content": "Jensen casually pulling a company out of a shallow grave lmao.",
                "author": "XWasTheProblem"
            },
            {
                "raw_content": "Does this include Apple? The article talks about Apple too but doesn’t conclude anything",
                "author": "DeuzExMachina_"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[der8auer] AMD Wrecks Efficiency for Just 4% More Performance - 9850X3D Review",
        "score": 219,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I mean, the reality is that it is just a quick and lazy refresh right? the two chips are pretty much identical, just with higher clocks. You'd assume that as a \"flagship\" level chip initially, AMD didn't leave too much performance on the table",
                "author": "Uptons_BJs"
            },
            {
                "raw_content": "to the surprise of no one. on the plus side the msrp is only an extra 20",
                "author": "adamosmaki"
            },
            {
                "raw_content": "Intel KS-style refresh, as expected. Just wish they also binned the IOD.",
                "author": "dinktifferent"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "SK Hynix surpasses TSMC in Q4 profit margin, 1st time in 7 years",
        "score": 147,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Both companies making absurdly high profits.",
                "author": "Visible-Advice-5109"
            },
            {
                "raw_content": "The Hyundai CEO must be very annoyed right now, because SK Hynix's original name was \"Hyundai Electronics.\" LOL",
                "author": "Entire_Judge_2988"
            },
            {
                "raw_content": "Memory manufactures got busted for price fixing a couple times in the past. Sucks they can get away with it now due to \"AI\"",
                "author": "nova8808"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung May Raise iPhone LPDDR Prices by Over 80% QoQ; SK hynix Reportedly Near-100% Increase",
        "score": 75,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How much would this affect BOM and total price? Are we looking at a reduction in RAM (potentially throttling their local AI hopes) or a significant price increase of $100-200?",
                "author": "letsgoiowa"
            },
            {
                "raw_content": "It's been said before and it bears repeating again and again: Literally anything with ram inside it has, and will continue to feel the pinch. SSDs HDDs, GPUs, TVs, Routers, Smartphones, computers, any \"smart\" device or appliance with a soc. There is no escape the rampocalypse and margin growth that is unlikely to deflate without CMXT inventory showing up in your country. Micron, SK Hynix and Samsung will not \"give back\" the DRAM margin expansion here in any meaningful way, even *if* the suppy situation improves in 2027/28, as that would cause the line to go down and to the right, when it needs to keep going up and to the right. In the same way GPU prices are higher now on aggregate after coming out of Covid, ram prices will follow suit, and it is unclear when ram supply will improve so long as the train is firmly still on the AI data center rails.",
                "author": "xNaquada"
            },
            {
                "raw_content": "If they can do this despite 3 LPDDR suppliers (MU sells LPDDR), the demand must be insane.",
                "author": "Crazy_Donkies"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Why did ASUS abandon the idea of putting SSD mounts on GPUs?",
        "score": 39,
        "text_content": "I just learned about the ASUS 4060 Ti card which had an M.2 slot on it. This seemed like an excellent idea: * Utilizes PCIe lanes that are unused by the card and would otherwise be 'wasted'. * Provides almost unmatched cooling for the SSD. * Provides additional M.2 slot (which motherboards in lower price brackets may have fewer of). * Even if the motherboard does have spare M.2 slots, they may be Gen 4 ones running off a congested chipset. The graphics card solution will be Gen 5 lanes connected directly to the CPU. When I looked to see if ASUS had repeated this for the current generation, all I found was a 5080 ProArt SSD edition which seems to have been vaporware and makes far less sense in the first place (5080 isn't an 8x card, so you're robbing lanes from the GPU, people with 5080s are less likely to have M.2-starved motherboards, etc.) So why was this concept so short-lived? Was it related to patchy PCIe bifurcation support on motherboards making the whole thing more trouble than it was worth for ASUS?",
        "comments": [
            {
                "raw_content": "Probably didn’t sell well.",
                "author": "imKaku"
            },
            {
                "raw_content": "Probably that now even budget micro-boards come with 2 x M.2 slots. A mid-range board that would likely be paired with this would usually have 3--how many folks are running 4 M.2 drives? Dozens probably.",
                "author": "xylopyrography"
            },
            {
                "raw_content": "How many people need more than 2 SSDs but only want a mid range GPU? It only fits a very niche use case like an ITX/SFF system that can't fit a PCIe to m.2 adapter.",
                "author": "vegetable__lasagne"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[TechPowerUp] AMD Ryzen 7 9850X3D review",
        "score": 74,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Margin of error improvements...seems like a pointless release, the $30 price premium presumably reflects this.",
                "author": "jenny_905"
            },
            {
                "raw_content": "tl;dr +1-2% stock +2-4% PBO [worse than expected](https://old.reddit.com/r/hardware/comments/1qi35je/machines_more_9850x3d_vs_9800x3d_whats_in_400_mhz/o0oe2co/)",
                "author": "kikimaru024"
            },
            {
                "raw_content": "11% extra $$$ for ONE % extra performance on average (2.5% best case) ?\\ F*#k that.",
                "author": "Standing_Wave_22"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "HUB - AMD Ryzen 7 9850X3D Review & Benchmarks vs. 9800X3D, 7800X3D, 285K, 14900K",
        "score": 59,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TLDW: 14 game average: 9850X3D was: - 5% faster than the 9800X3D - 15% faster than the 7800X3D when CPU limited - 28% faster than the 14900K - 34% faster than the 9700X - 43% faster than the 5800X3D",
                "author": "Antonis_32"
            },
            {
                "raw_content": "5% faster for 20+% more powerusage - yay",
                "author": "f1rstx"
            },
            {
                "raw_content": "Hardware Canucks ripped AMD a new one lol.",
                "author": "RedIndianRobin"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung reportedly channels most 1c DRAM capacity into HBM4 for early 2026 mass production",
        "score": 40,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Requires a paid subscription unfortunately. Could you share the text here?",
                "author": "Jesusthegoat"
            },
            {
                "raw_content": "Another Samsung article from Digitimes using the words \"reportedly\", \"allegedly\", \"rumors suggest\", etc. How about they actually report what they factually know and refrain from fud? Oh right, its for clicks to sell their subscription.",
                "author": "ML7777777"
            },
            {
                "raw_content": "1c was developed to be used in HBM4, with other DRAM products following the same way advanced logic nodes usually start scale production with either premium mobile SoCs or server chips. DDR5 can be made on 1a, so unless this 1c line was built by upgrading an older factory it won't have any impact on consumer products for awhile. Just want to put that out there before any reactionaries start typing.",
                "author": "clicky_fingers"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Just officially received my refund for Dispatch",
        "score": 448,
        "text_content": "Earlier today after learning of the non-optional censored version of Dispatch on Nintendo Switch only after purchasing the game I called Nintendo support and formally, politely, and firmly requested a refund. And as of 20 minutes ago I can confirm I’ve received my refund.",
        "comments": [
            {
                "raw_content": "I don't care if I see boobs in a game or not but this situation is so weird when I can go hop on cyberpunk and choose how large my naked penis is",
                "author": "theclawl1ves"
            },
            {
                "raw_content": "Good. The censorship is bad itself, but the lack of transparency of the studio shouldn't be rewarded. They knew and chose not to share it, deceiving potential players by not telling they were getting an inferior product.",
                "author": "kahabraham"
            },
            {
                "raw_content": "Still waiting on mine. The Nintendo support person said they don’t usually give out refunds but are making an exception for this situation. I really wish Nintendo would allow refunds when you’ve only played the game for less than an hour. Similar to steam.",
                "author": "Much_Excuse1835"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Dispatch Censorship Is Ridiculous",
        "score": 905,
        "text_content": "I preloaded the game and I won't play it until they remove the censorship. They should have a setting to enable/disable the censorship. I don't care if its Nintendo who requested it or the publisher, but something has to get​ done ​immediately to remove such censorship or to give the user the option to. Edit: I ​contacted the developers to let them know how absurd this is. Their email is [contact@adhocla.com](mailto:contact@adhocla.com) if you have time send them a ​quick email and let them know Another edit: I was able to get a refund. I pay my own ​bills and taxes, I don't need any company to dictate what mature content needs to be removed from an already finished and released product for me. I STRONGLY encourage anyone who bought it on the Switch/Switch 2 to ask for a refund. These companies mostly care about money, once they realize that profits are low, they'll listen to the consumers. Link to ask for a refund: [https://en-americas-support.nintendo.com/app/contact](https://en-americas-support.nintendo.com/app/contact)",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/qmvz6lqtn5gg1.jpeg?width=640&format=pjpg&auto=webp&s=f8a42dd61a5d32966f74f4b0a725664a6825a22e Meanwhile in SMT V",
                "author": "FinestKind90"
            },
            {
                "raw_content": "What exactly did they censor? I played on PC and therr were option to turn on and off the nudity and profanity, it makes no sense that the Switch version dosent have the options",
                "author": "GaT0M"
            },
            {
                "raw_content": "Also, the lack of transparency of the developers/publisher is ridiculous. They only said something because youtubers were posting reviews today and the information are out in the wild. They clearly wanted people to find out once they couldn't get a refund.",
                "author": "kahabraham"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Really enjoying Final Fantasy VII Remake",
        "score": 233,
        "text_content": "5 or so hours in",
        "comments": [
            {
                "raw_content": "Im just starting it. The first scorpion mech boss was great. I love the gameplay, it's really cool how you still switch characters and use the menus a lot but then it's also real time combat too. Can't explain it well haha but I love how the combat is in this game",
                "author": "gothamz77"
            },
            {
                "raw_content": "Loved it on PS5. Looks impressive on the switch 2!",
                "author": "GrapeDraculaura"
            },
            {
                "raw_content": "Finished it on PS5, and man, this game has such a cool vibe.",
                "author": "G_litchR_unner"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Just beat Final Fantasy 7 Remake Intergrade for the first time on Switch 2, and god what an amazing game/journey this was!",
        "score": 123,
        "text_content": "Definitely one of the best action RPGs I've played! The game looked beautiful and ran amazingly in handheld mode. Played a little bit in docked as well and it looked amazing there too. Definitely one of the best Switch 2 Ports/Games available right now (until Rebirth/Part 3 comes out). Loved all the characters in this game so much! And all the music in this game sounded amazing! Excited to jump back into Hard Mode to complete some Enemy Intel/Shinra Combat Simulator battles/Bahamut Summon Fight. Also excited to start Intermission as I heard that's also pretty good! Hoping the Rebirth Port comes out later this year! Hoping Part 3 will come out next year as well. If you have any interest in this game then go buy it!",
        "comments": [
            {
                "raw_content": "How long did it take you? I literally just bought the game about 30 minutes ago. Can’t wait to play it!",
                "author": "Jealous_Inevitable33"
            },
            {
                "raw_content": "Game is a masterpiece glad to see so many enjoy it now that its on Switch",
                "author": "OilersHD"
            },
            {
                "raw_content": "I just finished it too about 2 hours ago and already bought rebirth on my pc. It took me about 30 hours to finish, havent finished the dlc",
                "author": "GrouchyMembership876"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "looks like the Disney Afternoon Collection will be fully on cart",
        "score": 204,
        "text_content": "",
        "comments": [
            {
                "raw_content": "![gif](giphy|pCO5tKdP22RC8)",
                "author": "I_Heart_Sleeping_"
            },
            {
                "raw_content": "Has the price been announced?",
                "author": "GodzillaMinus83"
            },
            {
                "raw_content": "https://preview.redd.it/h5hq3mztz6gg1.jpeg?width=640&format=pjpg&auto=webp&s=0b33c20f13e5d24a43e988748b9e8041fea1eaf7 “But why now? Why not 8 years ago?” Seriously though this is great news.",
                "author": "MegaDitto13"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I love my switch 2 so happy with all the news coming up",
        "score": 407,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Cool what news are you guys excited for?",
                "author": "Coolfresh12"
            },
            {
                "raw_content": "Enjoy FF7 Remake!",
                "author": "lingering-will-6"
            },
            {
                "raw_content": "Love mine too, not to sound dramatic but it's kind of revitalized gaming for me and opened me up to more genres. I'm playing and looking forward to games I would not normally play.",
                "author": "Rare_Ad_3871"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "\"The core narrative and gameplay experience remains identical\" AdHoc reassures Dispatch players on Switch as it confirms Nintendo platform versions are censored",
        "score": 211,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It’s a bit baffling with Cyberpunk right there",
                "author": "VicViolence"
            },
            {
                "raw_content": "Then why you waited until one day before the release to say anything?",
                "author": "kahabraham"
            },
            {
                "raw_content": "Just finished my refund support chat.",
                "author": "JBL561"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "MLB 26 skipping Switch 2 again…",
        "score": 56,
        "text_content": "Next year’s game in March will be for Switch 1 only again for anyone hoping they would join Madden and NBA with a real Switch 2 release.",
        "comments": [
            {
                "raw_content": "with how bad the game looks while docked it’s really sad. The switch 2 can handle all the current gen features. They barely upgrade the game year to year and yet can’t even put in a tiny bit of effort to make it look decent on switch 2. I’d pay good money for a portable version that looks decent.",
                "author": "Billwinkle0"
            },
            {
                "raw_content": "How is it \"again\" when the console wasnt even out for the previous release?",
                "author": "Redred1717"
            },
            {
                "raw_content": "I put in 30 hours on TS25 last year, looks like shit but always fun. There is literally no reason for me to buy this one if it looks the same",
                "author": "epicchili"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The Division: Definitive Edition",
        "score": 81,
        "text_content": "Apparently it's just a complete edition that includes all the contents prev: [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1qa4ljw/the\\_division\\_definitive\\_edition\\_banner\\_spotted\\_at/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1qa4ljw/the_division_definitive_edition_banner_spotted_at/) source: [https://www.youtube.com/watch?v=AchwOtcG438](https://www.youtube.com/watch?v=AchwOtcG438) [https://bsky.app/profile/maverickcw.bsky.social/post/3mdim5ncpl22n](https://bsky.app/profile/maverickcw.bsky.social/post/3mdim5ncpl22n)",
        "comments": [
            {
                "raw_content": "So it's not even a current gen port?",
                "author": "Hayterfan"
            },
            {
                "raw_content": "So just Gold+ usually overpriced Cosmetic and skin man, I wish these game playable offline. beat both completely solo, no reason it couldn't have separate system if they want to",
                "author": "rickreckt"
            },
            {
                "raw_content": "Took them ten years to make a version of the game where it's the game and it's DLCs Fascinating",
                "author": "LadyValtiel"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Official Assassin's Creed account replies to AC Black Flag Recynced statue leak",
        "score": 594,
        "text_content": "https://xcancel.com/assassinscreed/status/2016531108486095252#m",
        "comments": [
            {
                "raw_content": "I mean shit that’s one way to confirm a game",
                "author": "Sudden-Percentage346"
            },
            {
                "raw_content": "It would be hilarious if the social media team for Assassin's Creed didn't get the memo about this game being delayed, and now they're ramping up engagements for the original March 2026 release date.",
                "author": "MuptonBossman"
            },
            {
                "raw_content": "HUH?? BROTHER W H A T",
                "author": "TheBoiNoOneKnows"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Tomb Raider Catalyst leaker suggest it will be open world",
        "score": 364,
        "text_content": "- VScooper was the first to leak the Nothern India setting back in 2024 - He is a primarily a leaker of movies/television with a verified record of accurate leaks - Crystal Dynamics is also marketing this as the “largest Tomb Raider world yet” Source: [https://xcancel.com/thevscooper/status/2015902119442706899#m](https://xcancel.com/thevscooper/status/2015902119442706899#m)",
        "comments": [
            {
                "raw_content": "This is probably fine depending on how they do it. Archeology kinda makes sense with lots of little things scattered everywhere. As long as it’s reasonable scaled and interesting.",
                "author": "GoldenTriforceLink"
            },
            {
                "raw_content": "Just let her keep her acrobatics, PLEASE. I'm begging you, I want her to do her flips and dramatic ass stuff again.",
                "author": "Hydroponic_Donut"
            },
            {
                "raw_content": "It’s gonna be like the Survivor Trilogy, it’s not a traditional Ubisoft open world yall are thinking",
                "author": "Relo_bate"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Kingdom Come Deliverance PS5 information seemingly published early on Italian PSN Store",
        "score": 238,
        "text_content": "An additional blurb has been added to the description of KCD1 in PSN Italia, alongside a slightly retouched and recolored keyart image. Translated to English it reads: *The PS5 version of Kingdom Come: Deliverance now features graphical upgrades including 4K resolution, an improved frame rate, high-resolution textures, and much more.* *Medieval Bohemia has never looked so beautiful.* EDIT: This change appears to have taken effect across several/all PAL region PlayStation stores (thanks u/salromano for pointing out) Doesn't make clear whether it's a native version or a 4K/60 patch, though the discovery of a PS5 listing on the store last summer would indicate it's more likely a native version. Personally hoping it's a native version and supports save transfer from PS4. Recent discussion on r/kingdomcome has indicated the upgrade is targeting a February release. I believe this originated from a \"my friend works at Warhorse\" type of claim, with no previous track-record other than some correct predictions about KCD2 being delayed into 2025. But it's all we have to go on, and this new activity on the KCD store listing may back that up. PSN Italia link: [https://store.playstation.com/it-it/product/EP4062-CUSA07180\\_00-KCDGAME010000000](https://store.playstation.com/it-it/product/EP4062-CUSA07180_00-KCDGAME010000000) Previous rumor: [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1mdsewq/kingdom\\_come\\_deliverance\\_1\\_may\\_be\\_getting\\_a/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1mdsewq/kingdom_come_deliverance_1_may_be_getting_a/)",
        "comments": [
            {
                "raw_content": "It's not just Italy, it's the PAL stores in general. Here's the English description from the UK store: [https://store.playstation.com/en-gb/product/EP4062-CUSA07180\\_00-KCDGAME010000000](https://store.playstation.com/en-gb/product/EP4062-CUSA07180_00-KCDGAME010000000) >**Updated for PlayStation 5** >The PS5 version of Kingdom Come: Deliverance now features graphical updates including 4K resolution, improved framerate, high-resolution textures and many more. Medieval Bohemia has never been so beautiful.",
                "author": "salromano"
            },
            {
                "raw_content": "Hopefully a free upgrade for owners",
                "author": "DeadlyDY"
            },
            {
                "raw_content": "![gif](giphy|6eAbNaPng9nIbQ1XTN)",
                "author": "Qunyro"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Disney afternoon collection switch and switch 2 confirmed",
        "score": 130,
        "text_content": "Previous leak: https://www.reddit.com/r/GamingLeaksAndRumours/s/zKn4ZT3yvk Source: Japanese eshop pages https://nintendoeverything.com/the-disney-afternoon-collection-confirmed-for-nintendo-switch-2-and-switch-will-have-two-new-games/ Game will include two new snes games bonkers and the good troop",
        "comments": [
            {
                "raw_content": "What I’m wondering is if the collection will be updated on other platforms to match the S/S2 version",
                "author": "Fluffy_Fail_547"
            },
            {
                "raw_content": "Fucking wild it took this long. This came out like a month or two after Switch released and was all NES/SNES games but was available on everything else I can't believe we got Marvel vs. Capcom on Switch before DuckTales lmao",
                "author": "MyMouthisCancerous"
            },
            {
                "raw_content": "I had never even heard of the game Bonkers before this. Wish the three Capcom Mickey Mouse games would be available too, either added to this in the future, or in a collection of its own.",
                "author": "mjo011"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "AMD Ryzen 7 9850X3D Review Roundup",
        "score": 107,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Have any of the reviewers addressed if the IMC is better with heavier overclocks? Most of them seem to have gone the other way to test the claim that the 3d cache makes binned memory less important. I just wanna know if this one is better at heavy memory OC, because memory OC is fun!",
                "author": "SubPrimeCardgage"
            },
            {
                "raw_content": "its just a KS from AMD instead of intel.",
                "author": "EnderPrimeMk2"
            },
            {
                "raw_content": "The best reviews are those from Hardware Canucks and Der8auer, slamming the CPU for being power inefficient and running hot for just a bunch of additional frames... on a 5090.",
                "author": "BNSoul"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Ryzen 7 9850X3D CPU Review & Benchmarks | Gaming, Power, & Thermals,...",
        "score": 83,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The most interesting part of this review is the inclusion of DDR5-4800 which proved almost as fast as their regular test setup in most of the gaming tests.",
                "author": "ArseBurner"
            },
            {
                "raw_content": "Pretty sure I read the review embargo is going to be lifted tomorrow 1/29 lol",
                "author": "GamerInfinity1996"
            },
            {
                "raw_content": "I don't get the constant mentions of the 9800x3d, as if this was ever going to be an upgrade for 9800x3d owners. \"It's just 4%!\", ok, but to the target demographic, people who are finally coming into AM5, this is a good cpu for the extra 30$.",
                "author": "blackest-Knight"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Ryzen 7 9850X3D Linux performance",
        "score": 23,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "VASTARMOR lists Radeon AI PRO R9700 with 32GB GDDR6 and 2920 MHz boost",
        "score": 12,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If someone were to make a Radeon R9700 with 8 pin power connectors, I'd probably buy one",
                "author": "Nuck_Chorris_Stache"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Ryzen 7 9850X3D Review & Benchmarks vs. 9800X3D, 7800X3D, 285K, 14900K",
        "score": 12,
        "text_content": "",
        "comments": [
            {
                "raw_content": "3% faster than 9800x3D on avg at 1080p medium settings, DDR5 4800 CL40 vs DDR5 6000 CL30 around 1%-2% performance hit on avg",
                "author": "TheFather__"
            },
            {
                "raw_content": "How come der8auer and other media outlets manage to test this cpu (and show essentially the same outcomes) at meaningful resolutions/settings (example: 1440p ultra with raytracing) while amdunboxed show these idiotic 1080p medium settings scenarios? Completely unnecessary.",
                "author": "Aggravating_Ring_714"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Mortgage demand drops 8.5%, as interest rates swell to the highest level in 3 weeks",
        "score": 261,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yen carry trade is unwinding— that’s where a lot of the upward pressure is coming from",
                "author": "TheMasturbatinCamper"
            },
            {
                "raw_content": "Jerome Powell just spoke.. tune in!",
                "author": "Asleep_Protection_32"
            },
            {
                "raw_content": "KEY POINTS * Last week the average contract interest rate for 30-year fixed-rate mortgages with conforming loan balances increased to 6.24% from 6.16%. * Applications to refinance a home loan dropped 16% for the week. * Applications for a mortgage to purchase a home were essentially flat. After dropping sharply, mortgage interest rates rose last week for the first time in a month. That pushed total mortgage demand down 8.5% compared with the previous week, according to the Mortgage Bankers Association’s seasonally adjusted index. The average contract interest rate for 30-year fixed-rate mortgages with conforming loan balances, $832,750 or less, increased to 6.24% from 6.16%, with points rising to 0.55 from 0.54, including the origination fee, for loans with a 20% down payment. That was the highest rate in three weeks. As a result, applications to refinance a home loan dropped 16% for the week, but they were still 156% higher than the same week one year ago. That is because rates a year ago were 78 basis points higher. “FHA refinance activity bucked the overall trend and increased, as FHA rates remained almost 20 basis points lower than conforming rates,” said Joel Kan, MBA’s vice president and deputy chief economist, in a release. “With rates holding in the 6 percent range, the refinance market is likely to remain sensitive to week-to-week rate movements.” Applications for a mortgage to purchase a home were essentially flat, down 0.4% from one week earlier and 18% higher year over year. Homebuyers are still facing a very pricey market. There is more supply than last year, but most of it is on the high end. “The average loan size stayed at its highest level since September 2025,” Kan added. Mortgage rates moved slightly lower to start this week, according to a separate survey from Mortgage News Daily. The next chance for a sizeable move in rates in either direction comes Wednesday with the latest meeting of the Federal Open Market Committee. Most expect it to keep its benchmark interest rate unchanged, but markets will be ready to react to commentary from Federal Reserve Chair Jerome Powell.",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Federal Reserve holds key interest rate steady as economic view improves",
        "score": 100,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Oof. More layoffs in Q1 it is.",
                "author": "Foreign_Addition2844"
            },
            {
                "raw_content": "The economy is NOT improving!",
                "author": "BTC_90210"
            },
            {
                "raw_content": "The money market essentially choked on an over-issuance of 3.5% T-bills last December - the govt issued more short-term paper than the market had demand for, and the Fed had to print $40B to buy up the Treasury's excess. That's like holding a garage sale, and then having to buy your own shit back after no one else takes it. You can't raise your garage sale's prices after that. The Fed is as low as they can go right now. They can't cut the short-term rate if they wanted to, even if they didn't care about inflation (they don't). As far as housing, the 10 year spread is trading tight vs the overnight rate (as tight as you can go after 5 years of over-target inflation with no end in sight), and mortgage spreads are historically normal vs the 10 year. In other words - mortgage rates are about as low as they can go too. There may be another quarter-point to squeeze if mortgage spreads vs Treasurys go from \"normal\" to \"historically tight\", but the risk is all to the upside at this point. Everyone's waiting on pins and needles for 2010s mortgage rates to come back, but they can never come back unless we get 2010s-style 1% inflation prints. It's that simple. If inflation is at 3%, the Fed can't move the overnight rate to under 3%, which means that you won't get long-duration rates under 4%, which means you won't get mortgage rates under 6%.",
                "author": "ThisKarmaLimitSucks"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "In some states, a push to end all property taxes for homeowners",
        "score": 19,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Just boomers trying to pull the ladder up farther. Now that they are retired, income tax matters to them less. They are more worried about staying in their mc mansions, and having everyone else foot the bill.",
                "author": "CLow48"
            },
            {
                "raw_content": "Politicians say that just to get re elected/ elected. Smoke and mirrors.",
                "author": "Single_Catus"
            },
            {
                "raw_content": "Our kids are struggling if anything taxes need to go up. We need to get our kids more education and it's time to quit subsidizing boomers at the expense of our kids.",
                "author": "DizzyMajor5"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Ryan Serhant thinks the American Dream was just a 'slogan created by banks,' but it was really about FDR, the Great Depression, and an economic crisis",
        "score": 43,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "How I Can Support Your Real Estate Business as a Virtual Assistant",
        "score": 0,
        "text_content": "",
        "comments": [
            {
                "raw_content": "lmfao dropshipping",
                "author": "berniepanderz"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Conducting a research survey on interstate migration due to housing issues. Complete this short survey for a chance to win one of six $100 dollar gift card giveaways!",
        "score": 0,
        "text_content": "Hi y'all, I'm a student at Loyola Marymount University and am conducting this research project for my senior thesis. This survey is completely anonymous and should take no longer than 10 minutes to complete. I would really appreciate your help! Access the survey at the link: [https://mylmu.co1.qualtrics.com/jfe/form/SV\\_9WVhJGmiiqy2Djg](https://mylmu.co1.qualtrics.com/jfe/form/SV_9WVhJGmiiqy2Djg)",
        "comments": [
            {
                "raw_content": "Unreal this post has been up over 4 hours now, lol",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Zillow’s Best Markets for Home Buyers in 2026: Where Buyers Have Leverage and Upside",
        "score": 1,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Key findings: - Zillow identified the most buyer-friendly housing markets of 2026 among the 50 largest U.S. metros. - Indianapolis ranks No. 1 among 50 metros for buyer-friendly housing conditions in 2026. Atlanta, Charlotte, Jacksonville and Oklahoma City round out the top five most buyer-friendly housing markets. - Indianapolis offers the best combination of affordability relative to local incomes, home value upside and lower competition according to Zillow’s Market Heat Index. After several years of tough conditions for buyers, there are reasons for optimism in 2026. Zillow’s outlook for 2026 calls for the housing market to settle into a healthier state, with buyers seeing a bit more breathing room. But the housing market isn’t moving in lockstep nationwide. An inventory crunch is creating competition among buyers in some markets — including Hartford, Zillow’s hottest housing market of 2026 — while strained affordability is limiting buyers in others. To help identify where conditions may be most favorable, Zillow ranked the most buyer-friendly housing markets of 2026. The ranking is designed to highlight places where buyers are more likely to find a balanced mix of opportunity and sustainability — not just lower prices, but a friendlier overall buying experience. Buyers in these markets can expect to see more homes within budget, while forecasted appreciation suggests strong long-term financial potential. With less competition for each home, buyers have more time to make decisions and a lower risk of being pulled into stressful bidding wars. What the Top Markets Have in Common Most of Zillow’s top 10 buyer-friendly markets are in the Midwest and the Sun Belt. Midwest housing markets generally avoided the steepest pandemic-era price run-ups, helping maintain their relative affordability. In the Sun Belt, new construction booms have helped inventory recover and eased competition for each home. In 5 of the 10 markets, a median household can afford a typical home — meaning a mortgage costs below 30% of income, assuming a 20% down payment. Buyers will still have to make tradeoffs to find a home in their budget that fits their needs, but with more inventory, more time and more latitude to negotiate on price, they will have more control over that process. Zillow’s most buyer-friendly markets of 2026: 1. Indianapolis 2. Atlanta 3. Charlotte 4. Jacksonville 5. Oklahoma City 6. Memphis 7. Detroit 8. Miami 9. Tampa 10. Pittsburgh 11. Columbus 12. Nashville 13. Orlando 14. Louisville 15. Houston See the top 49 cities below: https://www.zillow.com/research/best-markets-home-buyers-2026-35971/",
                "author": "SnortingElk"
            },
            {
                "raw_content": "lol imagine having to live in broke ass backwards Indiana",
                "author": "mps2000"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Nearly half of the Mag 7 are reportedly betting big on OpenAI’s path to AGI",
        "score": 327,
        "text_content": "Reports indicate NVIDIA, Microsoft, and Amazon are discussing a combined $60B investment into OpenAI, with SoftBank separately exploring up to an additional $30B. Breakdown by investor • NVIDIA: Up to $30B potential investment • Amazon: $10B to $20B range • Microsoft: Up to $10B additional investment • SoftBank: Up to $30B additional investment Valuation • New funding round could value OpenAI around $730B pre money investment, aligning closely with recent discussions in the $750B to $850B+ range. This would represent one of the largest private capital raises ever",
        "comments": [
            {
                "raw_content": "Well MSFT and NVDA aren't going to bet on Google.",
                "author": "CoolStructure6012"
            },
            {
                "raw_content": "Early-mid 2025 I felt like I was working on mind blowing ideas and solving problems enabled by 4.1 I think it was, Pro mode and all. Then I just got sick of it for a minute and started using Gemini, but I've not had a real good flow state working with any LLM since that glory window of OAI.",
                "author": "drewc717"
            },
            {
                "raw_content": "Everyone is betting on everyone. These companies all own pieces of each other.",
                "author": "simulated-souls"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Figure.Ai Helix 02 doing kitchen stuff autonomously",
        "score": 452,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Interestingly it looks like it's right handed",
                "author": "isoAntti"
            },
            {
                "raw_content": "Aw shoot. That reminds me I have to unload the dishwasher",
                "author": "heythereagain23"
            },
            {
                "raw_content": "The pause at the end as it contemplates the long dark teatime of the soul.",
                "author": "Parlicoot"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Genie 3 on the way",
        "score": 177,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Genie 3 was finished almost 6 months ago. Does this mean they're letting us have it? https://preview.redd.it/a0c3jqio97gg1.png?width=718&format=png&auto=webp&s=ff6cfdf94f5abe7486f69fbb30d760633fa19047 [https://deepmind.google/blog/genie-3-a-new-frontier-for-world-models/](https://deepmind.google/blog/genie-3-a-new-frontier-for-world-models/)",
                "author": "Gubzs"
            },
            {
                "raw_content": "I can't wait. But I also want to see what they have cooking for the next iteration regardless of whether we can use it or not. Genie 3 was such a big step up from genie 2, I can only wonder what Genie 4 will be like",
                "author": "Sextus_Rex"
            },
            {
                "raw_content": "Gemini 3 just one shotted genie 3",
                "author": "GamingDisruptor"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Moltbot: Open source AI agent becomes one of the fastest growing AI projects in GitHub",
        "score": 83,
        "text_content": "[Repo with 90k+ ⭐](https://github.com/moltbot/moltbot) **Source:** Github",
        "comments": [
            {
                "raw_content": "but what does it *do?* just sounds like it eats your RAM and spits out half-baked hallucinated AI slop",
                "author": "Dense-Bison7629"
            },
            {
                "raw_content": "This thing being all in plaintext, having full system access, is one of the worst security nightmares I've ever seen lol. Anyone who uses this is just hoping to get their shit hacked",
                "author": "Beatboxamateur"
            },
            {
                "raw_content": "[deleted]",
                "author": "None"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Google introduces Agentic Vision in Gemini 3 Flash",
        "score": 386,
        "text_content": "Agentic Vision, a **new capability** in Gemini 3 Flash, combines visual reasoning with code execution to ground answers in visual evidence. [Full Article](https://blog.google/innovation-and-ai/technology/developers-tools/agentic-vision-gemini-3-flash/?linkId=43682412)",
        "comments": [
            {
                "raw_content": "**Official** https://preview.redd.it/svy81oi7i5gg1.png?width=1080&format=png&auto=webp&s=661c3593d0aedf9d7d4682ffd4645c079a4d444e",
                "author": "BuildwithVignesh"
            },
            {
                "raw_content": "https://preview.redd.it/9hvr5runn5gg1.png?width=628&format=png&auto=webp&s=d211bd3d493add8216c8df96a2373098273d46ad its over",
                "author": "Coolnumber11"
            },
            {
                "raw_content": "They really took the \"hand\" trick personally, lol.",
                "author": "Areashi"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "A reminder of what the Singularity looks like",
        "score": 568,
        "text_content": "This image is worth keeping in mind, because I see a lot of posts here (often from people newer to the sub) that suggest a misunderstanding of what the singularity or an intelligence explosion actually means. For most of history, progress looks flat. Thousands of years of tiny, incremental improvements. Then it starts to curve… slowly. Agriculture, industry, electricity, computing. Still feels manageable, still feels “human-paced.” That’s the long, boring bit on the left. The key thing people miss is that exponential growth doesn’t feel exponential while you’re in it. It feels underwhelming right up until it doesn’t. For a long time, each step forward looks like “meh, slightly better than last year.” Then suddenly the curve goes vertical, not because something magical happened at that moment, **but because all the compounding finally stacks.** The singularity isn’t “AI suddenly becomes a god overnight.” It’s the point where progress becomes so steep and self-reinforcing that human intuition, institutions, and timelines stop being useful tools for prediction. The jump looks absurd only in hindsight. So when people say “this doesn’t feel that fast” or “we’ve been overhyped before,” that’s exactly what you’d expect if you’re standing near the little stick figure on the graph, right before the wall. If you’re waiting for it to feel dramatic before taking the idea seriously, you’ve misunderstood the shape of the curve.",
        "comments": [
            {
                "raw_content": "the singularity is a theoretical concept, not a law of nature. it is entirely possible that there are factors in the development of technology that simply cannot be sped up beyond a certain point. these bottlenecks could for example be 1) a lack of natural resources needed to produce something, e.g. for GPUs, or 2) a slow feedback process, e.g. in medical trials, where you sometimes have to wait many years to empirically prove that a treatment is safe.",
                "author": "fmai"
            },
            {
                "raw_content": "The thing with exponents is if you zoom out it looks like that but if you zoom in it still looks like an exponent. So the long tail on the left is agriculture and the curve up is industrialization. From industrialization we had like 200 years until computers and then computers had 30 years until the Internet and then the internet was 20 years until AI which had been 5 years since garbage and now we have agents doing things reliably. Now it will be about 2 years, then 1 year, then 8 months until the next few iterations. What ARE those iterations? Probably general purpose robotics, then coupled with onboard inference, then whatever next. But the point is the iterations are going faster and faster.",
                "author": "Vast-Breakfast-1201"
            },
            {
                "raw_content": "It started around 1842 to 1844. 99% of man's knowledge and discoveries are from this date.",
                "author": "DFiverr"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Google DeepMind launches AlphaGenome, an AI model that analyzes up to 1 million DNA bases to predict genomic regulation",
        "score": 330,
        "text_content": "DeepMind has published **AlphaGenome** today in Nature, a sequence model designed to predict functional and regulatory effects across long stretches of DNA, including non-coding regions. **Key points:** • Processes up to ~1 million DNA base pairs in a single context window and Trained on human and mouse genomes. • **Predicts** thousands of genomic signals including gene expression, splicing, chromatin structure and regulatory interactions • Matches or **outperforms** prior models on 25 of 26 benchmark tasks. Particularly strong on non-coding DNA, where most disease-associated variants are found. Only ~2% of **human DNA** codes for proteins. The remaining ~98% regulates how, when and where genes are expressed. AlphaGenome is designed to model this regulatory layer at scale, which is critical for understanding rare disease, cancer mutations, and gene therapies. The model and weights are being made **available** to researchers and the AlphaGenome API is already seeing large-scale usage. **Source:** Google Deepmind [Tweet](https://x.com/i/status/2016542480955535475) [GitHub](https://github.com/google-deepmind/alphagenome_research) and Research paper Linked with post.",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/lqodxo0pj4gg1.png?width=1080&format=png&auto=webp&s=cdfbb04245ad228085140cd85001a055bcb5ae12",
                "author": "BuildwithVignesh"
            },
            {
                "raw_content": "Deepmind is just farming Nobel prizes at this point.",
                "author": "CallMePyro"
            },
            {
                "raw_content": "One step closer to becoming a Foxgirl!!!",
                "author": "The_Scout1255"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Meta’s Reality Labs posts $6.02 billion loss in fourth quarter amid metaverse",
        "score": 23,
        "text_content": "**Source:** Bloomberg/CNBC [Full Article](https://www.cnbc.com/2026/01/28/metas-reality-labs-posts-6point02-billion-loss-in-fourth-quarter.html)",
        "comments": [
            {
                "raw_content": "Quest 3 is an amazing piece of hardware. They could have gone \"metaverse\" gang on the use cases outside of gaming. 3d movies and TV, they could have partnered with Netflix to create a VR Netflix app (which we don't have) and paid for some 3d content conversion of Netflix originals and made some originals themselves. Virtual shopping, they could have partnered with big clothing brands like Uniqlo to create a shop where you can virtually dress up and if you like it you can actually buy the physical product and get the virtual product for free to dress up in the horizon worlds Tools and productivity, they left this to 3rd party but they could have funded 1000 ideas and if they had one mega success that could have forced a lot of people into buying a headset just because of a paradigm shift in the process of doing something. A good example is if all digital pianos had quest capable on them and it would show your sheet music and help you learn / access lessons from AI or real tutors across the globe",
                "author": "mrSilkie"
            }
        ],
        "subreddit": "singularity"
    }
]