[
    {
        "post_name": "reminder: Boeing engaged $9/hr Indian engineers to build 737 Max software 👨🏽‍💻🛬",
        "score": 831,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No wonder everything works like shit.",
                "author": "TrumpWonByALandslide"
            },
            {
                "raw_content": "took 5 time longer with 100 times the length of code required. @$9/h basically buys monkey on typewriters.",
                "author": "BidenShowerDrool"
            },
            {
                "raw_content": "Boeing is a zombie company. They should have died in 2020 for the sin of burning through their own cash not to make a better product but rather bidding their own stock up in stock buybacks.",
                "author": "Kekerator"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Media is in an imposible position with Black murderer vs innocent Ukrainian Girl",
        "score": 726,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I refuse to updoot for spelling error I have my standards",
                "author": "NoWarWithIran"
            },
            {
                "raw_content": "He’s not a murderer, he’s the victim of a failed mental health system and systemic racism?",
                "author": "GoldenEarz"
            },
            {
                "raw_content": "It's not difficult at all. The Lying Liberal Media will always do what harms the White Race the most. (((They))) are very predictable.",
                "author": "LiberalsAreMental"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Nancy Mace watching Wikipedia for this.",
        "score": 755,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good. Wikipedia is leftist propaganda. It's not generally notable because the MSM refuses to acknowledge it happened.",
                "author": "KuzoKevin"
            },
            {
                "raw_content": "To be clear, the HOC is investigating Wikipedia based on claims from the ADL that it is a pro-Russia, anti-Ukraine, antisemitic propaganda machine.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "What's absolutely fucking hilarious is they won't have a page for Daniel Perry, but they do have this big piece of leftists propaganda. https://en.wikipedia.org/wiki/Murder_of_Garrett_Foster I was on to the Wikipedia con a long time ago when they were used to smear our business. Attempting to remove the inflammatory content was met with stone walling and other non-sense. That place is a left wing shit hole.",
                "author": "Snek_Plissken"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Your average VILE Democrat",
        "score": 553,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Your average rage bait troll",
                "author": "Prandogolio"
            },
            {
                "raw_content": "Not one bit of brain in the head of this piece of shit.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "It's time for a divorce with them.",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Rep. Randy Fine (R-FL) is filing legislation to TARGET any judge who releases violent criminals who go on to commit more crime - after the murder of Iryna Zarutska in Charlotte. \"Those 12+ judges that released Decarlos Brown Jr. should have their day in court too.\"",
        "score": 1057,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ok, if he can pull this off I will stop talking shit about Israel First Randy Fine.",
                "author": "1_Badcop"
            },
            {
                "raw_content": "Judges who make frivolous rulings also need to arrested or lose their license. When an activist judge makes a ruling that is blatantly and knowingly unconstitutional that they know will be overturned by a higher court, those judges need to get in serious trouble for wasting taxpayer money and devaluing the justice system.",
                "author": "duckduck"
            },
            {
                "raw_content": "Man I feel bad for her and her family - leaves Ukraine and then gets immediately murdered by some jogger",
                "author": "Test_user21"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "SAY HER NAME: Dr. Julie Schnuelle She was kiIIed yesterday while walking her dog in Auburn, Alabama. Rashad Dabney arrested and charged.",
        "score": 1015,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Living anywhere near them is basically suicide at this point.",
                "author": "Pener_Parker"
            },
            {
                "raw_content": "Was Scott Adams right?",
                "author": "GoldenEarz"
            },
            {
                "raw_content": "6/50 is wild. Never relax around joggers and expect the unexpected.",
                "author": "PeaceMakerDJT"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Canada is Cooked",
        "score": 749,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The dumb cunt said: People's right to privacy in public.",
                "author": "Calumet57"
            },
            {
                "raw_content": "Only Government cameras get to see everything, when it's convenient.",
                "author": "ThorsonTT"
            },
            {
                "raw_content": "It's that sort of thing that would not make me blame someone for committing arson and ensuring it hits your home so you can collect insurance and GTFO. Pretty fucked up when you can't have cameras on your own property.",
                "author": "Wtf_socialismreally"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Charlamagne Tha God Says He Regrets ‘That Damn COVID Shot,’ Says He Has Had Chest Pain and Heart Issues",
        "score": 735,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Well, can't you just fucking die then, you jogging POS?",
                "author": "AwShitHereWeGoAgain"
            },
            {
                "raw_content": "Naming yourself \"The God\" you deserve everything coming to you",
                "author": "BasedMillennial"
            },
            {
                "raw_content": "Fuck this faggot",
                "author": "SurfandTurf"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: John Thune is set to invoke the “NUCLEAR OPTION” as soon as tomorrow to fast track President Trump’s 100+ nominees through the Senate, as Schumer continues to stonewall, per Daily Caller.",
        "score": 1199,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Oh wow I’m glad we waited however many months to do this wtf I love John Thune now he’s my favorite after Lindsey Graham",
                "author": "BidenSniffsLittleKid"
            },
            {
                "raw_content": "So the same John Thune that put the Senate into “pro forma” recess just to block Trump’s ability to make recess appointments now supposedly wants to “fast track” those very same nominees? Call me crazy but I don’t believe it for a second.",
                "author": "SegAtari"
            },
            {
                "raw_content": "### Thune is a faggot.",
                "author": "Liberals_R_Idiots"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Leftists with a Ukrainian flag 🇺🇦 in their profile when a Ukrainian gets brutally murdered by a black man on a train for absolutely nothing.",
        "score": 780,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm beyond \"debating\" leftists anymore. I'm just waiting for the shooting to start.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Yep. Protecting violent joggers matters more now",
                "author": "DingleBalls"
            },
            {
                "raw_content": "They support the Ukrainian government, not the nation or the people. Just like when the Dems have the majority. They are with for or against a current government administration. That’s all there is to them. The people are either their Allie’s, supporters of their enemy, or tools to lie with.",
                "author": "GreyKnight"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "It's now been confirmed that the U.S. F-35s that were deployed to Puerto Rico are the SAME ONES President Trump used to bomb Iran's nuclear facilities. The cartels are about to have some big problems.",
        "score": 720,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The ones that bombed Iran were B2s though. Were these escorts?",
                "author": "PapaPepe"
            },
            {
                "raw_content": "send some stealth bombers to the CIA’s cartel compounds",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "What is in Puerto Rico that needs escorts?",
                "author": "AcAirman"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "“When you said that San Francisco pays people to be homeless, what did you mean by that? You mean that literally?” Homeless man “$200 food stamps and $620 bucks cash a month — it's free money, dude. This right now is literally by choice. Literally by choice. Like, why would I want to pay rent? I'm",
        "score": 983,
        "text_content": "",
        "comments": [
            {
                "raw_content": "All blue states do this btw. Just better weather in cali.",
                "author": "Here_we_go"
            },
            {
                "raw_content": "EXPOSED 🚨 California Democrats are paying people to be homeless Homeless man moved across country to California to be homeless “How long you been in San Francisco?” Homeless man “Since June. If you're gonna be homeless, it's pretty f*cking easy here. I mean, if we're gonna be realistic, they pay you to be homeless here” “When you said that San Francisco pays people to be homeless, what did you mean by that? You mean that literally?” Homeless man “$200 food stamps and $620 bucks cash a month — it's free money, dude. This right now is literally by choice. Literally by choice. Like, why would I want to pay rent? I'm not doing. I got a cell phone that I have Amazon Prime and Netflix on” “How was that hard to get?” Homeless man “F*cking phone call, bro. F*cking phone call.” This is the scam, - California Democrats pay these people to be homeless - The homeless problem never goes gets solved - They can then justify laundering billion and billions are year to their NGOs and get filthy rich This is the Homeless Industrial Complex",
                "author": "PiratePatriotParrot"
            },
            {
                "raw_content": "Does that come with free healthcare cuz if so I got a truck and am bout to go full newscum on career change",
                "author": "UltraFrogMan"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Bwa-Ha-Ha-Ha-Haaaaaaa!!!!!",
        "score": 1242,
        "text_content": "",
        "comments": [
            {
                "raw_content": "fat disgusting fuck says RFK is unqualified!",
                "author": "Indian"
            },
            {
                "raw_content": "a single pull up. lets see it chris.",
                "author": "Deplorable556"
            },
            {
                "raw_content": "the human donut with ZERO self awareness lols",
                "author": "YodaBannon"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "victim support 💂🇬🇧",
        "score": 678,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's unrealistic, because they didn't arrest her.",
                "author": "barwhack"
            },
            {
                "raw_content": "And just like the news, the race of the criminals is left to the imagination",
                "author": "NoWarWithIran"
            },
            {
                "raw_content": "There's only one way out now for Britain: **Death.** Lots and lots of death.",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Chicago residents are threatening Trump and the National Guard. They have hundreds of thousands of gang bangers that will kill the Guard. Paging Kashyap. Do your job.",
        "score": 911,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Shit. Or get off the pot. 🤣",
                "author": "PatriotSkorzeny"
            },
            {
                "raw_content": "I hope he gets shot first",
                "author": "Gunmolester"
            },
            {
                "raw_content": "I am so fucking fatigued of these animals. His TikTok handle is right there. Send the feds to his house and show him being dragged out by that nasty ass beard.",
                "author": "WhiteGhost"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Don Lemon was in New York City today talking to residents. It didn’t go so well with this gentleman: \"You're a fucking moron, dude\"",
        "score": 635,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I cannot stand Don Lemon. Horrible person.",
                "author": "38WendysHamSquare79"
            },
            {
                "raw_content": "Every fucking thing",
                "author": "lovemylibs"
            },
            {
                "raw_content": "\"What do you mean, everything?\" \"EV-ERY-THING!\"",
                "author": "canadianhere"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "LMFAO! Paid protestors stood outside the US Open in NYC and BEGGED attendees walking in \"boo Trump today!\" \"Boo Trump today, boo Trump today! November 5th come to DC! Trump must go now!\"",
        "score": 893,
        "text_content": "",
        "comments": [
            {
                "raw_content": "See? Nobody cares.",
                "author": "KuzoKevin"
            },
            {
                "raw_content": "USAID funding really was funding these protests. You can clearly see the results.",
                "author": "Lurkermon"
            },
            {
                "raw_content": "Four retards holding pre-printed signs chanting lame shit. I'm enjoying the demise of the left.",
                "author": "I-am-Orlando"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Homan: Expect imminent immigration enforcement operations ‘In most sanctuary cities across the country’",
        "score": 1148,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Gotta give them a heads up first, we must play fair.",
                "author": "FuckReddit4545"
            },
            {
                "raw_content": "If you want some comedy check your local retards on places like NextDoor crying \"I never thought I'd be living in a police state!\"",
                "author": "OutlawPurpleHairDye"
            },
            {
                "raw_content": "We'll see . Still waiting for Mass Deportations",
                "author": "ACActual"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Rand Paul Turns Around On The Delaware",
        "score": 1259,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Its funny because its true",
                "author": "RINO_fatigue"
            },
            {
                "raw_content": "Bombing Syria was an executive Title 2 claim, I don't remember hearing this much complaining, and Syria isn't killing 6 figures of Americans with drugs.",
                "author": "keeponwinning"
            },
            {
                "raw_content": "\"Turn around, we must be subservient to foreign countries\".",
                "author": "loooooof"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "MSNBC host quotes Goldman Sachs. Scott Bessent replies, “I made a very good career trading against Goldman Saches.”",
        "score": 1099,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Only rich people are freaking out this much over tariffs. Why? It's one of the few Federal Government revenue generators ***(which was authorized by Congress by the way)***, that they cannot avoid or skirt. For individuals, there are no tax credits/deductions, no reimbursements, nothing. So when Democrats scream: \"We need to tax the rich!\", here we are so-called \"taxing\" the rich ...and they're freaking out. As a matter of fact, [some rich people are resorting to smuggling their luxury goods into the country.](https://archive.ph/vJQZK)",
                "author": "McFatty7"
            },
            {
                "raw_content": "How many times is Kristen Welker going to get smacked down with facts before they stop giving her interviews? She SUUUCKS at pretending to be objective. She's emotional and sensationalistic in her delivery when it's an issue she believes will hurt a conservative, but soft and apologetic when asking anything of the Left that's obviously a negative for them. I'm pretty open-minded, I even watch clips of the View because I'm curious about what the loonies are saying, but I ignore Walker because she's pretending to be a legitimate journalist and it's so obviously not true.",
                "author": "4886Battery"
            },
            {
                "raw_content": "Arabs should return to Arabia and return the middle east to the Greeks and descendants of Phoenicians.",
                "author": "Surricat"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "New report blames Phison's pre-release firmware for SSD failures — not Microsoft’s August patch for Windows",
        "score": 352,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So manufacturers got some controllers with pre-release firmware and sold them as production version. That’s what they are hinting at?",
                "author": "floydhwung"
            },
            {
                "raw_content": "So why were SSD's being shipped to customers/retailers with pre-release firmware if this is indeed the cause?",
                "author": "Nicholas-Steel"
            },
            {
                "raw_content": "Is there a specific Phison controller affected, or all of them? I bought a Lexar NM790 which on techpowerup either ships with a MaxioTech controller or a Phison PS5027-E27T, but I haven't seen it mentioned.",
                "author": "Vexxxy"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Honeywell does manufacture 0.2mm PTM7950, and there is a good chance you're not buying a fake one even if it's 0.2mm.",
        "score": 145,
        "text_content": "For context, I went down this rabbit hole because I wanted to use PTM7950 instead of thermal paste for my laptop, and the overwhelming consensus on Reddit seemed to be that \"there are lots of fakes online\" and that \"I had to make sure I was getting the 0.25mm version since that's the only thickness PTM7950 is manufactured in.\" This might have been the case at some point, since there are old documents from Honeywell showing that they only manufacture PTM7950 at 0.25mm, but currently, [the spec sheet on their website ](https://advancedmaterials.honeywell.com/content/dam/advancedmaterials/en/documents/document-lists/electronic-materials/technical/hon-ess-ais-semiconductor-materials-application-note-tims.pdf)clearly states that they manufacture it at any thickness between 0.2mm and 0.5mm. The idea that 0.2mm PTM7950s are fake seems to come from the original [Framework Forum post](https://community.frame.work/t/honeywell-ptm7950-phase-change-thermal-pads-sheets-application-tips-and-results/20245), the [LTT video that references that post](https://www.youtube.com/watch?v=2BhKx0iQ4K8), and [the igor'sLAB test](https://www.igorslab.de/en/5-phasenwechsel-pads-im-test-honeywell-ptm7950-ptm7950sp-vs-pcm5000-pcm8500-und-thermalright-heilos/), but none of these sources actually show a fake 0.2mm PTM7950! [The original Framework forum post ](https://community.frame.work/t/honeywell-ptm7950-phase-change-thermal-pads-sheets-application-tips-and-results/20245)says they \"think\" 0.2mm from Aliexpress is fake because of those Honeywell documents that only show the 0.25mm version. But OP has actually edited the post saying their 0.2mm Aliexpress version actually performs the same, and that it's probably an original. I think [the LTT video ](https://www.youtube.com/watch?v=2BhKx0iQ4K8)claims that their Aliexpress version is fake simply because they are repeating what's been said on the Framework forum post. But if Linus had stopped reading the script for a second and looked at his own charts, he would've realized that their \"fake\" 0.2mm Aliexpress one and the \"original\" eBuy7 0.25mm one perform just about the same on the GPU tests. Moreover, on their CPU tests, the \"fake\" 0.2mm performs about the same as liquid metal, while the \"original\" 0.25mm performs slightly better than liquid metal?? Considering they used power consumption as the metric and cut off the charts before they stabilized, I wouldn't really trust their CPU tests. Plus, they apply them to the CPU lid instead of the die. Finally, there is [the igor'sLAB's test](https://www.igorslab.de/en/5-phasenwechsel-pads-im-test-honeywell-ptm7950-ptm7950sp-vs-pcm5000-pcm8500-und-thermalright-heilos/). That one seems to be the most \"robust\" test, and it's clear that the original PTM7950 is much better according to his results. But, crucially, he is not comparing \"fake\" 0.2mm PTM7950s from Aliexpress against the original here. He compares PCM5000 and PCM8500 against PTM7950, claiming that the 0.2mm PTM7950s on Aliexpress are actually PCM5000 and PCM8500 since they are 0.2mm too. However, there is no proof of this claim at all in his test. The image of his PCM5000 clearly shows \"PCM5000\" on the label, so that one is not branded as \"PTM7950\". And while he doesn't give his source for the PCM8500, if he bought that as \"PTM7950\" from Aliexpress, how would he know that it's actually PCM8500? My guess is that he simply bought PCM5000 and PCM8500 from reputable sellers that were branded as what they are: PCM5000 and PCM8500. I'm not saying that any random purchase on Aliexpress or eBay will be an original PTM7950. But it seems like the abundance of fake PTM7950s is greatly exaggerated by these reviews and Reddit. If you are having difficulty finding a non-overpriced reputable seller, it might be worth giving a \"fake\" cheap PTM7950 a shot.",
        "comments": [
            {
                "raw_content": "I have the fake 0.2mm one and even that's miles better than the best thermal paste for laptop so even if you did buy the fake one, guys don't worry about it. It just performs like 3~5 C worse than the geniune one. Stuff is incredible by itself.",
                "author": "AciVici"
            },
            {
                "raw_content": "Yes, it's best not to go down the PTM rabbit hole! All you can do is take a semi-educated guess and cross your fingers. I came across [this chart](https://www.reddit.com/media?url=https%3A%2F%2Fpreview.redd.it%2F5uguuxrnbm3f1.png%3Fwidth%3D1518%26format%3Dpng%26auto%3Dwebp%26s%3D40e4c06777013775f477544455421783161389aa) a few months ago (courtesy of u/xdauser2024) which you may find helpful. But regardless of the route you take, you'll still be doing much better than budget pastes like MX-4 and MX-5. In fact, some of these PTM pads come very close to liquid metal with the worst AliExpress pad being just 3c hotter than Thermal Grizzly liquid metal (in ambient normalized hotspot thermals). That’s pretty sick, especially since it’ll never pump out, degrade, cause shorts, or need replacing. Thermal pastes are now obsolete, basically, at least as far as GPUs are concerned (IHS application is a slightly different story).",
                "author": "GenZia"
            },
            {
                "raw_content": "The easiest solution for me was to buy thermal grizzly sheet which is the genuine ptm7950 and it transformed my gpu. Maybe I'll try those \"fake\" 0.2 ptm7950 in the future for some other gpu, but for now I'm extremely happy with my purchase.",
                "author": "Radiant-Fly9738"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "First-ever micro-LED smartwatch unveiled by Garmin – up to 4500 nits - FlatpanelsHD",
        "score": 53,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I always thought Apple would be the first to bring a micro-LED watch to the market, they had supposedly invested billions on micro-LED R&D, wonder what came out of that.",
                "author": "konradly"
            },
            {
                "raw_content": "I believe this is the first microLED display in a \"consumer\" device",
                "author": "CeeeeeJaaaaay"
            },
            {
                "raw_content": ">On the downside, battery life is markedly shorter. According to Garmin, the 51mm Fenix 8 Pro offers \"up to 27 days\" of battery life (15 days always-on) with OLED but \"up to 10 days\" (4 days always-on) with micro-LED – a reduction to about one-third. That's a lot shorter battery time for a smart watch (it's training watch, really).",
                "author": "0xdeadbeef64"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung's GDDR6 Modules Run 10°C Cooler Than SK Hynix, Claims GPU AIB",
        "score": 156,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is +24W accurate? Doesn't that imply it's using about twice the power?",
                "author": "vegetable__lasagne"
            },
            {
                "raw_content": "TPU tested two Sapphire versions, similar PCBs but the Pulse (uses Samsung) ran cooler than the Nitro (Hynix) https://www.techpowerup.com/review/sapphire-radeon-rx-9060-xt-pulse-oc/39.html https://www.techpowerup.com/review/sapphire-radeon-rx-9060-xt-pulse-oc/40.html",
                "author": "vegetable__lasagne"
            },
            {
                "raw_content": "That has always been Samsung's strongest point and the reason why miners always bought GPUs with Samsung VRAM However in GDDR7, SK Hynix is ​​now on par with Samsung in terms of efficiency. Performance is pretty much the same. Although SK Hynix has more often good overclockability.",
                "author": "Wonderful-Lack3846"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Who decided installing liquid metal into high-end laptops was a good idea? [liquid metal leak repair video]",
        "score": 0,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lots of people because it's rare to have an issue.",
                "author": "NetJnkie"
            },
            {
                "raw_content": "Liquid metal is fine as long as it is properly installed. There are hundreds of thousands if not millions of devices using liquid metal (laptops, gpus like RTX 5090 FE) and they do not have issues. This video is just fearmongering propaganda",
                "author": "lintstah1337"
            },
            {
                "raw_content": "Why did the dam break? Feel like maybe the owner took it apart himself, and spilled the metal.",
                "author": "bubblesort33"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Star Wars outlaws completed solely handheld mode and it was great!",
        "score": 512,
        "text_content": "Not my favorite game ever but it was fun enough if to occupy my weekend and kept me interested in the story. What game do I play next?",
        "comments": [
            {
                "raw_content": "Played it on PS5 when it launched and was in the camp that thoroughly enjoyed it. Can’t wait for it to go on a sale for NS2 eventually to play it again portable. I get why people don’t like it but it was more than enough for me.",
                "author": "BlackLodgeSocialite"
            },
            {
                "raw_content": "How many hours did you put in? It takes me months to get through most open world games due to the size of them and my availability to actually play.",
                "author": "destroyman1337"
            },
            {
                "raw_content": "Congrats! I am 8 hours in but doing side quests right now.",
                "author": "CarsonWentzGOAT1"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Traveling with the Switch 2",
        "score": 364,
        "text_content": "Bought a Harbor Freight Apache 3800 case to put my Switch 2 and accessories in when I want to bring it to friends houses and road trips. Just wanted to share it with everyone to say you can make it fit. I put the dock hardware into a 3D printed enclosure which fits the switch with the Killswitch on. My only concern is once I get another controller where do I put the HDMI cable controller charging cable. Other than that everything fits great.",
        "comments": [
            {
                "raw_content": "this is insane lol",
                "author": "aam-96"
            },
            {
                "raw_content": "This is cool , but my favorite thing about buying portable consoles is how far we go to lessen the portability of them in some cases .. I’m the same way 😂",
                "author": "FCA_Eughhh"
            },
            {
                "raw_content": "![gif](giphy|0Zqtr13Motw547YsYn|downsized)",
                "author": "WeAreNephilim"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Dev says Switch 2’s physical Game Cards were too slow for Star Wars Outlaws port",
        "score": 152,
        "text_content": "I don't see this shared here so hopefully it's not a duplicate post. If that's the case, would be nice if Nintendo lets devs use Switch 1 cards with Switch 2 \"coat of paint\" that installs game card's data straight to system memory or SD Card Express, like PS4/5 and Xbox One/Series does with physical discs. In short, game data installs into system memory/SD Card EX from game card rather than the Internet download. Would this method be tolerable?",
        "comments": [
            {
                "raw_content": "News is a couple days old, discussed extensively already here: https://www.reddit.com/r/NintendoSwitch2/s/m4XuXRdJeJ",
                "author": "asdqqq33"
            },
            {
                "raw_content": "The game on PC runs fine on Sata SSDs that are pretty much the same speed as the Switch 2 physical game cards. But of course, saying \"we want to save costs so we went the game key card route\" doesn't sound nice for PR.",
                "author": "Melodic-Theme-6840"
            },
            {
                "raw_content": "If they have to make people install the game, so be it. But the data being installed should still be on the cart, yes. Also it doesn’t really matter right now, because the Switch 2 can’t do that without an update that Nintendo hasn’t said they’re doing.",
                "author": "JetstreamGW"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Elden Ring Tarnished Edition Seemingly running much better in handheld mode now.",
        "score": 28,
        "text_content": "https://youtu.be/AXuFiiG6xU0?si=d1amNPiaqG31GKyf He actually mentions that Handheld play seems even smoother than docked in the video which is very different from the earlier reports. I wonder what resolutions the game is targeting in handheld vs docked.",
        "comments": [
            {
                "raw_content": "Did Gamescom just get a bunch of dud demos? First Star Wars Outlaws and now this!",
                "author": "throwawaycolesbag2"
            },
            {
                "raw_content": "As I was saying the whole time. WAIT",
                "author": "nohumanape"
            },
            {
                "raw_content": "Well, might consider picking it up now. I hope it comes out this year.",
                "author": "Any-Needleworker478"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Kirby and the Forgotten Land has possibly the best finale of any 3D platformer.",
        "score": 66,
        "text_content": "Replaying Forgotten land with 60 fps has been bliss. I’ve always loved this game, and now one of the worst parts about it has been fixed. As I play it, I keep thinking about how well this game continues to deliver on its atmosphere and gameplay. Kirby, a pink puff of pure joy and whimsy, is such a contrast to the decrepit buildings and overgrown worlds that you explore in the game. It’s so unusual, but that’s what makes it good. The strangeness, the absurdity, that’s what makes the Forgotten Land such a fun setting. It’s like Kirby is a flashlight in the dark; he illuminates what otherwise is a gloomy world which would be quite sad to inhabit. The final boss is where this dichotomy reaches its peak. Kirby finds Elfilin and fights a decently fun but kinda standard boss fight against Leongar, the leader of the beast pack. You save Elfilin, and then the strange corrupt beast frees behind Leon itself and consumes everything in sight. Already, it’s unusual. The collage of faces in a strange goo that chases Kirby down a hallway is such a cool moment, it feels like the metaphorical darkness is trying to suppress the flashlight. After the specimen consumes Elfilin and two halves have become whole again, the fight on the ceiling is truly spectacular. It’s a pretty large difficulty jump from the rest of the game (though still easy, it’s Kirby after all), and the stakes feel so insanely high. When you finally free Elfilin, Elfilis takes the little power he has left to doom both the Forgotten Land AND Planet Popstar, Kirby’s home planet. At this point, the adrenaline is pumping. Though it’s not hard to do anything the game requires you to do, it still manages to make this final encounter feel powerful and encourage you to try your best. Just when you think it can’t get any crazier, a 18 wheeler gets thrown to Kirby. Yeah, you’re going to kill a God by ramming into him with a truck. An incredible remix of the invincibility theme plays as you drive across floating buildings being pulled by Popstar’s gravity. It ends in a final confrontation with Elfilis where you just have to mash a button. Normally, I dislike when a game just has you mash a button instead of having some kind of interesting mechanic. But here is different. Here is different because all I really wanna do is mash. I’m putting all my energy into this one specific action, music blaring in the background encouraging me to do this one thing. And you do it. It’s ridiculous, it’s funny, it’s strange, it’s encouraging, it’s… beautiful. I don’t think any other finale in any other 3D platformer has felt so insane yet whimsical. As much as I love games like Odyssey and Bananza, especially their final moments, they don’t have the same allure as Kirby. Such a good game.",
        "comments": [
            {
                "raw_content": "The fact that we ended what was basically an isekai story by hitting the antagonist with a truck is incredible. Kirby finales are generally always awesome, going back all the way to Kirby's Adventure. This one was definitely one of, if not my favorite. And that MUSIC. Invincibility theme but extended? So damn cool.",
                "author": "SparkyMuffin"
            },
            {
                "raw_content": "AGREED. Forgotten Land was my first Kirby game and I didn't really know what to expect; I had seen the memes of Kirby games going off the rails and fighting gods but actually experiencing an ending like that was such a delightful experience. Two Planets Approach the Roche Limit (final boss track) is one of my favorite tracks in all of gaming and I loved in Star-Crossed World >!how its final boss was also crazy, and getting to play a new version of Chaos Elfilin in the colosseum with an updated version of 2 Planets. !<Can't wait for the next Kirby platformer!",
                "author": "novelgpa"
            },
            {
                "raw_content": "Kirby and Sonic both often share the final boss philosophy of having an actual interesting boss fight that challenges you to use its mechanics followed by a hype cinematic moment that, although very easy and not very mechanically complex, makes you feel really powerful as the hype music plays and you absolutely destroy the final boss and I love it so much. Those moments usually end up being the most memorable parts of the game too",
                "author": "C_Yo"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Star Wars Outlaws Handheld Screenshots",
        "score": 247,
        "text_content": "A few people were asking for handheld mode screens so here you go",
        "comments": [
            {
                "raw_content": "I was genuinely surprised about the space scenery. It looked awesome",
                "author": "SherbetOk77"
            },
            {
                "raw_content": "I still don’t know how people think this looks like a ps2 game. But I just guess people just say what Asmongold tells them to say.",
                "author": "Pipboy2"
            },
            {
                "raw_content": "I was traveling over the weekend and was pleasantly surprised by how well the game plays in hand held. Landing headshots at distance is a little challenging, but everything else is amazing.",
                "author": "Raging_Pwnr"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "SW Outlaws - What is actually causing the splotches? Is this something that is patchable?",
        "score": 18,
        "text_content": "I’ve noticed this splotching in a number of places throughout the game. It seems to happen in darker areas with metallic surfaces, but will occasionally occur in lighter areas like this one. Is this is ray tracing with dlss trying to upscale the lighting effect? Whatever the case, is this patchable? I’m also curious what this means for future titles. (I’m enjoying the game and it’s an amazing port.)",
        "comments": [
            {
                "raw_content": "I’ve heard it has to do with the ray tracing. The resolution is too low and so it creates a sort of sizzling look, mostly on metal. It could be improved somewhat with ray-reconstruction, which the switch is capable of. Whether it will be or if the hit to performance is too much, I do not know.",
                "author": "kaiush"
            },
            {
                "raw_content": "This is caused by ray tracing. In current hardware ray tracing is very noisy. DLSS or other AI scalers smooths out some of it, as seen in your video. Especially in darker scenes with a lot of reflective materials this is problematic as the camera exposure is i creased for the low light level and the RT noise is exponentially more visible.",
                "author": "RethaiN"
            },
            {
                "raw_content": "Like others have said, it’s an artifact of ray tracing with a limited number of rays/at a low resolution. Thing is, I see the same artifact even on my RTX 3080 (I know it isn’t like, modern high end anymore, but it still more than gets the job done) so I don’t think switch 2 is ever going to get rid of it, unless Nvidia figures out some software miracle, but then desktops would also benefit.",
                "author": "candlelit_bacon"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Now Give Us Cal!",
        "score": 177,
        "text_content": "With the success of Outlaws on the Switch 2, it’s got me wanting to replay Fallen Order and Survivor, both of which would be less challenging to port (graphics-engine-wise). I doubt EA will spend the money to do so, unfortunately, but I’m putting it out into the world… just in case. What older AAA title do you want to see ported to the Switch 2?",
        "comments": [
            {
                "raw_content": "RDR2 Fallout 3 and 4 Assassins Creed (Origins, Odyssey, Valhalla) GTA 5",
                "author": "OmegaRed86"
            },
            {
                "raw_content": "I would love to see both Dishonored games on the switch 2",
                "author": "Murky_Historian8675"
            },
            {
                "raw_content": "Red dead 2, mass effect trilogy, resident evil 4 remake",
                "author": "Tight_Net_2886"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Marathon NDA Playtest 3 Leak Reveals New Details: New Runner and Abilities, “Multiple” Marathon Ship Maps, UI Overhaul, and More",
        "score": 151,
        "text_content": "https://thegamepost.com/marathon-nda-playtest-3-leak-reveals-new-details/ Marathon “Icon” Runner Overview and Abilities: Icon (codenamed Thief) Ability 1: Grapple Works like Pathfinder from Apex Legends. Ability 2: X-Ray Vision Lets the player see loot containers through walls, highlighting them based on the rarity of the highest-rated item inside. Also showed enemy outlines that refreshed every few seconds. It worked through smoke, but unclear if it works through solid walls. Ability 3: Loot-Stealing Drone Fires a retractable grapple at enemy players and pulls the rarest item from their inventory, dropping it nearby as a loot bag. You can’t pull it directly into your own inventory, you still have to pick it up manually. The marathon map is now split into different parts There have been no signs of S'pht Compilers in this playtest so far, but they do exist in the game files. Edit: also there are also visual improvements in the UI, graphics and new environmental damage.",
        "comments": [
            {
                "raw_content": "I’m genuinely curious to see the reception to this game once it releases,after all that’s happened with the game,plus Sonys entire live service push.",
                "author": "Emergionx"
            },
            {
                "raw_content": "It would be neat if they had Alien NPCs who show up to try and murder you Throw in some Alien tech as well.",
                "author": "Laughing__Man_"
            },
            {
                "raw_content": "I don’t really play multiplayer games but the art style for this game looks really cool to me",
                "author": "PresentationDull7707"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Concept art for Aspyr's Star Wars KOTOR Remake",
        "score": 348,
        "text_content": "[source](https://mp1st.com/news/report-concept-art-unearthed-for-star-wars-kotor-remake)",
        "comments": [
            {
                "raw_content": "Still kind of mind boggling at how Aspyr was given the task to remake KOTOR. They're really good at doing Mac ports and remastering games but for a project this size? Hopefully Saber Interactive will have a teaser/debut trailer soon since they're developing the remake now (or one day...)",
                "author": "reevestussi"
            },
            {
                "raw_content": "I wonder how bad the project was for Sony to pull the funding. There were rumors that they wanted to change the combat system or that they wanted to change certain things so they wouldn't affect the new canon.",
                "author": "Midnight_M_"
            },
            {
                "raw_content": "![gif](giphy|x0npYExCGOZeo) It’s coming bro I swear this time it’s really coming please just trust me bro",
                "author": "VictorVonDoomer"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Riot Project T update MMOFPS",
        "score": 37,
        "text_content": "[https://xcancel.com/PlayerIGN/status/1959904123383644233?subid1=20250908-1602-37c3-8d83-91f0b9e30a3c](https://xcancel.com/PlayerIGN/status/1959904123383644233?subid1=20250908-1602-37c3-8d83-91f0b9e30a3c) Rumor about Riot MMOFPS that was leaked back in 2023 - [Original Leak](https://www.reddit.com/r/MMORPG/comments/13jjkmw/riot_games_accidently_leaks_mmofps_project_t/)",
        "comments": [
            {
                "raw_content": "At the rate Riot Games develops, I look forward to playing this game’s beta in 2030.",
                "author": "MicroeconomicBunsen"
            },
            {
                "raw_content": "Oh. Extraction shooter. Yippie. Current version of battle royale. Great.",
                "author": "GoldenTriforceLink"
            },
            {
                "raw_content": "For a moment I thought this will be Global Agenda in first person or anything really that's TPS/FPS but in an open world with many players. But nah, it has to be an extraction.",
                "author": "Meowing-To-The-Stars"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Switch Force: Ace Attorney 7 will not appear at the Nintendo Direct",
        "score": 320,
        "text_content": "https://xcancel.com/INRamos13/status/1964543031216157045?t=jnplNfO2lqZpB6lvD7zsoQ&s=19 > Please, if Ace Attorney 7 is not in it, just tell me now. I don't want to keep hoping in vain. >> Switch force: Negative captain :/",
        "comments": [
            {
                "raw_content": "What is the holdup is for this game? The last game in the series was 2017 and according to the Capcom leak AA7 was targeting a 2021-2022 release. Popularity is at an all time high now that the whole series is translated and easily playable, and they've got to be relatively cheap games to make. I wonder if they're trying to reinvent the formula.",
                "author": "Megaclone18"
            },
            {
                "raw_content": "When it comes to “7” games for this Direct, well… let’s just say your Grand Dad will be very happy with one title.",
                "author": "YoshiEmblem"
            },
            {
                "raw_content": "The miracle never happen.",
                "author": "DemonLordDiablos"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Early birthday present to myself.",
        "score": 448,
        "text_content": "Little weekend upgrade completed, well happy with how smooth it went. 7800x3d to 9950x3d. Temps are excellent, applied an all core -20 as a starter before the deep dive. Max temps on r23 during 10 min throttling test were 66c, score 43k. On holiday now so will tweak some more when I’m home. Anyways, happy birthday to me and happy birthday to anyone else celebrating this week.",
        "comments": [
            {
                "raw_content": "![gif](giphy|19Ik3PuuqoFnhTTfEi)",
                "author": "EightInchesAround"
            },
            {
                "raw_content": "Happy birthday!!",
                "author": "CodeAndLedger5280"
            },
            {
                "raw_content": "i’m a game dev and use my machine for both work and gaming, and that cpu has been such a boon to me. i am like, one of the tiny fraction of people who fit the niche for this cpu, and it’s amazing",
                "author": "xXBongSlut420Xx"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD ROCm documentation lists Radeon RX 9060 XL GPU",
        "score": 99,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "I've not seen the XL Radeons since about 20 years ago, they used to be made for OEMs, cut down versions of the XT models i.e. 9800 XT and 9800 XL (one of my old Medion desktops had one)",
                "author": "ApplicationMaximum84"
            },
            {
                "raw_content": "XL, for the larger gentleman.",
                "author": "ziplock9000"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "We are due for a correction based on historical evidence. Corrections lag interest rate hikes.",
        "score": 128,
        "text_content": "First, the key here is the Fed funds rate. Following is a chart of the Fed funds rate since the 1950’s. https://fred.stlouisfed.org/series/fedfunds As far back as the [1980’s S&L crisis](https://en.wikipedia.org/wiki/Savings_and_loan_crisis), housing corrections have lagged Fed funds rate hikes. As an example of this I have documented the 2008 housing bubble. * 07/2004 - The Fed begins hiking rates in July of 2004. * 12/2004 - There were no reports of a housing crisis in 2004. * 01/2005 - One of the very first people to recognize a problem was brewing in housing was Michael Burry and [he didn’t begin to focus on it until 2005](https://en.wikipedia.org/wiki/Michael_Burry#Investment_career). At that time he predicted the bubble would collapse as early as 2007. * 01/2006 - The Fed continues to raise rates throughout 2005 and part of 2006. * 07/2006 - The Fed funds rate peaks in July of 2006. * 06/2007 - The first sign of a full blown crisis appears when [Bear Stearns bails out one of its own CDO funds.](https://en.wikipedia.org/wiki/Bear_Stearns#Start_of_the_crisis_%E2%80%93_two_subprime_mortgage_funds_fail) * 08/2007 - The Fed holds rates steady until August of 2007 at which time they begin lowering rates. * 12/2007 - The Fed continues lowering rates throughout the remainder of 2007 and into 2008. * 01/2008 - The largest U.S. home loan provider, [Countrywide collapses and is forced to sell itself to Bank of America](https://archive.ph/0gaE6) for a fraction of what it was worth just months prior. * 03/2008 - [Bear Stearns collapses and is sold to JP Morgan.](https://en.wikipedia.org/wiki/Bear_Stearns#Fed_bailout_and_sale_to_JPMorgan_Chase) * 09/2008 - [Lehman Brothers collapses and files for Chapter 11 bankruptcy.](https://en.wikipedia.org/wiki/Bankruptcy_of_Lehman_Brothers#Bankruptcy_filing) As can be seen, there was a lag of 3 years between the time the Fed began raising rates before the first sign of a collapse in the housing market. Even then the signs weren’t obvious. No one outside of the most in-tune people working in the financial industry and privy to the most detailed information were aware of what was happening at Bear Stearns in mid 2007. The first sign us plebs saw, and most didn’t recognize it, was much later in early 2008, 4 years from when the Fed began raising rates, when Countrywide and Bear Stearns were forced to sell themselves off to the highest bidders. The collapse wasn’t evident to everyone until the Lehman collapse in September of 2008. That was plastered all over the news. So given the 2008 collapse we should anticipate a correction in housing to occur about 4 years after the Fed begins raising the Fed Funds rate. That’s not a perfect metric, not all bubbles collapse in that time frame but it is a good rule of thumb, I believe. The Fed began raising rates in February of 2022. Given that, we should be expecting a real correction to occur sometime around Feb of 2026. Five months from now. In other words a correction is likely already well underway at this point but it isn’t in our faces yet to the point where it is impossible to deny.",
        "comments": [
            {
                "raw_content": "This correction will be fueled by mass HELOC, credit card and whatever other leverage based on “equity” defaults that occur. People simply can’t afford to go on like this. It won’t be a 2008 crash but it’ll be more for longer.",
                "author": "VendettaKarma"
            },
            {
                "raw_content": "Difference this time is that a lot more people are aware and positioning for it, less chance of it happening. Needs to be black swan - BNPL, maybe AI taking jobs. Something that makes the leverage collapse…not gonna be rate cuts, they’re actually soft landing rn",
                "author": "Fullmetalx117"
            },
            {
                "raw_content": "What’s interesting about your date is that it coincides with the theory of the 18 year housing cycle. The cycle is an approximation, but 14 years up = 2026, with 4 years down (completing the 18 year cycle in 2030). If you Google it, there’s lots of info out there on it.",
                "author": "redshering"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "I built an AI tool that tells you the best suburbs to invest in (based on your budget & goals)",
        "score": 0,
        "text_content": "Hey everyone 👋 I’ve been playing around with AI + property data and ended up building a tool that generates personalised property investment reports. You put in your **budget, income, timeframe, and goals**, and it gives you a suburb snapshot (growth potential, rental yield, lifestyle factors, etc). It’s free right now because I’m testing it out and would love some feedback. If you want to try it, here’s the link: [https://havenai.carrd.co/](https://havenai.carrd.co/) Curious what you think — useful or nah?",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "OpenAI helping to make an AI generated feature length animated movie that will be released in 2026",
        "score": 209,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How is it $30 million??",
                "author": "nooffensebrah"
            },
            {
                "raw_content": ">*The 2023 short “Critterz,” written and directed by Chad Nelson, a creative specialist at OpenAI, became the first ever AI film to combine visuals generated by OpenAI’s Dall•E system with traditional animation techniques. It screened at numerous festivals, including Annecy, Tribeca and Cannes Lions and was nominated for a PGA Innovation Award.* [Link](https://variety.com/2025/film/global/paddington-in-peru-writers-ai-animated-film-critterz-1236328515/) [Critterz (2023)](https://youtu.be/-qdx6VBJHBU?feature=shared)",
                "author": "DontPokeMe91"
            },
            {
                "raw_content": "Oo wee. This will get review-bombed the moment it comes out for sure",
                "author": "Beeehives"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Anyone else concerned about what happens when humans have infinite novelty at their fingertips?",
        "score": 380,
        "text_content": "It's almost been 2 weeks since nanobanana came out and I'm embarrassed to admit that of all the usecases I could be using it for, the primary one seems to be generating intimate images of myself with celebs. My productivity has absolutely plummeted. It’s fun and wild in the short term, but I can’t stop wondering what happens when this level of novelty becomes the new baseline. Our brains are wired to chase newness and stimulation, and now it feels like tech is handing us an endless supply on demand, as if social media wasn't enough. What do you think happens to the nature of sex, relationships and marriage in the future if a mere image editor has so much power?",
        "comments": [
            {
                "raw_content": "The answer is always go outside alone in the woods in as primitive conditions as you feel safe doing. Nature will always set you right and teach you what is most important.",
                "author": "patientpadawan"
            },
            {
                "raw_content": "I feel like most here are focusing too hard on OP’s unique usage of Banana while glossing over what I think is a very legitimate question. There’s a saying from somewhere (Ferriss, maybe?) that essentially says “if you’re not addicted to something, you just haven’t found your molecule yet.” We’ve all got a molecule, and AI stands to serve up an infinite number of them. Sure it can be porn, but it can also be a music genre that stopped being popular decades ago that you love, Star Wars novels that pick up where you wished they would, bringing childhood pictures to life in immersive video… every single one of us probably has a thing that AI will be able to produce, and it’ll be hard to turn away. There’s an excellent argument to be made that our brutal conquering of boredom is a serious problem. I love AI, but I don’t see how that problem doesn’t get exponentially worse.",
                "author": "russic"
            },
            {
                "raw_content": "I think it will simply shine a light on how empty digital forms of entertainment are, and people will begin to rebel from it and seek meaning elsewhere. “All things are wearisome, more than one can say. The eye never has enough of seeing, nor the ear its fill of hearing.”",
                "author": "Educational_Teach537"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Has AI Music Passed The Turing Test?",
        "score": 66,
        "text_content": "Author Note: \\*I deleted my original post thanks to helpful feedback and revised the wording of this post into a question to make it clear that I'm talking from my opinion, not making a statistical claim because I strongly believe that we all have an obligation to uphold the rigors of science to the best of our capacity :)\\* In my opinion AI music has now passed the Music Turing Test. I tried Suno 1 year ago and it sucked. Now I think it's already better than at least 50% of musicians already and I think it will be better than 99% of human music by the end of 2026. I used Gemini to create the prompt and style for Suno. I'm not a professional musician or anything btw so don't roast my prompt too hard haha. Here was the prompt to generate the lyrics: *\"You are Steve Jobs. Write a song about the most emotional, important, and interesting parts of your life. Your goal is to evoke emotion from the listener through hyper contrast hyper rhyming. Make the lyrics hyper rhymed hyper contrasting, especially the verses, with lots of intersentence rhyming. Make the lyrics hyper stylized with lots of singing flair like \"APAAAAAAAART\" for emphasis. Use the most intense variations of words such as Sterile instead of clean etc. Embed this hyper stylization throughout the lyrics. Every sentence should look like the following example in terms of style: \"****MY. OWN. \\[swear word\\] HERESY.*** *that left the* ***DEEPEST SCAAAAAAAAAR.*** *Start with the chorus. Make the chorus only 4 lines. 1st person\"\"* Style: Dark, cinematic hip hop, soulful sample beat meant to evoke emotion out of the listener, hyper dramatic singing. Confessional Singing. Emotional. Intense. Take inspiration from the most famous singers who sing in this style.",
        "comments": [
            {
                "raw_content": "Home Depot/truck ad music",
                "author": "theonepieceisre4l"
            },
            {
                "raw_content": "I agree. I tasked people with trying to find the AI music hidden in between real music (that they did not know). They *where* still better then chance (my sample was very small, both in people and in songs), it was about 60/40, but with the speed this is going, it's basically a done deal this year. Try it out yourself. Grab random music in a genre and generate music with the latest model in the same genre. Go ahead and cherrypick, we are not saying *every* ai generated song will pass the Turing test yet. Make a small playlist. Randomly shuffle the music and let people listen and guess. Depending on your prompting technique your milage may very, but it's somewhat fun (and horrible) to see their faces sink when they realise how difficult of a task this is becoming. Also have tissues on hand. One of my relatives had a bit of a crisis as she was thinking of a young friend who is trying to become a musician.",
                "author": "ShadowBB86"
            },
            {
                "raw_content": "Suno was very good last year if you knew how to prompt it, it's wildly better now, I agree in some regards but there are still a lot of things it can't do and it regurgitates music it's been trained on, don't expect wild ebs and flows in music outside of forumalic responses.",
                "author": "Extreme-Edge-9843"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini 2.5 Pro is still first in LMArena Text, despite being rather old (6 months)",
        "score": 444,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Gemini's writing style is the best. It also has noticeably wider knowledge, must be because of Google's superior datasets. But it loses in reasoning to gpt-5-high, which I have to endure when I need something complex.",
                "author": "Friendly_Willingness"
            },
            {
                "raw_content": "What's OpenAI planning to do? Do they even have anything to fight against google Google has image edit lead now, and it's only time before they take image generation lead too, and will do the same for video, agents and coding as well And have other fancy stuff in development like Genie 3 which OpenAI cannot afford development time on",
                "author": "Working_Sundae"
            },
            {
                "raw_content": "That's why they have no incentive to release 3.0.",
                "author": "Fine_Fact_1078"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Isn’t AGI/ASI the only hope for countries like South Korea to not collapse ?",
        "score": 73,
        "text_content": "Recently I’ve been getting into the rabbit hole of South Korea’s countless problems, which presents a terrifying future : lowest fertility rates in history, suicidal youth, extreme corruption, toxic work culture, fanatic materialism… For example, the less children are born, the less adults will there be in the future to keep the country running and the elder populations supported. Meaning cities and towns falling into decrepitude, and even ruin eventually. So wouldn’t AGI coupled with robotics effectively tackle many of these problems for example ?",
        "comments": [
            {
                "raw_content": "Same with china, low birth rate and low spending is why automation is one of the heaviest invested industries",
                "author": "FudgeyleFirst"
            },
            {
                "raw_content": "https://preview.redd.it/f749bvurpsnf1.jpeg?width=1056&format=pjpg&auto=webp&s=6af98888036defb0bcc28c9768fd2bc01ee8072c",
                "author": "-Crash_Override-"
            },
            {
                "raw_content": "No? Just import the 3rd world",
                "author": "Exotic_Lavishness_22"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "AI adoption rates starting to decline for larger firms",
        "score": 78,
        "text_content": "https://preview.redd.it/tr86cnpldsnf1.png?width=1603&format=png&auto=webp&s=3395241118d5bde48d5cd2ed37a067a3ea6cd18d [https://www.apolloacademy.com/ai-adoption-rate-trending-down-for-large-companies/](https://www.apolloacademy.com/ai-adoption-rate-trending-down-for-large-companies/)",
        "comments": [
            {
                "raw_content": "what this measures is enterprise integrations. if you look at e.g. legal or medical professions, what you see is very few high-level integrations with AI, but super-majorities of workers _in_ those orgs using _generalized_ AI tools directly. that's not measured here and is where most of the adoption is happening",
                "author": "cora_is_lovely"
            },
            {
                "raw_content": "How is 'AI adoption' defined here? It is hard to believe that only 12% of large companies use some form of AI. Do these statistics include the use of chatbots like ChatGPT etc.?",
                "author": "Fine_Fact_1078"
            },
            {
                "raw_content": "Wouldn’t this also mean that larger firms have already adopted AI, cut staff, and now that segment of the market is saturated? There’s also the issue of a general downturn in the economy with companies spending less.",
                "author": "winelover08816"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"Deep generative models design mRNA sequences with enhanced translational capacity and stability\"",
        "score": 58,
        "text_content": "Paywalled but important: [https://www.science.org/doi/10.1126/science.adr8470](https://www.science.org/doi/10.1126/science.adr8470) \"Despite the success of mRNA COVID-19 vaccines, extending this modality to more diseases necessitates substantial enhancements. We present GEMORNA, a generative RNA model that utilizes Transformer architectures tailored for mRNA coding sequences (CDSs) and untranslated regions (UTRs), to design novel mRNAs with enhanced expression and stability. GEMORNA-designed full-length mRNAs exhibited up to a 41-fold increase in firefly luciferase expression compared to an optimized benchmark in vitro. GEMORNA-generated therapeutic mRNAs achieved up to a 15-fold enhancement in human erythropoietin (EPO) expression and substantially elicited antibody titers of COVID vaccine in mice. Additionally, GEMORNA’s versatility extends to circular RNA, substantially enhancing circular EPO expression and boosting anti-tumor cytotoxicity in CAR-T cells. These advancements highlight deep generative AI’s vast potential for mRNA therapeutics.\"",
        "comments": [
            {
                "raw_content": "But, but, but, RFK Jr is critical of mRNA research..",
                "author": "Aimhere2k"
            }
        ],
        "subreddit": "singularity"
    }
]