[
    {
        "post_name": "There has never been a President that has worked as hard as me! My hours are the longest, and my results are among the best. I’ve stopped Eight Wars, saving many millions of lives in the process, created the Greatest Economy in the History of our Country, brought Business back",
        "score": 563,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is not the greatest economy in the history of our country. This is arguably marginally better living than it was under Biden. I am so sick of him saying that \"affordability\" is a made up democrat talking point. Funny he grifted the $2k tariff checks and suddenly stopped talking about it. They fucked up the few good things Obama/Biden did and want to be applauded for it. It is tone deaf and it is going to cost us the midterms and probably the next election.",
                "author": "MasterChief"
            },
            {
                "raw_content": "0 arrests my dude. Its not fuckin rocket science.",
                "author": "swift_water"
            },
            {
                "raw_content": "Yesterday I saw Trump signing papers and shaking hands with the Pfizer CEO guy. I was speechless and so disappointed.",
                "author": "Seeing_Red"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Pete Hegseth says goodbye to trans forever",
        "score": 151,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Only if \"forever\" means until next election cycle.... Everything that Trump or his people have done, are easily undone by the next dem in office or some faggot, spineless republican wanting to play nice. Without Congress codifying the changes made, none of this is permanent. None of it.",
                "author": "Taylor3006"
            },
            {
                "raw_content": "savage",
                "author": "cyberwar"
            },
            {
                "raw_content": "Good riddance. We don't need the mentally ill in our military. Period.",
                "author": "Boomstikchik"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A proper late show!",
        "score": 114,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sorry, out of the loop.. GEOTUS, Jesus, Pepe, and who are the other two?",
                "author": "AdmrlNelson"
            },
            {
                "raw_content": "Would.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "Featuring Pepe Shaffer and the World's Most Dangerous Band! 🐸🥁🐸🎹🐸🎸🎺🐸🎷🐸 https://files.catbox.moe/foemiv.gif",
                "author": "ItsFunToSay-M-A-G-A"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Breaking911, \"Berkeley law school concludes 'illegals without criminal histories' have been detained.... DataRepublican,\" There is no such thing as an illegal without a criminal history.\" E X A.C T L Y. They are ALL criminals. Every. Single. One.",
        "score": 153,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The law isn't that if you enter illegally and then get caught committing a crime you'll get deported, it's just enter illegally and get deported. Actually it *should* be that 0% of the illegals being detained have a criminal record because the ones that do should either be in prison or already deported.",
                "author": "Nerdrem3"
            },
            {
                "raw_content": "DMVs are breaking the law by giving out driver licenses to anyone that show up!",
                "author": "Pluze"
            },
            {
                "raw_content": "run with criminals... you get detained. NOT Arrested, detained.",
                "author": "ChyNahAzzWhole1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Sometimes I forget that we almost lost him. Imagine what this country would be like right now if Kamala Harris or Hillary Clinton had won. We'd be fucked, but we're not because of this man. God Bless President Trump and God Bless America.",
        "score": 178,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What a crazy day",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "The left will build concentration camps if they ever get power again. This is not an exaggeration. Hillary Clinton straight-up said it.",
                "author": "OGTsince1992"
            },
            {
                "raw_content": "civil war would have broken out, too many casualties, she would have declared the insurrection act (Trump should but won't) and we would be in prison or taxed until we were in prison.",
                "author": "T471"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump: I paused migration from Third World hellholes Fan: “Sh*tholes!” Trump: I met with Senators and asked them, “Why is it we only take people from sh*thole countries? Why can’t we have some people from Norway, Sweden?”",
        "score": 943,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’d like some blonde chicks from Poland.",
                "author": "suckmycorona"
            },
            {
                "raw_content": "# D E U T S C H L A N D # Pretty Please",
                "author": "Rolandus"
            },
            {
                "raw_content": "Sweden is become shitholier daily thanks to leftist Swedes.",
                "author": "MAGAguitar"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 EPIC! Trump’s soon-to-be head of NASA Jared @RookIsaacman , Sen. @TimSheehyMT , and Retired Army Ranger @JarikoDenman just set the WORLD RECORD for the largest flag flown in freefall, bringing the record back to AMERICA 🇺🇸",
        "score": 988,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Tim Sheehy is a solid dude, I worked with his company for a few years. Easy to chat with over a beer; we need more people like him in control.",
                "author": "CaptainWinston"
            },
            {
                "raw_content": "Tells us more about 3i/ATLAS",
                "author": "dirtysanchez69"
            },
            {
                "raw_content": "Isaacman. A fine Christian name, to be sure.",
                "author": "Bldg_2019"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Phone Home bitch",
        "score": 486,
        "text_content": "",
        "comments": [
            {
                "raw_content": "JD is the man for embracing the meme!",
                "author": "Givesgunstogrannies"
            },
            {
                "raw_content": "He shouldn't drop her in the sea like that. She might get murdered by Somali pirates.",
                "author": "OnceADroplet"
            },
            {
                "raw_content": "Every black chick that is racist has a white boyfriend too",
                "author": "PiratePatriotParrot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump just called up single mother DONNA in Pennsylvania and gave her a hug - she couldn't believe it ❤️ Trump rally magic. \"Look how beautiful she is!\" DONNA: \"I'm so happy to meet you!\" TRUMP: \"Just say whatever!\" 🤣 DONNA: \"This is like my sister's dream, but I love you too!\"",
        "score": 679,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What a good guy! Best President ever! No doubt.",
                "author": "Givesgunstogrannies"
            },
            {
                "raw_content": "Trump is the people’s President.",
                "author": "KneadThePeople"
            },
            {
                "raw_content": "WE THE PEOPLE ARE SPEAKING",
                "author": "MAGAguitar"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Georgia State Rep. Sharon Henderson (D) has been INDICTED on unemployment fraud after allegedly illegally collecting over $17,000 in benefits during the COVID pandemic.",
        "score": 1180,
        "text_content": "",
        "comments": [
            {
                "raw_content": "My fatigue has fatigue. 🪫",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Aaaaaaaaaaaannnnnnnnnd ... she's black. I'm shocked. Shocked, I tell you!",
                "author": "2016TrumpMAGA"
            },
            {
                "raw_content": "looks like a cheaper more ghetto version of crockett",
                "author": "Brownwaterboys"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Minnesota's weather is cloudy with a 100% chance of ICE.",
        "score": 885,
        "text_content": "",
        "comments": [
            {
                "raw_content": "ICE ICE Agent – Parody of “Ice Ice Baby” by Song Rewire https://www.youtube.com/watch?v=isWeZrP7kzU",
                "author": "FlgPole"
            },
            {
                "raw_content": "Please come to california. Half the state is illegals and you can basically guarantee republican victories if you go scorched earth here.",
                "author": "genericamerican69"
            },
            {
                "raw_content": "All I want for Christmas is ice.",
                "author": "S11houette"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Illegals... Have you thought about getting yourself the fuck out?",
        "score": 489,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Let’s get an expiration on this deal. Offer them a fucking trebuchet into Juarez after Dec 15th",
                "author": "awsure"
            },
            {
                "raw_content": "Can I get a free vacation out of this?",
                "author": "MasterChief"
            },
            {
                "raw_content": "A guide for handshakes as well",
                "author": "FaustyArchaeus"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump says that over the next couple of months, there will be evidence coming out proving that the 2020 election was stolen 👀",
        "score": 1615,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Since I was awake and breathing during that time I require no evidence. I just used my eyes and pre-frontal cortex to good effect.",
                "author": "Taupkek"
            },
            {
                "raw_content": "2 more weeks, suicide weekend coming soon?",
                "author": "ChristIsKing23"
            },
            {
                "raw_content": "I’m so over this shit. Trump secure the border and for that I’m thankful but everything else has been a huge disappointment. There will never be justice for any of the “worst crimes in American history” that he’s spent the last 4 years talking about",
                "author": "DahnaldTrump"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 Red Alert: A Somali man from Minnesota has filmed himself threatening to \"pop\" (aka 𝙎𝙃𝙊𝙊𝙏) ICE agents the next time he sees them...",
        "score": 1086,
        "text_content": "",
        "comments": [
            {
                "raw_content": "ship him to cannibal island",
                "author": "darkmodeforgotpass"
            },
            {
                "raw_content": "How could you tell he was Somali? /s Lmfao",
                "author": "NazisWereSocialist"
            },
            {
                "raw_content": "Somalis are like if blacks and muslims had a baby. The worst of both worlds.",
                "author": "SupFrens"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Impeach Ketanji Brown-Jackson. She is not an idiot. She is something much, much worse: an ideologue who rejects the fundamental legal principles that underpin the Constitution.",
        "score": 1458,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Oh. But she's an idiot too.",
                "author": "berserkerbarrage"
            },
            {
                "raw_content": "Autopen appointment",
                "author": "JustinyAthol"
            },
            {
                "raw_content": "I’m pretty sure she’s all the above, but definitely a fucking idiot!",
                "author": "john9985"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump:",
        "score": 431,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And why does X always promote the same couple of dozen so-called conservative influencers, while the vast majority of conservatives are still banned?",
                "author": "Ronaldus"
            },
            {
                "raw_content": "Posting twitter screencaps on Truth is funny.",
                "author": "MasterChief"
            },
            {
                "raw_content": "All the people with Bondi Binders",
                "author": "usernamechecksout"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔴American ENERGY DOMINANCE at work.",
        "score": 752,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I appreciate the president's efforts to reduce gasoline prices. Now let's focus on getting Diesel down, get rid of the low sulfur BS regulations. I remember for all my life, Diesel was cheaper than regular gasoline.",
                "author": "NotTedCruz"
            },
            {
                "raw_content": "2.95 is not cheap though. Average was 2.17 a gallon in 2020.",
                "author": "Ryunnsun"
            },
            {
                "raw_content": "Nope. Been stuck at 3.35 here since he was elected",
                "author": "daveyistheman"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BLAGO: Just filled up my car with gas. Didn’t seem to take as long as it did a few months ago. Why? Because I expected the cost to exceed $60 but the pump stopped pumping before I hit $50. Gas prices are at their lowest point in 5 years. Trump has made pumping gas more affordable.",
        "score": 1238,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The lower price made the gas pump faster? That doesn't make sense to me. Usually the price being low just makes the price counter go slower. The rate of liquid gasoline flow stays the same.",
                "author": "Ficklepimper"
            },
            {
                "raw_content": "In before 100 \"Not where I live\" comments.",
                "author": "FatigueIsReal"
            },
            {
                "raw_content": "Cool. Now about those increased insurance premiums, increased grocery costs, higher electric utility bills, and those *billions* in foreign aid still being handed out...",
                "author": "heightnoise"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Glen Beck summarizes at his finest.",
        "score": 1138,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Pam is doing exactly what she was installed to do. Wait it out 4 years until they take over again and put us in camps.",
                "author": "HelluvaEngineer"
            },
            {
                "raw_content": "We're all tired and fed up. I'm tired of always being sick and tired.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Pointing these things out somehow means you hate Trump.",
                "author": "UntakenUsername"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A driver sustained minor injuries when a plane crashed onto their car while landing on Interstate 95 in Brevard County, Florida, the Florida Highway Patrol reported.",
        "score": 798,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So you're late for work again, what's you're excuse this time?!",
                "author": "Repentnow"
            },
            {
                "raw_content": "Have fun explaining that to you insurance. I need to file a claim. I was involved in an accident and got hit. Ok, do you have to make model information about the vehicle that hit you?? Yes. A Cessna. Tail N123456",
                "author": "thisisatestof2"
            },
            {
                "raw_content": "Was the pilot aiming for that car to soften his landing? All that space and he nailed that one car.",
                "author": "orcwordlaugh"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "China's banned memory-maker CXMT unveils surprising new chipmaking capabilities despite crushing US export restrictions — DDR5-8000 and LPDDR5X-10667 displayed",
        "score": 105,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yet again another proof, sanction policies are worthless for whoever issued them.",
                "author": "Teftell"
            },
            {
                "raw_content": "\"You could not live with your own failure. Where did that bring you? Back to me,\" -Sun Tzu",
                "author": "Positive-Road3903"
            },
            {
                "raw_content": "Yes please destroy tha Samsung Hynix Micron cursed monopoly. China always saving the world, first cheap phones, then solar panels, batteries, wind mills, EVs, and now compute.",
                "author": "fufa_fafu"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung Display will make 11 million OLED panels for Apple's foldable iPhone in 2026",
        "score": 92,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Tim Apple presenting the product on stage: \"Look at this gorgeous folding oled screen we invented\".",
                "author": "atape_1"
            },
            {
                "raw_content": "Applecare+++ included.",
                "author": "nisaaru"
            },
            {
                "raw_content": "Any ideas what they're going to name it? My bets are on '\"iFold\" or something dumb like that. I don't think it will be \"iPhone\". They're going to introduce this as an entirely new product, claiming to of combined the iPhone and iPad into one device and calling it \"revolutionary\".",
                "author": "virtualmnemonic"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel Takes Major Step in Plan to Acquire Chip Startup SambaNova",
        "score": 79,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> Intel CEO Lip-Bu Tan is currently the chairman of SambaNova Systems Sounds like a major conflict of interest.",
                "author": "jigsaw1024"
            },
            {
                "raw_content": "Oh no, Intel is doing acquisitions again. Can we just skip to where they sell it off for 1/10th in a few years?",
                "author": "TemuPacemaker"
            },
            {
                "raw_content": "Intel has signed a term sheet to acquire the AI chip startup SambaNova Systems, two sources with direct knowledge of the agreement tell WIRED. The details of the term sheet are unknown. The agreement is non-binding, meaning the deal is not yet finalized and could be dissolved without penalty. It could take weeks or even months before regulatory approval, liability scrutiny, and financial due diligence are complete. Intel’s interest in acquiring the startup was first [reported by Bloomberg](https://www.bloomberg.com/news/articles/2025-10-30/intel-in-talks-to-acquire-ai-chip-startup-sambanova) in late October. At the time, the talks were in the early stages. The report noted that SambaNova could sell for less than the $5 billion valuation it had reached in April 2021. Notably, Intel CEO Lip-Bu Tan is currently the chairman of SambaNova Systems. Intel Capital, which Intel is in the process of spinning off into a standalone fund, has also invested in SambaNova Systems. Another investor in SambaNova, Japan’s SoftBank Group, made a [major investment](https://www.reuters.com/business/media-telecom/intel-gets-2-billion-lifeline-form-softbank-equity-investment-2025-08-19/) in Intel earlier this year. A spokesperson for SambaNova declined to comment. Intel had not yet responded to requests for comment at the time of publication. Read the full story here: [https://www.wired.com/story/intel-signs-term-sheet-sambanova-ai/](https://www.wired.com/story/intel-signs-term-sheet-sambanova-ai/)",
                "author": "wiredmagazine"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel confirms \"Big Battlemage\" GPU, Arc B770 could debut at CES 2026",
        "score": 256,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Spoiler. Yes is a new variant but it is call B70 arc pro series Not the B770 we want",
                "author": "Ecstatic_Secretary21"
            },
            {
                "raw_content": "Performance wise, how what nvidia series card will it compare to?",
                "author": "grahaman27"
            },
            {
                "raw_content": "I'm sure B770 will launch as a side-effect if G31, but the real reason is for a low cost (relative) 32GB pro card to target AI. (Called B70?) If Intel can offer 32GB VRAM on the pro card for $1000, it would be hugely popular within it's specific niche. And it's most important job is to get it into the hands of AI hobbyists to build out software support OneAPI in the open source AI community. G31 isn't going to revolutionize the gaming market. It won't revolutionize Intel's finances. But it's goal is going to be high-VRAM at a low cost to try and build out alternatives to CUDA. It's just a shame that it couldn't have come at a worse time from a cost-structure POV",
                "author": "soggybiscuit93"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Framework calls out Dell for price gouging as it charges much less for 32 GB RAM upgrade",
        "score": 235,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lol >Fact-checking revealed that certain statements made in the source posts are false. Our article has been adjusted accordingly.",
                "author": "From-UoM"
            },
            {
                "raw_content": "Tomorrow: framework increases prices blaming ai",
                "author": "grahaman27"
            },
            {
                "raw_content": "Isn't this industry standard? It has always been cheaper to just buy the base model and upgrade the ram and drives. I bought a 64g steam deck and 512g drive for cheaper then the 256g steamdeck.",
                "author": "Local_Debate_8920"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel Core Ultra X9 388H pushes Core Ultra 9 285HX and Ryzen AI Max+ 395 in early results with new Arc B390 [Notebookcheck]",
        "score": 34,
        "text_content": "",
        "comments": [
            {
                "raw_content": "is Geekbench a CPU or a GPU benchmark?",
                "author": "LastChancellor"
            },
            {
                "raw_content": "Interesting results. If this is representative for consumer laptops, Panther Lake is a much bigger upgrade than most here, including me, expected. But it almost seems too good to be true somehow.",
                "author": "heylistenman"
            },
            {
                "raw_content": "Hello LastChancellor! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung Reportedly Speeds Up U.S. Hiring as Tesla Prepares for AI5 Production",
        "score": 11,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Tata and Intel Announce Strategic Alliance to Establish Silicon and Compute Ecosystem in India",
        "score": 34,
        "text_content": "",
        "comments": [
            {
                "raw_content": "**Side-note:** Curious enough, *Randhir Thakur*, Tata Electronics' CEO & Managing Director, was a long-term Intel-employee earlier and lastly *Intel Foundry Services*' president, before he left in 2022. So it's going to be interesting what may come out of this, when Intel works at Tata with former staff.",
                "author": "Helpdesk_Guy"
            },
            {
                "raw_content": "What use does Intel have for a 28nm fab in India ? (The upcoming Tata fab will be producing 28nm chips in India in collaboration with PSMC)",
                "author": "Worldly_Topic"
            },
            {
                "raw_content": "As an indian i give 0 shit about any news about this topic. Indian politicians blab about this for decades. Only thing that is news worthy is real fab construction and of a better tech than what is currently already online in india. Most advanced fab in india right now is 28nm. So a real fab more advanced than that is interesting. Some twitter comment is not.",
                "author": "Hamza9575"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "\"It's A Bit Of A Joke At This Point\" - Skyrim Dev On Returning For A Switch 2 Re-Release",
        "score": 403,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I find it hard to believe they couldn't have got this running 60fps. What a joke.",
                "author": "CutMeLoose79"
            },
            {
                "raw_content": "Awful port. Runs at 30fps with input lag",
                "author": "Professional_Wiz"
            },
            {
                "raw_content": "30fps is the gold standard boys. Ignore your 60hz tv you’ve had since the beginning of time",
                "author": "EliteSalesman"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Skyrim Switch 1 and Switch 2 comparison (screenshots are mine) (Docked)",
        "score": 373,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Mr Howard can suck my balls if this isn't 60fps in a patch, yesterday.",
                "author": "Vanin1994"
            },
            {
                "raw_content": "Its an unbelievably bad 'upgrade', it brings minor benefits over the Switch 1 version and some actual downgrades. - It runs at 30fps which is frankly unacceptable no matter what way you spin it. - 250ms of input lag that makes the game feel worse to play at 30fps than the original Switch version. - It's very clearly cheaply upscaled from 720p to 1080p in handheld mode using DLSS. I don't believe there's any ACTUAL resolution increase here. Given that there is theoretically a ton of headroom from it still being 30fps that is quite unacceptable. - The file size is a whopping 53gb somehow. Given that the PC install of the anniversary edition is only 19gb I can't help but feel there's a colossal mistake with the install here. I theorise that they've doubled up on the installed files, including an entire Switch 1 install as well as the Switch 2 version and all optional language packs. Given all this the Switch 2 upgrade is a colossal disappointment and a huge missed opportunity. I'd forgive it easier if it was a free upgrade to the base game but you have to pay £18 to upgrade to the anniversary edition. At least it adds back the volumetric effects from the special edition I guess?",
                "author": "Sjknight413"
            },
            {
                "raw_content": "Sad they couldn’t do 60 FPS",
                "author": "JBL561"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I’m easy to please and even I’m disappointed in Bethesda",
        "score": 39,
        "text_content": "It doesn’t take much to make me happy with video games. I’m a simple guy. When I woke up today and saw Skyrim got a Nintendo Switch 2 upgrade I was over the moon. I love playing 3rd party games on switch because I’m a handheld gamer at heart. I already owned the anniversary dlc so it was a free upgrade for me. I was super pumped. Imagine my surprise when I started a new save just to see it looks exactly the same and controls and performs worse than I remember on my Nintendo Switch OLED. I see zero benefits and a couple of negatives. I literally can’t tell a different in visuals. How can a 14 year old game not run at 60fps on my $500 Nintendo Switch 2? It’s unacceptable to me that it doesn’t at all take advantage of the hardware despite what the eShop description says. I can forgive newer, more demanding games. But Skyrim CAN run at 60fps and the Nintendo Switch 2 CAN run it at 60fps. So what exactly was the point of this “upgrade” beyond charging people more money? I’m guessing that was the only reason. I expected very little and somehow I’m still disappointed **TL;DR** I’m very easy to please and don’t often complain about stuff like this but I’m deeply disappointed in this lazy “upgrade” that seemingly only exists to part people with their money. It looks the same but runs worse. Ridiculous.",
        "comments": [
            {
                "raw_content": "Tell me lies, tell me sweet little lies",
                "author": "Banmers"
            },
            {
                "raw_content": "The Switch 3 will finally support 60fps Skyrim.",
                "author": "Dreamo84"
            },
            {
                "raw_content": "I just really don't understand the reasoning behind focusing on visuals over performance. It would make it so much more impressive if they made it run at 60fps, the visual improvements barely make a difference, it's such a baffling decision.",
                "author": "TyleNightwisp"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "PSA if trying to upgrade from physical Skyrim copy with anniversary edition update to Switch 2 version",
        "score": 515,
        "text_content": "Do the following to upgrade to the switch 2 edition for free: 1: Open virtual game cards and unload anniversary edition update from your switch 2. 2: Remove the game card for Skyrim from your switch 2 and press + on the icon and under manage software, go to delete software. 3: Insert the game card into your Switch 2 and launch the game (after downloading the required data) 4: Launch the game and use the in game prompt to download switch 2 edition. It seems unloading the virtual game card for the Switch 1 anniversary update is required in order to upgrade for free. Enjoy!",
        "comments": [
            {
                "raw_content": "thanks again for the headsup! Also, I guess it is the same case as with Hogwarts Legacy. Once you upgraded, you don‘t technically need the cartride anymore. Need to test it, to be sure",
                "author": "krautundsprite"
            },
            {
                "raw_content": "If only Bethesda spend some resource and time to optimize this for the Switch 2, it would easily run in stable 60fps with enhanced graphics and textures. But no, let’s keep it lazy and milk the fuck out of Skyrim.",
                "author": "Futaba800"
            },
            {
                "raw_content": "You are a Legend Tubonub!!",
                "author": "Bahlduino"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Just downloaded Skyrim it's 50 gig from 10. And played it and just busted out laughing I can't barely tell a difference.",
        "score": 51,
        "text_content": "I can't tell the resolution maybe 1440p def not 4k. And it actually gets a jagged frame drops. So I feel like I'm switching back to the cartridge for switch it kinda made it more glitchy some how too. Maybe it's because I'm using a carry over save who knows. I don't even think we got the ps4 level skyrim im highly skeptical about this. The resolution handheld is awesome tho and runs oddly better. It's weird the ps4 version had more life to it and it's smaller size around 14 gig why?",
        "comments": [
            {
                "raw_content": "We have to stop falling for marketing. I’m preparing everyone now, this is going to be a common theme on switch 2. There will be many developer/publishers that are looking to make a quick buck by doing to least. The console is just powerful enough and have features they can market to gamers as if they put a lot of work in. “Using DLSS” “optimized performance” this will become synonymous with the Switch 2.",
                "author": "GronWarface"
            },
            {
                "raw_content": "Bethesda and Tod himself can suck a bag of carrots.",
                "author": "Nine-UA"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Bethesda Found Another Platform to Release Skyrim On: Nintendo Switch 2 — and It's Out Today",
        "score": 601,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The real question is does it run at 60 FPS now",
                "author": "PeepsRebellion"
            },
            {
                "raw_content": "\"optimized performance\" haha.... You know something is wrong when they do their very best not to mention actual numbers... Usually the \"4k/60fps\" is written all over those trailers. They probably improved the assets but I don't want to play a 14yo game at 30fps in 2025. How they even thought this was a good idea is beyond me. Feels like a massive missed opportunity.",
                "author": "Solar_Field"
            },
            {
                "raw_content": "Running it now, negative on 60fps. It does now have the better lighting and depth of field. Not a huge visual difference but brings it more in line with the other console anniversary editions.",
                "author": "the_real_junkrat"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo Switch 2 Launch Trailer - Skyrim Anniversary Edition",
        "score": 613,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Oh, good, for a while, I thought they were going to forget to release Skyrim for the Nintendo Switch 2. So is this like the 20th release of the game?",
                "author": "Williekins"
            },
            {
                "raw_content": "https://preview.redd.it/6h5vg6hf376g1.jpeg?width=640&format=pjpg&auto=webp&s=8b526032583627bbcd61bf1e329b28458264b52b",
                "author": "PaleFondant2488"
            },
            {
                "raw_content": "Free upgrade for those that already have the Anniversary Edition on Switch apparently. You also have an upgrade pack if you just have the base game.",
                "author": "TheMenace44"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "With almost all games out for Switch 2 for 2025 (with a few minor exceptions): What is your game of the year and why?",
        "score": 55,
        "text_content": "Would love to hear what people have been enjoying the most. ..And bonus: what people have been most disappointed by? Explanations are always fun to read as well :)",
        "comments": [
            {
                "raw_content": "For Switch, DK Bananza is my GOTY. I love how powerful they made DK feel with the destruction mechanics and banana transformations. Movement feels so fun in this game. For a Nintendo 3D platformer there was a decent amount of effort put into the story. Giving Pauline actual voice acting really helped make her character endearing. The Void co trio were great and I hope this isn't the last we see of them.",
                "author": "StarPlatinum55"
            },
            {
                "raw_content": "Hades 2. For anyone who liked the original, the gameplay is better in every conceivable way, but the story and characters are too. It’s like an “Empire Strikes Back” level of sequel.",
                "author": "marknc23"
            },
            {
                "raw_content": "Metroid Prime 4 for me. Such high quality music and graphics, same Prime gameplay (except more linear). I like viola and don't mind the NPCs as of yet. The boss battles are really good. The environments are fun to explore. I like the psychic abilities too. The good far outweighs any minor complaints I may have.",
                "author": "jjmawaken"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Discussion, News, and Request Thread - Week Beginning 12/08/25",
        "score": 49,
        "text_content": "[https://pbs.twimg.com/media/G7wHyEZaAAA-Kjz?format=jpg&name=small](https://pbs.twimg.com/media/G7wHyEZaAAA-Kjz?format=jpg&name=small) Discussion threads are your weekly central hub for all requests, gaming news, and any other gaming topics you want to talk about. *Please keep all content that doesn't need it's own post to this thread to de-clutter the sub for proper leaks and rumors. Thanks!* **Join our new companion sub for super secret Resident EVIL 9 and Half-Life 3 leaks** \\-- [r/OkBuddyGLAR](https://new.reddit.com/r/OkBuddyGLAR/) Hot Threads of the past week: * [According to sources, Netflix just won the Warner Bros. bid.](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1pelp3i/according_to_sources_netflix_just_won_the_warner/) * [Netflix considered buying EA, Fox and Disney before they decided towards Warner Bros.](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1phf5oh/bloomberg_netflix_considered_buying_ea_fox_and/) * [Dead Space is internally “on ice”, leadership on EA hoping to “sell the IP”](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1pf7rec/mike_straw_dead_space_is_internally_on_ice/) * [Paramount Considering Hostile Takeover Of Warner Bros.](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1pfbzhb/paramount_considering_hostile_takeover_of_warner/) * [Jason says statue game is “very cool and many will be excited for it”, doesn’t know if Cory Barlog’s game will be at TGA”](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1pfo0vg/jason_schreier_says_statue_game_is_very_cool_and/) # [Want to help us improve this subreddit? ](https://forms.gle/w9JaYTjVN1Zie9e39)[Provide us with feedback here](https://forms.gle/w9JaYTjVN1Zie9e39)[!](https://forms.gle/w9JaYTjVN1Zie9e39) # [Click here to join the discord to enjoy further conversations with the community!](https://discord.gg/6jdBvCSqbj)",
        "comments": [
            {
                "raw_content": "Petition to make a Part 2 of The Game Awards Thread for tomorrow, it's going to be packed.",
                "author": "healingtwo_"
            },
            {
                "raw_content": "Henry Cavill on stage to present the reveal for Total War Warhammer 40k! He played the total war warhammer fantasy games so I wouldnt be surprised if that happens",
                "author": "BasementMods"
            },
            {
                "raw_content": "KOTOR KOTOR KOTOR",
                "author": "UnlimitedMeatwad"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "According to Lucas Shaw of Bloomberg, Warner Bros. will announce next week that they will proceed with Netflix's offer instead of Paramount's counteroffer.",
        "score": 630,
        "text_content": "https://xcancel.com/Lucas_Shaw/status/1998550897232880032#m",
        "comments": [
            {
                "raw_content": "Paramount will then increase their offer, and then I assume Netflix will do the same. WB Shareholders are loving this.",
                "author": "Chessh2036"
            },
            {
                "raw_content": "Shaw is a great source. I believe it",
                "author": "Poetryisalive"
            },
            {
                "raw_content": "As others are pointing out, I feel like Netflix winning the bid would be the lesser of two evils... Definitely not because I leech off my sister's friend's barber's Netflix account but don't know anyone I could use similarly to watch Paramount+ or whatever their service is called, no sir...",
                "author": "ThatIsAHugeDog"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "NateTheHate on the TGS statue: “It’s Larian.”",
        "score": 319,
        "text_content": "https://xcancel.com/natethehate2/status/1998480843535196330?s=46",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Yeah, the copyright stuff basically confirmed that. It overlays perfectly. Can Nate confirm if HL3 is there pls, PLS.",
                "author": "TAJack1"
            },
            {
                "raw_content": "That guy's random theory was right lol",
                "author": "pestoraviolita"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "\"FINAL FANTASY\" playlist of trailers on Square Enix's YouTube channel has 2 unlisted videos",
        "score": 170,
        "text_content": "https://youtube.com/playlist?list=PL2A8F9VO2BGN36WRdMPr73KpdcL7oeAIQ&si=5vQSDZh4pZESySvA the \"FINAL FANTASY\" playlist of trailers on Square Enix's YouTube channel has 2 unlisted videos and was updated today. if you scroll down they are shown as Private. trailers from TGA coming? I assume the first is Final Fantasy 7 Remake Part 3 and the second is a Final Fantasy 14 update or Final Fantasy 9 Remake edit: only one video is new, /u/imsooooooooooooreal found that one video is the Crisis Core Reunion trailer but the other was still added today so hopefully it's FF7R3 https://www.reddit.com/r/GamingLeaksAndRumours/s/KvRkXvkYLc",
        "comments": [
            {
                "raw_content": "It's VII-3. I wouldn't be surprised if Rebirth Switch 2 is also here but Nomura said in September the announcement timeline was decided, Hamaguchi later said they were finalizing the title within the year. He also recently said they had finally nailed the Highwind traversal and a lot of the new gameplay content. I doubt there isn't fire after all this smoke Announce VII-3 with a title and early gameplay, early 2027 launch day one on Switch 2/PS5/PC/Xbox, plug Rebirth coming to other consoles at the end. Writes itself",
                "author": "MyMouthisCancerous"
            },
            {
                "raw_content": "A FF9 remake announcement or a FF7 Remake Part 3 tease would be nice",
                "author": "Minimum-Can2224"
            },
            {
                "raw_content": "chrono cross and rebirth switch 2 versions inbound but will the switch 2 version of rebirth come with a pack of magic cards like remake does",
                "author": "robertman21"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "MP1st: TGA Statue Mystery Solved – New Divinity Trademark Uncovered as New Icon Matches Statue",
        "score": 1090,
        "text_content": "[source](https://mp1st.com/news/report-tga-statue-mystery-solved-new-divinity-trademark-uncovered-as-new-icon-matches-statue) Some new trademarks for Divinity have icons matching the statue. Seems that the big reveal is Divinity 3. [Edit](https://xcancel.com/Cromwelp/status/1998484634397479293): according to the director of publishing at Larian, \"There aren't currently any plans for a new Divinity Original Sin 3\", so this new Divinity might have another title or be a reboot.",
        "comments": [
            {
                "raw_content": "Divinity Original Sin 3 with BG3's budget is a dream. Larian's about to raise the bar again",
                "author": "PhantomBraved"
            },
            {
                "raw_content": "Are they just calling it \"Divinity\"? Full reboot of the franchise?",
                "author": "KMoosetoe"
            },
            {
                "raw_content": "We kinda had a feeling its a new Larian game i just hoped it would be a new IP but Divinity 3 would be a banger",
                "author": "Loose_Society9485"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Michael Douse, Director of Publishing at Larian, says there are \"currently no plans for Divinity: Original Sin 3\"",
        "score": 687,
        "text_content": "https://xcancel.com/Cromwelp/status/1998484634397479293#m Doesn't mean it isn't another ARPG in the Divinity universe, but then I wonder why Shinobi would be suggesting the game behind the statue would only really excite fans of the franchise, given ARPGs are much more popular than CRPGs.",
        "comments": [
            {
                "raw_content": "So it’s just called Divinity 3 got it lol",
                "author": "InvertedSpork"
            },
            {
                "raw_content": "At no point that link showed \"Original Sins\" anywhere.",
                "author": "Lz537"
            },
            {
                "raw_content": "The series is called \"Divinity\" and there have been multiple terms attached to that mononym across releases. \"Divinity: Original Sin 3 does not exist\" does not mean they aren't making a game with the gameplay you'd expect from DOS3 but a different title.",
                "author": "Ok_Peace628"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Leakers NashWeedle and Nintenleaks confirm that next Monolith Soft game is code-name Project Legacy and speak about a presence around the TGA or at the latest in february/in the next direct.",
        "score": 172,
        "text_content": "[](https://www.reddit.com/r/GamingLeaksAndRumours/?f=flair_name%3A%22Rumour%22)It went a bit unnoticed but last week those 2 made some statements about this game. From what NashWeedle is saying, something seems to have leaked last sunday about this game I also find it interesting that the recent Animal Crossing 3.0 rumors line up with the timing they’re hinting at Sources : NashWeedle : [https://www.youtube.com/watch?v=NvQScW6uVcI&t=537s](https://www.youtube.com/watch?v=NvQScW6uVcI&t=537s) Nintenleaks : [https://www.youtube.com/watch?v=FsHzFwRivzM&t=1071s](https://www.youtube.com/watch?v=FsHzFwRivzM&t=1071s) Precedent Rumors :: [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1d2xc4q/midori\\_i\\_was\\_told\\_a\\_few\\_months\\_ago\\_that\\_monolith/?tl=fr](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1d2xc4q/midori_i_was_told_a_few_months_ago_that_monolith/?tl=fr)",
        "comments": [
            {
                "raw_content": "Nash Weedle is not reliable and I have never heard of Nintenleaks.",
                "author": "ThemeParkFan2020"
            },
            {
                "raw_content": "I'm likely to buy whatever Monolith puts out next just because they've never disappointed me but would they really announce anything at the TGA? I feel like Nintendo always announces its first-party stuff in Directs, right?",
                "author": "ThatIsAHugeDog"
            },
            {
                "raw_content": "My goats on their way to cook up another masterpiece 🙏",
                "author": "padraigharrington4"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "DOOM 4 assets and concept art have been found.",
        "score": 308,
        "text_content": "Preserving the material, documentation and footage of id's unreleased DOOM game. https://xcancel.com/Runhob/status/1998501951672320139 https://xcancel.com/boomshootart/status/1998265060360356306 https://xcancel.com/Runhob/status/1998481572459344086 https://xcancel.com/Runhob/status/1998036674027344084 https://xcancel.com/Runhob/status/1998491549869428769 https://xcancel.com/Runhob/status/1998488287573602743 https://xcancel.com/Runhob/status/1998479067595620431 https://xcancel.com/Runhob/status/1998036255305777215 https://xcancel.com/WadOverdose/status/1997752753930768458",
        "comments": [
            {
                "raw_content": "I can't say I'm particularly bummed this got sacked. It's fascinating how much the combined success of stuff like CoD4 and Gears made boomer shooter makers think they had to reinvent themselves ironically by chasing the trends set by other games. Doom 3 was another attempt to reinvigorate Doom but I'd argue the horror-driven tone and atmosphere suited it far better than just a generic military-focused Earth-bound story",
                "author": "MyMouthisCancerous"
            },
            {
                "raw_content": "The greatest thing to ever happen to this concept was it being completely scrapped. DOOM is not a call of duty game, DOOM is DOOM",
                "author": "RabbitGuy667"
            },
            {
                "raw_content": "I know a lot of people are happy this didn't surface and we did get a great Doom 4, but some of this concept art is pretty neat tbf. Could have potentially been spin off territory",
                "author": "ItsCrankss"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Previouss renders of RE9 was made by AI generate.",
        "score": 288,
        "text_content": "Users on Twitter find out that the \"Leaked Renders\" of Resident Evil 9 was made by AI (the renders posted by the Twitter user [@idontknow\\_17292](https://xcancel.com/idontknow_17292), this not inclunded the leaked render of Leon on PlayStation Store). Also, this can also say that his rumors about Half Life: Xen and Silent Hill 1 Remake can be put on the table as a BIG GRAIN OF SALT right now. Source: [https://xcancel.com/berony27/status/1998415176270578050](https://xcancel.com/berony27/status/1998415176270578050) Previouss Rumor: 1. [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1pi6ysj/more\\_re9\\_character\\_renders\\_are\\_being\\_leaked/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1pi6ysj/more_re9_character_renders_are_being_leaked/) 2. [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1piemub/re9\\_leaker\\_confirms\\_the\\_appearance\\_of\\_sh1r\\_at\\_tga/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1piemub/re9_leaker_confirms_the_appearance_of_sh1r_at_tga/) 3. [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1pi7elv/re9\\_renders\\_leaker\\_claims\\_halflife\\_xen\\_will/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1pi7elv/re9_renders_leaker_claims_halflife_xen_will/) Edit: I find the original guy who made the renders, and even they made to looks like in a pretty high quality. Their models are extremelly bad when you take a closer look, the most obvious one being the Leon \"Leaked\" Figure he posted, where there's a lot of fake Funko Pops on the background. Really take this as a BIG GRAIN OF SALT. Source: [https://xcancel.com/SpookyHoo/status/1998368805781680634/photo/1](https://xcancel.com/SpookyHoo/status/1998368805781680634/photo/1)",
        "comments": [
            {
                "raw_content": "\"Half Life Xen\" was the fakest shit I ever heard so it was a instant debunk in my mind then and there lol. I genuinely don't even know how they came up with that name, even if they wanted to pretend",
                "author": "ChiefLeef22"
            },
            {
                "raw_content": "So Leon is true but everything is fake huh",
                "author": "Embarrassed-Part-890"
            },
            {
                "raw_content": "They were made by SpookyHoo, who is also responsible for using AI to upscale the PS Store image.",
                "author": "Responsible_Trade383"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel \"Panther Lake\" Core Ultra X9 388H flagship SKU leaks out on Geekbench",
        "score": 49,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm hungry for Discrete Arc News, heard there was new Linux driver updates. Hopefully we hear something Discretely by CES 2026, a month away. So thirsty, further seems forever...",
                "author": "quantum3ntanglement"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "GIGABYTE Radeon RX 9000 cashback drops RX 9070 XT price to €549 in Europe",
        "score": 222,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I got the RX 9060 XT Gaming OC 16GB for 324€ and this model has a 40€ cashback, so final price of 284€. This price was on amazon for just 1h before they changed again to their normal price of 390€. What a deal, hopefully amazon doesn't cancel.",
                "author": "The_Goat_Charmer"
            },
            {
                "raw_content": "This will probably be as low as gets. Buy it while you can.",
                "author": "DeadPhoenix86"
            },
            {
                "raw_content": "With the cashback, I can snag a Radeon RX 9070 XT GAMING OC for just 499€, but isn't it one of the worse 9070 XTs out there?",
                "author": "darthglabrezu"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD launches EPYC Embedded 2005 based on \"Fire Range\" with up to 16 Zen5 cores",
        "score": 40,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It is funny that this is actually a downgrade compared to the 3001 series in certain aspects, like less memory channels and less PCIE lanes. 3001 was also a unique design vs this which just seems to be repurposed laptop dies (which is repurposed desktop dies) I guess they called it the \"2000\" series for a reason",
                "author": "GradSchoolDismal429"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "ASRock Radeon RX 9070 XT Monster Hunter Wilds Edition Review",
        "score": 35,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is the additional $30 from the steel legend rx 9070xt worth it?",
                "author": "metroslasher"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "SUPER X gaming tablet with Ryzen AI MAX 300 launches at $1899",
        "score": 19,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Another $2000 tablet 🙄 still only one laptop.",
                "author": "Agentfish36"
            },
            {
                "raw_content": "So similar concept to the old minisforum v3. It is quite sad that they dont consider releasing a cutdown model using the older cheaper 7840/8840 chip.",
                "author": "kid_380"
            },
            {
                "raw_content": "Curious about the fan noise on this bitch lol",
                "author": "Aggravating_Ring_714"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "GPD WIN 5 Review - Ryzen MAX 395 Monster! vs ROG Xbox Ally X vs MSI Claw 8 AI+",
        "score": 8,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "Kevin O'Leary Says The 'Biggest Money Trap' is Getting Yourself a Suffocating Mortgage",
        "score": 367,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I mean, he isn't wrong, but it's also pretty tone deaf in the current environment.",
                "author": "aznsk8s87"
            },
            {
                "raw_content": "Yes Daddy I'll keep renting from you.",
                "author": "peekitup"
            },
            {
                "raw_content": "Kevin O’Leary is a clown",
                "author": "Bigdaddyblackdick"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Senator launches probe of investment groups buying up trailer parks",
        "score": 27,
        "text_content": "Even mobile homes aren't safe anymore.",
        "comments": [
            {
                "raw_content": ">25% of mobile home purchases were made by investors over the course of the last 24 months That seems **inordinately** high, 1 in 4? I'm not questioning the data point, it's just hard to fathom that that many units are being bought by investors...",
                "author": "cdojs98"
            },
            {
                "raw_content": "In my area the easiest land to develop on is mobile home parks. Developers can negotiate with a single seller and get enough land that they can build hundreds of homes on.",
                "author": "ankercrank"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Administration moves to remove millions of student loan borrowers from payment pause",
        "score": 118,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If this doesn't cause a flurry of defaults, I don't know what will.",
                "author": "Moobygriller"
            },
            {
                "raw_content": "I know stupidity shouldn't surprise me but it really feels like this recession(depression) is being purposefully triggered. Now I think it was always coming, but obviously policies and management will contribute to its depth. What surprises me is this austerity usually FOLLOWS the economic shock rather than PRECEDES it. It makes more sense to impose planned austerity with the scapegoat of \"the economy is bad\" than impose it and be blamed for crashing the car.",
                "author": "The_F1rst_Rule"
            },
            {
                "raw_content": "[removed]",
                "author": "None"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "You're probably $30,000 short of what you need to buy a house—and you're not alone | Fortune",
        "score": 47,
        "text_content": "",
        "comments": [
            {
                "raw_content": "lol not in my area. It’s more like 200k - 400k of cash down payment.",
                "author": "JustAcivilian24"
            },
            {
                "raw_content": "yeah, $30k lol. My HCOL neighborhood has townhomes going for $800k+ and SFHs with lots of overdue maintenance going for $1.2M+",
                "author": "liverpoolFCnut"
            },
            {
                "raw_content": "That’s why floor plans designed for multigenerational living or house hacking are seeing higher demand.",
                "author": "ThemeBig6731"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "More than 75% of homes across the U.S. are unaffordable, study finds",
        "score": 368,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The median home price is \\~5X the median household income, which doesn't even meet standard mortgage loan underwriting guidelines. No wonder.",
                "author": "Welcome2B_Here"
            },
            {
                "raw_content": "I'd imagine that figure is WELL above 75%. Just because you can pay your mortgage doesn't mean it's affordable. Do I think my mortgage is affordable? Fuck no, I can pay it no problem, but $4700 a month isn't a fucking deal to me. The mortgage the last boomer that owned this place was around $2200 a month; I think that's a deal and affordable, just not this shit. Story old as time; boomer pays peanuts, then pull up the ladder and run away with bags of money.",
                "author": "Moobygriller"
            },
            {
                "raw_content": "Barring an economic crash, or something that removes millions and millions of people from the USA, or supply drastically increasing, I don't see that changing.",
                "author": "Then_North_6347"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "A 0.25% Fed cut is widely expected, but 2026 projections may have a bigger impact on mortgage rates",
        "score": 26,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I think they'll go down, or maybe up.",
                "author": "Kobe_stan_"
            },
            {
                "raw_content": "Tons of houses are coming on the market in my area outside Seattle. Where since covid it was practically nothing. Was it layoffs, RTO, deportations?",
                "author": "2manyhobby"
            },
            {
                "raw_content": "We want a “hawkish Fed cut” to flatten the yield curve, lower the 10 year yield and reduce the 30 year fixed mortgage rate. Speculators are playing the game of “buy the rumor of a hawkish Fed cut and sell the news”. If we indeed get a hawkish Fed cut, we will see the 10 year yield go down below 4% as traders will bet that growth and inflation will slow.",
                "author": "ThemeBig6731"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Most people have no idea how far AI has actually gotten and it’s putting them in a weirdly dangerous spot",
        "score": 693,
        "text_content": "I’ve been thinking about something that honestly feels wild once you notice it: most “normal people” outside the AI bubble still think we’re in the six-finger era of AI. They think everything is clumsy, filtered, and obvious meanwhile, models like nanabanana Pro, etc. are out here generating photos so realistic that half of Reddit couldn’t tell the difference if you paid them. The gap between what the average person thinks AI can do and what AI actually can do is now massive. And it’s growing weekly. It’s bad because most people don’t even realize how fast this space is moving unless TikTok spoon-feeds them a headline. Whole breakthroughs just… pass them by. They’re living like it’s 2022/23 while the rest of us are watching models level up in real time. But it’s also good, in a weird way, because it means the people who are paying attention are pushing things forward even faster. Research communities, open-source folks, hobbyists they’re accelerating while everyone else sleeps. And meanwhile, you can see the geopolitical pressure building. The US and China are basically in a soft AI cold war. Neither side can slow down even if they wanted to. “Just stop building AI” is not a real policy option the race guarantees momentum. Which is why, honestly, people should stop wasting time protesting “stop AI” and instead start demanding things that are actually achievable in a race that can’t be paused like UBI. Early. Before displacement hits hard. If you’re going to protest, protest for the safety net that makes acceleration survivable. Not for something that can’t be unwound. Just my take curious how others see it.",
        "comments": [
            {
                "raw_content": "It's going to blindside the general population hard. I'm in India and I think people will only pay attention once any of the Big outsourcing companies get their teeth kicked in.",
                "author": "kcvlaine"
            },
            {
                "raw_content": "It goes both ways. People underestimate what AI can do but also overestimate it. They fall out of their pants are the generated pictures, but are shocked that it fails at other relatively simple tasks. Much depends on what you are trying to do, which tool you are trying to use and how well-prepared the prompts are.",
                "author": "trisul-108"
            },
            {
                "raw_content": "I agree. Even on this sub, many people are surprised that I'm using AI to study math. Most people have heard that AI hallucinates, so they think it's incapable of anything. They don't pay any attention to the fact that its capabilities are rapidly improving, and its error rate is decreasing almost every month.",
                "author": "DepartmentDapper9823"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "vibe coding developers in 2025",
        "score": 1326,
        "text_content": "",
        "comments": [
            {
                "raw_content": "[JayZ and Rick Rubin recording 99 problems. ](https://www.youtube.com/watch?v=FqNDYvsOZkc)(10 min) You get an idea about Ricks role.",
                "author": "airduster_9000"
            },
            {
                "raw_content": "The scale of \"What Exactly Do you Do Here?\" music figures is vast. On the high end is Rick Rubin. On the low end is DJ Khaled.",
                "author": "plasma_dan"
            },
            {
                "raw_content": "… I don’t know if you were aware of this when making this point, (I’m sure you were,) but Rick Rubin actually wrote The Way of the Code, which were meditative contemplations on vibe coding. He did it in partnership with Claude Code. Thewayofthecode.com",
                "author": "danielbearh"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Anthropic hands over \"Model Context Protocol\" (MCP) to the Linux Foundation — aims to establish Universal Open Standard for Agentic AI",
        "score": 706,
        "text_content": "Anthropic has officially donated the Model Context Protocol (MCP) to the **Linux Foundation** (specifically the new Agentic AI Foundation). **Why this is a big deal for the future:** **The \"USB-C\" of AI:** Instead of every AI company building their own proprietary connectors, MCP aims to be the standard way *all* AI models connect to data and tools. **No Vendor Lock-in:** By giving it to the Linux Foundation, it ensures that the \"plumbing\" of the Agentic future remains neutral and open source, rather than owned by one corporation. **Interoperability:** This is a crucial step towards autonomous agents that can work across different platforms seamlessly. **Source: Anthropic / Linux Foundation** 🔗 : https://www.anthropic.com/news/donating-the-model-context-protocol-and-establishing-of-the-agentic-ai-foundation",
        "comments": [
            {
                "raw_content": "Seems good. For progress and for people.",
                "author": "FarrisAT"
            },
            {
                "raw_content": "They are 100% stepping away from this long term.",
                "author": "strangescript"
            },
            {
                "raw_content": "Rather surprising. I'm wondering if this is a way to distance themselves from it. Being custodians of a protocol is probably pretty thankless.",
                "author": "Saint_Nitouche"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "NVIDIA CEO Jensen Huang breaks down the five layers of AI",
        "score": 194,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He forgot about the foundational layer—em dashes",
                "author": "Shick_hydro"
            },
            {
                "raw_content": "Fk that... Where's the black leather jacket !!?",
                "author": "Jazzlike_Resort_2828"
            },
            {
                "raw_content": "Gamers build Nvidia, Jensen should remember that. I will be forever salty for 1000+$ xx80 class graphics cards. That's why I have 9070 XT and 4x radeon AI PRO R9700 on my LLM server, eat it Jensen and keep your shovels.",
                "author": "Ult1mateN00B"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Engine.AI T800 spotted parading alongside police",
        "score": 239,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The beginning of the end.",
                "author": "Error_404_403"
            },
            {
                "raw_content": "so they're calling it T800 huh... oh boy...",
                "author": "ifull-Novel8874"
            },
            {
                "raw_content": "Imagine they made even just 30% taller.",
                "author": "pcurve"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "People don't understand Yann LeCun",
        "score": 73,
        "text_content": "All he is saying is we have big missing pieces to achieve AGI. And it will take years of fundamental research to achieve the necessaries breakthroughs. In one of his talk I think he said we still have at least 2 breakthroughs, 1 of them will probably be achieved in the next 3-5 years (he is betting on something around JEPA), and after that he thinks we will most likely need an other breakthrough, without knowing exactly how long it will take.",
        "comments": [
            {
                "raw_content": "Dr. LeCun believes that next-token/next-frame prediction can’t lead to “true” intelligence, even if implemented in a high resolution world model. He discounts the idea (backed by good evidence) that the models still do a lot of abstract thinking and planning in latent space before each token is generated. Dr. LeCun’s argument would be greatly strengthened if he could point to some sort of cognitive task or class of cognitive tasks that transformers fail miserably at and always will because of design limitations, but the only examples I’ve seen him suggest all aged like milk. He might also contend that transformer models lack the capacity to rapidly learn and adapt long-term to new information, but that’s something already in the works and largely delayed by safety rather than technical concerns. I think Dr. LeCun would do far better in promoting alternatives like JEPA if, rather than trying to prematurely claim that transformers have fundamental limitations preventing them from ever achieving AGI capabilities, he were to instead merely suggest that other approaches might lead to greater computational and electrical efficiencies, which is one area where biology still has a massive lead.",
                "author": "FriendlyJewThrowaway"
            },
            {
                "raw_content": "Issue is that Yann has been a staunch nonbeliever since at least 2018, he actually used to make fun of OpenAI up until 2022 when they released GPT-3. He didn’t think any of the tech we have today was possible until >2050 He just keeps moving his goalposts. He has many interviews from 2018-2021 mocking the early GPT models and how OpenAI is wasting their time.",
                "author": "Glock7enteen"
            },
            {
                "raw_content": "“When an eminent old scientist says that something is impossible they are almost certainly wrong…”",
                "author": "PaleCalloway"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Japanese company claims to have built world-first AGI system",
        "score": 397,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/cz0v2bd4u76g1.png?width=344&format=png&auto=webp&s=f97e66bbb44ff18e955b80273a6f028c269968ea I will just put this one here.",
                "author": "Nervous-Positive-431"
            },
            {
                "raw_content": "\"Our mission now is to scale this *AGI-capable* model\" Okay, let us know when you've done that.",
                "author": "xirzon"
            },
            {
                "raw_content": "ANIME GENERAL INTELLIGENCE?!",
                "author": "PwanaZana"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "GPT-IMAGE-2 possibly in LMArena under the name \"Hazel-gen\"",
        "score": 326,
        "text_content": "The model seems very good compared to GPT-IMAGE-1, claims to be from openai, so it's fair to think this is the long awaited GPT-IMAGE-2. Image prompt - \"a table with an analogue clock that read 7:24 and a glass of wine with the wine completely full to the brim\" it's reads about 7:26 so close enough Edit - I agree with you guys that style wise it isn't very good, however the clock face and full wine glass is a good test that it basically passes, plus the text rendering is good, try it out yourself!",
        "comments": [
            {
                "raw_content": "It still has that look",
                "author": "Lankonk"
            },
            {
                "raw_content": "Did your prompt on nano banana 2 pro https://preview.redd.it/vdl3za8xq76g1.jpeg?width=1024&format=pjpg&auto=webp&s=0df3a7b0949555d546e1b2356e5957ff0edd0038 edit: This was a honest one shot. I have no affiliation with google... but i'm an engineer and if anyone from google would hire me, i'll shill on reddit every single day.",
                "author": "inavandownbytheriver"
            },
            {
                "raw_content": "its still piss colored",
                "author": "Gamerboi276"
            }
        ],
        "subreddit": "singularity"
    }
]