[
    {
        "post_name": "I will permanently pause migration from all Third World Countries to allow the U.S. system to fully recover, terminate all of the millions of Biden illegal admissions",
        "score": 858,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Voted for this",
                "author": "DingleBalls"
            },
            {
                "raw_content": "Holy shit, he called Tim Walz retarded. I voted for this!",
                "author": "henri_derelicte"
            },
            {
                "raw_content": "If it saves just 1 life...",
                "author": "USDMaga"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Stephen Miller: This is the great lie of mass migration.",
        "score": 689,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And before anyone suggests maybe helping them to fix their broken homelands so that they don't have to come here, we already tried that: It was called the Bush/Obama years. It obviously didn't work. The correct solution (or at least the only one anyone would have the stomach for) is forced repatriation and then full isolation similar to how we treat the North Korean regime. Nothing and nobody goes in, and nothing and nobody comes out",
                "author": "magapatriot_pa"
            },
            {
                "raw_content": "Get them the fuck out, then",
                "author": "redditadminssuckit"
            },
            {
                "raw_content": "It's not just people, one or many. They are setting up mosques that preach the violence and hatred of other religions and inspire individuals to kill for Islam.",
                "author": "OnlyTrump20"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "1984",
        "score": 421,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Funny how they’re already sorted by usefulness.",
                "author": "GoDawgs"
            },
            {
                "raw_content": "the scary one is History. like WTF",
                "author": "DrunkenWalMart"
            },
            {
                "raw_content": "Well they don’t really work and are guaranteed life employment and pay and some (most) have someone else doing their work…..commies",
                "author": "Nomad899"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Iryna Zarutska's boyfriend rages at judge who let Chicago train maniac free despite being arrested 72 times",
        "score": 421,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Charge the judge with murder",
                "author": "Thatunknownguy"
            },
            {
                "raw_content": "How many more women are killed or raped or torched by blacks and illegals before women start realizing that White men aren’t the problem? 🤔",
                "author": "Filo76"
            },
            {
                "raw_content": "I'm so tired of keeping track of all the innocent people who have been killed by stupid or evil people. I wonder what it will actually take to get the silent majority to rise up & clean house. Historically speaking that's the only way shit gets done.",
                "author": "Hangemh1gh"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Illegal orders you say?",
        "score": 1240,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# THEY KILLED MY GIRLFRIEND WITH THE VAX. # I AM OUT FOR SOME FUCKING BLOOD. # Eye for an eye, BITCHES.",
                "author": "USMC1234O10"
            },
            {
                "raw_content": "It is long past time for MILITARY TRIBUNALS. Call Joseph ROBINETTE Biden back into ACTIVE SERVICE, and court martial him.",
                "author": "Ballots0nRubysUSB"
            },
            {
                "raw_content": "It isn't a VACCINE!",
                "author": "Konsaki"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: President Trump confirms he might totally ELIMINATE the federal income tax",
        "score": 1016,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"Will\" \"Could\" \"Would\" \"Might\"...bla bla bla. Shit or get the fuck off the pot.",
                "author": "orange_kek_great"
            },
            {
                "raw_content": "Lmao nobody with a brain believes this shit would happen. Although it would make him the best president in the last century plus",
                "author": "Snooptwo"
            },
            {
                "raw_content": "This is bullshit and we should demand Trump not gaslight us like this, on this, or the other economic factors destroying American's lives.",
                "author": "MemphisMontoya71"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I Miss Charlie Kirk",
        "score": 821,
        "text_content": "",
        "comments": [
            {
                "raw_content": "yes",
                "author": "Female"
            },
            {
                "raw_content": "You are me both, but none more than his wife and children.",
                "author": "Rey_"
            },
            {
                "raw_content": "Me too fren. Things haven't felt right since then.",
                "author": "lixa"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "No mercy.",
        "score": 670,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The time for mercy should have been over the moment Trump took that bullet in Butler. But it wasn't, and we continued showing them mercy. Then Charlie Kirk got shot and killed, and we continued showing them mercy. Now, 2 National Guardsmen are dead. And of course we will continue to show them the same mercy. Does something on the scale of 9/11 have to happen before we put an end to this? And would we even do it then, or would we still continue to show mercy even as thousands, if not tens of thousands of innocent Americans are dead?",
                "author": "magapatriot_pa"
            },
            {
                "raw_content": "Trump would have to declare martial law but first, he would have to find a way to justify it in the eyes of enough people.",
                "author": "ContendersEdge"
            },
            {
                "raw_content": "Two national guardsmen were just murdered by an afghany illegal alien. This is war. Enlist the military to deport at least 50 million illegals. Lock down sanctuary cities & states. Force election reform and save America!",
                "author": "WhiteBoySummer"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "YOU ARE NOT MAD ENOUGH!",
        "score": 1020,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Send them home, or send them to Hell...",
                "author": "Russianbots"
            },
            {
                "raw_content": "I'm mad that women are in the military.",
                "author": "Ronaldus"
            },
            {
                "raw_content": "Fuck off Gunther. Stop using the ladies photos for clicks.",
                "author": "PatriotSkorzeny"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "West Virginia National Guard member Sarah Beckstrom just passed away, at 20 years old, due to gunshot injuries from the Afghan shooter - President Trump",
        "score": 1351,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Death Penalty. Get it done by Christmas. Put some bacon grease in the syringe too.",
                "author": "StoneRealist"
            },
            {
                "raw_content": "Death penalty and mass deportations",
                "author": "Formerlurker92"
            },
            {
                "raw_content": "God bless her. Volunteered so others could spend Thanksgiving with family. I cry for her parents and loved ones. But the hatred i feel for the killer has no bounds",
                "author": "RichieSprouse"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "💥 HOLY SHlT: Trump just threatened 𝙇𝘼𝙉𝘿 𝙎𝙏𝙍𝙄𝙆𝙀𝙎 inside Venezuela! “𝘚𝘵𝘰𝘱𝘱𝘪𝘯𝘨 𝘵𝘩𝘦 𝘱𝘰𝘪𝘴𝘰𝘯 𝘣𝘺 𝘭𝘢𝘯𝘥 𝘪𝘴 𝘨𝘰𝘯𝘯𝘢 𝘴𝘵𝘢𝘳𝘵 𝘝𝘌𝘙𝘠 𝘚𝘖𝘖𝘕. 𝘛𝘩𝘦 𝘭𝘢𝘯𝘥 𝘪𝘴 𝘌𝘈𝘚𝘐𝘌𝘙.”",
        "score": 798,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Well at least this one in our hemisphere. I guess that’s progress.",
                "author": "grandfather_nurgle"
            },
            {
                "raw_content": "War again…",
                "author": "Fourmoretrumps"
            },
            {
                "raw_content": "95% is coming from Mexico, why are we not bombing them?",
                "author": "WheresMyStimmy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "What could go wrong?",
        "score": 710,
        "text_content": "",
        "comments": [
            {
                "raw_content": "End ALL Federal dollars **&ast;ALL&ast;**",
                "author": "perma-maga"
            },
            {
                "raw_content": "Cut all federal funding immediately.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "We call it CROOK County for a reason!",
                "author": "Wrez77"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I don't care",
        "score": 535,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don't care if it's \"not all of them\", I don't care if some of them are \"good people\", I don't care about the taxes they allegedly pay or the vibrant diversity they allegedly provide, and I absolutely do not give a shit about their food and how it's so much better than ours. I don't care about any of it, I don't want these people here. And over 77 million Americans agree with me, which is why Trump won re-election in a landslide",
                "author": "magapatriot_pa"
            },
            {
                "raw_content": "Based",
                "author": "PatriotSam"
            },
            {
                "raw_content": "bye bye",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Witness video shows the moment Afghan national attacked National Guard members in DC",
        "score": 992,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm confused. DC's gun laws should have prevented this!",
                "author": "taytaytay"
            },
            {
                "raw_content": "That guy was just randomly filming in that specific direction?",
                "author": "vodka_soda"
            },
            {
                "raw_content": "ISLAM OUT OF U.S.",
                "author": "TwoArizonaPedes"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Meet Anthony McCauley. He just announced he’s running for school board in Moore County, NC. He has a rap sheet a mile long dating back to 1998 and as recent as 2023. He wants to be in charge of your kids’ education.",
        "score": 831,
        "text_content": "",
        "comments": [
            {
                "raw_content": "**Attention, TARHEELS,** # Bring back the HANGING TREE.",
                "author": "Ballots0nRubysUSB"
            },
            {
                "raw_content": "Liberal White Women: Ooooh! That makes him EXTRA DIVERSE! Lets get him that job ASAP!",
                "author": "boredrandomguy"
            },
            {
                "raw_content": "We need to find out WHO is encouraging these degenerates to join such important positions. I can make a bet they are agencies that involve S0r0s and other evil elites to take down our great country. Dear God, please help us find the way to stop this shit!",
                "author": "Lady_MaGa"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "“Shut the F*ck Up” – White House Comms Director Steven Cheung SHREDS Lefty Reporter For Blaming Terror Attack Against National Guard Members on Trump",
        "score": 1170,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The Mockingbird CIA media taking its orders from the black hat CIA are complicit. This mindless talking point roll out to blame Trump and ignore the POTUs who let the shooter in is not just witless low IQ blather. It's coordinated co-conspiracy and actionable.",
                "author": "CleanUpPhillyTrump24"
            },
            {
                "raw_content": "# STEVE CHUNGUS",
                "author": "BladesOfSteel2020"
            },
            {
                "raw_content": "This shooting should fucking be politicized , because certain policies caused this",
                "author": "MAGABOND"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "VANCE: Just because we were founded by immigrants doesn't mean that 240 years later, we have to have the DUMBEST immigration policy in the world!",
        "score": 1632,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Damn it! We were NOT founded by “immigrants “. We were founded by SETTLERS. I’m sick of this stupid statement by people who should know better.",
                "author": "10MeV"
            },
            {
                "raw_content": "We weren't founded by immigrants, we were founded by SETTLERS",
                "author": "Sunnybats2"
            },
            {
                "raw_content": "Our ancestors built this country. Now, third world leeches want to come here to reap the benefits, while contributing nothing, and killing the natural born citizens. Implementing their religions laws to conquer.",
                "author": "BigMikesSwingingCock"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "FUCK YOU, you MOTHERFUCKING FUCKING FUCKS!!",
        "score": 1219,
        "text_content": "",
        "comments": [
            {
                "raw_content": "As long as they continue to live comfortably this will continue.",
                "author": "starjello"
            },
            {
                "raw_content": "IM SO FUCKING LIVID!!!!!!!",
                "author": "NadlersNads"
            },
            {
                "raw_content": "Top five meme.",
                "author": "2Fangz"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Thanks to those down range",
        "score": 1205,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Never forget Thanksgiving 1950. Chosin Reservoir, North Korea. 75 years ago today.",
                "author": "YT45"
            },
            {
                "raw_content": "Man I feel like I just teleported back to 2008-2009 social media. Used to see these posts on MySpace and later on Facebook.",
                "author": "WildernessBro"
            },
            {
                "raw_content": "The US military has done nothing to serve me in my adult life. I've expended a massive amount of tax money so they could play with guns in the desert. Not even sure if I can thank them for the price of a gallon of gas. Sorry if that sounds cynical.",
                "author": "Dallasguy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "DESTROYING BRITAIN: Failing PM Starmer’s New ‘Budget From Hell’ Imposes Highest Tax Burden in History of the Kingdom To Fund Labour Welfare",
        "score": 1008,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is EXACTLY what World War II was fought to keep the Britons safe from. # C O M M U N I S M The United Kingdom is LOST.",
                "author": "Ballots0nRubysUSB"
            },
            {
                "raw_content": "“We are only going to tax the rich. On another note, congratulations on now being rich.”",
                "author": "Induceddrag"
            },
            {
                "raw_content": "Why aren't they chopping this guy's head off?",
                "author": "indefatigable"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Cherry gives up German production and wants to sell core division",
        "score": 447,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sad but foreseeable if you look at how the Chinese flooding the mechanical keyboard market. To a point nowadays I rarely see anyone reccomend Cherry switches for new builds/project",
                "author": "bazhvn"
            },
            {
                "raw_content": "Sad, after their patent expired it was very hard for them compete. That being said, they didn't really try hard, barely changed the switch designs, meanwhile China has produced some (a fuck ton of) remarkable designs that are just plain better than the vanilla cherry type.",
                "author": "atape_1"
            },
            {
                "raw_content": "Pour one out for the original Cherry MX Blue, Brown, Black, and Red switches, which got millions into the mechanical keyboard craze. Unfortunately, all four of those switches have been far surpassed in terms of smoothness and feel. Cherry just rested on its laurels. Comparing my custom SP-Star Magic Girl keyboard against an old Cherry MX Brown keyboard, there is absolutely no question.",
                "author": "Gippy_"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nvidia reportedly no longer supplying VRAM to its GPU board partners in response to memory crunch — rumor claims vendors will only get the die, forced to source memory on their own",
        "score": 21,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We might start seeing cheaper cards with ddr3's xD",
                "author": "hassancent"
            },
            {
                "raw_content": "Just imagining EVGA sitting back knowing they don't have to deal with all this shit. (Still feel like shit just want them back).",
                "author": "Neelman"
            },
            {
                "raw_content": "Good guy nvidia finally relaxing aib restrictions ＼(^^)／",
                "author": "Sevastous-of-Caria"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Asianometry: Can superconductors put an AI Data Center into a shoebox?",
        "score": 23,
        "text_content": "[https://youtu.be/mfk0vTe46ds?si=2jsJsfWTIXFvzIpQ](https://youtu.be/mfk0vTe46ds?si=2jsJsfWTIXFvzIpQ)",
        "comments": [
            {
                "raw_content": "500 kW is equivalent to 1800000000 joules of energy. How they plan to use that much power without significant waste heat in 3 years is a neat concept but a bit \"rest of the owl\" if you ask me *edit: equivalent over 1 hour",
                "author": "Wasabiroot"
            },
            {
                "raw_content": "TLDR; A new company Snowcap computing is investigating using standard CMOS manufacturing techniques to create josephson junction based computers that operate at 4K. The idea is that you can get 20 exaflops of compute at 500kW Snowcap plans to release it's first chip at the end of 2026",
                "author": "srivatsasrinivasmath"
            },
            {
                "raw_content": "I wonder what became of the family of superconducting graphene structures discovered by MIT a few years ago, capable of working at room temperature? I don't think I've heard much since then. ... But graphene *mythology* aside, I don't think we will be able to increase the transistor density of silicon indefinitely. So, the most logical way forward does seem to be going narrower (or faster), not wider. Pentium 4 was supposed to hit at least 7 GHz on a single core (according to AnandTech), after all, and Intel designed the entire NetBurst uArch (with its deep pipeline) around this assumption. It's only after that failure did the industry moved on to multi-core solutions. It might be just nostalgia talking, but I would love to witness another gigahertz race in my lifetime!",
                "author": "GenZia"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AI Memory Showdown: SK hynix Unveils 48 Gb/s GDDR7 and LPDDR6; Samsung Showcases HBM4",
        "score": 29,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That'll be $800 please",
                "author": "Ket_Yoda_69"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Taiwan raids former TSMC exec's home in trade secrets probe",
        "score": 3,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Looking for the Deepcool Assassin VC Elite!",
        "score": 2,
        "text_content": "I've been looking for a new CPU cooler, I saw a video for the black with gold trim Assassub VC Elite and instantly knew it was the cooler I wanted for my new build. But, after 5 minutes of Googling I discovered Deep Cool has been banned from selling in the US - of course lol. Not one to give up I decided to look for somewhere overseas that would ship to the US. I looked on Aliexpress/Alibaba and only saw the white one. I found the white version 2 other places, but the only place I saw the black/gold that ships to the US says it's out of stock. I'm wondering if anyone has seen this on an overseas site that ships to the US. I'm thinking there should be a couple that maybe just aren't showing up on my Google search. I understand shipping would probably be close to much as the cooler, but this is the perfect cooler for the Pro Art motherboard I want to get. So I'm willing to do something pretty stupid like pay $80 shipping to get it.",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung Wants HBM4 Prices to Match SK Hynix in Nvidia Deal",
        "score": 33,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And I want my salary to match the president.",
                "author": "TK3600"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Kirin 9030: SMIC's first 5 nm class smartphone SoC debuts on Geekbench alongside Huawei Mate 80 Pro Max",
        "score": 79,
        "text_content": "SMIC had achieved a significant breakthrough in its semiconductor manufacturing prowess. It has successfully fabricated its first-ever 5 nm-grade smartphone SoC via its N+3 process node, which was in development since last year. With a transistor density of roughly 125 Mtr/mm2, it can be compared with Samsung's 5LPE node. The chip in question is the Kirin 9030, and it will power the upcoming Huawei Mate 80 series of smartphones. It was spotted on Geekbench alongside the Huawei Mate 80 Pro Max (HUAWEI SGT-AL10) with 16 GB of RAM. It has one (likely Taishan) prime CPU core clocked at 2.75 GHz, four cores at 2.27 GHz and four more cores at 1.72 GHz. On top of that, it features a Maleoon 935 GPU, the specs of which are unknown. The Kirin 9030 scores 1,131 and 4,277 in Geekbench's single and multi-core tests. Weibo leaker Digital Chat Station says this score doesn't reflect its full performance because the chip isn't running at peak speed. Even at full potency, the Kirin 9030 is unlikely to perform anywhere close to the Snapdragon 8 Elite Gen 5 and MediaTek Dimensity, but that is to be expected, given its massive node disadvantage.",
        "comments": [
            {
                "raw_content": "Did they get the EUV machines?",
                "author": "jorgesgk"
            },
            {
                "raw_content": "I'll believe it when it's put under the microscope. But if it's true, that's some solid progress. They have now access to a node from 7 years ago instead of 10, which given they aren't using EUV (AFAIK) it's a pretty decent jump",
                "author": "marcost2"
            },
            {
                "raw_content": "They can have Taiwan if they release GPUs 90% as good as Nvidia's for half the price.",
                "author": "Adorable_Magician"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Gamechat is a resource hog and Nintendo shouldn't have implemented it.",
        "score": 611,
        "text_content": "How many people actually use it? The OS has 3gb of RAM reserved, a significant portion of that is gamechat. Ubisoft recently said that AC Shadows doesn't use RTGI primarily because of RAM limitations. How many other games would perform better with another GB or more of RAM freed up?",
        "comments": [
            {
                "raw_content": "To be fair I feel a better solution would be an option for games to disable it for the extra ram, kind of like how some games disable recording clips. That way games that really need it have the extra ram and games that don't can still have gamechat.",
                "author": "_tommar_"
            },
            {
                "raw_content": "I wouldn't be surprised if Nintendo looks at the number of users once the dust has settled and give devs the option to disable all but basic voice chat in the future.",
                "author": "Lisata598"
            },
            {
                "raw_content": "I play online with my grandson all the time - DK, Minecraft, The Show - and voice chat is wonderful for us.",
                "author": "SeattleSenior9026"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "assasins creed shadows switch 2 Gameplay by ubisoft",
        "score": 695,
        "text_content": "seems pretty good to me",
        "comments": [
            {
                "raw_content": "Looks great. I’m so pleased with having games like these on Switch 2. But you have to be honest: slow walking and not moving the camera much is a common trick to let it look stable. Let’s see some hectic, fast fighting scenes with a lot of NPCs on screen. That’s the real test when it comes to stable framerate.",
                "author": "pommdoenerspezial"
            },
            {
                "raw_content": "Looks good",
                "author": "Re7oadz"
            },
            {
                "raw_content": "Looks really good",
                "author": "lingering-will-6"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Theory: Nintendo will rename some of their studios to \"Nintendo Studios: something\"",
        "score": 372,
        "text_content": "Today they announced the acquisition of Bandai Namco Studios Singapore, then renamed to \"Nintendo Studios Singapore\" What i find interesting are both the name and the logo. The way is laid out, with \"Nintendo Studios\" and Singapore separated by a line, makes me think this is a new standard layout for naming their studios. Wich would make sense, since a lot of studios in Nintendo dont have real names (outside of being called like \"Nintendo Research and Development\", stuff like that) Would you like to see a more conventional naming scheme for the first party studios?",
        "comments": [
            {
                "raw_content": "I could see Next Level Games becoming \"Nintendo Studios - Vancouver\" and Retro becoming \"Nintendo Studios - Texas\".",
                "author": "Alernet"
            },
            {
                "raw_content": "I don't think so, the only reason they renamed this one is because they wouldn't want to own a studio named after another company",
                "author": "Caciulacdlac"
            },
            {
                "raw_content": "They weren't allowed to use \"Bandai Namco Studios Singapore\" due to containing \"Bandai Namco\" causing them to replace it with \"Nintendo\", and not change the name otherwise. The logo layout is a generic layout in the same style as Nintendo Switch Online, with the red box containing the logo on the left as seen on the back of the box, and the words in the box laid out in the same way as the Nintendo Classics Apps.",
                "author": "alexanderpas"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Assassin's Creed Shadows Will Include All Updates, Touch Screen Support, and Cross-Progression",
        "score": 354,
        "text_content": "I like that Ubisoft is seemingly consistent with cross progression! I hope the rest of the games they port will have it cause it's nice",
        "comments": [
            {
                "raw_content": "Ubisoft with the crazy ambitious ports on switch 2. They’ve been one of the best 3rd party publishers on switch 2 surprisingly.",
                "author": "lingering-will-6"
            },
            {
                "raw_content": "Wish more games had cross progression.",
                "author": "Rawkhawkjayhawk"
            },
            {
                "raw_content": "Bro Ubisoft has been goated for switch 2",
                "author": "LanderRetro"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Kirby Air Riders Sells 195,594 Copies First Week In Japan",
        "score": 415,
        "text_content": "Full Sales Charts for November 17th 2025 - November 23rd 2025 (software charts are physical copies only): Software Charts (followed by lifetime sales) 1. \\[NS2\\] Kirby Air Riders – 195,594 / 195,594 2. \\[NS2\\] Mario Kart World – 67,068 / 2,202,125 3. \\[NSW\\] Pokemon Legends: Z-A – 28,480 1,271,576 4. \\[NSW\\] Momotaro Dentetsu 2 – 28,074 / 118,780 5. \\[NS2\\] Pokemon Legends: Z-A – Nintendo Switch 2 Edition – 22,060 / 798,015 6. \\[NS2\\] Momotaro Dentetsu 2 – Nintendo Switch 2 Edition – 20,751 / 77,558 7. \\[NS2\\] Hyrule Warriors: Age of Imprisonment – 9,129 / 100,121 8. \\[NSW\\] Dragon Quest 1 & 2 HD-2D Remake – 8,302 / 286,589 9. \\[NSW\\] Minecraft – 4,909 / 4,050,014 10. \\[NSW\\] Animal Crossing: New Horizons – 4,908 / 8,258,611 Hardware Sales (followed by lifetime sales) 1. Switch 2 – 126,953 / 2,870,758 2. PlayStation 5 Digital Edition – 23,381 / 1,048,176 3. Switch OLED Model – 12,486 / 9,314,908 4. PlayStation 5 Pro – 11,367 / 281,760 5. Switch Lite – 10,908 / 6,737,073 6. Switch – 5,976 / 20,175,216 7. PlayStation 5 – 2,235 / 5,851,381 8. Xbox Series X Digital Edition – 201 / 24,080 9. Xbox Series X – 118 / 323,683 10. Xbox Series S – 30 / 340,097 11. PlayStation 4 – 17 / 7,930,078 * [](https://www.gematsu.com/platforms/playstation)",
        "comments": [
            {
                "raw_content": "Who are the 17 people who bought a new PS4?",
                "author": "Misttertee_27"
            },
            {
                "raw_content": "118 Series X and 30 Series S? lol",
                "author": "Rawkhawkjayhawk"
            },
            {
                "raw_content": ">Switch 2 – 126,953 (2,870,758) > >PlayStation 5 Digital Edition – 23,381 >(1,048,176) > >Switch OLED Model – 12,486 (9,314,908) > >PlayStation 5 Pro – 11,367 (281,760) > >Switch Lite – 10,908 (6,737,073) > >Switch – 5,976 (20,175,216) > >PlayStation 5 – 2,235 (5,851,381) Nintendomination holy hell lol",
                "author": "AberdeenBumbledoor"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Assassin’s Creed Shadows – Deep Dive Into the Nintendo Switch™ 2 System Port",
        "score": 233,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Now we need BG3",
                "author": "Professional_Wiz"
            },
            {
                "raw_content": "Sounds like it’s gonna be a good port.",
                "author": "peter-man-hello"
            },
            {
                "raw_content": "They are really putting a LOT of effort into this port, it's awesome to see! Between this and Star Wars Outlaws Ubisoft might just be the best third party in terms of support! I can't wait to play this!",
                "author": "DocWhovian1"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "(Digital Foundry) Kirby Air Riders Switch 2 Review - New Engine Tech... And A Great Game!",
        "score": 96,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Seems like they should have targeted 30fps for 4 player split screen. Other than that performance looks good though.",
                "author": "Rawkhawkjayhawk"
            },
            {
                "raw_content": "Glad they confirmed the HDR issues. I own a top tier and properly calibrated tv with the right settings, HGiG and all and out of all HDR compatible games I've played with these settings on all consoles I own, Kirby Air Riders is currently the only one looking so dull and greyish. I did not expect that big of a fumble from a Sakurai game, they're usually so polished to the core.",
                "author": "Medd-"
            },
            {
                "raw_content": "I took a huge gamble buying this game with that 70 dollar price tag but it was well worth it. The game is made with passion",
                "author": "Comfortable-Air-7702"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nvidia to stop supplying memory to GPU partners, putting further pressure on gaming GPU affordability",
        "score": 595,
        "text_content": "Nvidia currently supplies both the GPU chip and memory as bundle to GPU manufacturers. GDDR7 costs are increasing, Nvidia doesn't want to deal with it and shifted the responsibility of sourcing memory to its GPU partners. This will hit smaller GPU manufacturers the hardest because they do not have the leverage to source memory chips especially in the current market where memory chips are experiencing severe shortage due to AI. According to a Chinese hardware leaker GoldenPigUpgrade: https://weibo.com/3219724922/Qf3WY4s2I English reporting source: https://videocardz.com/newz/nvidia-rumored-to-stop-bundling-memory-with-gpus-squeezing-smaller-board-partners",
        "comments": [
            {
                "raw_content": "Looking forward to my next $5000 PC build that comes loaded with AI bullshit in the OS",
                "author": "hyrule5"
            },
            {
                "raw_content": "Man. I can’t wait for this bubble to pop.",
                "author": "Ornery-Tonight1694"
            },
            {
                "raw_content": "When TSLA’s stock went up after Elon claimed he could beat Nvidia at chips, that’s how you know we’re in a bubble.",
                "author": "Watt_Knot"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Mp1st: New Trademark for “Control: Resonant” Unearthed",
        "score": 536,
        "text_content": "[source](https://mp1st.com/news/new-trademark-control-resonant-unearthed-ahead-tga) Possibly one of the announcements for TGA.",
        "comments": [
            {
                "raw_content": "NIIIICEEEEE. Max Payne Remake next year and Control 2 in 2027, pleaseeeeee",
                "author": "cian_pike01"
            },
            {
                "raw_content": "Remedy didn't subtitle Alan wake 2. Have they ever subtitled anything before? I think control 2 would be more in keeping, but ofc. 'Resonant', does have story connotations to the control universe",
                "author": "NewCareerinBusiness"
            },
            {
                "raw_content": "Ouuuuuuu. Been playing Alan Wake 2 through PS Plus. Can’t wait for Control 2!",
                "author": "Ornery-Tonight1694"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "NateTheHate reiterated release window for Forza Horizon 6: First half 2026 has been the target and remains as such.",
        "score": 90,
        "text_content": "[https://xcancel.com/NateTheHate2/status/1994108555780297089#m](https://xcancel.com/NateTheHate2/status/1994108555780297089#m)",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "End of June 🤓",
                "author": "Adept-Passenger605"
            },
            {
                "raw_content": "May 26th",
                "author": "Human_Rush_1000"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Former inXile writer listed Clockwork Revolution as a 2026 title",
        "score": 276,
        "text_content": "Spotted this on Nathan Long's (an ex-inXile writer) [profile](https://www.linkedin.com/in/nathanlong/): he listed Clockwork Revolution under his 2026 project: >Clockwork Revolution - 2026 \\- Senior Writer \\- Narrative Designer \\- Lyricist",
        "comments": [
            {
                "raw_content": "Doesn't seem hard to believe, they showed off like 7 minutes of that game at the Xbox show and some of it even seemed real.",
                "author": "solarshift"
            },
            {
                "raw_content": "Xbox’s 2026: - Gears: E-Day - Fable - Clockwork Revolution - Forza Horizon 6 - Halo CE Remake",
                "author": "ZEKE307"
            },
            {
                "raw_content": "Expect this will be the best RPG Microsoft have released. Chad Moore AND Jason D. Anderson as leads.",
                "author": "ThinWhiteDuke00"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "YouTuber claims to have gotten an early Metroid Prime 4 copy delivered (Retailers are known to have it already), and releases a review based on his time with it. (No new footage shown)",
        "score": 329,
        "text_content": "Take it with a grain of salt, but this channel has posted before, so it's not a burner account. [https://www.youtube.com/watch?v=3X4FTcu0ydg](https://www.youtube.com/watch?v=3X4FTcu0ydg) Proof of retailers having the game: [https://xcancel.com/BehindTGames/status/1993605621589942541](https://xcancel.com/BehindTGames/status/1993605621589942541) EDIT/TLDR: He gives the game a 4/5, and in a comment, ranks the series from best to worst as 2-1-3&4 EDIT 2: In response to a question asking him to reveal some abilities, to prove that he actually did play the game, he answered with:>!\"Psychic bombs, grappling hook. Psychic beam and hyper beam I'm not sure what anyone else has said if I'm honest I don't usually watch previews and reviews before a game comes out\".!< **EDIT 3 - VIDEO PRIVATED BY THE UPLOADER**. In the comment section of [their most recent live video](https://www.youtube.com/watch?v=KqXN0QM441Q&lc=Ugx6UJKFcsqDaucnEf54AaABAg.AQ26CA1dqMOAQ28TepRzhq), they give the reasoning of \"Someone sent me a message saying that I might get in trouble for posting it early\".",
        "comments": [
            {
                "raw_content": "He gives it 4/5, says excellent gameplay and atmosphere, didn't like companion moments and had some pacing issues",
                "author": "FinchyJunior"
            },
            {
                "raw_content": "If this person had their own copy, why didn't they put a photo of it? Or a video of them booting it up on their system? Doesn't pass the sniff test.",
                "author": "KingBroly"
            },
            {
                "raw_content": "Super vague review basically saying what was said in the previews.",
                "author": "lingering-will-6"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "New Job Listing Suggests PlayStation Is Working On Unannounced PvP-Focused MOBA",
        "score": 169,
        "text_content": "A new Game Tester listing reveals an upcoming MOBA title launching on console, PC, and mobile — with experience requires passion for PvP games like Smash Brothers and Pokémon Unite. [source link](https://tech4gamers.com/playstation-seeking-testers-pvp-focused-moba/)",
        "comments": [
            {
                "raw_content": "Isn’t this the Gummie beats thing?",
                "author": "Ornery-Tonight1694"
            },
            {
                "raw_content": "This is Project Gummy Bear by Bungie, not a new project.",
                "author": "MrYK_"
            },
            {
                "raw_content": "I'm pretty sure that's the Bungie game they turned into their own studio, but not gonna lie, we really need MOBAs on consoles One of the biggest \"what ifs\" for me is if Blizzard actually bothered moving HotS to console during their main console push",
                "author": "LadyValtiel"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Xeon 696X 64-core \"Granite Rapids-WS\" CPU surfaces in SiSoftware Sandra with 350W TDP and 336MB L3 cache",
        "score": 32,
        "text_content": "",
        "comments": [],
        "subreddit": "intel"
    },
    {
        "post_name": "ERYING to launch Arrow Lake mobile-based desktop motherboards, featuring up to Core Ultra 9 285H",
        "score": 19,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They are always having mobos like this. Why is this news.",
                "author": "thelastsupper316"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "OneXplayer Apex AMD \"Strix Halo\" handhelds gets $200 price hike before launch due to rising memory costs",
        "score": 132,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I looked away from the Strix handhelds for a moment, and now I'm seeing one with 128 GB of memory? That's nuts.",
                "author": "pullupsNpushups"
            },
            {
                "raw_content": "Kinda funny how RAM prices keep rising in price even though the stock has not run out yet, since the orders that disrupt delivery is happening next year mostly.",
                "author": "Felielf"
            },
            {
                "raw_content": "Oof, brutal. Makes me think refurb steam deck in Canada is 250 USD. With 16 gig of ram, thing's basically half ram",
                "author": "Middle-Effort7495"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Flood-Prone America Is Seeing More People Move Out Than In for the First Time Since 2019",
        "score": 119,
        "text_content": "In general, Americans are now leaving flood prone neighborhoods with implications due to flooding, insurance, and even immigration",
        "comments": [
            {
                "raw_content": "The NFIP previously based their rates on their history of payouts across the country since the program's inception in the late 60s. That meant policy holders in Louisiana, New Jersey and North Carolina were all paying premiums that were based on claim information(or lack thereof) for places with lower annual average losses since the program's inception like in Utah, Nevada, Oregon etc. When the NFIP adopted Risk Rating 2.0 they changed their premium calculation method to actually take into account the losses that will likely occur in the future based on catastrophe models that take into account local, regional and global climate systems, hydrology, hydraulics, elevations etc. one of two things happened: 1. If it was a new policy, they immediately began to pay the actuarially sound premium for their risk. 2. If it was a policy originally incepted before Risk Rating 2.0 the policy holder got put on a path of ever increasing annual premiums, capped at 18% per year, until their premiums reached the actuarially sound premium The private insurers who offer flood insurance also use the same models, so its incredibly hard to find a better deal if you have a grandfathered policy and it's as expensive if not more so than a brand new NFIP policy. Between the cost of flood insurance and the cost of standard policies going up, because surprise surprise flood is correlated with other meteorological perils, owning a home in a high climatic risk area is becoming rapidly unaffordable because of the cost of insuring against losses arising from these hazard.",
                "author": "XalentineDay"
            },
            {
                "raw_content": "It is difficult to convey the intensity of a heavy downpour in Houston, New Orleans or other gulf coast cities to someone from the west coast. Even with the car's wipers set on fast drivers still have to pull off the road because they can't see out the windshield. Developers should be prevented from building in these low lying areas.",
                "author": "mrktcrash"
            },
            {
                "raw_content": "Does this mean the national gross domestic IQ is on the rise?",
                "author": "garden88girl"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Starting to feel discouraged about timing.",
        "score": 12,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I know a trick. Lower the price.",
                "author": "Bigdaddyblackdick"
            },
            {
                "raw_content": "Who is going to buy an older house for $450k when they can get a new tract home for $100k less?",
                "author": "SlavaCocaini"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "FHFA Announces Conforming Loan Limit (CLL)Values for 2026",
        "score": 10,
        "text_content": "In most of the United States, the 2026 CLL value for one-unit properties will be $832,750, an increase of $26,250 from 2025. According to the nominal, seasonally adjusted, expanded-data FHFA HPI, house prices increased 3.26 percent, on average, between the third quarters of 2024 and 2025. Therefore, the baseline CLL in 2026 will increase by the same percentage.",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Throwback to Yann LeCun’s 1989 convolutional neural network demo, the foundation for the CNNs we still use today.",
        "score": 1635,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Imagine the happiness they must have felt when they finally saw the desired result. When the idea in your mind actually becomes a reality, just want to have this level of attention span and perseverance.",
                "author": "Ambitious-Ring-5162"
            },
            {
                "raw_content": "many think AI was just recent development , they (G. Hinton, Y. Bengue) have been working on this for decades , AI just became commercialized in last couple of years. Also those who bashes Lecun , should take notes in this 36 years old video and listen him more carefully ...",
                "author": "FigureMost1687"
            },
            {
                "raw_content": "89’ my god. I feel illiterate and need to go back to school",
                "author": "BrainFeed56"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Will Smith eating spaghetti | Nano Banana Pro + Grok AI",
        "score": 124,
        "text_content": "I can't believe we're already here",
        "comments": [
            {
                "raw_content": "All 3 guys in the background drinking at the same time",
                "author": "Impossible_Depth_268"
            },
            {
                "raw_content": "They said coherence could NEVER be solved. Mere two years later....",
                "author": "RDSF-SD"
            },
            {
                "raw_content": "Keep my spaghetti out of your god damn mouth.",
                "author": "Pop-metal"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "ARC-AGI 2 is Solved",
        "score": 533,
        "text_content": "[More Info](https://poetiq.ai/posts/arcagi_announcement/) From the website: \\- Poetiq’s approach of building intelligence **on top of any model** allowed us to integrate the newly released Gemini 3 and GPT-5.1 models within hours of their release to achieve the SOTA-results presented here. \\- All of Poetiq’s meta-system’s adaptation was done prior to the release of the Gemini 3 and GPT-5.1. Additionally, **it was never shown problems from ARC-AGI-2**. Further, for cost efficiency, the Poetiq system only relied on open-source models for adaptation. [ARC ](https://x.com/arcprize/status/1994100080081854674)is working on verifying these results Big if true.",
        "comments": [
            {
                "raw_content": "Well, they have been verifying this for 3 days or so. Something tells me the private set is not yielding the same fantastic results...",
                "author": "Correct_Mistake2640"
            },
            {
                "raw_content": "1. ⁠This graph is misleading because it only shows ARC-AGI-2 public eval, which is not considered meaningful in 2025. ARC-Public is small, heavily studied, and easy for models to overfit. Training on ARC-style synthetic data can inflate public scores without improving real reasoning. 2. ⁠Frontier labs only trust the private ARC generalization suite. OpenAI, Google, and Anthropic treat the hidden ARC tasks as the only version that correlates with true reasoning. When a company only reports ARC-Public, it usually means the private score is weaker, the model has not been externally audited, or they are prioritizing marketing over rigorous benchmarking. 3. ⁠If PoetIQ actually had 60 percent generalizable ARC ability, it would show strong improvements on other reasoning benchmarks. There is no evidence that it leads on GPQA, MATH/AIME/AMC, DeepThink, BIG-Bench-Hard, tool-based reasoning, or the private ARC tasks. Real reasoning progress appears across multiple unrelated benchmarks, not just the one a model is optimized for. 4. ⁠The chart is better interpreted as benchmark marketing than as AGI-level progress. It demonstrates that PoetIQ can cheaply overfit the public ARC tasks. It does not demonstrate general reasoning, competition with o1 or Gemini 3 DeepThink, or transfer to unseen ARC tasks. Using ARC-Public alone to imply major breakthroughs is like claiming a student is a genius because they scored perfectly on a practice test they memorized.",
                "author": "Pristine-Today-9177"
            },
            {
                "raw_content": "\"The official code is available on [Github](https://github.com/poetiq-ai/poetiq-arc-agi-solver).\" [https://github.com/poetiq-ai/poetiq-arc-agi-solver](https://github.com/poetiq-ai/poetiq-arc-agi-solver)",
                "author": "rutan668"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Elon Musk predicted that AGI would arrive in 2025. Now we are in 2025.",
        "score": 1497,
        "text_content": "",
        "comments": [
            {
                "raw_content": "AGI is the friends we make along the way",
                "author": "Impressive_Oaktree"
            },
            {
                "raw_content": "When did he promise fully autonomous cars again?",
                "author": "Pahanda"
            },
            {
                "raw_content": "we are all AGI on this blessed day",
                "author": "tondollari"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Walmart has started using AI food photos.",
        "score": 92,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/noj9358vyx3g1.jpeg?width=2752&format=pjpg&auto=webp&s=cee3ce754adfceb1eae70cb2c3bde4fef7412ae0 Properly generated AI version.",
                "author": "Luky-z-maleho-mesta"
            },
            {
                "raw_content": "And the worst part is that they're made with GPT-4o; you can see the dreaded yellow filter in all of them >:V",
                "author": "sammoga123"
            },
            {
                "raw_content": "Pro AI here, this is a shit image lmao, why would a human ever approve this? It’s not like good AI pictures of beets are hard to find",
                "author": "ethotopia"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "A Concorde breaking the sound barrier, Nano Banana Pro",
        "score": 40,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/ow8no9ow7y3g1.png?width=1024&format=png&auto=webp&s=a123283d39a6b5a238060dbf03fe4ff0a2c0adf6",
                "author": "phantagom"
            },
            {
                "raw_content": "Rad, I just can't wait for ASI to design infinitely efficient aircrafts",
                "author": "darwinevo"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The prompt being used to generate influencers (NanoBanana 🍌):",
        "score": 30,
        "text_content": "{ \"subject\": { \"description\": \"A young woman taking a mirror selfie, playfully biting the straw of an iced green drink\", \"mirror_rules\": \"ignore mirror physics for text on clothing, display text forward and legible to viewer, no extra characters\", \"age\": \"young adult\", \"expression\": \"playful, nose scrunched, biting straw\", \"hair\": { \"color\": \"brown\", \"style\": \"long straight hair falling over shoulders\" }, \"clothing\": { \"top\": { \"type\": \"ribbed knit cami top\", \"color\": \"white\", \"details\": \"cropped fit, thin straps, small dainty bow at neckline\" }, \"bottom\": { \"type\": \"denim jeans\", \"color\": \"light wash blue\", \"details\": \"relaxed fit, visible button fly\" } }, \"face\": { \"preserve_original\": true, \"makeup\": \"natural sunkissed look, glowing skin, nude glossy lips\" } }, \"accessories\": { \"headwear\": { \"type\": \"olive green baseball cap\", \"details\": \"white NY logo embroidery, silver over-ear headphones worn over the cap\" }, \"jewelry\": { \"earrings\": \"large gold hoop earrings\", \"necklace\": \"thin gold chain with cross pendant\", \"wrist\": \"gold bangles and bracelets mixed\", \"rings\": \"multiple gold rings\" }, \"device\": { \"type\": \"smartphone\", \"details\": \"white case with pink floral pattern\" }, \"prop\": { \"type\": \"iced beverage\", \"details\": \"plastic cup with iced matcha latte and green straw\" } }, \"photography\": { \"camera_style\": \"smartphone mirror selfie aesthetic\", \"angle\": \"eye-level mirror reflection\", \"shot_type\": \"waist-up composition, subject positioned on the right side of the frame\", “aspect_ratio”: “9:16 vertical”, \"texture\": \"sharp focus, natural indoor lighting, social media realism, clean details\" }, \"background\": { \"setting\": \"bright casual bedroom\", \"wall_color\": \"plain white\", \"elements\": [ \"bed with white textured duvet\", \"black woven shoulder bag lying on bed\", \"leopard print throw pillow\", \"distressed white vintage nightstand\", \"modern bedside lamp with white shade\" ], \"atmosphere\": \"casual lifestyle, cozy, spontaneous\", \"lighting\": \"soft natural daylight\" } }",
        "comments": [
            {
                "raw_content": "\"hey, let's create even more of the most useless and obnoxious people in existence that make their livelihoods by shilling shit tier products while glorifying narcissistic personality disorder\"",
                "author": "borntosneed123456"
            },
            {
                "raw_content": "automating influencers first would actually be a positive for the world",
                "author": "Big-Site2914"
            },
            {
                "raw_content": "So realistic, crazy",
                "author": "trumpdesantis"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Zerith Robotics is deploying their next H1 maid robot in various cities",
        "score": 244,
        "text_content": "https://x.com/CyberRobooo/status/1994023070823272599?s=20",
        "comments": [
            {
                "raw_content": "Did I see correctly! He used the same cleaning pad to clean under the seat area and used it again on the seat!",
                "author": "pourya_hg"
            },
            {
                "raw_content": "Holy shit, this is so unsanitary.",
                "author": "Hoppss"
            },
            {
                "raw_content": "That robot ain’t doing shit except wiping a sponge on a toilet. I’m a believer in AI and robotics, but this is half-assed demo only proves that robots have a long way to go before they can replace humans.",
                "author": "Current-Ticket4214"
            }
        ],
        "subreddit": "singularity"
    }
]