[
    {
        "post_name": "White House Unveils Sweeping MAHA Changes In Nation's Food Supply Chain",
        "score": 1263,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is one of the things I was most excited about. Big food poisoning us so big pharma can treat us in perpetuity.",
                "author": "Region"
            },
            {
                "raw_content": "I'm all in favor of getting rid of food dyes. I think this is a great step forward. However, we also need to get rid of high fructose corn syrup and most of the sugar. Foods with high amounts of sugar should get warning labels at the very least.",
                "author": "Smurfection"
            },
            {
                "raw_content": "Ask not what your country can do for you, ask why there is a bag of potato chips in your lap.",
                "author": "WishYouWereHere"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Democrats’ judicial coup strategy has failed—resoundingly.",
        "score": 1182,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It’s given them months of delays and stopped other actions while the government lawyers are tied up with appeals.",
                "author": "sygish"
            },
            {
                "raw_content": "Not to mention there is now a supreme court precedent that can be used for all of these types of cases in the future.",
                "author": "FudgyFudgeBots"
            },
            {
                "raw_content": "Nothing has failed until these insane communist judges have been removed. They will keep doing their insane shit unless forcibly prevented from doing so.",
                "author": "Sig229"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🪩 Late Night Crew Dance Party 🎉",
        "score": 627,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I got the tunes- https://www.youtube.com/watch?v=mPBzujm-cF8",
                "author": "ninabobby"
            },
            {
                "raw_content": "Bringing the tendies",
                "author": "FaustyArchaeus"
            },
            {
                "raw_content": "Non-Fren Bopper locked and loaded!",
                "author": "CatboxfullofBidens"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨#BREAKING: House Republicans have blocked an effort by Democrats to force the release of the Epstein files.",
        "score": 256,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wouldn’t want to upset Israel",
                "author": "TexasBeer"
            },
            {
                "raw_content": "GOP caught with their dicks in hand, and letting Dems get a talking point victory. Yikes, Trump admin needs to get their story strait and give clarification on what is going on. Self Inflicted shot in the foot.",
                "author": "SneakyPete"
            },
            {
                "raw_content": "The GOP is really good at kneecapping itself",
                "author": "LordCommissarYarrick"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump on SCOTUS ruling",
        "score": 1398,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is huge for me. The Department of Education is a failed experiment.",
                "author": "Belleoffreedom"
            },
            {
                "raw_content": "Great! NOW ARREST SOME DEEP STATE KID FUCKERS!!!",
                "author": "JoinTheDiscussion"
            },
            {
                "raw_content": "Epstein",
                "author": "Mungo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Jimmy Carter's Mess Getting Cleaned Up - Trump reaching all the way back to 1979 to Save America",
        "score": 721,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Meme is so old we're now like 28th.",
                "author": "CleanUpPhillyTrump24"
            },
            {
                "raw_content": "When Marxist pieces of shit ask me when America was ever great, I always say 1979. One man could work 40 hours a week and afford a giant house in a safe neighborhood and pay for 4 kids to eat, have clothes and toys, go to school, 2 cars, vacations and his wife could stay home and take care of business. That’s what fucking MAGA means. Not fucking 1930’s or Jim Crow or whatever the fuck. Do you know how cheap gas was in 1979? Fuck dude spez: BTW the wife rarely cheated on the man because she knew it was fucking wrong. NOW look at society. Women everywhere cheat and get their backs blown out. It’s fucking degeneracy",
                "author": "iteachfuckinscience"
            },
            {
                "raw_content": "There's ZERO fucking reason for everyone to have K-12 education. MOST people alive would be fine with a 7th or 8th grade education as long as they know the basics to live and be a productive member of society. Balance a checkbook, fix basic plumbing/electrical issues, fix a car, care for and respect firearms, hunt, fish, and build a basic home. Everything else is superfluous and only needs to be known by those that are smart enough to understand it. School is just government daycare in high school to make sure teens aren't out making something of themselves and starting families while they're in their prime.",
                "author": "cjcivicx"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Our voices are being heard, power to the people 🇺🇸👊🏼",
        "score": 1679,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Believe our un-named sources. We are social media influencers!",
                "author": "MemphisMontoya71"
            },
            {
                "raw_content": "White House brainstorming hard on how to get this to go away for a while.",
                "author": "Spacewilluniteus"
            },
            {
                "raw_content": "Yes, but I’m not sure why it should take all of this? At this point I am fairly black pilled about all of it.",
                "author": "GuerillaYourDreams"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Michigan: 19-Year-Old Arrested After Attempted Arson At U.P. County Republican Headquarters",
        "score": 1096,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TRANNY",
                "author": "TEXinLA"
            },
            {
                "raw_content": "19?!? Must've been some hard years.",
                "author": "Apersonofinterest"
            },
            {
                "raw_content": "Time to declare transgenderism a mental illness.",
                "author": "TrumpShadow"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "FINALLY THERE'S ONE / 🚨 Arizona Taco shop owner arrested by federal agents for employing and harboring illegal immigrants.",
        "score": 1685,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hit Tyson foods. Perdue, etc. Do at least 5 construction company ceos",
                "author": "Dilligaf"
            },
            {
                "raw_content": "MOAR! This is how it stops! Remove the food source and the roaches go away.",
                "author": "MemeWarsVet"
            },
            {
                "raw_content": "This taco joint owner has seen which way the wind is blowing for months now, yet he just kept on as business as usual. Newsflash! Democrats aren't in charge anymore, what the hell did you THINK was going to happen!",
                "author": "Svaap"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "US Attorney for NJ Alina Habba has SUBPOENAED Democrat NJ Governor Phil Murphy for conspiring to HARBOR ILLEGALS in his home: “Let’s have her live at our house above our garage, and good luck to the feds coming in to try to get her.”",
        "score": 1155,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If this guy gets arrested, i will smile. But i guess we will wait and see. im not getting my hopes up.",
                "author": "thisguy883"
            },
            {
                "raw_content": "Subpoena? Why not door kickers at 0300 with FOX on standby? I believe there is precedence for it.",
                "author": "BrokenWolf2022"
            },
            {
                "raw_content": "I hope she deposes him in person. Across the table. Boobs out w maxed cleave. Break the man down.",
                "author": "TrueTemper2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨#BREAKING: U.S House of Representatives Hakeem Jeffries is now calling for the release of all Jeffrey Epstein files.",
        "score": 1489,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Some have theorized that Trump is trying to play 4D chess by baiting the Democrats into wanting the Epstein files released simply because he decided not to on his own. We'll see.",
                "author": "Appeal2Heaven98"
            },
            {
                "raw_content": "Funny, he never demanded this during the FJB regime.",
                "author": "Badfinz_FL"
            },
            {
                "raw_content": "I think the democrats want to release the Files just to spite Trump. It Will backfire onto them horribly. This might be the Trump Curse of the century.",
                "author": "DT170x"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Project Veritas: Text Messages Show Secret Service Agent Disclosing Operational Details To Stranger, Disparaging President Trump",
        "score": 1104,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's filled with them. They probably gave the kid his equipment",
                "author": "Dilligaf"
            },
            {
                "raw_content": "hey at least he's not trying to impress a teenage boy things at the SS seem to be improving!",
                "author": "Retard_Strength"
            },
            {
                "raw_content": "Immediate indictment. Disclosing secret privileged information, knowingly compromising the security of a protectee, violation of security clearance. Hit this douche hard, make an example. Also see who is friends were, read the texts, purge any others that hate the President.",
                "author": "TrueTemper2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨EXCLUSIVE: Lara Trump says the Trump administration Will Release more Epstein Evidence and Will Have More Transparency. She says that President Trump Hears the Base on this Issue and knows how \"Important\" it is and Trump will \"set things right.\"",
        "score": 1527,
        "text_content": "",
        "comments": [
            {
                "raw_content": "After saying there's nothing, now they're going to release something?",
                "author": "conservativefrank"
            },
            {
                "raw_content": "If President Trump would say the same thing instead of calling me selfish that would be great.",
                "author": "schism"
            },
            {
                "raw_content": "Two more weeks?",
                "author": "South_Florida_Guy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Attorney General Pam Bondi has fired the DOJ's personal ethics adviser, Joseph Tirrell, after the Epstein files debacle, per POLITICO",
        "score": 1370,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Scapegoat much?",
                "author": "Lowersidecustoms"
            },
            {
                "raw_content": "I advise they find some ethics, right quick.",
                "author": "Popsalock"
            },
            {
                "raw_content": "You don't need ethics to protect child rapists.",
                "author": "scrubking"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "It's official - in one fell swoop, ice cream producers composing 90% of the American supply are REMOVING artificial dyes out of their products.",
        "score": 1727,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How bout you put the cream back in ice cream...instead of oil in your frozen dairy dessert?",
                "author": "SweetSpot2020"
            },
            {
                "raw_content": "Ben & Jerry's will be including more semen in their products. Some things never change.",
                "author": "MythArcana"
            },
            {
                "raw_content": "I'll have two scoops of ICE cream. I scream for ICE cream! 🍨",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "James Woods: This was planned from the very beginning:",
        "score": 500,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Noticing Marxism is *also* dangerous. Well done James.",
                "author": "Th3Cho0sing0ne"
            },
            {
                "raw_content": "If this was the UK you'd be arrested for noticing shit like this.",
                "author": "knappz"
            },
            {
                "raw_content": "Coming to a state near you",
                "author": "kfunny91"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Supreme Court Allow Trump to proceed with clean out of Education Dept!",
        "score": 1379,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Now do away with social emotional learning, AKA- child therapy without parents knowledge or consent.",
                "author": "Brocakemcgoo"
            },
            {
                "raw_content": "5 - 0 for Trump at USSC?",
                "author": "thebeercules"
            },
            {
                "raw_content": "Why is it so hard for the Mexican to understand cutting staff is perfectly in line and not eliminating the agency. So what his intent is irrelevant if he isn't dissolving the the agency. It's an executive agency and he has authority over staffing.",
                "author": "SanityGumby"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "MATT WALSH: Nobody can provide an example of a single way that the United States has benefited from Somali immigration. It's easy to think of the drawbacks. There are no positives. None at all. None of the idiots who flock to this post to call me \"racist\" or whatever will be able to give an example.",
        "score": 397,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Bringing uneducated , penniless America hating non assimilating to our country destroys the country plain and simple",
                "author": "aqua27"
            },
            {
                "raw_content": "They haven’t even brought in Somali cuisine. Have you ever had Somali food? That’s okay, because neither have they",
                "author": "henri_derelicte"
            },
            {
                "raw_content": "Possibly the only remaining market for skinny jeans.",
                "author": "Calumet57"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I miss when global warming was just called “weather” and 900 different pronouns was just called “gay”. It was a simpler time, really",
        "score": 595,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Preach, based Vanilla Ice, preach.",
                "author": "Covidrrhea"
            },
            {
                "raw_content": "https://x.com/iamtommacdonald/status/1944517758739533888?s=46",
                "author": "BidenSniffsLittleKid"
            },
            {
                "raw_content": "I still call it weather and still call them gay.",
                "author": "1776Widowmaker"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "James Gunn tried to be woke, but accidentally failed…",
        "score": 1548,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The new superman movie isn't \"woke\". There's some cringe in it like anything else, but it's far from anything that I would directly label \"woke\". What's happening here is that a really fucking shitty journalist got access to the red carpet and kept asking loaded questions to the staff. He's the one who started the whole \"Superman is an immigrant\" bullshit. James Gunn wasn't the one who started it. Even Nathan Fillion basically told the guy to fuck off by saying \"It's just a movie guys\". Now, Sean Gunn, James' brother, is a full on fucking nutjob. He got the questions from that same reporter and just went full on insane with his political ramblings. The new Superman movie is simply a mediocre movie. It's not terrible. It's not woke. It's just a typical churned out movie that took no risks and had bland writing.",
                "author": "ImportantPerson"
            },
            {
                "raw_content": "Who is James Gunn?",
                "author": "loooooof"
            },
            {
                "raw_content": "Yep. He accidentally made the perfect immigrant. Totally rejected the culture of his home planet and perfectly assimilated. Spoilers This version has Superman’s Kryptonian dad tells him to basically go conquer earth and create a harem to spread his superior seed.",
                "author": "HairOfTheDoge"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Nvidia Says U.S. Has Lifted Restrictions on A.I. Chip Sales to China | The Silicon Valley chip giant said the Trump administration, which had shut down its sales to China three months ago, had assured it that licenses for the sales would now be granted.",
        "score": 48,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TACO is at it again. The cheques were clear.",
                "author": "liebesapfel"
            },
            {
                "raw_content": "For the people not reading the article, it's China specific h20s not full fat chips.",
                "author": "Boreras"
            },
            {
                "raw_content": "good news so china can stay competitive in AI",
                "author": "DazzlingpAd134"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel to quadruple planned layoffs in AZ with nearly 700 jobs to be cut",
        "score": 145,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Was intel that bloated? Or this guy is chopping up the company",
                "author": "A_Typicalperson"
            },
            {
                "raw_content": "Intel employed a lot of people based on their market dominance and hegemony and the decisions that caused these layoffs are years in the past, because the loss of those things is. I still see the phrase \"the end of Intel as we know it\" thrown around but even if they made a perfect product tomorrow they would not be able to completely reclaim the ground they have lost. It's a completely different era now.",
                "author": "Limited_Distractions"
            },
            {
                "raw_content": "You think this will include green badge, the 172 that was first stated were supposed to be all blue badges.",
                "author": "OkTeam8482"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel slashes 584 California jobs as CEO says company is no longer a top chipmaker",
        "score": 387,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Even engineers working on Diamond Rapids, a flagship product, are getting laid off. I my guessing that all the side projects are getting canned.",
                "author": "mockingbird-"
            },
            {
                "raw_content": "I wonder what morale is like at Intel. Are the only ones not jumping ship H1Bs?",
                "author": "philn256"
            },
            {
                "raw_content": "What a strange thing for a CEO to say... unless they're trying to reset expectations.",
                "author": "ChadHartSays"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Gigabyte motherboards vulnerable to UEFI malware bypassing Secure Boot",
        "score": 58,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> the four vulnerabilities affect more than 100 motherboards...products from other vendors are impacted. This is a big one. Emergency bios updates to follow.",
                "author": "jonathanrdt"
            },
            {
                "raw_content": "The confirmed affected products are listed here: https://www.binarly.io/advisories/brly-dva-2025-011 https://www.binarly.io/advisories/brly-dva-2025-010 https://www.binarly.io/advisories/brly-2025-009 https://www.binarly.io/advisories/brly-dva-2025-008 Looks like basically all Gigabyte Intel boards from the Skylake (6th gen) to Rocket Lake (11th gen) era. There's also this one from two weeks ago affecting laptop and similar product motherboards: https://www.binarly.io/advisories/brly-dva-2025-005",
                "author": "Dghelneshi"
            },
            {
                "raw_content": ">Dozens of Gigabyte motherboard models run on UEFI firmware vulnerable to security issues that allow planting bootkit malware that is invisible to the operating system and can survive reinstalls. >The vulnerabilities could allow attackers with local or remote admin permissions to execute arbitrary code in System Management Mode (SMM), an environment isolated from the operating system (OS) and with more privileges on the machine.",
                "author": "MumrikDK"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "9070XT AIB model comparison",
        "score": 78,
        "text_content": "",
        "comments": [
            {
                "raw_content": "great shame about the powercolor reaper, as a short 2x 8pin it is [the] model i wanted to buy.",
                "author": "Jedibeeftrix"
            },
            {
                "raw_content": "Wow look at all those $599 MSRP models! Thanks AMD.",
                "author": "tagubro"
            },
            {
                "raw_content": "TLDR/TLDW (Prices in USD): - Asrock 9070 XT Steel Legend (White) - $715, 3-fans, 3-slots, RGB, backplate, 296mm long, 1153gr, 2x 8-pin power connectors, 3xDP and 1xHDMI output, highest GPU memory temperature (40 dBA noise normalized) at 85°C, highest GPU VRM temperature (40 dBA noise normalized) at 71°C - Asrock 9070 XT Taichi - $800, 3-fans, Dual BIOS, metal backplate, RGB, 333mm long, 12V-2x6 connector, 3-slots, 1470gr, lowest GPU temperature (40 dBA noise normalized) at 48°C - Asus Prime 9070 XT - $720, 3-fans, aluminium backplate, Dual BIOS, no RGB, 313mm long, 1100gr, 3-slots, 3x 8-pin power connectors, 3xDP and 1xHDMI output, lowest memory temperatures at 74°C, highest GPU VRM temperature (40 dBA noise normalized) at 71°C - Asus TUF Gaming 9070 XT - $850(!!!), 3-fans, 330mm long, 1448gr, Dual BIOS, 3x 8-pin power connectors, some RGB, coolest at 51 °C average GPU temperature - Gigabyte 9070 XT Elite - $760, 3-fans, 334mm long, 3-slots, 2xDP and 2xHDMI outputs, 3x 8-pin power connectors, Dual BIOS, aluminium backplate, RGB, lowest VRM temperature at 57°C, lowest GPU VRM temperature (40 dBA noise normalized) at 51°C - Gigabyte 9070 XT Gaming - $730, 3-fans, aluminium backplate, 299mm long, 3-slots, 1261gr, 3x 8-pin power connectors, 2xDP and 2xHDMI outputs, Dual BIOS, RGB, highest hotspot temperature at 89°C, highest GPU temperature (40 dBA noise normalized) at 60°C, highest GPU hotspot temperature (40 dBA noise normalized) at 88°C - PowerColor 9070 XT Hellhound (black and white) - $750, 3-fans, Dual BIOS, aluminium backplate, 2x 8-pin power connectors, 3xDP and 1xHDMI output, 328mm long, 1172gr, no RGB - PowerColor 9070 XT Red Devil - $820, 3-fans, aluminium backplate, Dual BIOS, RGB, 340mm long, 1545gr, 3xDP and 1xHDMI output, 3x 8-pin power connectors - Sapphire 9070 XT Nitro+ - $770, 3-fans, RGB, removable magnetic backplate, 2xDP and 2xHDMI outputs, 3-slots, 327mm long, 1894gr, 12V-2x6 connector - Sapphire 9070 XT Pulse - $720, no RGB, 2x 8-pin power connectors, 2xDP and 2xHDMI outputs, 321mm long, 3-slots, backplate, warmest GPU temperature at 62 °C, highest memory temperatures at 90°C, highest VRM temperature at 86°C - Sapphire 9070 XT Pure (white) - $740, 3-fans, 2xDP and 2xHDMI outputs, 2x 8-pin power connectors, RGB, 1233gr, 323mm long - XFX 9070 XT Mercury (white) - $780, 3-fans, 1705gr, 349mm long, 4 slots, 3xDP and 1xHDMI output, Dual BIOS, aluminium backplate, RGB, coolest average GPU temperature at 51 °C, lowest hotspot temperature at 76°C - XFX 9070 Quicksilver - $740, 3-fans, 4-slots, 348mm long, 1545gr, Dual BIOS, no RGB, 3xDP and 1xHDMI output, 2x 8-pin power connectors, magnetic removable fans, lowest GPU hotspot temperature (40 dBA noise normalized) at 68°C, lowest GPU memory temperature (40 dBA noise normalized) at 62°C - XFX 9070 XT Swift - $720, 3-fans, aluminium backplate, 3.5 slots, 320mm long, 1350gr, 3xDP and 1xHDMI output, 2x 8-pin power connectors, no RGB, Dual BIOS Best Performers: XFX Mercury, Sapphire Nitro+ and Pure, Powercolor Red Devil, Asrock Taichi (fastest GPU was 4-6% faster than slowest) Slowest: Sapphire Pulse, XFX Swift Steve's favorite: XFX Mercury, 2nd Sapphire Nitro+ Steve's best value: Powercolor Hellhound (White)",
                "author": "Antonis_32"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "CPU to memory buses and speeds",
        "score": 5,
        "text_content": "So, as I understand Memory Data Bus transfers 64 bits at each CPU cycle (Is that right?) So, I am confused about DDR speeds, I don't get it if the CPU to RAM bus speed is fixed to 64 bit per cycle, why does it matter to increase from DDR2 (e.g. PC2-4200) to DDR5 (e.g. PC5-42000)? The explanation would be it has effect on the CPU <-> RAM communication speed, but if so, how exactly, isn't it fated to 64 bits per cycle??",
        "comments": [
            {
                "raw_content": "Memory bandwidth is dictated by 2 things: bus width and transfer rate. The bus width is that 64 bits. That's how wide one memory channel is, and most PC platforms can run 2 channels, totaling 128 bits wide. You are limited to this many bits per cycle, but you can have more cycles in a given time frame. The speed rating you see on memory is the transfer rate. DDR transfers data twice per clock cycle, so the clock speed is half this rating. If we imagine a modern PC using ddr5-6000, we can calculate its bandwidth. 128 bits per transfer × 6000 transfers per second = 768'000 bits per second. A more useful unit would be 93.75GB/s. Now imagine another PC using ddr4-3600. 128 × 3600 = 460'800, or 56.25GB/s. As a third example, Lunar Lake's very quick LPDDR5-8533. 128 × 8533 = 1'092'224, or 133.33GB/s. The bandwidth is proportional to the transfer frequency when bus width is fixed, so by increasing the memory frequency, we get more bandwidth. There are also features added to new memory standards, such as the fact that ddr5 has 2 sub-channels in each 64-bit channel. Rather than 1 64-bit chunk of data, it's sending 2 32-bit chunks down each channel.",
                "author": "Affectionate-Memory4"
            },
            {
                "raw_content": "Modern x86 CPUs can read 64 *bytes* per CPU clock from cache. Much much faster than RAM. When the data is not in cache, it is read from RAM. So if you can make the RAM faster, that's a huge plus.",
                "author": "EmergencyCucumber905"
            },
            {
                "raw_content": "It seems you've completely ignored the number of cycles per second. DDR2 has a maximum clock speed of 533MHz under the standard, which means 1066 megatransfers per second (DDR does two transfers per clock cycle, hence the name Double Data Rate). DDR5 has a maximum clock speed of 3200MHz under the standard, for 6400 MT/sec. That's six times faster than DDR2.",
                "author": "RealThanny"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "How fast actually is DDR5 memory (based on its specs)?",
        "score": 9,
        "text_content": "Obviously, this depends on various factors. If the CPU was, say, executing a move from main memory to a register, given X parameters (i.e. hardware specs), how long would it take the CPU to actually read from main memory? You can factor in the time for checking and missing the caches if you'd like. Given RAM latencies of, say, 12-15ns, how can it be that a CPU (say, 5 GHz, so 60-75 cycles) takes hundreds of cycles to access main memory? Is this factoring in things like paging (likely requiring more memory accesses), thus stacking things up on the total cost of our single memory read? Furthermore, wouldn't these also affect cache accesses, slowing them down from the squeaky-clean 4-5 cycle L1 access? Or are we just trusting that it'll always be in the TLB when we look for it?",
        "comments": [
            {
                "raw_content": "Nanosecond round-trip is all you need to calculate. We've been hovering around 80ns since the peak of DDR3. I've got an AM4 system running 3600mhz CL14 for 68ns. DDR5 at 6000/30 is worse.",
                "author": "RedTuesdayMusic"
            },
            {
                "raw_content": "Depends on the speed and various latencies of the memory, the architecture of the memory controller and the physical distance of the tracks. For all reasonable intents and purposes, ddr5 6000cl 30 has a latency of ~75ns",
                "author": "Keljian52"
            },
            {
                "raw_content": "Because the ram latency isn't 12-15ns. Everyone always talks about CAS latency, but it isn't the only thing that needs to happen on the path to access ram. First you need to miss all your caches. This takes time, and you do it one level at a time. (Some systems do start access at upper levels simultaneously with ones on the lower levels, but you generally don't want that, because it removes the bandwidth amplification effect of caches). Then, for a system with low load, the bank you are accessing probably has no row open. You you need to send row access command, wait out tRCD, send column access command, wait out tCAS, then data starts arriving on the pins, then wait for the whole line to arrive, then move it back down through the cache hierarchy to the CPU. When there is load on the memory, it's likely that the bank of memory you are accessing has a row already open. If that's the row you are accessing, great! Now you only have to wait out tCAS. But if it's not, then you have to close the current row, wait out any remaining tRAS, then wait tRP, and now you are where the low-load scenario started.",
                "author": "Tuna-Fish2"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Finishing up the Bendix G-15!",
        "score": 11,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Super Mario all stars updating?",
        "score": 325,
        "text_content": "Randomly checking for updates and this happened",
        "comments": [
            {
                "raw_content": "Idk why but it bothers me that you have a new dr pepper when one is there with 20% left.",
                "author": "Klutzy_Science_3103"
            },
            {
                "raw_content": "Yeahhhh buddy. Galaxy 2 has been added for free.",
                "author": "goldman459"
            },
            {
                "raw_content": "How the hell can you game or watch tv with all that shit in front of you?",
                "author": "joydivision84"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "BuT the SwITch iS too exPEnsIve",
        "score": 680,
        "text_content": "It’s still a rumor though https://www.pcguide.com/news/new-rog-xbox-ally-handhelds-get-another-price-leak-this-time-from-an-official-partner/",
        "comments": [
            {
                "raw_content": "What did people expect it's just a rebranded ROG ally Xbox was never going to subsidize it",
                "author": "soyuz_enjoyer2"
            },
            {
                "raw_content": "Because it's a rebranded ROG Ally, it's nota true handheld console but a PC handheld",
                "author": "BernLan"
            },
            {
                "raw_content": "Shit will be like 1200 in Canada… that’s a no from me dog. Imma stick to my ps5 pro and switch 2",
                "author": "Bootychomper23"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "NateTheHate reaffirms RDR2 is coming to Switch 2",
        "score": 804,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’m hoping it has gyro controls",
                "author": "Last-Permission83"
            },
            {
                "raw_content": "I honestly REALLY hope this is true, as I am willing to buy this game for the fourth time, especially because of the advantage of being to play it virtually anywhere. ![gif](giphy|yAYZnhvY3fflS)",
                "author": "LePigeon12"
            },
            {
                "raw_content": "We used to pray for times like these ![gif](giphy|l46CfphUZPc9GiRbi|downsized)",
                "author": "Icy_Ad620"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "NateTheHate confirms that a Nintendo Direct is coming this month",
        "score": 1088,
        "text_content": "Timestamp 42:00 https://youtu.be/NYkD9QCBp4Y?si=Lk9GM43Hp2-7Af3P Quote: > There is a Direct this month, the month of July, but, that Direct will not take place until after Donkey Kong Bananza releases, beyond that i do not have any additional information as to the exact timing at this point. It’s happening!!!",
        "comments": [
            {
                "raw_content": "Probably between the pokemon presents and their financial report",
                "author": "soyuz_enjoyer2"
            },
            {
                "raw_content": "IMO, after Donkey Kong's release, a Nintendo Direct is almost required. Apart from a small handful of Switch 2 editions of Switch 1 games, we don't really know of any Switch 2 games coming for the rest of this year.",
                "author": "XDvinSL51"
            },
            {
                "raw_content": "Not shocked, the reason they didn't have one in June was likely to let DK:B breathe a bit. I think the 24th is the most likely date.",
                "author": "RyanPainey"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Switch 2 - System Update 20.2.0",
        "score": 22,
        "text_content": "",
        "comments": [
            {
                "raw_content": "For those who don’t like clicking links: “Fixed an issue where Parental Control settings were not transferred from Nintendo Switch to Nintendo Switch 2 in certain circumstances during a system transfer. Fixed an issue where you could not proceed past “Searching for networks” in Internet Settings within System Settings. General system stability improvements to enhance the user's experience.”",
                "author": "Background_Orange_18"
            },
            {
                "raw_content": "Next time they'll send a gyroscope through the mail for maximum stability.",
                "author": "DrKrFfXx"
            },
            {
                "raw_content": "They have improved Switch 1 game compatibility again. Portal 2 is now playable without the airplane mode workaround.",
                "author": "404IdentityNotFound"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Love my switch 2",
        "score": 338,
        "text_content": "This thing feels so sleek and premium. Huge upgrade from my switch 1. Of course there’s things that I think could’ve been done better. But that goes for majority of purchases I make. Having fun playing through Hogwarts legacy. Then I’ll tackle cyberpunk next. How’s everyone else’s experience been?",
        "comments": [
            {
                "raw_content": "The thumb grips are going to trigger some 😂😂",
                "author": "Crawitt"
            },
            {
                "raw_content": "Love my switch 2. So excited for donkey Kong this week! Only thing that can make me happier is a hori split pad pro or something similar. For now the joycons will do.",
                "author": "w1ckizer"
            },
            {
                "raw_content": "Loving hogwarts legacy too. Looks and plays superb on switch 2!",
                "author": "tapedeck25"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Anyone need a MarioKart World download code?",
        "score": 166,
        "text_content": "I have an extra download code for MarioKart World- just be the first to private message me and it is all yours :)",
        "comments": [
            {
                "raw_content": "all set- it has been claimed",
                "author": "radicallife"
            },
            {
                "raw_content": "Already have it but take my upvote for being nice!",
                "author": "SSBHuesos"
            },
            {
                "raw_content": "I don’t need it either but what a nice gesture.",
                "author": "Known_Bar7898"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Lakitu as a camera",
        "score": 18,
        "text_content": "The piranha plant is cool, but a lakitu holding camera would have been a really great camera for the Switch 2. Not to say that it wont happen, but this seems like a really great idea to me. https://preview.redd.it/b456w03tvycf1.png?width=963&format=png&auto=webp&s=b0b9e1c79f5a84708f6e5714b6be645c4f092fe1",
        "comments": [
            {
                "raw_content": "I feel like it would take up a lot of space though.",
                "author": "Williekins"
            },
            {
                "raw_content": "ask the 3d printer sub reddit",
                "author": "coolguy3555"
            },
            {
                "raw_content": "I saw a post with a similar idea a few months ago",
                "author": "LightWarrior71"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Jez Corden says he has heard that Elder Scrolls VI is currently \"quite playable\".",
        "score": 273,
        "text_content": "Source is from [XB2](https://www.youtube.com/watch?v=DDr2ZSFIEXk&t=1h8m25s). States that he heard Elder Scrolls VI was currently in a \"quite playable state\"; when questioned on this he says : \"Put it this was, when we did our predictions for the showcase, that Elder Scrolls was going to be there, for me it was \\[having to do with something he heard behind the scenes\\] - an educated guess.\" Later says the has no real idea how far along the game is, saying that Bethesda sourcing is \"quite hard to come by\".",
        "comments": [
            {
                "raw_content": "#Jez Corden is a Tier 2 - Generally Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "The Duke Nukem 2001 demo is *quite playable*, but that doesn't mean the game is complete. So, a little context would be nice. What phase is it on? Is feature complete?",
                "author": "Midnight_M_"
            },
            {
                "raw_content": "The same Jez Corden who said today that Blackbird was canceled in order to free up resources for more Fallout games, and then was immediately called out by Jason Schreier for being wrong?",
                "author": "KMoosetoe"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Fallout 5 Is Now Reportedly \"Fully Greenlit\", according to Jez Corden",
        "score": 447,
        "text_content": ">The report comes from the latest episode of the [Xbox Two Podcast](https://www.youtube.com/live/DDr2ZSFIEXk?t=3845s), where Windows Central executive editor Jez Corden discussed how Xbox is handling Fallout as a franchise moving forward. However, he didn't know what studio would be developing Fallout 5, as he believes Bethesda Game Studios' core teams are currently busy working on additional [Starfield DLC](https://www.gamespot.com/articles/bethesda-knows-fans-are-eager-for-starfield-updates-promises-exciting-year/1100-6529956/) and [The Elder Scrolls VI](https://www.gamespot.com/articles/the-elder-scrolls-6-release-date-trailer-news/1100-6492383/). [via Gamespot](https://www.gamespot.com/articles/fallout-5-is-now-reportedly-fully-greenlit/1100-6533153/)",
        "comments": [
            {
                "raw_content": "#Jez Corden is a Tier 2 - Generally Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "So in which phase is Scrolls 6 ?",
                "author": "myfatbic"
            },
            {
                "raw_content": "Can't wait to play it on PS7",
                "author": "4000kd"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Santa Monica Studio’s next game is not sci-fi",
        "score": 441,
        "text_content": "Jason Schreier on ResetEra: “I'll put it this way: it's not a new IP but it might feel like one. Maybe that's why people are confused. Please don't ask me more questions about this - if I wind up reporting more information at any point in the future it'll be in an article, not on a forum. I can also confirm that Ashhong knows what they are talking about. And that the sci-fi stuff (that people have apparently believed for years now?) is nonsense.” https://www.resetera.com/threads/playstation-studios-ot46-back-to-the-beach.1172010/page-406#post-142670637",
        "comments": [
            {
                "raw_content": "so reinventing an old IP in a way that makes it feel like basically a whole different thing, kinda like they did for God of War",
                "author": "blackthorn_orion"
            },
            {
                "raw_content": "God of War Kart",
                "author": "Wassersammler"
            },
            {
                "raw_content": "I guess a reboot of some old IP or some obscure adaptation, that's why it'll \"feel like a new IP\" edit: [also this is some of the stuff Ashong has said before:](http://www.resetera.com/threads/playstation-studios-ot46-back-to-the-beach.1172010/page-396#post-142657023) \"I can't wait for Santa Monica to announce their game. I truly don't know how era will react\" \"I will just say it's different and probably not something anybody is expecting\" \"Not trying to sour anyone's expectations by the way. I think it's gonna be amazing\" \"At first I was like :/ but then I was like :O\" edit 2: [apparently it's not a licensed game either](http://resetera.com/threads/playstation-studios-ot46-back-to-the-beach.1172010/page-400#post-142662756)",
                "author": "4000kd"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "NateTheHate: Some 3rd Party developers are choosing not to announce their Switch 2 games yet.",
        "score": 526,
        "text_content": "\"Capcom, Sega, Ubisoft, Namco and many others are just waiting. They have games they want to announce. Switch 2 has a lot of support coming.\" https://xcancel.com/Stealth40k/status/1944832820687376692",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "I was surprised Persona 3 and Metaphor weren’t announced to be in the first year.",
                "author": "ButIDigress79"
            },
            {
                "raw_content": "Sega is absolutely putting P3R and Metaphor on Switch 2.",
                "author": "RJE808"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Jason Schreier hints at Sony Santa Monica's next game NOT being a new IP",
        "score": 618,
        "text_content": "Via Resetera: [https://www.resetera.com/threads/playstation-studios-ot46-back-to-the-beach.1172010/post-142655865](https://www.resetera.com/threads/playstation-studios-ot46-back-to-the-beach.1172010/post-142655865) After his earlier comment that he heard Cory Barlog's new game was progressing well, he now dropped a hint at it not being a new IP: >Why does everybody think Barlog's game is a new IP? UPDATE: >I'll put it this way: it's not a new IP but it might feel like one. Maybe that's why people are confused. Please don't ask me more questions about this - if I wind up reporting more information at any point in the future it'll be in an article, not on a forum. >I can also confirm that Ashhong knows what they are talking about. >And that the sci-fi stuff (that people have apparently believed for years now?) is nonsense. [https://www.resetera.com/threads/playstation-studios-ot46-back-to-the-beach.1172010/post-142670637](https://www.resetera.com/threads/playstation-studios-ot46-back-to-the-beach.1172010/post-142670637)",
        "comments": [
            {
                "raw_content": "#Jason Schreier is a Tier 1 - Very Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Finally, Kinetica 2",
                "author": "FransD98"
            },
            {
                "raw_content": "[This](https://www.gamespot.com/articles/god-of-war-developer-sony-santa-monica-is-reportedly-working-on-a-new-ip/1100-6525531/) is seemingly the first mention I can find about SSM next game being a new IP. Don’t know if there was a rumor before this though.",
                "author": "JuanMunoz99"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Jez Corden: Blackbird was canceled in order to free up resources for more Fallout games",
        "score": 436,
        "text_content": "[Source](https://www.resetera.com/threads/rumor-blackbird-was-canceled-in-order-to-free-up-resources-for-more-fallout-games-fallout-5-fully-greenlit.1243152/) Blackbird was the ZeniMax Online MMORPG (update) Jason Schreier: Xbox didn't lay off thousands of people so they could move those resources to new projects. They laid off thousands of people to cut their overall fiscal year budget.",
        "comments": [
            {
                "raw_content": "#Jez Corden is a Tier 2 - Generally Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "They really should’ve gotten the ball rolling on more fallout/elder scrolls as soon as they bought zenimax instead of waiting until now and cancelling a bunch of other things to put money towards it.",
                "author": "SaltySwan"
            },
            {
                "raw_content": "This means we'll get Fallout 5 in 2034 instead of 2036!",
                "author": "MuptonBossman"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "MachineGames Job Listing Suggests Indiana Jones Sequel Development Is Underway",
        "score": 554,
        "text_content": "MachineGames, the studio behind Indiana Jones and the Great Circle, appears to be hiring for a sequel to the game. This is inferred from a job listing for a Senior Concept Artist that highlights experience in the film industry, suggesting a continued focus on the Indiana Jones IP. [SOURCE](https://tech4gamers.com/machinegames-hiring-indiana-jones-sequel/)",
        "comments": [
            {
                "raw_content": "I guess I can forget about Wolfenstein 3 now. That's a shame, loved The New Colossus.",
                "author": "Abhinav101010"
            },
            {
                "raw_content": "Indiana Jones and the Excellent Triangle!",
                "author": "ArcanaOfApocrypha"
            },
            {
                "raw_content": "Glad to hear. I think the franchise's future should be in video-games, no need for a reboot with a younger actor.",
                "author": "HearTheEkko"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Nate the Hate: Nintendo Direct happening in the \"latter half of July\" (Speculation: Last week of July)",
        "score": 583,
        "text_content": "[https://youtu.be/NYkD9QCBp4Y?si=7tLtckVoeOnopXu8&t=1920](https://youtu.be/NYkD9QCBp4Y?si=7tLtckVoeOnopXu8&t=1920)",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "FINALLY THANK YOU NATE",
                "author": "ArcWardenScrub"
            },
            {
                "raw_content": "Give me that FE4 remake Nintendo and my life is yours",
                "author": "abdu11"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Lenovo launches first ever ThinkPad in white, X9 Aura Edition features up to Intel Core 9 288V \"Lunar Lake\" CPU",
        "score": 31,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Having sampled the X9, not a fan. Needs a trackpoint, needs a not-fubar arrow key cluster, needs a better keyboard in general. Lunar lake is good though, but its so cool/quiet/efficient it should be in fanless designs if their target is macbook air.",
                "author": "PsyOmega"
            },
            {
                "raw_content": "> Known as the “White Moonlight” edition, this model is **exclusive to the Chinese market** RIP",
                "author": "Yes-times-infinity"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD Ryzen Threadripper 9000 preorders start July 23, 96-core PRO 9995WX listed at $13,000",
        "score": 140,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That price made me audibly gasp. Good lord that is a lot for a CPU.",
                "author": "ThatITguy2015"
            },
            {
                "raw_content": "FFS you could get 2x of the 128 core Epyc 9745 chips for this price lol. Definitely targeting different customers of course, but wow.",
                "author": "Agreeable-Case-364"
            },
            {
                "raw_content": "Finally! A CPU powerful enough to play minesweeper at 60fps",
                "author": "Schnitzel725"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Old Radeon HD 2000/3000/4000 GPUs Still Seeing Open-Source Driver Fixes In 2025",
        "score": 32,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Great news, I still have a 'HIS HD 3850 IceQ 3 Turbo' in my Retro Gaming Machine 😁",
                "author": "readyflix"
            },
            {
                "raw_content": "Let’s go open source for the win, suck it novideo",
                "author": "why_is_this_username"
            },
            {
                "raw_content": "My HD4850 still works, unlike every nvidia card I owned.",
                "author": "3G6A5W338E"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Radeon RX 9060 XT Review: Powerful desktop GPU with 16 GB VRAM in a price-performance check",
        "score": 119,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A little late to the party eh? 😅",
                "author": "MichiganRedWing"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "ASUS ROG Xbox Ally listed at €599 (Ryzen Z2) and €899 (Ryzen Z2 Extreme) by official Spanish distributor",
        "score": 91,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Oof.",
                "author": "Cradenz"
            },
            {
                "raw_content": "Hardly a console-level price for a handheld that was made in direct partnership with a console-maker.",
                "author": "wizfactor"
            },
            {
                "raw_content": "Im just not seeing where this price is coming from, I bought a 7840u handheld back when it JUST came out, ended up getting it for like 670 euro and that was a chinese boutique handheld, now its almost 1000 for something thats only a few percentages better from Asus/Microsoft?",
                "author": "tribes33"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Radeon RX 9070 XT Roundup, 14 Cards Tested!",
        "score": 61,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TL;DR: Most RX 9070 XT models tested by Hardware Unboxed perform within about 5% of each other. XFX cards run cooler but use oversized coolers with higher fan speeds. The top performers wereXFX Mercury, PowerColor Red Devil, Sapphire Nitro+, Sapphire PURE, and ASRock Taichi. They highlighted XFX Mercury and Sapphire Nitro+ as the editors favorite for aesthetics and performance , but his recommendation for the most reasonable priced RX9070XT was the PowerColor Hellhound as the best balance of size, cooling, value, and features.",
                "author": "Aaadvarke"
            },
            {
                "raw_content": "TLDR/TLDW (Prices in USD): - Asrock 9070 XT Steel Legend (White) - $715, 3-fans, 3-slots, RGB, backplate, 296mm long, 1153gr, 2x 8-pin power connectors, 3xDP and 1xHDMI output, highest GPU memory temperature (40 dBA noise normalized) at 85°C, highest GPU VRM temperature (40 dBA noise normalized) at 71°C - Asrock 9070 XT Taichi - $800, 3-fans, Dual BIOS, metal backplate, RGB, 333mm long, 12V-2x6 connector, 3-slots, 1470gr, lowest GPU temperature (40 dBA noise normalized) at 48°C - Asus Prime 9070 XT - $720, 3-fans, aluminium backplate, Dual BIOS, no RGB, 313mm long, 1100gr, 3-slots, 3x 8-pin power connectors, 3xDP and 1xHDMI output, lowest memory temperatures at 74°C, highest GPU VRM temperature (40 dBA noise normalized) at 71°C - Asus TUF Gaming 9070 XT - $850(!!!), 3-fans, 330mm long, 1448gr, Dual BIOS, 3x 8-pin power connectors, some RGB, coolest at 51 °C average GPU temperature - Gigabyte 9070 XT Elite - $760, 3-fans, 334mm long, 3-slots, 2xDP and 2xHDMI outputs, 3x 8-pin power connectors, Dual BIOS, aluminium backplate, RGB, lowest VRM temperature at 57°C, lowest GPU VRM temperature (40 dBA noise normalized) at 51°C - Gigabyte 9070 XT Gaming - $730, 3-fans, aluminium backplate, 299mm long, 3-slots, 1261gr, 3x 8-pin power connectors, 2xDP and 2xHDMI outputs, Dual BIOS, RGB, highest hotspot temperature at 89°C, highest GPU temperature (40 dBA noise normalized) at 60°C, highest GPU hotspot temperature (40 dBA noise normalized) at 88°C - PowerColor 9070 XT Hellhound (black and white) - $750, 3-fans, Dual BIOS, aluminium backplate, 2x 8-pin power connectors, 3xDP and 1xHDMI output, 328mm long, 1172gr, no RGB - PowerColor 9070 XT Red Devil - $820, 3-fans, aluminium backplate, Dual BIOS, RGB, 340mm long, 1545gr, 3xDP and 1xHDMI output, 3x 8-pin power connectors - Sapphire 9070 XT Nitro+ - $770, 3-fans, RGB, removable magnetic backplate, 2xDP and 2xHDMI outputs, 3-slots, 327mm long, 1894gr, 12V-2x6 connector - Sapphire 9070 XT Pulse - $720, no RGB, 2x 8-pin power connectors, 2xDP and 2xHDMI outputs, 321mm long, 3-slots, backplate, warmest GPU temperature at 62 °C, highest memory temperatures at 90°C, highest VRM temperature at 86°C - Sapphire 9070 XT Pure (white) - $740, 3-fans, 2xDP and 2xHDMI outputs, 2x 8-pin power connectors, RGB, 1233gr, 323mm long - XFX 9070 XT Mercury (white) - $780, 3-fans, 1705gr, 349mm long, 4 slots, 3xDP and 1xHDMI output, Dual BIOS, aluminium backplate, RGB, coolest average GPU temperature at 51 °C, lowest hotspot temperature at 76°C - XFX 9070 Quicksilver - $740, 3-fans, 4-slots, 348mm long, 1545gr, Dual BIOS, no RGB, 3xDP and 1xHDMI output, 2x 8-pin power connectors, magnetic removable fans, lowest GPU hotspot temperature (40 dBA noise normalized) at 68°C, lowest GPU memory temperature (40 dBA noise normalized) at 62°C - XFX 9070 XT Swift - $720, 3-fans, aluminium backplate, 3.5 slots, 320mm long, 1350gr, 3xDP and 1xHDMI output, 2x 8-pin power connectors, no RGB, Dual BIOS Best Performers: XFX Mercury, Sapphire Nitro+ and Pure, Powercolor Red Devil, Asrock Taichi (fastest GPU was 4-6% faster than slowest) Slowest: Sapphire Pulse, XFX Swift Steve's favorite: XFX Mercury, 2nd Sapphire Nitro+ Steve's best value: Powercolor Hellhound (White)",
                "author": "Antonis_32"
            },
            {
                "raw_content": "I'm a bit disappointed. There was no mention of the differences between Hynix and Samsung VRAM, which is important for memory temperature. The TDP differences between the cards were not discussed. If you want to overclock a card, some have a higher power ceiling than others. Most importantly, there was no mention of the differences between the XFX Mercury non-OC and OC models. The non-OC Mercury has two 8-pin power connectors and **no vapor chamber**. The best cooling and 3x8pin (also higher TDP) are reserved **only for the OC model**.",
                "author": "Thermosflasche"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Nearly one third of major U.S. housing markets now see falling home prices",
        "score": 261,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Last time we went through a correction (and I’m very very aware that “this TiMe iS dIfFeReNt!”), we began the correction in late 2006 in the west. It continued through 2010 when it had spread coast to coast. Some markets did not bottom until 20212-2013, then my particular market just held in place until lenders began to loosen up, and credit scores had some time to heal, about 2016-2017. We had normal housing markets in 2018 and 2019. We know what happened afterwards. To think we are going to make it 5-10 years from now without some kind of cataclysmic event happening that changes our economy is fooling yourselves.",
                "author": "Prestigious-Ice-2742"
            },
            {
                "raw_content": "KEY POINTS * Nearly one third of the largest 100 markets are now showing annual price declines, according to ICE, a mortgage technology firm. * Inventory has been rising steadily over the past year, up 29% in June compared with the same month last year. * Prices are still seeing big gains in the Northeast and Midwest. Over-inflated home prices, high mortgage rates, rising supply and falling demand are all joining forces to cool the nation’s housing market. Annual home price growth in June was just 1.3%, down from 1.6% growth in May and the slowest rate in two years, according to ICE, a mortgage technology firm. Nearly one third of the largest 100 markets are now showing annual price declines of at least a full percentage point from recent highs, and the trend suggests more markets will do the same. Single family home prices were up 1.6%, while condominium prices were down 1.4% nationally. Inventory has been rising steadily over the past year, up 29% in June compared with the same month last year. The gains, however, began slowing this past spring. The average rate on the 30-year fixed mortgage has hovered in the high 6% range for most of this year, double what it was during the early days of the pandemic, when home prices initially took off. “There are two competing forces in the housing market right now,” said Andy Walden, head of mortgage and housing market research at ICE. “Increasing inventory levels are helping to make homes more affordable, but prices are falling in an increasing number of markets and homes are taking longer to sell, which could make homeowners reluctant to list.” Regionally, prices are still seeing big gains in the Northeast and Midwest. They are softening in the South and West. Cape Coral, Florida, saw the biggest decline, with prices down just over 9%. Austin and Tampa are also seeing price declines, as are seven of the 10 major markets in California.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "[deleted]",
                "author": "None"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The Housing Market Keeps Tilting in Favor of Buyers",
        "score": 114,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good 😈 Just put in an offer yesterday",
                "author": "Dudermeister"
            },
            {
                "raw_content": "Still overpriced and the interest rate is too high.",
                "author": "SGAisFlopden"
            },
            {
                "raw_content": "From realtor.com. Trust this information with a grain of salt. The industry needs TRANSACTIONS at any price level. That price level will likely still not be in your favor, buyers.",
                "author": "Prestigious-Ice-2742"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "U.S. Home Prices Are up 29 Percent Since 2019",
        "score": 67,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I sold my house in Charleston, SC for 250k in 2019. The same house is valued at almost $600k today. They ain't lying. I wouldn't pay $600k for it, but yeah, life happens.",
                "author": "Likely_a_bot"
            },
            {
                "raw_content": "My friend sold a pretty crappy house in Jackson about a year ago. She got like 40% more than she bought it for in 2018. The house was a damn money pit for her and will be a money pit for a new owner. All that price growth - at a place with declining population, increasing criminal activity, and clean water crisis. Why? A mystery.",
                "author": "MyMonkeyCircus"
            },
            {
                "raw_content": "How much are wages up since 2019?",
                "author": "spaceboi77"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Should I foreclose?",
        "score": 12,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Once he said “my tenants”… lol get bent, TikTok landlord",
                "author": "ChadsworthRothschild"
            },
            {
                "raw_content": "The ReBubble wet dream right here!",
                "author": "duqx"
            },
            {
                "raw_content": "Oh no this could never possibly happen no one would ever want to get out from their sub 3% interest rate. Blah blah golden handcuffs /s",
                "author": "tothepointe"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "U.S. housing market slows to lowest pace in years",
        "score": 54,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Only took 5 years since the onset of Covid economy for it to happen.",
                "author": "Prestigious-Ice-2742"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Americans need to make six figures in order to afford a median-priced home, which is currently more than $422,000, according to the National Association of Realtors.",
        "score": 34,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I live in a rural area in Utah. Like much of the world, the cost of housing here has more than doubled and it’s pretty soul crushing. My friend, who is a local realtor, says that housing prices have gone down 20% since the height of the bubble. I’ve calculated that either prices still need to go down 17% or wages need to increase. I absolutely refuse to buy until prices are fair again. Just as an aside- the prices on Zillow don’t necessarily reflect the deals people are getting in my area. The seller almost always pays closing costs and rate buy downs are common.",
                "author": "somsta1"
            },
            {
                "raw_content": "I am not from the US. Just out of curiosity, how much cheaper (or perhaps more expensive!?) are rents compared to mortgage payments? And what's the minimum down payment these days? 20%?",
                "author": "Aristo95"
            },
            {
                "raw_content": "[deleted]",
                "author": "None"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Homes for Sale Also Surge in Washington D.C., Boston, New York, Philadelphia, Chicago, and Detroit, but Are Still Very Low",
        "score": 2,
        "text_content": "https://wolfstreet.com/2025/07/14/homes-for-sale-also-surge-in-washington-d-c-boston-new-york-philadelphia-chicago-and-detroit-but-are-still-very-low/ Homes for Sale Also Surge in Washington D.C., Boston, New York, Philadelphia, Chicago, and Detroit, but Are Still Very Low | Wolf Street They’re among the stragglers, behind other big markets whose inventories have shot up to at least decade-highs. By Wolf Richter for WOLF STREET.",
        "comments": [
            {
                "raw_content": "I’m still not seeing significant price reductions in the prime Chicago neighborhoods or even the sought after school district suburbs. I’ve been watching for 6 months now. My realtor who works for years in Chicago and western suburbs says the burbs are wildfire with multiple offers significantly over asking. He has to book a showing within 2 days of listing or it’s gone unless the starting price or repair status is absurd. It’s crazy what people will do to put kids in the best schools when a nearby area still has all the college classes in HS. Apparently a 8-9/10 is not enough.",
                "author": "HsRada18"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Austin Housing Market Given Ominous Warning",
        "score": 62,
        "text_content": "https://www.newsweek.com/austin-housing-market-given-ominous-warning-2097217 Austin Housing Market Given Ominous Warning - Newsweek",
        "comments": [
            {
                "raw_content": "[removed]",
                "author": "None"
            },
            {
                "raw_content": "Austin is a rebubble success story. Build and prices will come down. Everywhere else refuses to build leading to housing shortages",
                "author": "DesignerCalendar5104"
            },
            {
                "raw_content": "Austin had a remarkable run in housing and growth for the last 20 years. All things considered, the market was very stable during the financial crisis. However, there was an absolute mania during the pandemic making it one of the hottest markets in the country. Buyers were routinely bidding 10-20% over the market to secure a house. It was in fact a bubble. The problem I have with articles like this is the market has already corrected, crashed, or whatever you want to call it. Austin is down 25-30% off the peak. Sure, it could come down a little further, but people acting like the fundamentals are crashing are wrong. Articles like these were the same ones raving about Austin being a boomtown, the fastest growing city, and one of the best places to live in the country. Like Warren Buffet says: \"Be fearful when others are greedy and greedy when others are fearful.\"",
                "author": "atxsince91"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Imagine seeing this headline 10 years ago",
        "score": 1418,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://i.redd.it/94gaj6k8mycf1.gif",
                "author": "Relative_Issue_9111"
            },
            {
                "raw_content": "Somewhere in a dimly lit room 5 years from now a military General is going to be discussing plans to invade Iran with a 3d hologram waifu that he has ordered to call him Big Daddy",
                "author": "garden_speech"
            },
            {
                "raw_content": "wow this new south park episode sounds wild I can't wait.",
                "author": "ZealousidealBus9271"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "A team of construction workers in China operating excavators remotely",
        "score": 2027,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How likely is it that the video and data are being used to train autonomous excavators?",
                "author": "ethotopia"
            },
            {
                "raw_content": "I never got why jobs like this aren't remote controlled everywhere",
                "author": "lordpuddingcup"
            },
            {
                "raw_content": "WFH jobs",
                "author": "bienvenidosantibanez"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "We are in the endgame now",
        "score": 245,
        "text_content": "https://preview.redd.it/k5i17tousxcf1.png?width=512&format=png&auto=webp&s=b1731934c8f81e2d44ab26578de44d263c26a1a5 .",
        "comments": [
            {
                "raw_content": "Why is her left hand so huge? Maybe it's just the perspective or the shading, but that hand looks off and now I can't focus on anything else...",
                "author": "Vehks"
            },
            {
                "raw_content": "Tried Grok Companion, and I must say it’s unpolished, but I can totally see people getting addicted to it. And they’re almost certainly going to update it with different outfits, gestures, better intelligence. Looks like we’re on the dystopia path lads",
                "author": "ethotopia"
            },
            {
                "raw_content": "https://i.redd.it/dkgkw6hivxcf1.gif",
                "author": "throwaway_p90x"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Zuck: AI researchers joining Meta for infinite compute and small teams, not just money",
        "score": 103,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Zuck: AI researchers joining Meta for my incredible personality.",
                "author": "RedditUSA76"
            },
            {
                "raw_content": "Yes. I also work at my company for the free coffee and baked goods, not just money.",
                "author": "Weak-Imagination9363"
            },
            {
                "raw_content": "Honestly, Meta's AI is super impressive. They've done incredible work and it's understandable why people would want to work there. Zuck 4.0 is so close to being lifelike, it's scary.",
                "author": "Amoral_Abe"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The Pentagon Will Now Start Using Musk's Grok",
        "score": 587,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If you wrote a movie where an AI called itself MechaHitler one week, and then the next week signed a contract to be used at the Pentagon, you’d be laughed out of the room. We live in the absolute stupidest timeline.",
                "author": "PhysicalAd9507"
            },
            {
                "raw_content": "Days since saying were cooked : 0",
                "author": "Awkward-Push136"
            },
            {
                "raw_content": "I wonder if MechaHitler will recommend invading the soviets in winter.",
                "author": "mean_bean_machine"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Other labs work on AI safety while xAI drops 1. MechaHitler 2. Strongest model ever (no safety card) 3. Waifu mode & Sexy voice chat All in one week.",
        "score": 648,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Imagine whole xAI researchers team working on this...",
                "author": "Kiragalni"
            },
            {
                "raw_content": "birthrates just plummeted another 15%",
                "author": "Mysterious-Talk-5387"
            },
            {
                "raw_content": "are the animations controlled by an ai model or is it just generic? like u ask it to hold up 2 fingers can it do that?",
                "author": "Ok-Set4662"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Nvidia Says U.S. Has Lifted Restrictions on A.I. Chip Sales to China | The Silicon Valley chip giant said the Trump administration, which had shut down its sales to China three months ago, had assured it that licenses for the sales would now be granted.",
        "score": 50,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If true, They must have realised how dumb it is to give that whole chinese market to Huawei and allow china to be technologically independent from the rest of the world for chips, so they backtracked. It's kinda too late though. Pretty sure the Chinese are now set on being independent medium term",
                "author": "GraceToSentience"
            },
            {
                "raw_content": "I bet China will release something absolute amazing after they get the GPUs. Really curious if they will keep open sourcing their models in the future. This is good for competition.",
                "author": "razekery"
            },
            {
                "raw_content": "Must have been a part of some tariff negotiations. Things are about to accelerate.",
                "author": "Stunning_Monk_6724"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Announcing Grok for Government",
        "score": 558,
        "text_content": "",
        "comments": [
            {
                "raw_content": "[https://www.ai.mil/Latest/News-Press/PR-View/Article/4242822/cdao-announces-partnerships-with-frontier-ai-companies-to-address-national-secu/](https://www.ai.mil/Latest/News-Press/PR-View/Article/4242822/cdao-announces-partnerships-with-frontier-ai-companies-to-address-national-secu/) \"The awards to Anthropic, Google, OpenAI, and xAI – each with a $200M ceiling – will enable the Department to leverage the technology and talent of U.S. frontier AI companies to develop agentic AI workflows across a variety of mission areas. Establishing these partnerships will broaden DoD use of and experience in frontier AI capabilities and increase the ability of these companies to understand and address critical national security needs with the most advanced AI capabilities U.S. industry has to offer.\" It's actually awards of up to 200M for the 4 frontier labs. Pretty interesting.",
                "author": "Mysterious-Talk-5387"
            },
            {
                "raw_content": "Mechahitler government soon",
                "author": "FarrisAT"
            },
            {
                "raw_content": "Homelander announcing Vought finally got the government military contract.",
                "author": "AGI2028maybe"
            }
        ],
        "subreddit": "singularity"
    }
]