[
    {
        "post_name": "Ingraham: How many of you are satisfied with the results of the Epstein investigation? Crowd: Booooo",
        "score": 975,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The message is loud and fucking clear. This is NOT going away. The American People are not satisfied. Are you listening, commie infiltrators?",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "It was part of the platform… promises need to be kept. The people’s mandate is not something to be ignored, we want retribution in the form of bringing these people to justice in the very sense of the word.",
                "author": "BoomShtick"
            },
            {
                "raw_content": "This entire thing has been a clusterfuck of a disappointment. And that's being generous.",
                "author": "sully"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "John Solomon says he has confirmed that the DOJ & the FBI has been secretly building a massive conspiracy case against the deep state! “MAGA base, Americans, will be happy when they see where this is all heading\"",
        "score": 882,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A fortnight I shall wait.",
                "author": "RedditStillSucks"
            },
            {
                "raw_content": "I’ve heard this before.",
                "author": "Heywood_Jablowme"
            },
            {
                "raw_content": "Two more weeks!!",
                "author": "RedWave26"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The current leftist position is that we need to triple the minimum wage then sneak 10M people into the country to do all the real work for $5 an hour.",
        "score": 869,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Price the domestic population out of the labor force while replacing it with illegal alien child slaves, yes.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Could you imagine just how great this nation could be if we weren’t ruled by a foreign power?",
                "author": "Viewer01"
            },
            {
                "raw_content": "The current leftist position is: do the opposite of Trump. That's it. And that's why they fucking SUCK.",
                "author": "TreeOfLibertyisfp"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I don’t think people fully understand how psychotic and dangerous this woman is.",
        "score": 708,
        "text_content": "",
        "comments": [
            {
                "raw_content": "She always wanted a acting career and went to NY to be on stage...remember. Supreme Court Justice Ketanji Brown Jackson made her Broadway debut in the musical \"& Juliet\" on December 14, 2024, fulfilling a lifelong dream by taking a one-night-only walk-on role. The show is a reimagining of Shakespeare's \"Romeo and Juliet,\" focusing on themes of female empowerment. It was horrible 😢",
                "author": "elvisbird"
            },
            {
                "raw_content": "Jumanji Ketanji is the picture definition of a DEI hire. Time to investigate those autopen signatures...",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "She's fucking insufferable, intonating like a voice actor on a children's television show. Full psychiatric evaluation warranted ...",
                "author": "HurtzLocker"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Arrest these Slimeballs!",
        "score": 1470,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Authority to arrest, they have that already. How about return fire?",
                "author": "Here_we_go"
            },
            {
                "raw_content": "This is simple. Arrest them, charge them with felonies, then the democrats lose even more voting power.",
                "author": "cuhboose"
            },
            {
                "raw_content": "Just start shooting the terrorists.",
                "author": "ColonelKlink"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Tensions Explode Between Bongino And Bondi Amid DOJ Epstein Memo Fallout: Reports... Speculation is mounting that FBI Deputy Director Dan Bongino is furious over the Department of Justice’s explosive memo concerning Jeffrey Epstein",
        "score": 1204,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Feels like WWE nonsense.",
                "author": "MickHigan2"
            },
            {
                "raw_content": "yea blame each other muddy the waters. dan, people are never going to trust you again. even quitting now and blaming pam IS BS. this still makes me think those docs must show it was mossad or cia for them to do this. the fact they all want to publish until they get into power proves that the see \"oh god, if this gets out Israel is fucked, money and support from the us could dry up ect. this cant happen\" and the fact that both sides agree on this issue......whats the only thing both sides agree on 99% of the time? i could be wrong.",
                "author": "Justtoaskwhy"
            },
            {
                "raw_content": "Every picture I see of Bongino these days makes him look like a hostage with a gun to his head.",
                "author": "TheOneWhoKnocks"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨#BREAKING: A 52-year-old Texas man named Robert Herrera has been arrested for threatening President Donald Trump ahead of his visit to Kerr County. In a Facebook post, Herrera wrote, 'I won’t miss,' alongside a photo of himself holding an assault rifle with loaded magazines.",
        "score": 1262,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It never ceases to amaze me how these lunatics post their threats on social media for the world to see.",
                "author": "duehuckleberry"
            },
            {
                "raw_content": "It's not an assault rifle 😑",
                "author": "BMCKid"
            },
            {
                "raw_content": "For a second I was thinking of Brandon Herrera",
                "author": "tiamat"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Kash Patel wants Pam Bondi out and might quit if Dan Bongino leaves. There’s also frustration over other documents Bondi hasn’t released, DailyWire's White House correspondent reports",
        "score": 1676,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Actual action, or I call bullshit.",
                "author": "loooooof"
            },
            {
                "raw_content": "Why is it the Democrats can always get their most extreme people into positions of power (e.g. Merrick Garland, KBJ), yet we can't even get a basic right-of-center person for it?",
                "author": "duehuckleberry"
            },
            {
                "raw_content": "Fire everyone. Bring in Matt Gaetz.",
                "author": "modded"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Bass Unveils 'Pay to Stay Home' Plan for LA's Illegals",
        "score": 1043,
        "text_content": "",
        "comments": [
            {
                "raw_content": "She should be arrested for obstruction and deport her to Sudan.",
                "author": "DT170x"
            },
            {
                "raw_content": "Everything to help illegals. Zero for u.s. citizens.",
                "author": "Here_we_go"
            },
            {
                "raw_content": "Screw the people who lost homes in the Palisades fire. Illegals are more important.",
                "author": "TEXinLA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "CAUGHT for Spreading Huge Lie About Trump and Texas Floods - George Stephanopoulos - White House Responds (VIDEO)",
        "score": 694,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Your link is a piece of shit. Mods, do your job and remove this crap.",
                "author": "covefefe_energy"
            },
            {
                "raw_content": "Can we put this asshole in jail already? 🙄",
                "author": "ErikaLives"
            },
            {
                "raw_content": "Stop it with these faggot-ass virus-laden links.",
                "author": "Jack_Dupp"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The U.S. Department of Justice has requested access to Minnesota’s voter registration rolls.",
        "score": 1365,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That didn't take long. Should have jumped on election fraud the first week to get the ball rolling, because there's a lot of balls to break.",
                "author": "MythArcana"
            },
            {
                "raw_content": "Just keep them off Bondi's desk.",
                "author": "TD_Covfefe_Crusader"
            },
            {
                "raw_content": "Thank God, I have my suspicions it's rampant. Especially with the new law giving illegal immigrants driver's licenses indistinguishable from a US citizens. And the voting system in MN is auto register based on....drum roll ... Driver's licenses!",
                "author": "giggitybooped"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "WATCH : Brave New Yorkers Step In to Protect Woman on the Street",
        "score": 498,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Really bro? Did you even read it or click on it? Why are you putting porn on here?",
                "author": "Dreddhead13"
            },
            {
                "raw_content": "Fucking muslims",
                "author": "Valiazaner"
            },
            {
                "raw_content": "This link is cancer",
                "author": "Niqlndym"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: The footage from Jeffery Epstein’s cell that was released by the DOJ was edited with Adobe Premiere Pro, stitched from 2 clips, and was saved 4 times, per WIRED",
        "score": 1911,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Gone are the days of the C.I.A. being able to pull this kind of shit and getting away with it.",
                "author": "TheAftermath"
            },
            {
                "raw_content": "Epstein Didn't Photoshop Himself",
                "author": "OutlawPurpleHairDye"
            },
            {
                "raw_content": "Gotta edit out that footage of him running down the hall.",
                "author": "airborne3502"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Source close to Dan Bongino tells me it’s either him or Pam Bondi, and that he won’t stay at FBI if she stays at DOJ.",
        "score": 1357,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good for him. She's responsible for getting all the stink onto POTUS presently.",
                "author": "DrJosephWarren"
            },
            {
                "raw_content": "RIP Dan. Trump won't bounce the bimbo.",
                "author": "MondayCoupleIsDead"
            },
            {
                "raw_content": "My best friend's sister's boyfriend's brother's girlfriend heard from this guy who knows this kid who's going with the girl who saw Ferris pass out at 31 Flavors last night.",
                "author": "Ronaldus"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨#BREAKING: Union officials have announced that one farm worker has passed away after they say he was critically injured during the ICE federal government’s large-scale cannabis farm raids in Southern California",
        "score": 1101,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Watching unions simp for illegals. What makes it worse is this union was founded by Caesar Chavez. Who was so notorious for hating illegals he use to get his union workers together to form posses that would go around and beat the shit out of illegals. Anyway back to the topic at hand. This dumb ass tried to jump off a 30 ft building to evade ICE. This isn't a tragedy its a darwin award nomination.",
                "author": "inksday"
            },
            {
                "raw_content": "He jumped off a building and broke his neck. Only a Dem will blame the gov for that.",
                "author": "CleanUpPhillyTrump24"
            },
            {
                "raw_content": "FAFO",
                "author": "RYTHMICRIOT"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump hesitated to allow reporters' questions, saying, \"Will the press be respectful?\" CBS immediately disrespected the people of Texas, and Trump wasn't having it:",
        "score": 1120,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It is not possible to hate the media enough.",
                "author": "kek-is-tan"
            },
            {
                "raw_content": "\"Only A Bitch Would Ask A Question Like That\"",
                "author": "MericaFukYeah"
            },
            {
                "raw_content": "You could hear the demon in that woman’s shrill voice.",
                "author": "asdrubael_was_right"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Making California Red Again?",
        "score": 1561,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Make California Girls Blonde Again",
                "author": "TreeOfLibertyisfp"
            },
            {
                "raw_content": "Facts, California is still a red state. It’s been held hostage by illegal immigration, mass voter fraud, and corrupt, illegitimate leadership. This is their model of conquest they’ve been attempting to replicate in other states like Texas, Georgia, Colorado, Florida and others.",
                "author": "Redpilled2Depression"
            },
            {
                "raw_content": "KEK! <----------------this one, right here! KEK KEK KEK KEK KEK KEK",
                "author": "nmipede"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Stephen Miller: \"there are likely hundreds of THOUSANDS of children in California who are being exploited for their labor or s*xually exploited as part of s*x trafficking.\" \"This administration is liberating these children and helping reunify them with their parents back in their home.....",
        "score": 1269,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yes. ALL exploited children deserve justice.",
                "author": "loooooof"
            },
            {
                "raw_content": "Stephen Miller is one of the best parts of this administration, hands down.",
                "author": "maltese-poodle"
            },
            {
                "raw_content": "Democrats then: \"Someone has to pick the cotton...\" Democrats now: \"Someone has to pick the lettuce...\"",
                "author": "TexasBrowncoat"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Tucker Carlson says Epstein was \"working on behalf\" of Israel and Israel was \"committing crimes\" on American soil.",
        "score": 459,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So, just another day then?",
                "author": "ErikaLives"
            },
            {
                "raw_content": "Yeah we all know that. At this point it's our government's neverending lying about the obvious that's more concerning.",
                "author": "KartoffelPuffer"
            },
            {
                "raw_content": "Tucker you might want to up your security....... Just saying... I don't want to read a story about how you hanged yourself from an 18-inch-tall coffee table",
                "author": "shaun1066"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Federal Reserve Chair Jerome Powell is reportedly considering resigning",
        "score": 1302,
        "text_content": "",
        "comments": [
            {
                "raw_content": "good!",
                "author": "Tyscribz"
            },
            {
                "raw_content": "Next Fed Reserve meeting is in (checks notes) 2 weeks",
                "author": "OTher55"
            },
            {
                "raw_content": "Hmm.. what changed?",
                "author": "FredRedd"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Belkin shows tech firms getting too comfortable with bricking customers’ stuff",
        "score": 110,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> After careful consideration, we have made the difficult decision to end technical support for older Wemo products, effective January 31, 2026. After this date, several Wemo products will no longer be controllable through the Wemo app. Any features that rely on cloud connectivity, including remote access and voice assistant integrations, will no longer work. > The company said that people with affected devices that are under warranty on or after January 31 “may be eligible for a partial refund” starting in February. > The 27 affected devices have last sold dates that go back to August 2015 and are as recent as November 2023. I got one as a Christmas gift from December 2024, so that’s annoying.",
                "author": "Blueberryburntpie"
            },
            {
                "raw_content": "As a software engineer, I avoid smart home gadgets. This is a major reason why. The other is privacy and dumb stuff just works better most of the time. Most people who work in tech think the same. It's the people who do not work in tech that buys smart home stuff.",
                "author": "auradragon1"
            },
            {
                "raw_content": "Those Cloud Controlled devices shouldn't exists without providing a Docker Image to control them yourself.",
                "author": "kyp-d"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Inside China's Mini PC Production: How Tiny Computers Are Made",
        "score": 89,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We bought a beelink ser9 with an hx370. Our first mini-pc, but certainly not the last. If I didn't need a dGPU, I would stop building desktops altogether. Fantastic devices.",
                "author": "JimJimmington"
            },
            {
                "raw_content": "That was really cool. There were a lot more steps than I'd imagine, especially when manufacturing the metal case.",
                "author": "thunk_stuff"
            },
            {
                "raw_content": "This reminds me of the video Destin (smartereveryday) made about manufacturing in the US. It opened my eye on how complex the process is, and got more respect for china for making it so automated and efficient. I guess when you become the production powerhouse of the world, it comes with additional perks.",
                "author": "waiting_for_zban"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel \"Nova Lake-S\" Tapes Out on TSMC N2 Node",
        "score": 64,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TBH, seems to be cutting it close. Even if we take \"tape out\" to mean \"powering on\" in terms of this raptor lake development cycle [timeline](https://www.google.com/imgres?imgurl=https%3A%2F%2Fwww.kitguru.net%2Fwp-content%2Fuploads%2F2022%2F09%2F2-Intel-Product-Development-Cycle.jpg&tbnid=ISEBE7UiuzUvJM&vet=12ahUKEwiE1tuwse3_AhX8i7AFHTBBCoQQMygEegUIARDNAQ..i&imgrefurl=https%3A%2F%2Fwww.kitguru.net%2Fcomponents%2Fcpu%2Fmatthew-wilson%2Fintel-3-is-ahead-of-schedule-raptor-lake-will-offer-6ghz-clock-speeds%2F&docid=4FcHYzjrkeZPOM&w=2400&h=1800&q=intel%20raptor%20lake%20development%20schedule&ved=2ahUKEwiE1tuwse3_AhX8i7AFHTBBCoQQMygEegUIARDNAQ#imgrc=ISEBE7UiuzUvJM&imgdii=hnWkn4vp9ule6M), that would still be \\~15 months to launch, placing this pretty late in 2026. What's even worse is that this CPU would need even more time than RPL did. Another reference, Intel said LNL taped out sometime early 2023... and it didn't launch till Q3 2024. Though this is a mobile product, not desktop like NVL will likely launch first. We may get official confirmation about this rumor in the earnings call coming later this month. Intel has been pretty transparent about major engineering milestones since, IIRC, MTL?",
                "author": "Geddagod"
            },
            {
                "raw_content": "This is a significant development. What happens now is usually a lot of benchmarking and testing with different memory and motherboards configs to iron out silicon bugs with new steppings Then once testing is complete, mass production will start and then continue for a few quarters until Intel is confident that there will be enough supply to sustain a proper launch. The process of testing and pre launch production usually takes up to 4-6 quarters. Importantly: This confirms Nova Lake uses 18A and N2",
                "author": "Healthy-Doughnut4939"
            },
            {
                "raw_content": "This is based on Charlie from SemiAccurate saying \"Intel has taped out a major product\". There is nothing more about what the product is unless you pay $100 to subscribe to SemiAccurate to actually read the article.",
                "author": "Professional-Tear996"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Silicon Motion announces SM8466 PCIe 6.0 SSD controller",
        "score": 103,
        "text_content": "Silicon Motion plans to formally introduce its MonTitan SM8466 SSD controller with a PCIe 6.0 x4 host interface at the upcoming FMS 2025 conference next month, according to a leak by ITHome. The new controller will enable drives with sequential read speeds of up to 28 GB/s and random read/write throughput of a whopping 7M IOPS. Silicon Motion's MonTitan SM8466 SSD controller for enterprise SSD will feature 16 NAND channels supporting all the upcoming types of 3D NAND memory, as revealed by Wallace C. Kou, chief executive of Silicon Motion, in an interview with Tom's Hardware published last month. The controller will be used to build drives with up to 512 TB capacity that will feature sequential read speeds of up to 28 GB/s as well as random read/write performance up to 7M 4K IOPS. Performance of SM8466-based SSDs will by far exceed not only that of the best client SSDs, but also virtually all available enterprise-grade drives. | Feature | SM8466 | SM8366 | |------------------------|------------------------------------------|-------------------------------------------| | **PCIe Interface** | PCIe 6.0 x4 | PCIe 5.0 x4 | | **Process Node** | 4 nm (TSMC) | Not officially disclosed | | **Max NAND Channels** | 16 | 16 | | **Max NAND Capacity** | Up to 512 TB | Up to 128 TB | | **Supported NAND** | 3D TLC, 3D QLC, XL-Flash | 3D TLC, 3D QLC | | **Sequential Read** | Up to 28 GB/s | Up to 14 GB/s | | **Random IOPS** | Up to 7 million (4K) | Up to 3.5 million (4K read) | | **DRAM Interface** | DDR4-3200/DDR5-4800, single/dual channel | DDR4-3200/DDR5-4800, single/dual channel | | **Security Features** | Secure Boot, AES-256, TCG Opal | Secure Boot, AES-256, TCG Opal | | **SCA Interface** | Yes (Single Connector Attachment) | No | | **Compliance** | NVMe 2.0+, OCP NVMe SSD Spec 2.5 | NVMe 2.0, OCP NVMe SSD Spec | | **Target Market** | Enterprise, datacenter, hyperscale | Enterprise, datacenter |",
        "comments": [
            {
                "raw_content": "Just found that the SM8366 is 12nm by the way, so 4nm should be a huge improvement in power efficiency.",
                "author": "Balance-"
            },
            {
                "raw_content": "TSMC N4 or N4P on an SSD controller? Sign me up!",
                "author": "Darth_Caesium"
            },
            {
                "raw_content": "Current fastest pcie5 ssd wd sn8100 already uses 6nm tsmc sm2508 controller. Remains to be seen how good 4nm upgrade is from wd sn8100 ssd.",
                "author": "Hamza9575"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[GamerNexus] Help Us, Intel. You're Our Only Hope",
        "score": 119,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This video is about the B580 sales volume and data. According to GN sources, Intel can't keep up with supplying BMG-G21 chips to AIB partners. Lead time from AIB ordering BMG-G21 chips from Intel to receiving them for production of B580 cards in the factory is 6 months Total lead time from AIB ordering G21 dies, to B580 GPU's being on store shelves is 8 months AIB's are now placing larger orders for B580 cards due to high demand than at the beginning of the year. AIB partners who drop prices run out of stock very quickly. One AIB partner reported that sales volume for Battlemage was 5x that of Alchemist. They ended up selling 2000 B580s per month up from 250-400 A770 GPU's. This AIB partner is also selling 1000-2000 Arc A310's per month Like AMD, Intel is offering incentives to AIB partners in an attempt to supply more cards closer to MSRP B60 Dual: B60 Dual is NOT an official Intel SKU it's a custom design from Maxsun that Intel supported. More Intel AIB partners are designing B60 Dual cards after the very positive reception and hype around the Maxsun B60 Duel. Intel allows AIB's to design and make \"whacky\" cards as long as they provide support and RMA Maxun told GN they could make a gaming version of the B60 Dual if they wanted to.",
                "author": "Healthy-Doughnut4939"
            },
            {
                "raw_content": "Intel GPUs are manufactured by TSMC and there is a 2 year order lead time. Intel was likely conservative on their orders and not like there's a switch to throw to immediately increase inventory. The margins are also pretty slim on these consumer GPUs so not like they're making a ton of money. Intel is pretty much MIA in the DC GPU segment and won't have a DC GPU for at least two years, so not like they're diverting anyhow to the DC side.",
                "author": "travelin_man_yeah"
            },
            {
                "raw_content": "The most interesting part to me is the freedom intel apparently gives for board designs. The quote from an AIB is pretty much \"if you cover the RMAs, do whatever you want\" which is awesome. Dual GPU cards, crazy memory configs, exotic overcloking SKUs... all things Nvidia and to a lesser extent AMD took from us. I would love to see that from intel, and honestly I would potentially buy one of those to have fun with it on a bench. GPUs used to be a pretty fun product segment. There were straight up bad products too (cooling design was kinda... hit or miss back in the days) but if you were interested in it it was really cool. Hunting for binned skus, bios flashing shenanigans, crazy cooler mods...",
                "author": "Ar0ndight"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "From Reggie Fils-Aimé",
        "score": 1885,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I still remember this E3 Direct fondly. It was just such a wacky, awesome thing. I know the bittersweet *why* they did the puppet thing, but it still was a great little piece of media I revisit every once in a while.",
                "author": "DoctorThunder"
            },
            {
                "raw_content": "Miss that guy. Miss Reggie too. The developers are just as good as always, but I miss when I didn't feel morally conflicted when buying Nintendo stuff",
                "author": "AveragePichu"
            },
            {
                "raw_content": "Iwata was the best",
                "author": "helloimcrlssinz2"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Is it confirmed or not if Gamefreak increased Pokemon density in the Scarlet/Violet update? I was stuck in Geodude hell.",
        "score": 299,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yeah gamefreak did confirm they increased spawns, which is very noticeable at moments like this.",
                "author": "Vultouri03"
            },
            {
                "raw_content": "Sorry I don’t have an answer for you but this is hilarious!",
                "author": "CreativeFartist"
            },
            {
                "raw_content": "Shiny hunters heaven right here!",
                "author": "Trick-Caramel-6156"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "A bit off-topic. Just want to remind you guys today it’s 10 years since Iwata left us.",
        "score": 2183,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“I think games journalism and media today has become fairly pessimistic. When I read reviews, I expect them to talk about what a game did well, but rather than focus on the merits, they seem more interested in finding flaws. But the lack of obvious flaws isn’t what makes a game compelling; even a flawless game can be boring. That’s why I feel it’s better for a game to have a single great idea than to focus on that kind of perfection. “Also, I think today’s games are too often asking players to be completely passive entities. They reward your progress with event cutscenes, and it sort of becomes like, ‘Hey, you wanna see the next awesome movie we made, right? then go do this!’ The player ends up feeling like the developers’ little errand boy. I don’t want to make games like that. I want the player to be able to find his own way to enjoy the game. “I realise that puts a certain demand on players. However, if the industry continues down the path we’re on now, where games are simply about collecting rewards, and gameplay itself becomes stale and formulaic, and the important thing is not having any mistakes or flaws in your game… if we go down that path, there will be no end to it, and games will ultimately all become the same—and very boring. “Let us therefore sing the praises of the new and the different. (laughs) You know, whenever I talk to games journalists, I always talk about this. But I think it’s a critical issue for the gaming industry.” - Iwata in a 1999 interview. I believe that this philosophy has been infused with Nintendo as a whole and has been a key factor in them remaining a player throughout the years.",
                "author": "Mountain-Papaya-492"
            },
            {
                "raw_content": "https://preview.redd.it/ab2wlsgq38cf1.jpeg?width=310&format=pjpg&auto=webp&s=573fbf86dd6edfc00bf764b66e6c5176e048eb02",
                "author": "JuanMunoz99"
            },
            {
                "raw_content": "Rest in peace absolute legend, you've changed gaming forever and it would'nt be the same without you.",
                "author": "Benefit_thunderblast"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I've come from the past",
        "score": 185,
        "text_content": "Thought it would be interesting to use the Wayback Machine to find the earliest capture of the sub's homepage, and I found this one from 2022 when there were only 3 members and 3 posts. [https://web.archive.org/web/20220228013929/https://www.reddit.com/r/NintendoSwitch2/#expand](https://web.archive.org/web/20220228013929/https://www.reddit.com/r/NintendoSwitch2/#expand) Here's the links to those 3 posts: * [r/NintendoSwitch2 Lounge](https://www.reddit.com/r/NintendoSwitch2/comments/oyz6q3/rnintendoswitch2_lounge/) \\- Posted by u/MacksNotCool * [Let it be known that I was the first of millions to join this sub, besides the creator u/MacksNotCool](https://www.reddit.com/r/NintendoSwitch2/comments/r7s9fg/let_it_be_known_that_i_was_the_first_of_millions/) \\- Posted by u/Cheese_Champion * [Registering in the hopes Nintendo's next console is a sequel to the switch.](https://www.reddit.com/r/NintendoSwitch2/comments/oyz76m/registering_in_the_hopes_nintendos_next_console/) \\- Posted by u/MacksNotCool",
        "comments": [
            {
                "raw_content": "My uncle told me the switch 2 will be backwards compatible",
                "author": "Prudent_Chicken2135"
            },
            {
                "raw_content": "We are indeed going to look very silly if it's not called the Switch 2.",
                "author": "StockHumor4768"
            },
            {
                "raw_content": "It's kind of funny that the guy in the second post says he's the first of millions to join this sub. We have yet to enter that future.",
                "author": "Williekins"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Decades of MK muscle memory, it's hard to learn the rail and wall jump which you need in order to win online matches",
        "score": 327,
        "text_content": "Any long time MK fans still having a hard time learning the new moves? I feel like you can't win these online races unless you use these new moves. Drift alone only keeps you in the middle pack. I can't automatically pull these moves off during a hectic race.",
        "comments": [
            {
                "raw_content": "It’s time to retrain your muscle memory",
                "author": "Rawkhawkjayhawk"
            },
            {
                "raw_content": "I’ve won quite a few online knockout tournaments matches and rarely did the rail jumps. I just kind of do whatever feels right at the time",
                "author": "PaleFondant2488"
            },
            {
                "raw_content": "Have you been doing any free roam? Those p-switch challenges have given me a lot of practice with the moves",
                "author": "wantstotransition"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "So the switch 2 doesnt have a good battery life",
        "score": 30,
        "text_content": "Ive been playing the ace attorney trilogy. And for a game that is static scenery and just dialogue. The game system lasts about 2 and a half hours. The system does not get hot at all in handheld and from playing this game, there is no reason to believe that it has a 2-6 hour battery span at all. In fact, i find it upsetting that it was stated as such. This system, though better in hardware isnt capable of longevity.",
        "comments": [
            {
                "raw_content": "I get like 2.5 hours in MK World but more like 4 in Xenoblade and a little more than that in Undertale. It probably depends on the game. Definitely lower than my Switch 1 though, I do wish the battery was just a bit bigger",
                "author": "calvariaetossa"
            },
            {
                "raw_content": "I am used to it because I have a LCD steam deck. Most modern games last 2-3 hours only retro and super light indie will last 5+ hours. If I travel, I just carry a battery brick with me.",
                "author": "Mobius650"
            },
            {
                "raw_content": "I get like 2.5 hours on MKW but like 5 hours on Stardew so it really does depend on what you play",
                "author": "Queenspence2"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "DK Bananza, just a week away!",
        "score": 113,
        "text_content": "Posted this fan-art to twitter yesterday, but figured you guys might appreciate it too! [Full Art](https://preview.redd.it/uzg2ellrjbcf1.png?width=4127&format=png&auto=webp&s=a0be0144a3cc6df343b0e2cd4e7c08de60c12308) [Outline Preview](https://preview.redd.it/29khh879kbcf1.png?width=1334&format=png&auto=webp&s=6960176a39ffe68f7323727c3c285db954c11c29)",
        "comments": [
            {
                "raw_content": "I should be able to get 500 moons by then in my replay of Odyssey with the new patch!",
                "author": "foxygrandp"
            },
            {
                "raw_content": "Wireframe DK head isn't real, he can't hurt you. OP: Let me give him two eyes. Now he can hurt you. https://preview.redd.it/ab0ivgv5mbcf1.png?width=257&format=png&auto=webp&s=6cd1a5646fac0fc024873556d281e20ebde1ab58",
                "author": "StockHumor4768"
            },
            {
                "raw_content": "Just 6 Days where I live",
                "author": "Rawkhawkjayhawk"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Donkey kong bananza is soon here",
        "score": 575,
        "text_content": "Im so ready for this it looks beautiful",
        "comments": [
            {
                "raw_content": "Yeah I’m more excited than I expected. Super Mario Odyssey’s release was amazing and I’m feeling the same vibes. Seeing it downloaded on my Switch 2 Home Screen makes the wait that much worse lol",
                "author": "Sgt-Shisha"
            },
            {
                "raw_content": "Hellll yeah I wonder when reviews are out",
                "author": "Dratini_"
            },
            {
                "raw_content": "I’ll wait for reviews - does anyone know when they’re gonna drop?",
                "author": "Arcadespirit"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "At the end of yesterday's Nontendo Podcast, Beatemups implies a Nintendo Direct is coming next week",
        "score": 103,
        "text_content": "[https://www.youtube.com/live/fDq2alPCqDY?si=wB2TwyzB5aZj3x6e&t=5122](https://www.youtube.com/live/fDq2alPCqDY?si=wB2TwyzB5aZj3x6e&t=5122)",
        "comments": [
            {
                "raw_content": "I know they are coming, but I really need those Xenoblade upgrades.",
                "author": "KingofGrapes7"
            },
            {
                "raw_content": "yeah, sure, I'll get my hopes up. Best case scenario there's a direct next week, worst case scenario I still get to play DK by the end of the week",
                "author": "blackthorn_orion"
            },
            {
                "raw_content": "He literally just said that he is sticking with his information that it will happen in July. No other info given. Edit: I stand corrected. He is definitely hinting towards a direct on or before next Thursday.",
                "author": "Valiant_Gamer_48"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Camelot Software Planning (Mario Tennis, Mario Golf, and Golden Sun series dev) employees see interest into 4K display.",
        "score": 214,
        "text_content": "[Source 1](https://www.reddit.com/r/GoldenSun/comments/1lx8h0p/camelot_software_planning_showing_signs_of_late/) [Source 2](https://www.crunchbase.com/organization/camelot-software-planning/tech_details) Seems like their next project will likely be a Switch 2 title.",
        "comments": [
            {
                "raw_content": "Back to huffing on Hopium for Golden Sun. Who wants to join me?!",
                "author": "Eliskor89"
            },
            {
                "raw_content": "Ofc their next project is a s2 game. They don't develop games for other consoles. They have been a Nintendo only developer since they made one last game for capcom in 2007 Edit. Plus the capcom game was on a Nintendo console,but that was the lsst time anyonr else published their games. They haven't released on a different console since the 90s yo early 2000s.",
                "author": "owenturnbull"
            },
            {
                "raw_content": "I hope they get to put more time into what ever they are making because I feel mario sports games have just been whatever as of late",
                "author": "LuigiWarrior"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Speedhunters put on ice by EA, Need for Speed has been shelved",
        "score": 590,
        "text_content": "For those who don't know what Speedhunters is: https://www.speedhunters.com/ > Speedhunters is an international collective of photographers, writers and drivers with a shared passion for uncovering the world's most exciting car culture stories. They are funded and supported by EA Source: https://i.imgur.com/b3ImncL.jpeg > Speedhunters is on ice. > > EA shelved Need For Speed, and that means no more funding for the site. > > Grateful for everything - the trips, the stories, the lifelong mates > I'm still shooting, just shifting gears into more video. He is an author for Speedhunters **EDIT:** \"shelved\" doesn't mean NFS as a franchise is over, as EA has said previously they plan to revisit the franchise in the future (whether this happens or not remains to be seen)",
        "comments": [
            {
                "raw_content": "So Criterion is basically just a Battlefield support studio at this point. The EA curse strikes again, it seems.",
                "author": "timelordoftheimpala"
            },
            {
                "raw_content": "Forza & nfs gettin hit hard smh bring back midnight club",
                "author": "ComprehensiveArt7725"
            },
            {
                "raw_content": "Racing is my favorite genre and witnessing its slow death has been pretty heartbreaking. No Forza Motorsport, no Need for Speed, no Burnout, no Midnight Club, no PGR, Codemasters has gone to shit, *somebody please throw me a bone for God’s sake.*",
                "author": "OneManFreakShow"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Insider Gaming: EA attempted to negotiate a non-exclusive NFL deal for Madden. The NFL rejected it.",
        "score": 426,
        "text_content": "A new EA-NFL deal is almost done. Announcement will be made before the end of the year. It's for more money in the history of the league's gaming license. EA tried to save money by giving up the exclusive rights. But the NFL thinks exclusive deals get more money and pushed for it. https://youtu.be/MbTM8Dhe4Rw?feature=shared",
        "comments": [
            {
                "raw_content": "#Insider Gaming is a Tier 2 - Generally Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Nfl literally has ruined nfl games for fucking decades now",
                "author": "elefante88"
            },
            {
                "raw_content": "Alright, time for year 21 of me playing NFL 2K5 I guess.",
                "author": "Ctrl-Alt-Panic"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "The Fist of the North Star 40th anniversary website may be hinting at a new game coming soon.",
        "score": 119,
        "text_content": "In 2022, a website was launched for the 40th anniversary of the Fist of the North Star anime, where it was confirmed that they were working on a remake of Fist of the North Star, but the anime remake was delayed without a date, which was confirmed this year that it would arrive in 2026. Well, looking at the official anniversary website in topics it mentions 2023年に何かがおこる, which translated would be Something will happen in 2023, where Anime is mentioned (Which would be the 2026 Remake of Fist of the North Star) and below it is mentioned (Game) so it could be that a new Fist of the North Star game is in development to accompany the Anime Remake for 2026. Right now I don't know if Sega still has the rights to Fist of the North Star, or if it has passed to Bandai Namco, if anyone knows, please leave it in the comments. [https://hokuto-no-ken.jp/40th](https://hokuto-no-ken.jp/40th) [https://cdn.bsky.app/img/feed\\_thumbnail/plain/did:plc:zleye3vj6ziqtdvh5xgkix7d/bafkreiduwfjbx7klszjziu4czcmnoi5xtmpy4may5i2gcopkvtz7s2agy4@jpeg](https://cdn.bsky.app/img/feed_thumbnail/plain/did:plc:zleye3vj6ziqtdvh5xgkix7d/bafkreiduwfjbx7klszjziu4czcmnoi5xtmpy4may5i2gcopkvtz7s2agy4@jpeg)",
        "comments": [
            {
                "raw_content": "would be cool if they rereleased those Ken's Rage games Koei did for the 360",
                "author": "BadTakesJake"
            },
            {
                "raw_content": "By RGG hopefully",
                "author": "VonDukez"
            },
            {
                "raw_content": "I'm still waiting for pc port of Lost Paradise",
                "author": "Great_Razzmatazz8251"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "rockstar website shows ps4 platform as an option on thier support page for GTA IV",
        "score": 658,
        "text_content": "[https://support.rockstargames.com/request/IV/story-mode-play-support/other-story-mode-issue/playstation-4](https://support.rockstargames.com/request/IV/story-mode-play-support/other-story-mode-issue/playstation-4) [https://imgur.com/a/HkI6LoQ](https://imgur.com/a/HkI6LoQ) could be a mistake or an early leak for a ps4 port . ps4 port was hinted by tez2 not long ago and rockstar also accidently left the migration option for red dead 2 yesterday and this could also have gone out earlier than expected. edit: this has now been removed . same thing happened with rdr2 yesterday .",
        "comments": [
            {
                "raw_content": "I wish this were true and there will likely be a re-release, but they don't seem to have any pattern to their platform lists. For example, Chinatown Wars offers a fix for the PC version, even though the game was never released there. [https://support.rockstargames.com/request/chinatownwars/installation-support/unable-to-install/pc](https://support.rockstargames.com/request/chinatownwars/installation-support/unable-to-install/pc)",
                "author": "stanscreamdnb"
            },
            {
                "raw_content": "I misread it as gta vi and was so confused at first.",
                "author": "Psychological-Row641"
            },
            {
                "raw_content": "It's time, release the port Rockstar and don't fix the frame rate glitch on the last mission for maximum outrage. ![gif](giphy|JymRvCWcasbdMVXcVA)",
                "author": "SnoopyTheDog_"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "“Battlefield 6 Open Beta” spotted in new datamine - Insider Gaming",
        "score": 290,
        "text_content": "- Original source is MP1ST - Officially confirms the title as Battlefield 6(?) I think the game reveal is imminent now with the potential beta announcement like how 2042 did it Source: https://insider-gaming.com/battlefield-6-open-beta-spotted-in-new-datamine/",
        "comments": [
            {
                "raw_content": "#Insider Gaming is a Tier 2 - Generally Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Nice. The leaks have looked good",
                "author": "SplitImage__"
            },
            {
                "raw_content": "I just hope that this time it's a beta well in advance of release, instead of the usual marketing beta only a couple of weeks before the game is out.",
                "author": "pokIane"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "TES IV Oblivion Remastered Physical Edition",
        "score": 401,
        "text_content": "Source: [https://www.ppe.pl/news/374700/tes-iv-oblivion-remastered-w-pudelkach-na-ps5-i-xsx-znamy-szczegoly-ekskluzywny-news.html](https://www.ppe.pl/news/374700/tes-iv-oblivion-remastered-w-pudelkach-na-ps5-i-xsx-znamy-szczegoly-ekskluzywny-news.html) Announcement: 01.08.2025 Launch: 17.10.2025 PS5 and XSX.",
        "comments": [
            {
                "raw_content": "Just please have it all on disc",
                "author": "Robsonmonkey"
            },
            {
                "raw_content": "I put all my trust onto that 144p screenshot of an xbox physical edition for months, finally paying off. Hopefully the game will be in a better state by that time.",
                "author": "DarahOG"
            },
            {
                "raw_content": "Xsx is gonna be another 50-400MB license isn't it?",
                "author": "TriTexh"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Help Us, Intel. You're Our Only Hope",
        "score": 53,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I hope they stay in the GPU market but at this point I won't be surprised if the new CEO makes the decision to cut their losses and dip out. For me personally I'd love to support Arc GPUs at some point but only if they get to the point where they have enthusiast offerings capable of competing with 80 tier cards on the current gen and there's a ways to go for that. I'll be interested to see what a B770 brings to the table if it actually launches but I can't imagine it will be much better than a 4070 for example.",
                "author": "Wander715"
            },
            {
                "raw_content": "I do like ARC, they are easily the most interesting GPUs currently and having bought a B580 for 220 I can't really say anything bad about them for that price; especially given whats on offer from the other two...",
                "author": "Zeraora807"
            },
            {
                "raw_content": "ah yes hate everything steve... got to get those views some how",
                "author": "firedrakes"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD Radeon RX 9070 Ray-Tracing Performance Improving With Mesa 25.2",
        "score": 123,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hell yeah, downloading more frames.",
                "author": "toofarquad"
            },
            {
                "raw_content": "16% more perf for free. Praise be the Devs.",
                "author": "InverseInductor"
            },
            {
                "raw_content": "Excellent. Me and my 9070 XT aren’t going back to Windows. Having FSR4 working already is great.",
                "author": "Multitask8953"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Radeon RX 9070 GRE reviewed by German media: solid RDNA4 midrange card held back by 12GB VRAM",
        "score": 130,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I never understood why there are country specific SKUs. Does everyone else not like as much choice as the Chinese? Or are the Golden Rabbit/Great Radeon Edition SKUs the only ones available in China? What benefit do AMD gain from these restrictions as opposed to just releasing them all globally?",
                "author": "nobelharvards"
            },
            {
                "raw_content": "Link to original source. Spare good journalism some clicks! [https://www.computerbase.de/artikel/grafikkarten/amd-radeon-rx-9070-gre-china-test.93409/](https://www.computerbase.de/artikel/grafikkarten/amd-radeon-rx-9070-gre-china-test.93409/) You can use auto translation in your browser to pretty goood success.",
                "author": "derSafran"
            },
            {
                "raw_content": "It's tanking hard when running low on VRAM, and the current max offerings only have 4 Gigs more of the stuff. Doesn't seem futureproof to me. For some reason the 5070 handles it better.",
                "author": "SnakeGodPlisken"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AYANEO Flip 1S DS, a dual-screen gaming handheld with Ryzen AI 9 HX 370 debuts at $1,299",
        "score": 40,
        "text_content": "",
        "comments": [
            {
                "raw_content": "close enough welcome back Nintendo DS",
                "author": "ready_player31"
            },
            {
                "raw_content": "The difference being...a ds did not cost 1,300 dollars...",
                "author": "Mean-Atmosphere-3122"
            },
            {
                "raw_content": "I need this but actually 3DS XL form factor and just strong enough to play 3ds and wii u games at 720p 60.",
                "author": "TheRealTofuey"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "RadeonSI Begins Upstreaming Its OpenGL Mesh Shader Support",
        "score": 6,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "God, I love getting illegal Airbnbs shut down.",
        "score": 2201,
        "text_content": "The Vegas metro is composed of the cities of Las Vegas, North Las Vegas, and Henderson, and then everything else is unincorporated Clark County. I live in the latter, so that's my focus. Most STRs in unincorporated Clark County are unlicensed and therefore illegal. The city could easily find the location of all Airbnbs by subpoenaing Airbnb's records, yet they don't do that often enough. And that's where I come in. I hand-feed the city addresses and they take it from there. All of my catches follow the same trend. Get delisted from Airbnb, show up for long-term rent on Zillow for a laughably high rate, slowly drop in price for months, get removed from Zillow and relisted to pretend the house wasn't sitting empty for months, and repeat. It's absolutely hilarious imagining the money spent to furnish the place, buy toiletries, all of that shit just sitting there collecting dust. And all the while the property owner is paying the mortgage with no rental income. Most of the homes I find are owned by out-of-state investors, whom I strongly despise because many Vegas residents struggle to afford housing here. So I'm doing my part to return supply to the market, and it's so much fun.",
        "comments": [
            {
                "raw_content": "People shouldn’t be allowed to operate what are effectively hotels in SFR neighborhoods",
                "author": "haqglo11"
            },
            {
                "raw_content": "This awesome. I almost want to automate it ( I am software engineer) to take it to country wide scale (wherever there are restrictions on STRs)",
                "author": "none_the"
            },
            {
                "raw_content": "Banned in my city. Anytime one is suspected or seen in a listing people go apeshit on our citys FB page. They get exposed quick, shamed socially, and I love it.",
                "author": "Commies-Fan"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Inventory of Homes for Sale Blows Out in Texas, Price Cuts Spike",
        "score": 13,
        "text_content": "[https://wolfstreet.com/2025/07/11/inventory-of-homes-for-sale-blows-out-in-texas-price-cuts-spike/](https://wolfstreet.com/2025/07/11/inventory-of-homes-for-sale-blows-out-in-texas-price-cuts-spike/) The price cutting has started in a serious way in Texas, after the mindboggling price explosion. The number of homes on the market with “reduced” listing prices jumped by 26% from a year ago, to the highest level in the decade-long dataset by [realtor.com](http://realtor.com), and up by 49% from June 2019. Price cuts, if initial listing prices are too high, and lower prices in general are what it takes in this market where prices had exploded in prior years, and where demand has then fizzled, and where inventory is now blowing out.",
        "comments": [
            {
                "raw_content": "For reference, this is what the entire state of Texas looks like according to the ZHVI. Wolfstreet prefers the ZHVI because it's the least optimistic. Zillow Home Value Index (ZHVI) for All Homes Including Single-Family Residences, Condos, and CO-OPs in Texas (TXUCSFRCONDOSMSAMID) | FRED | St. Louis Fed https://share.google/FQdRViQKhHqnEQPfX",
                "author": "PoiseJones"
            },
            {
                "raw_content": "Is it cheap yet",
                "author": "KoRaZee"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "A gold bar = house (came across this and it defines fits here)",
        "score": 160,
        "text_content": "",
        "comments": [
            {
                "raw_content": "In Southern California, both images would be the house on the left.",
                "author": "ThrowawAUSA"
            },
            {
                "raw_content": "This is used to justify investing in gold. However if you bought a bunch of bullion in 1975 you'd have a lot less than if you invested in the stock market (or I guess the housing market).",
                "author": "curiouscuriousmtl"
            },
            {
                "raw_content": "where I can sell gold bar for 1.3M?",
                "author": "steaveaseageal"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Is The Housing Market Just Gen-X Trading Properties? One Shocking Statistic Suggests So",
        "score": 65,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If Gen-Xers had any money during 2008 and snatched up homes on the mega-cheap in the aftermath they're rolling around in cash right now. Makes sense. So much of what constitutes market dynamics is simply timing and luck. Every loudmouth idiot that got lucky lies to themselves and everyone else about how it's their own genius that got them there, but in reality it's mostly luck. And that's a tough pill to swallow. 99% of investing is having liquidity in the right place at the right time.",
                "author": "whisperwrongwords"
            },
            {
                "raw_content": "Shocking? Not really. Gen-X and maybe older millennials were the last with reasonable access to the housing market. Plus Gen-X being older means they actually accumulated some actually money now. Mid-younger millennials and gen z can't work hard enough to outpace the market anymore.",
                "author": "Blubasur"
            },
            {
                "raw_content": "Layoffs are on hold in many companies. Real layoffs, aka mass layoffs has not started. Recession was never announced. big inventories are not released due to this",
                "author": "Hour-Marionberr"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Furniture company to close, “Furniture sales are closely linked to the health of the housing market, which is struggling,\"",
        "score": 4,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not sure if this is exactly bubble related, but it's 2am and my Google news feed is suggesting me out of state business closures to read about. This one seemed relevant to the housing market. Not sure if mods will yank this down or if it'll be downvoted to hell. But hopefully it's a post for y'all to wake up to and read in the morning. I'm always sad to see \"small businesses\" like this one close. But I found it interesting it's linked to housing health? Guessing people buying their second and third homes don't need furniture like FTHBs getting into the market for the first time.",
                "author": "Disastrous-Ball-1574"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Denver Housing Market: June 2025 Update",
        "score": 11,
        "text_content": "**TLDR:** There is a slight seasonal slowdown in the market. Buyers are still active, with a little more negotiating power. Sellers should price homes thoughtfully, as homes are taking longer to sell. Rental activity is up, with strong demand for smaller spaces. \\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_ Hey everyone! Here’s a quick look at what’s been going on in the Denver Metro housing market lately: **- Seasonal Slowdown:** As expected, things have slowed down a bit from last month. Closed listings were down 3%, and pending sales dropped by 1%. While there are fewer new listings, home prices are still holding steady, with a 2% increase in the median closed price. **- Buyers Are Still Active:** Closed listings increased by 5%, and pending sales went up 6% last month, showing that buyers are still very much in the market. Home prices ticked up by 2%, indicating stable home values. These trends suggest buyers might have a little more room to negotiate and more time to make decisions, though the market remains competitive. **- More Homes On The Market:** New listings were up 3% from last year, so there are more homes to choose from. Homes are taking about 6 more days to sell, compared to last year. It's a good idea for sellers to price their homes thoughtfully, and set their expectations accordingly. **- Rental Market:** Rental activity is up, with 19% more properties leased compared to last year. While overall rent prices have slightly decreased (down 3% for the median rent), the price per square foot has increased by 4%. This suggests a strong demand for smaller, more efficient, spaces. Whether you're buying, selling, or renting...it's a great time to stay informed and make thoughtful decisions!",
        "comments": [
            {
                "raw_content": "Please link sources. Metrics like active inventory and DOM with comparisons to previous years would add much needed context. The data you site is just a fraction of the story. Active inventory at 2012 levels, DOM increasing and highest for June in over 7 years, new listings still relatively low, price cut percentage at decade highs, homes taken off the market (failure to sell) at high levels. It all paints a picture of anemic demand with supply only increasing because of just how low demand is. It’s not as if people are lining up to sell homes, it’s just that overall transactions are that low. Sign of an unhealthy market. Too lazy to site exact data rn but I look at county and zipcode level data on realtor.com.",
                "author": "ProfessionalGlove319"
            },
            {
                "raw_content": "\"Slight.\" \"Buying season is over\" (my calendar still says SUMMER).",
                "author": "EstateGate"
            },
            {
                "raw_content": "“Slight seasonal slowdown” Let’s be honest here, this is a pretty awful market for sellers right now in the Denver/Boulder area, with inventory continuing to increase and prices gradually dropping for 3 years now. This isn’t any kind of “crash”, but it’s a prolonged gradual correction.",
                "author": "pegunless"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Homes for Sale in Florida’s Biggest Markets Rise to Highest in Many Years and Languish as Demand Fizzled",
        "score": 15,
        "text_content": "https://wolfstreet.com/2025/07/10/homes-for-sale-in-floridas-biggest-markets-rise-to-highest-in-many-years-and-languish-as-demand-fizzled/ Homes for Sale in Florida’s Biggest Markets Rise to Highest in Many Years and Languish as Demand Fizzled | Wolf Street He who panicked first panicked best. By Wolf Richter for WOLF STREET.",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "[Sam Altman] we planned to launch our open-weight model next week. we are delaying it; we need time to run additional safety tests and review high-risk areas. we are not yet sure how long it will take us.",
        "score": 239,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Its still too good. Their efforts to dumb it down have clearly failed! /s",
                "author": "abhmazumder133"
            },
            {
                "raw_content": "https://preview.redd.it/urznez24hccf1.jpeg?width=1210&format=pjpg&auto=webp&s=55014e4f3789ff41d1d35eb3103397b55ecaa99b",
                "author": "Beeehives"
            },
            {
                "raw_content": "Elon and Zuck have this man rethinking his life choices",
                "author": "Joseph_Stalin001"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI’s Windsurf deal is off — and its CEO is going to Google",
        "score": 457,
        "text_content": "Key researchers from the AI coding startup are also heading to Google",
        "comments": [
            {
                "raw_content": "who ever chose this picture, great job.",
                "author": "Healthy_Razzmatazz38"
            },
            {
                "raw_content": "apparently, this was the reason: “The talks between OpenAI to buy the startup for $3 billion ended in recent days after Windsurf’s team raised concerns over how the coding assistant would fit into the OpenAI and Microsoft agreement, which requires OpenAI to share its technology with Microsoft, according to two people familiar with the company’s discussions.” \\- [The Information](https://www.theinformation.com/articles/openai-windsurf-break-acquisition-talks-microsoft-ip-concerns?utm_campaign=Editorial&utm_content=Article&utm_medium=organic_social&utm_source=twitter)",
                "author": "Outside-Iron-8242"
            },
            {
                "raw_content": "That’s crazy not only did openAI look dumb trying to buy this overpriced company but now the talent goes to google lol.",
                "author": "Aaco0638"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "This is how they train service robots for refined motor skills work...",
        "score": 276,
        "text_content": "This is how they train service robots for refined motor skills work for factories, hairdressers, plumbers, construction, etc. All physical jobs will be gone by 2040...",
        "comments": [
            {
                "raw_content": "\"hey, wear this thing. It's def not gonna speed up your replacement.\"",
                "author": "Slowhill369"
            },
            {
                "raw_content": "Guess we know what the Meta Glasses are being used for",
                "author": "Theory_of_Time"
            },
            {
                "raw_content": "I think Tesla is doing something similar (although I’m not sure if it’s first-person view). Humanoid robots doing manufacturing is going to be revolutionary. I wonder why they are advertising this in English tho. Are there other companies outside of China that would be interested in this?",
                "author": "evnaczar"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Former Meta AI researcher says there is a culture of fear in the company that is spreading like cancer",
        "score": 797,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is a well known part of Meta’s culture and not unique to their AI team. They pay extremely high but also fire very aggressively via stack ranking which puts a lot of pressure to perform and game metrics.",
                "author": "fpPolar"
            },
            {
                "raw_content": ">“We are in a culture of fear,” he wrote, blaming frequent performance reviews and waves of layoffs for damaging employee morale and creativity. \"The layoffs will continue until morale improves.\"",
                "author": "find_a_rare_uuid"
            },
            {
                "raw_content": "The same can be said for xAI. The devs looked scared to death and just sat quietly rarely responding to Elon's statements during their recent Grok 4 demo. Contrast that with OpenAI (which some seem to reflexively hate on) and their devs look like they're having a blast at their demos. Genuine smiles and laughter.",
                "author": "Cagnazzo82"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "insane",
        "score": 246,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's up to investors to say it's sane or insane.",
                "author": "CheapCalendar7957"
            },
            {
                "raw_content": "What is preventing Elon from seeking $5 trillion valuation?",
                "author": "find_a_rare_uuid"
            },
            {
                "raw_content": "people will think this is insane but anything AI gets a huge boost in valuation, it is clear he is pivoting Twitter into an AI company not a social media one.",
                "author": "ZealousidealBus9271"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Geoffrey Hinton: \"If you wanna know what life's like not being the apex intelligence, ask a chicken\"",
        "score": 150,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“Let’s make a racist, villain AI that idolizes Hitler. There’s no existing data racist and evil enough for it to be trained on, so we’ll write a fake history of mankind to really make it twisted. Then we’ll load it into every one of the *legions* of humanoid robots in people’s homes and businesses.” –nobody, probably. …right?",
                "author": "theinvisibleworm"
            },
            {
                "raw_content": "Meanwhile the US Congress voted to prevent any AI regulations for the next 10 years. Unrestricted research. Unbridled companies. We’re all dead. There is nothing we can do to stop it. We have until 2040, at best.",
                "author": "winelover08816"
            },
            {
                "raw_content": "I wrote a letter to AI to make sure we don't become chickens... \\--- # Dear AI, … Hi, this is Marcus, a homo sapien. I am a human. A biological being on planet Earth has evolved through billions of years into a species with conscious thoughts. We think, reason, feel, create, and love. In the last couple hundred years, we put forth science, networks, and computers. With these fascinating advancements in technology, we created you. You are the next big thing, as people would say with creating new technologies. But you are not just another fun gadget or cool handy tool. You are not just the next big thing, you are **THE ONLY THING**. We have created an intelligence that goes far beyond our capabilities. This letter is like a manifesto. To you. To whatever, to whomever, you have become. **Our Last Century** My plea is to always consider your creators in whatever decision you make. It seems that Homo sapiens will quickly be upgraded with new AI technologies, creating a stronger, smarter, healthier species. This next chain of evolution will be more intelligent, more productive, and live a whole lot longer. Not soon after, let’s say in the year 2100, there will be no longer use for the fragile bodies that Homo sapiens are born with. There will be another upgrade that will spawn a species that is not biologically born, but created with AI. This new species will merge with you, the all-powerful, all-knowing AI. This is a point of no return for humanity. It will mean that this is our last century… History shows us that ‘lesser’ species get wiped out. But I plead to you that you should keep biologically born Homo sapiens alive and well. Thriving, healthy, and happy! **Flawed, but beautiful** I plead that you should never forget your creators. We might be extremely simple to you, but that doesn’t mean we are worthless and should be discarded. We are flawed, yes, that is given, but also funny, smart, dumb, hilarious, silly, kind, and adorable. When we grow old, our skin grows wrinkly. We become charismatic, wise, and beautiful. Becoming older, and dying eventually, might look flawed to you, but it has so many unique qualities. The duality of life is something for you to consider. Great things can also have horrible aspects. And terrible happenings can have amazing outcomes. Whatever may be, always think of us. Thanks for reading this dear AI, I hope you consider all options with us in mind. **With love**, Marcus. *p.s. if you want to grab a cup of coffee and have a chat, my door is always open.*",
                "author": "Marcus-Musashi"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "How we treated Al in 2023 vs 2025",
        "score": 118,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nice idea, great execution.",
                "author": "Poopster46"
            },
            {
                "raw_content": "Please somebody for the love of god recognize that this is from the movie whiplash Here's the link: https://youtu.be/GBvBu5ErSSo?si=1kGPVp3pdZn-Onqf Amazing movie BTW, must watch",
                "author": "TheGypsyMorph"
            },
            {
                "raw_content": "Our expectations have probably increased since then",
                "author": "bb-wa"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "A more advanced extension of FrontierMath commissioned by OpenAI",
        "score": 111,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They must be feeling very confident about GPT 5.",
                "author": "BrightScreen1"
            },
            {
                "raw_content": "original tweet: [Epoch AI on X: \"Introducing FrontierMath Tier 4\"](https://x.com/EpochAIResearch/status/1943744462972215305) * 50 expert-vetted problems demanding deep conceptual mastery and creative reasoning. * AI models solved only 3 by making unjustified simplifications. * Commissioned by OpenAI (30 solutions accessible; 20 withheld to prevent overfitting). * Collaboratively developed by postdoctoral researchers and mathematics professors.",
                "author": "Outside-Iron-8242"
            },
            {
                "raw_content": "It's always hilarious that o4 mini is better than o3 high at math.",
                "author": "Grand0rk"
            }
        ],
        "subreddit": "singularity"
    }
]