[
    {
        "post_name": "🚨 introducing http://DaycareData.com 👨🏻‍💻",
        "score": 673,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://daycaredata.com/ Damn... My state is not listed.",
                "author": "Bots_Play_Here"
            },
            {
                "raw_content": "Who would let some inbred Somali look after their kid? wtf",
                "author": "Steelers-Fans-Suck"
            },
            {
                "raw_content": "Be careful, the Somalis might call the police if you investigate their crimes.",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Somali run Columbus Ohio “daycare\" is a smoke shop",
        "score": 572,
        "text_content": "",
        "comments": [
            {
                "raw_content": "As a Minnesotan that has had to deal with Somalians for decades, I can tell you that they bring NOTHING but fraud, crime, hate, entitlement, and racism. Fraud and theft is a hustle for Somalians and they are proud of it. No seriously, take a look. Source: https://m.youtube.com/watch?v=GZznVGLpJ_4 1 in 2 of them commit fraud. The other half don't talk about it. Source: https://patriots.win/p/1ARKEU4KMH/official-statistics-finally-rele/c Spreading Islam and having us take care of them through the taxation of non Muslims is their end goal. Source: https://patriots.win/p/17sPFoWqet/feel-the-entitlement-oozing-out-/c",
                "author": "MissingTrump"
            },
            {
                "raw_content": "The street view photo is over a year old. The license began in October of this year.",
                "author": "bobsmith67"
            },
            {
                "raw_content": "Send the US Marshals, seize all vehicules, properties and cash while investigating, then detain and deport all non-citizens",
                "author": "Monsieur_Novembre"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Quality Meme",
        "score": 215,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Solid fucking gold. This is why the left cannot meme: Memes are only funny because they are true & the left dies in the light of truth. Best use of this format of all time, even though it breaks the format, it is novel & one-off. Fantastic meme. Credit to whoever made it.",
                "author": "realPixelDust"
            },
            {
                "raw_content": "Why the fuck are daycare centers getting tax dollars anyway? The real ones charge a shitload.",
                "author": "WheresMyStimmy"
            },
            {
                "raw_content": "The other real threat is what is actually in those daycares? From giant stashes of cash, to weapons, illicit servers, ballot printing operations, drug factories, bomb factories, bio weapons labs, child smuggling safe houses... the fraud is just on the surface. What is going on inside the daycares? You would think Somalis will rent those empty spaces out for more cash to the highest bidder to maximize the grift. Even worse other criminal and terrorist groups knowing Somalis have untouchable facilities like this may compel or incentivize them to use the spaces. Every fraud based land and facility grab like this is a potential enemy base of operations. Democrats think this is how they are going to get the money to beat Trump but they are setting up staging grounds for the most devastating attacks on American soil.",
                "author": "saltyviewer123"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Reddit mods on r/Minnesota are censoring conversations about Somali fraud in the state.",
        "score": 1039,
        "text_content": "",
        "comments": [
            {
                "raw_content": "how do their shareholders feel about that?",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Reddit used to be great in the beginning, then people's tranny kids took over the site.",
                "author": "PiratePatriotParrot"
            },
            {
                "raw_content": "Locking the comments because this topic has the potential to disrupt the NPC programming.",
                "author": "0Sum"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"Worst part about the foreigner fraud is that they send the money to the third world. Rather than spend it here, where at least we could cope by saying it’s a Keynesian stimulus. Now? Pure looting. Time to tax remittances and ban them outright.\"",
        "score": 946,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Minnesota was probably single handedly financing Al-Shabab. Minnesota fraudsters are complicit in mass slaughter of Christians and others in Africa.",
                "author": "Th3Cho0sing0ne"
            },
            {
                "raw_content": "The final phase of the fall of an empire is the looting of the treasury",
                "author": "South_Florida_Guy"
            },
            {
                "raw_content": "Cerno bitch is a fag, but I agree that we need to tax all overseas remittances.",
                "author": "GuerillaYourDreams"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Nick Shirley's next project",
        "score": 629,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Whoever made that sign definitely went to the Quality Learing Center",
                "author": "Zskills"
            },
            {
                "raw_content": "Oh hey, another day went by and no arrests. Imagine that.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Enough Work Around The Country To Keep Him Busy Until He's Ninety.",
                "author": "MericaFukYeah"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The depth of his betrayal may go as far as passing nuclear secrets to the Chinese. I reported on this during the election campaign, and the accusation still hasn't been properly investigated. It was made by a fellow National Guard soldier and should be treated as credible.",
        "score": 830,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So did Fang Fang service Mr. Waltz?",
                "author": "Oldman69"
            },
            {
                "raw_content": "There's no statute of limitations for treason",
                "author": "South_Florida_Guy"
            },
            {
                "raw_content": "This man was almost vice president. That was not an accident.",
                "author": "Iransofaraway"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🥤🎨 purple drank is safe for now",
        "score": 833,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# IT'S # WHAT # PLANTS # CRAVE!",
                "author": "FatigueIsReaI"
            },
            {
                "raw_content": "Can we ban industrial oils next?",
                "author": "tpactionchasethevote"
            },
            {
                "raw_content": "It's long passed time to remove these idiots from the benches.",
                "author": "ColonelKlink"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "It's called theft",
        "score": 600,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Well, he is a pedophile alien.",
                "author": "projectarcturus1"
            },
            {
                "raw_content": "why isn’t he wearing a stolen dress?",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Bald Matt Damon scares me.",
                "author": "boredrandomguy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🧼 It's a legitimate business...",
        "score": 520,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Minnesomalia 👌🏻",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "AI does a pretty good job of duplicating those garbage people.",
                "author": "2Clutch"
            },
            {
                "raw_content": "It’s spelled “Laudering” in Minnesota",
                "author": "awsure"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This week …",
        "score": 1393,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Only 3.2 million ... I see they're needing a summer cottage.",
                "author": "Th3Cho0sing0ne"
            },
            {
                "raw_content": "Honestly even the memes are making me pissed off. I want coordinated 3 a.m. fed raids with MP5s dragging these scumbags out and getting mugshots for everyone involved. They raided Trump's house and all their political opponents for bullshit and dragged them through court. It's like youtubers are doing more to expose this shit than the professionals.",
                "author": "Beat_to_Quarters"
            },
            {
                "raw_content": "Did they file business tax returns ? How about they audit the Certified Public Accountants in Minnesota and offer them a deal that if they come clean on their \"reservations\" for suspect clinics and daycare centers they happen do financials for their businesses dodge a federal forensic audit of all their clients. This way they can also catch the Somalis for Tax Evasion, which is the greatest cardinal sin in America.",
                "author": "BidenShowerDrool"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Soon",
        "score": 670,
        "text_content": "",
        "comments": [
            {
                "raw_content": "**HOW SOON IS NOW** ~The Faggots~",
                "author": "FatigueIsReaI"
            },
            {
                "raw_content": "LoLs",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Do you know why she’s still married? Well, a panderer married a philanderer. And they’re both prostitutes. Nobody steal this because it’s part of my comedy routine.",
                "author": "GuerillaYourDreams"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Dumber than me",
        "score": 1049,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good one.",
                "author": "FusionBlack"
            },
            {
                "raw_content": "Pedo faggot that installed through massive fraud.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "Walz is like an elemental retard. You can’t break it down any further.",
                "author": "MedicallyReddit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Same fraud in Idaho. It’s all over.",
        "score": 1384,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They have to go back. They have to leave. Driven into the sea. I don't care anymore. Tired of this shit.",
                "author": "learntocode"
            },
            {
                "raw_content": "If this isn't halted everywhere under Trump, the commies will have bought enough voters to install another rogue president and it'll all be over for you. Just like the UK.",
                "author": "Saxonlady"
            },
            {
                "raw_content": "Can't do any arrests. We don't want to come across as racist.",
                "author": "vote_for_MAGA_2020"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "First the horses, now with the Somalis. I thought Creepy Kane was bad. This dude is the modern day John Wayne Gayce.",
        "score": 1106,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Copy Pasta * SO NO ONE TOLD YOU LIFE WAS GONNA BE THIS WAYYY * Gunshot * Gunshot * Gunshot * Gunshot * Gunshot * You're hooked on crack and smack, * and your welfare's late today! * The car you stole is stuck in second gear.... * and your baby's daddy won't get out for another 5 yeeeaaars! Spez: The Somalis are Muslim in show and cloths only, drug use / prostitution / thug life is rampant in their community.",
                "author": "footinmouth"
            },
            {
                "raw_content": "N",
                "author": "vote_for_MAGA_2020"
            },
            {
                "raw_content": "Triangle Heads... ASSEMBLE!",
                "author": "Th3Cho0sing0ne"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Strong GDP And Rising Profits Set Up A Resilient US Economy For 2026 https://www.forbes.com/sites/bill_stone/2025/12/28/strong-gdp-and-rising-profits-set-up-a-resilient-us-economy-for-2026/",
        "score": 784,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Strong by traditional terms isn't sufficient. Prices need to drop. Fairly significantly. Stopping the bleeding isn't the same as replenishing the blood.",
                "author": "Throwingway22"
            },
            {
                "raw_content": "I don't think people on here realize how fucked up Obama messed with the US economy for 4 years ... the amount of illegals and fraud that happened, that mother fucker needs to be six feet deep via treason",
                "author": "h203h"
            },
            {
                "raw_content": "100 times out of 100, when any boomer, politician, businessman, or tv personality talks about \"the economy\", they are talking about GDP, i.e. the stock market. But to the average person, \"the economy\" = affordability. I.e. your ability to get a job, pay your bills, buy groceries, and/or live comfortably. These two groups of people are using the same words, but talking about completely different things.",
                "author": "starjello"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Batshit Pelosi insists Dems don’t seek to impeach Trump a third time, says prez forced them to previously",
        "score": 942,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Forced them, like when he forced the steering wheel of The Beast?",
                "author": "howabsolutelydareyou"
            },
            {
                "raw_content": "Trump's fault they impeached Trump... LOL",
                "author": "sorrytodisagree"
            },
            {
                "raw_content": "They've already filed paperwork.",
                "author": "MrMcGreenGenes"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Somali Fraud...With Help.",
        "score": 618,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm OK with executions....",
                "author": "Tikk"
            },
            {
                "raw_content": "They all had help from operatives working for multiple NGOs and Democrats at all levels of government.",
                "author": "KEK_1776_KEK"
            },
            {
                "raw_content": "Empty every mosque",
                "author": "josiborg"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Kash Patel threatens Somali scammers with denaturalization, deportation over uncovered Minnesota fraud: ‘Tip of a very large iceberg’",
        "score": 1291,
        "text_content": "",
        "comments": [
            {
                "raw_content": "ALL MONEY TO MINNESOTA needs to be STOPPED until we can figure out what is going on.",
                "author": "Marina"
            },
            {
                "raw_content": "Stop threatening and FUCKING DO IT GODDAMMIT! If you're just going to be all talk then fucking deport yourself.",
                "author": "ingrowntoenail"
            },
            {
                "raw_content": "threaten in one hand, shit in the other see which fills up first",
                "author": "Retard_Strength"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Elon Musk accuses politicians who are mass importing Islamists of wanting to EXTERMINATE the white population",
        "score": 551,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Elon would rather exterminate the white race with Indians.",
                "author": "LBTrumplican2"
            },
            {
                "raw_content": "",
                "author": ""
            },
            {
                "raw_content": "He wants an arrest warrant in the UK.",
                "author": "PMSocks"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "AI Data Centers Demand More Than Copper Can Deliver",
        "score": 232,
        "text_content": "",
        "comments": [
            {
                "raw_content": "they're acting like this is a new & novel phenomenon unless I'm missing something?",
                "author": "hi_im_bored13"
            },
            {
                "raw_content": "I worked in telecommunications up until 2015. Radio is just signalling, all data is just signaling. A cmts sends data over copper wire using signals, with channels and all. Ethernet negotiated a signal. So what’s different about this? The extreme frequency: terrahertz. These signals only travel centimeters. There’s a standard for it already: [IEEE 802.15.3d](https://standards.ieee.org/ieee/802.15.3d/6648/) It can theoretically be used for things like cpu interconnects, and in this article it’s proposed for gpu interconnects.",
                "author": "kwirky88"
            },
            {
                "raw_content": "All this just to create brainrot",
                "author": "Mordho"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Snapdragon X2 Elite Extreme Benchmarks Highlight Impressive CPU Performance but Underwhelming GPU [TechPowerup]",
        "score": 2,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Snapdragon and bad naming schemes... name a better duo.",
                "author": "Urcinza"
            },
            {
                "raw_content": "I also found an even crazier benchmark from [Tweakers](https://tweakers.net/reviews/13834/qualcomm-snapdragon-x2-elite-moeten-amd-en-intel-zich-zorgen-maken.html), a Dutch tech website; the CPU's out there trading blows with desktop CPUs like Ryzen 9 9900X and Intel 265K",
                "author": "LastChancellor"
            },
            {
                "raw_content": "Apple M Max class CPU mated to a base M class GPU. Who is this SoC for? Surely, most professionals would find a powerful GPU more useful than a powerful CPU?",
                "author": "Forsaken_Arm5698"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Hardware Canucks] They understood the assignment - HAVN BF 360 review",
        "score": 19,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Was going to buy this case when it was first shown but it took a bit too long to come to market, so got something else. But it seems really good",
                "author": "Ar0ndight"
            },
            {
                "raw_content": "A good airflow chassis with an decent count of 3.5 bays. Though one question I still have going is: Why did this or the Torrent use 180 instead of 200mm fans when there was already a good number of designs supporting the latter?",
                "author": "Jeep-Eep"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nier Automata Switch 2 version incoming?",
        "score": 186,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I keep assuming anything that is on sale of late is probably getting a Switch 2 patch. I know I'm being way over optimistic but yeah. *Looks longingly at Dark Souls Remastered*",
                "author": "rgumai"
            },
            {
                "raw_content": "60fps and I’ll buy it. I promise",
                "author": "peter-man-hello"
            },
            {
                "raw_content": "Tempted to get the game for $20 on sale now but keep seeing internet people come down on the 30fps on switch. What do you think for the switch version? Never played it but played astral chain and loved it.",
                "author": "Professor1G"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Pikmin 3 Deluxe rated for Switch 2 in Europe",
        "score": 241,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/5utwirecmz9g1.jpeg?width=1352&format=pjpg&auto=webp&s=15dc3d41904582d556a3034d408673ec43edf2b8 Looks like \"free update\" games have PEGI ratings for Switch 2, so this doesn't mean a Switch 2 Edition or anything. ...What it *does* mean is that we're finally going to get wave 2 of the free game upgrades.",
                "author": "SomeBoxofSpoons"
            },
            {
                "raw_content": "Such an odd choice, Pikmin 4 seems like the logical first. But I guess you can't try to predict Nintendo with logic lol edit: perhaps this indicates Pikmin 4 will receive a proper upgrade pack with new content and Pikmin 3 Deluxe is just receiving a free resolution patch as a form of housekeeping",
                "author": "bensastian"
            },
            {
                "raw_content": "Seems like Nintendo is going to release SW2 editions for a long time. I wasn't expecting Pikmin 3 to get one.",
                "author": "Alanmurilo22"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Feels good man",
        "score": 217,
        "text_content": "Used crimbas money to finally kill that lingering anxiety that uninstalling games gives me. No worries for at least a year",
        "comments": [
            {
                "raw_content": "He got storage for days",
                "author": "WolfenWZRD"
            },
            {
                "raw_content": "So much room for activities!",
                "author": "EazeeP"
            },
            {
                "raw_content": "I got the samsung p9 express 256GB because it's just $33. By the time i actually need more than that, there will probably be the OLED model with 512GB internal storage and then i'll be set.",
                "author": "FierceDeityKong"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "What a game!",
        "score": 137,
        "text_content": "The last Tomb Raider I played was the original Tomb Raider 2 on PC. Just completed this on my Switch 2 and I loved it! Gameplay was fun, graphics were great considering it’s an old game and for only £16. Nothing more to say 😁",
        "comments": [
            {
                "raw_content": "It’s a great game for sure. Hopefully Rise will come to Switch 2 for people to experience as well. It’s even better.",
                "author": "LiarInGlass"
            },
            {
                "raw_content": "Very good game series, one of my favorite ever. I definitely recommend you play the other ones, and if you have any console and I mean (PS4, PS5, Xbox One, Xbox Series) or access to PC, please play it on one of those instead. The port (at least on Switch 2, on Switch 1, they couldn't have really done better) is lazy and we really need Aspyr to put more effort into this amazing trilogy and one of the most influential and important figures in gaming. I'm not here to start hate, but I'm tired of the Switch 2 getting lazy ports when we all can see how capable it is. It feeds the negativity and it makes these good games look like a shell of what they could be.",
                "author": "khironinja"
            },
            {
                "raw_content": "Yea is one if my favorite. Short and sweet as well",
                "author": "iWentRogue"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I didn't need to spend 60 hours with Donkey Kong Bananza for it to be my game of the year, but I'm convinced it's one of the greatest platformers in Nintendo history",
        "score": 349,
        "text_content": "I completely agree. It is one of the greatest games ever made. Just because it is not Mario along with Run and Jump it will be robbed of a number of game awards including best game design, direction, technical achievement and game of the year. I am happy that the game exists and can't wait for the next 3D Mario game from this team. Given how great Bananza is, I can't imagine what the team will do with the Switch 2 power for the next Mario game.",
        "comments": [
            {
                "raw_content": "I got close to 100% but had to let Bananza go, it’s not top tier for me.",
                "author": "Berry797"
            },
            {
                "raw_content": "I really enjoyed playing through it, but would put it down as maybe a 7 or 8 out of 10 game. It’s very one dimensional and, although that dimension is a ton of fun, it’s not in the same tier as a main Mario or Zelda game for me.",
                "author": "colmuacuinn"
            },
            {
                "raw_content": "I wish I hadn’t put the game on the backburner after a dozen or so hours. Trying to get back into it now and struggling to motivate myself to finish to be honest.",
                "author": "NiceColdPint"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Possible monster hunter wilds port",
        "score": 83,
        "text_content": "I'd rather a smooth running monster hunter world but it is what it is",
        "comments": [
            {
                "raw_content": "I'd rather have an upgrade for Rise and Sunbreak for the S2.",
                "author": "Tosh_00"
            },
            {
                "raw_content": "I'd rather have a switch 2 upgrade for Rise. And the portable team is very likely developing their next entry for Switch 2.",
                "author": "Anxious_Profit7036"
            },
            {
                "raw_content": "Rise is the better game IMO..... playing it on my Legion Go 2 & it looks & plays incredible.... a S2 upgrade to that game would be better than bringing wilds over....",
                "author": "DarthVaderBater2"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Over 60 Nintendo eShop Games You Might Have Missed In 2025 - Sequential Planet",
        "score": 16,
        "text_content": "Happy holidays, everyone! I just remembered there is a Switch 2 sub, so decided Id share here too. What are the best easy-to-miss Switch games of the year?",
        "comments": [
            {
                "raw_content": "Until then ❤️‍🩹",
                "author": "Thin_Molasses_2561"
            },
            {
                "raw_content": "What is the game in the thumbnail?",
                "author": "Solid_Highlight6276"
            },
            {
                "raw_content": "Shout-out to Dark Deity 2! An excellent game that improves upon the original for classic Fire Emblem fans.",
                "author": "Moist_Square1078"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I think the switch 2 is more of a transportable console rather than a portable one.",
        "score": 332,
        "text_content": "Just look the size differences. After playing for a lot of time on the switch 2, my psvita felt so small and light in my hands, and honestly that felt really weird. (PS: the psvita has the best d-pad).",
        "comments": [
            {
                "raw_content": "I never take it out anywhere. For me it’s less a “portable” system and more a system I can play handheld when someone else is using the TV. A bit like the WiiU. But the Switch Lite? Now that’s a portable. My hope is that one day we can get a Switch 2 Lite that’s a similar size.",
                "author": "nathanosaurus84"
            },
            {
                "raw_content": "i travel for work and practically LIVE on my Switch 2 and PS Portal. Both go in my backpack along with my ipad and portable battery",
                "author": "MIERDAPORQUE"
            },
            {
                "raw_content": "I think it's about as portable as something like an Ipad",
                "author": "buttsecks42069"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "NateTheHate: switch 2 devkit availability to third party devs \"has largely been resolved\"",
        "score": 314,
        "text_content": "this post is a followup to [several reports](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1nz2w5l/kiwitalkz_claims_that_the_lack_of_switch_2_dev/) [in this sub](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1joew9g/imran_khan_eight_months_ago_embracer_did_not_have/) that nintendo had been withholding switch 2 devkits to a significant amount of third party developers/publishers, rendering them incapable of releasing titles for the system in the first few months of its life; [natethehate claimed these reports were true](https://i.imgur.com/fzokmlv.jpeg) himself on famiboards back in august \"...they are true. Plenty of large dev studios lack devkits.\" -- natethehate, 8/25/25 last week, [jez corden](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1ptdnom/jez_corden_the_first_cod_switch_version_is_nearly/) stated on twitter that the first release of the call of duty franchise on switch (likely switch 2) [\"is nearly done and launching in a few months\"](https://xcancel.com/JezCorden/status/2003171421879460027#m), but prior to that also stated that the reason the franchise didn't come sooner (specifically in response to a person questioning why BO7 didn't arrive day-and-date) is because the franchise developers [did not have devkits to port the game](https://xcancel.com/JezCorden/status/2003056998477090963#m) at the time natethehate participated in a famiboards thread today discussing jez's comments (particularly responding to an incorrect assumption regarding THPS 3+4), corroborating jez's claim that the call of duty developers received switch 2 devkits too late to release an entry for switch 2 sooner, [but also clarifying that switch 2 devkit availability is largely resolved and no longer a lingering issue](https://i.imgur.com/YnfBIbY.jpeg) \"In the case of COD... it doesn't mean they got a devkit super late, either. Just late enough that they couldn't get the work done to launch the game sooner. The devkit delivery situation has largely been resolved.\" -- natethehate, 12/28/25 this could reasonably be assumed due to switch 2 receiving a surge of third party games and announcements recently from varying developers/publishers, but what this spells for the switch 2 platform going forward is that the floodgates are essentially open and 2026 will continue on with this momentum",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "There was some dude hell bent on Jez's comments in the other thread. Thought the line of reporting here was widely known/accepted until I saw them going off about nothing lol.",
                "author": "LeftImprovement"
            },
            {
                "raw_content": "with the influx of ports/ upgrade packs announced/ launched in the last couple of months this one is a given",
                "author": "Jeff1N"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Nash Weedle: Disney is reportedly asking its third-party studios to release their games for the Switch 2, including Star Wars, Marvel, and Disney Animation characters.",
        "score": 416,
        "text_content": "Apparently, Disney has been asking its third-party studios to include a Nintendo Switch 2 version of their games. Nash cited EA as an example, with the two games that are part of Respawn's Star Wars trilogy. He also mentioned that several Disney developers are already considering bringing these games to the Nintendo console. Please take this with a grain of salt, as it's from Nash Weedle. [Source.](https://xcancel.com/NWeedle/status/2004606254124282266)",
        "comments": [
            {
                "raw_content": "A native Kingdom Hearts collection would be nice. Also, some of the SNES/N64/Gamecube Star Wars titles on NSO? The Super Star Wars Trilogy, Rogue Squadron games, Shadows of the Empire etc.",
                "author": "BondFan211"
            },
            {
                "raw_content": "Does Nash Weedle sound like a real person to you?",
                "author": "Rarglar"
            },
            {
                "raw_content": "I'm surprised not much has been called Nash Weedle to be ban, as a quick search on this shows he's gotten a lot wrong.",
                "author": "Animegamingnerd"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Ubisoft Reportedly Breached (Unconfirmed Yet)",
        "score": 1086,
        "text_content": "Ubisoft seems to be dealing with a security breach, unconfirmed reports suggest that hackers may have accessed roughly 900GB of internal Ubisoft data. Allegedly, this includes source code, internal tools, and development materials for both upcoming and older games. The leaked data supposedly spans decades, with some material reportedly dating back to titles from the 90s through to current projects. The breach is supposedly linked to a MongoDB vulnerability known as **“MongoBleed”**, which may have allowed attackers temporary access to Ubisoft’s internal systems. **Ubisoft has not officially confirmed the scale of the breach or whether internal data was was even stolen, meaning that all of these claims should be taken with a grain of salt.** Here's the source: [ https://xcancel.com/TheRealZephryss/status/2005157803426807898?s=20 ](https://xcancel.com/TheRealZephryss/status/2005157803426807898?s=20) **Edit: Will stay vigilant on more verifiable news regarding this, I'll update this post if anything comes out of this supposed \"breach\".** **Edit 2: It seems like there were 4 groups of hackers involved in this attack, each of them did a separate act but they are all connected from reports.**",
        "comments": [
            {
                "raw_content": "900GB actually sounds quite low for data spanning decades",
                "author": "Howdareme9"
            },
            {
                "raw_content": "it really sucks for personal data to be leaked but oh well time to find out the premise of the next 17 assassin's creeds lol",
                "author": "Cursed_69420"
            },
            {
                "raw_content": "quote from a 2023 news: \"Ubisoft is reportedly investigating an \"unknown threat actor\" who allegedly gained access to the company's Microsoft Teams, Confluence, Atlas, and SharePoint channels for 48 hours before access was revoked. \"They aimed to exfiltrate roughly 900GB of data but lost access,\" vx-underground adds. It's not clear what, if any, data the hacker obtained before they were kicked from the system.\" Eurogamer, 2023 December",
                "author": "theeldergod1"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "After Switch 2 Update For Pikmin 3 Deluxe Leaked, Nash Weedle Claims \"A New Batch\" Of Free Game Updates For Switch 2 Is Coming",
        "score": 316,
        "text_content": "I donno if Nash is correct often but I figured I should still post this. Source: https://xcancel.com/NWeedle/status/2005384571710570572?s=20",
        "comments": [
            {
                "raw_content": "Isn't this person always wrong?",
                "author": "IloveOnePiece119205"
            },
            {
                "raw_content": "The source claims Metroid Prime Remastered will get a free update. This will be the best thing ever if it ends up being true.",
                "author": "Loose_Society9485"
            },
            {
                "raw_content": "He also claims that free updates will come to - Mario & Luigi: Brothership - Metroid Prime Remastered - Mario Strikers - Hyrule Warriors: Age of Calamity - Astral Chain - Yoshi's Crafted World - Princess Peach: Showtime! Though Supposedly, they will not all arrive in the next batch.",
                "author": "Howerev"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "The full Halo 2 E3 2003 demo build for original Xbox has leaked!",
        "score": 728,
        "text_content": "Includes May 3 pre-E3 tools/assets (blam.exe, pstencil shadows) + May 11 playable prototype. [https://xcancel.com/Clawsomegamer/status/2005317076043321382](https://xcancel.com/Clawsomegamer/status/2005317076043321382)",
        "comments": [
            {
                "raw_content": "I remember thinking this was the coolest demo ever back in the day.",
                "author": "jwhudexnls"
            },
            {
                "raw_content": "This is the holy grail of Halo leaks. Sounds like it has data from the old PStencil engine too. We got the patched together Earth City demo in MCC last year but that was the map and scripting data ported to the modern Halo 2 engine. This is the original raw project data that people played back in 2003 on real Xbox hardware. 99% chance this requires the 128mb RAM upgrade but could work in an emulator like XEMU for those who don’t want to solder.",
                "author": "dparks1234"
            },
            {
                "raw_content": "If anyone is interested, you can look through the thread archive here and see some of the screenshots anons have posted. It's not much, but it's something. https://arch.b4k.dev/v/thread/729386638/#q729386638",
                "author": "ReasonableAdvert"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Pikmin 3 Deluxe rated for Switch 2 in Europe, Potentially Either A Free Upgrade or Switch 2 Edition.",
        "score": 226,
        "text_content": "https://gematsu.com/2025/12/pikmin-3-deluxe-rated-for-switch-2-in-europe",
        "comments": [
            {
                "raw_content": "\"Nintendo Switch 2 Edition\" are rated as separate entries on PEGI's portal, so this is a free patch and it's a similar PEGI page to Super Mario Odyssey: https://pegi.info/search-pegi?q=super+mario+odyssey&op=Search&age%5B%5D=&descriptor%5B%5D=&publisher=&platform%5B%5D=&release_year%5B%5D=&page=1&form_build_id=form-ugL-ukzCWn46jtSOKXFg68Tbgz0rbT32ldqsaqHAWDw&form_id=pegi_search_form That said, it's either gone live too early or it's a mistake, because PEGI lists the release date (not the submission/rating date) and that's supposedly today.",
                "author": "Joseki100"
            },
            {
                "raw_content": "What about pikmin 4 😭",
                "author": "Suli_Croft"
            },
            {
                "raw_content": "Anything but Xenoblade Switch 2 editions",
                "author": "Loose_Society9485"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Monster Hunter Wilds potentially coming to Switch 2 + new info on Tempered Gogmazios (TU4.5?)",
        "score": 173,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Capcom don’t want to lose those Switch 2 sales especially in Japan",
                "author": "Loose_Society9485"
            },
            {
                "raw_content": "Wilds coming to Switch 2 was a point of discussion a few days ago on another forum, because Capcom is historically late to have Monster Hunter (mainline) announced/released on Switch 2. To give context: 3DS had a port of MH Tri G release 10 months after launch but it was announced *extremely* early, around the system launch; Switch had a port of MH XX release 5 months after launch. Switch 2 has been out for 6 months, and there is still no mainline Monster Hunter announced for it, not even a Nintendo Switch 2 Edition of Rise. So either Capcom essentially shadow-drops Rise NS2E at the next Nintendo Direct, or if that doesn't happen, the possibility of Wilds launching on Switch 2 alongside it's content paid expansion later next year increases drastically, because Capcom has historically gone to hell and back to give Nintendo platforms mainline Monster Hunter ASAP. Switch even got a fully exclusive Monster Hunter after World released, the *only* AAA Capcom full exclusive they have released probably since the PS2 era. That said, references in the code to a Switch 2 version could simply be due to Capcom's internal testing and assessments and never meant to actually be indicative of a released product.",
                "author": "Joseki100"
            },
            {
                "raw_content": "Game barely runs on PC properly and they expect it to port to Switch 2?",
                "author": "Ayyzeee"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Kingdom Come 1 upgrade Info",
        "score": 328,
        "text_content": "Two months ago I wrote about the upgrade of the first Kingdom Come and new game. Today I wanna share info about upcoming upgrade for next gen consoles. From what I’ve heard, a remaster of the original Kingdom Come is supposedly coming in February. Don’t expect too much, because as far as I’ve heard, it’s just going to be a port from PC. It won’t bring anything groundbreaking or entirely new — it’ll mostly just be a port for the new consoles.",
        "comments": [
            {
                "raw_content": "It's 8 years old in February, makes sense and would be easy to do considering they can port the 4k texture pack and HQ sounds dlc",
                "author": "LolcatP"
            },
            {
                "raw_content": "Update for switch 2 and cross saves will be good enough tbh",
                "author": "DarthFelus"
            },
            {
                "raw_content": "I need this to be true so i'll consider you as a tier 1 leaker.",
                "author": "DarahOG"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Jaguar Shores reportedly set to use HBM4E memory",
        "score": 26,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Let’s worry about it happening at all first",
                "author": "996forever"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "ASUS to launch ROG, TUF, ProArt NEO motherboards at CES 2026, designed for AMD Ryzen AM5 CPUs",
        "score": 124,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Looking forward to seeing the Crosshair X870E Hero NEO board (just for curiosity since I already have the non-NEO version)",
                "author": "Celcius_87"
            },
            {
                "raw_content": "> ROG I can't wait for them to cost more than the CPUs going into them./s Seriously though, I feel the chipset offerings for higher-end systems is lacklustre, especially considering the insane prices some of these boards go for. X870 is just a B650E in fancier terms and X870E is basically X670E but with USB 4. I feel X870E in particular is bad as it takes up 4 PCIe lanes and provides less options to the user (you could always add USB 4 through a PCIe expansion card and basically have an X870E, if needed). X870 may also be seen as a downgrade on X670 as it offers less M.2 slots due to having only one BIOS chip instead of two, like X670, X670E and X870E. Some X670 boards also received unofficial PCIe 5.0 support on the main x16 slot, which brings it on par with X670E. I feel AMD should've changed the chipset uplink to PCIe 5.0 x4 instead of PCIe 4.0 x4 for X870 and X870E, as this would bring the bandwidth between the chipset and the CPU to parity with Intel's Z890 (runs at PCIe 4.0 x8). This would also enable the use of an extra PCIe 5.0 NVMe SSD without leaving too much performance on the table as it will no longer be bottlenecked by PCIe 4.0 between the chipset and the CPU.",
                "author": "ScienceMechEng_Lover"
            },
            {
                "raw_content": "Well, just like Gigabyte released their (Elite, Pro, Master, Extreme) \"X3D\" refreshed versions... sound like Asus wants to do the same. I got the Aorus Elite X3D board and im super happy with it. Curious what the NEO boards have to offer.",
                "author": "Afraid_Self_6110"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Tested: AMD's Strix Halo vs Nvidia's DGX Spark",
        "score": 89,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Strix halo doesn’t support FP8 since it’s on rdna 3.5. That’s a tough sell. If these machines used rdna4 they’d be absolute monsters. It’s unfortunate that only the 9070 xt and 9060 xt use rdna4. All of these awesome APUs being released would do so much better with rdna4 imo. Hopefully rdna5/udna1 is implemented in all products when it’s released.",
                "author": "Ok-Parfait-9856"
            },
            {
                "raw_content": "Don't worry, AMD will continue releasing old RDNA iGPUs until Intel miraculously survive Intel's mismanagement crisis. This is AMD's spin of Intel's eternal quad core.",
                "author": "redditor_no_10_9"
            },
            {
                "raw_content": "TLDR: the slop boxes perform basically the same, so AMD with the much cheaper price point and x86 compatibility is the way to go.",
                "author": "F9-0021"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Zephyr still covering AMD Radeon RX 6900/6800 GPU bulging and cracking issues: 1% chance failure each year",
        "score": 19,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "Next-Gen AMD Ryzen “Medusa Point” with Zen 6 architecture gets HWMonitor support",
        "score": 52,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "Any Wifi7 cards that work with Yoga 7 2-in-1 14AHP9",
        "score": 6,
        "text_content": "I tried installing a Intel BE200 NGW card in my yoga laptop, when I tried to boot it just had a black screen. I am now sure if the card is just not whitelisted and there is a way to make it work, or if the card just is not compatible with the Yoga 7 2-in-1 14AHP9. It comes with a wifi6e card and I am having issues with the stability of the connection with my wifi7 network. When I reinstalled the original card it booted just fine. Does anyone know of a card that will be compatible for this system.",
        "comments": [
            {
                "raw_content": "The only Wi-Fi 7 cards that work on newer AMD platforms are the MediaTek & Qualcomm ones. AMD block Intel Wi-Fi 7 adapters at the firmware level, this is why you can get BE200 working on certain older AM3 and AM4 systems. This is something OEMs have complained directly to AMD about, but AMD won't budge. It's a great shame as Intel's Wi-Fi 7 cards are readily available, you can get them very cheap from distributors and the updates are provided direct from Intel, but there is no way around this current firmware block.",
                "author": "GhostMotley"
            },
            {
                "raw_content": "I think there is also a Realtek option",
                "author": "newpheonix"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Different to the discussion about GenAI but similar enough to warrant mention",
        "score": 131,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And yet we still have working musicians 🤔 almost like it didn’t really kill industries? An interesting parallel obvs to current AI discourse, esp. the extremist ‘sky is falling down’ view. I know others will argue nothing is a good analogy or parallel etc. etc.",
                "author": "Embarrassed_Hawk_655"
            },
            {
                "raw_content": "https://www.smithsonianmag.com/history/musicians-wage-war-against-evil-robots-92702721/",
                "author": "YakzitNood"
            },
            {
                "raw_content": "Just that usually, if a company isnt scam, the people whos music has been used, the creator got compensation, money, credits etc., at least these days GenAI just steals all images and content on the web, and no one gives any credit to anyone who made the originals... Plus, [this comment](https://www.reddit.com/r/PropagandaPosters/comments/1pybkp8/comment/nwhk966/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) someone made in the original post",
                "author": "TrackLabs"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "2 in 3 Americans think AI will cause major harm to humans in the next 20 years",
        "score": 188,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yo. The CEOs keep saying it will. Why would people not believe that?",
                "author": "Cognitive_Spoon"
            },
            {
                "raw_content": "77,000,000 Americans voted for Trump. 35,000,000 Americans believe the earth is flat. 250,000,000 Americans believe a magical fairy created the universe and pays attention to who they fuck. TL;DR: Americans are idiots.",
                "author": "krullulon"
            },
            {
                "raw_content": "Loss of jobs rogue robots...what more can happen....remember space odyssey....the jets sons. Star trek....look ma no hands",
                "author": "dustofAngels"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "What did all these Anthropic researchers see?",
        "score": 57,
        "text_content": "[Tweet](https://x.com/JacksonKernion/status/2004707761138053123?s=20)",
        "comments": [
            {
                "raw_content": "Love how he “sees a thing” but doesn’t provide anything. No benchmark no definition, just a vibe… this just feels like marketing.",
                "author": "throwaway0134hdj"
            },
            {
                "raw_content": "They saw their potential payday when Anthropic IPOs next year",
                "author": "vanishing_grad"
            },
            {
                "raw_content": "They saw dollar signs in hyping their products",
                "author": "Wolastrone"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Did we ever figure out what this was supposed to be?",
        "score": 390,
        "text_content": "",
        "comments": [
            {
                "raw_content": "chatgpt when sent 🎁 let you upload \"selfie\" (but you can upload character or anything) and then Sora generated christmas themed video for example mine was like Santa giving my character present that turned out to be some Flight Sim Controller probably derived from some gamedev related conversations we had throughout the year",
                "author": "qustrolabe"
            },
            {
                "raw_content": "> Small gift and happy holidays from Codex We want to take a moment to say thank you for using Codex over the past few months. As a small token of our appreciation, we've reset your rate limits and are temporarily increasing your usage limits to 2x the usual amount through January 1st. Thanks again for being part of the Codex community -- we're excited to keep building with you.",
                "author": "endless_sea_of_stars"
            },
            {
                "raw_content": "That was an easter egg that allowed you to generate a christmas-themed video of yourself based on what ChatGPT knows about you. You needed to prompt a gift 🎁 emoji to enable it. For a video demo, refer to [this article](https://9to5mac.com/2025/12/19/chatgpt-has-a-sora-powered-holiday-easter-egg/). https://preview.redd.it/8q5b292faz9g1.png?width=753&format=png&auto=webp&s=052e86b6368cf703d113d1d26b95e94d94b7a82a",
                "author": "Agitated-Cell5938"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "AI's next act: World models that move beyond language",
        "score": 86,
        "text_content": "Move over large language models — the new frontier in AI is [world models](https://archive.is/o/KyDPC/https://www.axios.com/2025/09/16/autodesk-ai-models-physics-robots) that can understand and simulate reality. **Why it matters:** Models that can navigate the way the world works are key to creating useful AI for everything from robotics to video games. * For all the book smarts of LLMs, they currently have little sense for how the real world works. **Driving the news**: Some of the biggest names in AI are working on world models, including Fei-Fei Li whose World Labs [announced](https://archive.is/o/KyDPC/https://techcrunch.com/2025/11/12/fei-fei-lis-world-labs-speeds-up-the-world-model-race-with-marble-its-first-commercial-product/) Marble, its first commercial release. * Machine learning veteran Yann LeCun [plans to launch](https://archive.is/o/KyDPC/https://www.wsj.com/tech/ai/yann-lecun-ai-meta-0058b13c) a world model startup when he leaves Meta, [reportedly](https://archive.is/o/KyDPC/https://arstechnica.com/ai/2025/11/metas-star-ai-scientist-yann-lecun-plans-to-leave-for-own-startup/) in the coming months. * [Google](https://archive.is/o/KyDPC/https://deepmind.google/blog/genie-3-a-new-frontier-for-world-models/) and [Meta](https://archive.is/o/KyDPC/https://about.fb.com/news/2025/06/our-new-model-helps-ai-think-before-it-acts/) are also developing world models, both for robotics and to make their video models more realistic. * Meanwhile, OpenAI has [posited](https://archive.is/o/KyDPC/https://openai.com/index/video-generation-models-as-world-simulators/) that building better video models could also be a pathway toward a world model. **As with the broader AI race,** it's also a global battle. * Chinese tech companies, including [Tencent](https://archive.is/o/KyDPC/https://www.scmp.com/tech/big-tech/article/3332653/tencent-expands-ai-world-models-tech-giants-chase-spatial-intelligence), are developing world models that include an understanding of both physics and three-dimensional data. * Last week, United Arab Emirates-based Mohamed bin Zayed University of Artificial Intelligence, a growing player in AI, announced [PAN](https://archive.is/o/KyDPC/https://mbzuai.ac.ae/news/how-mbzuai-built-pan-an-interactive-general-world-model-capable-of-long-horizon-simulation/), its first world model. **What they're saying:** \"I've been not making friends in various corners of Silicon Valley, including at Meta, saying that within three to five years, this \\[world models, not LLMs\\] will be the dominant model for AI architectures, and nobody in their right mind would use LLMs of the type that we have today,\" LeCun said last month at a symposium at the Massachusetts Institute of Technology, as noted in a Wall Street Journal [profile](https://archive.is/o/KyDPC/https://www.wsj.com/tech/ai/yann-lecun-ai-meta-0058b13c). **How they work:** World models learn by watching video or digesting simulation data and other spatial inputs, building internal representations of objects, scenes and physical dynamics. * Instead of predicting the next word, as a language model does, they predict what will happen next in the world, modeling how things move, collide, fall, interact and persist over time. * The goal is to create models that understand concepts like gravity, occlusion, object permanence and cause-and-effect without having been explicitly programmed on those topics. **Context:** There's a similar but related concept called a \"[digital twin](https://archive.is/o/KyDPC/https://www.axios.com/pro/climate-deals/2024/03/19/nvidia-ai-weather-forecasting)\" where companies create a digital version of a specific place or environment, often with a flow of real-time data for sensors allowing for remote monitoring or maintenance predictions. **Between the lines:** Data is one of the key challenges. Those building large language models have been able to get most of what they need by scraping the breadth of the internet. * World models also need a massive amount of information, but from data that's not consolidated or as readily available. * \"One of the biggest hurdles to developing world models has been the fact that they require high-quality multimodal data at massive scale in order to capture how agents perceive and interact with physical environments,\" Encord President and Co-Founder Ulrik Stig Hansen said in an e-mail interview. * Encord offers one of the largest open source data sets for world models, with 1 billion data pairs across images, videos, text, audio and 3D point clouds as well as a million human annotations assembled over months. * But even that is just a baseline, Hansen said. \"Production systems will likely need significantly more.\" **What we're watching:** While world models are clearly needed for a variety of uses, whether they can advance as rapidly as language models remains uncertain. * Though clearly they're benefiting from a fresh wave of interest and investment**.** \\--- alt link: [https://archive.is/KyDPC](https://archive.is/KyDPC)",
        "comments": [
            {
                "raw_content": "None of it matters until continuous training is achieved.",
                "author": "midgaze"
            },
            {
                "raw_content": "Hopefully someone that knows more can chime in, but how can world models learn real world physics by learning to predict the next frame in video games? I do not see how these models can learn things like molecular bond energies, protein folding dynamics, quantum tunneling in nanoscale systems, thermodynamics at the atomic scale from watching videos on YouTube and watching video gameplays. I do think we should search for alternative approaches to LLM'S. But I'm not convinced \"world models\" are the way to go.",
                "author": "Neurogence"
            },
            {
                "raw_content": "xAI is apparently also working on live video as input plus real time computer use. So you share your screen with Grok and it controls a computer in real time. Something like that cannot be done with current LLM architectures.",
                "author": "vasilenko93"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Context window is still a massive problem. To me it seems like there hasn’t been progress in years",
        "score": 103,
        "text_content": "2 years ago the best models had like a 200k token limit. Gemini had 1M or something, but the model’s performance would severely degrade if you tried to actually use all million tokens. Now it seems like the situation is … exactly the same? Conversations still seem to break down once you get into the hundreds of thousands of tokens. I think this is the biggest gap that stops AI from replacing knowledge workers at the moment. Will this problem be solved? Will future models have 1 billion or even 1 trillion token context windows? If not is there still a path to AGI?",
        "comments": [
            {
                "raw_content": "Brother I was vibe coding with an 8k context window. Things have progressed rapidly.",
                "author": "LettuceSea"
            },
            {
                "raw_content": "Meanwhile Qwen3-Next can run locally at 262k context using almost no VRAM. A few months ago even a 30b would use more VRAM for the same context. We are making big strides, and I think we will see that reflected in 2026 for local and frontier models.",
                "author": "YearZero"
            },
            {
                "raw_content": "https://preview.redd.it/1iplms3tn0ag1.jpeg?width=712&format=pjpg&auto=webp&s=94988c39e83e068b3b6f1eab671757d250062f88 Performance has actually significantly improved at longer context lengths.",
                "author": "artemisgarden"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Paralyzing, complete, unsolvable existential anxiety",
        "score": 611,
        "text_content": "I don't want to play the credentials game, but I've worked at FAANG companies and \"unicorns\". Won't doxx myself more than that but if anyone wants to privately validate over DM I'll happily do so. I only say this because comments are often like, \"it won't cut it at faang,\" or \"vibe coding doesn't work in production\" or stuff like that. Work is, in many ways, it's the most interesting it's ever been. No topic feels off limits, and the amount I can do and understand and learn feels only gated by my own will. And yet, it's also *extremely* anxiety inducing. When Claude and I pair to knock out a feature that may have taken weeks solo, I can't help but be reminded of \"centaur chess.\" For a few golden years in the early 2000s, the best humans directing the best AIs could beat the best AIs, a too-good-to-be-true outcome that likely delighted humanists and technologists alike. Now, however, in 2025, if 2 chess AIs play each other and a human dares to contribute a single \"important\" move on behalf of an AI, that AI will lose. How long until knowledge work goes a similar way? I feel like the only conclusion is that: Knowledge work is done, soon. Opus 4.5 has proved it beyond reasonable doubt. There is very little that I can do that Claude cannot. My last remaining edge is that I can cram more than 200k tokens of context in my head, but surely this won't last. Anthropic researchers are pretty quick to claim this is just a temporary limitation. Yes, Opus isn't perfect and it does odd things from time to time, but here's a reminder that even 4 months ago, the term \"vibe coding\" was mostly a twitter meme. Where will we be 2 months (or 4 SOTA releases) from now? How are we supposed to do quarterly planning? And it's not just software engineering. Recently, I saw a psychiatrist, and beforehand, I put my symptoms into Claude and had it generate a list of medication options with a brief discussion of each. During the appointment, I recited Claude's provided cons for the \"professional\" recommendation she gave and asked about Claude's preferred choice instead. She changed course quickly and admitted I had a point. Claude has essentially prescribed me a medication, overriding the opinion of a trained expert with years and years of schooling. Since then, whenever I talk to an \"expert,\" I wonder if it'd be better for me to be talking to Claude. I'm legitimately at risk of losing relationships (including a romantic one), because I'm unable to break out of this malaise and participate in \"normal\" holiday cheer. How can I pretend to be excited for the New Year, making resolutions and bingo cards as usual, when all I see in the near future is strife, despair, and upheaval? How can I be excited for a cousin's college acceptance, knowing that their degree will be useless before they even set foot on campus? I cannot even enjoy TV series or movies: most are a reminder of just how load-bearing of an institution the office job is for the world that we know. I am not so cynical usually, and I am generally known to be cheerful and energetic. So, this change in my personality is evident to everyone. I can't keep shouting into the void like this. Now that I believe the takeoff is coming, I want it to happen as fast as possible so that we as a society can figure out what we're going to do when no one has to work. Tweets from others validating what I feel: Karpathy: \"[the bits contributed by the programmer](https://x.com/karpathy/status/2004607146781278521?s=20) are increasingly sparse and between\" Deedy: \"[A few software engineers at the best tech cos told me that their entire job is prompting cursor or claude code and sanity checking it](https://x.com/deedydas/status/2000472514854825985?s=20)\" DeepMind researcher Rohan Anil, \"[I personally feel like a horse in ai research and coding. Computers will get better than me at both, even with more than two decades of experience writing code, I can only best them on my good days, it’s inevitable.\"](https://x.com/_arohan_/status/1998110656558776424) Stephen McAleer, Anthropic Researcher:[ I've shifted my research to focus on automated alignment research. We will have automated AI research very soon and it's important that alignment can keep up during the intelligence explosion.](https://x.com/McaleerStephen/status/2002205061737591128) Jackson Kernion, Anthropic Researcher: [I'm trying to figure out what to care about next. I joined Anthropic 4+ years ago, motivated by the dream of building AGI. I was convinced from studying philosophy of mind that we're approaching sufficient scale and that anything that can be learned can be learned in an RL env.](https://x.com/JacksonKernion/status/2004707758768271781?s=20) Aaron Levie, CEO of box: [We will soon get to a point, as AI model progress continues, that almost any time something doesn’t work with an AI agent in a reasonably sized task, you will be able to point to a lack of the right information that the agent had access to. ](https://x.com/levie/status/2001888559725506915?s=20) And in my opinion, the ultimate harbinger of what's to come: Sholto Douglas, Anthropic Researcher: [Continual Learning will be solved in a satisfying way in 2026](https://www.reddit.com/r/singularity/comments/1pu9pof/anthropics_sholto_douglas_predicts_continual/) Dario Amodei, CEO of anthropic: [We have evidence to suggest that continual learning is not as difficult as it seems](https://www.reddit.com/r/singularity/comments/1pu9og6/continual_learning_is_solved_in_2026/) I think the last 2 tweets are interesting - Levie is one of the few claiming \"Jevon's paradox\" since he thinks humans will be in the loop to help with context issues. However, the fact that Anthropic seems so sure they'll solve continual learning makes me feel that it's just wishful thinking. If the models can learn continuously, then the majority of the value we can currently provide (gathering context for a model) is useless. I also want to point out that, when compared to OpenAI and even Google DeepMind, Anthropic doesn't really hypepost. They dropped Opus 4.5 almost without warning. Dario's prediction that AI would be writing 90% of code was if anything an understatement (it's probably close to 95%). Lastly, I don't think that anyone really grasps what it means when an AI can do everything better than a human. Elon Musk questions it [here](https://www.foxbusiness.com/economy/musk-predicts-ai-create-universal-high-income-make-saving-money-unnecessary), McAlister talks about how he'd like to do science but can't because of asi [here](https://x.com/McaleerStephen/status/1938302250168078761?s=20), and the twitter user tenobrus encapsulates it most perfectly [here](https://x.com/tenobrus/status/2004987319305339234?s=20).",
        "comments": [
            {
                "raw_content": "Just drink it all in. We're on a spaceship going over the event horizon of a black hole. Maybe we'll all get obliterated or maybe something bizarre and amazing beyond anything we're capable of imagining is on the other side. Either way we get a privileged first person view of possibly the most important event in human history.",
                "author": "oooooOOOOOooooooooo4"
            },
            {
                "raw_content": "I still have a job as a software developer, but mentally I’ve already accepted the current situation. Not in a dramatic or nihilistic way — more in a pragmatic one. I’m no longer trying to outmaneuver what’s happening or make big strategic career pivots based on long-term assumptions that may not hold. As long as I remain even marginally useful, I’ll keep what I have. Stability matters more to me right now than optimization. I also see degrees, traditional milestones, and events like that as increasingly hollow in structural terms. I’ve already spent months suffering over this, and at some point you stop reopening the same wound. Now I mostly take these things for what they are: human and social rituals, not reliable signals of future security. On top of that, I deal with panic attacks. They’re somewhat better now, but they still limit my ability to transition into many careers that are often described as “more resilient” — even setting aside the question of how long any of those will actually remain so. That reality makes incremental stability a rational choice for me, not denial. What I hope for, more than any personal outcome, is that we manage to organize ourselves as a society for what’s coming. I don’t think pretending nothing is changing helps, but I also don’t think living permanently at the emotional edge of the future is survivable.",
                "author": "Clear_Adagio_7833"
            },
            {
                "raw_content": "Knowledge work may be done, but maybe you are not just knowledge work. You need to find yourself outside your work. There is a good chance almost everyone needs to...",
                "author": "EddiewithHeartofGold"
            }
        ],
        "subreddit": "singularity"
    }
]