[
    {
        "post_name": "👱 Trump Warns Socialist Mamdani Off to ‘Bad Start’ After Challenging Him in Victory Speech 👳",
        "score": 168,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Mamdani is a puppet of the Lord of the Strings - Soros. If Trump is serious, he needs to cut off the head of the snake.",
                "author": "Crucible"
            },
            {
                "raw_content": "Maybe do something then besides strong words and endorsing and congratulating worthless senators like Thune who did nothing for these elections. Not even in Virginia…",
                "author": "Urusovite"
            },
            {
                "raw_content": "**Archive Link**: https://archive.ph/Wr1OH **Direct Link**: https://www.breitbart.com/politics/2025/11/05/trump-warn-mamdani-off-bad-start/ **Pepe Link**: [🐸👌](https://static01.nyt.com/images/2016/09/28/us/28xp-pepefrog/28xp-pepefrog-superJumbo.jpg)",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "New Jersey saw 500,000+ more votes than any other year in history, and nearly all of them went to Democrats? 🤔",
        "score": 140,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Zero riggers arrested = zero incentive not to rig.",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "Voter fraud, as always. This our most important issue, because the fraud is what causes all our other problems.",
                "author": "projectarcturus1"
            },
            {
                "raw_content": "The numbers are believable. The table is only showing years with a gubernatorial election. For comparison, 2024 had 2.2 million votes for Harris and 1.9 million for Trump. 2021 had a strong incumbent running for governor, so the turnout would be lower than in an open seat year.",
                "author": "RocksCanOnlyWait"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Leftist student just FLIPPED OVER a TPUSA table at University of Iowa. @uiowa must charge and expel her MAKE HER FAMOUS",
        "score": 1021,
        "text_content": "",
        "comments": [
            {
                "raw_content": "When are people going to start punching these clowns in the face?",
                "author": "Yamel13"
            },
            {
                "raw_content": "They are toddlers throwing a tantrum because people disagree with their communism.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Update: ARRESTED & TRANS https://x.com/FrontlinesTPUSA/status/1986256303178870982",
                "author": "Quiznos585"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "MY FELLOW AMERICANS, OUR MOVEMENT IS FAR FROM OVER—IN FACT, OUR FIGHT HAS ONLY JUST BEGUN!",
        "score": 1199,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He better tell that to Kash and Pam, they didn't get the memo.",
                "author": "TheGreenDragon"
            },
            {
                "raw_content": "Just begun? Big if true I haven't even witnessed a starting line.",
                "author": "Glory-Unto-God"
            },
            {
                "raw_content": "He's right. However, he needs to spend less time on the middle east and more time on domestic issues for the bnext 12 months.",
                "author": "JackOfAllTirades"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Grammy winning rap legend 50 Cent just revealed he ‘escaped New York’ after Zohran Mamdani won the mayor election.",
        "score": 935,
        "text_content": "",
        "comments": [
            {
                "raw_content": "50 Cent was always more based than 30 Pence.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Got out before he was left with 50 cents in his pocket. Knowing that muzzie he’d get that too",
                "author": "DJT_MFers1"
            },
            {
                "raw_content": "I'm a big fan of Curtis Jackson III. Discovering how based and down to earth he is irl has been a treat. He's funny af too.",
                "author": "Th3Cho0sing0ne"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Mamdani announces \"All female transition team\" 😂",
        "score": 755,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This ship will sink fast.",
                "author": "I_Love_Trump"
            },
            {
                "raw_content": "# \"It was always the women, and above all the young ones, who were the most bigoted adherents of the Party, the swallowers of slogans, the amateur spies and nosers-out of unorthodoxy.\" # --George Orwell, 1984",
                "author": "redditadminssuckit"
            },
            {
                "raw_content": "All liberal women think they know what's best for everyone else.",
                "author": "TheMadHodker1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Stop Falling for Fake News Demoralization",
        "score": 783,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Being blackpilled is gay, but its important to realize that we fucked up with these elections and need to prepare for the midterms",
                "author": "Cyber1776"
            },
            {
                "raw_content": "This meme needs to include how MAGA is being attacked from “within”. The whole “woke right” thing is a neocon attack on the MAGA movement.",
                "author": "War_Hamster"
            },
            {
                "raw_content": "These are all leftist strongholds. Let's not exaggerate the significance of Democrats winning.",
                "author": "DelendaEstMarxismo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "DRIVE-BY MEDIA: Why isn't the media playing Zohran Mamdani's Nazi salute on repeat as they did with Elon Musk? Why the double standard?",
        "score": 1311,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Because if they didn't have double standards they'd have no standards at all.",
                "author": "ElectronicSlurm69"
            },
            {
                "raw_content": "Because they are presstitutes?",
                "author": "Tookens"
            },
            {
                "raw_content": "Why isn't the media asking why young Soros was funding him? 🤓",
                "author": "drmrboy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "JUST IN: Deputy Attorney General Todd Blanche Requests Tina Peters be Transferred from Colorado State Prison to a Federal Bureau of Prisons Facility",
        "score": 892,
        "text_content": "",
        "comments": [
            {
                "raw_content": "𝙵𝚁𝙴𝙴 𝚃𝙸𝙽𝙰 𝙿𝙴𝚃𝙴𝚁𝚂",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "However they got Jussie smollet’s cunt gay bitch ass out of prison, we should use the same formula. He literally went to prison and then bitched and cried and they let him out.",
                "author": "ChilledCovfefe"
            },
            {
                "raw_content": "This has taken SO STUPID LONG that even *getting it done*, is still an embarrassment.",
                "author": "barwhack"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔴PRESIDENT TRUMP: \"Walmart just announced that prices for a Thanksgiving Dinner is now down 25%\" \"AFFORDABILITY is a Republican stronghold. Hopefully, Republicans will use this irrefutable fact!\"",
        "score": 1240,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lovely, if true.",
                "author": "LegendFang"
            },
            {
                "raw_content": "Delusional. Dude hasn’t shopped for food a day in his life. And he can afford any thing he wants. Prices are not down at grocery stores.",
                "author": "For_All_Mankind"
            },
            {
                "raw_content": "Who feeds him these bulshit numbers?",
                "author": "tribunabessica"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "⚕️ NEW YORK CITY - At least 5 firefighters injured after car EXPLOSION in The Bronx, reports say...",
        "score": 803,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Oh look, it's beginning already! That was fast...",
                "author": "GunsWithGooglyEyes"
            },
            {
                "raw_content": "Muslim Celebrations of peace",
                "author": "blueeyephoto"
            },
            {
                "raw_content": "The mayor is too busy doing one of his 5 prayers a day to some pedophile, they're on their own",
                "author": "magapatriot_pa"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Even the Statue of Liberty has had enough.",
        "score": 1131,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Dam how many toes does she actually have 👀👀👀😂😂😂",
                "author": "Pissonit"
            },
            {
                "raw_content": "Statue of Liberty: \"I really hate that fucking poem they stuck on me...fuck your tired and fuck your poor\"",
                "author": "vote_for_MAGA_2020"
            },
            {
                "raw_content": "She has seen things.",
                "author": "lovemylibs"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I am Born Again",
        "score": 1533,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“After careful consideration, I have decided to become more extreme in my religious beliefs.\"",
                "author": "henri_derelicte"
            },
            {
                "raw_content": "Jews, call them by their name. Jews. They wanted the Middle East bombed so they could glcreate greater Israel and they love to dump the Muslim gentiles in the West, majority white countries and you are paying for it in cash and blood",
                "author": "HenkZeilstra"
            },
            {
                "raw_content": "👃",
                "author": "drmrboy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Daily Reminder: Islam is not a race",
        "score": 1488,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If they call you racist and you try to defend against it, you've already lost. The media and all the normie retards will just associate you with being racist. Instead, you need to go on the attack and explain all of the terrible shit they are responsible for, and how it's 1000x worse than being racist.",
                "author": "AVeryNakedMan"
            },
            {
                "raw_content": "This meme is fucking gay now. “Stop calling me racist.” How about stop playing right into the hands of our Alinski trained enemies, you fucking faggots.",
                "author": "JoeMcCarthyWasRight"
            },
            {
                "raw_content": "Same deal with Judaism, I'm not a racist for realizing Christianity and Judaism are antithetical to each other.",
                "author": "MAGAfarmer"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Drink up while you can NY, soon you'll be told that things like alcohol are haram (forbidden)",
        "score": 1898,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I hope that he tries to institute a burka requirement just so the 72% of women who voted for that can feel the consequences.",
                "author": "Choppermagic"
            },
            {
                "raw_content": "unfortunately these retards will start to move out of NY because of the results of the candidate that they voted for, and they will start seeping into our cities and voting the same way...",
                "author": "Purple_Drank"
            },
            {
                "raw_content": "Hope he burns the entire fucking city to the ground so we can say TOLD YA SO",
                "author": "559throw"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "HUGE development as Rep. Jared Golden (D-Maine 2nd) is NOT seeking reelection. Republican FLIP opportunity! He BARELY won last time. His District is R+4.",
        "score": 1319,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He had zero chance of winning. I live in Maine and have family in his district. He constantly tries to make himself seem like some sort of Democrat MAGA because northern Maine is VERY red. It's hard to believe he ever won in the first place. There are MAGA signs everywhere up there. I know some people may have a hard time believing that in Maine, but the only blue area of the state is the southeastern part which has had a massive influx of leftists from NYC and Mass the last 20 years or so. That's where the state is most heavily populated, but the vast majority of the state is conservative geographically.",
                "author": "dr_gonzo"
            },
            {
                "raw_content": "They always have confidence in voter fraud that always favors them.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "An actual conservative flip, or a Susan Collins lackie flip",
                "author": "MAGAfarmer"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Hey New York! Too bad, so sad.",
        "score": 1176,
        "text_content": "",
        "comments": [
            {
                "raw_content": "NYC died on 9/11. I was there. It was over that day!!!",
                "author": "cbonez416"
            },
            {
                "raw_content": "New York City is London 2.0 in the making.. Soon rape gangs and no-go zone with Sharia law police and courts will be the normal.. Business that sell alcohol and pork products will be harassed and burned, churches will be harassed and burned, museums will be harassed and burned, knife killings will increase and One World Trade Center will become the site of the great Islamic mosque of the conquest..",
                "author": "roadrunner0"
            },
            {
                "raw_content": "As the white women are raped into oblivion while the communist muslims emasculate the white men (think modern day Great Britain or France). The white population of NYC will weep and nash their teeth. No guns allowed (except the government and the muslims), no knives allowed (except the government and the muslims, no clubs allowed except the government and the muslims. Its gonna get ugly.",
                "author": "NecturusMaculosus"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "NYC the next 4 years",
        "score": 1468,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is a # NEW HOLY WAR. We are being conquered. It is time to stand up and # FIGHT.",
                "author": "ProtestantPatriot777"
            },
            {
                "raw_content": "Muslims men can easily move out of poverty with up to 4 wives and 20+ children on EBT. That's like 20k a month salary.",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "He is a puppet, another 0bama, winning for his ethnicity. They will bankrupt nyc just like they did with Biden/America. The destruction is going to be immense.",
                "author": "Shitsbrokeyo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"Democrats have never been more unpopular. Yet, magically, they are still able to flip districts Trump won just 1 year ago and run CIA agents who win by 15 points. It’s a mystery!\"",
        "score": 833,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Zero rigger arrests = zero incentive not to rig.",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "Isn’t it odd that the Dems always seem to overperform?",
                "author": "henri_derelicte"
            },
            {
                "raw_content": "Because elections are run by democrats.",
                "author": "Grindelwald"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Some places are being Islamified but not all :D",
        "score": 1586,
        "text_content": "",
        "comments": [
            {
                "raw_content": "captain phillips enters the chat",
                "author": "throttlejohnson"
            },
            {
                "raw_content": "Like always, it's a choice between bad and worse.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "that skinny looks like a freak",
                "author": "Retard_Strength"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "DRAM Prices Surge roughly 170% as Global Memory Shortage Deepens",
        "score": 386,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Its 2015 again yay? I wonder we see monstrosities like gtx1060 5gig successors like rtx 6060 7 gig or 9 gig :)",
                "author": "Sevastous-of-Caria"
            },
            {
                "raw_content": "Microsoft just said they are sitting on GPUs which means Big business bought up all the GPUS driving the price up without any place to use them. The same thing is happening with RAM. Prices will come down in a year.",
                "author": "ecktt"
            },
            {
                "raw_content": ">He explained that while AI servers and data centers are driving most of the demand for high-end RDIMM and HBM chips, memory makers are focusing their production on those more profitable products. That leaves far fewer resources for consumer-grade DDR5 Goes to show that the only difference between consumer DDR5 and much more expensive server RDIMMs is the RCD and PMIC chips. The days of binning better chips for enterprise is long behind us, it's just them reallocating chips to sell to business consumers at a higher margin. And then charging consumers more for less anyway.",
                "author": "InflammableAccount"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[News] China’s Memory Market Reportedly Sees Daily Price Hikes; 16GB DDR4 Module Soars 160% in October",
        "score": 33,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">Interestingly, Yicai notes that social media has been buzzing with the phrase “memory crazier than gold” for the past month, even landing on Weibo’s trending list. The report highlights that the 2TB iPhone 17 Pro Max now costs RMB 4,000 more than the 1TB model, while on the Android side, upgrading from 256GB to 512GB typically adds RMB 500–600. >The surge is also hitting laptops. As per Yicai, a Lenovo 16GB DDR5 module that stayed around RMB 300 from May to early September has jumped to RMB 599, and a Samsung 16GB DDR5 module priced near RMB 400 in September has climbed to RMB 738.",
                "author": "imaginary_num6er"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Bluetooth 6.2 specifications: more responsive, improves security, USB communication, and testing capabilities",
        "score": 157,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That latency reduction is huge. 7.5 ms to 0.375 ms. Wow",
                "author": "sittingmongoose"
            },
            {
                "raw_content": "We will see if how much of a compatibility imapact this ends up having but the latency reduction is certainly welcome for mice and keyboards. Hopefully Nordic Semiconductor adds support soon.",
                "author": "narwi"
            },
            {
                "raw_content": "When are we getting more bandwidth bruh, the audio drops to absolute dogs hit when the mic is connected. And even without it it's pretty shit",
                "author": "Skull_Reaper101"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "SK Hynix Raises HBM4 Prices Over 50% After Nvidia Negotiations",
        "score": 262,
        "text_content": "In the article it says, 1. SK Hynix has proven its position as the strongest player in the HBM market by raising the price of its 6th generation high bandwidth memory (HBM4) to be supplied to Nvidia, the world’s largest artificial intelligence (AI) semiconductor company, by more than 50% compared to its predecessor (HBM3E). 2. Company entered into price negotiations for HBM4 to be supplied to Rubin, Nvidia’s next-generation AI chip scheduled for release in the second half of next year. 3. the final supply price was agreed upon at around 560 dollars per product as proposed by SK Hynix, allowing the company to maintain its dominance in the HBM4 market. 4.SK Hynix stated that “prices and volumes for products meeting Nvidia’s specifications have been confirmed, and ‘current profitability’ is being maintained. 5.prices of general-purpose DRAM such as graphics double data rate (GDDR) and low power (LP) DDR are also soaring amid the global AI infrastructure investment boom. 6. With DRAM prices surging, analysis suggests that SK Hynix’s general-purpose DRAM operating profit margin next year could also approach 50-60%. An industry insider said, “As the market rapidly expands with inference AI, memory supply cannot catch up with demand in a short time,” adding that “SK Hynix sold out next year’s volume before even producing the products, so high profit margins will be maintained.”",
        "comments": [
            {
                "raw_content": "gotta love the naming schemes that we have in hardware: \"6th generation high bandwidth memory (HBM4)\"",
                "author": "leferi"
            },
            {
                "raw_content": "I'm happy for SK Hynix's stockholders, I suppose, but this is not good news at all for anyone looking to build or buy a new PC in 2026.",
                "author": "INITMalcanis"
            },
            {
                "raw_content": "Nvidia doesn't care, they can roll that price increase right onto their customers who are willing to literally pay anything.",
                "author": "Seanspeed"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Phoronix] Benchmarking The AMD EPYC 9V64H: Azure HBv5's Custom AMD CPU With HBM3 (MI300C)",
        "score": 22,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's worth noting that the comparison is 368 vs 176 cores (both zen 4), so you're only seeing HBM having a particular benefit in the benchmarks where the performance is well over 2x",
                "author": "Qesa"
            },
            {
                "raw_content": "The elusive MI300C which was announced around last year is available for general availability. Called their, \"Azure HBv5\" houses the EPYC 9V64H. 92 Zen4 Cores no SMT per CPU with a total of 368 cores with \\~400-450GB of HBM3. Benchmarked against 3D v-cached, HBv4, EPYC 9V33X (Genoa-X) for HPC workloads the performance gains are massive.",
                "author": "Noble00_"
            },
            {
                "raw_content": "The [Algebraic Multi-Grid Benchmark](https://openbenchmarking.org/test/pts/amg) performance is amazing!",
                "author": "ProfHansGruber"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Phoronix] Intel Xeon 6 Performance Feature Benchmarks: Latency Optimized Mode",
        "score": 19,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Interesting BIOS setting that can be enabled on Granite Rapids for more performance depending on the workload, maintains higher uncore freq.",
                "author": "Noble00_"
            },
            {
                "raw_content": "What the hell, some of these differences are huge lol, some tests were more than 2x performance > On a geo mean basis the performance went up by 17% with the Latency Optimized Mode to make for a net win in performance and power efficiency. > Across the span of some 140+ benchmarks carried out, running in the Latency Optimized Mode led to the server power consumption increasing by 12% om average compared to the BIOS defaults.",
                "author": "Die4Ever"
            },
            {
                "raw_content": "Although workload dependent, the performance difference here is surprisingly big and the power efficiency even improved in some cases. This makes me wonder how sensible the default settings even are since it appears to potentially leave quite a bit of performance on the table.",
                "author": "ComfortableEar5976"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Minisforum MS-R1 debuts as new mini PC with ARM CPU and dGPU support",
        "score": 6,
        "text_content": "The Minisforum MS-R1 has been officially introduced in Japan as a new mini PC that features an identical chassis to the MS-A1 but is powered by an ARM CPU. It also has a PCIe x16 slot, bringing support for dGPU.",
        "comments": [
            {
                "raw_content": "Hello tuldok89! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Exclusive: China bans foreign AI chips from state-funded data centres",
        "score": 55,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">The Chinese government has issued guidance requiring new data centre projects that have **received any state funds** to only use domestically-made artificial intelligence chips This is a pretty significant announcement. Many datacenters in China have their electricity subsidized. I imagine power subsidies are included under this requirement.",
                "author": "soggybiscuit93"
            },
            {
                "raw_content": "Hmm. I suspect this means that NVIDIA and AMD's hopes of selling their remaining H20s and MI308s have been dashed. And presumably for the final time.",
                "author": "Verite_Rendition"
            },
            {
                "raw_content": "You wanna ban selling your chips to us? Stuff it, *we're* gonna ban selling your chips to us. How you like them apples?",
                "author": "Carsmaniac"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung Reportedly to Deliver HBM4 Samples to NVIDIA This Month, Eyes Early-2026 Validation",
        "score": 7,
        "text_content": "",
        "comments": [
            {
                "raw_content": "[deleted]",
                "author": "None"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "I kinda love that Hyrule Warriors consistently gets basically the exact same critical reception",
        "score": 288,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It was all 78s yesterday and it's satisfying. It's ruined now :(",
                "author": "Traditional-Top7317"
            },
            {
                "raw_content": "Age of Imprisonment is the best Hyrule Warriors game CONFIRMED",
                "author": "Chungusboii"
            },
            {
                "raw_content": "It would be higher if the only negative review wasn't made by a person that clearly hates the musou genre. Makes kinda sad how people who doesn’t like musou games, always have this need to make sure to express how much they hate it and wish it didn't exist. Anyway, hyped for tomorrow.",
                "author": "linkling1039"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "From Nintendo's latest financial report, what is this guy doing here??",
        "score": 398,
        "text_content": "Interesting choice to put Fox there 🤔",
        "comments": [
            {
                "raw_content": "Finally, a sequel to Star Fox Zero Star Fox One",
                "author": "SwashNBuckle"
            },
            {
                "raw_content": "fire emblem, xenoblade, and pokemon found dead in a ditch 😔😔😔",
                "author": "myghostflower"
            },
            {
                "raw_content": "He had starlink lmao , so that kinda counts lmao",
                "author": "Ok_Elk_7372"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Arrived at the airport way too early with my sister, only one way to pass the time",
        "score": 63,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I use it in kickstand mode way more than I thought I would",
                "author": "fenikz13"
            },
            {
                "raw_content": "Hands down the best console for a reason. Many would argue about games library and graphics comparing with ps5 at similar price, however I love Nintendos creativity when it comes to making the console. It's not always about the games, it's about how u play them. Just like when Wii came out, it was a banger. Honestly Nintendo switch is really awesome, when I am too tired to setup with my monitor, I simply turn to handheld and enjoy. It's really fun.",
                "author": "Inside-Pass5632"
            },
            {
                "raw_content": "Made for times like this 🙏",
                "author": "PureBlood_07"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Young me really played demo's alot huh",
        "score": 215,
        "text_content": "Looking back on it when I was younger the majority of the games I played on the switch were demos cause we couldn't afford more than 1 or 2 games a year It's wierd cause looking back these things were the backbone of my childhood who else has a similar experience",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/pfllcuc7iizf1.jpeg?width=193&format=pjpg&auto=webp&s=02cc3387a0e807d2d5273c76fb65fbbccbeb8576",
                "author": "Durian_Puzzleheaded"
            },
            {
                "raw_content": "Not me double checking when the Switch came out just to feel old as fuck. I can't even tell you how many times I played the THPS1 demo off a PS1 disc I got from Pizza Hut.",
                "author": "amorningofsleep"
            },
            {
                "raw_content": "I still have a couple demo discs for the ps1. I think at least one was from Pizza hut? Good times playing the same section over and over lol. Barbie Explorer, Parappa, etc.",
                "author": "Vampir3Daddy"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The app is messed up from the start 😭",
        "score": 525,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The thought of someone spending $200 on AI generated hentai photos to look at on their switch lol. What is happening anymore?",
                "author": "juiceboxes__"
            },
            {
                "raw_content": "I’m continuously shocked that Nintendo doesn’t really police the eshop.",
                "author": "Past-Weakness-5304"
            },
            {
                "raw_content": "the gooner devs have found a cheat code to get free promotion lmao. wonder how many sales they'll end up getting from down bad people wanting to goon to something from their switch",
                "author": "OtisLRD"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Going forward, Nintendo is now shifting its primary development focus to the Switch 2 and will expand its business around the new platform.",
        "score": 842,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hopefully this means new S2 updates for many games. Looking at you Xenoblade",
                "author": "Skysite"
            },
            {
                "raw_content": "*huffs hopium and copium* do you think there’s a chance we get WWHD+TPHD and Prime’s 2 and 3 ports next year?",
                "author": "JuanMunoz99"
            },
            {
                "raw_content": "no shit",
                "author": "DRIESASTER"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo plans for growth include \"acquiring dev companies\"",
        "score": 648,
        "text_content": "Interesting to see Nintendo say this about acquisitions as they have up until now talked about prefering organic growth instead.",
        "comments": [
            {
                "raw_content": "I hope they buy Mercury Steam so we can keep getting 2D Metroid games like Dread",
                "author": "morenatropical"
            },
            {
                "raw_content": "I think we’ll most likely see acquisitions of studios that are already closely associated with Nintendo. The kind of studio that when you see their names you think “wait Nintendo doesn’t own them already”? Intelligent Systems, Hal Laboratory, Grezzo, Good-Feel, Camelot to name a few.",
                "author": "MichaelMJTH"
            },
            {
                "raw_content": "honestly to me it seems like its most likely that they intend to bring alot of 2nd party devs under the official umbrella. companies that have strong ties or near exclusivity with nintendo already, but lack the resources the main company can provide. (HAL, Gamefreak, Sora, Monolith ect) i dont think this is them taking the same approach microsoft is doing this generation. Edit: aparently i missed that nintendo already owns monolith. last id heard they just had heavy investments. also yeah i know 2nd party doesnt officially exist but its the best way to describe companies that are technically 3rd party but work almost exclusivly for nintendo",
                "author": "Protitan20xx"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Pokémon Legends Z-A Version 1.0.2 is now available",
        "score": 76,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wonder how many of the shiny hunting exploits were also fixed lol",
                "author": "CA719"
            },
            {
                "raw_content": "**Bug Fixes:** * If you have not opened the box screen since the box was full before the first Mega Evolution battle, you will definitely fail to capture a Pokemon. Also, if you proceed with a side mission that allows you to obtain a Pokemon in that state, you will not be able to complete it. * In some side missions, if the day/night change occurs at the same time that a skill is hit on a target, it will no longer be possible to hit the target with a skill, and the side mission will no longer be able to progress. * During a trainer battle, if the opposing trainer switches Pokemon and the player simultaneously Mega Evolves, the opposing trainer will not be able to send out a Pokemon and will be unable to proceed. * Fixed some other issues. **Ranked Battle Balance Adjustments:** * Adjustment of points earned based on ranking so that points are not reduced depending on the outcome of the match. * Some battle rewards that can be received for each battle have been added and increased.",
                "author": "Amiibofan101"
            },
            {
                "raw_content": "Did they fix wild zone 20 shalpa glitch? I still need to do it",
                "author": "Modryonreddit"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Jason Schreier: Rockstar Games said that the dozens of employees it fired last week were leaking company secrets, disputing allegations by labor leaders that it was disrupting workers’ attempt to unionize.",
        "score": 927,
        "text_content": "[FROM BLOOMBERG](https://www.bloomberg.com/news/articles/2025-11-05/-grand-theft-auto-studio-says-fired-employees-were-leaking-information?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc2MjM4NDU1NSwiZXhwIjoxNzYyOTg5MzU1LCJhcnRpY2xlSWQiOiJUNUEwS0JHUFdDTDgwMCIsImJjb25uZWN0SWQiOiJCMUVBQkI5NjQ2QUM0REZFQTJBRkI4MjI1MzgyQTJFQSJ9.PipR6t4x9M3EqRs9jXeXrZNn3d-RZBZhXyh8pTYZhFs)**:** Rockstar Games, the company behind the hit Grand Theft Auto franchise, said that the dozens of employees it fired last week were leaking company secrets, disputing allegations by labor leaders that it was disrupting workers’ attempt to unionize. The employees had been sharing company information in a forum that included non-employees, a Rockstar spokesperson said in a statement to Bloomberg on Wednesday. “Last week, we took action against a small number of individuals who were found to be distributing and discussing confidential information in a public forum, a violation of our company policies,” the spokesperson said. “This was in no way related to people’s right to join a union or engage in union activities.” The company, part of Take-Two Interactive Software Inc., fired between 30 and 40 employees across offices in the UK and Canada for what it said was “gross misconduct.” The Independent Workers’ Union of Great Britain, the first to organize video-game workers in the UK, told Bloomberg that the employees had all been involved with union efforts at Rockstar, calling the firings “one of the most blatant and ruthless acts of union busting in the history of the games industry.” All of the affected employees were part of a private trade union chat group on Discord and the only outsiders in the chat were labor organizers, the union said. EDIT: [Jason Schreier provided additional info](https://bsky.app/profile/did:plc:2mkgbhbhqvappkkorf2bzyrp/post/3m4wbmgq46k23): Rockstar's statement is quite vague, but they are referring to people talking about work in a union Discord, not big leaks about GTA6. This will likely come down to a legal battle, and Rockstar's argument may be that the workers involved were sharing confidential work information in that chat",
        "comments": [
            {
                "raw_content": "#Jason Schreier is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "40 people all leaked something in a Forum If that was the case we'd know a lot more than we do I call bs",
                "author": "profchaos111"
            },
            {
                "raw_content": "Sure we only fired people who were attempting to organize, but you have to understand that the very fact that they were organizing was in fact them leaking company secrets to outside labor organizers.",
                "author": "Wassersammler"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "IGN - Inside Dante’s Purgatorio, the Cancelled Sequel to EA’s Dante’s Inferno",
        "score": 636,
        "text_content": "[https://www.ign.com/articles/inside-dantes-purgatorio-the-cancelled-sequel-to-eas-dantes-inferno](https://www.ign.com/articles/inside-dantes-purgatorio-the-cancelled-sequel-to-eas-dantes-inferno) (copying Shinobi's summary over on twitter): Was penned by Assassin’s Creed 2 co-writer Joshua Rubin as a battle between Heaven and Hell Progressed deeper into pre-production, meant to be an AC1 -> AC2 level jump Levels included Dante venturing to the Garden of Eden, Mount Purgatory, more levels of Hell etc New abilities like \"Spirit Jump\" would allow Dante to leap vast distances, \"Possession\" to possess enemies, and sprout angelic wings where he could fly during large boss fights Traversal would have played a much bigger role, as ascending into Heaven involved climbing, the team wanted it to be \"better than Uncharted or Tomb Raider\", \"wanted to keep you on \\[your\\] toes and instill a real sense of vertigo\" Climbing segments would be akin to puzzles, searching for ledges you can grasp, avoiding rocks and enemy attacks Dante would unlock an ability to reveal unseen \"Angelic Architecture\" normally only visible to angels and redeemed souls that opened new paths in the environment The final boss fight would be against Lucifer in the middle of a burning Garden of Eden He would summon lightning, whirlwinds, shoot flames, hurl trees 'like javelins' etc Meant to be a 'colossal multi-stage battle', with the last stage taking place in the sky, described as being like “Superman 2’s aerial battle with General Zod above Metropolis\"",
        "comments": [
            {
                "raw_content": "I actually enjoyed DI and would’ve loved a sequel",
                "author": "HunchoZackk"
            },
            {
                "raw_content": "Would Lucifer in the sequel have had a bigger....presence?",
                "author": "Jobre7893"
            },
            {
                "raw_content": "Dante’s Inferno holds a special place in my heart because it was one of my first M-rated games and as a teenager I thought it was so cool to play a game with gore and nudity that game was such a cool concept and the art direction was fire, would’ve loved a sequel",
                "author": "Carfrito"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[Rockman Corner] Capcom Taiwan’s Game Development Department Reportedly Dissolving",
        "score": 54,
        "text_content": "https://www.rockman-corner.com/2025/11/capcom-taiwans-game-development.html",
        "comments": [
            {
                "raw_content": "If megaman gets cancelled I will literally stomp myself out",
                "author": "Irrelevant-soul6684"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "FTIA: The Legend of Zelda film is in \"In Production\" and now filming in Wellington, New Zealand",
        "score": 318,
        "text_content": "[Source](https://xcancel.com/MikeOdysseyYT/status/1986071915086164286)",
        "comments": [
            {
                "raw_content": "All it takes is one picture from the set and we’ll know which game they’re adapting.",
                "author": "Medd-"
            },
            {
                "raw_content": "Please don't suck",
                "author": "SuperTristan2017"
            },
            {
                "raw_content": "who is this guy? what is this website? is any of this legit?",
                "author": "Not__My__Birthday"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Beenox is possibly teasing a new Crash Team Racing on their updated X(Twitter) banner",
        "score": 339,
        "text_content": "Beenox, a subsidiary of Activision that previously developed Crash Team Racing: Nitro-Fueled in 2019, recently updated its X (formerly Twitter) banner. The banner features images from several of the studio’s past projects (including Nitro-Fueled), but interestingly, it also includes a concept art showing Crash in his kart, this time using his Crash Bandicoot 4 design (that came after CTR) https://xcancel.com/BeenoxTeam?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Eauthor Edit: It has been taken down. This is what it looked like: https://xcancel.com/LuchoComix/status/1986083899814871204",
        "comments": [
            {
                "raw_content": "Wasn't there a rumour a few months back about Nitro-Fueled coming back on current-gen or sth? If I didn't completely imagine that, could this be that?",
                "author": "Widower800"
            },
            {
                "raw_content": "I will be so sad if this skips PC again. I could have been playing 144fps CTR for years already, instead I just kept playing MK8 Deluxe even though I loved CTR as well since it never got a 60fps patch.",
                "author": "Crimsonclaw111"
            },
            {
                "raw_content": "One of my fondest gaming memories is playing CTR: NF during its hayday, seeing the new Grand Prix's and wishing for certain characters to get in. I have over 250 hours in the game, just on Switch. A new CTR made by Beenox would be the quickest preorder of my entire life.",
                "author": "thickwonga"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[BillBill-Kun] Confirms the existence of the cross buy symbol in the PlayStation store files.",
        "score": 697,
        "text_content": "The new style was added in June 2025 and it confirms that \"these are indeed new graphics intended for new feature\". In some CSS files there are also mentions of a crossbuy-tag. \"It remains to be seen whether this functionality will concern purchases between ps5 and PC or between Ps5 and a hypothetical new portable console.\" The symbols reserved for ps5 console: https://dealabsmag.com/wp-content/uploads/2025/11/Symboles-speciaux-PlayStation-1140x641.jpg.pagespeed.ce.0mgFgEtrc9.jpg The CSS style on text and the result: https://dealabsmag.com/wp-content/uploads/2025/11/Cross-Buy-CSS-1024x576.jpg.pagespeed.ce.RyvXweCk4b.jpg The article via dealabs: https://www.dealabs.com/magazine/du-cross-buy-ps5-pc-en-preparation-chez-playstation-voici-les-resultats-de-notre-enquete-60757",
        "comments": [
            {
                "raw_content": "#BilBil-Kun is a Tier 2 - Generally Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Can someone explain what this would do like i was an old grandad?",
                "author": "Potential-Bug-9633"
            },
            {
                "raw_content": "What if it's laying the groundwork for the rumoured portable console alongside a playstation store launcher for pc. They might not call explicitly call it ps6 portable just playstation portable . So buying digital games for ps6 will also provide a license to play on the portable console It also gives them a way out of not doing parity release for both standard console and handheld. ( like if the game is very demanding like a future rockstar game or late gen ps studio exclusives ) unlike xbox where they mandate that all games released for the Xbox series x should also support series s.",
                "author": "CutProfessional6609"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Core Ultra 300 \"Panther Lake\" SKU lineup leaked, up to 16 CPU cores, 5.1 GHz boost and Arc B390 Xe3 graphics",
        "score": 84,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I actually like the idea of discrete GPU naming scheme for the new iGPU, 300 series for integrated graphics is really makes sense but they should add 'M' suffix to make it clear.",
                "author": "no_salty_no_jealousy"
            },
            {
                "raw_content": "I'm surprized to see nothing between 4 and 10 Xe3 cores. Seems like there's a lot of room in there for something like an 8-core B360 iGPU or even a 7-core B350. Also looks like the 3\\_8 and 3\\_6 versions are differentiating maximum boost clocks, though I wonder if instead those may reflect that configurable upper TDP bound. Might make sense for 65W and 80W to be differentiated if that will coincide with anything about the \"experience-based\" PL1 behavior.",
                "author": "Affectionate-Memory4"
            },
            {
                "raw_content": "quite confusing, Xe3 should start from C (celestial), if using name like B390 we think this is a battlemage Card (Xe2)",
                "author": "ElectronicImpress215"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Onexfly Apex Ryzen MAX handheld officially priced at $1,399, full-spec model costs $2,299",
        "score": 40,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Who on earth wants to pay 1.4k for a PC handheld, let alone 2.3k? I can't imagine battery life being anywhere near acceptable on that thing, kinda fails at being a handheld.",
                "author": "Blunt552"
            },
            {
                "raw_content": "I could buy a decent pc for that price",
                "author": "RossGoode"
            },
            {
                "raw_content": "The max+ 388 is the one to wait for. 8 cores /16 threads and 40 CU GPU",
                "author": "Tgrove88"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Abee intros AI Station 395 MAX with built-in liquid cooling, AMD Strix Halo up to 176W",
        "score": 22,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "The U.S. government will spend $970 billion on debt interest this year — more than Medicare, Defense, and Education combined. Here's why that matters.",
        "score": 40,
        "text_content": "$970 billion in interest payments. That's $2.4 billion burned every single day on debt we already owe. It's now the SECOND-LARGEST federal expense, behind only Social Security. More than: • National Defense • Education • Veterans Affairs Here's where it gets dangerous: THE CROWDING OUT EFFECT: For every $1 the government borrows, private investment falls by 33 cents. Government borrowing is literally choking business growth, jobs, and wages. THE HOUSEHOLD IMPACT: 68% of American adults now live paycheck to paycheck — including those making over $100k/year. While the government burns $2.4B daily on interest, working families can't build savings. THE RESERVE CURRENCY DECLINE: USD share of global reserves: • 2000: 71% • 2024: 58% The world is slowly diversifying away from the dollar. HISTORICAL PARALLEL: Britain's debt hit 148% of GDP after WWI. Interest costs consumed revenue. Within 30 years, the pound lost reserve currency status and the empire collapsed. Ray Dalio's debt cycle framework suggests the U.S. is in Stage 4-5: the point where interest costs force a choice between default, inflation, or radical reform. Full breakdown with historical comparisons: [https://youtu.be/YYfbeTG061k](https://youtu.be/YYfbeTG061k) The question: Is this America's fall, or its final wake-up call? Updated Removed Medical Expenses..",
        "comments": [
            {
                "raw_content": "A government doesn't actually give a fuck about debt it has to pay in it's own currency. Every dollar in circulation is a unit of debt the government issued. You have the money printer, just print more money. And if you are worried about a devalued dollar because of this then stop holding dollars.",
                "author": "peekitup"
            },
            {
                "raw_content": "Sounds bullish, spending to boost the eocnomy",
                "author": "PatientBaker7172"
            },
            {
                "raw_content": "$970b is not more Medicare, defense, and education combined. Medicare along is $997b",
                "author": "WookieeWarlock"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The U.S. government will spend $970 billion on debt interest this year — more than Medicare, Defense, and Education combined. Here's why that matters.",
        "score": 8,
        "text_content": "$970 billion in interest payments. That's $2.4 billion burned every single day on debt we already owe. It's now the SECOND-LARGEST federal expense, behind only Social Security. More than: • National Defense • Education • Veterans Affairs Here's where it gets dangerous: THE CROWDING OUT EFFECT: For every $1 the government borrows, private investment falls by 33 cents. Government borrowing is literally choking business growth, jobs, and wages. THE HOUSEHOLD IMPACT: 68% of American adults now live paycheck to paycheck — including those making over $100k/year. While the government burns $2.4B daily on interest, working families can't build savings. THE RESERVE CURRENCY DECLINE: USD share of global reserves: • 2000: 71% • 2024: 58% The world is slowly diversifying away from the dollar. HISTORICAL PARALLEL: Britain's debt hit 148% of GDP after WWI. Interest costs consumed revenue. Within 30 years, the pound lost reserve currency status and the empire collapsed. Ray Dalio's debt cycle framework suggests the U.S. is in Stage 4-5: the point where interest costs force a choice between default, inflation, or radical reform. Full breakdown with historical comparisons: [https://youtu.be/YYfbeTG061k](https://youtu.be/YYfbeTG061k) The question: Is this America's fall, or its final wake-up call?",
        "comments": [
            {
                "raw_content": "Your title is incorrect. Medicare alone is more than the interest",
                "author": "WookieeWarlock"
            },
            {
                "raw_content": "Cool let's keep raising taxes to limo by. It do nothing to address the spending . At the very least make the dollars more efficient. Yes that means cuts and pain within divisions at the very least",
                "author": "akmalhot"
            },
            {
                "raw_content": "Everything that goes up must come down. All empires fall eventually. Just depends if its a crash landing like the Roman's or more gentle like Great Britain. Of course with Great Britain they had the US as their closest ally to take the reigns.",
                "author": "Miserable_Depth_1643"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Q3 NY Fed Report: Mortgage Originations by Credit Score, Foreclosures Increase Slightly",
        "score": 25,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“Household debt balances are growing at a moderate pace, with delinquency rates stabilizing,” said Donghoon Lee, Economic Research Advisor at the New York Fed. “The relatively low mortgage delinquency rates reflect the housing market’s resilience, driven by ample home equity and tight underwriting standards.” Mortgage balances grew by $137 billion in the third quarter and totaled $13.07 trillion at the end of September 2025. Credit card balances rose by $24 billion from the previous quarter and stood at $1.23 trillion. Auto loan balances held steady at $1.66 trillion. Home equity line of credit (HELOC) balances rose by $11 billion to $422 billion. Student loan balances rose by $15 billion and stood at $1.65 trillion. In total, non-housing balances rose by $49 billion, a 1.0% increase from Q2 2025. The pace of mortgage originations increased with $512 billion newly originated in Q3 2025. There was $184 billion in new auto loans and leases appearing on credit reports during the third quarter, a small dip from the $188 billion observed in Q2 2025. Aggregate limits on credit card accounts continued to rise by $94 billion, representing a 1.8% increase from the previous quarter. Home equity lines of credit (HELOC) limits rose by $8 billion, continuing the growth in HELOC limits that began in 2022. Aggregate delinquency rates remained elevated in Q3 2025, with 4.5% of outstanding debt in some stage of delinquency. Transitions into early delinquency were mixed with credit card debt and student loans increasing, while all other debt types saw decreases. Transitions into serious delinquency mostly increased across debt types, although mortgages saw a slight decrease.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "03-07 looks like anybody could get a loan.",
                "author": "JosieA3672"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "More Private Credit Cockroaches: BlackRock in $500m shadow banking blow-up",
        "score": 2,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Xpeng's new humanoid/gynoid looks closer to the human form.",
        "score": 2289,
        "text_content": "https://x.com/XPengMotors/status/1985991889020158397?t=HHEZNwLsUhj-C55MxZ-v5Q&s=19 https://xcancel.com/XPengMotors/status/1985991889020158397?t=HHEZNwLsUhj-C55MxZ-v5Q&s=19",
        "comments": [
            {
                "raw_content": "I, for one, welcome our new sexy fencing overlords.",
                "author": "CMDR_ACE209"
            },
            {
                "raw_content": "Looks somehow like a human pretending to be a robot... ![gif](giphy|f9eSYJ9UbDd7xTZKKL)",
                "author": "TrapBubbles999"
            },
            {
                "raw_content": "https://preview.redd.it/r1ll3xxz2gzf1.png?width=856&format=png&auto=webp&s=0d75b6cc6e3b958bde755fbe075fefa554f94f14",
                "author": "PwanaZana"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Xpeng’s CEO debunks “Humans inside” claim for their new Humanoid Robot",
        "score": 183,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Any guesses why the robot has a world class caboose?",
                "author": "2cheerios"
            },
            {
                "raw_content": "In the video, the CEO states that it’s more obvious in real life than on video (motor sounds, etc) and that they’re making the debunking video since a ton of people were extremely skeptical about if it’s real",
                "author": "MagicZhang"
            },
            {
                "raw_content": "You know you've made it when people start thinking your robot is fake and there's a human inside",
                "author": "Havib3"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Unitree G1 - Embodied Avatar: Full-body Teleportation Platform",
        "score": 86,
        "text_content": "",
        "comments": [
            {
                "raw_content": "REAL STEEL",
                "author": "ChrisHarles"
            },
            {
                "raw_content": "There was a film... anyone remember the name? EDIT: Found it, it was Surrogates (2009) EDIT2: Real Steel is a good movie, but I think when it comes to world building, or the dangers of this tech, Surrogates is more interesting (I don't remember the movie being that good per se though).",
                "author": "Acceptable-Fudge-816"
            },
            {
                "raw_content": "Real steel is not a movie but a documentary",
                "author": "Yeokk123"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "New CRISPR method lets scientists delete large DNA sections quickly and in bulk",
        "score": 99,
        "text_content": "[https://www.biorxiv.org/content/10.1101/2025.11.03.686307v1?utm](https://www.biorxiv.org/content/10.1101/2025.11.03.686307v1?utm) Researchers developed a pooled CRISPR-Cas12a technique that can create long, precisely targeted DNA deletions across many sites in the genome simultaneously. This makes it possible to study or reprogram complex genetic networks far more efficiently than before, accelerating large-scale genome engineering and automated bio-design — both of which are crucial for merging biotechnology with algorithmic optimization on the road toward bio-AI convergence.",
        "comments": [
            {
                "raw_content": "birdman.gif ![gif](giphy|KvZsnr6sURMJ5EeyO3)",
                "author": "agm1984"
            },
            {
                "raw_content": "DELETE from DNA oh shit i forgot the where",
                "author": "ChildrenOfSteel"
            },
            {
                "raw_content": "YAY one step closer to foxgirl.",
                "author": "The_Scout1255"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Real Steel is here",
        "score": 24,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Just what every home needs. A metallic ninja",
                "author": "backnarkle48"
            },
            {
                "raw_content": "Honestly, putting all the big robotics brands in a ring and making them fight teleoperated to see which one’s the best sounds metal as hell.",
                "author": "Elite_PMCat"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "XPENG new humanoid robots - inner workings",
        "score": 502,
        "text_content": "",
        "comments": [
            {
                "raw_content": "YEAHHHHH IT HAS BOOBS",
                "author": "markstar99"
            },
            {
                "raw_content": "Feels like Westworld is becoming real.",
                "author": "Savings_Midnight_555"
            },
            {
                "raw_content": "The breasts are for heat sinks and cooling fans! Why haven't we thought of this earlier?",
                "author": "pavelkomin"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini 3 preview soon",
        "score": 449,
        "text_content": "",
        "comments": [
            {
                "raw_content": "From playing with this model with one shot tests, I know it has absolutely incredible taste. Heads and shoulders above anything else. It's also likely, from rumours, going to be Nano banana 2. I even saw a post where Dan Hendricks responded to a rumour that it got 68% on humanity's last exam. For context, the current best scores are around ~~25%~~ apparently 45% with GPT5 Pro, just wasn't on their website when I looked. So many things I've heard, I get the impression that Google thinks they have a king in the making.",
                "author": "TFenrir"
            },
            {
                "raw_content": "Source: https://x.com/legit_api/status/1986066955191665043/photo/1",
                "author": "Educational_Grab_473"
            },
            {
                "raw_content": "https://preview.redd.it/j7cd7wzu4gzf1.jpeg?width=736&format=pjpg&auto=webp&s=faefc09e8ed3ae3a8699b7cb42a72801a7e51bd6",
                "author": "Deciheximal144"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini 3's writing quality",
        "score": 68,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It didn’t just do X it did Y. It wasn’t X, it was Y.",
                "author": "fynn34"
            },
            {
                "raw_content": "Good or bad?",
                "author": "No_Low_2541"
            },
            {
                "raw_content": "As a frequent RP enjoyer I will say this is pure slop. Sorry Google but this shit will be DoA if you release as-is. DM me and I'll offer my de-slopping services free of charge.",
                "author": "New_Alps_5655"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "1m Business Customers: the fastest growing business platform in history",
        "score": 90,
        "text_content": "https://openai.com/index/1-million-businesses-putting-ai-to-work/",
        "comments": [
            {
                "raw_content": "• 1,000,000+ businesses are actively paying for business use (either ChatGPT for Work/Enterprise seats or direct model/API consumption). • 7 million ChatGPT for Work seats, up ~40% in the last two months. Enterprise seats up ~9× YoY. • 800M weekly active users",
                "author": "thatguyisme87"
            },
            {
                "raw_content": "I remember in [mid-2021](https://web.archive.org/web/20211212145624/https://openai.com/api/) when it was just \\~25 business customers: https://preview.redd.it/p6yxho7j9izf1.png?width=1536&format=png&auto=webp&s=4ffd4e3c2d75943cdc7c35e17495d7ab3e7a9cd2",
                "author": "adt"
            },
            {
                "raw_content": "The universe has never seen a quicker adoption of a technology",
                "author": "toni_btrain"
            }
        ],
        "subreddit": "singularity"
    }
]