[
    {
        "post_name": "BREAKING: Van explodes in Washington, DC.",
        "score": 474,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Mostly peaceful explosion",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "Random massive explosion happens all the time….",
                "author": "-f-b-i-"
            },
            {
                "raw_content": "Did it explode, or catch fire? There is a distinction.",
                "author": "nicbot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: Lara Trump is seriously considering making a run for Senate to replace Thom Tillis, per NOTUS",
        "score": 98,
        "text_content": "",
        "comments": [
            {
                "raw_content": "no more women please.",
                "author": "stick_in_the_eye"
            },
            {
                "raw_content": "Not my state, not my ballgame. But personally I will never vote for a woman for political office no matter who she is.",
                "author": "SmiggieBalls"
            },
            {
                "raw_content": "Would vote for her in a heart beat.",
                "author": "Bullet3250"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Portland (June 28) — “Turn that s—t down! It’s midnight… You’re worse than ICE” A disabled black resident in the community terrorized by Antifa & the far-left in their month-long rioting at the ICE facility confronts them",
        "score": 19,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Look how quickly they turned on her. Their hierarchy of intersectionalism means nothing to them.",
                "author": "Friendly_B"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Christopher Hudson, an Antifa man dressed as the ugliest woman you've ever seen, has been arrested after he attempted to ignite an incendiary device and advanced on officers with a machete.",
        "score": 792,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Portland and Seattle need to be purged with high energy neutron radiation. Afterwards they can be re-settled by normal Americans again.",
                "author": "Ricky_CIA"
            },
            {
                "raw_content": "What is it with troons and septum piercings?",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "They are always hideous people, inside and out.",
                "author": "GallowsTime"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "George Takeie doesn't want immigration laws enforced",
        "score": 1210,
        "text_content": "",
        "comments": [
            {
                "raw_content": "But he was fine with 85,000 IRS agents.",
                "author": "can_con"
            },
            {
                "raw_content": "Total fag.",
                "author": "nakedjay"
            },
            {
                "raw_content": "Bill Shatner>>>>George Takei",
                "author": "HappyNewYear2025"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "😡😡😡“You’ll see.” Yeah Dan? When? Two weeks? You’re losing confidence and talking a big game is far different from having one. We don’t believe you. Where’s the EPSTIEN JAIL TAPE YOU PROMISED?!?! IT’S BEEN MULTIPLE WEEKS ALREADY. YOU’RE A FRAUD TILL YOU START DELIVERING. Which, has YET to occur.",
        "score": 653,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’m just waiting for people to finally get arrested",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "Full Epstein disclosure or go fuck yourself.",
                "author": "Cleanupjannie4free"
            },
            {
                "raw_content": "Trust will return when Epsteins clients are rotting, Dan.",
                "author": "Siteless_Vagrant"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Unhinged leftist worldview: \"everything Trump is fighting againt should be allowed to happen\"",
        "score": 775,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Pedophile",
                "author": "BarrysOFace"
            },
            {
                "raw_content": "He looks like an old dyke these days.",
                "author": "Meddlesom"
            },
            {
                "raw_content": "Who gives a fuck about the opinions of a Hollywood has been?",
                "author": "freebirdie"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Some terrible news for us fellas 😱",
        "score": 981,
        "text_content": "",
        "comments": [
            {
                "raw_content": "My gain, your weight loss.",
                "author": "MythArcana"
            },
            {
                "raw_content": "ai",
                "author": "Thatunknownguy"
            },
            {
                "raw_content": "Be more afraid of the liberal women who do date across the political aisle. They're the conniving ones that will ruin your life for fun.",
                "author": "TheImpossible1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This Socialist is about to destroy NYC for eternity",
        "score": 782,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Two foreigners talking about how America doesn't need borders.",
                "author": "37dwarves"
            },
            {
                "raw_content": "Please burn down the city. Upstate could use some good news.",
                "author": "InfinitesimalOrange"
            },
            {
                "raw_content": "You need to watch this video. Mods did a good job stickying it. This guy wants to \"stand up and fight back\" against Tom Homan and ICE agents. He's saying illegal aliens are \"the very fabric of NYC\". Have you seen the video where he's screaming at Tom Homan hatefully? You can't allow this guy to win. Fuck your accelerationism and 'let NYC burn' nonsense. Someone has convinced many of you that as long as you run away like cowards and hide in your rural enclaves, you'll be safe. That's bullshit.",
                "author": "rae-lynngivens"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Illegal alien arrives from Honduras in 2012. Squirts out three kids who are granted US citizenship. After 13 years ICE has rung her bell, but she wants to boo-hoo that her youngest can’t go with her yet because he doesn’t have a passport. Don’t worry lady he’ll be joining you soon enough.",
        "score": 1266,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Unless she was married to an American citizen (which obviously was not) those are NOT American citizen kids.",
                "author": "Scot"
            },
            {
                "raw_content": "Birthright citizenship does not apply. None of them are American citizens. You can not get a United States passport if you are not a citizen. DNA test the child to confirm relation, send them back home. I hear Honduras is lovely this time of year.",
                "author": "Reclaimer69"
            },
            {
                "raw_content": "13 years and she couldn’t get her shit together….how’d it be to not have to get my hunting license or register my fuckn car? Hell, NY state are talking about having me register my fuckn garden.",
                "author": "Thops"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Cover Up: Wikipedia Editors Propose Deleting UK Grooming Gangs Scandal Article.",
        "score": 1164,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And this is why, when Wiki is begging for money, I laugh. Sadly, it's probably funded the same way as Reddit, with taxpayer money through the back door.",
                "author": "Millie1234"
            },
            {
                "raw_content": "How do we not have control of the internet yet? All these leftist need investigating. Probably pedos anyway",
                "author": "Babymaker5000"
            },
            {
                "raw_content": "Misleading Breithart headline. \"Wikipedia Editors Propose\" nothing. They do act like a monolithic group sometimes but not in this case. By making it plural and adding \"Coverup:\" it becomes clickbait. At issue are the actions of Editor Simon McNeil or \"Simonm223\" and he's facing the music on his own.",
                "author": "HocusLocus"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Illegal cost CA 12B a year just for medical services",
        "score": 1131,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The new big beautiful bill will let Californians to deduct $40,000 in State Income Tax and pay the health coverage for illegal aliens! Here is the kicker - the $40,000 SALT is for the 1%, you need to make $500k to pay $40,000 in State income tax.",
                "author": "Tomis_4"
            },
            {
                "raw_content": "I call bullshit because the feds have to bail them out each and every time. shell game",
                "author": "friarfox"
            },
            {
                "raw_content": "Just imagine the hospital bills these illegals run up, all across this great republic. We get to pay those bills for them.",
                "author": "GallowsTime"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The mayors are urging illegals to stay home on America's holiday... Home is not here retards, their lack of self awareness is legendary",
        "score": 1243,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The government sure loves to cancel anything related to citizen interaction. The Plandemic days proves that point. “Too risky”, says the elites",
                "author": "Groundpounder"
            },
            {
                "raw_content": "Remember in 2020 when they tried to cancel the Fourth in LA?",
                "author": "SomeGuyOnTheInternet"
            },
            {
                "raw_content": "Are there no natural born citizens in LA?",
                "author": "Littleirishmaid"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Muslim Brotherhood quietly trained and pushed hundreds of Muslims to local elections across most states",
        "score": 1137,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Coming to a town near you. Wake up people!",
                "author": "Counterwhat"
            },
            {
                "raw_content": "Been this way for decades now. They ruined Canada, and are now running our country. Import the third, become the third world. Just ask any honest Minnesotan.",
                "author": "DManthey"
            },
            {
                "raw_content": "Strange... I used to get called a racism for noticing things like this. Glad people are getting on the same page.",
                "author": "MickHigan2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "GATOR GITMO (Alligator Alcatraz)",
        "score": 699,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Too good. Lol. And just in time for my mid day dump. Cant wait till ai deletes Hollywood.",
                "author": "AlphaOmaga"
            },
            {
                "raw_content": "u/-f-b-i-",
                "author": "dangermousebuu"
            },
            {
                "raw_content": "AI is fucking wild.",
                "author": "Pres-Trump"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "It looks like Gaza but it's Glastonbury, UK",
        "score": 1029,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is how Islam works. They take over from within crying racism until it's too late.",
                "author": "DManthey"
            },
            {
                "raw_content": "General George S. Patton was right. We fought the wrong enemy in WW2.",
                "author": "tiller"
            },
            {
                "raw_content": "both the king and the country have cancer",
                "author": "newnewnewnew"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The exact moment the LA riots ended. The moment the FBI and IRS announced they are investigating whoever is funding the riots.",
        "score": 740,
        "text_content": "",
        "comments": [
            {
                "raw_content": "taxpayers funded them with Bidens Billions giveaway during his final 70 days.",
                "author": "newnewnewnew"
            },
            {
                "raw_content": "now do Portland",
                "author": "Gunmolester"
            },
            {
                "raw_content": "And when the funding agency is determined, a lawsuit should be filed in order to recover the entire cost to the community and law enforcement!",
                "author": "IMAMAN"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Why does unexplainable shit like this continues to fester? We are being played by forces we can't see or control.",
        "score": 611,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I have reached the point where I refuse to eat out anymore. If I go on a trip I do what my parents did. Pack some PB&Js and bring a cooler with drinks.",
                "author": "FusionBlack"
            },
            {
                "raw_content": "If you standup to order or order take out with little to no interaction or benefits, no tip is required or deemed necessary. If you sit down, are serviced, or are getting above and beyond normal service, a tip is appreciated and in some situations expected",
                "author": "j2daeww"
            },
            {
                "raw_content": "I like to establish eye contact after selecting ‘no tip’ when no tip is the only option that makes sense.",
                "author": "Tinyfingerbrains"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Kurt Caz is a YouTuber with 3.4 million subscribers currently in Rome, Italy. He can’t believe what he’s seeing This video has 344k+ Likes. Nobody can understand why this could ever be allowed to happen to Rome",
        "score": 1458,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Import Bangladesh, become Bangladesh",
                "author": "magapatriot_pa"
            },
            {
                "raw_content": "Import the third world; become the third world.",
                "author": "GuerillaYourDreams"
            },
            {
                "raw_content": "Poland and Hungary are the only places in the EU where it doesn't look like this.",
                "author": "Bazhosh"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Just two months ago, Thune overrode that same parliamentarian on a different bill.",
        "score": 479,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Cowards hide behind women.",
                "author": "Counterwhat"
            },
            {
                "raw_content": "How much do you want to bet they coordinated with the parliamentarian on what to remove?",
                "author": "Nephrum"
            },
            {
                "raw_content": "Thune's doing exactly what his master, McConnell, tells him to do. Get rid of McConnell = get rid of Thune.",
                "author": "greatpumpkin"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Blackwell: Nvidia’s Massive GPU – Chips and Cheese",
        "score": 75,
        "text_content": "A deep dive into the changes of rtx 50 (GB202) vs rtx 40 and 30 (AD103, GA102) with RDNA4 to Compare",
        "comments": [
            {
                "raw_content": "Good ol chips and cheese",
                "author": "ExplodingFistz"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Digital Foundry tested Switch 1 games on Switch 2, specifically the ones who got free updates.",
        "score": 617,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wonder if Nintendo will release upgrades for the Xenoblade series",
                "author": "Loose_Society9485"
            },
            {
                "raw_content": "Can't wait to play my favorite game Slatoon 3",
                "author": "ArcaneFlame05"
            },
            {
                "raw_content": "I love this But I'm also begging Nintendo to do the same thing to Animal Crossing and Smash Bros. 🙏",
                "author": "iusethisatw0rk"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "NYC PSA: Waltzed into Nintendo New York and they are in stock.",
        "score": 252,
        "text_content": "Hi everyone! If you’re in NYC then you’ll know that it’s been difficult to find stock. I went to Nintendo New York on 48th street and they had a few behind the counter, regular and bundle edition. The clerk said that they are releasing a limited amount in-store without the need of warp pipe pass, but it was 5PM and there were like 10 left.",
        "comments": [
            {
                "raw_content": "Does Shigeru Miyamoto come with it?",
                "author": "tadaoverlord"
            },
            {
                "raw_content": "Don't let this guy lie to you. I saw him and he wasn't waltzing it was more like a scurry into a skip",
                "author": "FitDingo7818"
            },
            {
                "raw_content": "FINALLLYYY... NOW SHIGGY CAN EAT. IM GONNA BUT 3 MORE SO HE CAN EAT AND FEED HIS FAMILY",
                "author": "Ashamed-Soil128"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "It’s a good day.",
        "score": 97,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Have fun! See you on the tracks!",
                "author": "bowlofpasta92"
            },
            {
                "raw_content": "Have fun! The Switch 2 versions of BotW and TotK look amazing, especially on a good TV!",
                "author": "nikers93"
            },
            {
                "raw_content": "Where and how?",
                "author": "G_boyy17"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "LPT: You can use a universal EVA carrying case for your Switch 2 dock for traveling",
        "score": 94,
        "text_content": "This is meant for GoPro but it fits the Switch 2 dock perfectly. I use this case so the dock won't get squished in my backpack. I know there are all in one cases available but I don't want to carry another bag aside from my backpack when traveling. Dimensions according to the listing are 17x13x6.5cm This is from a local shopping site in the Philippines but ships from China so I'm pretty sure you could also find it in your country. https://s.lazada.com.ph/s.Hu5Wz",
        "comments": [
            {
                "raw_content": "I mean it looks sturdy enough to just throw in my backpack",
                "author": "NintendoSense"
            },
            {
                "raw_content": "I'd rather just get an all in one carry case. The ones that hold a controller and all the wires and the dock and console and some games.",
                "author": "T_Peg"
            },
            {
                "raw_content": "Then you need a second case for the switch also right? I found a Tomtoc bag that will hold the dock and fit in my backpack.",
                "author": "Section_80"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I think there will be a Nintendo Today announcement on Tuesday",
        "score": 46,
        "text_content": "Tuesday June 10 they announced Splatoon Raiders/Splatoon 3 update Tuesday June 24 they announced the Drag x Drive release date Tuesday June 17 was skipped due to the DK Direct the next day, but then made up for it with the Mario Strikers announcement on Thursday June 26 So, on average, we've been getting one Nintendo Today drop a week. What will it be next? Likely not a major release date since we'll only be 2 weeks away from Bananza. Maybe another first party Switch 2 upgrade like Animal Crossing or Switch Sports?",
        "comments": [
            {
                "raw_content": "Partner direct/direct mini?? WWE 2k have a Switch announcement set for Tuesday 1st. https://x.com/wwegames/status/1938754531904676222?s=46&t=9Tntu77kodYnsg-4advL5Q",
                "author": "noggs891"
            },
            {
                "raw_content": "Give me some Xenoblade updates!",
                "author": "0scar_Goldmann"
            },
            {
                "raw_content": "If they want to drip-feed the switch 2 upgrade patches I’m honestly here for it. We just need more of them…",
                "author": "and-its-true"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "List of first-party Nintendo games not on NSO",
        "score": 32,
        "text_content": "So I compiled a list of Nintendo-published games that have yet to come (or to be announced) for the NSO \"Nintendo Classics\" series, for the consoles that already have a dedicated app. I ignored all the licensed games (e.g. Mickey Mouse games) and the Japanese-exclusive games. I also put some asterisks where there's a special accessory that might make the game harder to port, or if the game already has a remake or remaster on Switch, or if they're available in other ways on the NSO. If I missed a game or mistakenly put one on the list, please let me know. # NES * Wild Gunman\\* * Duck Hunt\\* * Hogan's Alley\\* * Stack-Up\\*\\* * Gyromite\\*\\* * Gumshoe\\* * To the Earth\\* * Short Order / Eggsplode!\\*\\*\\* * Barker Bill's Trick Shooting\\* * NES Play Action Football * Yoshi's Cookie * Zoda's Revenge: StarTropics II \\*Requires the Zapper \\*\\*Requires R.O.B. \\*\\*\\*Requires the Power Pad # Super NES * Super Scope 6\\* * Mario Paint\\*\\* * Super Play Action Football * Battle Clash\\* * Yoshi's Safari\\* * Metal Combat: Falcon's Revenge\\* * Tin Star\\* * Super Mario All-Stars + Super Mario World\\*\\*\\* * Wario's Woods * Super Mario RPG: Legend of the Seven Stars\\*\\*\\*\\* * Winter Gold \\*Requires the Super Scope \\*\\*Requires the Super NES Mouse \\*\\*\\*The games are available separately \\*\\*\\*\\*Has a Switch remake # Game Boy * Tennis\\* * Golf\\* * Solar Striker * Radar Mission * Balloon Kid * Play Action Football * Kid Icarus: Of Myths and Monsters * Yoshi\\* * Wave Race * Yoshi's Cookie * Magnetic Soccer * Top Rank Tennis * The Legend of Zelda: Link's Awakening\\*\\* * Kirby's Pinball Land * Wario Land: Super Mario Land 3 * Wario Blast: Featuring Bomberman! * Game Boy Gallery * Kirby's Block Ball * Mole Mania * Game & Watch Gallery * Wario Land II * Pokémon Red and Blue * Pokémon Yellow: Special Pikachu Edition\\*\\*\\* \\*The NES version is available \\*\\*The DX version is available \\*\\*\\*Has a Switch remake # Game Boy Color * Wario Land II * Game & Watch Gallery 2 * Pokémon Pinball * Super Mario Bros. Deluxe * Pokémon Gold and Silver * Warlocked * Pokémon Puzzle Challenge * Donkey Kong Country\\* * Pokémon Crystal * Pocket Soccer \\*The SNES version is available # Nintendo 64 * Diddy Kong Racing * Hey You, Pikachu!\\* * Super Smash Bros. * Donkey Kong 64 \\*Requires the Voice Recognition Unit # Game Boy Advance * Advance Wars\\* * Game & Watch Gallery Advance * Kirby: Nightmare in Dream Land * Pokémon Ruby and Sapphire * Donkey Kong Country\\*\\* * Advance Wars 2: Black Hole Rising\\* * Pokémon Pinball: Ruby & Sapphire * Pokémon FireRed and LeafGreen * Mario Golf: Advance Tour * Mario vs. Donkey Kong\\* * Donkey Kong Country 2\\*\\* * Mario Pinball Land * Pokémon Emerald * WarioWare: Twisted! * Yoshi's Universal Gravitation * Mario Party Advance * DK: King of Swing * Dr. Mario & Puzzle League * Mario Power Tennis * Drill Dozer * Donkey Kong Country 3\\*\\* \\*Has a Switch remake \\*\\*The SNES version is available # GameCube * Wave Race: Blue Storm * Pikmin\\* * Super Smash Bros. Melee * Animal Crossing * Doshin the Giant * Eternal Darkness: Sanity's Requiem * Star Fox Adventures * Mario Party 4 * Metroid Prime\\* * The Legend of Zelda: Ocarina of Time Master Quest * Wario World * Kirby Air Ride * Pokémon Channel * Mario Golf: Toadstool Tour * WarioWare, Inc.: Mega Party Game$ * Mario Kart: Double Dash!! * Mario Party 5 * 1080° Avalanche * Donkey Konga\\*\\* * Custom Robo * The Legend of Zelda: Four Swords Adventures\\*\\*\\* * Pikmin 2\\* * Donkey Konga 2\\*\\* * Paper Mario: The Thousand-Year Door\\* * Mario Power Tennis * Metroid Prime 2: Echoes * Mario Party 6 * Donkey Kong Jungle Beat\\*\\* * Star Fox: Assault * Dance Dance Revolution Mario Mix * Mario Superstar Baseball * Geist * Battalion Wars * Mario Party 7 * Odama * The Legend of Zelda: Twilight Princess \\*Has a Switch Remaster/Remake \\*\\*Requires the DK Bongos \\*\\*\\*Requires the GameCube – Game Boy Advance link cable for multiplayer",
        "comments": [
            {
                "raw_content": "Wow, we're only four games away from having all first party Nintendo 64 games on NSO. I am hoping that maybe Nintendo releases Donkey Kong 64 as a way to build hype for Donkey Kong Bananza.",
                "author": "OmegaRed86"
            },
            {
                "raw_content": "Great source! Thanks for the effort",
                "author": "Drezus"
            },
            {
                "raw_content": "Mario Party 4 and Zelda TP are on my wishlist!",
                "author": "dreamingwithcindy"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Would it be much work for Nintendo to allow Switch 1 games to run as if they are \"docked\" whilst in handheld on the Switch 2?",
        "score": 74,
        "text_content": "I don't understand the inner workings of the console enough to know if this is technically possible? Or would it be a lot of work to get this functioning?",
        "comments": [
            {
                "raw_content": "It's just a toggle they would need to switch. However in some games control styles, UI, etc. differ between handheld and docked mode which means every game would need to be evaluated separately to see if the docked mode would work properly in handheld mode",
                "author": "Sinomsinom"
            },
            {
                "raw_content": "Would it be hard? No but there are too many variables and games that could present issues its unlikely",
                "author": "MolotovMan1263"
            },
            {
                "raw_content": "From purely programming point of view, it's trivial. With sane software architecture, that's a task you give junior dev to get familiar with a codebase, and they should get back after a day or two with a solution that is at least 80% right. But the hard part is everywhere else. Is Switch 2 handheld comparably \"powerful\" to Switch 1 docked? Is it true for all Switch 1 games? What about all the games that support / require touchscreen, which is not available in docked mode? And gyro (in docked you keep both joy-cons close to each other, or independently in each hand; in handheld, you keep them in static relation to each other, but not as close)? So yes, it would be technically possible, and it would be a lot of work, but likely not the work you are thinking about.",
                "author": "mzalewski"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Switch 2 faster than SteamDeck LCD? Do I have the fastest Switch 2 in the market?",
        "score": 960,
        "text_content": "After all this commotion about Switch 2 pixel response time. I tried just for fun to do a UFO test on my Switch 2 vs my Steam Deck LCD and to my surprise it seems the response time in my switch 2 is actually faster than Steam Deck's.",
        "comments": [
            {
                "raw_content": "While the Switch 2 screen isn’t the best, it actually fits its price point very well. The Steam Deck is $50 cheaper and has a 60hz LCD with worse color reproduction and similar response time. The Steam Deck OLED is clearly better, but is $100 more than the Switch 2. Then you have all the even more expensive PC handhelds. Even venturing outside the pure gaming handheld space, the $499 LCD iPad Mini has similar response time issues (and screen tearing people refer to as “jelly scrolling). In the $4-500 range, there just isn’t anything else with a better panel that I’m aware of.",
                "author": "SMC540"
            },
            {
                "raw_content": "Or people are just overreacting",
                "author": "Silent_Anxiety4828"
            },
            {
                "raw_content": "Shhhh! Dude, why are you ruining the narrative that the Switch 2 screen is bad? I even read a comment on YT that said that the Game Boy screen was better than the Switch 2's LOL",
                "author": "Garamenon"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Edward Kenway's voice actor strongly hints at Assassin's Creed 4 Remake",
        "score": 223,
        "text_content": "https://xcancel.com/TheRealZephryss/status/1939392046151926243?t=TwkFG62dMpthQvGOFslZ_Q&s=19 At this point, it's an open secret. I'm extremely curious to see how Ubisoft handles this since this is their first remake (correct me if I'm wrong)",
        "comments": [
            {
                "raw_content": "Yeah, that’s just straight up an announcement by him. Lmao The words that are missing are only the obvious ones.",
                "author": "Disastrous-Pair-6754"
            },
            {
                "raw_content": "I would also like to show some appreciation to Matt Ryan for his amazing performance as Edward. Still one of my favorite performances to this day. Edward had an amazing arc, but the performance behind the character was equally as important.",
                "author": "KvasirTheOld"
            },
            {
                "raw_content": "this really is Ubisoft's worst kept secret",
                "author": "scott1swann"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "RTX 5070 Super 18GB and RTX 5070 Ti Super 24GB leaked",
        "score": 330,
        "text_content": "It seems like Nvidia is already cooking some of the the Super refresh variant of GeForce RTX 50 series and here is the specs of them according to Kopite7Kimi a highly accurate leaker of Nvidia Hardware in general. **GeForce RTX 5070 Super** PG147-SKU65 GB205-400-A1 6400FP32 192-bit GDDR7 18GB 28 GBps 275W **GeForce RTX 5070 Ti Super** PG147-SKU55 GB203-350-A1 8960FP32 256-bit GDDR7 24GB 28GBps 350W [https://videocardz.com/newz/nvidia-geforce-rtx-5070-super-reportedly-features-6400-cuda-cores-and-18gb-memory](https://videocardz.com/newz/nvidia-geforce-rtx-5070-super-reportedly-features-6400-cuda-cores-and-18gb-memory) [https://videocardz.com/newz/nvidia-also-planning-geforce-rtx-5070-ti-super-with-24gb-gddr7-memory](https://videocardz.com/newz/nvidia-also-planning-geforce-rtx-5070-ti-super-with-24gb-gddr7-memory)",
        "comments": [
            {
                "raw_content": "Now let's see the prices lmao",
                "author": "Dycoth"
            },
            {
                "raw_content": "Bro, what a fkin joke of a company. Imagine giving them the confidence, you buy an overpriced 5070, just to see how the company releases what the 5070 should have been since day one, 6 months later.",
                "author": "Joker28CR"
            },
            {
                "raw_content": "So higher wattage and more VRAM is the only difference between the 70 ti super and 80 super? Wonder what the performance increase will be then.",
                "author": "Nice_promotion_111"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "New screenshots of the Sonic the Hedgehog Movie pre-redesign have surfaced online, with the original poster claiming to have videos too",
        "score": 589,
        "text_content": "https://xcancel.com/joe44951318/status/1939004244427973114?s=46 Seems the original Sonic cut might be the next big piece of lost media to be found. Not sure where he’s getting this stuff, but the scenes in question appear to be very rough CGI of the roof chase scene, Donut Lord & Sonic in the car, the Mushroom Planet Eggman gets sent to at the end of the film, and the lumberjack scene",
        "comments": [
            {
                "raw_content": "Why is this fart fetish page posting seemingly real leaks 😭",
                "author": "NeoContext"
            },
            {
                "raw_content": "Wtf is that first image of Sonic smiling? Nightmare fuel",
                "author": "Fradegra"
            },
            {
                "raw_content": "Apparently an almost completed version of the whole movie with the old design exists out there. It’s been confirmed by CG artists on the film as well as voice actors who were dubbing it for other languages before the redesign. All that’s left is to leak it.",
                "author": "AwesomePossum_1"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "AMD Radeon HD 4850 Toxic",
        "score": 157,
        "text_content": "This was my first proper GPU back in the days! The HD 4850 offered crazy performance for the money, exceeding the 9800 GTX and sometimes getting close to the GTX 280, which were both way more expensive cards. This is the \"Toxic\" variant by Sapphire. It had a low profile, all cooper cpu cooled grafted to it! This made it ran cooler and overclocked well. The GPU already had a factory overclock too if I recall correctly. I never sold the card, as I remember the excitement of having this card in my computer back then. Last week I decided to 3D print a display holder for it, I think it looks pretty neat! Anyone else here owned a Toxic back in the days?",
        "comments": [
            {
                "raw_content": "The Zalman VF900Cu is a timeless beauty",
                "author": "Lord_Waldemar"
            },
            {
                "raw_content": "Oh the memories ❤️ Far Cry 2 and 3, Dragon Age Origins, Skyrim, Witcher 2… this generation of GPUs took all games head on. Still have my HD4870 👌🏻",
                "author": "Particular-Whereas98"
            },
            {
                "raw_content": "Damn now I feel old. The first card I was excited about was a voodoo2 by 3dfx. Unreal was a big game at the time and that pc build cost me a small fortune. Probably 7K in today’s dollars for the whole package.",
                "author": "sssawfish"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "New to the PC scene",
        "score": 30,
        "text_content": "Radeon rx580 GPU; Ryzen 5 1600 6core; 16gb RAM; and 3tb HDD.",
        "comments": [
            {
                "raw_content": "Nice clean build!",
                "author": "TuneComfortable412"
            },
            {
                "raw_content": "Nice bro, hope ya have a great time on it. Obligatory comment on cable management. I'd definitely use the cut out at the bottom for your gpu's psu cable. Would make the build look much cleaner already.",
                "author": "lioboii"
            },
            {
                "raw_content": "Everything is solid and it’s a good looking build! I hate to be that guy because obviously this is meant to be a budget build, but just an obligatory warning about ADATA. I’ve had a couple of their SSDs fail on me. But no big deal. Just keep everything important backed up and it will serve you well :)",
                "author": "GarrettB117"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Median household income by education",
        "score": 29,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Weird cause most people I know who don’t have a degree make more money than those with a degree. Guess that’s just blue collar trade jobs I’m around",
                "author": "fart_huffer-"
            },
            {
                "raw_content": "Ready for the downvotes, but student loan cancellation will always be classist, and no one can convince me otherwise. Literally everyone I know who went to college makes significantly more than my non college educated peers.",
                "author": "Thin_Vermicelli_1875"
            },
            {
                "raw_content": "What is the data source for this? Some of these numbers seem off.",
                "author": "Haluszki"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Homeownership: Not Enough Supply for Middle-Income Buyers / For teachers, nurses and other skilled workers, few options.",
        "score": 10,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Atlanta sees fourth largest yearly home price drop in US, data shows",
        "score": 3,
        "text_content": "Home prices across metro Atlanta have dropped markedly in the last year, as a recent influx in available supply has helped bring balance to the housing market. https://www.bizjournals.com/atlanta/news/2025/06/27/metro-atlanta-home-prices-decline-may-2025.html I have said it last year the Atlanta suburbs are primed to become the next Austin. And that is slowly starting to happen, rampant amount of RE investors and WFH crowd bought here during COVID boom. Now they are realizing what they got themselves into, in mean time builders are cranking out home left and right.. One of our friends who has been RE industry in GA for decades was appalled by all this he started cashing out last year and locked up rest with long term leases. He is expecting things to get bad there..",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Apartments.com Rent Report for May 2025: Summer Moving Season Taking Shape",
        "score": 27,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Summer is the busiest season for moving. During the summer months, it may be slightly more difficult to find rent concessions (or even an apartment in certain markets), but the good news is that rent prices are holding fairly steady. Key Takeaways: * Average rent rose by 1.0 percent month-over-month. * The vacancy rate increased slightly to 8.1 percent, though luxury apartments bucked the trend with falling vacancies. * Rents are expected to increase by 2.0 percent by the end of 2025 due to steady demand and fewer new apartments. In May, the national average rent was $1,628 per month for a one-bedroom apartment and $1,884 for a two-bedroom. For the second month in a row, rent prices inched up by 1 percent. While the vacancy rate fell slightly in April, it bounced back to 8.1 percent in May, back to where it was in March. While the Sunshine State has struggled for several months with high vacancies, the tide is turning. Jacksonville, Orlando, and Tampa all made the top 10 list of the “most improved multifamily markets” ranked by CoStar. This ranking index analyzed the top 48 US markets with more than 100,000 apartments to determine which were most improved. This means that the vacancy rates in these cities are falling, and rent prices are starting to increase. So, if tropical weather and endless stretches of beaches are in your immediate future, you could see higher rent prices in these sought-after areas. Luxury Apartment Vacancy Rates Drop May showed a turnaround for one of the hardest hit markets since the pandemic: luxury apartments. They’re now filling up faster than new ones are being built, which has lowered the vacancy rate to 11.2 percent, the lowest we’ve seen in a while. Conversely, affordable apartments are seeing an increase in vacancies, up to 5.6 percent. In some cities, new buildings are offering special deals, like free rent for the first month or reduced fees, to attract renters and fill units faster. In April, Rochester, New York saw the biggest jump in rent prices, up 4.3 percent. In May, another Northeastern city topped the list: Brookline, Massachusetts. For May 2025, here are the cities with the biggest rent increases: * Brookline, MA: +6.7% * Hollywood, FL: +5.7% * Chicago, IL: +4.2% * Brooklyn, NY: +3.1% * Columbus, OH: +3.1% May 2025 Rent Decreases by City In April, Austin continued its downward trend, topping the list with a rent decrease of -4.5 percent. For May, rent fell in several southern and mountain markets, especially those facing an oversupply of new units: * Cape Coral, FL: -4.8% * Denver, CO: -2.8% * Fort Myers, FL: -2.4% * Sarasota, FL: -2.3% * Austin, TX: -2.1% It’s worth noting that Austin and San Antonio are still reporting the highest vacancy rates in the country, hovering around 15 percent. This could keep prices down in these areas for the next few months. Looking Ahead: Moderate Growth with a Side of Uncertainty Economists expect rent prices to rise by about 2 percent in the second half of 2025, fueled by steady demand and fewer new deliveries. That said, uncertainty looms. Ongoing tariff-related price hikes could impact consumer behavior, and if job growth slows, it might curb the appetite for new leases. Still, most signs point to a stable (if uneven) climb. Significant variation in rent performance is likely to persist through the end of the year, with regional trends heavily influenced by local supply, economic health, and renter preferences.",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Nick Bostrom says AGI won’t stop at the human level, it will quickly lead to superintelligence. From there, machines will outthink the best scientists and invent everything else -- faster and better than humans. \"It's the last invention we’ll ever need.\"",
        "score": 332,
        "text_content": "",
        "comments": [
            {
                "raw_content": "when",
                "author": "gfy_expert"
            },
            {
                "raw_content": "Huh, he's just repeating what I've already heard two thousand times.",
                "author": "Swimming_Cat114"
            },
            {
                "raw_content": "I want it today",
                "author": "Puzzleheaded_Soup847"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Ilya Sutskever says future superintelligent data centers are a new form of \"non-human life\". He's working on superalignment: \"We want those data centers to hold warm and positive feelings towards people, towards humanity.\"",
        "score": 193,
        "text_content": "",
        "comments": [
            {
                "raw_content": "when is this from ? old or recent ?",
                "author": "Loud_Seesaw_6604"
            },
            {
                "raw_content": "When did this interview happen? Where is the source?",
                "author": "DiogneswithaMAGlight"
            },
            {
                "raw_content": "So the people racing to create X think X could destroy society and humanity. That's a whole lot of cognitive dissonance to hold in your head. I guess they cling to the notion that it *might* work out well.",
                "author": "AddressForward"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The fact that Zuck could poach almost like 10 important researchers from OpenAI in the last week and absolutely none from Anthropic tells you a lot about where this is going",
        "score": 1052,
        "text_content": "Yes, I know this can age terribly. But, Anthropic has had a cracked team with very little attrition for years. They have a CEO who knows what they're doing. They are focused on what they do best (and what they have the capabilities for), they are not trying a hundred different random things and roll out shitty version of those. They are untouchable in coding and has the best aligned and most useful chat assistant overall. If we think of AGI as being an autonomous agent capable of carrying out hard, long-horizon tasks, then they are the closest to that than anyone else. I think they are the company that will offer most competition to Google. Their downfall could be their over zealousness for AI safety and somewhat pretentious nature of some of their researchers who think they know what's best for the users. I also think Meta is not going anywhere, you cannot do anything with a bunch of mercenaries and with no long-term vision.",
        "comments": [
            {
                "raw_content": "openai is way bigger than anthropic. the bigger your company gets, the less ideological your employees are, which means they are poachable and will go wherever the money is.",
                "author": "imlaggingsobad"
            },
            {
                "raw_content": "Could just be how the stock options are structured. Could also be the insane board of OpenAI Edit: more likely anthropic has offered to match the zuck offer to anyone who gets actively scouted by meta.",
                "author": "1234golf1234"
            },
            {
                "raw_content": "At least now we know why OpenAI employees and Sam kept teasing they have AGI already - because they clearly are not even remotely close. No top dev leaves the company that is about to rule the world.",
                "author": "magicmulder"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "This is your daily reminder that GPT-5 is NOT a router its a unified single model confirmed by like 50 people at OpenAI",
        "score": 138,
        "text_content": "[https:\\/\\/x.com\\/kevinweil\\/status\\/1889924247075815737](https://preview.redd.it/2hrgou5s1w9f1.png?width=603&format=png&auto=webp&s=4fdc3735083cb88bf3c4b310e1f058cf1affb139) Take just one, for example, but there's a lot of OpenAI employees who have all confirmed",
        "comments": [
            {
                "raw_content": "This is your daily reminder that GPT-5 is NOT out yet it is all hype and they could change their mind at the last minute and claim unified didn't work.",
                "author": "Nukemouse"
            },
            {
                "raw_content": "I'm not really interested in upgrading if it's main feature is no need for switching models. That was never a problem.",
                "author": "NonPrayingCharacter"
            },
            {
                "raw_content": "GPT-5 is not anything until it's released and tested by independent people.",
                "author": "deavidsedice"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini CLI Organizing My 400 Files Notes In A Half Hour, Even Made Meaningful Connections Between Various Topics",
        "score": 97,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I take notes in Anytype (another note taking app), I exported those notes, they were just bunch of markdown Files with attachments, I added it to Obsidian Vault and ran Gemini CLI over it. First I asked it to just rename, organize and properly structure the notes and then asked it to make useful and meaningful connections for graph view in Obsidian. It nailed it perfectly and what's unbelievable is it did it with 90% context window always remaining free. I'd say accuracy is approximately 95% which cab be made 100% for sure if you tell it to read the Full Files. It'd take significantly more time though (around 2 Hours for the same task).",
                "author": "Ryoiki-Tokuiten"
            },
            {
                "raw_content": "Wow that’s an actual use case and also I can see that it was entirely done by flash and not pro",
                "author": "horse_tinder"
            },
            {
                "raw_content": "I'd love to test this idea using symbolic decoder mapping. It should help significantly.",
                "author": "GhostArchitect01"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Seemingly AI-generated band The Velvet Sundown have over 400,000 monthly Spotify listeners",
        "score": 67,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Gemini says they are likely making $1500-$2000 a month on 400,000 streams a months. However, now that people know they can make money doing this Spotify is going to be deluged in even more AI music than before. While most songs will never be heard, the fact remains there will be more songs in general and thus more changes for one song to be picked over another. This means more supply at the same demand, so the same amount of money being spread out over more people.",
                "author": "yaosio"
            },
            {
                "raw_content": "I have tried the latest Suno (v4.5) and it is very good. But as with any AI, you need to learn good prompting techniques. And I have found the best results if I use another state-of-the-art AI specialised for text (like Gemini) to iteratively write the lyrics and help with the prompt (just give it Suno prompting manual).",
                "author": "Marha01"
            },
            {
                "raw_content": "And only 395,000 of those are AI listeners!",
                "author": "Gormless_Mass"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Anthropic’s AI utterly fails at running a business — 'Claudius' hallucinates profusely as it struggles with vending drinks \"It's like a business graduate with no common sense.\"",
        "score": 26,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I think if you had one instance of Claude specialize in a single area, and each instance had a clear system prompt with guidelines, it would have done way better. Making the same instance handle all of this with potentially vague instructions is a recipe for disaster.",
                "author": "Silver-Chipmunk7744"
            },
            {
                "raw_content": "I love how this sub changed over last year. Seriously reading it when chain of thought was announced I felt like the AGI is on the corner and the world I know is dying. Now... Well...",
                "author": "umotex12"
            },
            {
                "raw_content": "This is good research.",
                "author": "Best_Cup_8326"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI employee reacting to Meta hiring 4 more openAI researchers",
        "score": 709,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If it’s a huge loss, then Meta better be a top 5 competitor within 2 years They have the most GPUs and reputable researchers now.",
                "author": "Condomphobic"
            },
            {
                "raw_content": "Considering openai was founded by poaching researchers from all over, fair game.",
                "author": "DeGreiff"
            },
            {
                "raw_content": "If OpenAI was close to anything \"big\", it seems odd for their top researchers to just fuck off like this. I could be very wrong but that's my reasoning.",
                "author": "Fleetfox17"
            }
        ],
        "subreddit": "singularity"
    }
]