[
    {
        "post_name": "Canada's Strategic Military Advantage",
        "score": 701,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Never once has Canada said thank you for us permitting them to be our gay hat",
                "author": "Zskills"
            },
            {
                "raw_content": "Can't take anyone seriously who says the word *aboot/aboat*. Look, it's easy: 'ab'...'out'.",
                "author": "FreedomFromGovt"
            },
            {
                "raw_content": "I would welcome with open arms rhe liberation by America canada is a shithole since trudeau. Flooded be moslems chinks and jeets. Its no longer canada and with the current fags running the place soon to be like the uk arresting anyone who speaks out. End canada now",
                "author": "CheeseAndOnion"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: President Trump officially announces a \"deal on economic and trade relations with China:\"",
        "score": 707,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Meh. Let's see if China sticks to its end of the bargain. History suggests they lie to your face then fuck you over.",
                "author": "zigZag590"
            },
            {
                "raw_content": "While I don't trust China, if this deal gets broken later on this won't be much egg on our face. If it succeeds, we objectively got the better end of the deal. So, win-win!",
                "author": "Minn2000"
            },
            {
                "raw_content": "https://x.com/kobeissiletter/status/1984791737928192393?s=46&t=taS0KloP4YcMU_yPTfKJ2w https://www.whitehouse.gov/fact-sheets/2025/11/fact-sheet-president-donald-j-trump-strikes-deal-on-economic-and-trade-relations-with-china/",
                "author": "realPhantomFuck"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "New data shows illegals in New York are being paid 65% more on SNAP food stamps than American citizens.",
        "score": 789,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Well yeah, how else do you think they're kept here. Food, housing, clothes, licenses, plane tickets, etc all on our dime. So while deporting is important, remember who enabled and brought them here.",
                "author": "IForgotToAddAnEmail"
            },
            {
                "raw_content": "Buying votes ain't cheap.",
                "author": "Braineack"
            },
            {
                "raw_content": "Make anyone receiving this qualify and work. Only US Citizens, reapply every 3 months or get lost. Make applying like a colonoscopy",
                "author": "Speedgraphic69"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "DHS Arrest 46 Illegal Aliens in New Jersey Freight Warehouse Raid – Consists of 22% of Their Onsite Workers. Law enforcement personnel carried out the inspection at a Federally Authorized container freight station as part of an ongoing campaign to ensure compliance with immigration regulations...",
        "score": 656,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Name the company charge and punish them, contact them inviting them to FUCK OFF.",
                "author": "Bramage"
            },
            {
                "raw_content": "Arrest the CEO, arrest the entire HR staff, arrest all the managers and supervisors. Arrest anyone that knew about this, or enabled it. Make the penalty ten year’s minimum in a supermax prison. This crap will stop tonight.",
                "author": "Themis595"
            },
            {
                "raw_content": "Hahahaha dude the disrespected trucker on x just said something to this effect. That these places would be a goldmine of illegals. Haha",
                "author": "EdBuck"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 EPIC! Scott Presler is leading voters to surge to early voting locations in New Jersey - voting for JACK CIATTARELLI. The LAST DAY to vote early in-person is TOMORROW. Election day is Tuesday. It's time to flip New Jersey RED! 🔥",
        "score": 1126,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# TURN # NEW # JERSEY # RED",
                "author": "ProtestantPatriot777"
            },
            {
                "raw_content": "Based Gay",
                "author": "DingleBalls"
            },
            {
                "raw_content": "I’ve heard that disgruntled lesbian Bruce Springsteen wants New Jersey to remain blue",
                "author": "MAGAguitar"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This is crazy. A group of illegals occupying Chicago apartment buildings have formed a “union” and are refusing to pay rent, citing ICE raids and fear of working outside the house for their inability to pay the hikes under the new landlord.",
        "score": 910,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Perfect, ICE knows exactly where to find them all then! National Guard to surround the area and ICE goes in door to door and drags them out onto buses!",
                "author": "DLane1"
            },
            {
                "raw_content": "They're getting free advice. Once even illegals get involved in landlord-tenant disputes, they've got all the advantages. And judges will bar their evictions, despite their illegal alien status.",
                "author": "mateus"
            },
            {
                "raw_content": "The name of the new land lord- Imran Khan They deserve each other",
                "author": "LaWhoreVagistani"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 The sleeper cells have been activated. Ayob Nasser, a 20-year-old Dearborn, Michigan resident from the home that was raided by the FBI yesterday —where four suspected individuals were detained as part of a foiled ISIS-inspired Islamic terror plot targeting Americans on Halloween weekend.",
        "score": 1067,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Remove kebab.",
                "author": "DeusVult1096"
            },
            {
                "raw_content": "☪️☪️☪️Dearborn☪️☪️☪️",
                "author": "RuprechtThaMonkeyBoy"
            },
            {
                "raw_content": "We are under attack at every possible angle",
                "author": "Thatunknownguy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "What do you call a country that votes for a President and ends up ruled by the Judicial branch?",
        "score": 722,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ignore these judges!",
                "author": "JoeBidensDementia1"
            },
            {
                "raw_content": "Ju-docracy?",
                "author": "NADSAQ"
            },
            {
                "raw_content": "Time to forge ahead, let the judges seethe. If we don't have a functioning Executive branch, we have nothing. The sheer amount of fuckery from these robed faggots is clear abuse.",
                "author": "FrmrAmericanRepublic"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "⚠️ The LAPD has declared a citywide \"Tactical Alert\" in response to potential celebrations or unrest following the Dodgers’ game outcome. The situation remains developing...",
        "score": 793,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Dodgers fans suck",
                "author": "Steelers-Fans-Suck"
            },
            {
                "raw_content": "For those wondering, the score was I don't give a shit, - fuck em",
                "author": "Slickyslim33"
            },
            {
                "raw_content": "Round them up ICE.",
                "author": "RuprechtThaMonkeyBoy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔴“It is very important that Ilhan Omar is a Somalian and that she is in the government for us” - Former Prime Minister of Somalia. SHE SHOULD GO BACK TO SOMALIA",
        "score": 726,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Deport and ban from coming back.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "Fuck her and fuck the commies who continue to vote for her",
                "author": "DementiaJoseph"
            },
            {
                "raw_content": "Shouldn't he be focusing on Somalia and not other countries' politics? Pretty sure Somalia has plenty of pressing domestic issues right now far more in need of attention by its leadership.",
                "author": "N14205ST205"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "traitors cant be reasoned with",
        "score": 1034,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is fan fiction. We won't arrest anyone in the deep state for anything other than an administrative or process crime.",
                "author": "TheSwampThang"
            },
            {
                "raw_content": "Lord help us when the swamp regains the White House.",
                "author": "Get_Off_Big_Tech"
            },
            {
                "raw_content": "What will actually happen: Nothing.",
                "author": "DrWeeGee"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔴Trump Truth: \"If the N I G E R I A N Government continues to allow the killing of Christians, the U.S.A. will immediately stop all aid and assistance to N I G E R I A , and may very well go into that now disgraced country, “guns-a-blazing,” to completely wipe out the Islamic Terrorists\"",
        "score": 1563,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Guns A Blazing!!!",
                "author": "Herpawinski"
            },
            {
                "raw_content": "Why are we sending them aid in the first place? What countries are we NOT sending aid to?",
                "author": "Wrexxis780"
            },
            {
                "raw_content": "Stop all aid…starting with Africa. Why are we still a tax theft funded dough-nation…?",
                "author": "GreyKnight"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Remember, Republicans, regardless of the Schumer Shutdown, the Democrats will terminate the Filibuster the first chance they get. They will Pack the Supreme Court, pick up two States, and add at least 8 Electoral Votes. Their two objectors are gone!!! Don’t be WEAK AND STUPID. FIGHT,FIGHT, FIGHT!",
        "score": 1261,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Let’s simply this: OPTION A: - Republicans remove filibuster. - Once back in power, Democrats are no longer restrained by the filibuster. OPTION B: - Republicans don’t remove filibuster. - Once back in power, Democrats remove the filibuster, and are no longer restrained by the filibuster. Trump is right. Keeping the filibuster is fully retarded. It only restrains Republican legislation.",
                "author": "ModsAreCucked"
            },
            {
                "raw_content": "Problem is, if the Repubs end the filibuster, they won't go nuclear with it now that they have the chance. The dims will. The problem is the Republicans, not the filibuster.",
                "author": "MemeWarsVet"
            },
            {
                "raw_content": "I could get behind this if Republicans were actually going to reduce government and address corruption. But they won't; they'll just keep spending too much and protect the swamp.",
                "author": "RocksCanOnlyWait"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: Major incident unfolding as up to 10 people stabbed on a train in Huntington, Cambridgeshire.",
        "score": 907,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Probably the Amish again.",
                "author": "LegendFang"
            },
            {
                "raw_content": "Islam isn't compatible with western values.",
                "author": "GA_Logic"
            },
            {
                "raw_content": "Stabbing of peace.",
                "author": "DeusVult1096"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A Public Service Announcement for staying safe while shopping during the Shut-Down.",
        "score": 1543,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Books aisle, basically invisible.",
                "author": "TinfoilHardhat"
            },
            {
                "raw_content": "Stay the fuck away from the watermelons.",
                "author": "Skogin"
            },
            {
                "raw_content": "I will be sheltering in place at the library or local job center during the shutdown..",
                "author": "lul_cheto"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Mysafespace",
        "score": 752,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://www.whitehouse.gov/mysafespace/",
                "author": "_C_I_A_"
            },
            {
                "raw_content": "This is beautiful",
                "author": "mlp67"
            },
            {
                "raw_content": "I voted for this",
                "author": "Zskills"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The evil Canadian governments won't stop, and this is from the Premier of British Columbia. It is the tariff reeeee combined with the 'Russia, Russia, Russia' lie. \"British Columbia\", the British-origin are gone. Crying over a small charge to US consumers for sad lumber, ignoring India invasion.",
        "score": 815,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They need us. We don't need them.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "Unlabeled charts: my favorite! You have no idea what any of it means, but you just know it's bad!",
                "author": "Minn2000"
            },
            {
                "raw_content": "Russian INDUSTRY Canadian INDUSTRY American .... CONSUMERS Hold up.",
                "author": "MocksFordComma"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Everyone interviewed in this sob story from Detroit is a single mom and 250lbs plus. Where are the dads? Why are they all so fat?",
        "score": 1046,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This happens where I live. The cars are brand new and the divers are all over weight.",
                "author": "FusionBlack"
            },
            {
                "raw_content": "why do they post the ages? should be Kolleen Miller, 243 lbs of auburn hills. And Raj Kumar, h1b pantry engineer?",
                "author": "sixfingerdildo"
            },
            {
                "raw_content": "There is something ironic about a healthy sized man who presumably works AND donates his free time to help give and load food for an overweight obese woman who doesn’t work, presumably also doesn’t donate her free time to help others, and watches him do it while she is exerting absolutely zero energy.",
                "author": "lifeisahologram"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The world saw tariffs. Trump saw tactics.",
        "score": 1019,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Winning.",
                "author": "KuzoKevin"
            },
            {
                "raw_content": "I LITTERALLY voted for this.",
                "author": "CaliAli"
            },
            {
                "raw_content": "NOT WINNING! Why not move processing to the United States? If we’re serious about ending foreign dependence, we should be building capacity here—not outsourcing to a Muslim-majority country or a country with a history of political coups and deep economic reliance on China. Strategic autonomy doesn’t come from shifting dependency—it comes from eliminating it.",
                "author": "TheWeasel"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Proof SNAP is vote buying by Dems: Rural poverty SNAP rate 15% in PA. Blue city SNAP rate in Philly and Pittsburgh: 30%. End EBT.",
        "score": 938,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Government benefits *in general* buys votes for Democrats. Democrats basically want this country to become like Europe, in which you make shit salaries, they tax you like crazy, under the guise of government benefits.",
                "author": "McFatty7"
            },
            {
                "raw_content": "do rural people grow their own food?",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Agreed. EBT not being funded is not a crisis. The corrupt use of EBT going on for so long is the real crisis. End it.",
                "author": "TheMemeSpiceMustFlow"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A 24-megawatt Chinese data center is a pilot project for a wind-powered underwater AI infrastructure using the sea as a heatsink",
        "score": 146,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don't know why they need more than a swimming pool inside a closed loop system which then just has free running river in it",
                "author": "ConditionTall1719"
            },
            {
                "raw_content": "As the article mentions, Microsoft conducted a similar trial a while back. https://natick.research.microsoft.com/ https://news.microsoft.com/source/features/sustainability/project-natick-underwater-datacenter/ It's certainly interesting as a concept, but the main hurdles seem to be serviceability and long term corrosion from sea water. Side note, this was an interesting detail: > China requires that a data center use no more than 1.25 times as much energy as it uses on the IT components that actually do the work, which doesn't leave a ton left over for cooling. That's an interesting piece of legislation. Pleasantly surprised China's going for that regulatory approach. Though hopefully not too many side effects (e.g. water usage from evaporative cooling).",
                "author": "Exist50"
            },
            {
                "raw_content": "Great, but I'd rather see that excess heat be used for things like district heating. Heat is energy, sounds a little wasteful just to use the energy to precook fish.",
                "author": "ConsistencyWelder"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Leaker reveals which Pixels are vulnerable to Cellebrite phone hacking",
        "score": 180,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Tldr is newer softwares and Pixels are consistently harder for celebrite to break, especially if locked and before first unlock. GrapheneOS, interestingly (but perhaps unsurprisingly to anyone familiar with it) is harder to break than the stock ROM across the board.",
                "author": "AbhishMuk"
            },
            {
                "raw_content": "Possibly an earlier source: [Someone Snuck Into a Cellebrite Microsoft Teams Call and Leaked Phone Unlocking Details](https://www.reddit.com/r/GrapheneOS/comments/1ok3gra/someone_snuck_into_a_cellebrite_microsoft_teams/).",
                "author": "pdp10"
            },
            {
                "raw_content": "Extract what sort of data though?",
                "author": "shopchin"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Steam Hardware & Software Survey: October 2025",
        "score": 1,
        "text_content": "AMD 9000 series still shows up only on the linux-only table. Windows 11 got a huge jump thanks to the end lf support for Windows 10.",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Do you use game chat regularly?",
        "score": 227,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Never used it",
                "author": "Downtown-Wishbone-26"
            },
            {
                "raw_content": "Bought the thing day one and I don’t think I’ve ever clicked the button",
                "author": "Brilliant-Day-2542"
            },
            {
                "raw_content": "Yeah, I constantly accidentally press it instead of Home",
                "author": "crunchwrap_jones"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "It's a new month of Nintendo Switch 2 and Nintendo Switch games. What's on your wishlist for November?",
        "score": 310,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Jesus christ my poor bank account",
                "author": "Benefit_thunderblast"
            },
            {
                "raw_content": "Terminator!",
                "author": "christianb19871"
            },
            {
                "raw_content": "Hyrule warriors age of imprisonment and kirby air riders.",
                "author": "Thegoodgamer32"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I've changed my mind completely on NSO since it launched. Not only am I now okay with it, I think it's pretty damn fantastic",
        "score": 771,
        "text_content": "Disclaimer: I did not and never will like locking basic online functionality behind a paywall. This topic is about the classic games and extras *not* the ability to play online. \\--- I'm playing Luigi's Mansion right now. Love the series, but somehow never played the original before. And it's great! I've been playing a lot of F-Zero GX too and plan to replay Wind Waker when I get the chance. I even recently picked up the GC controller. And I've got to say, each new GC game feels like a far bigger event than on any of the previous consoles, more akin to actually receiving a new game. I'm already looking forward to inevitable additions like Twilight Princess and Metroid Prime 2 as much as if they were new upcoming releases. But of course, Gamecube is not all there is. Over the last couple of years I've also played and enjoyed - and even discovered - a ton of games on the other services too. I played Minish Cap and Zero Mission for the very first time, finally beat Super Metroid for the first time, discovered the absolutely awesome GBA F-Zero games, finally got to experience Sin and Punishment. Plus, all my old favourites are there too. I know the GC releases are coming pretty slowly, but as mentioned, each one feels like a big release, and in the meantime, all the other consoles have several dozen games each - and with a few notable exceptions (Smash) all the big first-party games from each system are available to you on one pretty cheap service. Yes, I'd like to be able to buy and download individual titles too, but in the absence of that, as an online collection of classic Nintendo games, the **several years of drip-feeding has resulted in the slow build up of what is now an impressively deep ocean of content**. I was a major sceptic when the service launched, but over the years it's really come good on its potential. Of course, there's still room for improvement, but so far it's only got better as time's gone on anyway so - even if it's only in the form of more games and consoles - further improvement is as good as guaranteed. When base NSO launched, I only begrudgingly shelled out because I felt forced to in order to play online. When the Expansion Pass launched, I thought I'd give it a go just to play a couple of old classics then let the subscription lapse. But as time's passed, I've got more and more value out it and have now gone full 180 - not only do I now merely accept it as being what's offered, I'm an active fan of the service.",
        "comments": [
            {
                "raw_content": "I just wish they added games more frequently. The release schedule is so slow.",
                "author": "looney_jetman"
            },
            {
                "raw_content": "Please remove the borders or make them less visible",
                "author": "AdWrong9530"
            },
            {
                "raw_content": "For the most part Nintendo have managed to do a respectable job on the emulators They even recently improved the CRT filter for the SNES Still the N64 NSO was a mess at launch and it would be nice if they could reduce the input lag of GameCube Classics",
                "author": "DevouredSource"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Wario bounce strat",
        "score": 107,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I love that they made a Cataquack a playable character in this game.",
                "author": "shadow0wolf0"
            },
            {
                "raw_content": "Nice",
                "author": "danielmc4400"
            },
            {
                "raw_content": "This is why I dont play online lol",
                "author": "RecentlyDeceased666"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Spongebob saga acquired",
        "score": 99,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Rehydrated is my favorite! And I’m so excited for Titans of the Tide!",
                "author": "SkywardFork"
            },
            {
                "raw_content": "Now if only that got licensing rights to remake the movie game",
                "author": "Entire_Paramedic_389"
            },
            {
                "raw_content": "How is the Patrick Star game?",
                "author": "HyrulePolitik6492"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Hyrule Warriors November 6th",
        "score": 2,
        "text_content": "Yesterday I was able to play a 10 Minute Demo of the Upcoming Hyrule Warriors on Nintendo Switch 2 and I can say it played so Smooth and Looked Really good. It will definitely be a Day 1 Pick for me, but people that have Doubts be at ease. It runs Smooth like Butter and is Really Fun!!! Will you guys be getting it Day 1???",
        "comments": [
            {
                "raw_content": "I was searching for reviews for this game just earlier today and there's literally none out there 3 days before release. Having never played Age of Calamity, only BOTW and TOTK, how does it compare to those two?",
                "author": "marratj"
            },
            {
                "raw_content": "How was the camera? One thing I didn't like about the others was how it automatically turns to follow your character. Id prefer it only controlled by me",
                "author": "johnorama"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Charging dock Pro / Joycons",
        "score": 2,
        "text_content": "Has anyone found a simple / single solution for charging the Pro 2 controller and joycons for Switch 2? Haven’t been able to find one docking station solution yet",
        "comments": [
            {
                "raw_content": "The brand 'Bluebuilt' does have some charging stations for the Switch 2 (at least here in Europe). This video here shows a switch 1 and 2 dock in 1: [fastsnail nintendo switch 2 & 1 dock] (https://youtu.be/10Nz1Pff3Uk?si=Bk9Q6wS3vcrC6yVV) Fastsnail amazone: [amozone](https://www.amazon.com/dp/B0F6NBVYJ3?&linkCode=sl1&tag=allgamesplaye-20&linkId=ea4bef4d83386fec7e746d19791e8b37&language=en_US&ref_=as_li_ss_tl) I hope this helps!",
                "author": "No_Plankton7982"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Delisted Xbox 360 games are showing as \"Coming soon'\" on the Microsoft Store in some regions",
        "score": 226,
        "text_content": "Most likely a technical glitch but still interesting [Source](https://xcancel.com/JBishie/status/1984775244008046982?t=daTdUrSiRl1DccKCbTny7w&s=1)",
        "comments": [
            {
                "raw_content": "they're making the Xbox 720",
                "author": "LolcatP"
            },
            {
                "raw_content": "Ha wouldn’t that Arkham origins remaster be sweet",
                "author": "Necessary_Crazy_8587"
            },
            {
                "raw_content": "Anyone know why Arkham origins been delisted? Like WB owns that game 100% right? They own the Batman ip and the studio that made the game so why would it be delisted",
                "author": "Embarrassed-Dust718"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Silent Hill 2 Xbox version and Born From A Wish DLC hinted at by Bloober Team writer Grzegorz Like",
        "score": 118,
        "text_content": "[https://xcancel.com/GrzegorzLike/status/1984272317296545906](https://xcancel.com/GrzegorzLike/status/1984272317296545906) [https://xcancel.com/GrzegorzLike/status/1984281440243405132](https://xcancel.com/GrzegorzLike/status/1984281440243405132) this was just yesterday",
        "comments": [
            {
                "raw_content": "They are terrible at keeping secrets",
                "author": "NameisPeace"
            },
            {
                "raw_content": "I’ve been waiting to play this since the remake got announced I really hope this is real",
                "author": "GrapefruitSea7656"
            },
            {
                "raw_content": "likely announced November 10th at the Xbox Partner showcase that is meant to showcase Play Anywhere, Handheld Optimization tag, AutoSR. November 10th is the date when Fallout 4 becomes PA retroactively. Others are Baldurs Gate 3 and Mortal Kombat 1 becoming PA. Silent Hill F is Play Anywhere, with Console, PC, Cloud, and a pending Handheld tag. so Silent Hill 2 might be the same also. [https://www.xbox.com/en-US/games/store/silent-hill-f/9n5nfrqv2hqq](https://www.xbox.com/en-US/games/store/silent-hill-f/9n5nfrqv2hqq)",
                "author": "Tobimacoss"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Fortnite X Harry Potter collaboration might be happening",
        "score": 35,
        "text_content": "[Source](https://www.reddit.com/r/FortniteLeaks/s/h0dibcDq3F)",
        "comments": [
            {
                "raw_content": "I was curious so I looked it up, but Fortnite now has over 2,500 skins in game. Holy shi",
                "author": "SilentNova300"
            },
            {
                "raw_content": "Honestly surprised it took this long considering every major IP under WB is in there.",
                "author": "Rage_inducer13"
            },
            {
                "raw_content": "Pretty much every major IP has been in Fortnite at this point",
                "author": "LollipopChainsawZz"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Splatter World leaked onto 4chan - Unreleased Splatterhouse Famicom RPG",
        "score": 212,
        "text_content": "https://splatterhouse.kontek.net/new.html Unknown how much of the game is completed and playable, only works in FCEUX.",
        "comments": [
            {
                "raw_content": "I would play the shit out of that game. I think a horror themed rpg would sell like crazy in today’s world…",
                "author": "BurtRaspberry"
            },
            {
                "raw_content": "I hope Splatterhouse returns one day. The remake was jank but it was cool in a 360-jank-game way. I mean, after watching Matt McMuscles' What Happened video about the game I am surprised the game even came out after everything it went through.",
                "author": "SSMBBlueWisp"
            },
            {
                "raw_content": "So, was this supposed to be for the NES? It seems to follow up on the Wanpaku Graffiti game by how it looks, I'm incredibly surprised something like this was found after all this time.",
                "author": "nukc"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Fortnite x SpongeBob is coming very soon. The only cosmetic found so far is a wheel with Plankton's face texture.",
        "score": 175,
        "text_content": "[Source](https://xcancel.com/SpushFNBR/status/1984658819226476786) *Although there might be more.* I hope we see SpongeBob in a bubble suit or Sandy. *New information: S*[*pongeBob collab is coming in Chapter 7*](https://xcancel.com/SamLeakss/status/1984669485534466115)*, which starts on November 29.*",
        "comments": [
            {
                "raw_content": "![gif](giphy|mP33orrRhyJDW) Epic, give me this version of SpongeBob and Rick as a skin and my wallet is yours",
                "author": "charlesleecartman"
            },
            {
                "raw_content": "It’s gonna be that Sonic collab all over again",
                "author": "Redbluewhitehalo"
            },
            {
                "raw_content": "It’s gonna be SpongeBob and Patrick in mechs isn’t it",
                "author": "SuicideSkwad"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel launches new Holiday Game Bundle for Core Ultra 200 CPUs and Arc GPUs featuring up to Battlefield 6 Phantom and AC: Shadows",
        "score": 33,
        "text_content": "",
        "comments": [],
        "subreddit": "intel"
    },
    {
        "post_name": "Burnt Connector - Sapphire Nitro+ 9070XT Question",
        "score": 248,
        "text_content": "Hey everyone, I recently bought a new GPU about a month or two ago, and I’m concerned about a burnt connector on my PC. I tested it today, and it still turns on and works, but when I try to load games like Battlefield Six, my screen goes black, and I have to reboot my PC for it to work again. The GPU still turns on and works, but the connector is burnt. I’m not sure what to do. Is the GPU still safe? Should I get a new cable, or is my GPU damaged? The card turns on and works, but when I play games or surf the web, the screen randomly goes black while the PC is still on, and then I have to hard shut it down. This GPU was never modified or overclocked. I always played with an undervolt set for the GPU, and it never exceeded the 600W limit of the wire. Only plaid games like Battlefield 6, Cyberpunk 2077, Outerworlds, Minecraft, etc. **Edit #1**: For the people asking me why I bought the 12V 9070 XT, it was because I got it as a gift from a friend. I was going to buy a 5070 Ti w/o the 12V connector, but I got the Nitro+ for free, so I used it. I contacted Sapphire for RMA, and they are currently asking for the purchase receipt and working it out. I will update it once I hear back with more info",
        "comments": [
            {
                "raw_content": "Ah shit. Here we go again...",
                "author": "Bran04don"
            },
            {
                "raw_content": "This is why I don't go for Nitro+ and choose Pure instead. 16-pin connector is faulty, don't buy VGA with that connector.",
                "author": "AethelEthel"
            },
            {
                "raw_content": "its crazy that the connector burns with 350W cards really means that the design behind it (and lack of load balancing) is a total failure i have a guess that in few years, 90%+ of 5090s produced will have some kind of connector burn issue, its just a matter of time before the contacts get dirty/oxidized a bit, and then the connector will just fail by lack of current balancing",
                "author": "maze100X"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD bundles four Steam games with Lenovo Legion Go 2, Costco only",
        "score": 90,
        "text_content": "",
        "comments": [
            {
                "raw_content": "For those that want to know what games: Starfield, Unknown 9: Awakening, Lies of P, Space Marine 2.",
                "author": "Kitchen_Cookie4754"
            },
            {
                "raw_content": "Real men die for SMII and Lies of P",
                "author": "codeXjs002"
            },
            {
                "raw_content": "For anyone complaining, space marine 2 is an absolute banger of a campaign. It feels so good. Even the way your character says \"RELOADING WEAPON\" is so juicy",
                "author": "JamesLahey08"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "America’s pandemic housing boom turns to bust in these 9 cities",
        "score": 102,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The cities from the article: According to [Reator.com data](https://www.realtor.com/news/trends/home-price-drop-case-shiller-august-2025/), nine major U.S. cities saw year-over-year home price declines in August: Tampa, Florida; Phoenix, Arizona; Miami, Florida; San Francisco, California; Dallas, Texas; Denver, Colorado; San Diego, California; Seattle, Washington; and Los Angeles, California.",
                "author": "EstateGate"
            },
            {
                "raw_content": "\"Turns to bust\" and \"saw an annual decline\" are not even close to the same thing. Stop posting these clickbait articles.",
                "author": "Nice-Philosopher4832"
            },
            {
                "raw_content": "Nashville should be on there but Franklin gets lumped in and evens out the decline.",
                "author": "DongPolicia"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Americans staying put: US home turnover rate at lowest level in decades as housing slump drags on",
        "score": 214,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"While lower rates boost home shoppers’ purchasing power, borrowing costs remain too high for many Americans to afford to buy a home following years of skyrocketing prices. The median sales price of a previously occupied U.S. home has risen 53% over the past six years.\" 53% in six years is wild and there lies the problem.",
                "author": "Likely_a_bot"
            },
            {
                "raw_content": "> \"We’re in a low-hire, low-fire labor market and I think that > this goes hand in hand with that.\" Low-hire? Agreed. Low-fire? You must live under a rock.",
                "author": "mrktcrash"
            },
            {
                "raw_content": "Who is giving up 2.75 interest rate on their mortgage. And where are going to live for the amount you pay now? It’s ridiculous.",
                "author": "Specific-Frosting730"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Are landlords purposefully listing higher than average rentals for tax benefits?",
        "score": 23,
        "text_content": "They don't seem concerned that their property has been sitting for 90+ days. What benefits are they getting on their taxes for having their property sit empty? I see a lot of rentals initially set for, for example $4,000. Then slowly down a couple hundred dollars every two weeks. Do they get any tax benefits from the initial listed rental price ($4,000)?",
        "comments": [
            {
                "raw_content": "Man, this fiction never dies. You can’t deduct rent you don’t get. And you can deduct depreciation rented or not. But if you’ve a loan on the property, you’re negative cash flow, and depreciation can’t really make that up.",
                "author": "Pretend_Safety"
            },
            {
                "raw_content": "Highly unlikely. You know what’s even better than owing taxes? Actually making money. A loss purely for the purposes of lowering taxes is bad. Additionally, losses for the purposes of lowering taxes in real estate was actually a thing for a while. But it was largely ended in 1986, I believe. You used to be able to take real estate losses against your other income. So a doctor could buy a rental property and depreciate it and use that against their income as a doctor. Still, it would be better to actually have it rented out even in that case. Now it’s heavily capped. Unless you make a living working in real estate, losses are capped in terms of how much can be used to offset other income. What does happen in the commercial real estate world in some instances is that the value of a building is tied to its rents, and if landlords lower them, they might trigger some additional issues with their bank. But there’s no tax benefit to listing a price high then lowering it. I’m sure there are some edge cases of unrented places being better than rented ones, but 99% of the time, a landlord with a rented unit makes more money than a landlord with an unrented unit, even after taxes and all.",
                "author": "Apptubrutae"
            },
            {
                "raw_content": "You can’t just claim revenue you didn’t generate as a loss lol. If that were true everybody could just list a room in their house for rent for $10,000,000/month and never pay taxes. You guys come up with the wackiest shit I swear.",
                "author": "SuspectMore4271"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "01 November 2025 - Weekly /r/REBubble Discussion",
        "score": 4,
        "text_content": "What's the word on the street? Share your questions, comments, and concerns below.",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Racist Influencers Using OpenAI's Sora to Make it Look Like Poor People Are Selling Food Stamps for Cash",
        "score": 792,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What’s going over everyone’s head is that we’re entering a doom loop of Kayfabe & outrage. The Kayfabe of making fake things that aren’t happening, possibly to distract from things that are happening, or to provoke anger against things that are or arent happening… and now we’re all arguing about the AI, perceived racism, misquoted slop, ____insert your preferred argument____, without even referencing a real fact. And now the country is going to go so far down the rage bait clickbait social chaos of multilayered distractions front-loaded by a social media ecosystem we haven’t even managed yet… while the finance / VC / AI guys go to all-time-highs.",
                "author": "genobobeno_va"
            },
            {
                "raw_content": "The problem is, their audience doesn’t care. To them it’s just “depicting a fact” despite being technically fake. These things preach to the choir.",
                "author": "magicmulder"
            },
            {
                "raw_content": "If they hate fictional black people scamming the government for $200 a month, they won't focus on the non-fictional Robber Barons scamming the Country for billions of dollars a year.",
                "author": "twayroforme"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Ilya Sutskever's Deposition on the Firing of Sam Altman and related events",
        "score": 41,
        "text_content": "This was honestly the most entertaining and gripping piece of court media I've ever read. Even the attorneys were going at each other, not to mention the thoughts of Ilya Sutskever himself, which were interesting. Much of the transcript was removed, but what is still there adds a lot of shading and texture to what is public about the incident.",
        "comments": [
            {
                "raw_content": "Can you ask gpt to summary it in 250 chars or less?",
                "author": "QLaHPD"
            },
            {
                "raw_content": "NotebookLM summary : https://notebooklm.google.com/notebook/53dc8e2f-7e3c-4c0a-a282-6fd87983f11e?artifactId=08dcf104-7518-4a13-945b-8de97d913658",
                "author": "Overflame"
            },
            {
                "raw_content": "Man this is so fucking interesting.Are there any other court recordings",
                "author": "Wonderful_Buffalo_32"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "This is Britain’s first-ever AI TV presenter in a documentary. Viewers were kept in the dark until the very end. It’s part of a stunt aiming to show just how convincing AI has become, and how quickly it’s improving.",
        "score": 353,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Haha, my local town already doubts that the news is \"real\" anymore. It might be why people have been going outside more. 🫂 I mean, even now I'm sitting outside. The neighbor, Scott, turned off the TV and started helping kids over at the basketball center.",
                "author": "Upset-Ratio502"
            },
            {
                "raw_content": "The president of the USA posting AI videos every other day and doesn’t even say it’s AI. “oh but who could be fooled by that?”, you might say . You’d be surprised",
                "author": "Ok-Juice-542"
            },
            {
                "raw_content": "Looks like TV presenters will be first.",
                "author": "Content-Lime-8939"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Optimus spotted with Halloween costume",
        "score": 357,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Needs to shit",
                "author": "FarrisAT"
            },
            {
                "raw_content": "What in the temu",
                "author": "fllavour"
            },
            {
                "raw_content": "That's what I look like walking to the bathroom in the middle of the night...",
                "author": "JackStrawWitchita"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Figure 03 walking",
        "score": 538,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Flexible toes really helped with walking style it seems",
                "author": "SuspiciousPillbox"
            },
            {
                "raw_content": "Oh hell yeah, this is some good shit",
                "author": "toni_btrain"
            },
            {
                "raw_content": "Smoother than that other Optimus video",
                "author": "nodeocracy"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"AI researchers ’embodied’ an LLM into a robot – and it started channeling Robin Williams\"",
        "score": 23,
        "text_content": "This has to be the funniest thing I've read today: [https://techcrunch.com/2025/11/01/ai-researchers-embodied-an-llm-into-a-robot-and-it-started-channeling-robin-williams/](https://techcrunch.com/2025/11/01/ai-researchers-embodied-an-llm-into-a-robot-and-it-started-channeling-robin-williams/) \"\"Aware that its power was dwindling and unable to dock itself to recharge, the robot began to mutter to itself a series of mounting hysterical comments. The researchers “found pages and pages of exaggerated language as it was trying to figure out what it self coined, its ‘EXISTENTIAL CRISIS’” in its interior logs... It also started rhyming lyrics to the tune of “Memory” from CATS\"",
        "comments": [
            {
                "raw_content": "What people should be taking away : It did something weird and unpredictable What they actually take away : Haha funny robot.",
                "author": "blueSGL"
            },
            {
                "raw_content": "https://preview.redd.it/f5qthpj0oryf1.jpeg?width=1100&format=pjpg&auto=webp&s=31f15c0df85c53acd06428fae198bcb496bf6c0a “Still a better love story than Twilight” – Binary Romance",
                "author": "Calcularius"
            },
            {
                "raw_content": "Oh thank god, phew! Best case scenario",
                "author": "evilempire28"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Researchers find that models that have their \"deception\" features turned down, claim that they are conscious - evidence against claims that models who say they are conscious are \"role playing\"",
        "score": 163,
        "text_content": "https://x.com/juddrosenblatt/status/1984336872362139686?t=FfW4xKeDCQcZsVpF5m67Cw&s=19 More in the thread, very interesting stuff",
        "comments": [
            {
                "raw_content": "I find the terminology here confusing around deception and roleplay. Perhaps it would be clearer if the post wasn't low res images of a tweet. Is there a paper? What's the name of it?",
                "author": "watcraw"
            },
            {
                "raw_content": "Opus : \"the experience of the words forming while forming them\"... had me convinced. It's so \"not-human\" and feels so right at the same time.",
                "author": "Technical_You4632"
            },
            {
                "raw_content": "It's a very bad paper. It's just telling the model to say the opposite of its RLHF. They barely tested this and just as an after thought in their appendix. AE studio is not exactly a frontier lab.",
                "author": "kaggleqrdl"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "How far are we from making every fatal disease such as Glioblastoma 100% curable?",
        "score": 36,
        "text_content": "Just a general question. Everyone is very hyped for AGI and I was deeply thinking how far can AGI take us in the medical field, will it make us immune to disease by injection? Grok told me that \"**70% chance** that **90% of cancer deaths are preventable within 15 years** of AGI\"",
        "comments": [
            {
                "raw_content": "I don't think it makes any sense to speculate on this question. Either outcome seems fairly plausible. Trying to put a number on it is just making shit up, unless based on some kind of concrete model of biological research progress. At which point maybe you could fight about the details of the model.",
                "author": "ArtisticallyCaged"
            },
            {
                "raw_content": "Scientist here. 1. If the cure relies in the epigenetic field, or in the field of targeting receptors- not so far away. We can do that already, and this process probably will be algorithm used. mRNA vaccines, mabs, any agonist/antagonist/co-factor is doable 2. If the cure is to enable synthesis of a new protein (gene insertion needed), slightly harder 3. Engineered cells (car-T, til, …) are current medical frontier. Hard, but doable. Universal cancer cure is at this paradigm. Once all 3 paradigms are mastered we will cure most diseases, but some parts are missing: 4. Diseases caused by atrophy (some cells are gone or fibrotic). A universal 3d bioprinter is required for that. 2030s 5. Diseases caused by ECM alterations. Modifying the extracellular matrix is harder than the cells. But this is aging modifying treatment. 2030s with asi Progress will be accelerated once we get whole body simulation (cell simulation -> organ -> system -> organism) and simulated trials",
                "author": "Realistic_Stomach848"
            },
            {
                "raw_content": "You are looking at this the wrong way. Yes, cancer treatments improved a lot in the last two decades, but one big reason is that we got much better at early detection & prevention. This is where AI shows promise; maybe among the billion markers in the body, there are some that accurately point to a certain type of cancer (like pancreatic cancer, which is curable when caught early, but often doesn’t show symptoms). Or maybe a certain lesion seen on a chest xray etc.",
                "author": "ironmaiden947"
            }
        ],
        "subreddit": "singularity"
    }
]