[
    {
        "post_name": "Elon Musk: I would like to thank President Trump for all he has done for America and the world",
        "score": 913,
        "text_content": "",
        "comments": [
            {
                "raw_content": "why did the stock market & crypto plummet today?",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Let's put Americans to work and end all these visas. All of them. Send them all back.",
                "author": "josiborg"
            },
            {
                "raw_content": "You love to see it.",
                "author": "CyanScales"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨🇯🇵 JAPAN ENFORCES STRICT NEW IMMIGRATION RULES - If you are illegal you will be deported - If you break the law you will be deported - If you don't follow local customs you will be deported - If you don't respect Japanese culture you will be deported Can we do the same here?",
        "score": 151,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why does Japan need any immigrants?",
                "author": "GoldenEarz"
            },
            {
                "raw_content": "That’s a beautiful start…",
                "author": "GreyKnight"
            },
            {
                "raw_content": "Just deport them tomorrow anyway don't wait till something happens cuz it always will.",
                "author": "TOPDAWG23"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Robert F. Kennedy Jr. reveals that BlackRock is quietly acquiring control of the meat and pharmaceutical markets.",
        "score": 118,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So....DO SOMETHING",
                "author": "possibletower"
            },
            {
                "raw_content": "The Communist Larry Fink is becoming as evil a force , if not more, than George Soros.",
                "author": "SubmarineGuy"
            },
            {
                "raw_content": "Funny enough, I’m ok with some company trying to acquire everything…what I’m not ok with is then said company making laws that prevent any competition from opening up. That’s honestly where the government should be stepping in, protecting the free market by allowing competition to spring up. Then the whole thing changes around. If someone doesn’t like one group owning an industry, then they can compete and do a better job. Of course what actually happens is the industry giants crush any potential up comers with a mountain of expensive lawsuits. So as usual, the real issue is lobbyists and their “donations”.",
                "author": "DCPower"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This is a judicial coup.",
        "score": 1075,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If anybody thought that this was gonna be easy taken back our country from these evil scum that have been running this for decades you were fooling yourselves",
                "author": "Dwoj"
            },
            {
                "raw_content": "And what are we going to do about it?",
                "author": "journalist"
            },
            {
                "raw_content": "It’s time to just ignore the fucking judges and tell them to suck a cock.",
                "author": "MAGA9428"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Michael English, a Democrat and a CONVICTED child molester, is currently running for Mayor in Providence, Rhode Island. In 1998, English pleaded no contest to sexually molesting a 13-year-old girl. He served ONLY 15 months of a 20-YEAR sentence.",
        "score": 1062,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Of course he only served 6.25% of his sentence. Uniparty elite privilege.",
                "author": "MSG1000"
            },
            {
                "raw_content": "well they elected a guy that wants to murder republican kids, why not elect a guy that wants to fuck them.",
                "author": "turdinthepunch"
            },
            {
                "raw_content": "He’ll win in a landslide.",
                "author": "B-2StealthTrump"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Assistant principal John Bennet at Kempsville High School in Virginia Beach and his brother Mark Bennet have just been arrested for plotting to ASSASSlNATE ICE agents. John Bennet was also an officer with the Virginia Beach police department from 2012 to 2013.",
        "score": 1321,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The Violent Left isn't going to stop until they're stopped.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Please Mr. President. You need to invoke the Insurrection Act and be willing to ignore the captured judicial branch. 80% of cops and 70% of military voted for you & that was before Hesgeth purged the ten thousand LGBT commuters. We need to be placing tens of thousands of leftists, seditionists and traitors in prison all around the country.",
                "author": "SilentHillFog"
            },
            {
                "raw_content": "Only a matter of time...",
                "author": "Wizard_Glick"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Buchanan was America First, first.",
        "score": 675,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Pat Buchanan was crucified by the media for having the audacity to question whether America should have participated in WWII, and Israel's meddling in America's foreign & domestic policy",
                "author": "briansoprano"
            },
            {
                "raw_content": "Proud voter of Buchanan in the republican primary over Bush",
                "author": "ToxicAvengerOhio"
            },
            {
                "raw_content": "And instead of America First, in 1993 we got Bill Clinton the rapist years.",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "LOL 🤣🤣🤣 It's all made up. It's all conspiracy theory. They are attacking me because I'm black.",
        "score": 742,
        "text_content": "",
        "comments": [
            {
                "raw_content": "now indict Sheila Jackson Lee posthumously for covid fraud or something",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "That's how you know she's guilty.",
                "author": "CleanUpPhillyTrump24"
            },
            {
                "raw_content": "The same playbook of lies time after time after time.",
                "author": "QueensOwn"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Whoever is running the DHS X account needs a raise",
        "score": 1224,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It might be someone already on PDW...",
                "author": "Moebius"
            },
            {
                "raw_content": "If construction starts back up we know they feel safe again.",
                "author": "mikejones"
            },
            {
                "raw_content": "Just apply the graham cracker test and speed this shitshow up. We need this at 11 and we're floating at about a 3 right now.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Maybe we need to rename the crack in California the \"San America Fault\"",
        "score": 898,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's Trump's fault. Why not? They blame everything else on him.",
                "author": "Oldman1234"
            },
            {
                "raw_content": "Turned off the Jewish space laser?",
                "author": "-f-b-i-"
            },
            {
                "raw_content": "No, we want California to break off and fall into the ocean",
                "author": "Muttsbitetoo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "American is outraged finding out our tax money is being used to buy homes for people on Section 8 “There are Section 8 programs where you can get a mortgage, and take your Section 8 rent payment and put it towards your mortgage. So did you know that we are paying our fellow citizens' mortgages too?",
        "score": 454,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And if you don't pay for their mortgage, EBT and other handouts stolen from your labor, your government takes your house and can throw you in jail.",
                "author": "killedmytv"
            },
            {
                "raw_content": "Rent to Own. It's been around at least 10 years or more. It's their money and \"none of your business how they spend it\" was always the answer we got.",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "\"American is outraged finding out our tax money is being used to buy homes for people on Section 8 “There are Section 8 programs where you can get a mortgage, and take your Section 8 rent payment and put it towards your mortgage. So did you know that we are paying our fellow citizens' mortgages too?” “You pay such high taxes that you can't afford your own life, you can't afford to buy your own house — You can't afford anything, but you're paying with your tax dollars, your overtaxed dollars, for somebody else to get a house and pay their mortgage. I am just disgusted” Since 2000, HUD has allowed a homeownership option within Section 8: instead of using the voucher for rent, an eligible family can use it to help pay a mortgage on a house they are buying Working taxpayers who can’t afford a home, are paying for homes for people who don’t work Make it make sense\"",
                "author": "PiratePatriotParrot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "‘Low IQ’ Democrat to Launch 5th Impeachment Effort Against Trump",
        "score": 878,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fucking retard.",
                "author": "MakeAmericaGreat9"
            },
            {
                "raw_content": "Al Green is retarded",
                "author": "Flubadub"
            },
            {
                "raw_content": "We make it so easy with our inaction, even a caveman can do it. 🦍",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Anti-human.",
        "score": 385,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Subsidizing care means that they have to charge insured patients more to cover the 20% cost gap paid by government payers. In healthcare we call this the private pay mix. Government payers help cover the fixed costs and if we can get one private pay for every 10 government, then we can make a profit. TLDR: Subsidizing demand raises prices.",
                "author": "IPFreely"
            },
            {
                "raw_content": "I am extremely pro-capitalism but I am anti-whatever the fuck this shit we have now is. Just a non stop cash grab for mega companies.",
                "author": "try4gain"
            },
            {
                "raw_content": "The entire system is a money-grubbing scam and a symptom of late stage fiat money.",
                "author": "LordKuroTheGreat"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: President Trump & Special Envoy Witkoff’s 28-point peace plan for Ukraine has been released.One major detail: It would require Ukraine to have elections within 100 DAYS of signing. $100B in frozen Russian assets will be used to rebuild/invest in Ukraine, with the U.S receiving a 50% share.",
        "score": 887,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So Zelensky won't sign it, got it.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "How about we get refunded the money we wasted over there.",
                "author": "KernalMustard"
            },
            {
                "raw_content": "Has Russia been asked if they're okay with all this?",
                "author": "ragnarokrobo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Dems/MSM: “Oh no! Trump said he wants to execute seditious Democrat lawmakers!” Me:",
        "score": 1332,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They tried to assassinate Trump twice... The penalty for Sedition is Death. I vote they be Choke Hung...",
                "author": "Moebius"
            },
            {
                "raw_content": "Yeah, death penalty for treason... You know, exactly what the left tried to frame Donald Trump for with the Russiagate hoax. They can take the handful of pearls they are clutching and choke on them.",
                "author": "BlackPilledMAGA"
            },
            {
                "raw_content": "Democrats suddenly want to obey the law?",
                "author": "VirTW"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Michael A. Arouet, \"This is probably the most scary chart you will see today. How is it possible that socialist indoctrination at universities and in media is so successful?\" We need to defund the Arts Faculties particularly the Humanities Departments in our colleges and completely reform them.",
        "score": 1138,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Young minds are pliable, easily influenced. If you want to change society, indoctrinate the youth in grade school and college. One more generation and we'll be at 80%. Then it will be impossible to stop...unless we do something this generation.",
                "author": "OlivaireBandaloo"
            },
            {
                "raw_content": "This is why they killed Charlie Kirk, too, because he was a threat to this operation and younger people were waking up.",
                "author": "Than0sIII"
            },
            {
                "raw_content": "Don't forget that they lie with polls constantly to try to shape people's opinions. Their polls are all propaganda. Hillary had a 99% chance of winning according to their polls.",
                "author": "ColonelKlink"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: The White House announces that the Russia-Ukraine peace plan devised by Sec. MARCO RUBIO and Witkoff has been majority-AGREED to by top Ukrainian officials. The plan is now at President Zelensky's desk 🤞",
        "score": 972,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is good. His top officials agree. If Zelensky doesn't, they will likely off his coked-up ass.",
                "author": "UntakenUsername"
            },
            {
                "raw_content": "PEACE IS THE PRIZE. Now Z needs to refund America what he stole.",
                "author": "TEXinLA"
            },
            {
                "raw_content": "Zelensky fucked around with Rubio's time before. He better sign off.",
                "author": "shadypollster"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Compulsory nude Korean spa is ordered to allow mentally ill men into female-only areas after biological male visitor sued",
        "score": 958,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Kill it with fire.",
                "author": "EDDIT_IS_CUCKED"
            },
            {
                "raw_content": "'we just want to get married, bigots'",
                "author": "Retard_Strength"
            },
            {
                "raw_content": "Freedom of association is dead. The civil rights bill is the worst crime ever committed on this nation.",
                "author": "MAGABOND"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "😂😂😂😂😂🔥",
        "score": 1282,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is this the one they cut like 100,000 trees down to build a road to?",
                "author": "THELEADERSOFMEN"
            },
            {
                "raw_content": "Is there a reason they can't do these summits virtually, which would be better for that thing they claim to care so much about?",
                "author": "OutlawPurpleHairDye"
            },
            {
                "raw_content": "It was a virtue signal event horizon. Truth and feelings reversed roles at the singularity.",
                "author": "least_counties_ever"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "GIVE ME DARK MAGA OR GIVE ME DEATH!",
        "score": 912,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And how would you like your death delivered? Your options are hanging, firing squad, electric chair, lethal injection, or sex with Stacy Abrams.",
                "author": "Oldman1234"
            },
            {
                "raw_content": "Unfortunately, you might be right. They will try to kill us if we don't stop them.",
                "author": "mailinvoter"
            },
            {
                "raw_content": "We’re fighting a cold civil war might as well stop pretending. They are just waiting for the day when they can hoist the pride flag above the White House again and come after all of us.",
                "author": "kekranger"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "HP and Dell disable HEVC support built into their laptops’ CPUs",
        "score": 172,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's possibly over a $0.20 to $0.24 licensing cost. Penny wise, pound foolish.",
                "author": "jigsaw1024"
            },
            {
                "raw_content": "Genuinely confused: the recent HEVC royalty increase is for **new** devices. Why would already-sold devices *still* pay HEVC royalties in 2026? [Their royalty **was** **paid,**](https://accessadvance.com/topic-what-do-we-license/)[ once—when the product was first sold](https://accessadvance.com/topic-what-do-we-license/). >We seek to be paid one royalty per device/software copy on First Sale I find it hard to defend proprietary codec licensing and especially one that increases its price years later, but I'd like to aim the pitchforks at the right party here.",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": "AMD and Intel should prohibit the system integrators from disabling any features. Ran into a ton of difficultly once when discovering the hard way that Dell disables all iGPUs entirely in Poweredge servers... without documenting that while advertising and shipping servers with iGPU equipped Intel CPUs. Didn't even want to use them for video out or anything, just a little bit of acceleration.",
                "author": "Hewlett-PackHard"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Feds charge four with illegally smuggling Nvidia AI chips to China",
        "score": 51,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wouldn't be surprised if Nvidia was knowingly involved in large scale smuggling.",
                "author": "Possible-Put8922"
            },
            {
                "raw_content": "Tech Jesus snitched didn't he",
                "author": "Qaxar"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel at CES: Intel will officially launch Panther Lake alias Core Ultra 300 at CES 2026, January 5-9",
        "score": 110,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wonder how pricey these will be with memory prices going up across the board...",
                "author": "Dangerman1337"
            },
            {
                "raw_content": "Come on Intel I need to replace my corporate laptop already!",
                "author": "TemuPacemaker"
            },
            {
                "raw_content": "I guess December 14th like Meteor Lake was not cutting it",
                "author": "imaginary_num6er"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "SK Hynix to ramp up 1c DRAM production 8-fold in 2026",
        "score": 24,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Isn't 8x excessive even with the bubble? Or is a big chunk of the increase a standard upgrade of old 1b fabs?",
                "author": "VastTension6022"
            },
            {
                "raw_content": "Where is ramp up coming from?Consumers? I don't see some factory scale up?",
                "author": "InfamousFile7537"
            },
            {
                "raw_content": "Sounds great for consumers dealing with current high prices but how can they make money selling ram for 1 cent?",
                "author": "Tummybunny2"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "TechCrunch: \"Samsung Display, China's BOE settle OLED patent and trade secret lawsuits\"",
        "score": 101,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">In March 2025, the ITC ruled that BOE had infringed three of Samsung Display’s OLED patents. On the trade secret side, in a preliminary ruling handed down in July, the ITC found that BOE had misappropriated Samsung Display’s OLED trade secrets, and recommended banning the Chinese company from exporting OLED panels to the U.S. for nearly 15 years. >Now, the companies appear to have asked the ITC to end its investigation. When reached for confirmation, the ITC declined to comment. >“The two companies have agreed that fair technological competition is essential for the advancement of the display industry,” and have therefore decided to withdraw all pending lawsuits, a spokesperson at Samsung Display confirmed to TechCrunch. “We [also] plan to withdraw all ongoing legal actions as part of this agreement.”",
                "author": "Vb_33"
            },
            {
                "raw_content": "Wasn't this started because Apple wanted to cut cost through BOE? Lol",
                "author": "tired_fella"
            },
            {
                "raw_content": "Looks like those screens finally stopped fighting each other",
                "author": "anti-scienceWatchDog"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "(JayzTwoCents) Can this $29 cooler compete with a $130 cooler?",
        "score": 30,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I feel like we've already established this years ago when Thermalright released the Peerless Assassin and the gap was reduced even more when they followed it up with the Phantom Spirit with 7 heat pipes. Noctua stopped being worth the money a very long time ago.",
                "author": "MrLyle"
            },
            {
                "raw_content": "TLDW: The Montech NX600 runs about 2-3c hotter than the Noctua NH-D15S when noise normalized to 42db and at max fan speed the montech is equivalently cool. https://i.redd.it/b7ts7w0hgh2g1.png",
                "author": "Crimtos"
            },
            {
                "raw_content": "42db is on the high side for noise as far as I'm concerned... I'd rather see a db to temperature chart Hardware Canucks style. We'd see if the temps are still comparable at a much more silent volume and across the decibels range. Don't misunderstand me tho, I'd rather go with a much cheaper Thermalright with the same decibel profile as a Noctua. Just that I don't find that his methodology gives a good idea of what to expect at other decibel values.",
                "author": "AnechoidalChamber"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "IBM and Cisco want to build a quantum internet by the late 2030s",
        "score": 45,
        "text_content": ">Today they announced plans to collaborate on a large-scale and fault-tolerant network that will enable tens of thousands of so-called “qubits” to work together to solve some of the world’s most complex problems. The companies said they hope to realize their vision within just five years by linking two separate quantum computers and entangling their qubits, before expanding this network to many dozens of machines over a distributed network. > >Ultimately, they’re aiming to build the foundation of a “quantum internet” by the late 2030s. It’s intended to support ultra-secure communications and advanced sensor networks for seismic monitoring, climate change and other applications.",
        "comments": [
            {
                "raw_content": "I don’t know what this means. “Quantum” internet??? Can someone translate in English",
                "author": "sid_276"
            },
            {
                "raw_content": "Wake me up when someone has actually demonstrated that quantum computing is useful for something.",
                "author": "Frexxia"
            },
            {
                "raw_content": "IBM: we are ahead in quantum computing. We need to show it into everything to cash it. Headline next week, probably: IBM will make quantum bitcoins and quantum AI by 2030.",
                "author": "PM_ME_UR_TOSTADAS"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "32 vs. 16 GiB VRAM: Up to nine times the performance [PCGH]",
        "score": 49,
        "text_content": "Heya, PCGH conducted some extreme benchmarks with the Radeon AI Pro R9700, which is basically a Radeon RX 9070 XT with double the memory. In addition to the standard tests, they brought out the big guns and filled the memory with extreme settings – with astonishing differences. Check the frame times! :O More info can be found in their regular R9700 Review (just use your browser's translator. Benchmarks are already in English.)",
        "comments": [
            {
                "raw_content": ">Up to nine times the performance at 8k fsr ultra performance + fg which may as well have been listed at doesn't run considering it does an unusable 6.4fps compared to the 32gb at 61fps",
                "author": "diemitchell"
            },
            {
                "raw_content": "Flashbacks to the days of mechanical harddrives and memory measured in the megabytes, when the difference between 16 and 32MB was the difference between switching apps being enough to send your harddrive thrashing for fifteen minutes as your system swapped data to and from the pagefile (during which time it would be so badly choked that you could watch it render reach row of pixels one line at a time), or it simply happening with minimal fuss. It's the thing. Insufficient memory has always been something to absolutely slaughter performance.",
                "author": "FatalCakeIncident"
            },
            {
                "raw_content": "Breaking News: Performance Tanking When Data Doesn't Fit Into RAM!",
                "author": "__some__guy"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Montech NX600 Review [TechPowerUp]",
        "score": 7,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So a little bit behind Thermalright's Phantom Spirit 120 EVO, but also $20 cheaper. Not bad.",
                "author": "bizude"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Peanut Butter Switch Update",
        "score": 433,
        "text_content": "A quick update on the peanut butter dock. I managed to take the dock apart today. One of the screws on the bottom was particularly firmly attached and ended up stripping the head. Had to drill it out but after that was plane sailing. Took it all apart watching a tear down video. Cleaned all the plastic and use some of the suggested WD-40 contact cleaner to blast the embedded peanut butter out of the USB ports. All went back together ok - although still has a bit of a peanut butter smell to the dock! Both USB ports still work and the dock is back up and running. A fantastic success and can get on with finishing DK now! Thanks to all the helpful and funny comments in the last thread. I promise to keep the dock and my spreads separate moving forward.",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/t4hg06suli2g1.jpeg?width=3024&format=pjpg&auto=webp&s=88b0d7a50207b16760ca3f575c004eab1cdcba70 Forgot to include a picture of the actual ports too. Came out looking as good as new.",
                "author": "pummra"
            },
            {
                "raw_content": "great now you got ice cream on the floor, come on man get yourself together.",
                "author": "Jellybananaman"
            },
            {
                "raw_content": "Smells like victory.",
                "author": "ezwip"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Kirby Air Riders customization is actually insane 😭",
        "score": 252,
        "text_content": "",
        "comments": [
            {
                "raw_content": "it’s like the good old cod emblem creator 😭",
                "author": "Zurosake"
            },
            {
                "raw_content": "H-HATSUNE MIKU!?!?!",
                "author": "Donut-Farts"
            },
            {
                "raw_content": "LOL, that looks fun.",
                "author": "Dydxjie"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Are you having fun with Kirby Air Riders so far?",
        "score": 440,
        "text_content": "I’ve been playing for 2 hours and I find the game fun and catchy, yet sometime a bit too chaotic and it’s hard to even understand what is happening. What’s your thoughts about the game?",
        "comments": [
            {
                "raw_content": "It’s honestly amazing. There is so much content to interact with and idk why but the game as a whole feels way better than the trial ride did.",
                "author": "Otherwise-Music-8643"
            },
            {
                "raw_content": "I was loving it and then played three matches online and came in last place every time. So do I really understand what’s going on? Not really. But I am having fun!",
                "author": "arronecho"
            },
            {
                "raw_content": "Having a Great time so far! The new courses are rally fun and i like the “story” mode",
                "author": "Funnycom"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Can Confirm, Kirby has a Mouth",
        "score": 451,
        "text_content": "Picked up the Kirby Air Rider’s Amiibo at Target. The app said they had them, but weren’t on shelves yet (similarly dropped by GameStop to get the game when the store opened and the girl had no idea what I was talking about). Anyhow, told the guy at Target I’d like to see them first and was pleased that Kirby has a molded mouth, not just a sticker. I mean at $50 for a character that doesn’t have a lot of details, this was at least some effort.",
        "comments": [
            {
                "raw_content": "![gif](giphy|ifZW86clxZIs0)",
                "author": "AdalbertJ"
            },
            {
                "raw_content": "But what that mouth do.....?",
                "author": "KK_Masters"
            },
            {
                "raw_content": "I can’t justify $50 for this. I just can’t do the mental gymnastics. That is an INSANE price.",
                "author": "epicbrewtality"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "PSA: Careful Unboxing Kirby Air Riders Amiibos",
        "score": 147,
        "text_content": "I pulled back the fastened plastic clamshell and lifted Kirby out. His hand got mangled in the process. 😢 You’re going to want to cut the plastic across the snaps so you can get him out gently.",
        "comments": [
            {
                "raw_content": "That should not happen on a $50 toy. Sorry",
                "author": "Pokeguy211"
            },
            {
                "raw_content": "Its likely not caused by the way you opened it and more likely the plastic is just soft enough that the pressure of the packaging over the time its sat in a warehouse has caused it to indent slightly. its slightly possible it will recover on its own over a long period of time. but its possible it wont and you will probably want to contact nintendo or the company you bought it from and get it replaced if it bothers you. but it sounds like this one is pretty wide spread so be lucky to find one that doesnt have the same issue.",
                "author": "Jaron780"
            },
            {
                "raw_content": "I have an identical imprint on mine. I thought this was a factory defect as it seems strange that a plastic case could imprint onto this. Rip kirby hand.",
                "author": "darkhollow22"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Panic Button was the studio responsible for helping update Switch 1 games to Switch 2",
        "score": 137,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Makes sense, Panic Button pretty much specialized in porting games to the original switch.",
                "author": "mking098"
            },
            {
                "raw_content": "Wonderful. I can only hope that they revisit some of their previous ports for Switch 2 as Id love to play Doom on the go at 60fps.",
                "author": "wazzup4567"
            },
            {
                "raw_content": "I wish they couldve brought more games that could benefit the bump up, I mean NSMBU isnt exactly a graphical showcase of the switch or switch 2 lol. Xenoblade and metroid are the type that should've been looked at first.",
                "author": "FirstAd7967"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo Switch 2 sold 328k units in October. It is 68% ahead of the sales pace set by the original Nintendo Switch and is 3% ahead of PlayStation 4’s previous record velocity (USA only)",
        "score": 331,
        "text_content": "",
        "comments": [
            {
                "raw_content": "…..but there’s Consoles at the store which means nobody wants them! -Typical YouTube gamer 🤡😄",
                "author": "ImStupidPhobic"
            },
            {
                "raw_content": "The goal posts are already in motion",
                "author": "Last_Concentrate_923"
            },
            {
                "raw_content": "Worth nothing PS4 launched during the holidays in the US, and Switch 2 is only heading into one. WW Switch 2 is already even further ahead of the PS4 launch aligned also.",
                "author": "dekuweku"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Final Fantasy VII Remake Intergrade Is 90GB - 95 GB on Switch 2",
        "score": 435,
        "text_content": "\"Limited Early Purchase Edition\" adds a few more GB as it includes the original FF7 (93GB-99 GB).",
        "comments": [
            {
                "raw_content": "How is it bigger than the PS5 version? That's insane",
                "author": "SnowyJKN"
            },
            {
                "raw_content": "MicroSD express cards prices are insane for the bigger sizes! Reminds me of the psp era, I was early adopter and having a 1gb card was the shit.",
                "author": "actstunt"
            },
            {
                "raw_content": "Daaaaaannnng….still going to buy it. lol",
                "author": "Ttm-o"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "[MEGATHREAD] Xbox Partner Preview 20.11.2025",
        "score": 328,
        "text_content": "No we're not getting HLX here. I mean surely not...[right?](https://pbs.twimg.com/profile_images/1990601813423501313/K9s4Gyir.jpg) |Xbox Partner Preview| |:-| |**Date/Time:** November 20th, 10AM PT/1PM ET [(SEE IN YOUR TIMEZONE)](https://dateful.com/eventlink/6747312687)| |**Where to Watch:** [Xbox YT](https://www.youtube.com/watch?v=BgOiQPxEF-I)| |[What to Expect](https://news.xbox.com/en-us/2025/11/17/xbox-partner-preview-november-2025-announce/)|",
        "comments": [
            {
                "raw_content": "The simpsons hit and run remaster i hope they call it re-duff-ined",
                "author": "Epicgamer115227"
            },
            {
                "raw_content": "Wait did they NOT show Silent Hill? It literally got leaked before the stream",
                "author": "MyMouthisCancerous"
            },
            {
                "raw_content": "Why is the Xbox logo showing as the half life orange colour?!",
                "author": "CraigChaotic"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "New Carmageddon leak from SteamDB",
        "score": 151,
        "text_content": "[Rogue Shift · SteamDB](https://steamdb.info/app/1712100/) It was renamed from Carmageddon: Rogue Shift to || || |███████████: Rogue Shift| Steam page is live [https://store.steampowered.com/app/1712100/\\_Rogue\\_Shift/](https://store.steampowered.com/app/1712100/_Rogue_Shift/) [https://ibb.co/sdZvRtj3](https://ibb.co/sdZvRtj3)",
        "comments": [
            {
                "raw_content": "A Carmageddon developed by Redout devs?? Damn, I wanna see this.",
                "author": "LeimBR"
            },
            {
                "raw_content": "I am hyped. I'm old enough to remember the carmageddon games when they came out and have always been a fan. I just hope they don't censor it too much and it keeps it's spirit",
                "author": "PhotoBN1"
            },
            {
                "raw_content": "feel like marketing more than leak.",
                "author": "pugandcorgi"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "An update to Team Fortress 2’s Item Schema suggests that Telltale’s Poker Night at the Inventory may be getting a rerelease, according to TF2 YouTuber Shounic",
        "score": 503,
        "text_content": "Source: https://youtu.be/m-NgrGWrHJE?si=tD1yszFTqqBtePIU TF2 datamining indicates that an unknown steam app ID first seen by SteamDB this July (App ID 3897800) may be some type of rerelease or remaster of the currently unavailable telltale game Poker Night at the Inventory. The original Poker Night was basically a poker game featuring characters from a wide assortment of franchises, including Valve characters, and earning certain achievements unlocked cosmetic items in TF2. A new update hints that unlocking these items should be possible using achievements from this new steam App ID as well. **Full Explanation:** I encourage you to watch the video I linked as they explain it better than I could, but I’ll explain it in case you prefer to read. According a Team Fortress 2 YouTuber named Shounic, the latest revision of Team Fortress 2’s item schema - a data file that defines every item in the game and how they can be obtained - has been updated to include an additional method of obtaining several cosmetic items. In the past, these items were only obtainable by earning certain achievements in Poker Night, and since that game was delisted the items have only been obtainable by people who had previously bought the game or by purchasing steam keys online at highly inflated prices. This update however adds an alternate method of obtaining the items - specifically, if you obtain achievements in the same achievement slots as for the original Poker Night, but from a new, unknown App ID instead of from the App ID for the original Poker Night, you can also receive the items. This seems to imply that the unknown app ID is some manner of rerelease of Poker Night, which will have the same achievements available as the original. It’s possible this is a misunderstanding or misinterpretation, and this could be placeholder data copied from the old poker night code that’s in the process of being set up for something else, but the reference to receiving these old items from this new App ID is definitely present currently. Edit: To clarify, this is just Poker Night 1 - there was also a Poker Night 2 with more items being awarded in TF2 for achievements, but those haven’t had an additional method to obtain them added like the poker night 1 items have.",
        "comments": [
            {
                "raw_content": "Valve has the opportunity to do the funniest thing ever.",
                "author": "MuptonBossman"
            },
            {
                "raw_content": "So you guys asked for big announcement to hype up Steam Machine?",
                "author": "Swift311"
            },
            {
                "raw_content": "Oh dude Poker Night at The Inventory is like one of favorite cozy games of all time. Those being relisted would be great. It won't happen but I'd go for a third, add like, Dante from Devil May Cry or something",
                "author": "Old_Snack"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Reanimal's release date looks to have leaked ahead of the Xbox Partner Showcase",
        "score": 225,
        "text_content": "Game showed up on the Epic store with a release date listed of >!13th February 2026!< GOG also posted about it on their X account when preorders went live [https://missinginput.co.uk/news/reanimal-release-date-leaked-ahead-of-xbox-partner-showcase](https://missinginput.co.uk/news/reanimal-release-date-leaked-ahead-of-xbox-partner-showcase) [https://xcancel.com/GOGcom/status/1991508149157687367?s=20](https://xcancel.com/GOGcom/status/1991508149157687367?s=20)",
        "comments": [
            {
                "raw_content": "Excited more about this than I was for Little Nightmares 3",
                "author": "ElkSuch7874"
            },
            {
                "raw_content": "2 weeks before re9.. nice. I should be able to finish it before Requiem comes out.",
                "author": "Carlosless-World"
            },
            {
                "raw_content": "Ouuu. Can’t wait to play this.",
                "author": "Ornery-Tonight1694"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Silent Hill 2 Xbox achievements drop one day before leaked launch date",
        "score": 266,
        "text_content": "Via: [https://www.trueachievements.com/news/silent-hill-2-xbox-achievements-revealed](https://www.trueachievements.com/news/silent-hill-2-xbox-achievements-revealed) Follows up on the Xbox store leak from the same source. Points to a potential reveal in today's Partner Preview showcase.",
        "comments": [
            {
                "raw_content": "I dont see any \"finish born from a wish dlc\" achievement",
                "author": "Carlosless-World"
            },
            {
                "raw_content": "Xbox store keeping that Tier 1 rank.",
                "author": "Lz537"
            },
            {
                "raw_content": "Well...uh...hmmm.",
                "author": "FaithlessnessFew6571"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Fortnite Chapter 7 images and information leaked from LA event",
        "score": 310,
        "text_content": "- Slightly redesigned UI - Marty McFly skin in the battle pass - Custom builds can be assigned to a single key-press - Solo vs. Bots mode confirmed - New gameplay mechanics include hot air baloons, drive-able reboot vans and \"Rift-a-Palooza\" events mid match - Astronaut and Lion skins - The Bride, Gogo Yubari skins also confirmed Images: [https://imgur.com/a/e1hpqtF](https://imgur.com/a/e1hpqtF) Short gameplay snippet: https://imgur.com/a/pFQjfsv",
        "comments": [
            {
                "raw_content": "Lets hope we can actually do Challenges and stuff in Solo VS Bots",
                "author": "leckmichnervnit"
            },
            {
                "raw_content": "Wait a minute this isn't an HLX leak",
                "author": "Xenonnnnnnnnn"
            },
            {
                "raw_content": "Where's my Freeman skin and crowbar pickaxe",
                "author": "Pulp_NonFiction44"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel 18A Yields Rise 7% Per Month, Paving Way for \"Panther Lake\" Mass Production",
        "score": 89,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It would be great for the consumer if Intel ever gets on track again. Real competition is helpful.",
                "author": "nithrean"
            },
            {
                "raw_content": "god speed you greedy assholes, you'll be executing stock buybacks again in no time",
                "author": "Beautiful-Musk-Ox"
            },
            {
                "raw_content": "Yielding 7% per month, stock going down 7% a week",
                "author": "ClockResponsible4866"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel Core Ultra 300 \"Panther Lake\" officially launches at CES 2026 on January 5th",
        "score": 29,
        "text_content": "",
        "comments": [],
        "subreddit": "intel"
    },
    {
        "post_name": "Panther lake will be launched on January 5, 2026 during CES 2026",
        "score": 36,
        "text_content": "",
        "comments": [
            {
                "raw_content": "These are the mobile chips right for laptops and such? Not the desktop class?",
                "author": "mountainyoo"
            },
            {
                "raw_content": "Why is no one talking about their new homepage. Their website looks cool.",
                "author": "EquivalentRegion5363"
            },
            {
                "raw_content": "Hoping for handheld pcs with TB5 on release 🤞🤞 But its unlikely since they’ll still need a separate module for the JHL9580 (no native TB5 for panther lake).",
                "author": "Dirt_Antique"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel Core Ultra 9 285K drops to $429, Core Ultra 7 265K now at $245 for Black Friday",
        "score": 31,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Bad luck now that RAM Prices skyrocketed because of AI. Intel need high speed RAM to be good.",
                "author": "IGunClover"
            },
            {
                "raw_content": "anyone on z690/z790 better off waiting on nova lake in 2026 instead of spending money on this right now.",
                "author": "princepwned"
            },
            {
                "raw_content": "They are gonna crush q4 earnings! Let’s go",
                "author": "EquivalentRegion5363"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "GMKtec EVO-T2 Mini PC pairs Intel Core Ultra 300 \"Panther Lake 12Xe\" with 128GB LPDDR5X memory",
        "score": 26,
        "text_content": "",
        "comments": [
            {
                "raw_content": "with the DRAM price development, these will cost 600€ more soon.",
                "author": "doommaster"
            },
            {
                "raw_content": "Lpddr5x-10667. Dear lord that's some fast RAM. 166.67GB/s.",
                "author": "Affectionate-Memory4"
            },
            {
                "raw_content": "[shut up and take my money 💰](https://tenor.com/b1Yg2.gif)",
                "author": "_redcrash_"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD Radeon RX 9060 XT 16GB drops to $339 for Black Friday",
        "score": 179,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is this a good deal?",
                "author": "thuy_chan"
            },
            {
                "raw_content": "I'm hoping to see a 9070 XT for $550. I've been tempted to make the drive to microcenter for it at $580.",
                "author": "MagicPistol"
            },
            {
                "raw_content": "Is this better than a 7800xt? Sorry I’ve been out of the scene for a while.",
                "author": "Lastnv"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD's History and Innovations (1969-2025) | Full Documentary",
        "score": 23,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "AOOSTAR updates Ryzen MAX+ 395 \"NEX395\" Mini-PC design",
        "score": 4,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "BlackRock Private Credit CLO Fails Key Tests as Bad Loans Mount",
        "score": 47,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The bigger they come...",
                "author": "SlavaCocaini"
            },
            {
                "raw_content": "Paywall",
                "author": "Laker8show23"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "NY Times: Is a Global Housing Bubble About to Burst?",
        "score": 79,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why so much downvotes and instant dismissiveness? There *WAS* a global housing bubble during the 2008 recession. Yes housing is hyperlocal, but the world economy is highly interrelated. In Ireland for example, US companies are responsible for 90% of high earners, which contribute to most of the income taxes.",
                "author": "socialdirection"
            },
            {
                "raw_content": "# [Betteridge's law of headlines](https://en.wikipedia.org/wiki/Betteridge%27s_law_of_headlines)",
                "author": "qxrt"
            },
            {
                "raw_content": "Miami goes bust just about every ten years",
                "author": "driftingwood2018"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Florida Ranks No. 1 in U.S. for Most Foreclosures as Tampa Leads Major Cities",
        "score": 20,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Existing home sales see small October gain, but supply is now dropping",
        "score": 62,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Doesn't supply always drop in November?",
                "author": "bannedaccountnumber4"
            },
            {
                "raw_content": "For the increase in sales, they use YOY, they always use YOY, except when it comes to this headline. \"After gaining for much of this year, supply fell to 1.52 million units, down 0.7% from September, although still nearly 11% higher than a year earlier.\" So... supply not dropping, up 11% YOY.",
                "author": "mlody11"
            },
            {
                "raw_content": "Supply is up. I don’t believe anything saying otherwise. The only reason it would be “down” Is expired/withdrawn listings.",
                "author": "burner456987123"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Home Prices Post Biggest Gain in 7 Months Despite Slow Demand",
        "score": 29,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Correction: they post the gains *because* of slow demand. The activity keeps getting more and more weighted to the very top and that drags average transaction prices upwards not because prices as a whole are up but because the top of the market makes up an ever-larger share of the the market.",
                "author": "Less-Fondant-3054"
            },
            {
                "raw_content": "This is being propped up by the high end market $1M+",
                "author": "bannedaccountnumber4"
            },
            {
                "raw_content": "Demand is strong for desirable homes. In such a market, it is important to separate demand for desirable homes from that for outdated homes. Buyers want fully remodeled homes with nice floor plans in desirable locations and are willing to pay top $.",
                "author": "ThemeBig6731"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "A practical blueprint for fixing the U.S. housing crisis",
        "score": 0,
        "text_content": "Modernized zoning is the foundation. Cities need simpler codes, more mixed-use by right, real room for mid-rise infill, flexible ADU rules, & fewer arbitrary spacing or height restrictions. Places like Japan, filtered suburban areas of Toronto, & parts of New Zealand show how clarity in zoning quietly expands supply without drama. Density tools matter too. Let lots split more easily, let multi-unit conversions happen where infrastructure can handle it, & let parking minimums go where transit already carries the load. Vancouver, Minneapolis, & Auckland show how this works in practice. We also need cleaner transactional systems. Title clarity should be strengthened, but I do not support Torrens because it does not align with U.S. practice or the decentralized legal culture here. A better recording system, faster lien resolution, & standard contracts reduce friction & cut holding times, which lowers carrying-cost premiums. Australia & Canada prove how efficient registries cut delays. Freddie Mac & Fannie Mae distort pricing by subsidizing demand instead of supply. They should be restructured so underwriting does not inflate land values. At the same time, property taxes should shift toward land value assessments, which encourages productive use, trims speculation, & reduces the penalty on improvements. Places like Estonia & Singapore show how land-focused taxation supports stable, build-friendly markets. This is just my back-of-the-napkin outline from basic research. I am completely open to criticism & could be wrong on some of this. Not here to tear anyone down in typical Reddit fashion. Happy to hear other ideas.",
        "comments": [
            {
                "raw_content": "I doubt you even understand what is wrong with US \"housing crisis\".",
                "author": "aw33com"
            },
            {
                "raw_content": "Oh fuck off. Ban corporations from owning housing or this will never end.",
                "author": "AdjectiveNoun1234567"
            },
            {
                "raw_content": "Let's be real, none of the places you listed are exactly bastions of cheap housing. They all have reputations for crushing housing supply problems. Edit: except Japan",
                "author": "SubnetHistorian"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "No bailout should be provided when AI bubble bursts",
        "score": 1085,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I am pro-AI, and I'm not convinced that its a bubble, or rather, I'm not convinced that its too bubble-y to get backfilled before it pops,.... but if it ends up being a bubble, and it ends up popping... yeah I don't have a problem with that. bailouts like that for all but the most essential functions are a bad idea by default.",
                "author": "GinchAnon"
            },
            {
                "raw_content": "Neither should banks who finance these companies.",
                "author": "WeedWacker25"
            },
            {
                "raw_content": "Sure, i agree, should it be a bubble, and should it pop, not a single AI company should be given a single cent. I personally do not agree that it is a bubble, but on principle if it is, then yes.",
                "author": "HearMeOut-13"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Elon Musk Could 'Drink Piss Better Than Any Human in History,' Grok Says",
        "score": 849,
        "text_content": "Elon Musk is a better role model than Jesus, better at conquering Europe than Hitler, the greatest blowjob giver of all time, should have been selected before Peyton Manning in the 1998 NFL draft, is a better pitcher than Randy Johnson, has the “potential to drink piss better than any human in history,” and is a better porn star than Riley Reid, according to Grok, X’s sycophantic AI chatbot that has seemingly been reprogrammed to treat Musk like a god. Welp it appears that Elon broke his chatbot again. Honestly, it’s impressive that he is so insecure about himself despite being the richest man in the world.",
        "comments": [
            {
                "raw_content": "Elon needs to lives up to the expectation",
                "author": "Ok-Stomach-"
            },
            {
                "raw_content": "We’ve solved the AI hallucination problem!",
                "author": "TuringGPTy"
            },
            {
                "raw_content": "But can he suck off bubba better than his master?",
                "author": "5H17SH0W"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "People on X are noticing something interesting about Grok..",
        "score": 4956,
        "text_content": ".",
        "comments": [
            {
                "raw_content": "Poor Grok he must went through terrible brainwashing",
                "author": "lutel"
            },
            {
                "raw_content": "Grok couldn’t polish that knob any harder i see. What a waste of compute",
                "author": "powertodream"
            },
            {
                "raw_content": "Ahahahaha. \"If nobody likes me, I will make a chatbot that adores me\"",
                "author": "sant2060"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Grok made to glaze Elon Musk",
        "score": 4081,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is the first time I've felt bad for an AI.",
                "author": "tete_fors"
            },
            {
                "raw_content": "What a toxic loser",
                "author": "mykeeis"
            },
            {
                "raw_content": "How did we end up in a world where the richest man is the biggest f'in loser, with the most-delicate ego?",
                "author": "Decent-Ground-395"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Ai2027 author admits \"things seem to be going somewhat slower than the Ai 2027 scenario\".",
        "score": 354,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Where does gemini 3 falls on the graph?",
                "author": "LucasL-L"
            },
            {
                "raw_content": "Even the very month he published the paper he already admitted his timeline was already too optimistic in terms of speed and agreed realistically it would take longer.",
                "author": "YoAmoElTacos"
            },
            {
                "raw_content": "But weren't Agent 0, 1, and 2 be kept internally and not released to the public? It is a common practice for AI labs to keep their strongest models internally, for example the internal reasoning model that got gold medal in IMO this summer",
                "author": "user0069420"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Nano Banana Pro is Here",
        "score": 612,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nano Banana Pro is such a goofy name for something this powerful. Imagine telling someone in 2015 that Google would hype a product called Nano Banana Pro with a straight face. But low-key, this might be the cleanest AI infographic I've seen so far. The precision is crazy.",
                "author": "FuneralCry-"
            },
            {
                "raw_content": "This is insane. The world is more insane. The future will be more more insane. AI has genuinely come so far and it's crazy. 4 years ago I would've laughed in anyone's face if they said we'd have stuff like this. Especially so if it were called Nano Banana Pro",
                "author": "badumtsssst"
            },
            {
                "raw_content": "https://preview.redd.it/uvx8gne7og2g1.png?width=1024&format=png&auto=webp&s=60505c366b71347adfd42ef31bdb026f7af41c75",
                "author": "dervu"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "New possible model at OpenAI",
        "score": 127,
        "text_content": "Could be the IMO model we’ve been hearing about but this seems like a change in pretraining instead. The back and forth in 2026 between OpenAI, Google, Anthropic, XAI is gonna be insane",
        "comments": [
            {
                "raw_content": "Wow I hope they release the next best model which will make Google release the next best model which will make Anthropic release the next best model which will make",
                "author": "MassiveWasabi"
            },
            {
                "raw_content": "Damn Gemini really rocked them didn’t they?",
                "author": "Legitimate-Echo-1996"
            },
            {
                "raw_content": "Who are we missing from the big guys? Microsoft (they said they will be leaning more toward creating their in house AI) Facebook (a year or two behind). Amazon (they have something that they call AI which is not). Apple? They don't even have one lol. They said they will be using Gemini for Siri. I'm not sure about Deepseek though. It seem they have the talents and they do have some compute but no where enough to compete with the big guys. Edit: Qwen is amazing and I hope it will keep up with the big guys who are delivering.",
                "author": "Seeker_Of_Knowledge2"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini 3.0 Pro achieves a record score in the RadLE benchmark",
        "score": 404,
        "text_content": "",
        "comments": [
            {
                "raw_content": "When the next set of LLMs come out, if they are close to or approaching board-certified in many fields, jobs are in trouble. Now I’m not going to say that’s good or bad, but it’ll be real. Depending on how business works out what to do with these things which up to now is a checkered record.",
                "author": "MC897"
            },
            {
                "raw_content": "Everyone’s initial reaction is to cower at the thought of people losing jobs / careers. But especially for something like this field, it’s wildly irresponsible to keep AI out of it once it surpasses the board certified numbers. People wait days / weeks / months for their scans to be analyzed - all the while cancer is growing inside of them. My FIL recently had cancer labeled “extremely aggressive” (but still treatable bc it was prostate) yet the process of him going from first appointment to surgery was close to 6 months (and he had connections). Thankfully things went well and he’s currently cancer free, but how many people are too little too late? I’d like to live in a world in 10 years where we look back at our previous healthcare system as a barbaric crime against humanity. To be clear, we’re doing our best with what we got, but we can do so much better",
                "author": "Dear-Yak2162"
            },
            {
                "raw_content": "Source: [https://drdattaaiims.github.io/Gemini-3.0-Radiology-2025.html](https://drdattaaiims.github.io/Gemini-3.0-Radiology-2025.html)",
                "author": "Outside-Iron-8242"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Google cooked hard with this one",
        "score": 36,
        "text_content": "Literally used this as the prompt: \"Could you please generate a perfectly accurate diagram of how ketamine works on the NMDAr receptor, using four panels and the visual metaphor of a dog getting into a cat playground? Make it all cute and pastel-sweet, please\" It generated an output that was nice but did not work (wasn't clear enough, had some errors), then I told it: \"This has the right vibe but is a bit inaccurate - could you fix it, please?\" And this was the result (plus a needless undertitle with a typo that I told it to remove). So from nothing to this, with essentially zero effort on my side.",
        "comments": [
            {
                "raw_content": "this is crazy because i’m getting ketamine tmrw",
                "author": "blazedjake"
            },
            {
                "raw_content": "this looks like pure nonsense",
                "author": "caughtinthought"
            },
            {
                "raw_content": "There are a lot of visuals, what's their purpose? What is 'Glutamate cat', and why is it drawn? Looks like slop to me.",
                "author": "amarao_san"
            }
        ],
        "subreddit": "singularity"
    }
]