[
    {
        "post_name": "⛪",
        "score": 641,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Whoever thought it was a good idea for women to be church leaders was probably a retard.",
                "author": "Than0sIII"
            },
            {
                "raw_content": "Why do the CCP kill Christians??",
                "author": "guywholikesDjtof2024"
            },
            {
                "raw_content": "Nicki Minaj never got the clot shot and was crucified by her \"peers\" in Hollywood because of it.",
                "author": "fat50"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"California has historically imported the highest number of H1B foreigners. They also have the highest amount of public defecation occurrences, up 140% over the past 5 years. Ill be updating my résumé moving forward to include \"potty trained\" to try and edge out these highly talented foreigners.\"",
        "score": 641,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We were not founded to be a nation of strangers and immigrants. We were a collection of Christian and deist colonies. 9/13 states had a state religion and all but NJ excluded atheists from government services. I say this as someone who isn't too religious. I loathe the 20th century indoctrination that America is just an economic zone. Once again WE WERE LIED TO about all these government programs. The incoming tax was only supposed to be on the equivalent of modern billionaires. Visa programs were supposed to bring in only the top 1% of 1%. We were LIED to. We want fucking revenge. We want solutions. We never consented to this shit. Now there's going to have to be immense pain as we send millions of unassimilated immigrants back. I don't care how many crying Muslim women you show me. It's your fault for bringing them here. There's going to be increasing unrest and violence until this demographic disaster is fixed.",
                "author": "MasterChief08"
            },
            {
                "raw_content": "raise tariffs on H1Bs by 9,001%",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Indians belong in their cow dung festival parades, not working in America. America First! 🇺🇸",
                "author": "MedicallyReddit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Breaking: physical Silver is limited and derivative paper silver holders are nervous. old perceptions are gone. We are about to have $5 days and on to $10, $100, $1000's",
        "score": 262,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hoard all PHYSICAL gold. Same with all precious metals. Buy as much as possible. Go go go. The deepstate is after it, you should be too. Certificates are bogus.",
                "author": "guywholikesDjtof2024"
            },
            {
                "raw_content": "Oh FFS! We're pushing this bullshit again? Based on a 12 hour graph? Excuse me, do you have a moment for me to tell you about the love of Pepe Coin?",
                "author": "Trump2024"
            },
            {
                "raw_content": "\"The silver is mine, and the gold is mine, saith the Lord of hosts.\" - Haggai 2:8",
                "author": "Saint_Samurai"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Contact Trump to express disapproval of the \"needing Chinese students\" and \"needing H1B workers because Americans lack talent\" statements. He needs to hear it from his voter base that these sentiments are anti-MAGA and NOT okay.",
        "score": 125,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This should be stickied",
                "author": "ReallyGayMods"
            },
            {
                "raw_content": "Unfortunately his voter base is Indians and chinese",
                "author": "BannedAccount"
            },
            {
                "raw_content": "I have shared my disapproval with the White House and encourage everyone to do the same. It may be time for the America First movement to get better organized because we are obviously being betrayed.",
                "author": "Tweedlethree"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Secretary Brooke Rollins uncovers SNAP fraud: “5,000 dead people getting SNAP. And 500,000 people getting SNAP twice under the same name.\"",
        "score": 1030,
        "text_content": "",
        "comments": [
            {
                "raw_content": "At this point what’s the benefit of having any government programs??",
                "author": "Wupta"
            },
            {
                "raw_content": "Just Shut. It. Down. It's too corrupt to fix. Work or starve, isn't that the mantra of the socialist/communist bullshit they want so bad...",
                "author": "TrumpPatriot84"
            },
            {
                "raw_content": "The only way I believe this is if those numbers are from one county. Fraud is way bigger than this.",
                "author": "josiborg"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: November 18th -BRAVE CHRISTIANS are MARCHING on Dearborn Michigan!!! 😲 THOUSANDS of PATRIOTS will peacefully gather 3pm!!!",
        "score": 1265,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How about we focus like this instead of burning the Talmud: 1. Deal with Israeli influence on our corrupt politics by doing something about AIPAC. 2. Scourge the Islamists from our homeland. 3. Deny Dualies positions in government.",
                "author": "shadypollster"
            },
            {
                "raw_content": "Get the Muslim infidels OUT of Dearborn - OUT of Michigan - OUT of America.",
                "author": "MAGAguitar"
            },
            {
                "raw_content": "Here is the thing STOP OPPOSING ISLAM BY COUNTERING WITH CHRISTIANITY * ITS SETS UP A FALSE EQUIVALENCY * THE QURAN IS NOT THE ISLAMIC BIBLE THERE IS ALSO THE HADITH AND ALL THE SUNNAH - NOR IS CHRISTIANITY AND ISLAM JUST TWO DIFFERENT RELIGIONS. > ISLAM IS AN ALL ENCOMPASSING TOTALITARIAN POLITICAL IDEOLOGY INCOMPATIBLE WITH WESTERN IDEALS OF FREEDOM. YOU **MUST** ADDRESS ISLAM AS A ***POLITICAL IDEOLOGY*** DIRECTLY HOSTILE TOWARDS AMERICA. BY DEFINITION THEY MUST OVERTHROW OUR GOVERNMENT. NO SUCH PERMANENT COMMAND IS PART OF CHRISTIANITY. ISLAM IS MORE LIKE A WORSE COMMUNIST SYSTEM if you don't and just say rah rah Jesus. You play into their hands. The ONLY path towards fighting them and winning is to NOT give them the veneer of religion. By \"fighting\" with them as \"team Christian\" you set up the concept that it's two religions. And you can't win that way.",
                "author": "MAGALADON9"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "America Was A Great Country & Leading In Technological Innovation Long Before The H-1B Program",
        "score": 1061,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The entire concept of H1B is anti-American, and will likely be a massive contributor to the downfall of our country and the implosion of the economy. While a few aliens are being deported - hoards of leeches are being imported to destroy our children's future. There is no shortage of talent here in the USA, and the clowns that they are importing are not nearly as skilled as our fellow Americans (they are simply cheap labor who they hope to convert into new voters).",
                "author": "PedePete"
            },
            {
                "raw_content": "Wonder why we are getting spammed with H1B shit? Someone is now offering $3-5k per post of \"pro-H1B\" propaganda! https://x.com/Will_Panic/status/1988676599303270490",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "Deport all poopjeets",
                "author": "MedicallyReddit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨BREAKING🚨 Judge Hendrix just granted @AGPamBondi & @TheJusticeDept 's request for an extension to respond to our One Big Beautiful Lawsuit, which is seeking to finish the job Congress failed to do & gut the registration requirements for suppressors & short-barreled firearms.",
        "score": 1128,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If you're not a member of GOA, you should be. Also, FPC.",
                "author": "JohnN"
            },
            {
                "raw_content": "I will not register or pay a tax for any firearm, ammo or related item. shall not be infringed.",
                "author": "throttlejohnson"
            },
            {
                "raw_content": "GOA>NRA Fight me.",
                "author": "Womb___Raider"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "It's what plants crave.",
        "score": 1321,
        "text_content": "",
        "comments": [
            {
                "raw_content": "CO2 is good for the atmosphere and biosphere. Releasing more of it should be celebrated",
                "author": "MoreGuns"
            },
            {
                "raw_content": "A great study is the Vostok ice core samples. It found that higher temperatures cause higher levels of co2 and not the other way around",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "Remember the left always projects! The CO2 Cycle, is scientific fact! They are the ones that are denying science! https://earthobservatory.nasa.gov/features/CarbonCycle A friendly reminder YOU are the carbon they want to reduce!",
                "author": "patrioticwinning3"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A very wise man once said:",
        "score": 356,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Point # 6 is vastly underrated. We need to include the K-12 public ~~education~~ indoctrination system as well.",
                "author": "Necrovoter"
            },
            {
                "raw_content": "He was SO far ahead of his time and he was only 31",
                "author": "MocksFordComma"
            },
            {
                "raw_content": "Best I can do is 50 year mortgage, 600k Chinese students, and even more h1b pajeets",
                "author": "ParadigmShift2070"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Trump administration is now requiring SNAP recipients to prove they are actively searching for a job to receive benefits. 🇺🇸",
        "score": 1539,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And drug test these freeloaders",
                "author": "USNVET71"
            },
            {
                "raw_content": "It's incomprehensible that this was ever not the case. But all it's going to do is increase the already staggering number of no-call & no-shows after they get called in for their first day of work. We see it a ton, they get interviewed and they're excited for work, then they just ghost us. I guarantee you those people are collecting unemployment & other gibs dependant on \"job searching\".",
                "author": "Zskills"
            },
            {
                "raw_content": "Is it also a requirement to show proof of US citizenship?",
                "author": "axiy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "JFK’s grandson, Jack Schlossberg, announces his big for Congress in New York to replace Jerry Nadler. He’s 32 years old and one of the only jobs he’s ever had was working for Vogue magazine.",
        "score": 916,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They're going to *love* this jackass. Too bad about the last name kek",
                "author": "DrJosephWarren"
            },
            {
                "raw_content": "Who gives a fuck about politics at this point. Time for Americans to stop complying and take our country back ourselves. Stop buying from companies that hate you, stop paying the government, and take back your local communities.",
                "author": "AmericanForever"
            },
            {
                "raw_content": ">He’s 32 years old and one of the only jobs he’s ever had was working for Vogue magazine. Leftists: He's perfect!",
                "author": "Mr_Rightside"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Democrats Somberly Remove Sombreros, Signaling End Of Shutdown",
        "score": 785,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Now remove kebab.",
                "author": "guywholikesDjtof2024"
            },
            {
                "raw_content": "Everyone start grilling and put a slice of cheese on a raw patty in honor of Schumer's latest failure.",
                "author": "OutlawPurpleHairDye"
            },
            {
                "raw_content": "Reminder that the Babylon Bee is ran by Joel Berry who is anti-white and israel first. Good meme though",
                "author": "Thatunknownguy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "NOW - Rubio: \"The Chinese are undertaking the most rapid military buildup in human history, and part of that is their expansion of their nuclear capabilities... I think everybody's concerned about that.\"",
        "score": 1139,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You're right, Rubio. That does sound concerning. Anyways, let's import half a billion of these people to continue stealing our technology.",
                "author": "-Evspra"
            },
            {
                "raw_content": "We should take in 600,000 of them as students to learn how to kill us and go back to do it.",
                "author": "josiborg"
            },
            {
                "raw_content": "So uhh...let's keep educating their next generation in Nuclear Engineering? I'm so confused",
                "author": "I_Am_John_Galt"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "S T I L L - T R U E . . .",
        "score": 1079,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He's clearly protecting his Israeli donors.",
                "author": "SonOfThunder"
            },
            {
                "raw_content": "That's great! Release them anyway!",
                "author": "tribunabessica"
            },
            {
                "raw_content": "A good old reminder from Posobiec.",
                "author": "frenacrossthepond"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Lmaooo. Trump gave the President of Syria a bottle of Trump cologne earlier this week when he visited the White House. “The other one is for your wife. How many wives?” “One.” “With you guys, I never know.” 🤣",
        "score": 1003,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It is disgusting that we lifted sanctions on Syria now that head-chopping, heart-eating, baby-raping, anti-secular, anti-Christian terrorists have conquered it... but we got a good joke out of it! Classic.",
                "author": "tarballs"
            },
            {
                "raw_content": "This feels like paid shilling, I've seen too many Conservative influencers laughing at this. This guy was a terrorist beheading Christians. I don't want fucking jokes with him, I don't want him in our country at all.",
                "author": "603taco"
            },
            {
                "raw_content": "I wonder if he gave him a bottle for genociding christians. 🤔",
                "author": "SaltyLandscaper"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Throw in the towel, guys… a bunch of incels on the internet repeated a three word string of nonsense in an attempt to remain relevant.",
        "score": 396,
        "text_content": "",
        "comments": [
            {
                "raw_content": "For as long as I draw breath, MAGA is not dead. I'll MAGA all by my damn self if I have to",
                "author": "magapatriot_pa"
            },
            {
                "raw_content": "MAGA is America first and niether are going anywhere.",
                "author": "Awakened"
            },
            {
                "raw_content": "\"MAGA\" was dead when Israel convinced Trump to not release the Epstein Files and bomb Iran instead.",
                "author": "MemeLawd"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "You're GD right",
        "score": 1333,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They have nuclear families and strong communities. They don't need government for that.",
                "author": "Get_Off_Big_Tech"
            },
            {
                "raw_content": "And most of those kids know who their fathers are.",
                "author": "LegendFang"
            },
            {
                "raw_content": "They pass down property to their children. They don't sell out to contractors.",
                "author": "TheSwampThang"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Democrat Arizona Governor Katie Hobbs is under investigation for Racketeering. A operator for group homes for foster children gave Katie Hobbs $400,000, in return Katie Hobbs let the company increase rates 65% allowing them to steal millions from taxpayers.",
        "score": 1349,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Couldn’t happen to a more deserving politician.",
                "author": "HumphreyPlowjogger"
            },
            {
                "raw_content": "lock 𝗁̶𝖾̶𝗋̶ .. anybody up",
                "author": "k-doe3"
            },
            {
                "raw_content": "The worst part about corrupt politicians is how cheaply they sell themselves. If you are going to be a traitor, at least get generational wealth out of the deal, like Pelosi.",
                "author": "ReleasetheList"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "John fetterman appears on CNN to say that the far left is a much more bitter poison than the far right. CNN rees.",
        "score": 1094,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Are we seeing a correlation with you need to have a stroke to finally stop being a brain dead democrat?",
                "author": "Ikon"
            },
            {
                "raw_content": "Fetterman represents the biggest swing state. Even his stroke-struck brain knows moderates still carry such elections.",
                "author": "EuphoricTrillby"
            },
            {
                "raw_content": "Why does he do all his interviews from inside a dungeon?",
                "author": "peterstrzoked"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Valve Says It Has a 'Pretty Good Idea' of What Steam Deck 2 Is Going to Be, Explains Why It's Holding Off for Now",
        "score": 425,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">We're not interested in getting to a point where it's 20 or 30 or even 50% more performance at the same battery life. We want something a little bit more demarcated than that. So we've been working back from silicon advancements and architectural improvements, and I think we have a pretty good idea of what the next version of Steam Deck is going to be, but right now there's no offerings in that landscape, in the SoC [System on a Chip] landscape, that we think would truly be a next-gen performance Steam Deck. Seems to me like they're hinting at ARM.",
                "author": "FragmentedChicken"
            },
            {
                "raw_content": "Either ARM or rdna 6 with hardware fsr upscaling",
                "author": "IAmScrewedAMA"
            },
            {
                "raw_content": "smart. these half-step mobile chips are extremely underwhelming. i'm not sure who'd buy something physically incapable of decent upscaling.",
                "author": "gokarrt"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Steam Hardware Announcement",
        "score": 1126,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Died 2007 Born 2026, welcome back Nintendo Gamecube",
                "author": "LordCapeNSword"
            },
            {
                "raw_content": "Biggest announcement is the controller for me. The Steamdeck touchpads are unrivaled. Im really looking forward to being able to play games on either deck or TV with the exact same control scheme",
                "author": "QuadratClown"
            },
            {
                "raw_content": "28CU RDNA3 w/ 8GB VRAM, a bit below a RX 7600? also means no FSR4 as of now",
                "author": "pewciders0r"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[News] NAND Giants Reportedly Cut Output in 2H25 as Prices Surge; Samsung Mulls 20–30% Hike in 2026",
        "score": 26,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Totally not price fixing (TM) At this point China will take over majority of NAND market within a decade and all of those fucktards will come crying to respective governments.",
                "author": "Kinexity"
            },
            {
                "raw_content": "This is just a poorly written paraphrasing of the article it's citing. The chosun biz articles quoted an \"industry official\" saying they're cutting production of TLC to convert existing TLC production lines to QLC.",
                "author": "bazooka_penguin"
            },
            {
                "raw_content": "Are RAM and SSDs going to increase even more in a couple months? They already jumped almost 50%.",
                "author": "vegetable__lasagne"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "The New Steam Hardware is AMAZING!!",
        "score": 147,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Very interested to see the pricing on the new Steam Machine.",
                "author": "INITMalcanis"
            },
            {
                "raw_content": "Why do they call the Steam Machine compact? Six inches is pretty huge",
                "author": "skunkwalnut"
            },
            {
                "raw_content": "Dave is such a solid reviewer. Concise and informative. Most other channels are rambling and have broken up this is multiple videos. Linus was overly excited and sycophantic.",
                "author": "joeyat"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Steam Frame, Steam Controller, Steam Machine announcement is expected soon, here's a first look",
        "score": 155,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What is expected of the Steam Machine?",
                "author": "DerpSenpai"
            },
            {
                "raw_content": "The steam frame and controller look really promising. The steam machine depends on the price, but man it would've been nice if it had been RDNA4 based. Probably too expensive for the price point they're going for?",
                "author": "Arachnapony"
            },
            {
                "raw_content": "https://store.steampowered.com/sale/steammachine Semicustom amd cpu and gpu. AMD Zen 4 6C / 12T up to 4.8 GHz, 30W TDP GPU: AMD RDNA3 28CUs, 2.45GHz max sustained clock, 110W TDP RAM: 16GB DDR5 + 8GB GDDR6 VRAM",
                "author": "SirActionhaHAA"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD reveals new roadmap for its Ryzen CPUs, teasing Zen 7 as the true \"next-generation\" leap with 2nm — Lineup confirms 2026 release for Zen 6, coming with expanded AI features",
        "score": 363,
        "text_content": "",
        "comments": [
            {
                "raw_content": "**Tomsharware title is wrong about zen7 node, it's zen6 that is on 2nm, zen7 is on \"future node\"** 1. 4% projected annual growth for dc cpu general compute 2. 18% projected annual growth for ai dc cpu 3. Ai dc cpu sales to more than double total dc cpu market by 2030 from 23b to 60b, ai is boosting dc cpu demand instead of cannibalizing it 4. Amd also \"hiring like crazy\" on software side, total number of hardware and software engineers exceeded 25k, minority on the payroll are managers They are sayin that future epyc growth will be primarily driven by host processors of ai gpu clusters and hinted that uarch emphasis in the next few generations will be on per core perf (ipc + clocks + on cpu accelerators) instead of core spam because ai workloads benefit from st perf This kinda aligns with speculations that zen7 ain't gonna bring major core count increase on the dc side. Client still has room for growth from 16 to 24 or 32, but the primary dc market ain't going for that anymore. Good thing for gamers due to st focus probably tldr, Dc requirements for core count slowing down, amd moving on from mt perf and thread dense market to high per core perf market due to ai and enterprise",
                "author": "SirActionhaHAA"
            },
            {
                "raw_content": "As long as we see good performance increases I don't care if it has better AI features.",
                "author": "kuddlesworth9419"
            },
            {
                "raw_content": "i love ai in my cpu lmao",
                "author": "02mage"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "ASUS Warns PC Prices Could Rise if DRAM and NAND Shortages Persist",
        "score": 19,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Seems like the probability of ASUS and other players (MSI+Gigabyte) raising product prices within the next 2-3 quarters is at least 60-65%. Better to start searching for DDR5 kits, SSD and Discrete Graphics card (which uses GDDR7 or GDDR6) now then adopt the wait for product refresh cycle game.",
                "author": "Primary_Olive_5444"
            },
            {
                "raw_content": "Could? Future tense? The people who run this sub irrationally censor humor, so this sentence exists to explain I'm not making a joke.",
                "author": "Whirblewind"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "SK hynix Reportedly Poised for Over 70% Operating Margin for General-Purpose DRAM amid Tight Supply",
        "score": 39,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Damn, these hardware companies putting up software company style margins these days. Having a leading-edge fab is like a license to print money these days.",
                "author": "Visible-Advice-5109"
            },
            {
                "raw_content": "It's almost as if they spread the rumors of increased demand just to justify 100% increased prices.",
                "author": "ikea2000"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Valve Steam Machine, Desktop SteamOS, Steam Frame VR, & Controller | ft. Engineering Discussion",
        "score": 26,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's worth keeping in mind that Valve extracted ridiculously good performance from the Steam Deck APU by optimising the heck out of SteamOS3 and the drivers. They'll do the same for this 6c Zen4 / 28CU RDNA3 machine, and it'll be *good enough* to run just about any game on Steam well enough to have fun playing it.",
                "author": "INITMalcanis"
            },
            {
                "raw_content": "Damn the steam machine seams really nice until you get to the gpu. An effectively mobile 7600 with 8gb of vram and no fsr4 is pretty rough. Everything else is looking incredible so far",
                "author": "PembyVillageIdiot"
            },
            {
                "raw_content": "26:50 Foveated Streaming chapter is really interesting. Godwin has been a blessing creating Virtual Desktop for the Quest, and shows how good untethered VR can be compared to wired. Seeing Valve's take, with how usually intuitive their engineering is, it'll be interesting to see how robust their adapter is. Not only this, it pairs really well with FS that they've made, streaming data where you're focusing on, without wasting bandwidth, whilst helping to reduce latency. Also, looking at their Steam Link menu, it seems you can share 'eye tracking data to other apps on the PC'. I assume Valve already plans to release the API, frankly due to how apps like VR Chat is massive in this space, and will probably use the tech, so not worried on Foveated Rendering not being a thing. But also, 'hand tracking passthrough', just like the Quest",
                "author": "Noble00_"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "The Rogue Prince of Persia - Nintendo Switch™ 2 Release Date Trailer",
        "score": 111,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Thoroughly enjoyed this from early access to one of the near 1.0 patches. The devs were great with feedback and addressing it and the final product is a banger. Lost Crown takes the cake but this is a great buy imo will definitely double dip after my wallet gets crunched by Metroid…",
                "author": "Bleekster"
            },
            {
                "raw_content": "Is this like Dead Cells meets Hades meets Prince of Persia!?",
                "author": "erratic_calm"
            },
            {
                "raw_content": "It was pretty solid but got burned out on it fairly quickly. I probably enjoyed Lost Crown more a little more.",
                "author": "Voyager5555"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Wait, this trailer is actually so cute and sweet ❤️",
        "score": 28,
        "text_content": "I’m so used to these kinds of commercials coming off as cringy, but this one actually made me have the feels. 😊",
        "comments": [],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "DRAGON BALL: Sparking! ZERO - Nintendo Switch & Nintendo Switch 2 Launch Trailer",
        "score": 24,
        "text_content": "Dragon Ball: Sparking Zero takes the legendary gameplay of the Budokai Tenkaichi series and raises it to whole new levels. Become a super warrior and experience the earth-shaking, limit-breaking power of Dragon Ball battles! Key Features Unleash the strength of over 180 fighters from Dragon Ball Z, Dragon Ball Super, Dragon Ball GT, and selected Dragon Ball movies, all in the base game! Each character comes with their own signature abilities, transformations, and techniques. Make the destructive power of the strongest fighters ever to appear in Dragon Ball yours! Engage in heart-pounding, high-speed 3D battles that stay true to the anime and video game series, with breathtaking visuals and authentic combat moves like beam clashes, rush attacks, movements too quick for the eyes to see, and planet-razing ultimate attacks. Challenge players online to test your skills, enjoy local multiplayer with up to six players on a single console, or connect multiple consoles for wireless play. Experience intense battles and become a Super Warrior with immersive motion controls using the Joy-Con™ controllers. Conquer the action-packed battles from the beloved original story, or discover and unlock new encounters for your favorite Z-Fighters and more. Relive your favorite moments from the series through cutscenes you can experience from the perspectives of eight characters! Recreate your favorite battles from throughout the Dragon Ball story, or set up your dream story battle with your favorite characters! Share your creations with other fans and experience the battles brought to life by imaginations around the world.",
        "comments": [
            {
                "raw_content": "They’re treating the switch 2 like it’s the original switch. It’s like 3rd party devs are not taking it serious. Very disappointing.",
                "author": "dvrwin"
            },
            {
                "raw_content": "If this was 60fps, I’d be so tempted to have it as a handheld game. I hope they patch it in the future. Wouldn’t even mind if they use switch 1 graphics to do it (I actually prefer them more).",
                "author": "AdoIin_"
            },
            {
                "raw_content": "So disappointed that this is 30 fps on Switch 2.",
                "author": "bwhough"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I got an A Rank on the European Hidden Mansion on Gamecube Classics! Has anyone here gotten a higher score than this?",
        "score": 41,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I got a B on the hidden mansion coming up short 20k for the A ending. Til that 3ds has an exclusive S ending.",
                "author": "porsj911"
            },
            {
                "raw_content": "Didn't know this was a thing but that's pretty dope.",
                "author": "Sunofabob"
            },
            {
                "raw_content": "Not yet, because I already did my yearly run before the game launched on NSO. Maybe next October though lol",
                "author": "THE_GR8_MIKE"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Shpeshal Nick says that Steam frame+machine is not the massive video game/gaming related announcement he was talking about on Nov 11",
        "score": 446,
        "text_content": "[https://xcancel.com/Shpeshal\\_Nick/status/1988691363626643582#m](https://xcancel.com/Shpeshal_Nick/status/1988691363626643582#m)",
        "comments": [
            {
                "raw_content": "It seems like Shpeshal Nick has a mixed track record in general but I'm going to take a monster hit of copium and guess that the \"technically no\" means that it's absolutely Valve related (otherwise it wouldn't have needed a response other than \"no\") and there's nothing besides HL3 that's Valve related that would be massive enough to warrant mention in his first tweet. His source is certainly referring to HL3 here. The source's credibility is still up in the air especially since they made no mention of things revealed this week. Despite this, I think I'm inclined to believe this as Valve wouldn't want to overshadow today's announcements with HL3 (smart call) and to collect quick initial feedback on the offerings announced today, but HL3/HLX is very obviously in the polishing stages and close to completion per datamining (if not outright done) and it would be the perfect software to sell people on the new hardware. They even hinted at HL3 with the intentionally placed Lambda logo on the keyboard shown in the video.",
                "author": "industrialmoose"
            },
            {
                "raw_content": "\"Technically no\" is a bizarre response. I think it's obvious HL3 is coming at some point, but I would love an announcement before the end of the year.",
                "author": "lvscksi"
            },
            {
                "raw_content": "I think it's important to note his exact wording was \"*technically* no\", which leads to the assumption it's something related to Steam's new hardware. Possibly a certain game (HL3) getting announced as a day-one release.",
                "author": "stormsgrimm"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Steam Frame officially shows up on Steam page",
        "score": 2069,
        "text_content": "[https://store.steampowered.com/sale/steamframe](https://store.steampowered.com/sale/steamframe) \\+ Steam Machine - [https://store.steampowered.com/sale/steammachine?snr=1\\_7\\_15\\_\\_13](https://store.steampowered.com/sale/steammachine?snr=1_7_15__13) + Steam Controller - https://store.steampowered.com/sale/steamcontroller Previous Rumors: [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1ov6iks/the\\_official\\_and\\_authorized\\_steam\\_deck/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1ov6iks/the_official_and_authorized_steam_deck/) [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1ouvap1/mooreslawisdead\\_if\\_youre\\_a\\_fan\\_of\\_valvesoftware/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1ouvap1/mooreslawisdead_if_youre_a_fan_of_valvesoftware/)",
        "comments": [
            {
                "raw_content": "Coming early 2026",
                "author": "RedTib"
            },
            {
                "raw_content": "Does anyone remember that random Reddit account that asked how people felt about the name steam frame like almost a year ago? I wish I kept track of that account lol",
                "author": "YomiNo963"
            },
            {
                "raw_content": "Steam Machine also showed up: [Steam Machine](https://store.steampowered.com/sale/steammachine)",
                "author": "Fluffy_Moose_73"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Valve's Steam page shows 2 \"Upcoming Releases\" - only 1 of them - Deadlock - is currently publicly visible",
        "score": 1240,
        "text_content": "[https://store.steampowered.com/publisher/valve/](https://store.steampowered.com/publisher/valve/) 2 \"Upcoming Releases\" in the Games section, but only Deadlock shows up...",
        "comments": [
            {
                "raw_content": "THIS MEANS SOMETHING TO ME MAN",
                "author": "NotSoSmart_Sideswipe"
            },
            {
                "raw_content": "Valve can do the funniest thing again",
                "author": "justmadeforthat"
            },
            {
                "raw_content": "Portal 3",
                "author": "Leeiteee"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Stickers that say \"SOON™\", \"H-\" and \"CENS(ORED)\" on the Steam Machine in the Steam hardware announcement video.",
        "score": 611,
        "text_content": "[https://imgur.com/a/qjyVHmu](https://imgur.com/a/qjyVHmu) Timestamp: [https://youtu.be/OmKrKTwtukE?t=143](https://youtu.be/OmKrKTwtukE?t=143)",
        "comments": [
            {
                "raw_content": "Homefront: The Revolution 2 is real and it's on Steam Frame!",
                "author": "MuptonBossman"
            },
            {
                "raw_content": "I want to believe Im ready to be hurt again",
                "author": "EndlessFantasyX"
            },
            {
                "raw_content": "Real talk, HLX announced with pricing for Steam Machine and as a bundle would be such a slamdunk, imagine a HLX faceplate for it too",
                "author": "NotSoSmart_Sideswipe"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Horizon MMORPG offically announced and called Horizon Steel Frontiers coming to iOS, Android, and PC (via Purple the NCSoft emulator)",
        "score": 86,
        "text_content": "Offical website: [https://hsf.plaync.com/ko-kr/conts/teaser](https://hsf.plaync.com/ko-kr/conts/teaser) Purple is also a PC launcher in general. Horizon Steel Frontiers will only be avaliable through the Purple NCSoft launcher for PC as the game was developed primarily for mobile players. Previous leaks: [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1ovn8ky/images\\_and\\_information\\_of\\_the\\_horizon\\_mmorpg/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1ovn8ky/images_and_information_of_the_horizon_mmorpg/) [https://www.reddit.com/r/GamingLeaksAndRumours/comments/18uwkox/horizon\\_mmo\\_by\\_ncsoft\\_is\\_now\\_pretty\\_much/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/18uwkox/horizon_mmo_by_ncsoft_is_now_pretty_much/)",
        "comments": [
            {
                "raw_content": "Of course they announce a Horizon game today",
                "author": "MisunderstoodBadger1"
            },
            {
                "raw_content": "Clearly this means a new Zelda is set to be announced so it can overshadow it",
                "author": "Paperdiego"
            },
            {
                "raw_content": "Not even a native PC version. Damn.",
                "author": "SadSeaworthiness6113"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Jez Corden (potentially) Leaks New Vegas Remake",
        "score": 433,
        "text_content": "https://xcancel.com/jezcorden/status/1988616821067366658?s=46&t=M7O2XX3nVWDa21DqD0Q9SA This is absolutely not definitive and could be an educated guess by Jez since it would only make sense for a NV remake to come out after 3, but he’s the first person with an actual reputation that I’ve seen mention it.",
        "comments": [
            {
                "raw_content": "#Jez Corden is a Tier 2 - Generally Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Oh man a bundle of 3 and new vegas would have me doing some pretty wild things for it.",
                "author": "Crazy-Path-7929"
            },
            {
                "raw_content": "You cant just drop this on us like that after everything happening today",
                "author": "NotSoSmart_Sideswipe"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Images and information of the Horizon MMORPG",
        "score": 167,
        "text_content": "https://www.theverge.com/news/819657/horizon-steel-frontiers-mmo-sony-ncsoft-playstation",
        "comments": [
            {
                "raw_content": "....mobile",
                "author": "SpookyBread1"
            },
            {
                "raw_content": "Thanks for sharing this! Here's a bit from the article: The new game is called Horizon Steel Frontiers, and Sony and the Korean video game company NCSoft are working on it together. Based on a more than 10-minute video we’ve seen featuring a mix of cinematic and pre-alpha gameplay footage as well as developer interviews, the game will focus strongly on fighting the Horizon series’ giant mechanical beasts and being able to do so with other people. Sony and a PR company representing NCSoft didn’t immediately reply to a request for comment. The Verge initially spotted promotional art for Steel Frontiers on a website used to share game assets that media and influencers are approved to use. The art seems to have been posted early, perhaps ahead of an announcement at the G-Star 2025 event in Korea later tonight. According to the website, Steel Frontiers will be available on PC, iOS, and Android. We just now uploaded that 10 minutes of footage: [https://www.theverge.com/news/819657/horizon-steel-frontiers-mmo-sony-ncsoft-playstation](https://www.theverge.com/news/819657/horizon-steel-frontiers-mmo-sony-ncsoft-playstation)",
                "author": "theverge"
            },
            {
                "raw_content": "Nice, a legitimate leak. It's so jarring to see Horizon visuals with typical Korean-MMO character designs. Also weird that it's coming to PC but skipping console. Between this and the R&C title they announced today, it's clear that Sony is very serious about expanding to mobile, but it wouldn't hurt to have home console versions of these games as well, no?",
                "author": "Ok_Hospital4928"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Valve distributor for Asia, Komodo, got a new Steam Frame page",
        "score": 547,
        "text_content": "It's empty for now, but it doesn't give an error. The page has yesterday date. The site went down for maintenance for around 1 hour before this was found https://komodostation.com/steam-frame EDITS: Also Steam Machine: https://komodostation.com/steam-machine/ Steam Controller: https://komodostation.com/steam-controller/ --- Those images were taken from the website (the official links do not work anymore): Steam Frame: https://imgur.com/a/UbYuR5I Steam Controller 2: https://imgur.com/a/5a5dUbE Steam Machine https://i.imgur.com/mGY1XZq.png --- OFFICIAL PAGES ON STEAM: Steam Frame: https://store.steampowered.com/sale/steamframe Steam Controller: https://store.steampowered.com/sale/steamcontroller Steam Machine: https://store.steampowered.com/sale/steammachine Valve Video: https://www.youtube.com/watch?v=OmKrKTwtukE",
        "comments": [
            {
                "raw_content": "Steam Frame, man Wait Frame, man Frame man Frameman Fraeman Freeman CLEVERLY DONE MR. FREEMAN",
                "author": "MyMouthisCancerous"
            },
            {
                "raw_content": "https://komodostation.com/steam-frame redirects to https://komodostation.com/?attachment_id=413748 Steam Frame Logo potentially: https://komodostation.com/wp-content/uploads/2025/11/Steam-Frame.svg Steam Controller 2: https://imgur.com/a/5a5dUbE Steam Frame: https://imgur.com/a/UbYuR5I",
                "author": "GB_2_"
            },
            {
                "raw_content": "HAPPENING STATUS: IT'S",
                "author": "oh_mygawdd"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "AMD Ryzen 5 7500X3D launches at $269, 6-core CPU with 3D V-Cache is 13% faster than Core Ultra 245KF in gaming",
        "score": 458,
        "text_content": "",
        "comments": [
            {
                "raw_content": "At $269. Better off with 7600x3d or 7800x3d",
                "author": "budice0"
            },
            {
                "raw_content": "This is great, more choices, and more stuff to go on sale cheap when it doesn't sell because upgrading is a better choice!",
                "author": "Blue-Thunder"
            },
            {
                "raw_content": "For international people, it's a Microcenter (US exclusive). You'd have to fly there to buy one, have an american friend, or buy 7800X3D in your market",
                "author": "Big-Conflict-4218"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "GPD Win 5 Ryzen AI MAX+ 395 gaming handheld confirmed with 128GB option and white chassis",
        "score": 50,
        "text_content": "",
        "comments": [
            {
                "raw_content": "how will this even use 128gb ram anyways",
                "author": "Scy_Nation"
            },
            {
                "raw_content": "Strange configuration targeted at mobile gaming... Yet we still can't get a 16\" laptop with a Ryzen AI Max+ 395 with 128gb RAM, lol.",
                "author": "Soggy-Camera1270"
            },
            {
                "raw_content": "No slide out keyboard tho?",
                "author": "RAMChYLD"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AYANEO shows NEXT II handheld with Ryzen AI MAX 300 Strix Halo for the first time beyond renders",
        "score": 22,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "Trump's 50-year mortgage would save you about $119 a month while doubling the interest you pay over the long run, UBS estimates | Fortune",
        "score": 371,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "It's not a seller's housing market anymore. Some sellers don't agree.",
        "score": 198,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I think it is still a frozen market. Sellers can’t sell for what they want and buyers can’t afford to buy at the price they want. Just my opinion",
                "author": "Brewerfan1979"
            },
            {
                "raw_content": "But I put luxury plank flooring in so I deserve 200k more than I paid",
                "author": "gaelorian"
            },
            {
                "raw_content": "[house near me](https://www.zillow.com/homedetails/447-S-Woodfield-Ln-Bloomington-IN-47403/102881553_zpid/?utm_campaign=iosappmessage&utm_medium=referral&utm_source=txtshare) INCREASED the price by $3k after failing to sell for 4 months at the previous price 😂 They’ve been trying to sell it for over a year in total now. Greedy morons.",
                "author": "ernie-jo"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "50-Year Mortgage Calculator: Will You Die Before You Own Your Home Outright?",
        "score": 22,
        "text_content": "The answer is **yes.** If 50‑year mortgages were introduced, many buyers (especially those starting around age 40, which is now the median for first‑time buyers) **could realistically die before fully owning their home outright**, since the loan would stretch into their 80s or 90s",
        "comments": [
            {
                "raw_content": "the incentive is to cut the mortgage payment per month. a lot of home buyers don't think about owning outright or paying more in interest over time.",
                "author": "bzl33"
            },
            {
                "raw_content": "This 50 yr mortgage is such an unattractive product, I don't expect it to move the needle much if at all.",
                "author": "PoiseJones"
            },
            {
                "raw_content": "So…? You think people with 3% mortgages long to own their homes outright?",
                "author": "dandykaufman2"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage demand from homebuyers hits highest level since September, despite rising interest rates",
        "score": 74,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Since September lmao? A month and a half ago? Really?",
                "author": "T-REX-BVTT-S3X"
            },
            {
                "raw_content": "The reason why the demand increased despite slightly higher interest rates is that homebuyers believe (based on advice from their lender) that it will take 30-60 days for them to find a home they like and go under contract. Within that time period, the rates will be back down and they will be in a position to lock their rate.",
                "author": "ThemeBig6731"
            },
            {
                "raw_content": "Hey, I refinanced from 6.65 to 4.85 Saving $130,000 in interest",
                "author": "highrollerbob"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Is home ownership really worth it anymore?",
        "score": 17,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">If I had $10,000 saved nOoOoOo wE'rE nOt iN a rEaL eStaTe BuBbLe 🥴😵 Meanwhile, dudes without 10k saved are wondering if they should buy a house.........",
                "author": "IRideParkCity"
            },
            {
                "raw_content": "No, not now. Invest elsewhere.",
                "author": "Dry-Interaction-1246"
            },
            {
                "raw_content": "This is so situation dependent. - are you staying in an area long term? - how much cash you have for a down payment? - do you have kids? - how stable is your job? - what does the RE market look like in your area?",
                "author": "mattjouff"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Quantitative easing and housing inflation post-COVID",
        "score": 47,
        "text_content": "https://www.brookings.edu/articles/quantitative-easing-and-housing-inflation-post-covid/ The Fed’s quantitative easing (QE) resulted in the Fed buying nearly 90% of the increase in eligible mortgages from 2020 to 2022. A massive increase in house prices coincided with the Fed’s QE, translating into higher housing inflation. Housing was a key component of the post-COVID inflationary episode and kept overall inflation above the Fed’s 2% target. The assumption that buying mortgages as part of QE has no relationship with house prices should be reconsidered for future monetary policy responses to recessions.",
        "comments": [
            {
                "raw_content": "Well, it seems that after the October meeting, the Fed in an addendum wrote that while they would start QE, their allocation will be shifted toward short term bonds and not MBS. The result should be the dropping of MBS bond prices resulting in higher yields. My guess is that the 30 year mortgage rate will stay in the six’s for a bit longer.",
                "author": "SteveBadeau"
            },
            {
                "raw_content": "Who in their right mind would ever posit that the Fed’s involvement with QE has no relationship to housing prices? Everything anyone needs and every asset out there is completely inflated due to the 9 trillion fucking dollars they printed. The Fed serves asset holders not the American citizenry as a whole.",
                "author": "i860"
            },
            {
                "raw_content": "The govt is not going to let housing prices fall, this is the new normal",
                "author": "Vivid_Mongoose_8964"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Inside the $4.8 Trillion Commercial Real Estate Debt Universe: Bank Loan Balances Rise",
        "score": 27,
        "text_content": "[https://www.trepp.com/instantly-access-the-commercial-real-estate-debt-universe-report-oct-2025](https://www.trepp.com/instantly-access-the-commercial-real-estate-debt-universe-report-oct-2025)",
        "comments": [
            {
                "raw_content": "Heads up, no information in the linked article, you have to register to be able to download the report, not sure how useful this is.",
                "author": "damnedbrit"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "GPT-5.1: A smarter, more conversational ChatGPT",
        "score": 563,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Seems like mostly targeted at people who don't like the GPT-5 vibe and prefer 4.",
                "author": "FuryOnSc2"
            },
            {
                "raw_content": "5.1 you say? Now in surround sound!",
                "author": "sully213"
            },
            {
                "raw_content": "Weird that they didnt include a single benchmark",
                "author": "dwiedenau2"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Ernie 5.0 released, achieving frontier performance across multimodal domains",
        "score": 49,
        "text_content": "https://ernie.baidu.com",
        "comments": [
            {
                "raw_content": "why oh why do these companies insist on making their benchmarks charts so hard to read...",
                "author": "manubfr"
            },
            {
                "raw_content": "We are nearing the era where charts don’t matter as much as progress on actual problems of everyday people. Like, I get they have to compare themselves to the competition somehow, but we’ve seen examples (Llama 4) where models score highly but don’t do well in practice.",
                "author": "k111rcists"
            },
            {
                "raw_content": "Where is this chart from and where can I read it in a readable resolution?",
                "author": "pavelkomin"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Google DeepMind: \"Olympiad-level formal mathematical reasoning with reinforcement learning\"",
        "score": 86,
        "text_content": "[https://www.nature.com/articles/s41586-025-09833-y](https://www.nature.com/articles/s41586-025-09833-y) >Recent AI systems, often reliant on human data, typically lack the formal verification necessary to guarantee correctness. By contrast, formal languages such as Lean^(1) offer an interactive environment that grounds reasoning, and reinforcement learning (RL) provides a mechanism for learning in such environments. We present AlphaProof, an AlphaZero-inspired^(2) agent that learns to find formal proofs through RL by training on millions of auto-formalized problems. Lean is cool because the AI can actually verify if it got the answer correct. Unlike other forms of learning, it can actually do RLVR, reinforcement learning with verifiable rewards. [https://en.wikipedia.org/wiki/Lean\\_(proof\\_assistant)](https://en.wikipedia.org/wiki/Lean_(proof_assistant)) A lot of people are working heavily in this area. [math.inc](http://math.inc) and Terrence Tao is very interested in this. Great recent article in quanta suggesting a complimentary usage of SAT - [https://www.quantamagazine.org/to-have-machines-make-math-proofs-turn-them-into-a-puzzle-20251110/](https://www.quantamagazine.org/to-have-machines-make-math-proofs-turn-them-into-a-puzzle-20251110/) (weird photo spread of heule tho)",
        "comments": [
            {
                "raw_content": "This is the almost 1.5 year old AlphaProof paper (back when LLMs were struggling with middle school math) that's *finally* published, and eclipsed almost half a year ago by said LLMs? Yeah formal peer review just doesn't work for AI research, the field moves too quickly",
                "author": "AgreeableAd2144"
            },
            {
                "raw_content": "It's the actual published paper for their AlphaProof system from last year, really cool.",
                "author": "Gold_Cardiologist_46"
            },
            {
                "raw_content": "It would be great if this could be reproduced. I really hope people are working on it",
                "author": "MrMrsPotts"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "‘Godfather of AI’ becomes first person to hit one million citations",
        "score": 153,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I thought that the Godfather of AI was Geoffrey Hinton? Or is he rather the Godfather of machine learning? Really confusing :v",
                "author": "TarkanV"
            },
            {
                "raw_content": "better contact dwight hes in a world of hurt ;-)",
                "author": "Aggravating-Age-1858"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Anthropic invests $50 billion in American AI infrastructure",
        "score": 365,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/iiau833m2v0g1.jpeg?width=1320&format=pjpg&auto=webp&s=09ecac071d3b6efa491269d41b28f179a6297292 This post sits on top of the most chaotic mix of interpretations of the current situation ever.",
                "author": "algaefied_creek"
            },
            {
                "raw_content": "Where the hell is Anthropic getting $50 billion from???",
                "author": "Decent-Ground-395"
            },
            {
                "raw_content": "where tf do they keep pulling this money",
                "author": "thebigvsbattlesfan"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Most \"AI Bubble\" posts in a nutshell",
        "score": 263,
        "text_content": "",
        "comments": [
            {
                "raw_content": "When even the AI CEO's are saying there's a bubble... What the heck are you trying to say here? *Of course* there's a bubble. It's emerging tech, companies are going to win and some are going to lose. There will be a market correction.",
                "author": "cfehunter"
            },
            {
                "raw_content": "If you think a whole economic sector is the same as one single company, ok, but they are not",
                "author": "Selafin_Dulamond"
            },
            {
                "raw_content": "You do realize that the pictures in your example represents millions of people and companies right? Meanwhile all the \"wealth\" in AI is being passed around a very small amount of companies.",
                "author": "Valnar"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "UBTech shows off its self charging humanoid robots army aiming to fullfill a >100M factory order",
        "score": 807,
        "text_content": "https://x.com/CyberRobooo/status/1988568182198546853?s=20",
        "comments": [
            {
                "raw_content": "The Tweet says 100M USD, not 100M units. According to [this article](https://www.scmp.com/tech/tech-trends/article/3332372/chinas-humanoid-robots-get-factory-jobs-ubtechs-model-scores-us112-million-orders), they have 112M USD in orders. The article says that in August the company expected to deliver \"more than 500\" units by the end of the year.",
                "author": "pavelkomin"
            },
            {
                "raw_content": "https://i.redd.it/9r4z8slamt0g1.gif",
                "author": "Background-Quote3581"
            },
            {
                "raw_content": "feels like the start of a sci-fi thriller",
                "author": "enricowereld"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Waymo begins offering freeway robotaxi rides in San Francisco, LA and Phoenix",
        "score": 125,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lets go! I honestly love this tech getting better. This is one field where human error decreasing will change so much!",
                "author": "ArialBear"
            },
            {
                "raw_content": "Waymo and Tesla competing will only speed up mass market adoption.",
                "author": "ncolpi"
            },
            {
                "raw_content": "Hopefully Europe will start allowing Waymo to operate. I can't wait to see my first driverless car in person. Very the future is real vibes.",
                "author": "donotreassurevito"
            }
        ],
        "subreddit": "singularity"
    }
]