[
    {
        "post_name": "How will Trump deport all the illegal aliens?",
        "score": 646,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'd prefer Meelion by meelion",
                "author": "DonnieRamesJio"
            },
            {
                "raw_content": "For jokes related to this topic, lemme say that Shrek had the idea of building a wall before it was cool. As I remember the line \"I'm gonna build a ten foot wall around my land\" from the first Shrek movie. Shrek and Donald Trump have something in common. Build a wall.",
                "author": "TheJakeFroggy"
            },
            {
                "raw_content": "How do you say \"rookie numbers\" in Mexican?",
                "author": "Get_Off_Big_Tech"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Ukraine are reaching insufferable levels;",
        "score": 642,
        "text_content": "",
        "comments": [
            {
                "raw_content": "In a war, knocking out enemy power plants, bridges, communications should be one of the first things you do. It's a pussified idea of war that you can fight a war without inconveniencing noncombatants. Actually, the more war sucks for normal people, the less likely they are to keep fighting a losing war. Trump's ultimatum to Ukraine on day one should have been \"Settle and end the war, or we're cutting you off and letting Russia win.\"",
                "author": "fskfsk"
            },
            {
                "raw_content": "I stand with Russia",
                "author": "anti_masker"
            },
            {
                "raw_content": "Ukraine can fuck off. Money laundering criminal faggots.",
                "author": "ThePatriotGames2016"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A person has just been stabbed in the chest on the Charlotte NC Light Rail and is now in critical condition. This comes just 4 months after Iryna Zarutska was stabbed on the Charlotte Light Rail.",
        "score": 644,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# LOCK AND FUCKING LOAD # CIVIL WAR HAS FUCKING BEGUN # FUCK!",
                "author": "USMC1234O10"
            },
            {
                "raw_content": "Lemme guess... another Basketball-American got offended by a white person having the audacity to exist.",
                "author": "bigdickhangsright"
            },
            {
                "raw_content": "From r/charlotte: > Yeah the whole shit happened in front of me. Drunk mexican stabbed a young black dude in the heart. Mexican was yelling at anybody, actin fake tough since Scaleybark. Person behind me checked him then dreadhead checked him. Like stfu its kids on here, plus nobody tryna hear that. Few stops go by. By 9th St, he took a swig of his Beatbox then walked up to dreadhead, they stand off then he pulled out a hunting knife. Stabbed him. Dreahead rush to the opposite end of train. People gave help and alerted the driver to stop. We all wait 7 mins for police. He dropped his knife, asked us to hold it then picked it up, left his bike and grabbed the emergency latch to runaway. Victim was throwing up, bleeding heavy when he got stretchered. Cops caught stabber on the other side of the apts. He was asking people for rides. So completely ironic that it ended up being a hispanic dude, probably an ilegal, a week after DHS wrapped up major operations in Charlotte - the whole week of which r/Charlotte fucking absolutely went apeshit about how it was terrible to oppress so many spics. CMPD released stats about 10 years ago that they had arrested 400 illegal aliens for DUI in the prior year. That's over 1 per day of DUI on the roadways in Charlotte, and that was 10 fucking years ago. I'm sure it's worse now, the streets are flooded with cars with no plates, and basically every accident is caused by someone with no insurance, no driver's license, and no plates. This shit is out of control and Charlotte's Web was a drop in the fucking bucket.",
                "author": "brassmule"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "U.S. Coast Guard : Over 20,000 pounds of cocaine seized by the crew of USCGC Cutter Munro — the largest at-sea interdiction in 18+ years.",
        "score": 589,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ehh I prefer a missile from a predator drone instead.",
                "author": "invalid_data"
            },
            {
                "raw_content": "# Don't seized it! Blow it up!",
                "author": "CommieCrats"
            },
            {
                "raw_content": "Hunter Biden is crying.",
                "author": "Mikespenis123"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Joe Biden can even say the United States of America",
        "score": 424,
        "text_content": "",
        "comments": [
            {
                "raw_content": "United States of AmeRicotta.",
                "author": "Lol_Garrus"
            },
            {
                "raw_content": "He learned about roaches in college, no time for the america thing, Jack!",
                "author": "Patriots4TN"
            },
            {
                "raw_content": "You Nine Ed States of Amerigotit?",
                "author": "This_will_be_public"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump just ordered Secretary RFK Jr. to move toward ending the current American infant vaccine schedule. MAHA!",
        "score": 1194,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So what are we saying here? We’ve been lied to for 50 years? What’s the path forward to heal healthcare. I say this as someone who will probably soon be filing medical malpractice lawsuits. I don’t think people realize that a shit ton of boomers are about to die at the hands of dr Patel.",
                "author": "Viewer01"
            },
            {
                "raw_content": "End circumcision next",
                "author": "Spicy_cat"
            },
            {
                "raw_content": "Our schedule was rooted in Big Pharma profits : It was two opponents fighting: Million dollar experts at rigging tests for safety and efficiency vs Government DEI workers",
                "author": "IlhansBrother"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Here’s proof that Ilhan Omar lied and committed immigration fraud. Trump should enforce the law, revoke her citizenship, and deport her. Most voters will cheer, Democrats will be forced to defend immigration fraud (and Somalis), and the media will melt down. Win-win-win!",
        "score": 1174,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hell no no deportation she needs to go to prison for the rest of her life. Espionage, treason defrauding the federal government no she don't get no free pass back to fucking Somalia no I want her getting fucking raped by a broomstick by Bertha for the rest of her life.",
                "author": "JayKay1776"
            },
            {
                "raw_content": "This was first proven in like 2018 by an investigation lead by Minnesota State House Representative Nick Zerwas. There is no new information. Nobody seems to care.",
                "author": "footinmouth"
            },
            {
                "raw_content": "Deport all lightbulb heads 💡",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": ">get stabbed by a black guy >blurt out the n word after he stabs you >jury lets the black guy walk free because you said a bad word after getting stabbed Completely and absolutely insane.",
        "score": 1176,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> Portland",
                "author": "TrancePhreak"
            },
            {
                "raw_content": "A black gets less punishment for stabbing or raping than a white does for saying a word.",
                "author": "Scumbag-reddit"
            },
            {
                "raw_content": "Sticks and stones may break my bones , but words and I’ll fucking kill you",
                "author": "fthecoup"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump: The Indiana Senate must now pass this Map, AS IS. I am hearing these 9 Senators, some up for Re-Election in 2026, & some in 2028, need encouragement to make the right decision: Blake Doriot,Brett Clark,Brian Buchanan,Dan Dernulc,Ed Charbonneau, Greg Goode,Jim Buck,Rick Niemeyer,Ryan Mishler.",
        "score": 884,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Something this important needs to be on his X account too.",
                "author": "Chickensaurus"
            },
            {
                "raw_content": "Too many 30Pence accolytes still Indy-nial that Trump Won!",
                "author": "TidewaterYank"
            },
            {
                "raw_content": "https://truthsocial.com/@realDonaldTrump/posts/115669815800105560",
                "author": "Mr_Rightside"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "SHOCKING: Minnesota’s Somali Fraud May Reach $8 BILLION — EIGHT TIMES Larger Than Originally Reported",
        "score": 978,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Non-Somali Minnesotan’s should be in the streets as we speak pitching an absolute shit fit, and throwing those savages into the Great Lakes!",
                "author": "TennesseeScorpio"
            },
            {
                "raw_content": "Minnesota officials saw signs of massive fraud even before COVID hit https://www.cbsnews.com/news/minnesota-fraud-signs-before-covid/",
                "author": "mass55th"
            },
            {
                "raw_content": "I'm not shocked at all",
                "author": "Sea_Still"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The DEA’s chief financial director under Obama, Paul Campo, who resigned in 2016 ahead of Trump’s administration, had his Virginia home raided and has been charged for agreeing to launder $12 million for the CJNG, a Mexican cartel, while acting in his role at the DEA.",
        "score": 1330,
        "text_content": "",
        "comments": [
            {
                "raw_content": "All I want for Christmas is some accountability, any accountability: https://x.com/Rightanglenews/status/1997015447770693785?s=20",
                "author": "Hangemh1gh"
            },
            {
                "raw_content": "This is treason. The only punishment can be death for treason, as the law states. Otherwise we're rewarding criminals/Dems for selling out the nation so our enemies can engage in chemical warfare on US soil. There's no greater chemical attack on US citizens than this. We treat it what it is or else Dems will never get the message.",
                "author": "CleanUpPhillyTrump24"
            },
            {
                "raw_content": "Someone didn't get their cut. We all know the US government agencies work hand in hands with these \"cartels\" to ship drugs around the World. Drug trafficking accounts for around $650 billion dollars a year. A retarded spic would never have the brains to operate operations of this scale.",
                "author": "laredditarmy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "You know it’s true…",
        "score": 905,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ilhan Omar looks like your finger after using cheap toilet paper.",
                "author": "Hangemh1gh"
            },
            {
                "raw_content": "Neither of those whores belong in America, let alone the US Capitol. Disgrace.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Deport them all.",
                "author": "UncleSlayton"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "'No US Citizens': Meet the IT Firms Discriminating Against Americans",
        "score": 1154,
        "text_content": "",
        "comments": [
            {
                "raw_content": "White people need to become more litigious. Apply, get rejected, then sue the fuck out of them for discrimination!",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "Very important to report to the DOJ civil rights division: justice.gov Subject line: Civil Rights Violation, attn: Harmeet Dhillon.",
                "author": "CleanUpPhillyTrump24"
            },
            {
                "raw_content": "They look like stars of a really shitty porno",
                "author": "possibletower"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Indiana House passes new congressional map, heads to Senate for final decision",
        "score": 749,
        "text_content": "",
        "comments": [
            {
                "raw_content": "DESPITE THE PRESS COVFEFE",
                "author": "Thatunknownguy"
            },
            {
                "raw_content": "Make Indiana less RINO-cucked again",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Is that guy who hated the R-word so much in the Senate or House? Good on him if he came around",
                "author": "Bongos"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Wait...what????? Pelosi and Greene retirements thrust $38M-a-year pension perk for Congress into spotlight",
        "score": 927,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So only 5 years and she earned a nearly 10k a year pension? wtf is this bullshit. 100k a year pension payment for Nancy is also obscene even considering her 5000 years in Congress. Congress benefits and pay should be no better than a dmv employee, in fact it should be much less considering how much of congress life is free and paid for beyond their salary.",
                "author": "lifeisahologram"
            },
            {
                "raw_content": "honestly 8k/year isn’t even enough to make it worth waiting to resign until vested",
                "author": "Quixotic"
            },
            {
                "raw_content": "Man, you guys would have a stroke if you knew what the state pension systems look like. $10k per year pension is nothing. I know people with six figure pensions who are double dipping in a new position with a six figure salary.",
                "author": "Region"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "HUGE: Supreme Court Agrees to Decide Constitutionality of Trump’s Birthright Citizenship Executive Order",
        "score": 1156,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm glad they're not dismissing it out of hand, but I don't think it will go the way people here want it to.",
                "author": "SisterCovfefeToo"
            },
            {
                "raw_content": "At minimum, birth tourism needs to stop.",
                "author": "1776Widowmaker"
            },
            {
                "raw_content": "So who is going to screw us? Roberts? Barrett? Kavanaugh? All 3?",
                "author": "PapaPepe"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Portland jury clears black man of assault because white man he stabbed had said the n-word",
        "score": 1117,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Aleksandr Solzhenitsyn: \"Your punishment for having a knife when they searched you was much different from the thief's. For him to have a knife was mere misbehavior, tradition, he didn't know any better. But for you to have one was terrorism\".",
                "author": "loooooof"
            },
            {
                "raw_content": "We live in a black supremacist country black privilege Black people are above the law and white people are second class citizens",
                "author": "Gibs2"
            },
            {
                "raw_content": "If claiming you heard the N word gets you out of trouble you’re going to lie and say you heard the N word. This is one of those times.",
                "author": "vongregormench"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "YOU’RE GOING HO HO HOME.",
        "score": 1256,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Whoever runs this account deserves a Congressional Medal of Honor.",
                "author": "LostElf"
            },
            {
                "raw_content": "'Merry Christmas ya illegal filthy animals.' GTFO",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "😀😀😀😀",
                "author": "TEXinLA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump WINS First Ever FIFA Peace Prize. “Truly one of the great honors of my life”",
        "score": 971,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Peace is the Prize. God Bless And Protect Our GEOTUS...",
                "author": "TEXinLA"
            },
            {
                "raw_content": "r/ussoccer had a collective TDS tard spasm today. Most of those people hope the whole tournament is a failure just to hurt Trump.",
                "author": "Madnote1984"
            },
            {
                "raw_content": "FIFA is extremely gay. This is like Enron awarding a peace prize.",
                "author": "Simple_Doot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Rep. Adelita Grijalva (D-AZ) has been in office less than a month and is already interfering with ICE operations and causing problems",
        "score": 968,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Deport her now ❗️",
                "author": "Live_free_or_die_55"
            },
            {
                "raw_content": "ICE, we found another one.",
                "author": "TrumpWonByALandslide"
            },
            {
                "raw_content": "It's always fat Mexican women standing in the way of Arizonans.",
                "author": "TheMAGAnificent"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Why won’t Steam Machine support HDMI 2.1? Digging in on the display standard drama.",
        "score": 614,
        "text_content": "Although the upcoming Steam Machine hardware technically supports HDMI 2.1, Valve is currently limited to HDMI 2.0 output due to bureaucratic restrictions preventing open-source Linux drivers from implementing the newer standard. The HDMI Forum has blocked open-source access to HDMI 2.1 specifications, forcing Valve to rely on workarounds like chroma sub-sampling to achieve 4K at 120Hz within the lower bandwidth limits of HDMI 2.0. While Valve is \"trying to unblock\" the situation, the current software constraints mean users miss out on features like generalized HDMI-VRR (though AMD FreeSync is supported) and uncompressed color data.",
        "comments": [
            {
                "raw_content": "TL;DR: the HDMI Forum sucks. Use Displayport instead if connecting to a monitor. Use the one and only DP -> HDMI adapter by Cable Matters which (sometimes) works if you want 4K 120Hz HDR VRR with full 10bit on your TV like me. And once again, the HDMI Forum sucks. Pricks.",
                "author": "Corentinrobin29"
            },
            {
                "raw_content": "As a Linux user I have been following this drama since HDMI 2.1's release. Hopefully valve with their larger influence can convince the HDMI forum to change their minds on allowing an opensource driver implementation. I am worried though that the HDMI forum will grant some sort of special license to valve and the steam machine will become the only linux device to support 2.1",
                "author": "waitmarks"
            },
            {
                "raw_content": "It's a shame TVs didn't continue with Display Port like they used to with VGA.",
                "author": "Bannedwith1milKarma"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "WTF Just Happened? | The Corrupt Memory Industry & Micron (Gamers Nexus)",
        "score": 869,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Consumers competing against corporations for products and resources. Great idea.",
                "author": "sench314"
            },
            {
                "raw_content": "Just an earthquake away in south Korea region to really spell a disaster with future prices.",
                "author": "sumogringo"
            },
            {
                "raw_content": "People really don’t want to think critically here about the impact decisions like this will have on the broad tech market for consumers. They would rather dog on a YouTube for discussing it.",
                "author": "Material2975"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Apple's Return to Intel Rumored to Extend to iPhone",
        "score": 77,
        "text_content": "",
        "comments": [
            {
                "raw_content": "'return to intel' only the fabs, I'm assuming?",
                "author": "torvi97"
            },
            {
                "raw_content": "The article says only the non-pro A series chips would be considered for this, which I think would make the most sense. They can raise the prices on the Pro models in a way they can’t with the base and E models to compensate for TSMC’s rising costs. Whether or not Intel is able to meet Apple’s yearly release schedule at the volume Apple would require remains to be seen, and my opinion counts for nothing but I am skeptical",
                "author": "TheYetiCaptain1993"
            },
            {
                "raw_content": "Man, talk about clickbait headlines.",
                "author": "HorrorBuff2769"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "What do you guys think of Lian Li's new \"rotatable\" psu? Will it make builds easier to organize?",
        "score": 6,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Something like this would come in extremely clutch in SFF builds because of the huge variety of configurations those builds can have. However, this PSU is ATX sized, so I'm scratching my head at how useful this will actually be for most people.",
                "author": "quirkelchomp"
            },
            {
                "raw_content": "Seems like a solution looking for a problem. I suppose it might have its uses, but I've never heard of anyone ask for something like this before.",
                "author": "Boomy_Beatle"
            },
            {
                "raw_content": "A SFX version of this could be really useful.",
                "author": "dabocx"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Reuters: \"SoftBank's Arm plans to set up chip training facility in South Korea\"",
        "score": 9,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Here's the [archive](https://archive.ph/nPkPq) of the Reuters article.",
                "author": "Dakhil"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Exclusive] Memory Crunch Hits PCs: Dell Hikes Prices 15-20% Mid-December, Lenovo from January 2026",
        "score": 153,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ooft. I was just saying elsewhere that this has to bite Dell and HP soon... I guess one saving grace for a lot of big (corporate) buyers is that they'll have recently replaced most of their Windows 10 machines already this year. I guess if you feel you need a new laptop or whatever the time to buy is probably now because it's going to get real shitty in 2026.",
                "author": "jenny_905"
            },
            {
                "raw_content": "15-20% doesn't sound like the full extent. I feel like it is going to get worse.",
                "author": "AreYouOKAni"
            },
            {
                "raw_content": "But don't worry guys. Valve bought enough DDR5 sticks for the Steam Machine to be price competitive until 2027",
                "author": "imaginary_num6er"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Don’t believe the negative hype. Metroid Prime 4 is very fun and the best looking game on the system.",
        "score": 397,
        "text_content": "Title says it all. I think the switch 2 is the most hyper scrutinized system of all time. At the end of the day, this game is just really really awesome. You won’t be sad playing it.",
        "comments": [
            {
                "raw_content": "I've seen more love than hate and tbh, the \"hate\" I've seen is just people expressing points of contention. It's okay to not love everything and to criticize the things you love. I don't know why the gaming community can't wrap their heads around that.",
                "author": "xProjectSiK"
            },
            {
                "raw_content": "I’m overall enjoying it, but the criticisms are pretty valid. Especially regarding the NPC’s handholding you too much, and the desert area feeling tacked on. Also, the game is *incredibly* linear so far. Once you’re in a zone, you’re never going to get lost. The areas aren’t an interconnected web of rooms and corridors like Prime 1 and 2, they’re more like straight paths with a couple of deviations along the way. I think the good outweighs the bad, but people expecting a certain experience from a Metroid game might be disappointed.",
                "author": "BondFan211"
            },
            {
                "raw_content": "Its nice but its more like Prime 3 than Prime 1 and 2.",
                "author": "FarConsideration8423"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Metroid Prime 4 is one of the greatest games I've played in 5 years",
        "score": 150,
        "text_content": "This game is legendary loving every second of it!!",
        "comments": [
            {
                "raw_content": "I am really loving it I missed games like this more than I realized",
                "author": "aSlider64"
            },
            {
                "raw_content": "my favorite game hi-fi rush, i think it isnt a perfect game, infact i think it has a good amount of issues, its still my favorite game, a game can have issues and still be amazing.",
                "author": "Peppermint640"
            },
            {
                "raw_content": "I’m definitely enjoying this new Metroid , but dude if it’s the greatest game you’ve played in the last 5 years then you should play more games lol",
                "author": "FCA_Eughhh"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "For those who bought Metroid Prime 4, how are you liking it so far?",
        "score": 158,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’m in a bit of a unique situation as I haven’t played a Metroid game since game boy so I don’t have all the preconceptions. Went straight to Prime 4 and this is sick. Immediately went to get Prime Remastered for when I’m done.",
                "author": "darksideflow"
            },
            {
                "raw_content": "I liked dread better but it’s aight",
                "author": "Bootychomper23"
            },
            {
                "raw_content": "I've only played the intro so far and I like it. It kind of feels like what Samus would be doing between all of her more isolated missions from the other games.",
                "author": "SwashNBuckle"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "A mouse grip makes all the difference.",
        "score": 122,
        "text_content": "The joy-con is too thin on its own to use comfortably as a mouse for extended periods. Getting a mouse grip let's you palm the controller nicely and holds the joy-con in proper orientation. There's several examples available for cheap. I got this Mumba pair for cheap in Amazon. I added a strip of masking tape to add a little more friction in retaining the joy-con. I'm playing Prime 4 for hours pretty comfortably with this.",
        "comments": [
            {
                "raw_content": "Link?",
                "author": "frenzyguy"
            },
            {
                "raw_content": "Is... Is that a Black Mumba?",
                "author": "TheSheevMonster"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Samus never looked better. Can't wait to see what Retro does on strictly Switch 2 hardware vs having to build a game from the foundation of Switch 1 limitations.",
        "score": 345,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Retro was always on the cutting edge of Nintendo hardware's capabilities. All the Metroid Prime games were the best looking on their respective consoles.",
                "author": "GarionOrb"
            },
            {
                "raw_content": "Not only this, but a game they didn’t have to take over and reboot multiple times.",
                "author": "Banks201"
            },
            {
                "raw_content": "Don't think we'll be seeing another Prime game this decade. Maybe a 5th title late 2030.",
                "author": "LawfulnessPractical"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Eating Good on Switch 2",
        "score": 284,
        "text_content": "",
        "comments": [
            {
                "raw_content": "For me it’s FORTUNE’s WEAVE, FORTUNE’S WEAVE MADE ME CRY IN TEARS OF JOY",
                "author": "IkeRadiantHero"
            },
            {
                "raw_content": "Remember, if you can't afford it, don't go into debt to get it. It's not going away and there will always be sales.",
                "author": "Revenger1984"
            },
            {
                "raw_content": "I know some people are criticising the lack of a ‘big hitter’ game like Switch 1’s BOTW and Odyssey, but I kinda like how Nintendo knows how Switch 2 will sell so they are releasing these more niche exclusives to shine a spotlight on them. Would people care as much about DK Bananza and Kirby Air Riders in the fourth year of Switch 2? Probably not.",
                "author": "NoNefariousness2144"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The boss design in prime 4 is the best in the series so far imo",
        "score": 26,
        "text_content": "The different aiming requirements are interesting. But I definitely think boss design here is a massive step up from prime 2 & 3",
        "comments": [
            {
                "raw_content": "I got to the first major boss. The plant thing, and thought it was quite cliché (Nintendo loves bosses like this), but actually fighting it was really fun and using the psychic ability to defeat it was pretty neat.",
                "author": "MajorasTingle"
            },
            {
                "raw_content": "Hitting weak points was a thing in prime 3 too right? This boss was quit fun for me as well!",
                "author": "WorkingCautious1270"
            },
            {
                "raw_content": "https://preview.redd.it/vcjber0h4j5g1.png?width=2318&format=png&auto=webp&s=a4ea0582ecbf3ed34b9480ff5e66cf5e142760de Quadraxis: Am I a joke to you?",
                "author": "StockHumor4768"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Switch 2 games with clear cases",
        "score": 88,
        "text_content": "Swapped some Switch and Switch 2 cases to see how they looked. I think I prefer these, the huge banner *and* the colored case was too much red. The Switch 1 games are from an alternate reality where they brought back Nintendo Selects lol.",
        "comments": [
            {
                "raw_content": "The whole point of the case and art design is to make it as clear as possible that these are meant for a different system. That being said, I actually really dig the red cases tbh",
                "author": "memeaste"
            },
            {
                "raw_content": "I like the red to be honest",
                "author": "SirDanOfCamelot"
            },
            {
                "raw_content": "Red cases fan here, they look SO nice",
                "author": "Wasilisco"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Paramount Considering Hostile Takeover Of Warner Bros.",
        "score": 684,
        "text_content": "https://www.cnbc.com/2025/12/05/paramount-david-ellison-wbd-bidding-war-hostile-bid.html Paramount is now considering taking an offer straight to shareholders to acquire the asset, believing its deal has a better chance of gaining U.S. regulatory approval, sources told CNBC.",
        "comments": [
            {
                "raw_content": "It's crazy that this is a thing that can even happen",
                "author": "Cyrisaurus"
            },
            {
                "raw_content": ">believing its deal has a better chance of gaining U.S. regulatory approval Gee, I wonder why...",
                "author": "DJ_AW03"
            },
            {
                "raw_content": "How tf are you making me root for netflix?",
                "author": "renhaoasuka"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Mike Straw: Dead Space is internally “on ice”, leadership on EA hoping to “sell the IP”.",
        "score": 984,
        "text_content": "He also states “EA has 0 plans to bring back Dead Space in the near future” EDIT: It’s actually employees wanting the IP to be sold not EA, oh well I knew EA was incapable of doing just 1 thing right. https://www.youtube.com/watch?v=tM8RcRXnHX8",
        "comments": [
            {
                "raw_content": "We live in a world where Silent Hill is in a healthier and safer state than Dead Space. That's insane!",
                "author": "SolidPyramid"
            },
            {
                "raw_content": "Man fuck ea, The Dead Space remake is phenomenal. 2 is near flawless and 3 is a lot of fun with a friend, I was really hoping there would be remakes for them or a sequel.",
                "author": "GrapefruitSea7656"
            },
            {
                "raw_content": "Please sell it to someone who actually cares about making good games",
                "author": "Cool-Spite-9428"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Eidos Montreal Worked on Kojima’s ‘OD’ Before Being Asked to Move to Japan -- Insider Gaming",
        "score": 230,
        "text_content": "\"According to sources who added further context to our past report on the current layoff situation at Eidos Montreal, OD, which was previously known as Overdose, had been in development there for around a year in 2023. The game was internally known as P21, but development of the project at Eidos Montreal ceased after a request from Kojima Productions to have the developers move to Japan and cut ties with Eidos Montreal, said the people.\" Source: [Eidos Montreal Worked on Kojima's 'OD' Before Being Asked to Move to Japan - Insider Gaming](https://insider-gaming.com/eidos-montreal-move-to-japan-kojima/)",
        "comments": [
            {
                "raw_content": "#Insider-Gaming is a Tier 2 - Generally Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Xbox using Eidos to plug in all their worker needs. Grounded, fable OD",
                "author": "bboy267"
            },
            {
                "raw_content": "**\"*****Move to Japan*****\" - Hideo Kojima, 2023** ![gif](giphy|3hBTH8bV4n5RKZXQe6|downsized)",
                "author": "Respawn-Delay"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Tom Henderson: Eidos Montreal working on an ambitious open-world action-adventure third person game codenamed “P11” made by Tomb Raider team, in-dev since 2019 scheduled for next year release.",
        "score": 312,
        "text_content": "He also states Eidos Montreal is currently on Project 22 when the game mentioned is Project 11, which shows how many projects they’ve had to cancel/hold. This game is also related to the massive layoffs the studio endured. https://www.youtube.com/watch?v=tM8RcRXnHX8",
        "comments": [
            {
                "raw_content": "#Tom Henderson is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "I just wanted the 3rd adam jensen deus ex game man",
                "author": "Upbeat-Rope-9725"
            },
            {
                "raw_content": "Persona 11 confirmed.",
                "author": "Ornery-Tonight1694"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Moore’s Law Is Dead: Sony pushing low-power mode hard in preparation for PS6 handheld support, 60fps target with lower resolutions.",
        "score": 613,
        "text_content": "Moore’s Law Is Dead shared a new leak detailing how Sony is preparing for the launch of the PS6 handheld, includes new info from devs describing Sony emails. \"This week we \\[Game Dev\\] received emails from Sony pushing Low-Power mode hard… almost like they *need* us to support it directly eventually. They provided tutorials and instructions that outlined: 1) We shouldn’t just lower framerates to fit LP Mode’s requirements, no, instead we should try to maintain 60 FPS by *lowering resolutions*. 2) Razor CPU (This is a CPU Utility for PS5 Development) walkthroughs that aimed to help us find CPU bottlenecks so we can reduce CPU usage, and even look for ways to reduce how many threads are used by our game. It is becoming glaringly obvious that Low-Power mode is a Trojan Horse for getting PS6 Handheld support ready *before* its launch, and they honestly seemed a bit annoyed at how few devs directly support it so far.” Source: [https://youtu.be/g38VR-GJp7o?t=103](https://youtu.be/g38VR-GJp7o?t=103)",
        "comments": [
            {
                "raw_content": "\"Moore's Law is Dead\" looks like a name for a unreleased game.",
                "author": "Educational-Arm-7384"
            },
            {
                "raw_content": "To be fair the most graphically impressive games of 2025 such as AC Shadows, Death Stranding 2 and KCD2 do look better than games from 2015. However it's when you compare the graphics of 2015 games to 2005 games that you realize how small of an improvement 2015-2025 has been in comparison.",
                "author": "Adipay"
            },
            {
                "raw_content": "I recently purchased my first house, and it’s kinda become a game to me with how low I can push my electricity usage without living like a caveman. Played all the way through Death Stranding 2 on LPM and was thoroughly impressed by the results. I know that the DF reporting stated it was more-or-less a locked 30fps all the way through, but I swear that it was the smoothest 30fps I’ve ever experienced - with only occasional hitching when rotating the camera. Perhaps there was some further system-based magic going on with frame generation, because I very seldomly saw on screen text and HUD elements do that odd flicker thing that I’ve seen with DeckyFG on my Steam Deck - I dunno. Either way - good. Devs definitely need a boot up the arse in terms of optimisation!",
                "author": "CambSound"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Netflix is acquiring Warner Bros for $82 billion",
        "score": 1052,
        "text_content": "Confirmed: >Netflix, run by chairman Reed Hastings and co-CEOs Ted Sarandos and Greg Peters, has agreed to buy Warner Bros. in a megadeal valued at $82.7 billion. [https://www.hollywoodreporter.com/business/business-news/netflix-warner-bros-deal-hollywood-1236443081/](https://www.hollywoodreporter.com/business/business-news/netflix-warner-bros-deal-hollywood-1236443081/) Previous rumor: [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1pelp3i/according\\_to\\_sources\\_netflix\\_just\\_won\\_the\\_warner/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1pelp3i/according_to_sources_netflix_just_won_the_warner/)",
        "comments": [
            {
                "raw_content": "For those still wondering: Netflix confirmed on their media call minutes ago that it INCLUDES the gaming studios",
                "author": "MikeStrawMedia"
            },
            {
                "raw_content": "Does this include Warner Bros. Games?",
                "author": "adventmix"
            },
            {
                "raw_content": ">$82,7Billion I can see why Sony decided to sit this one out. That is $10Billion more than what Disney paid for 21st Century Fox.",
                "author": "Zhukov-74"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "DanielRPK: Max Parker (Boots) is in talks to play Baldur, and Ólafur Darri Ólafsson (Severance) is in talks to play Thor in Amazon Prime's God of War tv series",
        "score": 214,
        "text_content": "[https://xcancel.com/DanielRPK/status/1997033606515192259?s=20](https://xcancel.com/DanielRPK/status/1997033606515192259?s=20)",
        "comments": [
            {
                "raw_content": "Honestly brilliant casting if it materialises, the looks alone",
                "author": "ChiefLeef22"
            },
            {
                "raw_content": "Olafur is literally perfect casting, can not get better than that",
                "author": "dabmin"
            },
            {
                "raw_content": "Ólaffsson is a BEAST in Severance. Great choice if true.",
                "author": "Taymatosama"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Gigabyte launches X870E AERO X3D WOOD with real wood trim",
        "score": 76,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://i.redd.it/2deyq1wiog5g1.gif",
                "author": "noreasongiven0"
            },
            {
                "raw_content": "Would NOT recommend pairing this with a GPU that uses a 12VHPWR/12V2x6 lmao",
                "author": "senj"
            },
            {
                "raw_content": "I'd buy the shit out of an ITX version.",
                "author": "Aromatic_Wallaby_433"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD next-gen \"Medusa Point\" Zen6 APU with High and Low TDP settings spotted in shipping manifest",
        "score": 147,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "AMD hurry up an launch RDNA4 into the APUs. I want a handheld but waiting for this",
                "author": "Psyclist80"
            },
            {
                "raw_content": "So not only do they continue to force an upsell of most of the gains to the Ryzen 9 tier (Ryzen 7 literally half the core count), there will be a straight downgrade on the iGP on the entire <45w APU lineup while Panther will further improve on LNL? Wow, just wow. Hopefully this is fake",
                "author": "996forever"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Ryzen 7 9850X3D appears on Geekbench with 5.6 GHz clock",
        "score": 181,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "essentially a binned 9800X3D which gets you closer to the 6GHz mark good luck selling it in this market, maybe if AM5 could support DDR4",
                "author": "xthelord2"
            },
            {
                "raw_content": "For reference, this is my geekbench with a 9800x3d at 5.6ghz and 8400mhz ram. https://browser.geekbench.com/v6/cpu/15407700",
                "author": "Obvious_Drive_1506"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Ryzen AI 9 HX 470 leak confirms first RDNA 3.5 iGPU clocked at 3.1 GHz",
        "score": 44,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "No FSR4 for handheld PCs til RDNA5/UDNA1.",
                "author": "The_Silent_Manic"
            },
            {
                "raw_content": "God AMD sucks, what the fuck is RDNA 3.5. Give us a RDNA 4.0 APU.",
                "author": "Bloated_Plaid"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "ACEMAGIC to launch AMD Ryzen AI MAX+ 395 based TANK, replacing CPU and dGPU with APU",
        "score": 17,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Another strix Halo mini PC. Still only one laptop 🙄",
                "author": "Agentfish36"
            },
            {
                "raw_content": "There's already a billion of these mini PCs with this chip in it, who cares.",
                "author": "thelastsupper316"
            },
            {
                "raw_content": "A little late to the game…",
                "author": "Krothic"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "MaxSun iCraft X870M board teases support for “future next generation” Ryzen CPUs and up to 400W support",
        "score": 13,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "ASUS launches ROG STRIX B850-I Mini-ITX motherboard in white",
        "score": 12,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "US job cuts surged 183% in October to a record 153K. Is this the end of America's ‘no hire, no fire’ landscape?",
        "score": 123,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lots of fire and lots of gig job hire! This is the reason why unemployment rate continues remain at historic lows, and the latest jobless claim fell to the lowest in over 3 yrs. We are replacing good corporate jobs with part time/no benefit gig economy jobs. Although it is anyones guess when those uber/lyft/amazon delivery jobs will dry up when people have no money to spend on expensive rides and food delivery.",
                "author": "liverpoolFCnut"
            },
            {
                "raw_content": "“no hire, no fire” was one of those fluff propaganda pieces that corporate oligarch-owned news outlets said and ran with. They were trying to will it into existence, at least in the workers’ minds, so that the majority would easily believe that the economy is still running strong and that everyone should continue to spend and keep on as if nothing bad was happening, despite what was actually happening in their day to day lives and the grim layoff numbers. All it did was suggest to larger corporations that they needed to be more discreet about layoffs.",
                "author": "zerosumratio"
            },
            {
                "raw_content": "Oh shit, I think my company CEO might have misread the slogan as 'no hire, just fire'.",
                "author": "babypho"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Core inflation rate watched by Fed hit 2.8%, delayed September data shows, lower than expected",
        "score": 71,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Only a slight conflict of interest that the loose credit whores that benefit from loose conditions are the ones that make the predictions. Yay we beat our own expectations that are still way above target and not trending closer! Cutting rates above target = fiscal dominance creeping in",
                "author": "Rude_Judgment7928"
            },
            {
                "raw_content": "Does anyone really believe inflation is that low? I realize it’s core inflation, but there’s some trickery here. For example, I know that my energy costs have increased about 8% from last year.",
                "author": "BobcatCapable5529"
            },
            {
                "raw_content": "Higher than expected, lower than expected. These economists might be biased or just bad at their jobs.",
                "author": "Likely_a_bot"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Sell for 70k loss or rent for 400 per month loss?",
        "score": 17,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Do the math 400 x 12 is 4800 a year in loses. That's roughly 12 years to reach the same amount.",
                "author": "YeaManJam"
            },
            {
                "raw_content": "Poor nepo baby got cooked when his real estate parasite told him to bid over asking. No one feels bad for you. Bankruptcy solves that entire problem",
                "author": "VendettaKarma"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Investor Activity Is Muted, With Home Purchases Up 1% and Market Share Holding Steady",
        "score": 22,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is for q3, which is being timely reported here. I’d ask for and expect no less in timeliness of reporting. Let me just add that volatility is wide ranging. Q4 investor activity in my Florida market is raging again. They may have taken a break in July-September, but beginning in October, everything not yanked from the market was snatched up quickly.",
                "author": "Nuvuser2025"
            },
            {
                "raw_content": "DSCR loans definitely not going brrrrrr lately",
                "author": "SevereSignificance81"
            },
            {
                "raw_content": "Well is dry for now. Carry sucks. Upside like we saw probably gone for awhile per data.",
                "author": "generalvannuys"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "PCE Measure of Shelter Declined to 3.7% YoY in September",
        "score": 18,
        "text_content": "",
        "comments": [
            {
                "raw_content": "CPI Shelter was up 3.6% year-over-year in September, down slightly from 3.6% in August, and down from the cycle peak of 8.2% in March 2023. Housing (PCE) was up 3.7% YoY in September, down from 3.9% in August and down from the cycle peak of 8.3% in April 2023. Since asking rents are mostly flat year-over-year, these measures will slowly continue to decline over the next year as rents for existing tenants continue to increase. PCE Prices 6-Month AnnualizedThe second graph shows PCE prices, Core PCE prices and Core ex-housing over the last 3 months (annualized): Key measures are above the Fed's target on a 3-month basis. 3-month annualized change: - PCE Price Index: 2.8% - Core PCE Prices: 2.7% - Core minus Housing: 2.6% https://www.calculatedriskblog.com/2025/12/pce-measure-of-shelter-declined-to-37.html",
                "author": "SnortingElk"
            },
            {
                "raw_content": "It is at its highest level since November 2023. It's roughly the same as Japan's inflation rate, a level that is making the BOJ consider increasing interest rates. Back in May it was 2.1%, but it has kept rising and has become quite high.",
                "author": "Bulky_Jellyfish9012"
            },
            {
                "raw_content": "The costs of shelter going up is supposed to represent a bubble bursting how? Lmao",
                "author": "Cautious_Midnight_67"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "$208 million wiped out: Yieldstreet investors rack up more losses as firm rebrands to Willow Wealth",
        "score": 25,
        "text_content": "As Yieldstreet tries to distance itself from a rocky past with a new name and ad campaign, its customers are dealing with a present reality that is increasingly dire. The private markets investing startup, freshly rebranded as Willow Wealth, last week informed customers of new defaults on real estate projects in Houston and Nashville, Tennessee, CNBC has learned. A chart on the company’s website showing annualized returns of negative 2% for real estate investments from 2015 to 2025 — down from 9.4% gains just two years prior — has been taken down. https://www.cnbc.com/2025/12/05/yieldstreet-investors-losses-willow-wealth-rebrand.html This company was heavy investor in Deep South and now pulling out as investments collapsed. Slowly seeing wall street getting out of real estate, few RE large funds have also stopped taking new customers and limited withdrawals.",
        "comments": [
            {
                "raw_content": "So happy I didn't fall for this. When this first came on the scene I was like oh I can be in real estate without any of the work and a crazy return. Then thought if any of these deals were so good they wouldn't need my money.",
                "author": "RedDoorTom"
            },
            {
                "raw_content": ">“The investments in question represent a very small portion of our overall portfolio and do not reflect the current nature of our offerings or business focus,” she said. >The firm declined to say how much it manages in assets. lol",
                "author": "WrongThinkBadSpeak"
            },
            {
                "raw_content": "$208, so far…going to get a lot worse with the trash that’s in this stuff.",
                "author": "sonkist32"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Denver Housing Update: November 2025",
        "score": 6,
        "text_content": "Hello friends, I’m back with another Denver market update! Lets take a look at how November wrapped up: **Month-over-Month:** Closed listings fell 21% from October. This slowdown is normal going into the holiday season. The median closed price slipped just 1% month over month, showing that sellers are still holding value. Homes averaged 38 days on the market, three days longer than in October. For buyers, there is less competition and more time to decide. For sellers, pricing with intention remains key. **Year-over-Year:** Homes are taking longer to sell, averaging 38 days on the market compared to 29 days last November. At the same time, inventory has grown by 14%, so buyers have more choices. Closed sales were down 11% compared to last year, which is a sign that buyer activity has cooled. Prices, however, held steady. The median rose 1% to $584,000. Attached homes (like condos and townhomes) saw a price dip, down 8% to $400,000. Single‑family homes stayed nearly unchanged at an average of $635,000. **Rental Market:** Rents slightly decreased in November, with the average down 1% to $2,650. Rentals stayed on the market longer — 41 days on average, up 10 from last year — giving tenants more time to compare. Even so, leased properties rose 16% year over year. Landlords should keep pricing sharp and make listings stand out. **Overall:** November brought slower activity, but still solid stability. Buyers are gaining options, sellers are still holding value, and both sides have opportunities! source: reColorado",
        "comments": [
            {
                "raw_content": "Thanks for sharing this data. It seems like you have good insight. Can you talk about the market for single-family homes around Cherry Hills Village and Greenwood Village?",
                "author": "cortedorado"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Google's 'Titans' achieves 70% recall and reasoning accuracy on ten million tokens in the BABILong benchmark",
        "score": 408,
        "text_content": "[Titans + MIRAS: Helping AI have long-term memory](https://research.google/blog/titans-miras-helping-ai-have-long-term-memory/) \\[December 4, 2025\\]",
        "comments": [
            {
                "raw_content": "Oh wow i remember reading about this MIRAS paper from Google back in like April or something, it seems they are progressing with this and perhaps maybe we see a Gemini 4 with this new architechture in 2026 with 10M context length, virtually 0 hallucinations and a great performance in context retrieval/RAG benchmarks.",
                "author": "TechnologyMinute2714"
            },
            {
                "raw_content": "Crazy impressive, especially considering the models are also getting much better on so many other tasks at the same time! 10 million tokens is about the length of the world's longest novel.",
                "author": "tete_fors"
            },
            {
                "raw_content": "Same guy Ali Behrouz involved in improving that even more with the recent \"Nested Learning\" paper, way higher than 70%.",
                "author": "ithkuil"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "BREAKING: OpenAI declares Code Red & rushing \"GPT-5.2\" for Dec 9th release to counter Google",
        "score": 665,
        "text_content": "Tom Warren (The Verge) reports that OpenAI is planning to release **GPT-5.2** on **Tuesday, December 9th**. **Details:** * **Why now?** Sam Altman reportedly declared a *Code Red* internal state to close the gap with Google's Gemini 3. * **What to expect?** The update is focused on regaining the top spot on leaderboards (Speed, Reasoning, Coding) rather than just new features. * **Delays:** Other projects (like specific AI agents) are being temporarily paused to focus 100% on this release. **Source: The Verge** 🔗 : https://www.theverge.com/report/838857/openai-gpt-5-2-release-date-code-red-google-response",
        "comments": [
            {
                "raw_content": "Damn can't wait for the genie 3 announcement on december 10th then",
                "author": "timmy16744"
            },
            {
                "raw_content": "I wonder what adverse affects will rushing bring.",
                "author": "Profanion"
            },
            {
                "raw_content": "Working there must be total hell",
                "author": "scaredofsalad"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini 3 Pro Vision benchmarks: Finally compares against Claude Opus 4.5 and GPT-5.1",
        "score": 275,
        "text_content": "Google has dropped the full multimodal/vision benchmarks for **Gemini 3 Pro**. **Key Takeaways (from the chart):** * **Visual Reasoning (MMMU Pro):** Gemini 3 hits **81.0%** beating GPT-5.1 (76%) and Opus 4.5 (72%). * **Video Understanding:** It completely dominates in procedural video (YouCook2), scoring **222.7** vs GPT-5.1's **132.4**. * **Spatial Reasoning:** In 3D spatial understanding (CV-Bench), it holds a massive lead (**92.0%**). This **Vision** variant seems optimized specifically for complex spatial and video tasks, which explains the massive gap in those specific rows. Official 🔗 : https://blog.google/technology/developers/gemini-3-pro-vision/",
        "comments": [
            {
                "raw_content": "Gemini is def the best all rounder model. I think in the long run that's what makes it really \"intelligent\". Even if it lags behind in coding",
                "author": "GTalaune"
            },
            {
                "raw_content": "If they come out with a good voice model with search I’m switching over to Gemini.",
                "author": "bragewitzo"
            },
            {
                "raw_content": "Although I think all three models are very intelligent, I do find GPT-5.1-thinking often spending way too much time writing code to analyze simple images that Gemini seems to view and analyze instantly. The other day I got 8m thinking time on a simple benchmark.",
                "author": "Purusha120"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Meanwhile, 18 years ago in Japan",
        "score": 943,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This may look similar to modern robotics but it's actually really different. Asimo used basically linear control with very high gain to move, it's why it's legs have this bent posture with relatively little motion per step. It's a less energy efficient and flexible than modern neural net methods.",
                "author": "Additional-Bee1379"
            },
            {
                "raw_content": "![gif](giphy|1lB2OXzJrMN1K|downsized) I miss ASIMO! 😭",
                "author": "Kavethought"
            },
            {
                "raw_content": "USA and China have done Black magic on Japan. Believe me",
                "author": "Prudent_Turnip1364"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Geoffrey Hinton says rapid AI advancement could lead to social meltdown if it continues without guardrails",
        "score": 91,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We should all get comfortable with the fact that no guard rails will ever be put in place. Not with the current administration in the U.S., and unlikely for the next one either. Our world only cares about the rich and elite, who are pressing full speed ahead with AI no matter what anyone else says. People like Elon Musk don't give two shits about you or your family. Best anyone can do is just hope that AI does in fact improve your life eventually.",
                "author": "Weekly-Trash-272"
            },
            {
                "raw_content": "No shit captain. Billionaire tech bros would burn society down to “win”. Yet voters vote in billionaires, so we get what is coming, for being imbeciles.",
                "author": "Prestigious_Ebb_1767"
            },
            {
                "raw_content": "it wont be long before leaders spiral in to, \"yeah well MY AI said this was right!\" and another leaders says, \"ok but MY AI says yours is stupid and its right!\"",
                "author": "Upset_Programmer6508"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "'Godfather of AI' Geoffrey Hinton says Google is 'beginning to overtake' OpenAI: 'My guess is Google will win'",
        "score": 1067,
        "text_content": "",
        "comments": [
            {
                "raw_content": "In interviews he often says one of the first things he does when he wakes up is to check his Google shares' price. He used to work for them too.",
                "author": "most_crispy_owl"
            },
            {
                "raw_content": "As much as i despise google, you have to respect their comeback in the AI race. Who remembers the catastrophe that Bard was?",
                "author": "d41_fpflabs"
            },
            {
                "raw_content": "What up with all those \"godfathers\" you dont see them in other tech.",
                "author": "Primo2000"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "We broke the 50% barrier! Poetiq is now #1 on ARC-AGI-2 with 54% Accuracy and half the cost of previous SOTA.",
        "score": 24,
        "text_content": "the title says it all.",
        "comments": [
            {
                "raw_content": "Do they have / are they going to offer a public product that uses this? Or is it just research and it will be up to other companies to try to replicate their methods?",
                "author": "AnonThrowaway998877"
            },
            {
                "raw_content": "On top of Gemini 3. What a model.",
                "author": "jonomacd"
            },
            {
                "raw_content": "This could be the turning point...",
                "author": "ZealousidealBus9271"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"Google outlines MIRAS and Titans, a possible path toward continuously learning AI\"",
        "score": 389,
        "text_content": "[https://the-decoder.com/google-outlines-miras-and-titans-a-possible-path-toward-continuously-learning-ai/](https://the-decoder.com/google-outlines-miras-and-titans-a-possible-path-toward-continuously-learning-ai/) \"A year after publishing its Titans paper, Google has formally detailed the architecture on its research blog, pairing it with a new framework called MIRAS. Both projects target a major frontier in AI: models that keep learning during use and maintain a functional long-term memory instead of remaining static after pretraining.\"",
        "comments": [
            {
                "raw_content": "I remember there were a few years of lag between the invention of the transformer architecture and the release of GPT 3.5. I remember when the original TITANS and Mamba preprints were getting hyped a couple years ago, now we might start to see them properly scaled and implemented by a frontier lab...",
                "author": "typeomanic"
            },
            {
                "raw_content": "The wall is being scaled and we just discovered rope.",
                "author": "FarrisAT"
            },
            {
                "raw_content": "This is it folks. This is IT.",
                "author": "Able-Necessary-6048"
            }
        ],
        "subreddit": "singularity"
    }
]