[
    {
        "post_name": "Redditors are realizing how useless they are",
        "score": 1005,
        "text_content": "",
        "comments": [
            {
                "raw_content": "These are the people living in a dream about \"If people would just.....\".",
                "author": "OldGloryUnfurled"
            },
            {
                "raw_content": "lol \"MarkMyWords\" ... what is this, a soap box for ants? what a bunch of losers",
                "author": "BigBallsMike"
            },
            {
                "raw_content": "Reddit is a shithole. It’s basically 50% bots 50% troons. and fuck u/spez. And u/sodypop. Both are MAJOR faggots. The_Donald was the only good thing about it.",
                "author": "MedicallyReddit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "It's a classic for a reason 🇺🇸",
        "score": 856,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Spelled correctly.",
                "author": "entERmyMAtrix"
            },
            {
                "raw_content": "Sure, I've been called a xenophobe, but the truth is I'm not. i honestly just feel that America is the best country and all the other countries aren't as good. That used to be called 'patriotism'. Kenny motherfucking Powers",
                "author": "rambler045"
            },
            {
                "raw_content": "This book was from the great dimension. I miss it. At least, this one still got Trump.",
                "author": "mailinvoter"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "NEMY WITHIN: Remember that Rep Ilhan Omar pledged her allegiance to Somalia promising that she would protect its interests above all others from inside the US government.",
        "score": 868,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Strip her of her citizenship and deport her ni**er bitch ass back to her 3rd world shithole dumping ground of a failed nation. Subhuman 60IQ trash",
                "author": "Redpilled2Depression"
            },
            {
                "raw_content": "The receipts are all over the Internet, I don't know why she's still here. Immigration fraud carries a 20 year prison sentence, and we're waiting.",
                "author": "MythArcana"
            },
            {
                "raw_content": "How bout a big dose of STFU?",
                "author": "Cowboy888"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Central Texas ~ about 24 dead & 20 Christian girls missing after catastrophic flash flooding 🏕️🌊⛈️",
        "score": 775,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Kerrville/Ingram is my hometown. I happen to be on vacation at the coast, and woke up this morning to a blizzard of text messages seeking my status. I am done with vacation, we are heading home in the morning to help however we can.",
                "author": "Polkadotard"
            },
            {
                "raw_content": "This is really sad. Camp Mystic was the sister camp to the camp I went to every summer, and we would have socials together. I just remember how young and innocent we were. The \"raids\" we would have, thinking we were canoeing up and sneaking up to them, only to find out the girls camp knew and would surprise us with food and a dance. Rio Vista got lucky because they were in between sessions, so only kids staying for another session were there. They still had some cabins wash away though. A lot of history and memories washed away with those kids' lives. Those camps have been operating over 100 years.",
                "author": "schism"
            },
            {
                "raw_content": "very sad may God save those 20",
                "author": "spinometer2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "So nice to have a wonderful First Lady with so much class, elegance, brains and beauty….unlike some of that other garbage we’ve had",
        "score": 609,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I have so much respect for her. You know she was enjoying her life as a mother and wife of a billionaire and she never chose to get into politics. She supported her husband‘s choice though and stood by his side while trying to protect her growing son. Critics complain that she refused to do all the “traditional First Lady duties” but feminists would be the first to say “you go girl you do you!” if it were any woman other than Melania. With this administration and Barron off to college, I think she is more comfortable in her role and enjoying it much more. She doesn’t let anybody guilt trip her into doing First Lady duties unless she wants to do them - like her visit with the children just past week. I think she’s just lovely and I’m very happy to see her enjoying herself with her husband.",
                "author": "DingleberryMutt"
            },
            {
                "raw_content": "Melania Trump has been a bright spot in the White House, nothing better than her for as long as I can remember. That Biden broad looked like an old bar whore and dressed like one too. Big Mike was just a fucking linebacker in a dress. People like to go on about Jackie Kennedy, but honestly she always talked kind of like a retard and not all that in the looks department.",
                "author": "Taylor3006"
            },
            {
                "raw_content": "Love you Melania Trump. The most elegant and graceful first lady. Happy independence day!",
                "author": "BrainwashedbyTrump"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: An unlawful assembly has been declared in Los Angeles as rioters clash with National Guard and DHS outside the federal building",
        "score": 869,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's really sad because you can tell the \"protestors\" have rehearsed how to move, and the feds have been trained on how to respond, and it's a giant, stupid cosplay at this point.",
                "author": "HelluvaEngineer"
            },
            {
                "raw_content": "Meanwhile in Florida fireworks are ringing all around. Let Freedom ring for the USA and God Bless on this Happy 4th of July!",
                "author": "GA_Logic"
            },
            {
                "raw_content": "You can tell LA has the most illegals by how much they are protesting there. Should definitely double down on LA would go a long way towards eventually flipping the state.",
                "author": "texas4ever"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "When a democrat sees a billionnaire, he says \"Nobody should have that much.\" When a republican sees a billionnaire, he says \"Everybody should have that much.\"",
        "score": 1301,
        "text_content": "",
        "comments": [
            {
                "raw_content": "When a leftist sees a billionaire, the leftist says, \"I should have that.\" The leftist politician says, \"I shall take that.\"",
                "author": "conservativefrank"
            },
            {
                "raw_content": "This guy is a piece of shit.",
                "author": "TrumpIsTheVictor"
            },
            {
                "raw_content": "Crabs in a bucket",
                "author": "austford"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Cry harder Sandy",
        "score": 1074,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Mock them relentlessly until they reveal their true lizard form. ✨🦎",
                "author": "MythArcana"
            },
            {
                "raw_content": "I'm reading the Bill. It's no wonder the Left is screaming bloody murder. Winning like this destroys them. Line after line of winning. It's stunning.",
                "author": "GaryWA"
            },
            {
                "raw_content": "No autopen!",
                "author": "BarryOhBummer"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🇺🇸🐸🇺🇸🐸❤️🐸🇺🇸🐸🇺🇸",
        "score": 662,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I ate soooo many brats and ribs. I really want to sleep from my food coma. But the Freedom noises INTENSIFIES outside. Shadilay.",
                "author": "BlackJack1776"
            },
            {
                "raw_content": "Happy Independence Day pedes! MAGA 🇺🇸",
                "author": "Hangemh1gh"
            },
            {
                "raw_content": "Love the sound of fireworks!",
                "author": "MedicallyReddit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Federal judge GREENLIGHTS President Trump’s deportation of criminal aliens to South Sudan.",
        "score": 1305,
        "text_content": "",
        "comments": [
            {
                "raw_content": "WE JUST KEEP WINNING!",
                "author": "Brownwaterboys"
            },
            {
                "raw_content": "Okay so I don't understand. Does this mean that we can deport anybody to there or just the people that won't claim where they're from? Can somebody explain?",
                "author": "Gamblingman"
            },
            {
                "raw_content": "BYE! Don't EVER come back!",
                "author": "TrumpMagaNoBama"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Jihadi Bots Decided to Drag Their Protest...Into a Home Depot.",
        "score": 692,
        "text_content": "",
        "comments": [
            {
                "raw_content": "FFS... they want the pawns bloodied!",
                "author": "ChyNahAzzWhole1"
            },
            {
                "raw_content": "They always love to spout how hard they are, and confronted by 2 angry black men, these motherfuckers are looking for the exit.",
                "author": "rambler045"
            },
            {
                "raw_content": "Will be reported by MSNBC as hundreds of thousands took over a Home Depot in the name of peace",
                "author": "Induceddrag"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "B-2 stealth bombers that struck Iran perform a flyover above the White House on Independence Day.",
        "score": 1496,
        "text_content": "",
        "comments": [
            {
                "raw_content": "America ! Fuck Yeah !!",
                "author": "NormalCitizen"
            },
            {
                "raw_content": "Those suckers are so big",
                "author": "AppealToHeaven"
            },
            {
                "raw_content": "Fanfuckingtastic! I confess that's making me cry. You are so lucky to have Trump ❤️",
                "author": "Saxonlady"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Don't like America? Just leave then. No one is forcing you to stay. I heard Saudi Arabia is a great country.",
        "score": 1136,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The founding fathers would never have let in the illegals. They’d be more likely to declare an invasion and straight up shoot them than Trump is lol. These pussies are so cooked. Like, forever.",
                "author": "madeaprofilejustforu"
            },
            {
                "raw_content": "Reddit is really the worst. Its probably not even an american that wrote that shit.",
                "author": "MAGASQUAD"
            },
            {
                "raw_content": "The founding fathers would be up in arms about a lot of shit. I doubt they wouod have put up with most of this shit in the last 100 years or so",
                "author": "Platinum28"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A Tale of 2 Parties This July 4: RNC Celebrates Greatness of USA, DNC Says American Dream 'Out of Reach'",
        "score": 825,
        "text_content": "",
        "comments": [
            {
                "raw_content": "To be fair, my dream of picking up a suppressor at my local cabela's and throwing a stock on .300 blk pistol without my dog getting shot still feels out off of reach thanks to worthless/spinless senate Republicans and controlled opposition Thune.",
                "author": "DrDoodooBrains"
            },
            {
                "raw_content": "Fixed the headline: A Tale of 2 Parties This July 4: RNC Celebrates Greatness of USA, DNC Says American Dream FOR ILLEGALS 'Out of Reach'",
                "author": "Colorado-Living"
            },
            {
                "raw_content": "chasinggoose.jpg Who made the American Dream out of reach!? Who made it out of reach!?",
                "author": "Build_Back_Bankrupt"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The White House : SIGNED. SEALED. DELIVERED. 🧾🇺🇸 President Trump’s One Big Beautiful Bill is now LAW — and the Golden Age has never felt better.",
        "score": 1068,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm making pan-seared salmon for dinner, that's all I know. 🐟🍳",
                "author": "MythArcana"
            },
            {
                "raw_content": "Congratulations to EVERYONE, even you retards that take America for granted!",
                "author": "madeaprofilejustforu"
            },
            {
                "raw_content": "Fuck all you sanctimonious, arrogant, retarded faggots who fought this bill. Make sure to decline the Trump Tax Cuts and pay your Obama Taxes. Remember your PRINCIPLES!",
                "author": "NewYEARNewPOTUS"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump signs his \"Big Beautiful Bill\" into law and bangs Speaker Johnson's gavel.",
        "score": 1121,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wuz here Trump Bangs Johnson",
                "author": "IPMang"
            },
            {
                "raw_content": "I feel this bill might be more important than we realize",
                "author": "Redpilled2Depression"
            },
            {
                "raw_content": "Leftards heads exploding right now",
                "author": "MedicallyReddit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "LIVE: President Trump and the First Lady Hold a Fourth of July Celebration - 7/4/25",
        "score": 589,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don't know how this guy does it, I'm way younger and I'm cooked at 10pm.... but to be fair I was drinking in the sun all day",
                "author": "CmonGubMintGibMe"
            },
            {
                "raw_content": "Happy Independence Day, Pedes! 🎆🐸👍",
                "author": "MythArcana"
            },
            {
                "raw_content": "They are so cute together.",
                "author": "uxername27"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "True",
        "score": 1338,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Quick! Before the doomer brigade comes in! Fuck you faggot doomers! Can't Stump the Trump!",
                "author": "Iforgot2"
            },
            {
                "raw_content": "*California residents not included.",
                "author": "MythArcana"
            },
            {
                "raw_content": "I wish people would stop pretending women's sports fucking matter.",
                "author": "TheImpossible1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The One Big Beautiful Bill is ready for signature!",
        "score": 1037,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Its so refreshing to have an attractive and smart Press Sec again. I really couldn't stand that dumb raggedy andy, used q-tip looking one we had under Biden.",
                "author": "Beast_Pot_Pie"
            },
            {
                "raw_content": "Such a cutie ☺️",
                "author": "SomecatsareMAGA"
            },
            {
                "raw_content": "It's a Big Bill",
                "author": "TrumpCare"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Hamas is ready to be done fighting",
        "score": 1215,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Muzzies are allowed to lie by Allah to get their way. Don't trust, don't relax",
                "author": "RichieSprouse"
            },
            {
                "raw_content": "Lol no they aren't. They just want enough time for new weapons disguised as aid to come in. Again",
                "author": "PapaPepe"
            },
            {
                "raw_content": "Israel should just finish them now while they still have the chance, be done with it once and for all. Hamas will go back to doing the same shit after a few years of using aid money to build tunnels and rockets",
                "author": "Kingofkek"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Switch 2 Vs Steam Deck OLED WITH Actual Benchmarks",
        "score": 77,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Im a little unclear on where is the switch2 seem to be getting all its t239 GPU efficiency from? it performs almost 3x in some tests at the same 8.6w power draw on a worse node. I believe On PC RDNA2 was more efficient than Ampere at the similar performance (rx6600 vs 3060) or (6700xt vs 3060ti/3070) mostly thanks to the node advantage.",
                "author": "fatso486"
            },
            {
                "raw_content": "Insane efficiency Nvidia and Nintendo pulled of that horrible Samsung 8N (custom 10nm node Imagine what they could do with a TSMC 4N (custom N5)",
                "author": "From-UoM"
            },
            {
                "raw_content": "Nintendo already has a switch 2 “oled and lite” in the works 2-3 years from now where the only change is moving from 7nm to 4/3nm and they won’t increase the performance but just lower power consumption. They will follow the exact same playbook as the original switch. This time they had stockpiled 20MM switches on launch. Hence the leak of 5mm being sold right off the bat. They are smart and won’t jeopardize numbers. They will ride the wave of about 60-80MM consoles over the next 2-3 years then rumors will come for a oled and or lite, then easily sell that. What I’m waiting for is when the Tegra team launches the next media unit. They quickly follow the switch console with a Nvidia shield. I’m guessing they haven’t announced it because all the supply is going to Nintendo until it starts to slow down then we will see a shield 2. Which will keep these chips always in production. It’s genius by Nvidia. AMD still has to figure out this dual win strategy.",
                "author": "No-Fig-8614"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Arctic P12 Pro: Key to „noiselessness“ is in 7 blades - HWCooling.net",
        "score": 168,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Improved across the board vs P12, with the exception of specific noise levels on radiators where it matches the original P12 (showing how good the P12 was!), but with greatly improved acoustics. It can reach a slightly higher performance ceiling vs P12 max, yet the flaw of low speed instability is entirely fixed. Against other fans, its performance at low resistance scenarios is good, but it shines more vs higher resistance obstacles. All that for the low price P12 was known for. This year is a great year for fans of fans... great fans coming one after one.",
                "author": "a12223344556677"
            },
            {
                "raw_content": "Cool, but the reason I got rid of my P12s was the motor whine at specific rpms",
                "author": "starburstases"
            },
            {
                "raw_content": "Is there a 140mm equivalent out yet or expected?",
                "author": "Klemun"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Techpowerup - NVIDIA GeForce RTX 5050 8 GB Review",
        "score": 95,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Looks like it's around 10% faster in raster than a RX 6600XT, which you could have bought 2-3 years ago for around $200. The evolution of the budget card segment over the last years has been very disappointing.",
                "author": "RainyDay111"
            },
            {
                "raw_content": "Too be honest the 5050 would have been well received if they priced it at $199.",
                "author": "OwlProper1145"
            },
            {
                "raw_content": "This would be a really good valid card if it had 75W TDP and didn't need an extra power cord. It would fit the need for a good segment of the market",
                "author": "WJMazepas"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Lenovo Chromebook 14 Plus with MediaTek Kompanio 910 Ultra Review",
        "score": 6,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Specs: 1x Cortex X925 with 2mb L2, clocks up to 3.6ghz 4x Cortex X4 with 1mb of L2 4x A720 with 512kb of L2 12mb of L3 cache on DSU-120 L3 ring bus (with 4 L3 slices per ring, with 2 L3 rings in total) Arm Immortalis-G925 MC11 igpu 10mb of System Level Cache likely supporting the igpu's bandwidth demands LPDDR5X-8533",
                "author": "Healthy-Doughnut4939"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Laptop RTX 5070 Ti vs Laptop RTX 5080 - Is 5080 Gaming Laptop Worth More $?",
        "score": 18,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TLDR: Laptops used: XMG NEO 16 2025 with exact same specs except GPU Laptop RTX 5070 Ti 12GB 140W TDP Laptop RTX 5080 16GB 175W TDP RTX 5080 config costs 22% more. Average in 25 games (mix high and ultra settings and RT): 1080P: RTX 5080 Laptop was 13.27% faster 1440P: RTX 5080 Laptop was 17.69% faster 4K: RTX 5080 Laptop was 22.97% faster Average 25 game FPS: 4K: Laptop RTX 5080: 60.02 Laptop RTX 5070 Ti: 49.37 1440P: Laptop RTX 5080: 99.48 Laptop RTX 5070 Ti: 85.19 1080P: Laptop RTX 5080: 125.32 Laptop RTX 5070 Ti: 111.8",
                "author": "Antonis_32"
            },
            {
                "raw_content": "Honestly the biggest difference seems to be the 5070 Ti’s artificially lowered power limit. If they both had a 175W TDP (which given identical hardware would be achievable) then the gap to the 5080 would be a lot lower.",
                "author": "spicesucker"
            },
            {
                "raw_content": "The more important part is 12GB vs 16 GB VRAM. Properly showing in Spider Man 2 4K benchmarks (which is not an outlier, it's just VRAM starving)",
                "author": "kyp-d"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "So the Switch 2 has been out for a month now. What are your thoughts so far?",
        "score": 895,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Needs more game updates",
                "author": "Dolph_x3"
            },
            {
                "raw_content": "I’m enjoying my system so far. The three games I got has been enough to keep me hanging until DK bananza comes out. Mario Kart world isn’t the legendary launch title that BOTW was but I’m having fun with it.",
                "author": "ricypricol"
            },
            {
                "raw_content": "Honestly needs more games before a real review can be made. I think it’s great, donkey Kong will shows its potential.",
                "author": "swivel84"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Switch 2 joy-cons take 2+ seconds to register when waking from sleep. Any thoughts on why this might be?",
        "score": 269,
        "text_content": "And yes, waiting 2 seconds on every unlock is pretty annoying to me, before anyone asks.",
        "comments": [
            {
                "raw_content": "Would like to know the reason also. My joycons take a couple seconds to register also",
                "author": "TheeeFloridaMan"
            },
            {
                "raw_content": "I do not like the delay either. It feels unnaturally long",
                "author": "Worried-Grass-5124"
            },
            {
                "raw_content": "OMG I thought I was the only one. This is super annoying.",
                "author": "InsanityRaptor"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo Is Working On Movies Based On IPs Other Than Mario & The Legend Of Zelda",
        "score": 467,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I always thought Pikmin would make a great kids movie. Pikmin have a Minion element to them where you could make them silly, stupid and funny. The story is so easy too.. guy’s rocket crashes on an unknown planet, he discovers the whacky Pikmin, they unite to help him rebuild the ship whilst a big planet baddy appears that they all work together to beat and help him go home.",
                "author": "Masam10"
            },
            {
                "raw_content": "Im betting DK gets a movie. They are really working overtime on DK. Heavily featured in the Mario movie, a full redesign, a section of the amusement parks, and lastly the Mario game treatment. It really feels like there is a concerted effort to revitalize the DK character/franchise. Which Im all for. DKB looks phenomena. Outside of Game and Watch we have the Nintendo we have today because of the success of the Donkey Kong arcade cabinet. Literally saved the company financially and spawned 2 iconic characters. Then we got the NES from the profits!",
                "author": "3DScanEverything"
            },
            {
                "raw_content": "They should do a mature audience Metroid anime series.",
                "author": "Odd_Insurance8400"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Perfect for moving!",
        "score": 450,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I feel car sick just looking at the photo 😵‍💫",
                "author": "ApprehensiveAside812"
            },
            {
                "raw_content": "Homie, it's literally a handheld console.",
                "author": "nohumanape"
            },
            {
                "raw_content": "I feel like looking down like that whilst the car moves can get you motion sickness fast. Wouldn’t it be better just playing portably?",
                "author": "hushpolocaps69"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Switch 2 wrapped Trolleys for San Diego Comic-Con",
        "score": 82,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’m not sure if they’re Comic-Con-specific. They’ve had these trolley wraps at least since launch.",
                "author": "verdi1987"
            },
            {
                "raw_content": "But the Switch 2 doesn't have any rails...",
                "author": "Williekins"
            },
            {
                "raw_content": "Man that is the most perfect spot to put an Ad for a handheld console. Eventually people start playing on the train = win.",
                "author": "AXEternity"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "So where are all the upgrade patches for 3rd party Switch 1 games?",
        "score": 299,
        "text_content": "I was expecting a deluge of patches from 3rd party and indie devs, but nothing. Do devs still not have dev kits?",
        "comments": [
            {
                "raw_content": "I’m hoping the Witcher 3: Wild Hunt Complete edition get’s an update, at least.",
                "author": "herpa_derpa_sherpa"
            },
            {
                "raw_content": "Give me Witcher 3, RE 4, and Doom Eternal at 60 and I’ll shut up till 2026",
                "author": "Desperate-Smothie"
            },
            {
                "raw_content": "It seems like no, especially for indie developers. There was that one studio who did an AMA and told me they just unlocked dynamic resolutions and framerates on Switch 1 version of the game and it’s running at higher resolutions at full 60fps on Switch 2. But most games on Switch 1 even with DRS don’t target native display resolutions.",
                "author": "goro-n"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "That last minute bullet bill was diabolical",
        "score": 189,
        "text_content": "I went from first to 16th on the last lap. Tried to salvage what I could....nope.",
        "comments": [
            {
                "raw_content": "that’s some mad bullshit at the end of the",
                "author": "dabomb122"
            },
            {
                "raw_content": "Don't you just love being in 16th place, using a golden mushroom, followed by three mushrooms, ending up only in 11th place, then suddenly dropping to 18th place a second later? MK World is a roulette.",
                "author": "bigpig1054"
            },
            {
                "raw_content": "Eeeesh. Game used Wario methods on Wario.",
                "author": "pavoid"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo Direct soon according to John Harker",
        "score": 504,
        "text_content": "Link: https://x.com/Switch2Stock/status/1941064567444177385?s=19",
        "comments": [
            {
                "raw_content": "Why would you buy a Switch 2 and not open it?",
                "author": "djwillis1121"
            },
            {
                "raw_content": "\"Soon\" \"Shouldn't be too long\" Damn, where do I get a crystal ball like that?",
                "author": "-_ellipsis_-"
            },
            {
                "raw_content": "I have a switch 2 and haven’t opened it lol says no one fake ass bs",
                "author": "DonJuanPawnShop53"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "VENOM launching in 2026 before WOLVERINE",
        "score": 190,
        "text_content": "[https://www.youtube.com/watch?v=N7VNVHRWjC4](https://www.youtube.com/watch?v=N7VNVHRWjC4) (Insomniac Games Insider Update!!) Youtube Channel: [THE MAGGSHOW](https://www.youtube.com/@THEMAGG) According to the youtuber who has insider information Venom will release in 2026 and then Wolverine in 2027. Spider-Man 3 might release in 2029 on new gen consoles or as a cross-gen tittle.",
        "comments": [
            {
                "raw_content": "…who?",
                "author": "MrRedoot55"
            },
            {
                "raw_content": "Saying spider man 3 might be a cross gen title is a pretty big unforced error if you’re trying to be taken seriously.",
                "author": "Q_OANN"
            },
            {
                "raw_content": "I heard that Punisher launches this year, my source is trust me bro",
                "author": "Zakael7"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "New off-screen trailer of Silent Hill f leaked",
        "score": 147,
        "text_content": "[https://youtu.be/eNMZET4ZyVg](https://youtu.be/eNMZET4ZyVg) Full off-screen Silent Hill f opening at Konami panel today",
        "comments": [
            {
                "raw_content": "I was at the event itself where no pictures or video was allowed which is why you wont see much. But even then they didn't show much of the game itself it was mainly the director, writer, and composer talking about the game itself and its development. The only gameplay they actually was a 30 second snipet of Hinako just walking down a path and walking up to a shrine where it gave a promt to pray then they walk away and that was pretty much it. After that was a cutscene of Hinako talking with this boy about their childhood in an area and when she turns around he's gone. This video was the last bit shown which is the intro of the game and they showed it just to show the composer's music in the game. The main talking points were just about those 3 and their experiences and how the game takes place in Japan.",
                "author": "SOGxTheKing"
            },
            {
                "raw_content": "Yeah, peak is coming.",
                "author": "OwnAHole"
            },
            {
                "raw_content": "So hyped for this one, might actually buy it day one and that hasn't happened to me for a while now",
                "author": "Pleasant-Complaint"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "\"Ride To Hell: Retribution\" Spin-Off/ Sequel \"Route 666\" has been leaked",
        "score": 566,
        "text_content": "It was found by a member, Dusk the Crow of the Media Oasis discord community. The build of the game was dated for April 2013. It was supposed to be at least 3 months away from release before it was canned. There is a working build of the game that was released on [Hidden Palace](https://hiddenpalace.org/Ride_to_Hell:_Route_666_(prototype)) in the last 24 hours. We have in-game screenshots and footage of the tutorial. The spin-off/sequel looked promising but the infamy of the first game was the kiss of death for the franchise. EDIT: The game also had [planned achievements](https://media.discordapp.net/attachments/832350419539329035/1390798309748375552/39B438B0-5176-447E-90E7-89EF6384194A.png?ex=6869915c&is=68683fdc&hm=e566718fd469f904d11db2c64cba30084c68031e5372c17ef13c9d42696b9390&=&format=webp&quality=lossless&width=1429&height=1618). [Footage of the Tutorial Mission.](https://youtu.be/6magyv8KcLc?si=alUBznDUIgYMSGrY) [Screenshot of the title screen.](https://media.discordapp.net/attachments/832350419539329035/1390798420645777438/2D75CD9A-9DD2-419A-852D-52B269509F21.png?ex=68699177&is=68683ff7&hm=647e98ec36eea8682ae8e8e10c9c510ef6c00e15a7cf6aeba1c368f3b430c888&=&format=webp&quality=lossless&width=3278&height=1656) [Screenshot of the main menu.](https://media.discordapp.net/attachments/832350419539329035/1390798419454591068/B3EFA1CE-A658-434A-9347-8B087EF8D5A3.png?ex=68699176&is=68683ff6&hm=ec9169d1613e12ee87982919fcf229fb62f1dd1cd30fa9622293b7a6fb3cbb75&=&format=webp&quality=lossless&width=3233&height=1656) [Screenshot of the map screen.](https://media.discordapp.net/attachments/832350419539329035/1390798420003786752/300DA174-0083-4BEF-8B32-C66394FC302D.png?ex=68699177&is=68683ff7&hm=21705e740c2bc65e096811dae57df8547d05df2798776a81768eb70d71f2e32b&=&format=webp&quality=lossless&width=3240&height=1656)",
        "comments": [
            {
                "raw_content": "The fact that the devs thought this was the coolest shit will live forever in my mind.",
                "author": "Real-Terminal"
            },
            {
                "raw_content": "This looks just as peak as the last one. Shame it got canceled",
                "author": "Own_Peace6291"
            },
            {
                "raw_content": "the game that broke Angry Joe",
                "author": "Thorminator100"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Andy Robinson (VGC Podcast) - “I heard more recently, pitches (Banjo-Kazooie) are being listened to.”",
        "score": 298,
        "text_content": ">“The talk for ages was that, you know, there’s always outside interests in Banjo but they’re not interested. I mean, Gregg (Mayels) is someone who doesn’t look back, notoriously, he said this on the record, that he likes to do new stuff. The attitude from the studio leadership, “no no no, we’re gonna do the new thing.”” >“I heard more recently the pitches are being listened to. I heard constantly the names that comes up is **Toys for Bob** who really wanna do one. Funny enough, I heard **Moon Studios** as well was another one who’s really interested.” >”There’s always talk about interest of a cartoon, of a movie, constant.” [45:55 timestamp](https://youtu.be/qitFuPQ_2SU?si=h_gtkle745cTmbhz&t=2755)",
        "comments": [
            {
                "raw_content": "#Andy Robinson is a Tier 2 - Generally Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Toys for Bob would be really nice.",
                "author": "Firecobra130189"
            },
            {
                "raw_content": "The next time we hear about it will be when Xbox cancels it after 4 years of development",
                "author": "Rarglar"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Hollow Knight: Silksong Steam page received five manual updates in just two days",
        "score": 373,
        "text_content": "SteamDB: [https://steamdb.info/app/1030300/history/](https://steamdb.info/app/1030300/history/)",
        "comments": [
            {
                "raw_content": "Tomorrow",
                "author": "1AnotherUser_"
            },
            {
                "raw_content": "Preparing for the Nintendo Direct shadowdrop next week, obviously. ![gif](giphy|x0npYExCGOZeo)",
                "author": "Correct_Refuse4910"
            },
            {
                "raw_content": "I won’t believe it exists until I’m playing it",
                "author": "Responsible-Cow-3548"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Leaked details for Zenimax's canceled MMO Blackbird",
        "score": 474,
        "text_content": "[https://www.trueachievements.com/news/canceled-xbox-mmo-project-blackbird](https://www.trueachievements.com/news/canceled-xbox-mmo-project-blackbird) Details what the game was like, its Titanfall-like movement system, story overview and more",
        "comments": [
            {
                "raw_content": "Not even Titanfall inspired projects are safe",
                "author": "TopBoog"
            },
            {
                "raw_content": "I feel MMO’s always sound awesome until you actually play them.",
                "author": "hobo_lad"
            },
            {
                "raw_content": "Open world Mmo with titanfall movement and combat, sounds too good to be true. Wish it was real.",
                "author": "Internal-Drawer-7707"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "WARNING TO GIGABYTE USERS: Do not install IT5701, IT5702 or IT5711 RGB controller firmware updates",
        "score": 41,
        "text_content": "Lately Gigabyte has released a number of firmware updates for their recent Intel and AMD motherboards, these aren't BIOS updates, but firmware updates for the RGB controller, which is handled by an IT5701, IT5702 or IT5711 controller on the board. On the /r/gigabyte, /r/gigabytegaming and AORUS Discord servers, many users have been reporting that these updates are bricking the ITE controller on their motherboard and losing RGB functionality. If it was just the loss RGB, this wouldn't be as big a problem, however if the firmware update does brick your ITE controller, you also lose Q-Flash Plus (BIOS Flashback), this is because on Gigabyte boards, the same controller responsible for controlling the onboard RGB lighting is also responsible for Q-Flash Plus. Given Q-Flash Plus is a major selling point and an absolute life-saver if you ever have a bad BIOS flash, or if you need to update the BIOS without access to a CPU or RAM, we would recommend all Gigabyte owners avoid installing these IT5701, IT5702 or IT5711 RGB controller firmware updates until Gigabyte have improved the flashing process. Gigabyte claim they have removed these updates from their website, however they are still available from the AORUS website and users are prompted to install these updates using the Gigabyte Control Center. Media Reporting: Tom's Hardware: [Gigabyte's latest RGB firmware upgrade is bricking some motherboards, including Z790 series — dynamic lighting and RGB failures, rogue CPU fan usages, and more reported](https://www.tomshardware.com/pc-components/motherboards/gigabytes-latest-rgb-firmware-upgrade-is-bricking-some-motherboards-including-z790-series-dynamic-lighting-and-rgb-failures-rogue-cpu-fan-usages-and-more-reported) BenchLife: [GIGABYTE: The firmware update tool caused a problem, temporarily removed from the shelves, and will be opened again after the problem is confirmed](https://benchlife.info/gigabyte-firmware-update-tool-cause-issue/)",
        "comments": [
            {
                "raw_content": "Haha wow that is hilariously bad. And here I thought ASUS newer bios update was bad due to some higher temps",
                "author": "Cradenz"
            },
            {
                "raw_content": "“Yeah just push it to production nothing’s gonna happen, no need to QA/QC this”",
                "author": "memedaddy69xxx"
            },
            {
                "raw_content": "This is why you don't rush to update software, let others do the testing for two weeks",
                "author": "catsuitvideogames"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "COLORFUL launches its first workstation motherboard, WS W790E PRO for Xeon W3400/2400 CPUs",
        "score": 31,
        "text_content": "",
        "comments": [
            {
                "raw_content": "2 years too late and likely in a chinese only market who is this for? is there something we dont know like cheap Xeon Ws?",
                "author": "Zeraora807"
            },
            {
                "raw_content": "[deleted]",
                "author": "None"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "WARNING TO GIGABYTE USERS: Do not install IT5701, IT5702 or IT5711 RGB controller firmware updates",
        "score": 326,
        "text_content": "Lately Gigabyte has released a number of firmware updates for their recent Intel and AMD motherboards, these aren't BIOS updates, but firmware updates for the RGB controller, which is handled by an IT5701, IT5702 or IT5711 controller on the board. On the /r/gigabyte, /r/gigabytegaming and AORUS Discord servers, many users have been reporting that these updates are bricking the ITE controller on their motherboard and losing RGB functionality. If it was just the loss RGB, this wouldn't be as big a problem, however if the firmware update does brick your ITE controller, you also lose Q-Flash Plus (BIOS Flashback), this is because on Gigabyte boards, the same controller responsible for controlling the onboard RGB lighting is also responsible for Q-Flash Plus. Given Q-Flash Plus is a major selling point and an absolute life-saver if you ever have a bad BIOS flash, or if you need to update the BIOS without access to a CPU or RAM, we would recommend all Gigabyte owners avoid installing these IT5701, IT5702 or IT5711 RGB controller firmware updates until Gigabyte have improved the flashing process. Gigabyte claim they have removed these updates from their website, however they are still available from the AORUS website and users are prompted to install these updates using the Gigabyte Control Center. Media Reporting: Tom's Hardware: [Gigabyte's latest RGB firmware upgrade is bricking some motherboards, including Z790 series — dynamic lighting and RGB failures, rogue CPU fan usages, and more reported](https://www.tomshardware.com/pc-components/motherboards/gigabytes-latest-rgb-firmware-upgrade-is-bricking-some-motherboards-including-z790-series-dynamic-lighting-and-rgb-failures-rogue-cpu-fan-usages-and-more-reported) BenchLife: [GIGABYTE: The firmware update tool caused a problem, temporarily removed from the shelves, and will be opened again after the problem is confirmed](https://benchlife.info/gigabyte-firmware-update-tool-cause-issue/)",
        "comments": [
            {
                "raw_content": "considering that vulnerabilites were found in ASUS armory crate as recent as few weeks ago i am not shocked about this when board makers make stupid decisions regarding UEFI's",
                "author": "xthelord2"
            },
            {
                "raw_content": "Interesting. I updated 2 updates as soon as they were published, nothing wrong. I also updated my bios normally since then. How do I check whether I have an issue that you described?",
                "author": "vladi963"
            },
            {
                "raw_content": "I HAVE BEEN GOING CRAZY LOOKING FOR THE PROBLEM This is the reason my ARGB isn't working anymore!? And that's why I had to force bios updates and the qflash button didn't work... Thank you so much for giving out this info, I have a x870I ice, regularly update through the program utility and was about to send a new Liquid freezer pro arg back thinking it was defective IF ONLY the damn support stated somewhere that there was this issue, I swear they just try really hard to ruin the hardware once it's out! Horrible experience with a FV43U and firmware updates, with features disappearing and not working as intended anymore, I really hope they fix this because it's a MoBo, it could affect all the components, lights and flashback are a big problem already, let's not make it worse.",
                "author": "Cazzoneso"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "First serious 14-inch workstation laptop thanks to Strix Halo: HP ZBook Ultra G1a review",
        "score": 16,
        "text_content": "",
        "comments": [
            {
                "raw_content": "32 gb ram is a joke",
                "author": "2literpopcorn"
            },
            {
                "raw_content": "Really don’t understand what the 32GB model is supposed to do. Nowhere near the ram needed for the touted ML training needs, and it’s still costing as much as a 5070ti/5080 laptop while performing like a low power 4060 one in games.",
                "author": "996forever"
            },
            {
                "raw_content": "I wonder why HP only offers up to 1 TB SSD. Well, at least we could replace that one ourselves (but then we'd have a leftover 1 TB SSD that we don't need).",
                "author": "AM27C256"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "OnexPlayer teases OneXGPU Lite with Radeon RX 7600M XT GPU and Thunderbolt 5 support",
        "score": 9,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Man AMD has really stretched out navi 33 for as long as possible lol. 7600s, 7700s, 7600m xt, w7500, w7600, 7600, 7600 xt Edit: forgot 7650 GRE, holy fuck 8 configs of the same GPU",
                "author": "Educational-Web829"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "In new report, bankruptcy investigator says Citrus County homebuilder may have 'duped' buyers",
        "score": 43,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Let them suck on this lemon for a while",
                "author": "stasi_a"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Why are these condos in North Miami so cheap?",
        "score": 22,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Because Florida condos are in a bit of a nightmare scenario right now, as many of them are becoming hard to insure or uninsurable, combined with the fact that they often need expensive repairs or retrofitting, which may require substantial supplementary assessments on the owners.",
                "author": "PerformanceDouble924"
            },
            {
                "raw_content": "It's the exorbitant HOA fees, insurance cost, and neighborhood.",
                "author": "_DOA_"
            },
            {
                "raw_content": "The threat of repair assessments hangs over owners like an anvil waiting to drop…",
                "author": "Altruistic-Panda-697"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Trump's AI czar says UBI-style cash payments are a ‘leftist fantasy' ‘I will make sure it will never happen’",
        "score": 430,
        "text_content": "income-ai-jobs-2025-6",
        "comments": [
            {
                "raw_content": "So when the AI takes all of the entry level jobs or more, where does the U.S. expect people to go without UBI? Or are they gonna blame the democrats for a new wave of homeless problem?",
                "author": "AvatarInkredamine"
            },
            {
                "raw_content": "![gif](giphy|xUOxeSmFd00VhzqHQY)",
                "author": "SnooRecipes3536"
            },
            {
                "raw_content": "What the hell is with his obsession with making sure people are as miserable as possible? It’s not even a question of economics since clearly this guy couldn’t care less about it. Imagine erasing wealth simply to trigger Woke Liberals. Insane",
                "author": "GoldAttorney5350"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Scientists found a molecule that can cure baldness by waking up dormant hair folicles",
        "score": 1231,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/yjc5bfrqmxaf1.png?width=600&format=png&auto=webp&s=e18f6d51b1a394322f7e9804052f4f0108b6d576 How dormant we talkin?",
                "author": "UnhappyWhile7428"
            },
            {
                "raw_content": "I'll believe it when Ilya has bangs",
                "author": "PrincipleStrict3216"
            },
            {
                "raw_content": "PP405 is currently in Phase 2a clinical trials for androgenetic alopecia and is not yet FDA approved for commercial use. The developer, Pelage Pharmaceuticals, expects to initiate Phase 3 studies in 2026. If successful, a potential market release would likely be several years away. Like we're talking 2030 earliest, and that's assuming it is granted FDA approval.",
                "author": "GwanGwan"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Sama on wealth distribution",
        "score": 1006,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Venture capital is fantastic at creating the next billion-dollar SaaS tool; it’s terrible at building public transit or paying for elder care. Without a referee that forces redistribution, yes, that’s the government, surplus ends up in Cayman-Islands shell companies instead of in community colleges. This is why countries where citizens have the best conditions have a social-democracy, not pure cold capitalism.",
                "author": "Silver-Chipmunk7744"
            },
            {
                "raw_content": "\"I support redistributing it, dunno how but it'll happen probably. Government shouldn't do it, I will. I have no idea how though. I guess it'll just happen without trying I dunno. Start a small business or something lol.\" Who's he fooling with stuff like this",
                "author": "sheslikebutter"
            },
            {
                "raw_content": "Yes, instead of redistribution of wealth through taxes and laws, we should just trust the rich billionaires to redistribute wealth....because that is working so far...???",
                "author": "Magn3tician"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Elon Musk confirms xAI is buying an overseas power plant and shipping the whole thing to the U.S. to power its new data center — 1 million AI GPUs and up to 2 Gigawatts of power under one roof, equivalent to powering 1.9 million homes",
        "score": 728,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lmao. Scale is starting to look crazy. Power plants to power AI datacenters. Didn't expect this 2-3 years ago. What will the scale be after 2030 or even 2035?",
                "author": "Solid_Concentrate796"
            },
            {
                "raw_content": "The article is based mostly on a clip from a podcast with Dylan Patel and Matthew Berman The clip: [https://x.com/ns123abc/status/1940060095783510170](https://x.com/ns123abc/status/1940060095783510170) The podcast: [https://www.youtube.com/watch?v=cHgCbDWejIs](https://www.youtube.com/watch?v=cHgCbDWejIs)",
                "author": "occupyOneillrings"
            },
            {
                "raw_content": "The scale of all this is just stunning! Millions of GPUs, Gigawatts, Tens of billions of dollars.",
                "author": "ilkamoi"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Has anyone else noticed how quiet it’s been lately in AI?",
        "score": 168,
        "text_content": "Feels like the last month or two have been weirdly still. Since Gemini 2.5 pro, Veo 3 & Codex came out, we haven’t really seen any big new models or major features from the top AI companies. Nothing like the wave we had earlier in the year. Is this just a calm before the storm? Are all the teams just working flat out behind the scenes, waiting to make the next big move? Or are we in a bit of a plateau moment? Curious what others think.",
        "comments": [
            {
                "raw_content": "It's summer and a lot of people are in vacation",
                "author": "Emergency_Foot7316"
            },
            {
                "raw_content": "I like how we’re now at the point that a month is classed as a long time to be without any major news.",
                "author": "Substantial_Craft_95"
            },
            {
                "raw_content": "Honestly I see it more like a return to normalcy after an insane amount of big releases. After GPT-4 we went months without significant developments. And after GPT-4o came out it wasn’t until the fall that we got 3.6 Sonnet and Strawberry.",
                "author": "jaundiced_baboon"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "2025 will not be the year of AI agents",
        "score": 82,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wrong, the CEO of AI said all knowledge work will be automated in 6 months.",
                "author": "pyroshrew"
            },
            {
                "raw_content": "It seems we are moving more towards AI assistance. So if this improves efficiency 30%, company will use 30% fewer people. Or if they keep people, you will be asked to do 30% more because you have AI assistance/tools. Imagine a utopia where AI improved your productivity by just 20% so you could keep your same pay but work a 4-day work week. A person can dream…",
                "author": "chatrep"
            },
            {
                "raw_content": "We're almost there But not quite yet But just watch out Next year, I bet Burma-Shave",
                "author": "bucolucas"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Grok 4 and Grok 4 Code benchmark results leaked",
        "score": 307,
        "text_content": "https://x.com/legit_api/status/1941165728708874514",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/y6ww4y4uvvaf1.jpeg?width=1290&format=pjpg&auto=webp&s=18e863f73641c75ae480c24ad0a2331e836a98ed If Grok 4 actually got 45% on Humanity’s Last Exam, which is a whopping 24% more than the previous best model, Gemini 2.5 Pro, then that is extremely impressive. I hope this turns out to be true because it will seriously light a fire under the asses of all the other AI companies which means more releases for us. Wonder if GPT-5 will blow this out of the water, though…",
                "author": "MassiveWasabi"
            },
            {
                "raw_content": "Rest of it seems mostly plausible but the HLE score seems abnormally high to me. I believe the SOTA is around 20 %, and HLE is a lot of really obscure information retrieval. I thought it would be relatively difficult to scale the score for something like that.",
                "author": "djm07231"
            },
            {
                "raw_content": "If these turn out to be true, that is truly impressive",
                "author": "Standard-Novel-6320"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "This is why I can't take most recent research on LLM capability seriously (both of these papers came out like a week or two ago)",
        "score": 26,
        "text_content": "I think casual members of this sub has more knowledge about what the frontier LLMs are than so many of these researchers. What's most annoying is that how many of these papers get widely cited in the media as proof LLMs fail or LLMs bad when most of the research can be dismissed by choice of outdated models and/or just poor design capabilities and cherry picking. Just to be clear, the same things also applies for pro LLM papers but common people are anyway so skeptical/afraid/hate AI, they don't believe those anyway. I am especially seeing an increase in this type of articles coming out recently after the release of o3, Gemini 2.5 Pro and Claude 4. Funny thing is none of them actually highlight the limitations any casual users already know about them. The papers above: [https://arxiv.org/abs/2507.02618](https://arxiv.org/abs/2507.02618) [https://arxiv.org/abs/2506.20803](https://arxiv.org/abs/2506.20803)",
        "comments": [
            {
                "raw_content": "Publishing a paper takes a looooong time. When this research was started, those models were probably sota.",
                "author": "Forward_Yam_4013"
            },
            {
                "raw_content": "Applies less to arxiv (but there's of course a lot of trash on there) but speaks much about published AI research nowadays [from an Anthropic researcher](https://x.com/sleepinyourhat/status/1938096371871211678?t=IXgEVH-Skuio60U9bk7zTA&s=19) [A snippet from ex OpenAI Research Head](https://youtu.be/z_-nLK4Ps1Q). Basically some academic labs find a lot of progress and publish a bunch of papers, but when the researchers at the frontier labs look at them, they just think \"oh cool they rediscovered something we found years ago\". Whatever information we have as the public (which includes university research labs), it is likely sorely out of date. And then they get published to arxiv. And then it takes years to get peer reviewed.",
                "author": "FateOfMuffins"
            },
            {
                "raw_content": "At this point if you’re using GPT-3.5 in a serious research paper you have an agenda",
                "author": "Serialbedshitter2322"
            }
        ],
        "subreddit": "singularity"
    }
]