[
    {
        "post_name": "🚨 HUNDREDS of patriots just STORMED the Rockland County, NY board meeting to SHUT DOWN a Democrat bill turning it into a sanctuary county for illegals, blocking cooperation with ICE! Signs everywhere: “AMERICANS LOVE TRUMP”",
        "score": 521,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Did they actually shut anything down? ..or just peacefully stay on the sidewalks? Was Don Lemoniads there?",
                "author": "DJT4MoreYears"
            },
            {
                "raw_content": "I don't care about town boards being stormed until tar, feathers, and rope is involved.",
                "author": "CLF3"
            },
            {
                "raw_content": "Was the bill passed or not?",
                "author": "heightnoise"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "“If you needed a reason to be pissed off at your government today, about 1/3 of refugees end up becoming homeowners within 3 years of coming to the United States”",
        "score": 508,
        "text_content": "",
        "comments": [
            {
                "raw_content": "about 1/3 of refugees end up becoming homeowners within 3 years of coming to the United States” Because they get FREE MONEY from the banks and many States, and even the Federal Government to buy homes! None of this is available to Americans, ESPECIALLY White Americans!",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "I know everyone is tired of me responding to pretty much everything this way, but this is a good time to reconsider just who exactly won World War II. Because from where I'm sitting, it sure as hell wasn't us.",
                "author": "RootLevelPrivilege"
            },
            {
                "raw_content": "Only new vehicles in my small city are businesses or somalis. And no eyebrows ever raised by local officials.",
                "author": "Raziel68"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Savannah Guthrie was very harsh on President Trump during her 2020 election town hall on NBC, accusing him of peddling conspiracy theories, and much more. Trump is now mobilizing all of federal law enforcement to find her mother and bring her home.",
        "score": 414,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Savannah Guthrie, who is married to Michael Feldman. Michael Feldman is Nancy Guthrie's son-in-law. Feldman, a corporate consultant and former Democratic political aide. Michael Feldman worked in the Clinton-Gore administration from 1993 to 2001. Bill and Hillary Clinton are scheduled to testify before the House Oversight Committee in mid-February 2026 as part of its investigation into Jeffrey Epstein. The investigation focuses on Epstein’s criminal network and whether powerful figures, including the Clintons, had knowledge of or connections to his criminal activities.",
                "author": "BOHICA2021"
            },
            {
                "raw_content": "How soon after she gets her mom back until she goes back to trashing Trump?",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "If one of our mothers were kidnapped, not even 1% of this would happen. Fuck this bitch, and fuck her mother too for birthing out a communist swine whore.",
                "author": "Donger-Lord"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Exclusive | White House instructs DOT, CDC to cut $1.5B in ‘woke,’ green grants for Dem states",
        "score": 282,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Skip ahead 5 days: Bathhouse Barry appointed commie judge rules the executive branch isn't permitted to make executive decisions.",
                "author": "Ricky_CIA"
            },
            {
                "raw_content": "MORE",
                "author": "MikeTruk"
            },
            {
                "raw_content": "we still have woke grants?!",
                "author": "The_Emperor"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "It didn’t just change so dramatically on its own… and only one man can take credit for this 😎",
        "score": 790,
        "text_content": "",
        "comments": [
            {
                "raw_content": "1. Trump issues the order to make narcan more easily available. 2. Trump cuts border crossings way down. Common sense.",
                "author": "thin_panes"
            },
            {
                "raw_content": "Is 2025 on this chart? Don't mean to be a hater, but doesn't this put the big drop off occurring in the final year of Biden?",
                "author": "KnoxHarrington"
            },
            {
                "raw_content": "Philly is so much better I can't tell you. Night and day.",
                "author": "CleanUpPhillyTrump24"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "When is he going to jail?",
        "score": 706,
        "text_content": "",
        "comments": [
            {
                "raw_content": "he's not",
                "author": "Raetchel"
            },
            {
                "raw_content": "none of them are going to jail. Not a single one will ever see a day, they've all got to live literally their entire lives being degenerates and will never face consequences like us peasants.",
                "author": "Twitter"
            },
            {
                "raw_content": "Israel called and said to stop noticing.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Today, the head of a major Soros-backed NGO came to the Senate to testify. My message was simple: Calling us \"racist\" doesn't work anymore. We're going to accelerate mass deportations.",
        "score": 669,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Weissman should get his nose out of our nation's business.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": ">\"If I had my way...\" How many times have we heard that one? Tough talk is still just talk. If I had *my* way, Congress would be sucked into the bowels of the Earth and hard-working Americans could get a fresh start without all these lying, grandstanding, thieving grifters.",
                "author": "I_Love_45-70_Gov"
            },
            {
                "raw_content": "RAAAAAAAAAAAACIST! Look around, Nobody cares!",
                "author": "ChyNahAzzWhole1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "pedophilee",
        "score": 846,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why is this fucking shit redacted fucking scuzzbag criminals",
                "author": "Justlooking250"
            },
            {
                "raw_content": "[Rainer Wolfcastle: Now my Woody Allen impression..\"I'm a neurotic nerd who likes to sleep with little girls.\"](https://m.youtube.com/watch?v=eFJhC__qu5I) Woody Allen: Hey, that really sucked! Rainer Wolfcastle: *Throws a grenade at Woody, his glasses seen flying off during the explosion* Back when The Simpsons was funny.",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "how do people get so into fucking kids that they can casually talk about it, have conventions, and \"lol\" about it, and these people are rich powerful elites that are \"important\"?! how did it get this far? how come we're not waffle stomping them right NOW?",
                "author": "Covidrrhea"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "'I was just laid off by The Washington Post in the middle of a warzone,' No refunds loser",
        "score": 818,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lear to code!",
                "author": "KekistanPM"
            },
            {
                "raw_content": "Send her to a brothel near the front lines",
                "author": "Alpha_Lemming"
            },
            {
                "raw_content": "Can’t take any middle aged lady with a nose ring seriously.",
                "author": "magamagamaga123"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨OPERATION METRO SURGE Thanks to the brave men and women of ICE, 4,000+ criminal illegal aliens have been removed from Minnesota, including murderers, rapists, gang members, and terrorists.",
        "score": 1321,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good but according to the government data from last year there's still 90-110k left in Minnesota. MAYBE \"only\" 70k if we are to believe the voluntary departures data. It's unacceptable that only violent felons are being targeted. I am not going to continue paying taxes to a system that is trying to replace me. I've already talked to my family. If the border is ever opened again I'd rather file $0 than pay for my own replacement. I'll set aside money for them to do with as they want but I'll never again pay for a Mayorkas system.",
                "author": "HorrorGameDev"
            },
            {
                "raw_content": "Cool, what about the rest of the illegals?",
                "author": "DingleBalls"
            },
            {
                "raw_content": "The BBB cost taxpayers trillions, and this is the best they could do?",
                "author": "Modernturnkey"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "NBC's Savannah Guthrie suggests her mother is now being held for RANSOM in a gut-wrenching video “We need to know without a doubt that she is alive, and that you have her.\" \"We want to hear from you, and we are ready to listen. Please, reach out to us.”",
        "score": 736,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why are they pushing this so hard? It’s been the topic on every news station. What are we missing here?",
                "author": "Nolagirl99"
            },
            {
                "raw_content": "For any newfags this *creature* gleefully attacked GEOTUS during a 2020 campaign town hall when Biden was too out of it to debate the president. She denied the existence of the global pedo cult and looked like a fucking vampire as she did it. I have no idea what is going on with the mother but given these people literally worship demons (we’ve got them on video) it can’t be anything good.",
                "author": "asdrubael_was_right"
            },
            {
                "raw_content": "Our Patriot mom Tina Peters is being held for ransom. Forgive me if i don’t shed a tear.",
                "author": "ConfederateSon"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Self-inflicted",
        "score": 1141,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Another tragic suicide by DIE.",
                "author": "LegendFang"
            },
            {
                "raw_content": "Communism dies in sunlight.",
                "author": "TDAF"
            },
            {
                "raw_content": "Activate gloating",
                "author": "Calumet57"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "House Judiciary Committee: UK Police Arrest Non-UK Comedian For Online Speech After He Arrives in London From USA. Here is his testimony.",
        "score": 784,
        "text_content": "",
        "comments": [
            {
                "raw_content": "United States need to put Great Britain into a travel advisory or a travel ban because it not safe for Americans to be there It simply not safe for the average American to go there. I believe they are actively trying to arrest an American to start an international instance.",
                "author": "DT170x"
            },
            {
                "raw_content": "He created the sitcoms Black Books, Father Ted and The IT Crowd, for those unfamiliar with his work. All worth a watch.",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "Act of war. Hostages. Mass sanctions in response.",
                "author": "IForgotToAddAnEmail"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Judge blocks federal agents from using tear gas, crowd control munitions on agitators at Portland ICE facility. The 22-page ruling comes as violent attacks on the ICE facility have increased in recent weeks, including a multi-hour siege of the building on Sunday.",
        "score": 960,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# IGNORE This judge has no right to rule here",
                "author": "DingleBalls"
            },
            {
                "raw_content": "Sweet. Live munitions it is.",
                "author": "glow-operator-2-0"
            },
            {
                "raw_content": "Judge must be very comfortable at home.",
                "author": "Skogin"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "SNAP no longer subsidizes buying junk food, and now the price of junk food is dropping. Could you imagine if we applied this principle to college? Or healthcare?",
        "score": 1894,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Or housing.",
                "author": "Tim_Berframer"
            },
            {
                "raw_content": "a reminder that they're charging so much because they CAN, not because they need to. many prices have become far too uncoupled from their production/landed costs.",
                "author": "1080pleb"
            },
            {
                "raw_content": "Still not consuming that unhealthy communist crap, even if they give it away.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "People are sharing disingenuous clips of JD Vance talking about a “NEW WORLD ORDER”, BUT...",
        "score": 742,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Also I would like to point out the hypocrisy of the retard left sharing this clip, who less than two years ago all the way to decades behind called anyone talking about the NWO hillbilly rednecks from the moment of its inception.",
                "author": "darkmodeforgotpass"
            },
            {
                "raw_content": "If I have a dollar for each time that the media lied. I can pay off the national debt and have a few trillion to spend.",
                "author": "DT170x"
            },
            {
                "raw_content": "Vivek Ramaswamy. H1B",
                "author": "darkmodeforgotpass"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The cognitive dissonance of the Left",
        "score": 1384,
        "text_content": "",
        "comments": [
            {
                "raw_content": "As an aside, I thought that this character was hot and was pissed when they made her into a dyke.",
                "author": "Philhelm"
            },
            {
                "raw_content": "Communist don't care about their own hypocrisy. They just want their opposition dead. They'll say anything if it helps them towards that goal.",
                "author": "seeling0"
            },
            {
                "raw_content": "This is the cunt who said she was glad her mom killed her pre-born older sister so she could have a better life. Because you know, it would have been impossible for someone as poor as Uma Thurman to provide a decent life to two kids.",
                "author": "ThisTrainHasNoBrakes"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"ICE DEATH CARDS\" - The left is not well...",
        "score": 586,
        "text_content": "",
        "comments": [
            {
                "raw_content": "jussie smollet vibes",
                "author": "Bornhere"
            },
            {
                "raw_content": "Wow that totally would not be easy to fake",
                "author": "Wrexxis780"
            },
            {
                "raw_content": "I hope they’re real. Keep twisting the knife.",
                "author": "StickyFingersBernie"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Hello, Mrs. Clinton",
        "score": 1040,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Data Republican is not suicidal or experiencing any know medical conditions",
                "author": "TerryBibble"
            },
            {
                "raw_content": "$20 million for travel…!?! I didn’t know Bill went to Epstein Island THAT many times…",
                "author": "CharlieMike"
            },
            {
                "raw_content": "Am I reading that right? ~100 million for salaries, benefits and pensions?! So 60% of the funding didn’t actually go to charity work?",
                "author": "Skywise"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Los Angeles Law Enforcement officials announced the results of their week-long sex trafficking crackdown titled Operation Reclaim & Rebuild: 156 adults rescued, 14 children rescued, 71 suspected traffickers arrested, 328 sex buyers arrested, 16 non-human trafficking sex offences, 611 total arrests.",
        "score": 879,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Non-human? Do I want to know? Still, good, get those bastards off the street and out of civics society or what’s left of it in LA",
                "author": "DeplorableNeandertal"
            },
            {
                "raw_content": "Olympics is coming that’s why Soccer Cup too whatever it’s called",
                "author": "Obambi"
            },
            {
                "raw_content": "What did they casually walk down skid row on their lunch break one day?",
                "author": "T_WIN_2020"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Steam Hardware: Launch timing and other FAQs [pricing and launch date delayed]",
        "score": 133,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I just want the controller :(",
                "author": "PXLShoot3r"
            },
            {
                "raw_content": "1080p upscale to 4k using older FSR is going to be rough.",
                "author": "max1001"
            },
            {
                "raw_content": "> ...In the meantime, we are working on HDMI VRR, investigating improved upscaling... Oof, I was definitely hoping to have something much more concrete on both VRR and supported FSR version by now. I don't like the sound of \"working on\" and \"investigating\" this close to the supposed release.",
                "author": "starburstases"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Banks seek out new buyers for Oracle data centre loans",
        "score": 264,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hope Larry Ellison goes bankrupt",
                "author": "puffz0r"
            },
            {
                "raw_content": "Cannot wait to see the demise of both Oracle and OpenAI from the bubble bust.",
                "author": "1mVeryH4ppy"
            },
            {
                "raw_content": "Good luck I used to work in tech we considered oracle to be the most expensive pos systems we had to manage lol",
                "author": "dropthemagic"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "PS5 shipments top 92.2 million",
        "score": 35,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is the Ps5 no games meme still valid? coz I bought a series X and collecting dust since I have a gaming PC and with MS going the gamepass route with everything available on PC im wondering what is the unique proposition for getting the PS5 when one owns a proper gaming rig already",
                "author": "WD40ContactCleaner"
            },
            {
                "raw_content": "TBH it's pretty much expected, it's tracking to be around just the same as PS4, but not close enough to match their best PS2, which was over 2 decades ago, it's the Switch 1 that is likely to reach that number of sales. Which exactly shows to us that there is no sign of growth of their userbase, but rather stagnating unlike PC platform if you look at Steam Survey it's been growing at a very rapid pace ever since a decade ago.",
                "author": "ShadowRomeo"
            },
            {
                "raw_content": "132M active monthly users 40m ps4. For many wondering why there wasnt such a huge leap in graphics. Well and that series s",
                "author": "NeroClaudius199907"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "\"Intel Foundry Advances Chip Power Delivery with Next-Generation Capacitor Technology\"",
        "score": 25,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"Intel Foundry researchers demonstrated three promising metal-insulator-metal (MIM) materials delivering intrinsic capacitance density up to 98 femtofarads per square micrometer (fF/μm²), which is significantly higher than the 37 fF/um² intrinsic capacitance density of the material option used in state-of-the-art technology\" can someone explain in laymen's terms how this benefits Intel CPUs or GPUs?",
                "author": "Loose_Skill6641"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "China's memory makers abandon low-price strategy: DRAM, NAND near Korean levels",
        "score": 397,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Well no shit, they weren't going to opt to make less money.",
                "author": "jenny_905"
            },
            {
                "raw_content": "Predictable. I hope the use profits to add more capacity to get us to cheap era again.",
                "author": "Current_Finding_4066"
            },
            {
                "raw_content": "The additional production capacity is much more important overall.",
                "author": "iDontSeedMyTorrents"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Positron opts for laptop RAM over HBM to take on Nvidia",
        "score": 16,
        "text_content": "",
        "comments": [
            {
                "raw_content": "An AI accelerator with LPDDR? Daring today, aren't we?",
                "author": "VastTension6022"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD CEO downplays PC memory crunch, saying 'our focus areas are enterprise' — company wants to focus on growing 'higher-end of the market'",
        "score": 123,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Cool, don't cry when AI crashes and burns and a huge percent of the business PC sector got used to stretching refresh timelines and home users found new hobbies and stopped caring about PCs.",
                "author": "Sh1rvallah"
            },
            {
                "raw_content": "AMD's Q4 results currently tanking the market and triggering the AI bubble pop could fix the memory crunch real quick.",
                "author": "SkillYourself"
            },
            {
                "raw_content": "This is not really a shock. Nvidia became the most valuable company in the world, worth over $4.5 trillion. They did not do that because of consumer level products. AMD is a publicly traded company; they are going to chase AI, even though the bust is coming. We are not their friends, only profit is.",
                "author": "0riginal-Syn"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Digital Foundry] DLSS 4.5 \"Preset L\" Tested: How Good Can a 4K Upscale from 720p Look?",
        "score": 93,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The whole discussion surrounding DLSS4/4.5 and it's presets depend on your HW. There are a lot of permutations to account for depending on the kind of experience you want, perf vs visual quality. Testing done was all done on a 3070. Preset L has minor uplifts when comparing to preset M at the same scaling factor of performance (4x) mostly seen in vegetation/trees and trades it with a minor performance hit compared to M. With the same scaling factor we see that preset K has more performance than preset L. 'Ultra performance' a scaling factor of 9x offsets this costs and is why it is recommended by Nvidia. If we compare 'ultra performance' preset L to 'performance' preset K, L yields better performance in FPS. What is interesting from Alex's findings is that there seems to be a problem with preset M and L with a game's internal denoiser. In the past Alex noted that preset K can handle noise in RT reflections better than M, being more stable. If you disabled a game's denoiser it is a night and day difference to the visual quality. I do wish Alex did a side by side with preset L 'ultra performance' with preset K 'performance'. As he noted, offsetting the cost of preset L with a lower input resolution can beat out in FPS with preset K in performance. What you miss out on preset L 'ultra performance' vs 'performance' is simply the level of detail retrieval due to the lower input res, but you still gain the level of stability from preset M and L's strengths. Oh and as for 1440p, well don't even think about 'ultra performance' give 'performance' a go depending how you value visual quality and performance uplift.",
                "author": "Noble00_"
            },
            {
                "raw_content": "Another example to add to the \"Most gamers have no visual cortex\" file. People were frothing at the mouth raving about preset L, taking it as personal insult that DF tested M first. Turns out it's just slightly better and slightly more expensive. The majority of gamers are perfectly happy with poor graphical and image quality — as long as you don't tell them about it. So many people can't tell the difference between RT on and off, used fsr 2, got tricked by 'lossless' scaling's name and thought it was better than DLSS, or glazed KCD2's performance, happy to play at medium settings as long as they got to press the button that said ultra. Anyway, I think the most interesting part of the video is that base DLSS is a actually a great denoiser. If devs don't/can't add ray reconstruction, maybe they could just have a setting to disable denoising when upscaling is used.",
                "author": "VastTension6022"
            },
            {
                "raw_content": "Pretty fucking good... Enough for me to only be satisfied with Balanced or above with XeSS 2 on the a770 I have in right now. DLSS really has spoiled me",
                "author": "Lord_Muddbutter"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Digital Foundry] Another Panther Lake milestone: Better-than-Series S performance in Alan Wake 2",
        "score": 82,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The headline alone downplays the feat somewhat, better fps than Series S while running PS5 equivalent settings. The Series S uses lower than low settings that can't be found in the PC version.",
                "author": "Siats"
            },
            {
                "raw_content": "Impressive result from the B390. Makes me more excited for panther lake handhelds.",
                "author": "Rollingplasma4"
            },
            {
                "raw_content": "If Nova Lake is indeed 20% faster than this than that'd put Nova Lake functionally as performant in games as a PS5 if you consider its upscaler advantage.",
                "author": "pomyuo"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Only Controller Im Willing To Spend 90$ On",
        "score": 643,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It’s a nice controller. 👍",
                "author": "icy1007"
            },
            {
                "raw_content": "never owned a pro during switch1, always thought joy cons were enough. got pro controller for switch2, and it’s so good.",
                "author": "rsred"
            },
            {
                "raw_content": "Already have a Switch 1 Pro Controller, if I didn't had one, I'd buy the Switch 2 Pro But I can't justify buying one then my S1 Pros are already great.",
                "author": "Thaldrath"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Hollow Knight - Nintendo Switch 2 Edition PEGI rating has now surfaced. According to site, the release date is today!",
        "score": 90,
        "text_content": "According to the official PEGI site, the release date is today, February 5, 2026. It seems that it will be featured in today's Nintendo Direct: Partner showcase, and then probably be shadow dropped. https://pegi.info/search-pegi?q=Hollow+Knight",
        "comments": [
            {
                "raw_content": "No way PEGI spoiled it. I don't remember that happening with most other shadow drops.",
                "author": "Caciulacdlac"
            },
            {
                "raw_content": "Hot dayum I'm in",
                "author": "gandalftheokay"
            },
            {
                "raw_content": "Well, that’s 1 game for the showcase today",
                "author": "FluidFeed3059"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Metroid Prime 4: Beyond has sold over 1 million copies, Nintendo confirms",
        "score": 388,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is one of those times when I remind myself even a major iconic series likeFinal Fantasy XVI didn’t even crack 4 million and selling 1 million is still fine. I’m midway through MP4 now. It has issues but I like it and it’s really got good art direction.",
                "author": "junglespycamp"
            },
            {
                "raw_content": "That's... actually pretty good for 2 months. At least for something more niche like this.",
                "author": "Crafty_Boy70"
            },
            {
                "raw_content": "Pretty sure the game was in the top 5 for a few weeks in eShop for a little while. Maybe even Top 1. Among Amazon best selling video games too. I wouldn't be surprised if total sales were somewhere above 1.5M, which is good for a Prime game.",
                "author": "Medd-"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Overwatch 2 Is Ditching the '2' Amid Launch of 'New, Story-Driven Era' With 10 New Heroes and Switch 2 Edition",
        "score": 233,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Might be in the minority but F2P switch 2 edition of OW with a sick story mode is something I can see myself enjoying. Too old for competitive FPS, but I can see myself enjoying a story mode in the universe",
                "author": "ChemG8r"
            },
            {
                "raw_content": "The r34 of Overwatch has gone through more improvements and updates than Overwatch 2 did to be fair",
                "author": "Jpgamerguy90"
            },
            {
                "raw_content": "Wow. It's almost like \"Overwatch 2\" was never actually a sequel to begin with. Almost like they just called it that so they could make the game F2P and squeeze more money out of people who already bought the game by putting in a billion micro transactions and gutting half of its content and then slowly adding it back in over several years. Hey, at least they're dropping the pretense for the 20 guys left who haven't moved on to Marvel Rivals.",
                "author": "Octopus_Crime"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Switch 2 is the No. 1 selling console 2025, the first console to do so in its launch year in 21st century",
        "score": 91,
        "text_content": "PS5 2025: 17.20m Switch 2 2025: 17.37m",
        "comments": [
            {
                "raw_content": "And that’s with only 6 months, mind you.",
                "author": "ApprehensiveLuck4029"
            },
            {
                "raw_content": "I keep seeing these posts… What do we do with this information?",
                "author": "AlbertVibestein"
            },
            {
                "raw_content": "Xbox and Playstation always release in Novemeber, so this is not surprising.",
                "author": "Organic-Storm-4448"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Me when the partner direct opens with GTA VI footage",
        "score": 407,
        "text_content": "(i’m delusional)",
        "comments": [
            {
                "raw_content": ">(i’m delusional) Body text checks out.",
                "author": "StockHumor4768"
            },
            {
                "raw_content": "![gif](giphy|slMXlKFepqNcfb8eQF)",
                "author": "Ok-Confusion-202"
            },
            {
                "raw_content": "I wouldn’t be surprised if they showed GTA V. One last hurrah for that game before 6 comes out",
                "author": "w1ckizer"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo Direct: Partner Showcase 2.5.2026",
        "score": 1082,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Reasonably likely wishlist: Clair Obscur Expedition 33 Metaphor Rebirth Disco Elysium Switch 2 port/Zero Parades Silent Hill 2 Remake Cope wishlist/don't think is reasonably possible on Switch 2 but would be cool: Alan Wake 2 Tekken 8 Metal Gear Solid 3 Delta Pathologic 2/3 ports Fear and Hunger console ports",
                "author": "Longjumping-Style730"
            },
            {
                "raw_content": "Copy/paste what I wrote when this first started being rumored last week: I think Nintendo really wants third parties to be a bigger focus of Switch 2 to show that games can sell there, or that the console can handle these types of games. Wouldn't surprise if they do more Partner Showcases than during the Switch 1's time. I am okay with this as it's my main game console.",
                "author": "Mikey-Insanity"
            },
            {
                "raw_content": "Duskbloods, let's go.",
                "author": "PaiDuck"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Final Fantasy VII Remake Part 3 May Launch Multiplatform, Day One on Switch 2",
        "score": 193,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Saw \"May Launch\" and got excited...",
                "author": "Working_Prune_512"
            },
            {
                "raw_content": "for those who haven’t seen his full video, this is just a guess Nate is making, it’s not something he’s said he heard from a source.",
                "author": "hermes7920"
            },
            {
                "raw_content": "This is just based off some dude’s prediction, not from any kind of leak or valid source.",
                "author": "CrimsonGear80"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "❄️Discussion, News, and Request Thread - Week Beginning 02/02/26❄️",
        "score": 40,
        "text_content": "[sadE](https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQi5Y-c-dZeEqOLsAPuE31ZwfXiNRWtYzotM7qfo3ZuiL4nneOrvvKX&s=10) Discussion threads are your weekly central hub for all requests, gaming news, and any other gaming topics you want to talk about. *Please keep all content that doesn't need it's own post to this thread to de-clutter the sub for proper leaks and rumors. Thanks!* **Join our new companion sub for super secret Resident EVIL 9 and Half-Life 3 leaks**\\-- [r/OkBuddyGLAR](https://new.reddit.com/r/OkBuddyGLAR/) Hot Threads of the past week: * [Rockstar North, Sam Houser, and Leslie Benzies are mentioned in the infamous list E- files. Specifically the \"witness list\"](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1qrlsgz/rockstar_north_sam_houser_and_leslie_benzies_are/) * [Assassin's Creed Invictus Leak (multiplayer)](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1qqarle/assassins_creed_invictus_leak_multiplayer/) * [Caitlin Thorburn just updated her Spotlight page to say she worked on a Xenoblade game coming out in 2026](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1qvb7f9/caitlin_thorburn_just_updated_her_spotlight_page/) * [YouTube could launch on Switch 2 this month](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1qt0gi7/youtube_could_launch_on_switch_2_this_month/) * [Sony is releasing a new PlayStation Portal OLED model this year](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1qqxlml/keplerl2_sony_is_releasing_a_new_playstation/) # [Want to help us improve this subreddit? Provide us with feedback here](https://forms.gle/w9JaYTjVN1Zie9e39) # [Click here to join the discord to enjoy further conversations with the community!](https://discord.gg/6jdBvCSqbj)",
        "comments": [
            {
                "raw_content": "14:27 TeaTime",
                "author": "ThatLaggyAustralian"
            },
            {
                "raw_content": "Where’s Sony Santa Monica new game?",
                "author": "MTH1138"
            },
            {
                "raw_content": "Where is the Silent hill townfall information I think it was rumored to release on March",
                "author": "Objective_Love_6843"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Persona 4 Revival has received an updated trademark with a publication date of February 24th. Possible Switch 2 announcement at tomorrow's direct?",
        "score": 334,
        "text_content": "[https://xcancel.com/mikeodysseyyt/status/2019219703336677402?s=46](https://xcancel.com/mikeodysseyyt/status/2019219703336677402?s=46)",
        "comments": [
            {
                "raw_content": "Wouldn't be surprised to see both this and Metaphor tomorrow",
                "author": "robertman21"
            },
            {
                "raw_content": "I would not be suprised if that's the cause.",
                "author": "RoleRemarkable9241"
            },
            {
                "raw_content": "What?? So soon? I thought it was coming next year",
                "author": "Suli_Croft"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[PEGI] Hollow Knight: Nintendo Switch 2 Edition launches today?!",
        "score": 123,
        "text_content": "In the middle of the noon, PEGI Rating Board decides to rating Hollow Knight: Nintendo Switch 2 Edition, and for surprise, it will launch today for the console. It almost certain is going to be a Shadowdrop on the Direct. The question is, this is the Killer Shadowdrop that SwitchForce said? Source: [https://nintendoeverything.com/hollow-knight-nintendo-switch-2-edition-announced/](https://nintendoeverything.com/hollow-knight-nintendo-switch-2-edition-announced/)",
        "comments": [
            {
                "raw_content": "That’s a good shadow drop, but that is by no means a killer shadow drop, if this is what he was referring to",
                "author": "SuicideSkwad"
            },
            {
                "raw_content": "all that but still no update on silksong bruh",
                "author": "Cursed_69420"
            },
            {
                "raw_content": "A killer Shadow Drop would be Elden Ring Tarnished Edition.",
                "author": "TerminatorJ"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Overwatch Spotlight fully leaked by IGN",
        "score": 607,
        "text_content": "https://www.ign.com/articles/overwatch-2-is-ditching-the-2-amid-launch-of-new-story-driven-era-with-10-new-heroes",
        "comments": [
            {
                "raw_content": "Page taken down already. Anybody manage to get a snapshot?",
                "author": "Jafin89"
            },
            {
                "raw_content": "the jetpack cat confirmed. 🫡",
                "author": "Limlimity"
            },
            {
                "raw_content": "A really bad day for someone at IGN",
                "author": "Betty_Freidan"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Nintendo Direct Partner Showcase confirmed for Feb 5th, 6 AM PT",
        "score": 764,
        "text_content": "> **A new #NintendoDirect Partner Showcase livestream is on the way! Tune in tomorrow, Feb 5, at 6am PT for roughly 30 minutes of upcoming Nintendo Switch 2 and Nintendo Switch games.** https://xcancel.com/NintendoAmerica/status/2019048301518115090 https://www.nintendo.today/en-US/contents/56c40c3f-5e4b-45ce-9fe6-ff9ca88a4e3e Previous rumours: [Attack The Backlog hints at early February (Feb 5th) Nintendo Direct](https://reddit.com/r/GamingLeaksAndRumours/comments/1qig5m3/attack_the_backlog_hints_at_early_february_feb/) [NatetheHate: \"The first Nintendo Direct of the year will be on the first week of February\"](https://old.reddit.com/r/GamingLeaksAndRumours/comments/1qnigei/natethehate_the_first_nintendo_direct_of_the_year/) [Andre from Gamexplain has heard that the Direct next week may be a Partner's Showcase](https://reddit.com/r/GamingLeaksAndRumours/comments/1qqiqn4/andre_from_gamexplain_has_heard_that_the_direct/)",
        "comments": [
            {
                "raw_content": "There are only two sources I trust for Nintendo stuff. What Nate says and the opposite of what Arlo predict.",
                "author": "T_Wayfarer_T"
            },
            {
                "raw_content": "Ace Attorney 7 cope injected into my veins Save Data was invited to a Capcom event and choose to believe it was for Ace Attorney",
                "author": "Various_Traffic_2908"
            },
            {
                "raw_content": "Does anyone know the length of the presentation? EDIT: It's 30 mins!",
                "author": "Tired_Gamer"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "SwitchForce teases a \"killer shadow drop\" for the Partner Direct",
        "score": 327,
        "text_content": "https://xcancel.com/TheSwitchForce/status/2019095275927953833 it's a vague statement so take it with an extreme grain of salt but \"killer\" makes it seem like it's either a notable game that releases immediately or \"killer\" is a hint as to what the game is (like Killer Instinct or something)",
        "comments": [
            {
                "raw_content": "Killer 7 NSO lol",
                "author": "Iucidium"
            },
            {
                "raw_content": "Very weird timeline we are in where SwitchForce is now a credible leaker",
                "author": "myretrospirit"
            },
            {
                "raw_content": "Half Life REMλKE (developed by Capcom)",
                "author": "oilfloatsinwater"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "NateTheHate states that Final Fantasy VII Rebirth will be shown at the Nintendo Direct Partner Showcase tomorrow, possibly with a Summer release date",
        "score": 469,
        "text_content": "[Source is 55:20 in his new podcast episode](https://youtu.be/H8B7axb3JMY?si=ZSXhxNPlhuN_9PLa&t=3323) [Previous Rumour](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1qozp7y/final_fantasy_vii_rebirth_allegedly_headed_to/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Rebirth is the one I'm much more interested in double dipping on. The battle system might be like Square's best real-time action RPG integration since KH2. Being able to parry by default and all the Chrono Trigger dual tech shit with Synergy made even menial encounters in the overworld so fucking cool",
                "author": "MyMouthisCancerous"
            },
            {
                "raw_content": "wow they're really not waiting makes me wonder if Part 3 truly does release in January/February to coincide with the 30 year anniversary seems like they want Switch users to catch up fast",
                "author": "KMoosetoe"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Diablo IV \"Lord of Hatred\" second new class leaked",
        "score": 137,
        "text_content": "[https://www.reddit.com/r/diablo4/comments/1qvd6fq/confirmed\\_my\\_post\\_about\\_2nd\\_class\\_name\\_and\\_art\\_26/](https://www.reddit.com/r/diablo4/comments/1qvd6fq/confirmed_my_post_about_2nd_class_name_and_art_26/) >![Warlock](https://www.reddit.com/media?url=https%3A%2F%2Fpreview.redd.it%2Fconfirmed-my-post-about-2nd-class-name-and-art-2-6-ptr-v0-gywxe2jiaehg1.png%3Fwidth%3D640%26crop%3Dsmart%26auto%3Dwebp%26s%3D0fd0102d5a571f9fee78b34caae3901b45fc4fe4)!< >!2DUI\\_Expansion2\\_Info\\_Page\\_01\\_WarlockUpdate\\_0!<",
        "comments": [
            {
                "raw_content": "Yeah, this was the most likely option. My guess is you'll be able to build into some melee-ranged-caster hybrid and some kind of demon summoning.",
                "author": "maxlaav"
            },
            {
                "raw_content": "I will always say this, Blizzard's art and cinematic team rarely misses.",
                "author": "OwnAHole"
            },
            {
                "raw_content": "Warlock is exciting! TBH, the artwork looks more like a Blood Knight, but I would prefer a Warlock.",
                "author": "AtaxicHistorian"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Poker Night at the Inventory is confirmed to be being rereleasing. This time on Steam, Switch and PS4.",
        "score": 261,
        "text_content": "Trailer: [https://www.youtube.com/watch?v=RoXKhwb18MY](https://www.youtube.com/watch?v=RoXKhwb18MY) Previous rumor/leak: [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1p22kln/an\\_update\\_to\\_team\\_fortress\\_2s\\_item\\_schema/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1p22kln/an_update_to_team_fortress_2s_item_schema/)",
        "comments": [
            {
                "raw_content": "Also the exclusives TF2 items are back with the steam version",
                "author": "nicksuperdx"
            },
            {
                "raw_content": "Second one seems inevitable and I’d love to see a third one down the line too",
                "author": "Johnhancock1777"
            },
            {
                "raw_content": "LETS FUCKING GOOOOo! Now give us the sequel please!",
                "author": "NaitDraik"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel CPUs Record First Period of Growth on Steam Survey After Months of Decline",
        "score": 52,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If PTL’s x7 and x9 chips end up being widely sold at mainstream prices then I suspect Intel will shoot up a fair bit. Right now they don’t seem to have a good value proposition which is a big problem for them, but in six months or a year… we’ll see",
                "author": "grumble11"
            },
            {
                "raw_content": "My guess is it's due to LGA 1700 CPUs suddenly becoming a great value in this current market due to their DDR4 support.",
                "author": "KasanesTetos"
            },
            {
                "raw_content": "And ARC B580 selling as donughts tbh great GPU",
                "author": "dsinsti"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel confirms Xe3p-LPG graphics architecture for Core Ultra 400 \"Nova Lake-P\" - VideoCardz.com",
        "score": 36,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Meanwhile Medusa Point will be reusing RDNA3.5 with a _reduction_ in CU count this year (if it even comes out before end of 2026)",
                "author": "996forever"
            },
            {
                "raw_content": "At this point, why are they still have split client architectures in LPG and HPG",
                "author": "ResponsibleJudge3172"
            },
            {
                "raw_content": "Hoping Nova Lake standardizes and enforces HDMI 2.1 FRL48G for the platform.",
                "author": "arandomguy111"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Homeownership Rate Inches Up to 65.7%",
        "score": 46,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This chart makes every argument we can make with words. It settles every dispute. And it tracks back to the early 1990’s, before Clinton-era policies enabled more home ownership. Nothing else to add.",
                "author": "Nuvuser2025"
            },
            {
                "raw_content": "The latest homeownership rate rose to 65.7% in the last quarter of 2025, according to the Census’s Housing Vacancy Survey (HVS). While this was a modest quarterly increase, the broader picture continues to reflect significant affordability challenges. With mortgage interest rates remaining elevated, and housing supply still tight, housing affordability is at a multidecade low. Compared to the peak of 69.2% in 2004, the homeownership rate is currently 3.5 percentage points lower and remains below the 25-year average rate of 66.3%. It is also important to note that the fourth quarter’s data comes with a higher level of uncertainty. Due to the government shutdown, the Census only collected data for the last two months of 2025. **Compared to the previous year, homeownership rates increased in only two age groups. Among younger households, the homeownership rate for those under 35 increased 1.6 percentage points to 37.9% in the last quarter of 2025. This age group is particularly sensitive to mortgage rates and the inventory of entry-level homes.** Homeownership rates for householders ages 55-64 inched up by 0.4 percentage points over the same time. In contrast, several middle-aged and older groups saw declines. Householders ages 45-54 experienced the largest drop, declining 1.5 percentage points from 71.0% to 69.5%. The 35-44 age group saw a 0.5 percentage point decrease, decreasing from 61.4% to 60.9%. Homeownership rates for householders aged 65 years and over declined 0.5 percentage points from a year ago. https://fred.stlouisfed.org/series/RHORUSQ156N",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Trump’s Housing Dilemma: Protecting Homeowners While Addressing Affordability",
        "score": 87,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Housing can’t both be an investment and a basic need. Those are competing interests. One has to keep going up and the other needs to be affordable.",
                "author": "Likely_a_bot"
            },
            {
                "raw_content": "There is no dilemma. We are either going to remain right where we are, or someone is going to take a loss. What I expect is, a combination of little movement, and some narrow-effect government policy to kick the can down the road. Isn’t that the M.O. for all societal problems now?",
                "author": "Nuvuser2025"
            },
            {
                "raw_content": "Trump doesn't have a dilemma, he's a guy heavily invested in real estate and taking loans out on that real estate. Addressing affordability doesn't make his property worth more, and he doesn't care about anything else.",
                "author": "kvrdave"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Sam’s response to Anthropic remaining ad-free",
        "score": 764,
        "text_content": "",
        "comments": [
            {
                "raw_content": "hoho very much Microsoft-Apple feud vibes here... bitchin in public - partners in private",
                "author": "Technical_You4632"
            },
            {
                "raw_content": "Seems **Claude Ad** [Campaign](https://x.com/i/status/2019071113741906403) worked !! https://preview.redd.it/r28nad5ofjhg1.png?width=1080&format=png&auto=webp&s=721b21beba210a5d21ffca56aed3404d9d6d1c03",
                "author": "BuildwithVignesh"
            },
            {
                "raw_content": "\"I laughed, until I didn't.\"",
                "author": "LatentSpaceLeaper"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Kling 3.0 example from the official blog post",
        "score": 462,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The fact that they can cut to different camera angles and maintain believable subject consistency like that is blowing my mind The biggest negative that jumps out at me is the audio quality. Sounds like it was recorded with a sheet of aluminum covering the microphone, though that's been a common issue with many video models. Still, I'm impressed",
                "author": "astrologicrat"
            },
            {
                "raw_content": "ngl guys, I did a stint as a photographer and am a nerd for lighting/cinematography and some of these scenes, primarily the very last one, actually have genuine artistic merit and visually get under my skin on an emotional level. Like a proper late 90s asian art house movie, the colour grading and transitions and the way the highlights just start clipping at the highs to create a dreamy nostalgic feel... Didn't expect that.",
                "author": "LaCaipirinha"
            },
            {
                "raw_content": "We're close.",
                "author": "Tobxes2030"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Can we get 5.3 now",
        "score": 169,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm so over this twitter hype posting",
                "author": "spicymeatball15"
            },
            {
                "raw_content": "Seems pretty obvious it’s dropping with a Super Bowl ad",
                "author": "EmbarrassedRing7806"
            },
            {
                "raw_content": "Me seeing with my eyes: https://preview.redd.it/x8bxm1874lhg1.jpeg?width=320&format=pjpg&auto=webp&s=4cb7e923a25b4c649275b91bd025c2de2199adca",
                "author": "Relative_Issue_9111"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Anthropic declared a plan for Claude to remain ad-free",
        "score": 1170,
        "text_content": "[Blog- Claude is a space to think](https://www.anthropic.com/news/claude-is-a-space-to-think)",
        "comments": [
            {
                "raw_content": "Gemini - funded by the THE ad company ChatGPT - the largest number of free users lighting GPUs on fire instead of being used for research Claude - ad-free but you get like 1 query an hour I'm just saying if you're using these things for work, you're paying them already and *that* is ad free regardless",
                "author": "FateOfMuffins"
            },
            {
                "raw_content": "I'm not sure there's a way they could have physically thrown more shade at OpenAI here",
                "author": "RevoDS"
            },
            {
                "raw_content": "**From Source:** https://preview.redd.it/5s8ldqf29hhg1.jpeg?width=1356&format=pjpg&auto=webp&s=5c870610bf648cd0206c5d5346fc264d7e57c063",
                "author": "BuildwithVignesh"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "GPT5.2 high sets highest mark on METR 50%-time-horizon benchmark at 6.6 hours",
        "score": 181,
        "text_content": "Link to tweet: https://x.com/METR\\_Evals/status/2019169900317798857?s=20 Link to website: https://metr.org/blog/2025-03-19-measuring-ai-ability-to-complete-long-tasks/",
        "comments": [
            {
                "raw_content": "omg they actually evaluated it before 5.3 dropped but no xHigh like most benchmarks Edit: It also takes #1 in 80% at 55 min, with Gemini and Opus at 44 and 43 min",
                "author": "FateOfMuffins"
            },
            {
                "raw_content": "Doesn’t shock me at all. I like Anthropic so much as a company and I want to like Claude as much as GPT-5.2, but I just don’t. My use cases are mostly literature research, and GPT-5.2 is just noticeably better than Claude or Gemini for this. Much better at understsanding the context of the question, and MUCH more diligent in looking and looking until it really finds the right thing.",
                "author": "ObiWanCanownme"
            },
            {
                "raw_content": "Absolute beast of a model.",
                "author": "OGRITHIK"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "AI progress since 2023 is mindblowing",
        "score": 29,
        "text_content": "Hey guys, just wanted to share my thoughts on this but I'm using AI since 2023 and really, it continues to blow my mind. When ChatGPT was available for the public, I already found it crazy to have something that basically could answer you as you were talking to it in a normal way. It wasn't connected to Internet but at that time I though it was too complicated and maybe that it would need 5,6 more years of development. Several months later, you could browse the Internet with ChatGPT. It was incredible. Same thing for DALL E back in the day. The pictures were pretty sketchy but you could just generate images from the void just by prompting them. And now we have image to video or video live AI 90/95% realistic?? And during all this time, people were telling me \"bro ChatGPT makes errors, look\" or \"yeah but the pictures are too sketchy, it can't be used\". They would over focus on details while avoiding the big picture... And now we have agents?? AI is really a revolution and I swear I'm not a bot lol (kind of thing an AI would say but yk)",
        "comments": [
            {
                "raw_content": "I still have a lot of people around me making the basic mistake of assessing the AI in terms of what it is capable to do today, instead of looking at what it could be able to do with just engineering tweak/incremental progress. At the same time I have a skeptical colleague that is also level-headed and makes predictions that makes them accountable every year or so, and so far their predictions have been the most accurate of all the ones I follow closely. They are correct by about 70% I'd say, but the remaining 30% are underestimating AI progress. Often, the more optimistic ones have outlandish predictions and a smaller portions of them turn out true, and they are typically in the area where this skeptical colleague is incorrect.",
                "author": "Glxblt76"
            },
            {
                "raw_content": "yesterday Gemini was absolutely positively convinced that a certain fret on the guitar keyboard was a certain note. it wasn't, it took some convincing. so if I were completely clueless (which I almost am) I would have been tripped off by the absolute certainty of his statement A simple example but I wonder how often it happens and people don't notice",
                "author": "runciter0"
            },
            {
                "raw_content": "My biggest concern is that AI is getting good in the wrong way. It's good at looking like it works, but does it really? I can say a lot of profound and interesting things, with such confidence, that people believe me without question. But the second I say something that someone has even a scrap of actual knowledge about, it immediately falls apart. This is how I fear AI operates.",
                "author": "ArgonWilde"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Karpathy proposes \"Agentic Engineering\" as the successor to \"vibecoding\" for the future of human-AI collaboration",
        "score": 21,
        "text_content": "https://preview.redd.it/5b38dj6ffmhg1.png?width=1200&format=png&auto=webp&s=667f69fc046226ef1b2d629f4eccc3f279a96f51 Source: [https://x.com/karpathy/status/2019137879310836075](https://x.com/karpathy/status/2019137879310836075)",
        "comments": [
            {
                "raw_content": "I agree with him and hope it catches on. Planning, testing, iterative architectural refinement, UX validation, etc. are all part of agentic engineering. [The \"lump of cognition\" fallacy](https://andymasley.substack.com/p/the-lump-of-cognition-fallacy) is that just because we have new tools to augment and accelerate thinking, we no longer have to think. What really happens is that individual developers are empowered to think of all the high level concerns that go into building complex software. If you *really really* enjoy the process of writing code line by line, [you're gonna have a bad time](https://www.youtube.com/watch?v=7aUGBT1DZDI). But if you see code as a means to an end, it's an amazing time. And that process never stops, by the way. It doesn't matter if the AI becomes superintelligent - you still have to think about and articulate *what you want to do*.",
                "author": "xirzon"
            },
            {
                "raw_content": "I want to contribute what I really think it is: Codentic Agenting.",
                "author": "Illustrious_Image967"
            },
            {
                "raw_content": "Sorry, it will forever be vibe coding now",
                "author": "panic_in_the_galaxy"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Astrophysicist David Kipping on the impact of AI in Science.",
        "score": 592,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Just make an AI intelligence specialized in education that explains how the fusion engine works. It's worth pointing out that this already exists by the way. No single person knows how airplanes work. Groups of people know, but the exact knowledge of how every single subsystem works is divided among that group of people and then you have a systems engineer put the subsystems together. So super intelligence greater than human intelligence already exists it's called culture or teamwork.",
                "author": "Spare-Dingo-531"
            },
            {
                "raw_content": "I want to live in a world where everything around me is just magic",
                "author": "Agusx1211"
            },
            {
                "raw_content": "Full video - [https://www.youtube.com/watch?v=PctlBxRh0p4](https://www.youtube.com/watch?v=PctlBxRh0p4)",
                "author": "Darkmemento"
            }
        ],
        "subreddit": "singularity"
    }
]