[
    {
        "post_name": "Plane That Carried Texas Democrats to Illinois Was Funded by Beto O’Rourke’s PAC",
        "score": 670,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Say his real name!",
                "author": "GallowsTime"
            },
            {
                "raw_content": "The guy that wrote fan fiction of running over kids with a car.",
                "author": "projectarcturus1"
            },
            {
                "raw_content": "as i started reading the headline, my brain eagerly hoped it ended with \"has been shot down\"",
                "author": "Covidrrhea"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Big Balls is the hero we all need.",
        "score": 659,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We should all throw dildos onto the wnba court in his honor.",
                "author": "Viewer01"
            },
            {
                "raw_content": "Cue the AC/DC. I like big balls",
                "author": "gorilla_grip"
            },
            {
                "raw_content": "DC is a absolute warzone. Which is insane to think about because Virginia has most of the richest counties in the entire USA.",
                "author": "FBIsurveillance"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Governor Greg Abbott: The Texas Supreme Court has now ordered the runaway ring leader of the derelict Democrats, Gene Wu, to respond to my lawsuit by Friday.",
        "score": 532,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://x.com/GregAbbott_TX/status/1952937751176728732 Eugene Yuanzhi Wu (Chinese: 吳元之; pinyin: Wú Yuánzhī) is an American lawyer and politician who is a Democratic member of the Texas House of Representatives, serving since 2013. He was formerly a prosecutor for Harris County. Wu is married to Miya Shay - a reporter for ABC 13 in Houston, Texas.",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "> Gene Wu Ric Flair had a child with the bass guitar guy from KISS?",
                "author": "magnokor"
            },
            {
                "raw_content": "Two more days, then? All jokes aside, I think this exposes the amount of leniency our elected congressmen get while they commit 24 hour malfeasance.",
                "author": "TheWingedStormfag"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Texas Governor Greg Abbott officially begins process of removing the Democrat lawmakers from office who broke quorum, blocked a vote on redistricting and fled to Illinois. He's following through. Abbott has filed with the Supreme Court of Texas.",
        "score": 1674,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good. They would do the same to us. It’s time to start breaking the Democrat criminal organization",
                "author": "UCantStumpTheTrump"
            },
            {
                "raw_content": "Holy based",
                "author": "Just_a_Patriot"
            },
            {
                "raw_content": "Abbot should do a wheelie and a burnout on these democrat usurpers' faces, as punishment.",
                "author": "FREN"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Superman is joining ICE!",
        "score": 1153,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Go get 'em, chad!",
                "author": "sola_scriptura"
            },
            {
                "raw_content": "This guy was a jock when he was younger my friend worked with him, he has matured into a good man.",
                "author": "shadypollster"
            },
            {
                "raw_content": "He was a spokeperson for my wife's company. She supervised video/photography shoots with him and would always come home and tell me what a great guy he was.",
                "author": "Looniz74"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: ADAM SCHIFF UNDER CRIMINAL INVESTIGATION FOR MORTGAGE FRAUD –FOX. US Attorneys in Maryland are zeroing in on the FALSE affidavit Schiff signed declaring his Maryland residence as his primary, which gives him better loan terms, tax breaks, and cheaper insurance.",
        "score": 1412,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The proverbial 'slap on the wrist'. This was the absolute minimum charge he could be investigated for. Disappointing, really.",
                "author": "Th3Cho0sing0ne"
            },
            {
                "raw_content": "I want him to pay for lying about our guy. Not about taxes and mortgage fraud, that’s shit you add on to the treason.",
                "author": "SCP0073"
            },
            {
                "raw_content": "FAFO Shiftteeeeee",
                "author": "TEXinLA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Jessica Tarlov has now admitted it: We support gerrymandering, only if Democrats are doing it.",
        "score": 1047,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good grief, I need to repair my speakers now. Her voice blew out the foam surrounds.",
                "author": "RuprechtThaMonkeyBoy"
            },
            {
                "raw_content": "This is a really important moment for the Right, not the citizens the make up the base, but the actual people in power on the Right. For decades and decades there has been a prevailing delusion among those in power on the Right that the appearance of being the 'good guy' is just as valuable, and in fact more valuable, than actual demonstrable and actionable wins with real substance. The Right has been chasing after this fanciful dream that if they can only show that they are more principled, more upstanding, more morally consistent, more honest, more honorable, etc than the left, then it won't matter how much real power the left amasses, the nation will 'somehow' reward the Right with a decisive victory. That if enough people just see us being the 'good guys' and the left openly being the bad guys, we will be granted a win because we deserve it. None of that has ever been true. Power is there to be grasped by someone, and it will be grasped by whoever has the determination to do so, no matter their moral character. The Left has no honor or principles, but they know we do, so they have been more than willing to use that against us. They have, and continue to, frame every fight in such a way that we can achieve a 'moral victory' by ceding the real world power to them *or* take real world power for ourselves but look bad doing it, knowing that we've always picked the first option every time, because of that delusion. This is a moment where we see if those in power have finally given up on that delusion. We have the chance to take a real win that means something and can last and have real positive effects on whose worldview and policy gets moved forward and whose gets left behind. Us or them. But in order for it to be us, we, and I mean those on the Right in power, have to be willing to look like the bad guys. They have to be willing to say \"yeah, this redistricting stuff is pretty slimy, but the Left is doing it and now so are we. That's the way this works\". They have to be willing to take the mud that will be slung at them in exchange for a real win of substance. We are about to see if the past decade or so has finally taught the Right the most important political lesson of all: win first. Worry about how it looks later.",
                "author": "MuslimsWorshipSatan"
            },
            {
                "raw_content": "Well duh. Not much of an admission. Anyone with a brain cell knows this.",
                "author": "here2red"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Super Predators",
        "score": 990,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He quoted \"youths\" lmao must mean he knows what it's code for",
                "author": "staroframphansbhole"
            },
            {
                "raw_content": "Do adult crime, get adult time.",
                "author": "NippleSalad"
            },
            {
                "raw_content": "I'd say Big Balls earned the name. He charged a group of 8-10 \"youths\" in full chimpout that were trying to drag a young woman from her car and saved her from them, at the cost of a beating.",
                "author": "Jack_HinsonTN"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "His name is \"Big Balls\" and he didn't just take out his phone and film a woman in DC getting robbed. He stood up to the thugs and saved her.",
        "score": 1144,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Actual massive balls",
                "author": "AstroLonghorn"
            },
            {
                "raw_content": "He also got the attention of the President himself. I'd sure hate to be a member of that Chimp Out gang right now.",
                "author": "SubmarineGuy"
            },
            {
                "raw_content": "WTAF happened? He's not even that big a guy. He's already done fantastic work on behalf of the country, and now this? Hope he'll be okay.",
                "author": "Cuetardian"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Homeland Security slaps roof, does the meme.",
        "score": 1241,
        "text_content": "",
        "comments": [
            {
                "raw_content": "absolute boys?",
                "author": "SHILL_DETECTOR"
            },
            {
                "raw_content": "Source: https://x.com/dhsgov/status/1952853433113035181",
                "author": "RuprechtThaMonkeyBoy"
            },
            {
                "raw_content": "I spent a lot of summers in a van that looked exactly just like this. Good times. I wouldn't mind one now, with a wizard or unicorn airbrushed on the side.",
                "author": "klunniclowns2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Make sure you're armed, H1-B coming to you",
        "score": 1217,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Respect his culture by adjusting your ammunition usage to match his caste. For Brahmins use 5 rounds. For Dalits just 1. You have to remain cost-effecient to stay competitive in this economy.",
                "author": "sola_scriptura"
            },
            {
                "raw_content": "That's a long time to not hear any gunshots. Though I suppose there's logic in waiting until he has broken in, better argument in court. Sucks that there's so much damage that has to happen beforehand.",
                "author": "keeponwinning"
            },
            {
                "raw_content": "Shooting people like this should come with cash and prizes",
                "author": "Formerlurker92"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump says he will SEIZE CONTROL of Washington, DC if the city doesn't begin stopping violent crime NOW. TAKE BACK OUR CAPITAL,",
        "score": 1702,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"Youths\" 🤣 My President",
                "author": "Zskills"
            },
            {
                "raw_content": "He literally should be in charge. Why the fuck is there a \"mayor of DC\" or anyone living there full time? Its supposed to be a \"federal city\" acting as a neutral site outside of any state.",
                "author": "DingleBalls"
            },
            {
                "raw_content": "REEEEE He’s literally Hitler!!",
                "author": "Apersonofinterest"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Two truck drivers in Georgia become some of the first in the state ticketed under @POTUS ' Executive Order enforcing English proficiency in truckers. Trucker reacts: \"They're operating 80,000 lbs — It's super dangerous, and they can't communicate? ... That's where the safety part of it comes in.\"",
        "score": 1187,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A ticket does not get the driver off the road, unfortunately. Need immediate arrest and deportation",
                "author": "Colorado-Living"
            },
            {
                "raw_content": "Cop neighbor of mine works a highway. He tells me about the intense difficulty pulling over the non-English speakers. Having to call in a translator. He speaks very highly of the Singh that drive trucks, because they speak English, but no one else.",
                "author": "billybaldwin2"
            },
            {
                "raw_content": "On July 25, my son and I were driving on the N.Y. State Thruway on our way to a doctor's appointment in Clifton Springs. A flashing sign alerted traffic of delays due to an accident farther ahead. We eventually caught up to the bumper to bumper traffic, and saw a tractor trailer in the median, completely torn apart. Seeing this post, I just searched for info on the accident. Turns out the driver was 32 year old Mokhtar Mohammadi from Houston, Texas. A car hit the debris from the tractor trailer and a passenger was taken to a local hospital. It turns out Mohammadi was driving an over-height vehicle and damaged the overpass he tried to go under. He damaged the bridge badly, and the route that went over it had to be closed. He was ticketed at the scene. I'm wondering if this guy speaks and reads English because all along the thruway there are flashing signs alerting truck drivers about the height of the upcoming overpass and to make sure they can safely drive under it. Tractor-Trailer Strikes Thruway Overpass in Seneca County https://troopers.ny.gov/news/tractor-trailer-strikes-thruway-overpass-seneca-county",
                "author": "mass55th"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Adam Schiff faces criminal investigation over possible mortgage fraud",
        "score": 680,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Surely, as great as it is, it doesn't need two stickies.",
                "author": "MemeWarsVet"
            },
            {
                "raw_content": "I'm waiting for treason",
                "author": "I-am-Orlando"
            },
            {
                "raw_content": "They not going to arrest him. It's all show.",
                "author": "BobrobC"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump all-but clears the GOP 2028 presidential primary field, says JD VANCE is LIKELY the favorite.",
        "score": 1161,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He left it open to the voters to decide.",
                "author": "SubmarineGuy"
            },
            {
                "raw_content": "I'll vote for Vance, no problem",
                "author": "Sea_Still"
            },
            {
                "raw_content": "A long, long ways between now and 2028. We'll have to see how everything looks at the conclusion of President Trump's second term before we can in earnest make a choice. > He who responds with a word before he hears, It is folly and shame to him. Proverbs 18:13",
                "author": "TheMrStone"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "While Jazzy Crackpot smears our duly elected President as a racist, her own existence in Congress is entirely due to racist gerrymandering. That's the ONLY systemic racism!",
        "score": 1243,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Timmy's Dad. Sorry it was on when I was younger 😂",
                "author": "MAGADucker"
            },
            {
                "raw_content": "Boomers: If I Had a Trophy Guy Zoomers: His government name is Timmy Turner’s Dad.",
                "author": "ChrisSuperDude"
            },
            {
                "raw_content": "From the show Fairy Odd Parents for the curious.",
                "author": "MSG1000"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Does anybody actually dispute the 2020 election being stolen at this point?",
        "score": 508,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I would love to see the people that were responsible for covering up the windows inside the TCF Center in Detroit, Michigan - using big rectangles of white cardboard - brought to justice. https://search.brave.com/images?q=TCF+Centre%2C+Detroit+windows+covered+up&source=images",
                "author": "NoCorruptFashion"
            },
            {
                "raw_content": "2020 was the biggest political scandal people need to hang",
                "author": "Choppermagic"
            },
            {
                "raw_content": "Does that mean dems kept counting? The bar is longer in 2024. Also should be higher arc. But won't argue the graphic.",
                "author": "Shitsbrokeyo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Howard Stern's show is NOW BEING CANCELED by SiriusXM. He is following Stephen Colbert's cancellation. The ratings are not paying his salary anymore. Unfunny, anti-Trump hosts are losing their shows EN MASSE. The culture has shifted.",
        "score": 562,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ratings never paid his salary. He was subsidized by USAID just like Colbert",
                "author": "Whoopies_tds"
            },
            {
                "raw_content": "That turd should have been gone for several years now. From The Sun: \"Stern's contract is up in the fall and while Sirius is planning to make him an offer, they don't intend for him to take it\"... \"Sirius and Stern are never going to meet on the money he is going to want. It's no longer worth the investment.\" https://www.the-sun.com/entertainment/14910416/howard-stern-show-canceled-contract-up/",
                "author": "schism"
            },
            {
                "raw_content": "I still believe it’s all tied to USAID. And if I’m right, EVERYONE involved in the theft of taxpayer money to support anything political should be summarily court martialed for treason.",
                "author": "jiminycricket1941"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: Secretary RFK Jr. has just TERMINATED contracts for 22 mRNA vaccines in development",
        "score": 831,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I bet Dr. Malone is behind this. He was appointed to the Advisory Committee on Immunization Practices (ACIP) and his committee advises the U.S. government on vaccines.",
                "author": "imnotdeadyet"
            },
            {
                "raw_content": "Moderna just laid off 10% of their workforce (~6000 people). It’s pretty drastic",
                "author": "BloodElfSupporter"
            },
            {
                "raw_content": "They should make mRNA vaccines illegal.",
                "author": "OK_Parmaker"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 JUST IN: Senator Mike Lee calls for President Trump to give DOGE's \"Big Balls,\" Edward Coristine, the Presidential MEDAL OF FREEDOM, for his heroic action of saving a young woman from being beaten by thugs in DC at night.",
        "score": 639,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This would be awesome and well deserved. Dude is a hero.",
                "author": "Colorado-Living"
            },
            {
                "raw_content": "He definitely earned it.",
                "author": "DILLIGAF_Bro"
            },
            {
                "raw_content": "MAGA agrees!!! Nowadays, everyone is willing to take a video of an event while NOT stepping in to help.",
                "author": "Znut55"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Anandtech's archive of articles has been taken offline.",
        "score": 312,
        "text_content": "Just noticed this, apparently it happened several days ago. Despite reassurances that the site and its articles would be kept up indefinitely, Anandtech's vast history has been taken down and all links redirect to the forums. The r/datahoarder thread below apparently has a downloadable archive for anyone interested. https://old.reddit.com/r/DataHoarder/comments/1meywmf/hope_someone_actually_archived_the_anandtech/ Just a very sad final end to was still one of the best resources around.",
        "comments": [
            {
                "raw_content": "Thank god for data hoarders",
                "author": "Dasboogieman"
            },
            {
                "raw_content": "Even Bit Tech's is still up. Frigging hell what cheap skates.",
                "author": "Dangerman1337"
            },
            {
                "raw_content": "Everything's up on archive.org, but without a proper search indexing function it'll mostly be lost. archive.org works best if you know the exact URL of the article. Otherwise, it's almost impossible to search specifically for something. This is a huge issue with Anandtech because it had thousands of articles. In order for me to find old HardOCP articles, I search their forum for the specific feedback thread, then plug in the URL at archive.org. But Anandtech didn't have article feedback threads. This is also why I haven't really touched the Geocities archive either. It's all there but it's impossible to search or browse properly. What a shame.",
                "author": "Gippy_"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Desperate measures to save Intel: US reportedly forcing TSMC to buy 49% stake in Intel to secure tariff relief for Taiwan",
        "score": 766,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Doesn’t foreign ownership of US domestic chip manufacturing, defeat part of the national security value of domestic chip manufacturing",
                "author": "audaciousmonk"
            },
            {
                "raw_content": "Hasn't the current US government been trying to reverse or defund the CHIPs act... which was primarily intended to shovel money at Intel?",
                "author": "Ploddit"
            },
            {
                "raw_content": "From the news I've seen, some of the people in Taiwan are pissed already with the 20% tariff, considering how much Lai promised to invest.",
                "author": "antifocus"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Trump says he'll announce semiconductor and chip tariffs | TechCrunch",
        "score": 80,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The US is once again threatening to cut off its own nose.",
                "author": "narwi"
            },
            {
                "raw_content": "[removed]",
                "author": "None"
            },
            {
                "raw_content": "Gotta get those taxes up to pay for all that fascism. Shareholders might want to know what kind of wealth generation there will be for the overall economy when something as vital as chips gets the Despot Tax. Every industry will get that Putin treatment, let's see how competitive America will be now. Glad people voted to bring that kind of shit to American shores.",
                "author": "toofine"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD, please, no more 8GB GPUs – the Radeon RX 9060 GPU has officially been confirmed, with a feeble amount of VRAM",
        "score": 29,
        "text_content": "AMD just dropped the rx 9060 as an oem-only card and honestly it's a bit of a mixed bag. on one hand, it gives budget pre-built systems a new option in the entry-level space, but on the other, it’s still stuck at 8gb vram which already struggles in some modern titles. the fact that it's not available as a standalone product means diy builders are once again sidelined unless they want to pay extra for a system they don’t need. specs-wise, it's a cut-down version of the 9060 xt, slightly lower clocks and memory bandwidth, and pretty clearly positioned to fill out contracts with integrators.",
        "comments": [
            {
                "raw_content": "> it’s still stuck at 8gb vram which already struggles in some modern titles it's also a cheap card. the XT version is selling for ~~$350~~ $300 so realistically the non-XT version should be selling (if it ever does) at ~~$300 or~~ $250. prob even cheaper than that through dubious channels lol > pretty clearly positioned to fill out contracts with integrators I think that kinda deconstructs your argument",
                "author": "_elijahwright"
            },
            {
                "raw_content": "I don't think the people who are gonna buy a RX 9060 are gonna be bothered by that tbqh. If you add more VRAM to it then that's missing the point of offering a low-end GPU.",
                "author": "caiusto"
            },
            {
                "raw_content": "Nothiing wrong if its a cheap card. The problem is Nvidias 400+ USD cards with 8 GB",
                "author": "sahui"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD Reports Second Quarter 2025 Financial Results",
        "score": 27,
        "text_content": "",
        "comments": [
            {
                "raw_content": "* Client and Gaming segment revenue was $3.6 billion, up 69% year-over-year. Client revenue was a record $2.5 billion, up 67% year-over-year primarily driven by strong demand for the latest \"Zen 5\" AMD Ryzen desktop processors and a richer product mix. Gaming revenue was $1.1 billion, up 73% year-over-year driven by an increase in semi-custom revenue and strong AMD Radeon GPU demand.",
                "author": "NeroClaudius199907"
            },
            {
                "raw_content": "Stock is down 7% after hours (12 point). Probably from the flat AI revenue",
                "author": "BarKnight"
            },
            {
                "raw_content": "Not being able to generate profit simply due to the AI gravy train temporarily stopping in China is quite a bad Outlook.",
                "author": "Professional-Tear996"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "No Backdoors. No Kill Switches. No Spyware.",
        "score": 72,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is there a single corporation ever who has confessed to putting backdoors or spyware in their shit? Did MS ever fess up to the NSAKEY?",
                "author": "nanonan"
            },
            {
                "raw_content": "X86 and arm cpus do have backdoors",
                "author": "Quatro_Leches"
            },
            {
                "raw_content": "Not gonna lie, this feels like \"no one asked??\" Article Which makes me wonder why it's being posted, did the US demand backdoors be built into Nvidia hardware?",
                "author": "CommanderArcher"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "PCI SIG announces PCI Express 8.0 set to offer up to 1 TB/s of bandwidth - VideoCardz.com",
        "score": 102,
        "text_content": "",
        "comments": [
            {
                "raw_content": "People seem to forget enterprise uses these technologies first. There are already PCIe 6.0 devices hitting use in enterprise sectors, and they just finalized 7.0 specs. So those will be rolling out in 12-18 months. This is just the 8.0 announcement, so products for enterprise sector are probably 3 years out. None of this really matters for consumer hardware.",
                "author": "dstanton"
            },
            {
                "raw_content": "The potential big advantage is freeing up PCIe lanes for additional devices If the fastest NVMe devices only need 1 lane, a high end GPU only needs 4 or maybe 8 then that frees up lanes for more storage, a 2nd PCIe card, or even faster networking given that items that share PCIe lanes will be able to share on fewer lanes",
                "author": "ghenriks"
            },
            {
                "raw_content": "I appreciate the PCI SIG is constantly pushing forward to keep relevance and avoid competing standards getting much of an opportunity, and clearly 8.0 is a long way off, but I feel like implementations are going to start really lagging standards release as huge segments (desktop, mobile) have little use for the added bandwidth.",
                "author": "mduell"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung Sees Mature Node Uptick on 4–8nm Demand Since June, Easing Foundry Woes | TrendForce",
        "score": 15,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD's next-gen AM6 socket to feature over 2100 pins, may support AM5 coolers.",
        "score": 220,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I think I'd rather that they didn't risk hobbling AM6 with backwards compatibility, and just did a clean sheet design instead. Making AM5 compatible with AM4 coolers didn't do AM5 any favors. I'd hate to see a repeat of that for AM6.",
                "author": "Verite_Rendition"
            },
            {
                "raw_content": "So more PCI-E lanes on consumer CPU?",
                "author": "forreddituse2"
            },
            {
                "raw_content": "My 2013 Noctua NH-U12S is immortal!",
                "author": "1corn"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "This is what the Nintendo Switch 2 is capable of.",
        "score": 1276,
        "text_content": "Holy moly, look at the crowd in this scene! The festival mission gave me goosebumps and really reminded me of the parade from Ghost in the Shell 2 movie! Kudos to CDPR for their fantastic work, it’s also a great example of how developers should handle their ports. They’ve set the bar!",
        "comments": [
            {
                "raw_content": "And Sega is really telling me they can’t get a cartoon game to run at 60 fps on this thing. Come on now…",
                "author": "OVO_ZORRO"
            },
            {
                "raw_content": "Really impressed with the SW2, between this and Bananza",
                "author": "OriolesMets"
            },
            {
                "raw_content": "This is a set mission with boundaries, so the crowd density is more do able. But you won't see crowds like this in the open world. Though I agree SW2 is a very capable console.",
                "author": "DrizzyDragon93"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The Switch 2 has been out for 2 months, and I’m still very happy with my purchase",
        "score": 708,
        "text_content": "Game prices and crappy business practices aside, I’m in love with this console.",
        "comments": [
            {
                "raw_content": "This game needs a patch though for load times.",
                "author": "Nerdboxer"
            },
            {
                "raw_content": "I enjoy it, too. I actually use it more often in handheld mode than I expected. My Switch 1 lived mostly in the dock, but with the Switch 2 I spend more time played in handheld mode. This is a good screen size for me and even though it's not an OLED display, it looks much better than my V2's and Lite's screens. I think this will probably be a 70% handheld, 30% docked situation for me -- time will tell. The Steam Deck got me hooked on playing in handheld again and this carries over to this device. It was a good purchase and I'm glad I didn't wait for the eventual OLED model. I was pondering it, but I wanted a new toy now, not in two+ years.",
                "author": "mrmivo"
            },
            {
                "raw_content": "Me too. It’s very nice having an all in one device again. Also it being able to do 60fps on the free to play games like Fortnite and Apex is a W. And hey maybe Nintendo offers a stronger power profile in the future like they did with switch.",
                "author": "Pokeguy211"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Fuck it. *unLagoons your Layer*",
        "score": 205,
        "text_content": "Before you ask - yes, autism",
        "comments": [
            {
                "raw_content": "What if I wanna goon?",
                "author": "ItWasReallyUnclear"
            },
            {
                "raw_content": "Haha this really is the ultimate autism game, I’ve been having a blast",
                "author": "shutyourbutt69"
            },
            {
                "raw_content": "I wanna do that so bad",
                "author": "Glitched25"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Looks like the Apex Legend switch 2 version is impressive",
        "score": 259,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Jeez Louise, 80 GB?",
                "author": "LPolder"
            },
            {
                "raw_content": "So this is the first game to take up a BUNCH of storage for Switch 2 huh?",
                "author": "PaleFondant2488"
            },
            {
                "raw_content": "Just played a few hours. Some FPS dips when entering the world but when diving you notice it becomes much more stable and then it just keeps good. I had some intense moments in Wildcard and it could handle it perfectly IMO. Great port, but I suck at the game and probably won't play as much haha",
                "author": "Rynelan"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Indie World Showcase 8.7.2025",
        "score": 589,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Chillin' by the Ocean Chillin' by the Cafe Corner Chillin' by the Gap Chillin' by the Mall Chillin' by the Cemetery Chillin' by the Coffee Shop",
                "author": "raylan_givens6"
            },
            {
                "raw_content": "Need UFO 50 to come to Switch 2 ASAP pls",
                "author": "AltStag"
            },
            {
                "raw_content": "Hi, we’re a 2 person icelandic development team, and we’d love to spend the next 20 minutes talking to you about Little Onion Big Dreams. in this game, you’ll control a small onion who explores the true meaning of self love and family through 95 isometric timed puzzles set in a 1600’s fairytale kitchen. We’ve been working on this game for 7 years and it releases in 2027, we can’t wait for you to play it Explore your layers when…….Little Onion Big Dreams slices onto Nintendo Switch 2! Preorders on the Nintendo Eshop are available today",
                "author": "boopladee"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "What did you do with your Switch 1 after buying the Switch 2?",
        "score": 94,
        "text_content": "What did you do with your Switch 1 after buying the Switch 2?",
        "comments": [
            {
                "raw_content": "I'm giving mine to my 5 year old niece at Christmas.",
                "author": "Im_Ashe_Man"
            },
            {
                "raw_content": "I'm going to do unspeakable things to it. Things nintendo would want to brick it for.",
                "author": "Sirsersur"
            },
            {
                "raw_content": "I donated it to my local kids hospital",
                "author": "Hey_Jacob"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Kirby and the Forgotten Land – Nintendo Switch 2 Edition + Star-Crossed ...",
        "score": 425,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I need something to fill the void once I’m done 100%ing Bananza. Kirby but slightly more difficult sounds like a great stop gap.",
                "author": "superyoshiom"
            },
            {
                "raw_content": "Looks amazing !",
                "author": "TheMuga2405"
            },
            {
                "raw_content": "Never finished the original, started playing it again on the switch 2. It actually already looks pretty good in handheld mode compared to a lot of switch 1 titles. I'm curious how the upgrade pack will be handled given the complaints with the Jamboree upgrade.",
                "author": "gorcorps"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Apex Legends™ for Nintendo Switch 2 - Out now (78.5 GB)",
        "score": 163,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Been playing it for an hour and a half just to try out , it actually looks and runs really good .. haven’t noticed any frame drops even when multiple teams are fighting .. and I’ve played both docked and handheld no real issues at all so that’s good",
                "author": "FCA_Eughhh"
            },
            {
                "raw_content": "80 GB is quite beefy. I was going to eventually grab a 512 GB card (have a 256 GB one currently since that was all that was available), but I think I'll just wait for the 1 GB Express cards from Samsung or SanDisk coming out and then be set for the next seven years.",
                "author": "mrmivo"
            },
            {
                "raw_content": "Apex Legends for Nintendo Switch is no longer compatible with Nintendo Switch 2 via backwards compatibility. You need to download the Switch 2 version to play on Switch 2.",
                "author": "Joseki100"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "PH Brazil: \"If you only care about Silksong, you shouldn't even open the stream\" (Indie World)",
        "score": 464,
        "text_content": "Just saw the thread about how SwitchForce said Silksong won't be shown at Indie World and remembered this PH Brazil tweet from earlier today. It's in Portuguese, but the translation of the tweet is the title. https://xcancel.com/phluttilippe/status/1952725000261112198 Thought it would be interesting to share it here, I think this further solidifies what SwitchForce said about Silksong.",
        "comments": [
            {
                "raw_content": "Not a hard thing to predict though isn’t it",
                "author": "TheGeniusSexPoets"
            },
            {
                "raw_content": "\"and now for a game about bugs...\" *hype builds, everyone holds their breath* Bug Fables 2 trailer starts playing",
                "author": "ArcanaOfApocrypha"
            },
            {
                "raw_content": "I think the big announcement will be Hades 2 release date for Switch. Silksong will probably be at Gamescom.",
                "author": "OwlProper1145"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "The original song for Team Fortress 2's Meet the Sniper video has been discovered",
        "score": 117,
        "text_content": "Source: https://youtu.be/ebrFO6tDqVs?si=e0zhJpcLu6anNIcN",
        "comments": [
            {
                "raw_content": "I love that the game is almost 20 years old and we're still getting things like this.",
                "author": "kartoffelbiene"
            },
            {
                "raw_content": "It’s hard to believe that this music went unreleased for so many years - you would have expected Valve to share it much earlier. Also, the video’s description mentions a leak involving Valve content. I wonder if it involves its past games only, or something more.",
                "author": "MrRedoot55"
            },
            {
                "raw_content": "Remember: The copyright belongs to LOLOLOL I'm impressed it wasn't VALVE or Mann co.",
                "author": "one999"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "SwitchForce: Silksong will not be in the Indie World Showcase",
        "score": 428,
        "text_content": "[https://youtu.be/Tuvr5j3HvXQ?si=0OjQxHL72B09hy\\_I&t=203](https://youtu.be/Tuvr5j3HvXQ?si=0OjQxHL72B09hy_I&t=203) (starts at 3:23) He also say’s phase 3 of Nintendo’s presentations is coming, but it will not be next week. (8:00)",
        "comments": [
            {
                "raw_content": "the silksong saga continues",
                "author": "malacosi"
            },
            {
                "raw_content": "r/silksong would be in disarray, but they are instead super hyped for GamesCom (them and no one else)",
                "author": "SelectivelyGood"
            },
            {
                "raw_content": "Silksong's off the menu, but i wouldn't surprised to see Hades 2 on there.",
                "author": "czarchasm4532"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Starfield: New Findings in the last 2 update suggest Dev team is adding a highly request feature: Interplanetary Travel",
        "score": 255,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This would certainly help. More shit to do in space too would be nice. Honestly the game has great framework for a good space rpg. The combat is fun, space combat is good. There’s just nothing to do",
                "author": "Kooky-Masterpiece-87"
            },
            {
                "raw_content": "Big if true, but it baffles me that it wasn't in the game in the first place (at least between a planet and its moons). If nothing else, I hope this means they're finally going to work on cutting down load screens, it would only make The Elder Scrolls VI a better game to have as few as possible.",
                "author": "Arcade_Gann0n"
            },
            {
                "raw_content": "If true, this would be cool. Im not going to apologize, I love the game and I really hope they are adding cool new features with how long this next update has taken. Planet to planet travel without loading screens will be a cool breath of fresh air for the game.",
                "author": "Particular_Hand2877"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Animations for Zenimax's canceled Project Blackbird",
        "score": 144,
        "text_content": "[source](https://mp1st.com/news/report-zenimaxs-cancelled-project-blackbird-first-look-at-creatures-animations)",
        "comments": [
            {
                "raw_content": "I'm guessing blackbird was originally meant to be the Fallout 76 or ESO equivalent to Starfield, but then they realised Starfield's world is just too boring so they had to change it up into a new thing.",
                "author": "NorthKoreanMissile7"
            },
            {
                "raw_content": "Just let it die.",
                "author": "LinkedInParkPremium"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Nintendo Indie World Announced August 7 at 6am PT",
        "score": 657,
        "text_content": "[https://www.youtube.com/live/mTv0HmKoUqw](https://www.youtube.com/live/mTv0HmKoUqw) Previous rumor: [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1mhvwte/natethehate\\_i\\_have\\_not\\_heard\\_of\\_a\\_direct\\_taking/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1mhvwte/natethehate_i_have_not_heard_of_a_direct_taking/) [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1mhpag9/switchforce\\_doubles\\_down\\_on\\_a\\_nintendo\\_direct/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1mhpag9/switchforce_doubles_down_on_a_nintendo_direct/)",
        "comments": [
            {
                "raw_content": "the clickbait youtuber was right??? what is this timeline???!",
                "author": "Terraria_lover"
            },
            {
                "raw_content": "Leaker drama aside, it blows my mind that the campfire game was at the partner direct instead of this one",
                "author": "Tired_Gamer"
            },
            {
                "raw_content": "I think what’s gonna happen is after braid 2, spelunky 3, stardew valley 2, undertale 2, and Celeste 2 are revealed as shadow drops, the announcer will ask you to pick up your switch or switch 2 controller and then it’ll fade up on the main menu of silksong and you’ll be playing it, game already added to your digital library for free",
                "author": "dillonflynn"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "NightDive is making a new Sci-Fi Remake in UE5, most likely System Shock 2 Remake",
        "score": 173,
        "text_content": "A job vacancy for Environment Artist, as well as Level and Quest Designer. https://job-boards.greenhouse.io/nightdivestudios/jobs/4763933008 https://job-boards.greenhouse.io/nightdivestudios/jobs/4837385008 ‘We are in the process of staffing up our development team with outstanding talent to tackle a brand new sci-fi remake project using Unreal Engine 5. This is a contract position, with the potential for full-time employment based on project needs and performance. This is an excellent opportunity for someone who is tired of being a cog in a bigger machine, but would rather work closely with a small team where they can have a meaningful impact on the final game.’ ‘With the goal of capturing and preserving the essence of the games that we all grew up with, we welcome applicants with unique skillsets and backgrounds. If you are passionate about making a meaningful contribution to some of the most significant and beloved games in the industry, we’d love to hear from you!’",
        "comments": [
            {
                "raw_content": "see you all in 8 years",
                "author": "Zorklis"
            },
            {
                "raw_content": "What ended up happening to system shock 3",
                "author": "GoldenTriforceLink"
            },
            {
                "raw_content": "deus ex remake 🤞",
                "author": "LolcatP"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Nightdive Studios might be hinting a Quake 3 Remaster",
        "score": 277,
        "text_content": "[Source](https://www.reddit.com/r/quake/s/RLGmGzb4IU)",
        "comments": [
            {
                "raw_content": "Is Nightdive planning to update all of the mainline Quake games? I would LOVE a Quake 4 remaster.",
                "author": "LitheBeep"
            },
            {
                "raw_content": "Can we get a campaign or some expansion along with it? Not to say quake 3 needs an expansion, but a big selling point for these new ports/remasters has been the new episodes included like Legacy of Rust, dimension and call of the machine. Which makes nightdive working on a heretic and hexen remasters even more enticing.",
                "author": "jeshtheafroman"
            },
            {
                "raw_content": "Thief my beloved",
                "author": "Ros96"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "AMD Ryzen Dual-X3D and Intel Nova Lake Dual-BLLC leaks surface almost simultaneously",
        "score": 80,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I like how they just throw random words around to pad their \"article\".",
                "author": "ThreeLeggedChimp"
            },
            {
                "raw_content": "Wonder if Intel will do stacking two bLLCs on a single CPU tile like rumoured as an option with AMD's Zen 6. I iknow this is basically both Zen 5 CCDs having each an 3D v-Cache and NVL seemingly going to have that option now. But two bLLCs meaning 288MBs of stacked cache + cache in compute die would be insane and crazy for gaming. Regardless I'd love a P Core only RZL SKU with much stacked cache as possible, or heck just 48MB 12P Griffin Cove + 144MB L3 bLLC would be sweet.",
                "author": "Dangerman1337"
            },
            {
                "raw_content": "The only reason I don't have a dual CCD ryzen is the lack of X3D on the 2nd CCD. I would 100% be in for a 16 or 24 (when they go 12 core CCD) core dual X3D.",
                "author": "PsyOmega"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD's next-gen AM6 socket to feature over 2100 pins, may support AM5 coolers - VideoCardz.com",
        "score": 277,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Still on AM4. I am gonna try to skip straight to AM6 for my next cpu upgrade.",
                "author": "Powerman293"
            },
            {
                "raw_content": "I would rather they do what's best for the CPUs and not do what they did this time and just add a super fat IHS so old coolers would work. I suppose they are doing it for OEMs though and not DIY or enthusiast builds. In the grand scheme of a build a new cooler is pennies usually.",
                "author": "GoodOl_Butterscotch"
            },
            {
                "raw_content": "Funny cause most people are still on am4 and here we are talking about am6. Amd marketshare comes from am4s success and affordability.",
                "author": "lord_mercernary"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Software: Adrenalin Edition 25.8.1 Release Notes",
        "score": 310,
        "text_content": "[https://www.amd.com/en/resources/support-articles/release-notes/RN-RAD-WIN-25-8-1.html](https://www.amd.com/en/resources/support-articles/release-notes/RN-RAD-WIN-25-8-1.html) Highlights **New Game Support** * Mafia: The Old Country * Mecha BREAK * WUCHANG: Fallen Feathers * Valorant (Unreal Engine 5 release) * Battlefield™ 6 Open Beta **New Game Support for AMD FidelityFX™ Super Resolution 4 (FSR 4)** * Cyberpunk 2077 * WUCHANG: Fallen Feathers * Mafia: The Old Country * Arena Breakout: Infinite * Game of Thrones: Kingsroad * Wreckfest 2 * Lies of P **New Game Support** * The Alters * F1® 25 **Expanded Vulkan Extension Support** * [VK\\_KHR\\_shader\\_bfloat16](https://registry.khronos.org/vulkan/specs/latest/man/html/VK_KHR_shader_bfloat16.html) * [VK\\_EXT\\_device\\_generated\\_commands](https://registry.khronos.org/vulkan/specs/latest/man/html/VK_EXT_device_generated_commands.html) * [VK\\_KHR\\_robustness2](https://registry.khronos.org/vulkan/specs/latest/man/html/VK_KHR_robustness2.html) * [VK\\_KHR\\_depth\\_clamp\\_zero\\_one](https://registry.khronos.org/vulkan/specs/latest/man/html/VK_KHR_depth_clamp_zero_one.html) * Click [HERE](https://www.amd.com/en/resources/support-articles/release-notes/RN-RAD-WIN-VULKAN.html) for more information about other Vulkan® extension support. **AMD ROCm™ on WSL for AMD Radeon™ RX 7700 XT** * The following has been added to WSL 2: * Forward Attention 2 (FA2) decode kernel enablement * New models * Deepseek R1 Distilled (7B, 32B, 70B) * Qwen 2.5 7B * Find more information on ROCm on Radeon compatibility [here](https://rocm.docs.amd.com/projects/radeon/en/latest/docs/compatibility/wsl/wsl_compatibility.html) and configuration of WSL 2 [here](https://rocm.docs.amd.com/projects/radeon/en/latest/docs/limitations.html#wsl-specific-issues). * Installation instructions for Radeon Software with WSL 2 can be found [here](https://rocm.docs.amd.com/projects/radeon/en/latest/docs/install/wsl/install-radeon.html). **Fixed Issues and Improvements** * Stutter and lower than expected performance may be observed while playing 4K resolution YouTube videos in Chrome. * Intermittent application crash or driver timeout may be observed while playing Monster Hunter Wilds with Radeon™ Anti-Lag and Instant Replay enabled. * Intermittent application crash may be observed while playing Battlefield™ 2042. * Intermittent application crash may be observed while playing Dragon Age: The Veilguard on Radeon™ RX 9000 series graphics products. * Stutter improved while playing Call of Duty®: Warzone™ Season 03 ‘Verdansk’ map on some AMD Graphics Products * **NOTE:** Stutter has been reduced with 25.8.1, and AMD is working with the developer toward a full solution. * Texture issues may be observed while using Oculus Rift S on RX 5000 and 6000 series graphics products. # Known Issues * Corruption may appear while playing Mafia: The Old Country on Radeon™ RX 6600 series graphics products. * Intermittent application crash may be observed while playing The Last of Us Part II on Radeon™ RX 7900 series graphics products. * Intermittent application crash may be observed while playing Call of Duty®: Black Ops 6 on Radeon™ RX 9000 series graphics products. * Intermittent application crash or driver timeout may be observed while playing Wuchang: Fallen Feathers with FSR 4 enabled on Radeon™ RX 9000 series graphics products. * Intermittent application crash may be observed while playing FBC: Firebreak on some AMD Ryzen™ processors such as the Ryzen™ AI 300 series and the Ryzen™ 7000 series. * Intermittent application crash may be observed while playing NBA 2K26 in MyCareer mode on Radeon™ RX 9070 series graphics products.",
        "comments": [
            {
                "raw_content": "Does psvr2 work now?",
                "author": "zeekbob"
            },
            {
                "raw_content": "*sigh* They took this off of the Known Issues but never fixed it and now the links to the community forum discussing the issue don't work anymore. &nbsp; \"Stutter may be observed while playing games with some VR headsets at 80Hz or 90Hz refresh rate on some AMD Radeon™ Graphics Products such as the Radeon™ RX 7000 series. Users experiencing this issue are recommended to change the refresh rate as a temporary workaround. \"",
                "author": "rhraziel"
            },
            {
                "raw_content": "For those who can't download. Have you visited Guru3D?",
                "author": "Atecep"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "'China’s 2008 is happening now'—Analyst warns of real estate meltdown that threatens global economy",
        "score": 285,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Haven't they been saying this for years now?",
                "author": "420ohms"
            },
            {
                "raw_content": "If you look at the chart in the article, 2025 is actually significantly “less worse” than 2024. It would imply to me that this problem (which has been going on for years) might be bottoming out?",
                "author": "Kitchen_Can_3555"
            },
            {
                "raw_content": "Uh its like 5 years old at this point. Its 2012 or 2013 is happening now.",
                "author": "Dry-Interaction-1246"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Miami sellers (bagholders) are delisting their homes faster than anywhere else in the nation",
        "score": 193,
        "text_content": "[https://archive.ph/aKwFG](https://archive.ph/aKwFG) Ok, enjoy those never-ending high monthly carrying costs, eating up all those hopium gains. 👋 * **Anchored to Pandemic-Era Prices**: Many sellers still expect the high valuations seen during the pandemic boom and refuse to adjust to current market conditions. * **Patient Seller Strategy**: Rather than negotiating or cutting prices, they prefer to wait out the slump by pulling listings off the market. * **Low Price Cuts**: Only 18% of active listings had price reductions, despite longer selling times and increased inventory. * **Cooling Market**: Median listing prices dropped 4.7% year-over-year, inventory surged 30%, and homes now sit on the market for an average of 88 days. * **Buyer Caution**: With rising interest rates and economic uncertainty, buyers are more hesitant, but sellers aren’t budging.",
        "comments": [
            {
                "raw_content": "This is the “take my ball and go home” strategy. I’m sure a lot of them are “just going to rent it out”…",
                "author": "Big_Treat8987"
            },
            {
                "raw_content": "Pure greed. They might not know it but if they have to sell in the future, they're going to regret delisting.",
                "author": "coldshowerss"
            },
            {
                "raw_content": "Wealthy people, especially the wealthy Cuban crowd in Miami, are incredibly stubborn",
                "author": "StormNo9623"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "This can’t possibly be sustainable, can it?",
        "score": 820,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There are many ways to look at this. All are hypothetical theories as time reveals the truth. Most people look at it from the individual stance. “I’ve been doing everything right and can’t afford it, so there’s no way others can.” Look at the M2 Money Supply. It is currently at an all time high of 22 Trillion dollars. All that money is out there competing against your money.",
                "author": "Common_Suit8709"
            },
            {
                "raw_content": "I don’t know. But the 70’s and 80’s was around the time homes became seen more as “investments” I believe. MBS were created in the 1970’s. Allowing mortgages to be bundled and traded globally, etc.",
                "author": "Patient-Ad-6560"
            },
            {
                "raw_content": "Just make more money, silly!",
                "author": "Likely_a_bot"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "I’ve never believed the “housing crisis” was the result of lack of construction. I believe a major contributor was government policy such as this.",
        "score": 121,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If you're going to subsidize demand at all, then yes, lack of supply is still an issue. And there's plenty of other subsidized demand that's a bigger issue, like the federal buying of low interest 30 year mortgages. It is what it is, there are good and bad things that come from that but supply is the solution and lack of supply is the problem. Not making homes an extreme luxury.",
                "author": "dgreenbe"
            },
            {
                "raw_content": "It's nice that you think that, but supply is still absolutely an issue, even if other things are too.",
                "author": "Weird-Assignment4030"
            },
            {
                "raw_content": ">Taxpayers, however, are seemingly not sympathetic to the migrants' cases with some wondering why American citizens are not afforded the same benefits. >Disabled veterans receive an annual payment of $2,500 from the state under the Hero Act, according to the [Fall River Reporter](https://fallriverreporter.com/while-migrant-families-get-120000-in-housing-benefits-disabled-massachusetts-veterans-mostly-get-a-250-a-year-increase/). But those funds are only provided to veterans who are blind, paraplegic, or have a disability. >Massachusetts veterans do get preference in permanent housing, but families with young children - even if they are in the country illegally - reportedly receive priority in the emergency shelter system. >Similarly, families in the state wait an average of three years and three months to receive subsidized housing, [USAFacts ](https://usafacts.org/answers/how-long-do-people-wait-for-subsidized-housing/state/massachusetts/#:~:text=How%20long%20do%20people%20wait%20for%20subsidized%20housing%20in%20Massachusetts%20?,-Updates%20published%20annually&text=Three%20years%20and%20three%20months,average%20wait%20for%20subsidized%20housing.)reports. Massachusetts' average wait time is a full 12 months longer than the nationwide average. Taxpayers are right to be pissed at this situation.",
                "author": "untetheredgrief"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Keep seeing posts about \"Selling to get my equity out\"",
        "score": 111,
        "text_content": "I've seen this all over Reddit in other subs. The funny thing is, this illustrates how the \"equity\" is an illusion. It's only there if very few people try to take advantage of it. If any significant number of people list their houses to sell to \"capture that equity gain,\" now there is not a shortage, but a glut, and they won't sell for anywhere near what they \"need.\" This is especially true given interest rates compared to a few years ago. These fools are going to ride it all the way down.",
        "comments": [
            {
                "raw_content": "And here I am living in my paid-off house, not caring if the value goes up or down. Well, I wouldn't mind the price going down because I want my kids to be able to afford a house here, same with all the other people that make up my community. My house is a place to live and call home, not an \"investment.\" And we don't get emotionally attached to structures, just sticks and drywall. There's no such thing as a \"forever\" home, and once our kids are out of the house we'll downsize to something that's easier to maintain. Stop treating housing as an investment and many of our dysfunctions, such as boom and bust cycles, are largely resolved.",
                "author": "Mental-Sock2371"
            },
            {
                "raw_content": "“Getting your equity out” just means taking on debt. Real estate agents and lenders that push this non sense need to be regulated and disciplined.",
                "author": "Impressive-Fig1876"
            },
            {
                "raw_content": "Equity isn't fake just because not everyone can extract it at the same time. That’s like saying stocks are fake because markets crash when everyone sells at once. Timing, planning, and market awareness matter.",
                "author": "Proper_Watercress_78"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Dave Ramsey performs mental gymnastics regarding the housing market",
        "score": 89,
        "text_content": "* \"Month over month, every month this year (2025) median house prices go up by $1000.\" * \"Housing prices are not going down. This is not a bubble.\" * \"If interest rates get adjusted, the housing market will take off like a dad gum hair on fire thing.\" * \"September could be wild.\"",
        "comments": [
            {
                "raw_content": "Ah yes, another one waiting for daddy Powell to save their investments. Not happening.",
                "author": "ohhellnaah"
            },
            {
                "raw_content": "Prices have absolutely gone down in Texas and Florida. Phoenix, AZ is also going down. Denver is going down, and probably some other markets I'm not paying attention to. To be fair to DR, Nashville hasn't gone down based on redfin's data. Will prices keep going down in various markets? Who knows. Will rates come down and push prices up? Only the fed governors know.",
                "author": "Contemplationz"
            },
            {
                "raw_content": "Foghorn Leghorn just rambling",
                "author": "butterflytacos"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "This guys buyer backed out. It’s a buyers market and sellers are starting to figure it out",
        "score": 12,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The fact that the seller painted the entire house and garage themselves tells you all you need to know about the state of the rest of this house.",
                "author": "AlSwearenagain"
            },
            {
                "raw_content": "Plus $139,900 to repair that shack to make it livable",
                "author": "DragAccomplished1731"
            },
            {
                "raw_content": "140k for a house, mother of gawd",
                "author": "caughtinthought"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Housing inventory closes in on prepandemic levels",
        "score": 26,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Usual caveat new england still cooked",
                "author": "DizzyMajor5"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "New openai GPT OSS model",
        "score": 142,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Any benchmarks?",
                "author": "metal079"
            },
            {
                "raw_content": "Where's the twink?",
                "author": "Spooderman_Spongebob"
            },
            {
                "raw_content": "unfortunate name, toss",
                "author": "dlrace"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gpt-oss is the state-of-the-art open-weights reasoning model",
        "score": 532,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/fhfututii8hf1.jpeg?width=604&format=pjpg&auto=webp&s=d0908077af4ed31ed273136bcea2b8e7dfb0982c",
                "author": "IlustriousCoffee"
            },
            {
                "raw_content": "Keep in mind that it's VERY censored. Like, insanely so.",
                "author": "Grand0rk"
            },
            {
                "raw_content": "![gif](giphy|SxB0S9MgHo4ZoNrDRk)",
                "author": "Stunning_Monk_6724"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Google Deepmind's new Genie 3",
        "score": 6586,
        "text_content": "[https://x.com/OfficialLoganK/status/1952732206176112915](https://x.com/OfficialLoganK/status/1952732206176112915)",
        "comments": [
            {
                "raw_content": "Imagine having lived under a rock the past few years and then seeing this. It would be pure sci-fi. The stuff from Star Trek.",
                "author": "Brazilll"
            },
            {
                "raw_content": "Now plug this to VR, this is basically metaverse.",
                "author": "AwayConsideration855"
            },
            {
                "raw_content": "Lucid dreaming for everyone coming soon",
                "author": "d1ez3"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Soon, something smarter than anyone you know will be in your pocket",
        "score": 623,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Already exists and people still watch tiktok garbage all day.",
                "author": "Jolly-Teach9628"
            },
            {
                "raw_content": "Sam Altman probably already thinks GPT is \"smarter\" than everyone, so it's not meaningful.",
                "author": "Illustrious-Film4018"
            },
            {
                "raw_content": "what if I know Terrence Tao?",
                "author": "blazedjake"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Genie 3 simulating a pixel art game world",
        "score": 1989,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Everyday we get closer to Ready Player One",
                "author": "BlackExcellence19"
            },
            {
                "raw_content": "We will finally get a zone, city where we can go into every single house.",
                "author": "JackInSights"
            },
            {
                "raw_content": "I kinda dig this style. Are there any games with a similar mix of pixel art and 3D like this?",
                "author": "Sky-kunn"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "In Genie 3, you can look down and see you walking",
        "score": 3752,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This Video is insane! holy shit",
                "author": "Fischwaage"
            },
            {
                "raw_content": "This is gonna be crazy for gaming",
                "author": "Hereitisguys9888"
            },
            {
                "raw_content": "Imagine this to reenact ancient battles? ggzzz",
                "author": "matsu-morak"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "DeepMind: Genie 3 is our groundbreaking world model that creates interactive, playable environments from a single text prompt",
        "score": 1744,
        "text_content": "",
        "comments": [
            {
                "raw_content": "this tech from like 6 months ago was terrible compared to this, that progress in that time is INSANE",
                "author": "ThunderBeanage"
            },
            {
                "raw_content": "this is insanely mind blowing ngl",
                "author": "Pro_RazE"
            },
            {
                "raw_content": "A real-time world model that recreates the actual Earth with physics, people, events… You can, in theory, with enough compute and real-time data… make playable our entire world.",
                "author": "FarrisAT"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The progress from Genie 2 to Genie 3 is insane",
        "score": 1234,
        "text_content": "",
        "comments": [
            {
                "raw_content": "this + vr + voice input = early holodeck",
                "author": "Ok-Set4662"
            },
            {
                "raw_content": "Is this like the [AI minecraft](https://oasis-ai.org/) generation?",
                "author": "AnUntaken_Username"
            },
            {
                "raw_content": "Also note that genie 2 wasn't even realtime, you had to put in the sequence of moves beforehand.",
                "author": "Professional_Job_307"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "If the open source model is this good, GPT5 will probably be INSANE",
        "score": 763,
        "text_content": "https://preview.redd.it/w2dr5ujug8hf1.png?width=1080&format=png&auto=webp&s=9eaa9a661601a5ccddc7d185fd64df7b6262a653 These specs are insane. OpenAI basically just open sourced o4-mini. The only reason they would do something like this is if GPT5 is so damn good that it blows the open source model out of the water and renders it so obsolete that they don't care if everyone has access to it for free. ACCELERATE.",
        "comments": [
            {
                "raw_content": "It seems like they genuinely cooked",
                "author": "SaltyMightyJohn"
            },
            {
                "raw_content": "so the oss-120b is comparable to o3?",
                "author": "chlebseby"
            },
            {
                "raw_content": "Them boys and girls be turning down hundreds of millions for this.",
                "author": "wNilssonAI"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Notes on Genie 3 from an ex Google Researcher who was given access",
        "score": 613,
        "text_content": "Direct copy from Tweet (which includes videos and additional comments from the author) ---- Special thanks to @GoogleDeepMind for inviting me to try out Genie 3. I'm excited to share my thoughts on this early research prototype and also some of my live recordings below: I spent the whole day playing with the system and when it works, it is truly mind blowing🤯. It is the first neural game engine / world model I have tried that generalizes so well and has long term world consistency. Here’s a couple of examples from my live recording and some thoughts on what it means for the future of gaming, robotics, digital experiences and ASI. Where it shines: - Truly general-purpose and quick startup time. Works exceptionally well for gaming environments but also generalizes to other industrial and real-world scenarios. - It learns physics. Although there are systematic failures even for rigid body physics, it was clear to me that it can learn game engine and non-rigid physics without an underlying engine (and in limit learn from game engines via training data). - It works exceptionally well for stylized environments with characters walking around. This will have implications for concept artists, level designers and game devs. - It is way more fun than video models, indicating that there are high retention consumer experiences waiting to be built with this in the future - Photorealistic walk throughs and drone shots work exceptionally well - Global illumination and lighting works surprisingly well - Visual memory is quite powerful and the same objects approximately remain coherent under occlusion and longer time horizons Open Problems: - Physics is still hard and there are obvious failure cases when I tried the classical intuitive physics experiments from psychology (tower of blocks). - Social and multi-agent interactions are tricky to handle. 1vs1 combat games do not work - Long instruction following and simple combinatorial game logic fails (e.g. collect some points / keys etc, go to the door, unlock and so on) - Action space is limited - It is far from being a real game engines and has a long way to go but this is a clear glimpse into the future. The Future: - It is impressive enough for me to have strong conviction that this is going to disrupt the gaming industry. It is super early days and there are a lot of failures but the writing is on the wall. Lots of challenging scientific, engineering and scaling problems to be solved but it is going to happen in the next 5 years. - This is the final piece before we get full AGI and now I think we are well on our way to truly solve it once something like this is scaled up. In many ways it is more ASI than AGI but this is a matter of definitions. The fidelity and generalizability will reach human-level and quickly surpass humans - People are going to combine this with 3D AI and LLMs to build AAA games.",
        "comments": [
            {
                "raw_content": "\"This is the final piece before we get full AGI and now I think we are well on our way to truly solve it once something like this is scaled up.\" Yeah, isn't this the bigger takeaway than anything to do with video games? I assume integrating this into something like existing multi modal models is years away still, but giving the models an ability to reason not just with language but with something like this which becomes almost akin to an imagination or visualization seems like one of the big missing pieces right now",
                "author": "to-jammer"
            },
            {
                "raw_content": "ive been kind of thinking this for a while but i think google will be the company to develop agi/asi",
                "author": "Appropriate_Bend_602"
            },
            {
                "raw_content": "This with full 8k+ resolution and super high frame rate is crazy to think about. But how long until this can be run without renting a full data center?",
                "author": "giga"
            }
        ],
        "subreddit": "singularity"
    }
]