[
    {
        "post_name": "The Buffalo Bills just had a BEAUTIFUL tribute for Charlie Kirk before the game against the Dolphins. They even played a 20-30 second video showing Charlie with his family. I love that this keeps happening ❤️🇺🇸",
        "score": 997,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wow! They finally realized their audience is not in to kneeling!",
                "author": "HockeyMom4Trump"
            },
            {
                "raw_content": "Was it aired on TV, or just in the stadium?",
                "author": "fskfsk"
            },
            {
                "raw_content": "Must've pissed off a lot of progressives there to now call for boycotting the Buffalo Bills. Buffalo and Erie County is full of progloons.",
                "author": "ridge3z"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Antifa harasses Charlie Kirk's Boston vigil shouting \"FUCK YOU NAZI'S!\"",
        "score": 598,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's completely lost on them that if the Right were Nazis they wouldn't be allowed to walk the street. Dumbasses.",
                "author": "clarise"
            },
            {
                "raw_content": "Oh look domestic terrorists.",
                "author": "Wrexxis780"
            },
            {
                "raw_content": "are they all on drugs?",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Tiktoker says that soon MAGA will not be able to live in peace in this country anymore.",
        "score": 470,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They want a gang fight, a civil war, a revolution. What they will receive is law enforcement, the judicial system, and in some cases the penal system.",
                "author": "jackneefus"
            },
            {
                "raw_content": "Whatever. There's no shortage of us that would love nothing more than to fight this thing out. We won't start it but we will finish it.",
                "author": "airborne3502"
            },
            {
                "raw_content": "is she saying waving my American flag is like waving a nazis flag? what a dumb bitch",
                "author": "Not_The_CIA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "P.S. Wasn’t she the one that married her brother in order to gain Citizenship???",
        "score": 1829,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Deport.",
                "author": "DeusVult1096"
            },
            {
                "raw_content": "The bat signal has been deployed.",
                "author": "Concerned__Citizen"
            },
            {
                "raw_content": "I think she married her brother for *him* to get citizenship.",
                "author": "Tikk"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"Stratford HS TEENS forming a TPUSA Club America were DOXXED by ADULTS sharing students’ internal GroupMe content in a “BE THE CHANGE” private FB group, urging 730 members, operating in secrecy, to also intimidate teacher sponsors. REPREHENSIBLE. These are KIDS! @KenPaxtonTX\"",
        "score": 1516,
        "text_content": "",
        "comments": [
            {
                "raw_content": "this right here is where President Trump and his administration need to jump in there full throttle and unmercifully whip their ass",
                "author": "grannylovestrump"
            },
            {
                "raw_content": "Got an email a couple hours ago about setting up a chapter at my community college, I expect to deal with the same shit or worse since I'm an adult and the founding member, but fuck em I'll still do it out of spite",
                "author": "Fox19"
            },
            {
                "raw_content": "That seems illegal",
                "author": "SirWompalot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: The President of Texas A&M University IS RESIGNING after MAJOR blowback from Greg Abbott and the public over allowing radical trans, LGBTQ indoctrination at the school. This student was even kicked out of class because she religiously objected. GOOD RIDDANCE!",
        "score": 1443,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nature is healing.",
                "author": "ecto_coolest"
            },
            {
                "raw_content": "If this is Texas...imagine other states",
                "author": "mmmpillsaregood"
            },
            {
                "raw_content": "I just don't get it. This guy had a wonderful career in the military. Then gets a cush job at a major university and he ruined his legacy over some gay fuck shit. Make it make sense???!",
                "author": "EdBuck"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING 🅱️ The Dutch Parliament just voted in favor of listing Antifa as a terrorlst organization.. 👀",
        "score": 2172,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good, do it in every country.",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "Looks like we going INTERNATIONAL BABY!",
                "author": "Brownwaterboys"
            },
            {
                "raw_content": "Reddit is having a very, very bad 24 hours.",
                "author": "LibertyStillMatters"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Matt Walsh just obliterated Keith Olbermanns entire existence",
        "score": 2066,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Damn! He buried that faggot!",
                "author": "UntakenUsername"
            },
            {
                "raw_content": "Matt Walsh is on fire recently. I have not forgotten his anti-Trump stance from the past, but there is no denying he has been a force of good recently and some of his work like \"What is a woman\" had wide cultural impact.",
                "author": "3percenterFan"
            },
            {
                "raw_content": "and when Keith dies, he will be 'found' probably wearing a gimp mask",
                "author": "Retard_Strength"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Joe Biden’s Chief of Staff Jeff Zients just CONFESSED that HUNTER was “DIRECTLY INVOLVED” in PARDONS",
        "score": 1106,
        "text_content": "",
        "comments": [
            {
                "raw_content": "it was obvious a crackhead was running that demonic four year shit show",
                "author": "YodaBannon"
            },
            {
                "raw_content": "So was he directly involved in his own pardon???",
                "author": "Wrexxis780"
            },
            {
                "raw_content": "The Biden family is a criminal cartel.",
                "author": "DeusVult1096"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Meanwhile Democrats in NYC are marching and chanting “f*** Charlie Kirk”. This is the Democratic Party.",
        "score": 970,
        "text_content": "",
        "comments": [
            {
                "raw_content": "MAKE SURE TO PLAY THESE ALL NON STOP COME MIDTERMS",
                "author": "MidwestZoomer"
            },
            {
                "raw_content": "Why won't republicans lower the temperature?",
                "author": "magapatriot_pa"
            },
            {
                "raw_content": "Totally not paid. You think wealthier people would spend their time on the disgusting public streets of NYC protesting someone they barely even knew before last week?",
                "author": "McFatty7"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: FCC Chair Brendan Carr announces the commission may launch an investigation into ‘The View’ following Jimmy Kimmel’s suspension: “I think it's worthwhile to have the FCC look into The View.”",
        "score": 1706,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The media, as in every one of those mainstream networks, lies about crimes every day, not only jimmy kimmel.",
                "author": "darkmodeforgotpass"
            },
            {
                "raw_content": "The View is even worse than Jimmy Kimmel. Cancel that shitty communist propaganda show.",
                "author": "possibletower"
            },
            {
                "raw_content": "The REEEEEING will be massive if he manages to get The View cut haha!",
                "author": "USA_is_best"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The White House: 'You have no idea the fire you have ignited.' - Erika Kirk. The legacy of Charlie Kirk.❤️",
        "score": 730,
        "text_content": "",
        "comments": [
            {
                "raw_content": "End the Age of Demons. Ostracize them. No conversation. No middle ground. Total defeat is the only way through.",
                "author": "articpuffin"
            },
            {
                "raw_content": "From the White House, this is a battle cry.",
                "author": "PatriotSam"
            },
            {
                "raw_content": "No prisoners. No compromise. This is the shit that the left FROTHED AT THE MOUTH to get, so here it is, and they're already screaming and crying and wishing it would stop. No. These fucks wanted this, when we WARNED THEM over and over and FUCKING over. No quarter.",
                "author": "CAPTAIN_TENDY_PLATE2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Senate Confirms 48 Trump Nominees 51-47 Under Republican Nuclear Option Rules",
        "score": 1613,
        "text_content": "",
        "comments": [
            {
                "raw_content": "thune could have done this 6 months ago.",
                "author": "Badfinz_FL"
            },
            {
                "raw_content": "2 RINO'S didn't vote, which is the same as voting with the Democrats - Jim Banks (Indiana) - Mike Lee (Utah) Source: https://www.senate.gov/legislative/LIS/roll_call_votes/vote1191/vote_119_1_00526.htm",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "So Thune finally delivered something, for once.",
                "author": "Goozmania"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Kimmel was ONLY Getting 129,000 Viewers",
        "score": 719,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Mediocre YouTube channels do that much in one day.",
                "author": "nakedjay"
            },
            {
                "raw_content": "This doesn’t come as a shock to me at all. None of these late night clowns, and Howard Stern, are getting better ratings than random YouTube videos are. They are looking for an excuse to cancel these losers.",
                "author": "SurfandTurf"
            },
            {
                "raw_content": "He was getting 1.1 million viewers. Only 129,000 of those were in the key 18-49 demo. That's completely terrible, but it's not accurate to say he was only getting 129,000 viewers.",
                "author": "FadingLight"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "lol",
        "score": 615,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lol he showed up just to be reminded how gay he is haha",
                "author": "Freedomnuggs"
            },
            {
                "raw_content": "When we say that progressives and the left have no standing, it is a fact. Not even their fellow progressives like them.",
                "author": "ridge3z"
            },
            {
                "raw_content": "I'm just tired of seeing this prick tbh.",
                "author": "MaybeImaLion"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump shows Starmer who's boss: US President tells PM to get a grip and use military to stop the boats - while taking swipe at Labour's beloved wind farms... as MAGA leader claims he 'doesn't know Mandelson'",
        "score": 1339,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sink. The. Boats. Am old enough to remember my family getting slaughtered by boat people arriving in England. Big dudes, with giant axes, horns in their helmets. Can also remember the last time someone was massing boats on the French coast for an amphibious invasion of England. It was Operation Sea Lion. The RAF strafed and bombed them. The Royal Navy was ready to throw every ship they had at them to sink them when they headed to England. Today, Moops and Morons getting on boats, landing on the beaches, and the British islamo/commie government welcomes them and puts them into expensive luxury hotel suites.",
                "author": "magnokor"
            },
            {
                "raw_content": "The British once deployed the Royal Navy to a permanent standing 100 year program to stamp out Slavery How is it now ethically untenable to use it to stamp out Human Trafficking - essentially the same industry",
                "author": "MolochHunter"
            },
            {
                "raw_content": "This whole thing shows how pathetic Conservative PMs were in POTUS Trump's first term. Queer Starmer is nicer and treats Trump better than Theresa May and Boris Johnson ever did. Starmer was the one who instigated the second state visit to the much more exotic Windsor Castle, for example. No fucking way King Charles wanted Trump to have a state visit to Windsor Castle. May/Johnson invited Trump to go to Buckingham Palace for his first state visit because their protesting comrades were right there in London raging against Trump and they blew up the stupid Trump baby balloon. That was a conspiracy involving the Tories and their commie protestor friends too.",
                "author": "possibletower"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "JUST IN: Federal Judge Blocks Trump From Deporting Guatemalan Children to Their Home Country… Guatemala Requested the Children Back! - Cristina Laila",
        "score": 1479,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So the judge should be arrested for international human trafficking and kidnapping.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Deport the judge too.",
                "author": "SupFrens"
            },
            {
                "raw_content": "And don’t fall for “Trump appointee” - senate has had a gentleman’s agreement that both parties get to pick sometimes on a 2 to 1, 3 to 1 basis depending on the state and whose president. Rs need to get rid of that.",
                "author": "Cville123"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: The DOJ just charged 8 people with wire fraud as part of a \"massive housing stabilization fraud scheme\" in Minnesota",
        "score": 1627,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Deport all of them. They are nothing but violent, inbred parasites.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": ">Moktar Hassan Aden&#65038; Mustafa Dayib Ali&#65038; Khalid Ahmed Dayib&#65038; Abdifitah Mohamud Mohamed&#65038; Christopher Adesoji Falade&#65038; Emmanuel Oluwademilade Falade&#65038; Asad Ahmed Adow&#65038; Anwar Ahmed Adow The theme is they are all described w/ three names. &#65038; Just like Osama Bin Ladin &#65038;",
                "author": "BallotsOnRubysUSB"
            },
            {
                "raw_content": "Those Somalis sure love fraud",
                "author": "Froynlavenfroynlaven"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "PRESIDENT TRUMP: \"I actually said, 'Charlie, someday I think you have a good chance of being president. I think you will be president.' And I think he would have had a great chance. He was very compelling. I've never seen anybody capture a group of people like he captured youth. He was incredible.\"",
        "score": 1587,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They murdered our future, beloved, Patriot President. Rest In Peace, dear President Kirk.",
                "author": "TheAftermath"
            },
            {
                "raw_content": "Something tells me President Trump just explained the 2 main reasons Charlie Kirk was murdered: he was MAGA's best hope to carry the executive branch going forward, and he had a generation of young voters in the palm of his hand.",
                "author": "Antenna"
            },
            {
                "raw_content": "That was the point, Charlie was extremely dangerous to the left",
                "author": "ScoobyDum"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Soros-Working Families Party Syndicate: Fresh IRS Red Flags as New Evidence Emerges",
        "score": 1271,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’m no expert but that sounds like a crime.",
                "author": "AlphaNathan"
            },
            {
                "raw_content": "I'm too dumb to follow any of this report. I simply don't understand enough about finance rules. But I'll just comment how much it sucks this obvious money laundering is never prosecuted. I remember seeing Hunter's bank statements that matched up with text messages confirming $10K payments that were being funneled to the big guy - yet nothing happened. I'd almost rather not know this shit was going on, than know it's going on and nothing being done to stop it.",
                "author": "BigBallsMike"
            },
            {
                "raw_content": "A first year law student could follow up and pin a RICO indictment on these domestic terrorist.",
                "author": "JamesBond007"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Ars Technica: Software update shoves ads onto Samsung’s pricey fridges",
        "score": 285,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They won't stop until we have ads in our dreams.",
                "author": "milesprower06"
            },
            {
                "raw_content": "> Samsung currently lists nine Family Hub refrigerators in the US, which have MSRPs ranging from $1,800 to $3,500. Family Hub fridges have 21.5- or 32-inch screens, which, until now, users have had autonomy over for displaying helpful or fun things, like photos and videos, memos, weather, timers, and a web browser. Some of those abilities require a Wi-Fi connection or a Samsung account. > Now, Samsung is commandeering some of the screens already set up in homes to display ads. ... > Another option is to disconnect the fridge from the Internet. Again, though, this would eliminate some core capabilities, like its meal planner, recipes, and shopping list features.",
                "author": "Blueberryburntpie"
            },
            {
                "raw_content": "Please don't buy a refrigerator with a screen...",
                "author": "MissingGhost"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nvidia and Intel announce jointly developed 'Intel x86 RTX SOCs' for PCs with Nvidia graphics, also custom Nvidia data center x86 processors — Nvidia buys $5 billion in Intel stock in seismic deal",
        "score": 2172,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Well that’s a headline I didn’t expect.",
                "author": "imKaku"
            },
            {
                "raw_content": "Welcome back Kaby Lake-G",
                "author": "42177130"
            },
            {
                "raw_content": "*For consumer markets, Nvidia will provide Intel with a custom graphics chip that Intel can package with its PC central processors with the same speedy links, potentially giving it an edge against rivals such as AMD.* https://www.reuters.com/world/asia-pacific/nvidia-bets-big-intel-with-5-billion-stake-chip-partnership-2025-09-18/ This doesn’t look good for Intel graphics division.",
                "author": "kazolgue"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "NVIDIA's $5B Intel Investment Reveals x86-GPU NVLink Project",
        "score": 107,
        "text_content": "From Techpowerup \"NVIDIA's surprise $5 billion investment in Intel today came with an unexpected revelation - **the two companies have been quietly working together for almost a year on fusing x86 CPUs with RTX and data center GPUs through NVLink. The result? Actual system-on-chip designs that could finally break the PCIe bottleneck that's been holding back AI servers.** NVIDIA will handle the heavy lifting on design and manufacturing of these hybrid chips, integrating NVIDIA's NVLink directly into Intel's x86 silicon. It's basically the same approach NVIDIA already uses with their Vera processors (Arm + Blackwell GPUs), except now they're doing it with Intel's x86 cores instead of custom Arm designs. Anyone who's worked with current GPU servers knows the pain points. PCIe connections between CPUs and GPUs create bandwidth choke points, add latency, and make memory management a nightmare for AI workloads. These new chips bypass all that with direct GPU-CPU communication and shared memory pools. The target market isn't just data centers either. Intel mentioned both server and client applications, which suggests we might see this tech trickle down to gaming laptops and workstations eventually. For now though, the focus is clearly on machine learning clusters and HPC installations where PCIe bandwidth is already maxed out. **AMD won't be thrilled about this development. They've been pushing their own CPU-GPU integration story, but this Intel-NVIDIA combo could leapfrog their efforts entirely.** The manufacturing question remains murky though. **When pressed about using Intel's fabs for production, Intel CEO Lip-Bu Tan gave a diplomatic non-answer about \"perfecting the process\" first.** Reading between the lines, TSMC will probably keep making the actual chips for both companies, at least initially. Jensen said that basically for the start, NVIDIA will buy a CPU chip then sell a unified CPU plus GPU chiplet.\" TLDR: Nvidia and Intel have been developing NvLink integration directly into Intel's x86 CPU'S allowing AI GPU's to bypass the slow/low bandwidth PCie 5.0 bus (joint development started about a year ago) **for rack based x86-64 AI GPU solutions** Massive win for Intel and Nvidia, huge loss for AMD",
        "comments": [
            {
                "raw_content": "So here is how the deal works as said from the press conference. Nvidia and Intel will devolop custom x86 CPU. These will bought buy by Nvidia to use in Servers. This is different from before where Nvidia bought Intel Server CPUs from the open market and channels. Now Nvidia will buy directly from Intel. Nvidia will sell RTX chiplets to Intel, which Intel will use in laptop CPUs. Laptops were the only products that were mentioned. Nothing on Desktop, which makes sense as desktop chips dont really need them. This also means laptop HX series series won't have them. They were paired with a dGPU anyway. So where the RTX chiplets are going be used are the H, U and V series alternates.",
                "author": "From-UoM"
            },
            {
                "raw_content": "NVLINK on CPUs has always been nvidia's end goal. 10 years ago the only CPU manufacturer that wanted to implement a proprietary single vendor replacement to PCIe on their silicon was IBM when you could option out a POWER9 chip with NVLINK. the ARM buyout was another attempt at usurping the ARM ecosystem and putting NVLINK on the entire ARM ecosystem. grace and vera is a stopgap since no external customer is buying just those chips. now that intel's on board, i think jensen is finally getting his way.",
                "author": "randomkidlol"
            },
            {
                "raw_content": "The bias here is insane. Seems like everyone wants AMD to lose. Watch out for what you wish for when monopolies are allowed to operate.",
                "author": "Lisaismyfav"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel says blockbuster Nvidia deal doesn't change its own roadmap",
        "score": 181,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wonder if this means Intel dGPUs will be AI inference focused which they can fill a niche with good returns?",
                "author": "Dangerman1337"
            },
            {
                "raw_content": "Pretty obvious Intel wasn't going to put a Nvidia GPU tile in every SoC Is just discrete dead? For gaming probably What about mid range Intel APU's like LNL. ARC is probably going to be there, battle mage works quite well in that sized gpu Nvidia GPU's are probably for Halo tier products, new 'AI' computers like AMD is offering, and maybe high end gaming laptops that focus on power consumption",
                "author": "SlamedCards"
            },
            {
                "raw_content": "Like i said in the last thread, Intel is very obviously not giving up on iGPUs. Now dGPUs? I have no idea",
                "author": "Raikaru"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Digital Foundry] AMD's Most Powerful APU Yet - Strix Halo/Ryzen AI Max+ 395 - GMKTec Evo-X2 Review",
        "score": 85,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I think the more valuable thing for AMD than this product in itself is testing the new chiplet interconnect on a hardware level which will probably guide Zen 6 development.",
                "author": "EloquentPinguin"
            },
            {
                "raw_content": "How loud are the systems pulling 180W?",
                "author": "NeroClaudius199907"
            },
            {
                "raw_content": "The RDNA3.5 8060S found in Strix Halo, at a TDP of 120W (dynamic between CPU+GPU) performs in raster similarly to an RTX 4060 desktop (that's around 100W with a 9800X3D). The die housing the GPU, IO, media engine, NPU etc. is \\~305m2 while AD107 is 159mm2. Though with power the sweet spot is more 50-85W, Perf/watt in gaming is impressive, but you can argue die area not so much. Also, since just hearing the Nvidia and Intel news, honestly really excited for this space in RTX chiplets used for future Intel SOCs. RDNA 3.5 can hold itself well, but hopefully this pressures AMD to be more aggressive with their future SOC designs. They already have a new packaging direction, even going as far as redesigning Zen 5 CCDs on Strix Halo with their new IFOP replacing GMI, so going for X3D + not lagging behind their dGPUs not wasting time on RDNA3.5+ and going for RDNA5 and hell why not add 512-bit bus should be interesting.",
                "author": "Noble00_"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "What if AMD FX had \"real\" cores?",
        "score": 61,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TL;DW - An OEM only CPU called the FX-4200 has four modules with four integer units, four floating point units, and access to all the cache. In synthetic FPU benchmarks, it dominates over the FX-4350. In gaming there isn't much a difference.",
                "author": "Oligoclase"
            },
            {
                "raw_content": "Phenom 2 was pretty damn good and AMD might have held up better by doing a die shrink refresh of it rather than gambling on the weirdness of Bulldozer. It might have saved them some desperately needed money too that could have been better invested in a good successor architecture. I'm fairly sure the only reason the shared fpu thing happened was to save die space and therefore money as AMD were up shit creek at the time financially.",
                "author": "SignalButterscotch73"
            },
            {
                "raw_content": "That 40 seconds at the start of the conclusion felt like it 10 minutes long.",
                "author": "BeerGogglesFTW"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[News] TSMC Reportedly Denies Halting 2nd Phase of Chiayi, Taiwan Packaging Plant Amid U.S. Expansion",
        "score": 4,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"Of course we're not holding further development work hostage against a guarantee that ICE will keep the fuck away from our people, why would anyone think that?\"",
                "author": "INITMalcanis"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung Exynos 2600 2nm Chip Enters Mass Production This Month",
        "score": 45,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Samsung's 3nm node in the exynos 2500 is a good bit behind N3E, hopefully with their \"2nm\" they are able to catch up.",
                "author": "Geddagod"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[iFixit] Did We Find the iPhone Air's Battery? Inside the iPhone Air MagSafe Battery",
        "score": 11,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is this AI? Why are you pronouncing words like that?",
                "author": "Canadian_Border_Czar"
            },
            {
                "raw_content": "Why is it they put in that glue that releases when you run 12v through it in a product that was clearly designed to never be serviced?",
                "author": "ClickClick_Boom"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "To newcomers interested in Metroid Prime 4, the original Trilogy isn't needed.",
        "score": 306,
        "text_content": "Just wanted to say the story of Prime 1-3 was completed by Prime 3, as [confirmed by Kensuke Tanabe, the series producer, a decade ago](https://www.eurogamer.net/next-proper-metroid-prime-would-likely-now-be-on-nx): \"The stories of >!Dark Samus and Phazon!< are done now,\" The post credits scene of Prime 3 teased Sylux from Prime Hunters (DS game), and Federation Force (3DS game) set up the plot of Prime 4 by further teasing Sylux (amongst other things). Tanabe went on to say Prime 4 would be about Sylux, the Federation, and of course, Samus. He actually talked quite extensively about his ideas for Prime 4 a decade ago, and all the trailers for Prime 4 have followed up on those ideas. With this in mind, know that Prime 4 is positioning itself to be the start of a new arc, and shouldn't require the previous games to understand (though of course, there could be more we don't know yet). As much as I want Prime 2&3 Remastered, the (presumed) absence of them shouldn't scare newcomers away from Prime 4, since their plots have ended.",
        "comments": [
            {
                "raw_content": "Interesting. I’m almost surprised they stuck with called it prime 4. But I commend them for sticking with it. A lot of other big devs/publishers would shy away from the numerical value thinking it would alienate people “if I haven’t played the other 3, I won’t know what’s going on in this one”.",
                "author": "shrek3onDVDandBluray"
            },
            {
                "raw_content": "That is actually very good to know, I've never played a Metroid game outside of a bit of zero mission and was worried I would be missing vital context. Knowing this now though I'm almost definitely getting this game on release.",
                "author": "Reasonable_Rate2685"
            },
            {
                "raw_content": "Good Lord it’s been almost 20 years since Prime 3.",
                "author": "Chuck-Hansen"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "For those who never played these on the Wii, are you hyped?",
        "score": 573,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yeah, looks like a good time.",
                "author": "GothMenace"
            },
            {
                "raw_content": "Yep, already ordered. Game is priced low in the UK too (£48 physical).",
                "author": "EvilTaffyapple"
            },
            {
                "raw_content": "I loved Galaxy 1, never played 2. So I'll be playing it. I originally dropped it because it lacked the cinematic feel of the first game, but I heard the gameplay is good so I'll give it a shot",
                "author": "darkfawful2"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "IT'S BANANZA TIME",
        "score": 153,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ohhh Zebraaaaa Zebraaaaaaa ZEBRAAAAAAAA",
                "author": "humantotem"
            },
            {
                "raw_content": "Zebra, Ostrich, Kong, and Heart of Gold? Hell yes",
                "author": "Rawkhawkjayhawk"
            },
            {
                "raw_content": "Happy we got 9 tracks... but like, come on, just do the whole thing at that point 😭 what yall building hype to the game already out",
                "author": "isssomebodyhere"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Sonic Racing double standard",
        "score": 35,
        "text_content": "DLC announced before release. Where's the blind hatred?",
        "comments": [
            {
                "raw_content": "Crossworlds did get criticised for its season pass content though, when it first got announced.",
                "author": "TheLimeyLemmon"
            },
            {
                "raw_content": "Games like cod always had a season pass option promoted before each of their games launched, ever since PS3/360",
                "author": "shadowsipp"
            },
            {
                "raw_content": "This is a Nintendo sub, the only major talks you'll find are about Nintendo games",
                "author": "darkfawful2"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Switch 1 games slowly starting to come out with red cases now",
        "score": 95,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I saw the gta trilogy on a red case too, funny coincidence we both saw rockstar games",
                "author": "Vanilla_Baunilha"
            },
            {
                "raw_content": "Wish your game would get a 60fps switch 2 patch... with gyro aiming. That'd be neat",
                "author": "popcorns78"
            },
            {
                "raw_content": "Does that mean at the bottom right it is a code now? My RDR switch game is a cartridge.",
                "author": "Plastic_Yesterday434"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "List of current and future game with 120 FPS support as of September 18th",
        "score": 78,
        "text_content": "Currently available now for purchase [Handy Hockey](https://www.nintendo.com/us/store/products/handy-hockey-switch-2/) Digital Only [Switch 2 Welcome Tour](https://www.nintendo.com/us/store/products/nintendo-switch-2-welcome-tour-switch-2/) Digital Only [Vampire Survivors by Poncle](https://youtu.be/GFeHlz31KRk?si=LnS4rn2_ea22VnOi) Digital Only. [Hollow Knight Silksong by Team Cherry](https://youtu.be/6XGeJwsUP9c) Digital Only at the moment, physical coming later Upcoming Games with trailers. [Hades 2 Switch 2 Edition](https://youtu.be/jEE4rBEzKM4?si=ybjryTTTqoT7XSWn)releasing September 25, Digital and Physical releasing Novermber 20 [Majogami by Inti Creates ](https://youtu.be/r9b7m8HK67o)releasing October 30, Digital and Physical that has to be imported. [Mina The Hollower by Yatch Club Games](https://youtu.be/lT8suGTzYN0) releasing October 31, Digital Only. [Metroid Prime 4 Beyond Nintendo Switch 2 Edition ](https://www.youtube.com/watch?v=kJNCNswbdG0)releasing December 4, Digital and Physical [Card En Ciel Nintendo Switch 2 Edition by Inti Creates](https://youtu.be/yZTbfnoR-do) releasing January 29, Digital and Physical that has to be imported. [Ys X Proud Nordics by Falcom](https://youtu.be/TjgJnBtV-j4?si=5R1qZO7XcoaaTVlw) releasing Early 2026, Digital and Physical Game Key Card.",
        "comments": [
            {
                "raw_content": "Vampire survivors is technically 120fps Even though it only hits 120 at the start and stays at around 80 to 100 fps later in a match would it count?",
                "author": "zaadiqoJoseph"
            },
            {
                "raw_content": "Also some games use the 120hz output but for other reasons. Cyberpunk uses it for a 40 FPS perf mode. Street Fighter runs the game in a 120hz container for lower input lag. There may be more but that’s as far as I know",
                "author": "cdr1307"
            },
            {
                "raw_content": "Going to be interesting seeing these lists around the launch window compared to the amount of 60 and 120 fps games that’ll be on S2 by the end of its lifecycle",
                "author": "PaleFondant2488"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Sonic Racing: CrossWorlds Review (IGN: 9/10)",
        "score": 241,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Here's a bunch of reviews 9 - PSU 9 - TheGamer 9 - TechRadar 8.5 - CGM 8.5 - PSX Brasil 8.5 - Game Informer 8 - VGC 8 - Digitec 8 - Shacknews 8 - Push Square 8 - GamesRadar 8 - DualShockers",
                "author": "jaybizzleeightyfour"
            },
            {
                "raw_content": "When see more SEGA Character then I'll purchase.",
                "author": "Alarming-Active-5909"
            },
            {
                "raw_content": "Funny how Reddit feels about IGN depending on what narrative they want to push",
                "author": "soyboysnowflake"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Well, thats one way to get on the roof...",
        "score": 57,
        "text_content": "",
        "comments": [
            {
                "raw_content": "These are always my favorite kind of glitches.",
                "author": "KelvinBelmont"
            },
            {
                "raw_content": "Why are you confused? This is a nintendo console , it permeates Mario through all games. Just make sure you shout jahoooo! 🤣😂👍",
                "author": "No-Giraffe-6518"
            },
            {
                "raw_content": "Yep, definitely a Ubisoft game",
                "author": "Zyvyn"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Image of an apparently leaked Resident Evil Requiem document has been posted on 4chan. Doesn't show much...except for the design of a certain returning character that's rumoured to be in the game.",
        "score": 557,
        "text_content": "[https://imgur.com/a/CtVYToc](https://imgur.com/a/CtVYToc)",
        "comments": [
            {
                "raw_content": "Big Boss lookin ass",
                "author": "MaverickHunterBlaze"
            },
            {
                "raw_content": "Metal gear kennedy",
                "author": "ZSoulZ"
            },
            {
                "raw_content": "Delivery Date: May 14, 2025 Project Release: Confirmed CONFIDENTIAL Our team is dedicated to developing realistic game characters and biological models, focusing on delivering a top-tier survival horror gaming experience. Relying on Capcom’s cutting-edge technology and the strong appeal of the Resident Evil franchise, we meticulously build immersive worlds. From terrifying creatures to vividly lifelike human characters, our models bring the horror and tension of Resident Evil to life. The precision and detail in our modeling and rendering have received recognition across the industry. Every scar, every wrinkle, and every lifelike expression are carefully designed. Whether in tense horror atmospheres, thrilling combat encounters, or chilling exploration, Resident Evil’s biological modeling ensures players experience an immersive and terrifying reality. The group is committed to pushing realism and immersion in gaming, paving the way for a new chapter in the Resident Evil series. The team’s modeling performance is exceptional, with remarkable detail and lifelike results. Their skill in capturing the essence and horror style of Resident Evil makes them a top production partner or ideal collaborator for future works. — Capcom Representative Display & Sharing: August 2025 (Side note in box with red outline, rough translation:) With photorealistic biological models and high-end rendering technology, we’ve brought Resident Evil’s horror atmosphere to life. Every model—whether terrifying creatures or R.P.D. officers—has been meticulously crafted, fully demonstrating our technical strength. ..",
                "author": "Birkin92"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Tom Henderson says Kratos in the next mainline God of War game will have a curved Egyptian sword",
        "score": 523,
        "text_content": "Source: [https://www.youtube.com/clip/UgkxdwSrekl0R23Mc47mITmVKTjD7oQUKKDe](https://www.youtube.com/clip/UgkxdwSrekl0R23Mc47mITmVKTjD7oQUKKDe)",
        "comments": [
            {
                "raw_content": "#Tom Henderson is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Ok cool but will he keep the 3rd weapon from Ragnarok.",
                "author": "Liquids_Patriots"
            },
            {
                "raw_content": "Have you seen those warriors from Egypt? They have curved swords..CURVED SWORDS",
                "author": "TheBrickHog"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Valve created a new Steam Sub that includes various VR and non-VR games. Also, the Steam client has received updates to: reporting body tracker usage to the hardware survey, the SteamVR link dongle, and RemotePlayTogether \"groups\"",
        "score": 191,
        "text_content": "Source: [https://xcancel.com/SadlyItsBradley/status/1968781269510070704/photo/1](https://xcancel.com/SadlyItsBradley/status/1968781269510070704/photo/1) >Valve created a new Steam Sub that comes with a small/interesting list of games.. I wonder if that’s a press package or something 🤷 >Steam client also got updates to: >Reporting Body Tracker usage to the hardware Survey >The SteamVR Link Dongle >RemotePlayTogether “Groups” [Steam Sub game list:](https://steamdb.info/sub/1419481/history/) * Beat Saber * Boomerang Fu * Cyberpunk 2077 * Hades II * Half-Life: Alyx * Hogwarts Legacy * Hollow Knight: Silksong * Horizon: Forbidden West * Path of Exile 2 * Portal 2 (+ the Portal 2 Sixense MotionPack DLC which hasn't been available for new players in over a decade) * SUPER BOMBERMAN R2 * Streets of Rage 4 [Previous rumors and data-mining](https://xcancel.com/SadlyItsBradley/status/1963491451049771216) pointed to spatial gaming being a big thing for the Deckard/Frame (essentially playing your regular flatscreen games on a virtual MR screen), so that could be an explanation for why non-VR games are included on this sub list (if it is indeed some sort of press package) Photos from the above tweet: * [https://i.imgur.com/wYzl8gq.jpeg](https://i.imgur.com/wYzl8gq.jpeg) * [https://i.imgur.com/5i2KmLZ.jpeg](https://i.imgur.com/5i2KmLZ.jpeg) * [https://i.imgur.com/KdYcRLH.jpeg](https://i.imgur.com/KdYcRLH.jpeg)",
        "comments": [
            {
                "raw_content": "Gabe wants to track my body? 😳",
                "author": "scorchedneurotic"
            },
            {
                "raw_content": "I'm gonna fall for it again, aren't I?",
                "author": "Jackal239"
            },
            {
                "raw_content": "God I hope they got something lined up soon",
                "author": "kodan_arma"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Megaman coming to Sonic Racing CrossWorlds",
        "score": 294,
        "text_content": "The remaining crossovers that were to be announced seem to have been leaked. Looks like early physical copies are in the wild and include a placard showing the upcoming dlc. The game is officially released on September 25. https://www.reddit.com/r/SonicTheHedgehog/s/aix7kNQWlP Edit: Looks like the leaks are slowly getting deleted. This comment is still up. https://www.reddit.com/r/SonicTheHedgehog/s/psSTzCJXle",
        "comments": [
            {
                "raw_content": "Everything but his home series lol",
                "author": "LuigiWarrior"
            },
            {
                "raw_content": "Anyone got a mirror of the image?",
                "author": "SuperSaberman7"
            },
            {
                "raw_content": "![gif](giphy|hVOEFN0iGa7e5bafyd)",
                "author": "Eagles5089"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "SEGA looking to implement Generative AI in game projects",
        "score": 40,
        "text_content": "[A recent Rovio job listing confirms that SEGA of Europe and SEGA of Japan](https://www.rovio.com/open-positions/director-ai-lab-8748cf73-21f9-49c0-b30e-4f18546bd06e/) are directly collaborating in terms of how to incorporate Generative AI in both companies’ game projects. >Instigating and driving a prioritized roadmap of AI projects across new games, live games, and game service from exploration through to productization. >Working with our leadership to refine and execute Rovio’s long-term AI strategy, identifying key opportunities, investments, and gaps across the business. >Leading and championing AI initiatives in collaboration with domain experts and “AI Champions” across Games, Transmedia, Marketing, Tech and more. >Managing and mentoring a small, specialized AI team with direct reports and dotted-line contributors. >Exploring and applying emerging AI technologies and methodologies across the business. >Fostering collaboration with SEGA of Europe and SEGA of Japan to leverage their Gen-AI work for Rovio. >Transitioning into this newly created role by setting the foundation for this dedicated AI team.",
        "comments": [
            {
                "raw_content": "This is dog shit",
                "author": "Decimator1227"
            },
            {
                "raw_content": "Gonna have a Yakuza sidestory where Ichiban discovers AI art and beats up people over it and then we all learn a lesson",
                "author": "J_Linebeck"
            },
            {
                "raw_content": "Welp. There goes another game company that I'm no longer going to support.",
                "author": "OpeningConnect54"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Microsoft Flight Simulator coming to PS5",
        "score": 428,
        "text_content": "Source: [https://www.ppe.pl/news/383315/wiemy-jaki-kolejny-ex-microsoftu-trafi-na-ps5-co-z-pudelkami-oblivion-remastered.html](https://www.ppe.pl/news/383315/wiemy-jaki-kolejny-ex-microsoftu-trafi-na-ps5-co-z-pudelkami-oblivion-remastered.html) Text: We’ve just received information from user Graczdari that lets us reveal which Microsoft exclusive will be the next to land in the hands of PlayStation 5 owners. The Redmond corporation is planning to bring Sony fans **Microsoft Flight Simulator 2024** in the coming weeks! According to early reports, the new edition is set to launch later this year - specifically in November. Microsoft Flight Simulator 2024 will be available in physical copies, but as is often the case with Microsoft-published titles, the print run won’t be massive. At the same time, we’d like to mention the physical version of **TES IV: Oblivion Remastered**, which we previously reported on. Microsoft has decided to hold back on sharing details, which is why pre-orders haven’t yet opened. Based on our own sources, however, the game is already being “listed” by retailers, so the announcement shouldn’t be a distant prospect - it’s more likely a matter of days or weeks.",
        "comments": [
            {
                "raw_content": "In the coming weeks??? Not sure if reliable source but day 1 purchase if true",
                "author": "Positive-Bluebird567"
            },
            {
                "raw_content": "Nate stated this earlier this year.",
                "author": "Bolt_995"
            },
            {
                "raw_content": "Finally I can cook fried chicken on my PS5",
                "author": "DependentHusky"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel says blockbuster Nvidia deal doesn't change its own roadmap",
        "score": 127,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not sure a single person actually believes that, because there is no way on earth Nvidia is letting them use capital from them to feed something that would compete with their own products, but hey, weirder things have happened. Best case scenario, Arc continues to exist as a \"totally not Nvidia 50/60 series\" cards for similar reasons Google pays handsomely to keep Firefox around.",
                "author": "-MooMew64-"
            },
            {
                "raw_content": "It's obvious the situation will be like Kaby Lake G. There are special SKUs which co-developed with Nvidia, but normal SKUs including the cheaper ones will use all Intel integrated solution. What i can see is maybe discrete GPU mobile market will be killed.",
                "author": "no_salty_no_jealousy"
            },
            {
                "raw_content": "Please continue with openvino",
                "author": "MycologistSilver9221"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Nvidia and Intel announce jointly developed 'Intel x86 RTX SOCs' for PCs with Nvidia graphics, also custom Nvidia data center x86 processors — Nvidia buys $5 billion in Intel stock in seismic deal",
        "score": 383,
        "text_content": "[https://www.tomshardware.com/pc-components/cpus/nvidia-and-intel-announce-jointly-developed-intel-x86-rtx-socs-for-pcs-with-nvidia-graphics-also-custom-nvidia-data-center-x86-processors-nvidia-buys-usd5-billion-in-intel-stock-in-seismic-deal](https://www.tomshardware.com/pc-components/cpus/nvidia-and-intel-announce-jointly-developed-intel-x86-rtx-socs-for-pcs-with-nvidia-graphics-also-custom-nvidia-data-center-x86-processors-nvidia-buys-usd5-billion-in-intel-stock-in-seismic-deal)",
        "comments": [
            {
                "raw_content": "Holy moly. This is news that no one would expect at all! This deal is massive for Intel because it benefits their chip foundry and CPU. However it makes me concerned with their consumer GPU division. I love my MSI Claw with Intel chip, it trade blows with Amd handheld. Even Claw 8 AI+ with Lunar Lake still able to put Amd newest chip like Z2E to the shame. I really hope Arc division will stay, can't let Nvidia to keep being monopoly GPU market!",
                "author": "no_salty_no_jealousy"
            },
            {
                "raw_content": "Out of nowhere",
                "author": "PTLove"
            },
            {
                "raw_content": "So Intel GPUs are now dead.... again...",
                "author": "DUFRelic"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel and NVIDIA to Jointly Develop AI Infrastructure and Personal Computing Products",
        "score": 186,
        "text_content": "Additionally, NVIDIA is going to invest $5B in Intel common stock at $23.28 per share",
        "comments": [
            {
                "raw_content": "*For data centers, Intel will build NVIDIA-custom x86 CPUs that NVIDIA will integrate into its AI infrastructure platforms and offer to the market.* Will NVIDIA drop the development of their ARM CPUs? *For personal computing, Intel will build and offer to the market x86 system-on-chips (SOCs) that integrate NVIDIA RTX GPU chiplets. These new x86 RTX SOCs will power a wide range of PCs that demand integration of world-class CPUs and GPUs.* Will INTC drop the development of their Xe GPUs? Time will tell.",
                "author": "_redcrash_"
            },
            {
                "raw_content": "NANA is flying",
                "author": "Weikoko"
            },
            {
                "raw_content": "So, something to rival Apples unified memory finally on x86. would be a gamechanger for AI atleast, NPUs went nowhere. Still I hope these are somewhat extensible as a platform.",
                "author": "grumpoholic"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "ASUS introduces 1.35-liter mini PC with desktop LGA-1851 (Core Ultra 200S) CPU support",
        "score": 48,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don't understand why you can't even get high speed ethernet as an option on these.",
                "author": "ThreeLeggedChimp"
            },
            {
                "raw_content": "This subreddit is in manual approval mode, which means that **all submissions are automatically removed and must first be approved before they are visible**. Your post will only be approved if it concerns news or reviews related to Intel Corporation and its products or is a high quality discussion thread. Posts regarding purchase advice, cooling problems, technical support, etc... will not be approved. **If you are looking for purchasing advice please visit /r/buildapc. If you are looking for technical support please visit /r/techsupport or see the pinned /r/Intel megathread where Intel representatives and other users can assist you.** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/intel) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD Software: Adrenalin Edition 25.9.2 Release Notes",
        "score": 333,
        "text_content": "# New Product Support * AMD Radeon™ RX 7700 # Highlights * **New Game Support** * Dying Light: The Beast * **Fixed Issues** * Corruption may appear while playing games based on the Godot engine with Vulkan. * Intermittent application crash may be observed while playing Cronos: The New Dawn with Ray Tracing enabled on Radeon™ RX 9070 series graphics products. * Failure to launch may be observed while using the Oasis Driver with Windows Mixed Reality headsets. # Known Issues * Intermittent application crash may be observed while playing The Last of Us Part II on Radeon™ RX 7900 series graphics products. * Intermittent application crash may be observed while playing NBA 2K25 in MyCareer mode on Radeon™ RX 9070 series graphics products. AMD is actively working on a resolution to be released as soon as possible. * Intermittent application crash may be observed while playing FBC: Firebreak on some AMD Ryzen™ processors such as the Ryzen™ AI 300 series and the Ryzen™ 8000 series. * Corruption (missing scan travel lines) may be observed while playing GTFO™ on Radeon™ RX 7000 series graphics products. * Intermittent application crash or driver timeout may be observed while loading a saved game in Cyberpunk 2077 with Path Tracing enabled. * Stutter may be observed while playing games with some VR headsets at 80Hz or 90Hz refresh rate on some AMD Radeon™ Graphics Products such as the Radeon™ RX 7000 series. Users experiencing this issue are recommended to change the refresh rate as a temporary workaround. * Intermittent system crash may be observed while playing World of Warcraft while watching YouTube on Radeon™ RX 7900 GRE graphics products. * Intermittent application crash may be observed while playing games with EA Javelin anticheat and Radeon™ Anti-Lag enabled on some AMD Graphics Products. Users experiencing this issue are recommended to disable Radeon™ Anti-Lag as a temporary workaround. # Package Contents * AMD Software: Adrenalin Edition 25.9.2 Driver Version [25.10.25.15](http://25.10.25.15) for Windows® 10 and Windows® 11 (Windows Driver Store Version 32.0.21025.15011) * Ryzen™ AI NPU MCDM Driver version 32.00.0203.297 (Date: 2025-08-15)",
        "comments": [
            {
                "raw_content": ">Failure to launch may be observed while using the Oasis Driver with Windows Mixed Reality headsets. I need to head over to the r/WindowsMR and see if this allows Oasis to work.",
                "author": "TheZoltan"
            },
            {
                "raw_content": "AMD Radeon™ RX 7700 ?",
                "author": "ManagerGlittering745"
            },
            {
                "raw_content": "Boy, that's a lot of intermittent crashes.",
                "author": "Cj15917"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD launches Radeon RX 7700 with 2560 cores and 16GB memory - VideoCardz.com",
        "score": 245,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What a strange late addition to the line up. Bunch of left over Navi 32 chips laying around I suppose. Interesting that they’d change the memory configuration though.",
                "author": "RevolutionaryCarry57"
            },
            {
                "raw_content": "Itll be a 5060 competitor but with 16gb, since its on an older node means it should be cheaper too, idk why people are complqining, this is great. If they put it at 279 it wouldnt be so bad",
                "author": "PollShark_"
            },
            {
                "raw_content": "Pricing will dictate how well this product does. $225 and it will sell like hotcakes. $270 is okay value and it will entice possible 5060 buyers with the extra VRAM at the expense of features and a small amount of performance. $300 and it won't move the needle.",
                "author": "rip-droptire"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "MSI B850MPOWER Motherboard Review – $259 Is What You Pay For The Best Overclocking mATX AM5 Motherboard",
        "score": 40,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Finally solid mATX motherboard. No nonsense features, pure quality and performance. Passive cooling, TPM header, good overclocking - time to start a new build",
                "author": "lutel"
            },
            {
                "raw_content": "yay, finally :)",
                "author": "riba2233"
            },
            {
                "raw_content": "I've always wondered why there are no mATX motherboards with X870 or X870E (or the current top tier) chipsets, it's been years since I've wanted to have an AMD build with a mATX mobo, but the lack of those has kept me away.",
                "author": "C0NIN"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Americans Owe a Staggering $1.66 Trillion in Auto-Related Debt, According to New Report",
        "score": 225,
        "text_content": "You can live in a car, but you can't drive a hoom.",
        "comments": [
            {
                "raw_content": "Health insurance, housing, college tuition, these are things that at the end of the day, large forces prey on the weak to extract wealth. On cars I'm a little more Dave Ramsey manage your own budget responsibly. I can't tell you how many rent burdened jackasses in my area I see leasing Ford raptors. Used civics exist.",
                "author": "SelenaMeyers2024"
            },
            {
                "raw_content": "I will never understand why people buy vehicles that are 2 to 3 times the price of sedans who don't need them though. Its very strange to me",
                "author": "BearBL"
            },
            {
                "raw_content": "Thank the idiots who buy $79k trucks and try to park it in the small parking space in their apartment. All of that is financial illiteracy at its finest.",
                "author": "VendettaKarma"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "$67K to sell a home? Consumers drastically underestimate the costs",
        "score": 45,
        "text_content": "",
        "comments": [
            {
                "raw_content": "These costs are essentially baked into the price. Which is why people won’t sell at a loss unless they need to for extenuating circumstances.",
                "author": "WordWithinTheWord"
            },
            {
                "raw_content": "The average pre-sale repair cost is over $21,000? I see that my boomer parents weren't the only ones who deferred maintenance.",
                "author": "Happy_Confection90"
            },
            {
                "raw_content": "Averages can be deceiving. I am not now or never have been one to defer maintenance, but rather keep everything kept in a state that lets me avoid the heartache of catastrophic repairs. HVAC serviced annually, landscaping and outdoor maintenance kept up, and things like painting, pets control, and keeping things in order are just things that a homeowner should stay on top of. I do not have a mortgage, valuation is between 950K and just over 1 million. All that being said, I am retired and have no intention of selling, but want to make sure, that I can enjoy the respit a well maintained home offers me.",
                "author": "Aromatic_Tomato8651"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage rates spike +0.15 to 6.37% after strong economic data reported",
        "score": 139,
        "text_content": "Another volatile day for mortgage rates. https://www.mortgagenewsdaily.com/mortgage-rates https://www.mortgagenewsdaily.com/markets/mbs-morning-09182025",
        "comments": [
            {
                "raw_content": "\"oh good, now you can all afford to pay more\" -lenders",
                "author": "Suspicious-Engineer7"
            },
            {
                "raw_content": "lol",
                "author": "gk_instakilogram"
            },
            {
                "raw_content": "Glad I locked my shit on Tuesday when it was “baked in”.",
                "author": "Cosmic_Gumbo"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Housing panic grips Sunbelt states as property prices plummet",
        "score": 295,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is so silly. Prices dropping or leveling off after a 200% or more price appreciation over a couple of years is NOT a housing crisis.",
                "author": "No_Series3763"
            },
            {
                "raw_content": "The areas that saw the bubble first will be the first to pop. My city didn't see a change during the GFC, but somehow blew up after COVID. They'll get their first taste of a housing crash in short order.",
                "author": "Likely_a_bot"
            },
            {
                "raw_content": "This is a good thing Everything except the Florida condos is just normalization.",
                "author": "adultdaycare81"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The average American homeowner lost $9,200 in home equity during the last year. It’s not a collapse but a 'long-term market correction' | Fortune",
        "score": 116,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It is interesting insofar that a minor reduction in equity is meaningless to a home owner if there are no plans to sell or move. If home values go down significantly there may be an advantage to lower valuation assessemnts for tax purposes. For folks looking to buy, a loss in valuation may result in an inventory reduction for home resale. Bigger issues for the public are inflation and a slowing labor market.",
                "author": "Aromatic_Tomato8651"
            },
            {
                "raw_content": "Just like the increase in equity that homeowners had over the past few years, none of this matters until you go to sell (or you decide to take a HELOC which would be a questionable decision nowadays due to rates). It may delay people's decisions to sell, though, if they're not going to get the price they want.",
                "author": "Quixlequaxle"
            },
            {
                "raw_content": "Houses aren’t stocks. You shouldn’t be buying them to gain or lose. It’s a home. People who bought hoping to make a profit and are freaking out about this are the reason why regular folks can’t buy a home anymore. If they lose, oh well. Boo-freaking-hoo!",
                "author": "Diligent_Ad6552"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "“Clearly, the housing industry needs the Fed to cut interest rates further to help the housing market recover.”",
        "score": 59,
        "text_content": "https://on.mktw.net/48n2aDC - ‘This Fed has its head in the sand’ — but at least now we know where to invest I sure hope the housing market recovers soon guys.",
        "comments": [
            {
                "raw_content": "Yeah they don’t care about real inflation, stagflation none of it. Protect the housing and stock market at literally all costs. Fuck the poor feeders, let them eat cake.",
                "author": "VendettaKarma"
            },
            {
                "raw_content": "The long term bond markets are the reason. The rate cut just fueled the equities markets. There’s no flight to safety in bonds. Until we see a bear market in equities, I wouldn’t count on bonds retreating anytime soon. As much as I believe this is a very frothy equities environment",
                "author": "ManufacturerOld3807"
            },
            {
                "raw_content": "Homes have been very unaffordable. Based on current mortgage rates and home prices you would need income over six figures to afford the median priced home.",
                "author": "SudokuPulse"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "US Initial Jobless Claims Drop by Most in Almost Four Years",
        "score": 52,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'll wait for the revision numbers thank you very much especially when we had a revision recently of almost 1 million jobs. Also, the FED made the quarter point cut for risk management because there were concerns about the job market. This smells like BS all the way.",
                "author": "beardko"
            },
            {
                "raw_content": "Lmao these lies are absolutely flagrant. What will the revision be this time? 1.5 million?",
                "author": "VendettaKarma"
            },
            {
                "raw_content": "If we stop recording and publishing the numbers, jobless claims will go to zero. Problem solved",
                "author": "USMNT_superfan"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "10-year Treasury yield rises above 4.11% after jobless claims signal labor market in OK shape",
        "score": 24,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wait, I thought we got the news last week that market lost around 1 million jobs over a year. And fed cut the rate because job market sucks. No?",
                "author": "gk_instakilogram"
            },
            {
                "raw_content": "Didn't the fed just lower the interest .25 because of the terrible job market. Well I guess that was a mistake.",
                "author": "a_little_hazel_nuts"
            },
            {
                "raw_content": "Lmao the lies never end do they?",
                "author": "VendettaKarma"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Google DeepMind discovers new solutions to century-old problems in fluid dynamics",
        "score": 842,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's astonishing how many \"breakthroughs\" actually came from DeepMind. They really pushed the field forward, and even now, with everyone praising GPT5, they still keep research going. Demis is cooking.",
                "author": "alyssasjacket"
            },
            {
                "raw_content": "We need this breakthroughs in health very much.",
                "author": "AngelBryan"
            },
            {
                "raw_content": "It feels like there are so many things just waiting to be solved by AI",
                "author": "Educational-War-5107"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Anthropic just dropped a new ad for Claude - \"Keep thinking\"",
        "score": 598,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Anthropic has an interesting aesthetic. Trying to depict a new intimidating technology within a cozy and familiar frame. Basically blending the familiar with the unfamiliar.",
                "author": "10b0t0mized"
            },
            {
                "raw_content": "sick ad",
                "author": "BruceStephenStark"
            },
            {
                "raw_content": "That's a damn compelling framing for \"what AI is for\" for the average consumer, I dig it",
                "author": "aaqucnaona"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Suno has released the first teaser for v5, and it sounds amazing. They did this with v4 over a week or so before the release",
        "score": 182,
        "text_content": "[https://x.com/SunoMusic/status/1968768847508337011](https://x.com/SunoMusic/status/1968768847508337011)",
        "comments": [
            {
                "raw_content": "The voices sound a lot better, nice. That'd been the weakness of suno, as the music itself is getting good. You can still hear a metallic sound when the guys says \"singing\", tho",
                "author": "PwanaZana"
            },
            {
                "raw_content": "Woah... It feels like we just got v4.5+ 😮",
                "author": "Longjumping_Spot5843"
            },
            {
                "raw_content": "Yeah people are going to upload AI videos to Spotify and people will have a very hard time spotting them. We won't be able to distinguish. I believe the development of music gen will exactly like the image generation models. They became very good at generating cinematic images, but back then they were bad at casual / everyday images. They can do that now. The next frontier of music generation AIs will probably be creating not-perfect music, like out of rhythm drums, not perfectly tuned and mid-played instruments, okay-ish vocals, but good vibes in general.",
                "author": "BarisSayit"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "China's DeepSeek says its hit AI model cost just $294,000 to train",
        "score": 254,
        "text_content": "",
        "comments": [
            {
                "raw_content": "that's because you don't need a lot of RL compute if you already have a really strong base model. today anyone can train a pretrained model to decent AIME scores for a few hundred bucks.",
                "author": "fmai"
            },
            {
                "raw_content": "Maybe one small rl run",
                "author": "power97992"
            },
            {
                "raw_content": "From the article: >The Nature article, which listed Liang as one of the co-authors, said DeepSeek's reasoning-focused R1 model cost $294,000 to train and used 512 Nvidia H800 chips. A previous version of the article published in January did not contain this information. >Sam Altman, CEO of U.S. AI giant OpenAI, said in 2023 that what he called \"foundational model training\" had cost \"much more\" than $100 million - though his company has not given detailed figures for any of its releases.",
                "author": "TMWNN"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "In AI future, capital will be more important than your salary",
        "score": 37,
        "text_content": "The stock market just hit another all time high. Meanwhile, unemployment is high, while salaries and job opportunities are stagnate or worsening. I think this trend will continue as AI becomes more dominant. With AI replacing the need for human labor, the companies' need for human labor will decrease further and further, leading to value of human labor to decrease more year-by-year. The feds just cut interest rate hoping this will spark interest in companies to expand their operations by hiring more people. But what if this time, this doesn't work? That, instead, when companies decide to expand, they eschew hiring more people, and just expand more through AI help? Sure, maybe this rate cut won't lead to complete abandonment of reliance of human labor for economic expansion, but what about the next rate cut? And the the cut after that, once AI gets even more prevalent and easy to include in company workflow? What I am saying is, in future economic downturn, when the feds rate cuts hoping to stimulate companies to hire more people, what if AI disrupts this decades old technique, and rate cuts lead to zero increase in employment? Then what? Unemployment becomes something that nothing, not even the government can fix. Then, human labor no longer commands the same value. Only capital, the amount of stock you have in companies, matters. So in that very near future world, only the people who already have lots of stocks/real estate will survive, while the rest becomes more and more de-valued. And with the stock market having went up so much recently, how much more can it go at such a speed? Maybe its best days of growth are behind it, at least for the near future. Leading to those who already have capital now being locked into a stable financial life, while the rest, who rely on their labor, become more and more desperate to scrabble for some kind of lifelihood.",
        "comments": [
            {
                "raw_content": "Yes, it seems likely with increased automation human capital will depreciate and financial capital will appreciate. The timeline is less clear. Wealth lock-in is another concern. I don’t think there are good solutions for these problems right now.",
                "author": "Interesting_Yam_2030"
            },
            {
                "raw_content": "There is the theory of the permanent underclass and I think it's very plausible. You should try accumulating as much wealth as you can because there might be a permanent underclass forming that will be very hard to climb out of in the near future",
                "author": "Major-Bookkeeper3830"
            },
            {
                "raw_content": "Following the same logic as Pascal's wager, it turns out that it will be better to save money rather than not doing that. |**Your Choice**|**Future Scenario 1: AGI Emerges → UTOPIA with UBI**|**Future Scenario 2: AGI Emerges → DYSTOPIA (Each for themselves)**| |:-|:-|:-| |**You Choose to Save Aggressively**|**Outcome:** You have a UBI plus significant personal wealth, providing extraordinary freedom. **Gain/Loss:** Massive gain.|**Outcome:** You have savings to live on while many have nothing. **Gain/Loss:** Infinite gain, ensuring your survival and independence.| |**You Choose NOT to Save**|**Outcome:** You have only a UBI and are fully dependent on the system. **Gain/Loss:** Neutral/minor gain.|**Outcome:** You have no job and no savings. **Gain/Loss:** Infinite loss, leading to extreme financial hardship.|",
                "author": "Longjumping-Stay7151"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "AI creates 16 bacteria-killing viruses in Stanford lab",
        "score": 28,
        "text_content": "",
        "comments": [
            {
                "raw_content": "cool, but terrifying. not a huge leap to scale this up to multicellular life...",
                "author": "timshel42"
            },
            {
                "raw_content": "Ope. Diarrhea for everyone. Only a tiny fraction of all bacteria are harmful to us. Releasing such viruses would absolutely devastate all the bacteria, including the harmless and beneficial bacteria in our bodies.",
                "author": "opinionate_rooster"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Luma AI - This is Ray3 (SOTA Physics and controls)",
        "score": 77,
        "text_content": "",
        "comments": [
            {
                "raw_content": "[fighter pilot flying backwards is something](https://youtu.be/z2UIcD2xvsA?t=22)",
                "author": "Complex-Emergency-60"
            },
            {
                "raw_content": "What solution do they have for scene-to-scene consistency?",
                "author": "Some-Internet-Rando"
            },
            {
                "raw_content": "Free trial only lets you do \"draft\" which is shit g1 quality, no api access, watermarks even if you pay $10, it's not on any of the leaderboards so hard to tell how \"SOTA\" it really is, no API access on fal.ai or replicate...",
                "author": "General-Stay-2314"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Google Chrome launches new AI-first features",
        "score": 17,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nice",
                "author": "Psychological_Bell48"
            },
            {
                "raw_content": "trash browser no add block. would never use fuck them. firefox forever",
                "author": "HighOnBuffs"
            }
        ],
        "subreddit": "singularity"
    }
]