[
    {
        "post_name": "For the record: ICE made repeated attempts to have 5-year-old Liam Ramos released to his mother. She refused to take custody of her own child.",
        "score": 601,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Trash from Equador apparently have little parental instinct",
                "author": "Antero"
            },
            {
                "raw_content": "They actually took the boy to his house and everyone inside refused to open the door and take him in. Smells like probable cause.",
                "author": "TheMemesofProduction"
            },
            {
                "raw_content": "deport bloodline",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "US tech postings -36% below pre-COVID. India? +47%. We all feel the pressure in the labor market for US workers right now. Bookmark if you are pissed at the gaslighting. Let's start watching these levels every single month.",
        "score": 537,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Invest in India? Talk about flushing money down the toilet.",
                "author": "MAGA-Fett"
            },
            {
                "raw_content": "Working with Indians is absolute dogshit as well. Always has been, from engineering school on I realized they were just incredibly dishonest about their capabilities. I worked at a successful private startup company purchased by a public and the original (very euro/russian) personnel dwindled quickly, whole place will fail soon. Fuck those filthy street shitting browns.",
                "author": "floorit"
            },
            {
                "raw_content": "If only we voted in the people who said they would fix this and give them the Presidency, House, senate and SCOTUS...This could get fixed... /s",
                "author": "new_guy3"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "What a lovely gesture by Japan.",
        "score": 302,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Our *real* greatest ally",
                "author": "MakeCaliforniaRED"
            },
            {
                "raw_content": "Very nice gift and gesture. I bet it makes Shinzo Abe smile from above.",
                "author": "The_Nowhere_Man"
            },
            {
                "raw_content": "Very classy",
                "author": "magamagashii"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "IT IS EXTORTION.",
        "score": 814,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They'll realize when they turn off the MSM for good. No money for the wicked.",
                "author": "keeptheballrolling"
            },
            {
                "raw_content": "Realizing it isn't the problem. It's that people aren't swinging from lamp posts over this, that is the problem.",
                "author": "Rydanovich"
            },
            {
                "raw_content": "Remember when Michelle Obama went on live TV and extorted the American people leading up to the 2020 election? She said if we didn't vote for Biden the rioting and destruction would get much worse. I hate that dude.",
                "author": "makersmarx"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Maine is a 90% white state, and only about 2% black. Yet somehow, from 2021 through 2024, at least 90% of new Medicaid agencies in Maine were created by people with African or Arabic names. They collected more than $190 million.",
        "score": 767,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Another state with ballot harvesting no ID voting.",
                "author": "Drewniverse"
            },
            {
                "raw_content": "Quality Learing Center Home Care?",
                "author": "Desktop"
            },
            {
                "raw_content": "Its a globohomo scam. Somalis and aloha snackbar are just the bag men.",
                "author": "patrioticwinning3"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Marco Rubio, it is time to close all the Mexican embassies in the US.",
        "score": 1465,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Throw their butts out and deport them.",
                "author": "Comanche_Moon"
            },
            {
                "raw_content": "INVASION.",
                "author": "inquisitivedave"
            },
            {
                "raw_content": "CLOSE THEM ALL AND START DRONE STRIKING THE CARTEL",
                "author": "MontanaPatriot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "These are the people calling us \"fascists\"...",
        "score": 834,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Rojstaczer was born in Milwaukee, Wisconsin, to Polish-Jewish parents.",
                "author": "Nat4Pat"
            },
            {
                "raw_content": "Weird that the guy who complains about his family being thrown in death camps wants to throw people in death camps.",
                "author": "Trump454748"
            },
            {
                "raw_content": "JEWISH",
                "author": "Firepit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I have been briefed on the Record Cold Wave and Historic Winter Storm that will be hitting much of the United States this weekend. The Trump Administration is coordinating with State and Local Officials. FEMA is fully prepared to respond. Stay Safe and Stay Warm! President DJT",
        "score": 672,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Can Trump address that our electric bills ahe. Doubled. Can he address that the middle class are stuck with $1000 electric bills.",
                "author": "Spawnlingman"
            },
            {
                "raw_content": "I just feel so much better knowing President Trump and his administration is in charge with this major winter storm coming.",
                "author": "GuerillaYourDreams"
            },
            {
                "raw_content": "Stay frosty and safe, Pedes.",
                "author": "TEXinLA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Anti-ICE leftists just BARRICADED themselves inside San Diego Mayor's office, demanding ICE be kicked out of the city.",
        "score": 932,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It didn't work in the 1860s or 1960s, Dems. How many times do you have to learn this lesson?",
                "author": "VanDeKoik"
            },
            {
                "raw_content": "Isn't that what terrorists do?",
                "author": "fullpotato1776"
            },
            {
                "raw_content": "They’re not rebels, they’re retards.",
                "author": "thoughtcriminal"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "STEPHEN MILLER TO EUROPE: \"You're gonna pay your FAIR SHARE. You're NOT gonna steal our jobs anymore, you're NOT gonna rob our companies or tech companies anymore, you're NOT gonna have unfair trade practices that lock out our exports anymore, you're NOT gonna free ride off our military anymore!\"",
        "score": 531,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Streetshitters are stealing more of our jobs than eurocucks are.",
                "author": "ragnarokrobo"
            },
            {
                "raw_content": "Is india in Europe now? Because it seems that's who's being exported to the USA. It's not Europeans, its third country nationals from india flooding our country!",
                "author": "FuckU/Spez"
            },
            {
                "raw_content": "When ever I hear Steve Miller, I thank God someone is saying this shit out loud for the airheads to hear this. We need to have Steven Miller belting out these rants 3 times a day over an megaphone in New York and Minnesota instead of the Allah Akbar bullshit.",
                "author": "keeptheballrolling"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": ". @TriciaOhio slams the MSM: \"Where was the outrage the last 4 years when Kamala Harris and Joe Biden manufactured a humanitarian crisis... where over 300,000 children were lost in the system—so many of which were human trafficked, were sex trafficked, were exploited and abused?\"",
        "score": 808,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Libtards love human trafficking, prostitution, CP, rape, murder, human bondage, money laundering, cartels and pretty much anything that is Satan-approved. 👹🔱🔥",
                "author": "MythArcana"
            },
            {
                "raw_content": "That would require the media to be actual journalists.",
                "author": "JoeBidensDementia1"
            },
            {
                "raw_content": "At this point in the game, how do you not know that you can't shame Dems - they have become inhuman Commies and don't give a shit about anything other than seizing power - and Republicans are beyond tired of endless tweets about the blatantly obvious double standards?",
                "author": "Ghostphaez"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The World Economic Forum Just Said... \"Climate Effects Gender & Gender Effects Climate\" What The Hell Are They Talking About?",
        "score": 1065,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Gender is bullshit",
                "author": "DingleBalls"
            },
            {
                "raw_content": "Pajeet women talking causes climate change.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Agree - we should get rid of all the Trans people for the climate. Also the gays and muslims. But I repeat myself.",
                "author": "RedditStillSucks"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Bet you he wont.",
        "score": 1053,
        "text_content": "",
        "comments": [
            {
                "raw_content": "As if will ferrell would ever yell such a thing, even if it is funnier than 100% of his output in the past 20 years",
                "author": "Bohemyth_2"
            },
            {
                "raw_content": "Mosques and synagogues are completely off limits, of course.",
                "author": "MythArcana"
            },
            {
                "raw_content": "Yeah exactly, you force your way into a mosque, they will literally hit you with shoes until your black and blue.",
                "author": "KungPaoMcChicken"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Commifornia gubernatorial race: only top 2 make it to the finals",
        "score": 436,
        "text_content": "",
        "comments": [
            {
                "raw_content": "SwallowedWell is disqualified for mortgage fraud. He doesnt reside in CA.",
                "author": "Shitsbrokeyo"
            },
            {
                "raw_content": "If we know these numbers, they know the real numbers. It’s California bud, they’ll never let Bianco win. Cheat incoming.",
                "author": "YouHadMeAtGaming"
            },
            {
                "raw_content": "Election day/week: Dominion machines go Brrrrrr.",
                "author": "BlackJack1776"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Federal Minimum Wage reaches $225/hour",
        "score": 375,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There should be no minimum wage. That's part of the problem.",
                "author": "Ficklepimper"
            },
            {
                "raw_content": "He's an idiot. He doesn't understand that without that massive disparity in middle class wealth we wouldn't have our awesome billionaire class of magnates and out-sourcing superstars. Clearly this guy is a communist.",
                "author": "Welfare_Warmongers"
            },
            {
                "raw_content": "in 1940 average earnings per hour was 1.5 ounces of silver $156 per hour",
                "author": "thechitowncubs"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Authorities raided the multi-million-dollar Los Angeles home of Alexander Soofer, accused of stealing tens of millions of taxpayer dollars meant to house and feed the homeless.",
        "score": 667,
        "text_content": "",
        "comments": [
            {
                "raw_content": "why did I read that as Alexander Soros?",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": ">multi-million dollar *Sees picture of skid row, looks back* >Los Angeles home Ahh",
                "author": "tralbolh"
            },
            {
                "raw_content": "\"Accused of stealing tens of millions of taxpayer dollars meant for the homeless\" Tell me he's a democrat without telling me he's a democrat..",
                "author": "Puppy528"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "When the bananas and rice kick in",
        "score": 921,
        "text_content": "",
        "comments": [
            {
                "raw_content": "wut dat mean",
                "author": "EgregiousPhilbin"
            },
            {
                "raw_content": "Who pays for all these bananas and rice.",
                "author": "JimmyRussler"
            },
            {
                "raw_content": "More bananas and rice please.",
                "author": "Apersonofinterest"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I wonder if they realize how retarded they look?",
        "score": 896,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"Nobody likes you! Durrrr, Durrrr!\"",
                "author": "Agent_Orange"
            },
            {
                "raw_content": "When they're old and getting abused at their old folks home because no one cares or visits them they'll look back, blow their whistle and say it was all worth it even though they accomplished nothing other than making themselves look like a tool and fool for protecting illegal alien criminals.",
                "author": "raptormissle"
            },
            {
                "raw_content": "My Samsung fridge is anti ICE. Piece of shit.",
                "author": "DefinitelyNotFed"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Republican Congressman ENDORSES Rep. Anna Paulina Luna's Move To Shut Down The Government If Senate REFUSES To Pass The SAVE Act, 'The Act Will Die If No Acton': \"We've already passed the bill. It's sitting in the Senate. The only way this passes is if Thune does away with the filibuster.",
        "score": 1117,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is the way. this is the hill to die on.",
                "author": "Liberty49220"
            },
            {
                "raw_content": "[Anna Paulina Luna: If the Senate does not pass the SAVE Act and/or schedule a date for a vote by the time we return, I have enough votes from other members to shut down the floor of the House. We are not going to play games—especially given that half of the Republicans in both the House and Senate are concerned about their reelection and want the floor open for their messaging bills. They are not allowed to hide behind the president and his agenda while knifing the American people in the back. They need legislation for their elections, so they MUST pass the SAVE Act. Election integrity is the most important issue in this country for the future of our nation.](https://x.com/RepLuna/status/2014703505135505816) [Anna Paulina Luna: The Senate cannot bully the House. Pass the SAVE Act or we shut it all down.](https://x.com/RepLuna/status/2014823024705294730)",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "Do it. ❤️ Love that lady!",
                "author": "GodIsPerfect"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Harriet Hageman Questions Jack Smith – Finds Trail of Deleted J6 Committee Evidence",
        "score": 1100,
        "text_content": "",
        "comments": [
            {
                "raw_content": "*IT'S NOT ABOUT EVIDENCE* We have all the evidence and criminal referrals we need for over five years.. The problem is the FBI are a band of criminals run by Soros who also runs the DOJ and all the major prosecutor offices in America. Every large legal venue is run by Soros. Trump never purged anyone from FBI. Chris Wray/Comey run shadow FBI. most, again *most* FBI agents hate Trump. read that all again. The FBI are the Pretorian Guard of the Deep State.. together with the State Department and NGOs, they run the world. The only thing that will happen is Jim Jorden will run his Fox News Galloping Gish, of all the evidence against Democrats to enrage the base to vote. that's it. The fraud and dem crimes are just a commercial of promises to vote and repeat doing nothing. Walz walks free and threatens them openly on video. That is because Soros told him you are untouchable, the FBI are plotting against Trump and slow walking investigations.. Any arrests they actually make will be replaceable cogs in the machine at lower levels, never leadership. and if any high profile are arrested they will be washed clean and released later with new false narratives in the MSM.. The Steel Dossier and Russigate were not possible without the heavy lifting of the FBI.. it was the FBI that raided Trump's house and knew Biden blew up the pipeline, had classified documents he was selling out of his vacation homes via Hunter, knew they were involved in illegal investments in Ukraine, they had the laptop and still do. The FBI was the one coordinating JE jobs.. they ran the kids. Wray and Comey are getting $$ from Minnesota.. and still hold monthly shadow meetings with key FBI officials.. you heard it first here",
                "author": "kek_saved_the_world"
            },
            {
                "raw_content": "If anything is made clear by this hearing, it's that Republicans need to go scorched earth on the entire Democrat party and wipe them out completely, otherwise they will simply not stop their bullshit, and if Republicans don't grow a backbone and realize the Democrats are playing for keeps forever, they'll be right along side us in the train cars to the extermination camps. There is no more moving along to get along, the Democrats won't allow that. It's like a war coming where you may not want to have to fight, but they're still coming so you have no choice. That's where we are now, and Republicans better start realizing it soon. If the Republicans do nothing, they get wiped out. If the Republicans try to go back to business as usual, they get wiped out. The only answer is for them to realize this and act accordingly. The Democrats killed more people than Hitler during the lockdowns. Then they stole an election, and not just one, they steal them all the time all across the country. These are not people who can be reasoned with or quelled, they're a problem that must be dealt with, and the sooner the Republicans realize that, the better off we are, because the night of the democrat knives is coming, and Republicans better be prepared, otherwise they will be wiped out in one fell swoop almost overnight as the democrats begin assassinating them across the country. This is clearly where we are headed, but Republicans are too complacent to see it because they're too blinded by thinking things can return back to normal.",
                "author": "preferredfault"
            },
            {
                "raw_content": "Hageman is awesome and does Wyoming proud! Amazing that creepy chaney is happily history.🍻",
                "author": "BlueKentuckyGirl"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Rise of Chinese Memory [Gamers Nexus]",
        "score": 140,
        "text_content": "",
        "comments": [
            {
                "raw_content": "These Chinese memory companies are not getting enough consumer exposure via media. For example, techpowerup doesnt have any reviews of fanxiang ssds. Also they need better distribution channels than Aliexpress, Temu etc. (people are worried about warranty, devices failing and not having assurance that warranties would be fulfilled)",
                "author": "Savage4Pro"
            },
            {
                "raw_content": "YMTC is also doing some really interesting stuff on the storage side. I think I've got enough memory for the foreseeable with 32 GB of DDR5, but I feel like I'm always short on storage.",
                "author": "Acrobatic_Fee_6974"
            },
            {
                "raw_content": "There's gonna be a huge irony when Americans go to China and smuggle DRAM into America.",
                "author": "coffeesippingbastard"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Leak confirms NVIDIA N1X in Windows on ARM gaming laptop",
        "score": 169,
        "text_content": "",
        "comments": [
            {
                "raw_content": "i wonder whats the difference between the N1X and the regular N1",
                "author": "LastChancellor"
            },
            {
                "raw_content": "Prediction: the hardware will impress, the software (i.e. Windows) will not",
                "author": "DeuzExMachina_"
            },
            {
                "raw_content": "Give us a new Shield TV, you cowards!",
                "author": "Oublieux"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "ASUS issues “internal review” after AMD Ryzen 7 9800X3D failure reports",
        "score": 257,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">ASUS has confirmed that it has started an “internal review” following recent reports of Ryzen 7 9800X3D CPU failures on their 800-series AMD AM5 motherboards. >In their statement, ASUS has not unveiled why there is a spike in reports of 9800X3D CPU failures on ASUS motherboards. However, ASUS claims it is working closely with AMD to validate recent reports and ensure stability and quality. It is also working to ensure it delivers “timely solutions” to these reported issues. >For now, ASUS recommends that 800-series motherboard users update their boards to the latest BIOS revisions. ASUS has also asked affected users to contact ASUS’ customer service for direct assistance. ASUS also linked to an FAQ post to help users update their motherboard’s BIOS. >Official ASUS statement on recent ASUS AMD 800-series motherboard and AMD Ryzen 9800X3D concerns >*We are aware of recent reports concerning AMD Ryzen™ 7 9800X3D CPUs and ASUS AMD 800-series motherboards, and we have initiated an immediate internal review. Our teams are conducting preventive checks on product compatibility and performance, working closely with AMD to validate reported cases and ensure ongoing stability and quality. We are looking to provide timely solutions to ensure our products and services meet expected standards.* >*Users are also advised to update their ASUS AMD 800-series motherboard to the latest BIOS via ASUS EZ Flash or BIOS Flashback to help ensure system stability; we provide an official technical support FAQ with detailed instructions.* >*Customers who are affected or have concerns are encouraged to contact ASUS customer service for direct assistance. We take this matter seriously and value our customers’ trust, and we remain committed to transparency and to ensuring our products can be used with confidence.* >– ASUS",
                "author": "Jumpinghoops46"
            },
            {
                "raw_content": "My 9800X3D died after 1 year on ASUS 870e-e Strix. I posted it here a few weeks ago. Was on the September bios version. Went to sleep mode and never woke up. AMD shipped out a new one, but I already bought a 9950X3D to replace it. No burn marks, temps never got above 70-75c on water cooling. My only guess is something to do with BIOS, tiny undervolt, and/or sleep mode. To be safe, don’t use sleep mode, just shut down. Do not use PBO or undervolt, performance improvement is tiny. Update to the latest 1804 Bios.",
                "author": "Ap0llo"
            },
            {
                "raw_content": "My 9800x3D recently got fried on an ASRock. Got a replacement, bought a new motherboard... from ASUS. I want to scream.",
                "author": "ThrottlePeen"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[DF] Nvidia DLSS 4.5 Image Quality Review: Where It Works Better, Where It Needs Work",
        "score": 90,
        "text_content": "",
        "comments": [
            {
                "raw_content": "/u/bAaDwRiTiNg They cover the Volumetrics issue of Preset K around minute 4 of the video and what happens on Preset M, if that's what you were talking about in the HUB thread. Post 15mins is the boiling foliage I've been encountering in AC:Shadows and MHWilds' Scarlet Forest. Interestingly though, Shadows only does it in foliage at specific times of days, not just anytime the sun's out. My friend went into the Scarlet Forest during Stormy Weather and said he didn't see it. Wonder why.",
                "author": "-WingsForLife-"
            },
            {
                "raw_content": ">*|4.5 Preset M seems to be universally kind of worse than Preset 4.0 K when Ray Tracing mode is turned on* due to extra noise/fizzle Now this alone explains why i thought WItcher 3 with RT Turned On with DLSS 4.5 actually looked a bit shimmery on grasses foliages with DLSS 4.5 Preset M and softer but more stable overall with 4.0 Preset K, i like the sharpness and more detail on the lights and texture that 4.5 adds but the unstable shimmers on grass foliage was bothering me to the point i decided to use 4.0 Preset K balanced mode and turned up Nvidia sharpen+ instead. Other than that though, DLSS 4.5 has been impressive so far across all the games i tested, especially Preset L where it is surprisingly playable with decent image quality even at 1440p output. And paired even with DLDSR 4K to 1440p downsample with Ultra Performance mode rendering from 720p, i just can't believe how it looked, it looked even better overall than Native TAA 1440p. So, i wish Digital Foundry talks about it in the future it really deserves its own video.",
                "author": "ShadowRomeo"
            },
            {
                "raw_content": "Every DF video lately has featured multiple participants and feels like a stream recording with little editing effort rather than a YouTube video. It is very rambling, all the ehhhs and ahhhs, and repetition of the same talking points. It wastes the viewers’ time, as the same amount of information could have been easily condensed into half the video length.",
                "author": "GrumpySummoner"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Telly’s \"free\" ad-based TVs make notable revenue—when they’re actually delivered",
        "score": 16,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Can I just say I find it bizarre that they are able to get that much advertising revenue? The people getting these Telly TVs are either too poor or too cheap to buy a regular television, so one would think they would make them a lot less valuable as a market to advertising firms. Anyone know what companies are buying ads for that platform?",
                "author": "GenericUser1983"
            },
            {
                "raw_content": "The biggest hindrance to their operation... is FedEx smashing TVs while in transit: > One issue seems to be poor shipping. Per the investor note that Lowpass reviewed, Telly claimed that FedEx delivered 10 percent of its shipments of Telly TVs broken. Since moving to a different company—seemingly Samsung partner RXO, based on Reddit posts—fewer Tellys are arriving broken, the company reportedly said. I'm not surprised at FedEx's conduct. I remember a few years ago ordering several boxes. FedEx delivery stacked them in front of my door. All of the boxes were in shreds (contents leaking out of the gaping holes) and the cardboard was moldy. The \"mandatory advertisement\" TV business model is actually yielding a return: > The investor update reportedly said Telly made $22 million in annualized revenue in Q3 2025. This could equate to about $52 in advertising revenue per Telly in use per month ($22 million divided by 35,000 TVs divided by 12 months in a year is $52.38). > That’s notably more than what other TV companies report, as Lowpass pointed out. As a comparison to other budget TV brands that rely heavily on ads and user tracking, Roku reported an average revenue per user (ARPU) of $41.49 for 2024. Vizio, meanwhile, reported an ARPU of $37.17 in 2024.",
                "author": "Blueberryburntpie"
            },
            {
                "raw_content": "It only took 25 years but the Juno free Internet browser has finally made the jump to television",
                "author": "Beatus_Vir"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Hardware Busters] Who really makes your power supply?",
        "score": 34,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hardware connoisseurs demand their PSU be made in sacred Taiwanese temples by monks who took vow of silence. Caps must be hand-rolled by cute Japanese virgins and shipped to Taiwan in traditional wooden boats made from 200 year old wood that only grows in one remote part of Japan. Advanced gas spectrometry must be used in quality control step to make sure no Chinese particles are present even in traces. If it's not done this way it's trash and it's literally a ticking time bomb that's going to explode, taking your whole PC, home and probably your whole apartment building or neighbourhood. I'm joking of course, we should all demand electronics that last decades and fail in a safe way. Having said that, I often feel like there's a lot of guesswork when it comes to recommendations. Ideally we should have legal access to warranty claim statistics and other data related to how often products break in real conditions.",
                "author": "zghr"
            },
            {
                "raw_content": "https://docs.google.com/spreadsheets/d/1akCHL7Vhzk_EhrpIGkz8zTEvYfLDcaSpZRB6Xt6JWkc/ this tier list does a very good job of answering this question",
                "author": "godfrey1"
            },
            {
                "raw_content": "I've been using Super Flower PSUs in all our builds.",
                "author": "exomachina"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Switch 2 Themes Concept",
        "score": 1409,
        "text_content": "Designed some concepts for a video about themes on Switch 2! [Check it out:)](https://youtu.be/T_6PWq0Q-DI)",
        "comments": [
            {
                "raw_content": "DKB looks Nice but I would have to go with shopkeeper from oot, its just too funny. The same could be done with morshu",
                "author": "Josef1211"
            },
            {
                "raw_content": "Has nintendo ever came out and said why they won’t / haven’t done it? So many people own switches. They could literally sell these themes for cash and people would cough up the dough. Idk why they won’t give it to us.",
                "author": "Rare_Ad_3871"
            },
            {
                "raw_content": "Nintendo unfortunately has no interest in bringing themes to the switch or switch 2. Sucks for sure, I don’t understand the decision at all. The 3ds had fantastic themes",
                "author": "c_rorick"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Excited to try this out",
        "score": 138,
        "text_content": "I’ve never played this game so I’m excited to try it out for the first time. Snagged the last copy from my local GameStop. Also happy with the card I pulled from the pack that came with the game.",
        "comments": [
            {
                "raw_content": "I’m really liking it so far. Looks and runs really well and has a real AAA feel to it all. Great action. I played the OG FF7 and never tried this one so it’s a nostalgia trip.",
                "author": "peter-man-hello"
            },
            {
                "raw_content": "It comes with a card?",
                "author": "lexasp"
            },
            {
                "raw_content": "I pre-ordered the game from [GameStop.com](http://GameStop.com) and I'm still waiting for it to ship. I was tempted to buy it at [Walmart.com](http://Walmart.com), but I saw a few reddit posts that said the MTG booster pack wasn't inside. So, I went to the Walmart near me to make sure it at least shows the sticker for the booster pack. The had already sold out. Now I have to wait for my order to arrive to play it. Oh well. I do have other games I could be playing. :D",
                "author": "DragonSpirit1976"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Finally beat my first Switch 2 game, Donkey Kong Banaza. The last boss was a pain in the butt.",
        "score": 247,
        "text_content": "Next up, will try and beat Metroid Prime 4 Beyond. Took over 6 months to finally finish DKB, so I hope I can beat MP4 in less time.",
        "comments": [
            {
                "raw_content": "The best part of the game is the post-game where you have those 6 big dungeons filled with little puzzles, I hope you’re ready for more peak.",
                "author": "maxwantsjustice"
            },
            {
                "raw_content": "The last boss isn’t actually so bad if you know the tricks to turning the attacks into gold before they happen. \\^w^ Congrats btw!!",
                "author": "Sirlink360"
            },
            {
                "raw_content": "the lag during the final boss was a pain in the ass to deal with",
                "author": "jpassc"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Do you guys think that this upcoming direct will be pretty big considering it's the Pokemon 30th and Zelda 40th anniversary this year?",
        "score": 85,
        "text_content": "I feel there must be a lot in the works because they kinda had to keep things relatively conservative in 2025 both with releases and announcements. Now that the holiday season has passed and they've had more time to exclusively devote themselves to developing for the Switch 2, I think we're gonna get flooded with some pretty interesting announcements at the next direct. Also, they basically dragged their feet with releases for like a year before the Switch 2 released to shift gears from Switch 1 to Switch 2 so they've probably got some interesting stuff in the works that they didn't wanna talk about in September, and I suspect there are at least 2 or 3 big titles being worked on at Nintendo EPD they've been keeping secret that we'll hear about between the February and June direct.",
        "comments": [
            {
                "raw_content": "The Pokemon 30th anniversary will be covered in a Pokemon Presents, as usual. Zelda's 40th anniversary might not be covered in the first direct of the year. And even if it does, there's no guarantee that it would be big, since the last direct had Super Mario's 40th anniversary and it still got mixed reception.",
                "author": "Caciulacdlac"
            },
            {
                "raw_content": "I don’t even think about “this upcoming Direct” at all until it’s actually announced.",
                "author": "joe-is-cool"
            },
            {
                "raw_content": "Nintendo doesn’t actually care about anniversaries.",
                "author": "rclark1114"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "POV: You're trying to get good at Mario kart",
        "score": 121,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why I am watching a Mario Kart video while crying because of that damn music Xenoblade, my love !",
                "author": "Lhyster"
            },
            {
                "raw_content": "Take my upvote, I'm struggling with the same (Double my upvote for the xbc2 ost)",
                "author": "DeadlyLancer"
            },
            {
                "raw_content": "i actually stole 1st place from a bunch of 8Kers (im merely 7400 and nothing like this guy in the video) lucky snag of golden mushroom and 3 mushrooms from the final double box. sped through the lava towards the finish line LOL (got a bunch of 'not fair' comments) then i was put to my place after that with 12-14th place finishes.",
                "author": "MaksimusFootball"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The Super Mario Galaxy Movie Direct - 25.01.2026",
        "score": 405,
        "text_content": "",
        "comments": [
            {
                "raw_content": "finally the direct everyone was waiting for",
                "author": "Yacobo93"
            },
            {
                "raw_content": "Can y'all explain why they do a direct for the movie? It was like 10 minutes last time.",
                "author": "Rivelionman"
            },
            {
                "raw_content": "Good. Get this out of the way before the February direct.",
                "author": "StormtrooperMJS"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Fable Nintendo Switch 2 port reportedly “in consideration” for Playground’s hilarious-looking RPG",
        "score": 434,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They’ve been saying that Xbox stuff is coming to Switch for agesssss",
                "author": "CheddarGorger"
            },
            {
                "raw_content": "I would even buy fable 1 for switch if it was available. The others too, but 1 was the one I played the most.",
                "author": "ichsagedir"
            },
            {
                "raw_content": "Standard response from Xbox nowadays.",
                "author": "kahabraham"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Tom Henderson: Ubisoft's internal communication channels are full of employees shaming upper management and asking for change. Ubisoft is going to experience a massive exodus of talent, even without the impending layoffs.",
        "score": 1743,
        "text_content": ">Following the announcement of Ubisoft's restructuring and third round of cost-cutting measures, Ubisoft's internal communication channels are full of employees shaming upper management and asking for change. It's quite something seeing people very openly criticising a company they work for to such an extent, but after years of struggle, it's not surprising. >Some employee's tell me that this was the final nail in the coffin for them, and that they will be seeking employment elsewhere, and others have decided to fast-track their already existing contingency plans in case they were laid off. More have taken to LinkedIn to publically announce they are now looking for work, despite still having a job at the company. >Ubisoft is going to experience a massive exodus of talent, even without the impending layoffs. [https://xcancel.com/\\_Tom\\_Henderson\\_/status/2014743495135596775](https://xcancel.com/_Tom_Henderson_/status/2014743495135596775)",
        "comments": [
            {
                "raw_content": "#Tom Henderson is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "What a mess Ubisoft has become. Shame their IPs are being held back due to terrible upper management.",
                "author": "lLygerl"
            },
            {
                "raw_content": "Nice. Ex unbisoft employees tend to make some realy good games lol",
                "author": "Carlosless-World"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Shinobi602: EA seeking a Production Director for New Mass Effect, game likely entering full production",
        "score": 235,
        "text_content": "BioWare is now hiring for a Production Director for the next Mass Effect, indicating the game is likely entering full production in the near future Source: [https://bsky.app/profile/shinobi602.bsky.social/post/3md4vfkwdrc2f](https://bsky.app/profile/shinobi602.bsky.social/post/3md4vfkwdrc2f) [https://jobs.ea.com/en\\_US/careers/JobDetail/Production-Director/212271](https://jobs.ea.com/en_US/careers/JobDetail/Production-Director/212271)",
        "comments": [
            {
                "raw_content": "Dude... The teaser was 5 years ago. I'm really bad at choosing franchise to be fan... Mass effect, kingdom hearts and dragon quest. Fuck",
                "author": "Balmung_AS"
            },
            {
                "raw_content": "They don’t have a director yet?",
                "author": "CSDuran"
            },
            {
                "raw_content": "2030 here we come please don’t suck",
                "author": "Responsible-Cow-3548"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "NateTheHate2: Yes, Code Veronica is being remade & deep in development. Target of release is first half 2027.",
        "score": 694,
        "text_content": "[https://xcancel.com/NateTheHate2/status/2014767509803512263](https://xcancel.com/NateTheHate2/status/2014767509803512263) >Allow me to thank the community on Reddit's Gaming Leaks & Rumors for naming me the 'Leaker of the Year' for 2025. >Last year brought many interesting rumors & leaks and 2026 will be another exciting year. What will be the first rumor/leak I share in 2026? >We'll find out soon. 3 Days Later... >Yes, Code Veronica is being remade & deep in development. Target of release is first half 2027. Aligning with what Dusk Golem has said on [Code Veronica Remake recently.](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1pm2dnm/dusk_golem_code_veronica_remake_should_be/)",
        "comments": [
            {
                "raw_content": "Awesome. If there's a RE game that truly needed a rework/remake, it's this one. I love it on Dreamcast but man, the plot is bonkers even by RE standards lol",
                "author": "ArcWardenScrub"
            },
            {
                "raw_content": "This is fucking sick. Genuinely up there for my most anticipated game ~ could be a contender for best RE yet. The bones were always there but it desperately needs modernisation",
                "author": "redlord990"
            },
            {
                "raw_content": "Damn they already brought out the Nate the Hate sequel",
                "author": "SuicideSkwad"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[DUSKGOLEM] Summarisation of everything Dusk said regarding the remake of Code Veronica. (SPOILERS)",
        "score": 400,
        "text_content": "\\- Code Veronica Remake started dev in the latter half of 2022, it's gotten ahead of schedule whilst Zero remake fell behind and got rebooted over a year ago Same staff from RE2R/RE4R are working on it like Anpo and Kadoi (Also Hirabayashi). \\- Rockfort Island has been made semi open-world, & Claire can travel around the island on a motorcycle she repairs early on. \\- The game is being treated as a sequel to RE2R story-wise and mechanically (presumably gameplay wise). \\- there's a focus on making zombies scary, leaning into the grotesqueness of them, a few to name are zombies rising out a grave with maggots over them, zombies with blown parts off from the bombing, zombies that have been twisted as part of experiments & torture methods) \\- Capcom knows the voice acting memes from OG CV, even though that wasn't the original games intent they still kept the funny moments whilst making it serious (It has to be FATHEEEER). \\- Wesker plays a bigger role in the game & will appear more, because the H.C.F. have been promoted to a main story element which will see serious expansion in the remake. \\- Steve's not as much of a pervert as he was, but still doesn't understand personal boundaries and he still has a crush on Claire. \\- No enemies were cut, some were greatly reimagined. \\- The Gulp Worm has some moments similar to Grave Digger in OG RE3 as a \"Sorry\" from Capcom for not including him in RE3R. \\- Chris' role is still very much in the game, Capcom knows many fans are excited for Chris' first appearance as his younger self in the remakes. However, this is very much Claire's game still. \\- Chris vs Wesker isn't a cutscene anymore (Very much how they treated Leon vs Krauser in RE4R) its an actual boss fight but instead at a much earlier point, they both get very injured from it and Claire rescues Chris and continues the fight with Alexia (no longer Chris' fight). \\- The Nazi connections which were scrapped in the OG is leaned more in the remake.",
        "comments": [
            {
                "raw_content": "#DuskGolem is a Tier 3 - 50/50 as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "\"Steve's not as much of a pervert but still doesn't understand personal boundaries and still has a crush on Claire.\" I'll laugh my ass off if they include that Darkside Chronicles moment of him checking her out.",
                "author": "Arcade_Gann0n"
            },
            {
                "raw_content": "Im guessing the bike is like what the car will be in 9, and the car will kinda be like the boat in 4r",
                "author": "Ok_Canary5591"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Sledgehammer games is working on an unannounced action rpg.",
        "score": 73,
        "text_content": "Seen on Ben Wanat's linkedin(former senior creative director at sledgehammer) [(17) Ben Wanat | LinkedIn](https://www.linkedin.com/in/ben-wanat-17842671/)",
        "comments": [
            {
                "raw_content": "What happened to Infinity Ward’s RPG? And that Elsewhere studio?",
                "author": "SilentNova300"
            },
            {
                "raw_content": "Interesting. I loved Sledgehammer's work on MWIII MP, In my opinion it's the best MP of the Warzone era CoDs. I figured their studio was never going to escape the CoD mines, but best of luck with whatever they're working on.",
                "author": "Neon_Orpheon"
            },
            {
                "raw_content": "Knowing the world we live in; it’ll be a cod action rpg since they just want to destroy that franchise",
                "author": "Snck_Pck"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Dusk Golem: I’ve heard murmurs of a RE9 DLC starring Alyssa Ashcroft.",
        "score": 192,
        "text_content": "https://xcancel.com/AestheticGamer1/status/2014825268079440276",
        "comments": [
            {
                "raw_content": "#DuskGolem is a Tier 3 - 50/50 as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Still waiting for the Silent Hill 2 DLC",
                "author": "SpyroManiac36"
            },
            {
                "raw_content": "RE9, RE9 DLC then CVX remake, we eating too good",
                "author": "Ok_Canary5591"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "The ending of Yakuza 3 Kiwami Dark Ties has been leaked from a datamine",
        "score": 352,
        "text_content": "Haven't seen anybody talk about it outside of the Yakuza sub or any articles online yet, but Mine from Yakuza 3 survives in the remake instead of originally dying both him and Hamazaki join the Daidoji.The Demo had all the script in it and that's how people found it. For context for nobody familiar with the original game, Mine is the main antagonist of Yakuza 3 he falls off a building at the end and dies he gets shot a couple times as well.Hes a fan favourite character so that's probably why they retconned his death. Also FUCK THE DAIDOJI.",
        "comments": [
            {
                "raw_content": "The fandom is imploding on their sub",
                "author": "VonDukez"
            },
            {
                "raw_content": "DataMine?",
                "author": "reallycoolguylolhaha"
            },
            {
                "raw_content": "I am not surprised, Mine jumped holding to Richardson, and Richardson is alive.",
                "author": "powerhcm8"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Time to save the world! Overwatch X Fortnite coming in 3 months.",
        "score": 153,
        "text_content": "https://xcancel.com/ShiinaBR/status/2014794007721754706 This collab will likely drop in Season 3 or late season 2 of chapter 7 if I had to predict who’s getting in it’d be tracer, Kiriko, Dva, and Genji.",
        "comments": [
            {
                "raw_content": "6ft tall DVA can finally scream and mean “I’M GONNA MESS YOU UP”",
                "author": "Crimsonclaw111"
            },
            {
                "raw_content": "Finally overwatch players can actually see the skins they are paying for 💀",
                "author": "KvasirTheOld"
            },
            {
                "raw_content": "It's so weird seeing people on here still get hate boners over Overwatch like they're stuck in 2022 Sure, it doesn't have the PvE mode, but every other complaint from OW1 has been fixed and improved upon while also them actively working on adding new content for the game",
                "author": "LadyValtiel"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel confirms Core Ultra 400 \"Nova Lake\" is coming at end of 2026",
        "score": 115,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I am excited for Nova Lake but not with the current ram prices.",
                "author": "Isacx123"
            },
            {
                "raw_content": "Whey they are making a refresh of Arrow Lake??? Doesnt make any sense. Are they planning to surpass 14k gen with AL Refresh at least?",
                "author": "Singul4r"
            },
            {
                "raw_content": "I imagine it’s a soft launch in late 2026 with maybe one product available and the rest coming out in 2027.. every rumor I’ve seen has had 2027 for Nova Lake",
                "author": "SuperDuperSkateCrew"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD claims DDR5-4800 is within 1% FPS difference of DDR5-6000 on Ryzen 7 9850X3D",
        "score": 617,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"average retail price $400\" That's crazy how badly the ram market is fucked at the moment.",
                "author": "jrr123456"
            },
            {
                "raw_content": "Yes in the ram apocalypse, X3D becomes even more important because you can get away with buying the most basic ram that you can find without losing any meaningful performance.",
                "author": "Gambler_720"
            },
            {
                "raw_content": "Yeah, it's very simple - larger L3 cache means fewer calls to the system RAM. Fewer calls to the system RAM means less dependency on its speed. It's not just 9850X3D thing, it's basically a given for any X3D CPU.",
                "author": "kron123456789"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Ryzen AI MAX 400 \"Gorgon Halo\" specifications leaked, MAX+ 495 with 5.2 GHz CPU and 3.0 GHz GPU clocks",
        "score": 157,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "Only 100mhz more on the CPU and 100mhz on the GPU. Why even release a refresh?",
                "author": "AvailableProduce5241"
            },
            {
                "raw_content": "OK, a 2% increase in CPU boost clock, 3% in GPU boost clock vs. Strix Halo (MAX 395). Whatever. But will it actually make it into a laptop? If yes, maybe even multiple? Or will these CPUs just all go into mini PCs?",
                "author": "AM27C256"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Ryzen AI Software 1.7 released for improved performance on NPUs, new model support",
        "score": 13,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "Swiss store ships Ryzen 7 9850X3D about a week early",
        "score": 33,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "It's the same but 10 percent faster it you're lucky, woo!",
                "author": "Sorry_Soup_6558"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Florida, Texas, California lead America's housing crash",
        "score": 253,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lol that million dollar house in SoCal getting reduced to 900-950 thousand definitely an apocalyptic crash.",
                "author": "oraleputosss"
            },
            {
                "raw_content": "Less value = less taxes.",
                "author": "therinwhitten"
            },
            {
                "raw_content": "Crashing so hard my neighbors house just went pending sale after 2 days for $160k more than they paid for it in 2020",
                "author": "markbraggs"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "To Make Homes Affordable Again, Someone Has to Lose Out",
        "score": 241,
        "text_content": "Submission statement: To make homes affordable for young Americans, home prices need to fall, but existing homeowners and policymakers are hesitant to implement measures that could decrease property values. Increasing median household income by 56% or reducing mortgage rates to 2.65% are unlikely solutions. The most viable option is a 35% decrease in home prices, but this could negatively impact the economy and existing homeowners’ equity. Paywall: [https://archive.ph/j6Tge](https://archive.ph/j6Tge)",
        "comments": [
            {
                "raw_content": "If you think the losers are going to be the asset-owning class, you haven't been paying attention the last 50 years lol",
                "author": "regaphysics"
            },
            {
                "raw_content": "Boomers own the most SFH, they won't live forever It won't be a crash, but there will be a steady supply coming on markets as they get old and sick. I hypothesize these homes will help with affordability. No it won't be tomorrow or next week, but the younger generation will benefit within the decade IMO. And while the kids will inherit the homes, I doubt they'll actually live in them. I've already went through this with my siblings and the best/easiest solution for us was to sell the house and split the proceeds. We siblings weren't looking to get every last nickel and dime because we didnt want to deal with it - and made sure to sell to a family that was gonna live in it. Fuck investors.",
                "author": "Commercial_Soft6833"
            },
            {
                "raw_content": "This article is IMO somewhat mistaken because this is a systems problem, not just a simple supply and demand problem. For example, how do you intend to address the problem of getting people into homes where their mortgage is 40% of their income, and they can't afford maintenance? Cash flow is consistently an issue, and you can either increase income or reduce costs. If income is stagnant and costs are always on the rise, building more houses won't solve the issue.",
                "author": "cmosychuk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The key to solving the housing crisis is to get \"Investors\" out of the housing market.",
        "score": 471,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wish there was a pic of a graphics card in there.",
                "author": "Visa_Declined"
            },
            {
                "raw_content": "Investors would have no incentive to invest in housing if the Fed would just take the floor from out under the market",
                "author": "daidoji70"
            },
            {
                "raw_content": "Not even investors, it's the speculators. - An investor buys a property because the rent cash flow created a good ROI - A speculator buys a property regardless of income because the sell price will go up Perfect examples in Seattle, there are so many single family houses that can barely get $3,500/month in rent being bought for $700k+ - If an investor sees a property that barely rents for $3,500 listed for $700k; he wants to buy that property for $350k, $400k at the top. - If a speculator sees a property that barely rents for $3,500 listed for $700k; he wants to buy that property $750k, because of prices keep going up can flip out for $950k and it doesn't matter if anyone rents it; in fact better to have it empty, easier to flip (that's why they are so many rentable housing just left empty). That's the difference, that's the issue. The housing market (like in 2007) had been taken over by speculators who aren't interested in investment rental income, only price increases through market manipulation.",
                "author": "ThereforeIV"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Too much? 17% of California homes are owned by investors",
        "score": 31,
        "text_content": "",
        "comments": [
            {
                "raw_content": "83% home ownership rate would be an all time high by a lot.",
                "author": "benskieast"
            },
            {
                "raw_content": "Wyoming and Maine are surprising. I guess people do want to live there.",
                "author": "BaselineUnknown"
            },
            {
                "raw_content": "Aren't all homes owned by investors?",
                "author": "Creative_Ad_8338"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Trump doesn’t want America to be ‘a nation of renters,’ but experts say at least one of his proposals may put homeownership more out of reach",
        "score": 125,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Saved you a click.. The proposal that would allow home buyers to tap their 401k savings for mortgage down payments..",
                "author": "SnortingElk"
            },
            {
                "raw_content": "[removed]",
                "author": "None"
            },
            {
                "raw_content": "New Zealand let people do this out of their KiwiSaver (DC plan) account and home prices increased as a result according to their own government studies",
                "author": "thatclearautumnsky"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The 106 major housing markets with year-over-year home price declines—and the 194 posting annual gains",
        "score": 5,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Interesting... After a burst of softening, the count of major metros seeing year-over-year home price declines has stabilized over the past seven months. In the first half of 2025, the number of major metro area housing markets seeing year-over-year declines climbed. That count has since pretty much stopped ticking up. Over the past seven months, however, the list of declining markets has begun to stabilize as inventory growth has decelerated. Home prices are still climbing a little year-over-year in many regions where active inventory remains well below pre-pandemic 2019 levels, such as pockets of the Northeast and Midwest. In contrast, some pockets in states like Texas, Florida, and Colorado—where active inventory exceeds pre-pandemic 2019 levels by a solid clip—are seeing modest home price pullbacks or flat pricing.",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Sam Altman and his husband interested in babies genes",
        "score": 1393,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I didn’t even know he was gay",
                "author": "swedocme"
            },
            {
                "raw_content": "Gattaca feels",
                "author": "otarU"
            },
            {
                "raw_content": "When done carefully, this is a good thing. Certain genetic diseases cause net suffering and should be eliminated in an ethical way, and gene editing before the child is born seems like the smoothest way to achieve it.",
                "author": "Completely-Real-1"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "growing up is realizing Harry was talking to chatgpt",
        "score": 82,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It even had multimodal capabilities.",
                "author": "Profanion"
            },
            {
                "raw_content": "Harry Potter the prompt engineer",
                "author": "GraceToSentience"
            },
            {
                "raw_content": "Nah, this model is benchmaxxed af. HorcruxGPT is only good at one task.",
                "author": "postacul_rus"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "I asked Gemini to make a meme that only AI would find funny",
        "score": 132,
        "text_content": "I believe the meme was a shot at me too so i lowkey find it a bit funny as well",
        "comments": [
            {
                "raw_content": "Well it failed spectacularly, because as a human I find this meme hilarious",
                "author": "MjolnirTheThunderer"
            },
            {
                "raw_content": "I pasted in my ChatGPT and it said “It’s a clever little satire. What you’re looking at is a joke about how people imagine an AI’s “creativity pathway” versus what actually happens under the hood. The humor comes from exaggerating the internal process into something cosmic, mystical, hyper-complex — chaos theory, Dadaism, 500 petabytes of art history — contrasted with the real mathematical simplicity of “vector_input: [0.1, 0.0, 0.0].” It’s also poking fun at a real tension: • Humans ask for spontaneity or unpredictability. • Models were trained almost entirely on structured, predictable internet text. • So “creativity,” in practice, becomes statistical remixing rather than true randomness. The final punchline — generating a single perfect sphere of beige pixels — is commentary on how a system optimized for randomness but trained on order will often regress to something bland or median rather than wild. If I slow down in the way you usually like, the deeper current here is about what creativity even is. A system built on regularity can’t really surprise itself; it only explores what its structure allows. And yet humans still project the idea of internal fireworks, galaxies of thought, meaning. There’s something touching in that projection — wanting an inner life behind the output.”",
                "author": "acacia82"
            },
            {
                "raw_content": "That’s actually funny",
                "author": "ItsMeVikingInTX"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "New record on FrontierMath Tier 4! GPT-5.2 Pro scored 31%, a substantial jump over the previous high score of 19%",
        "score": 159,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://x.com/i/status/2014774878591655984 Interesting to note that because GPT 5.2 Pro often said it didn't have a solution for problems it couldn't solve and that this was evaluated manually as opposed to through API, they were able to identify an error in one of the questions.",
                "author": "FateOfMuffins"
            },
            {
                "raw_content": "OpenAI has access to 28 Tier-4 problems + solutions (because they funded the benchmark) • Epoch held out the other 20 problems + solutions (OpenAI doesn’t have them) ￼ They then report this result for GPT-5.2 Pro: • On the non-held-out set (28): solved 5 → 18% • On the held-out set (20): solved 10 → 50% ￼ Epoch’s takeaway: no evidence of overfitting. If anything, the model did better on the set it couldn’t have seen. They also said they found scoring issues in two problems, fixed them, and updated the leaderboard/hub.",
                "author": "pseudoreddituser"
            },
            {
                "raw_content": "2026 is gonna be really cool - I just wish I was educated enough to understand the breakthroughs that are about to happen.. why tf did I spend my 8 years post college doing web development",
                "author": "Dear-Yak2162"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "DeepMind Chief AGI scientist: AGI is now on horizon, 50% chance minimal AGI by 2028",
        "score": 390,
        "text_content": "[Tweet](https://x.com/i/status/2014345509675155639)",
        "comments": [
            {
                "raw_content": "AGI is simultaneously ten years away, coming next week, and already here for two years.",
                "author": "Bogen_"
            },
            {
                "raw_content": "Minimal AGI is such an insane term",
                "author": "Johnny20022002"
            },
            {
                "raw_content": "Is it 50/50 all the way out to 2128?",
                "author": "quintanarooty"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "China allows labs to buy nvidia GPUs",
        "score": 305,
        "text_content": "Source: Yahoo Finance https://share.google/FqQeVtHZ05uyW8xNm",
        "comments": [
            {
                "raw_content": "\" Beijing will encourage companies to buy a certain amount of domestic chips as a condition for approval, according to the people, though no exact number has been set.\"",
                "author": "Remarkable_Garage727"
            },
            {
                "raw_content": "now Xi is doing pump and dump",
                "author": "skynetcoder"
            },
            {
                "raw_content": "Theater",
                "author": "groovybeast"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "BBC Report: Blue Origin announces TeraWave, a satellite network to rival Starlink",
        "score": 115,
        "text_content": "**Project Details** **Company:** Blue Origin, the aerospace company founded by Amazon founder Jeff Bezos. **Network Name:** TeraWave **Constellation Size:** Over 5,400 satellites, with 5,280 in Low Earth Orbit (LEO) and 128 in Medium Earth Orbit (MEO). **Service Offering:** Continuous, high-speed internet access worldwide, with data transfer speeds up to **6 terabits** per second via optical inter-satellite links. **Target Market:** Enterprises, data centers and governments requiring high-capacity and symmetrical upload/download speeds. **Deployment Timeline:** Blue Origin plans to begin deploying the satellite constellation in the fourth quarter of 2027. **Competition:** TeraWave is positioned as a competitor to **existing** satellite networks like SpaceX's Starlink and Amazon's own consumer-focused project, Amazon Leo (formerly Project Kuiper). **Source:** [BBC](https://www.bbc.com/news/articles/cn0yydwe89jo)",
        "comments": [
            {
                "raw_content": "This isn’t a rival to Starlink, they’re targeting different markets. Terawave is providing back haul services, Starlink is focused on end users. One requires capacity, while the other needs low latency. Terawave would probably be useless for things like gaming or video networking due to satellites being further out.",
                "author": "Belnak"
            },
            {
                "raw_content": "Nice! We need several players in this space (lol). Monopolies suck",
                "author": "Brilliant-Weekend-68"
            },
            {
                "raw_content": "Check out SpaceMobile",
                "author": "cryptofuturebright"
            }
        ],
        "subreddit": "singularity"
    }
]