[
    {
        "post_name": "🔙 BREAKING: Pentagon allowed to redirect weapons and equipment meant for Ukraine BACK to U.S. stockpiles, per memo...",
        "score": 841,
        "text_content": "",
        "comments": [
            {
                "raw_content": "None of our equipment should be going anywhere except to our own military and citizenry. I'm tired of the world getting all the fun toys while we get the goddamn p320 versions of firearms! I mean, it might shoot 125% of the time but that doesn't mean its a good thing!!! >Anyway, happy friday night pedes. :cheers:",
                "author": "Drewniverse"
            },
            {
                "raw_content": "The US stock pile for missles is massively lower than reported",
                "author": "Bax101"
            },
            {
                "raw_content": "Fuck Ukraine. America first",
                "author": "Speedgraphic69"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump appoints Treasury Secretary Scott Bessent as Acting IRS Commissioner 👀",
        "score": 752,
        "text_content": "",
        "comments": [
            {
                "raw_content": "End it entirely!",
                "author": "magapanda"
            },
            {
                "raw_content": "Based Homo. I dig it.",
                "author": "Cop-Morty"
            },
            {
                "raw_content": "if the IRS is to continue to exist then don't make me have to file my own taxes then penalize me if i didn't get the amount exactly right that you already fucking knew. if not, then good riddance.",
                "author": "stargunner"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "💥 BREAKING: TRUMP goes to WAR with CARTELS LAND, AIR AND SEA strikes are on the table 💥 Trump’s given the military the green light to extinguish the cartels that are killing Americans.",
        "score": 155,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Annex 20 miles in to Mexico while you're at it and turn it into a DMZ like it is in Korea and yes, I'm fucking serious.",
                "author": "KE948_U2"
            },
            {
                "raw_content": "Give citizens immunity from legal action in any dispute with illegal non citizen aliens. Turn the scales of justice in our favor right before activating a hot war with an entity that may be well imbedded within our borders.",
                "author": "TooBright"
            },
            {
                "raw_content": "RIP Mossad",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Iran feels Afghan refugees are incompatible and deports 1.8 million of them. So why does the West take them?",
        "score": 1432,
        "text_content": "",
        "comments": [
            {
                "raw_content": "White guilt by liberal soys.",
                "author": "Metriz77"
            },
            {
                "raw_content": "We still haven’t gotten close to deporting a million illegals in over 6 months.",
                "author": "takumargirl"
            },
            {
                "raw_content": "Well \"leave or we will kill you\" is clearly the most effective means of encouraging self-deportations.",
                "author": "RandyQuaidsBeard"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump puts visa and mastercard in their place.",
        "score": 1273,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"Financial institutions have engaged in unacceptable practices to restrict law-abiding individuals’ and businesses’ access to financial services on the basis of political or religious beliefs or lawful business activities. Finally. See: gaming scandal",
                "author": "canada_is_communist"
            },
            {
                "raw_content": "Can't wait to see what scum crawls out from the gutters to sue to have this EO blocked. Might be a proxy in place of those feminist karens from Collective Shout.",
                "author": "AlvinOfTheTrumpmunks"
            },
            {
                "raw_content": "\"NO GAMERS AND ANIME ENJOYERS! YOU CANT SEE TITTIES! YOU MUST LOOK AT OUR FEMININE PENISES!\" - The Left",
                "author": "cjcivicx"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Yup -",
        "score": 1176,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I met Beyonce's horse on a music video shoot. Most of the crew were city people and afraid of it. But I walked right up to it-- scratched it on the nose-- and said \"Hi, what are your pronouns?\" I had to sign an NDA-- it was really crazy, like 50 years! But when my paycheck came it was $17 short, so I figure they broke the contract & I'm not bound by it.",
                "author": "Lunar"
            },
            {
                "raw_content": "I'm not a fan of most country, but I'm sure she's worse. I can't stand this Jelly Roll faggot, who they play on the local \"rock\" station, either.",
                "author": "systemic_threat"
            },
            {
                "raw_content": "Country music hasn't been good since the 80s",
                "author": "MotherCoconuts"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "And it is glorious...",
        "score": 1653,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It will never be enough!",
                "author": "MJK1"
            },
            {
                "raw_content": "Trump beat the Machine in every way they had. Fake news, propaganda, lawfare, you name it. All the old guard methods of keeping outsiders out of the game were deployed. Yet the Teflon Don survived. And now all they can do is seethe",
                "author": "rebuildingMyself"
            },
            {
                "raw_content": "I love the hard line that MANY of the agency secretaries are taking right now. I know that for some, it will never be enough, but it seems like they are ticking off line items for the plan, and I approve!",
                "author": "AslanFan"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Fire Ravages World-Famous Mosque-Cathedral in Cordoba, Spain. The Cathedral of Our Lady of the Assumption was built as a mosque over 200 years starting 785 AD. The mosque opened in 988 AD & remained Muslim for nearly 300 years before the Christian conquest of Cordoba in 1236 AD.",
        "score": 900,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Where there's smoke, there's diversity...",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Motives unclear?",
                "author": "Filo76"
            },
            {
                "raw_content": "How many more, before the Saxon comes to hate?",
                "author": "fadelio"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "HOLY SMOKES. Trump just got the leaders of Armenia and Azerbaijan to sign peace agreements and shake hands, ending a 35 year conflict. What an amazing moment. Give Trump the Nobel Peace Prize right now.",
        "score": 1545,
        "text_content": "",
        "comments": [
            {
                "raw_content": "All this proves to me is the US was paying them to be in conflict.",
                "author": "Greenhills"
            },
            {
                "raw_content": "This is a very great President",
                "author": "RocketSprocket"
            },
            {
                "raw_content": "Literally starting WW3 again. /Democrats",
                "author": "Hanrahan"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: PUTIN TELLS U.S. HE’LL HALT CONFLICT IN EXCHANGE FOR EASTERN UKRAINE — WSJ",
        "score": 1617,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sign the fucking deal.",
                "author": "Jaybone86"
            },
            {
                "raw_content": "This should have been done 11 years ago.",
                "author": "Kaputtmacher"
            },
            {
                "raw_content": "Best case scenario. Break off the portion of Ukraine that wanted to be Russia anyway - and then go back to living life. Stupid shit shouldn't have been drawn out this long. Zelensky and his ego have gotten so many people killed for no reason. Russia got tired of being shelled even after the previous treaty, and finally said \"fuck it we ride\". Once they finally react, Zelensky clown cries to the world stage demanding money, weapons, and lives. Gets more than one \"out\" that he refuses to take. If they don't take this deal, I would have zero sympathy if the entirety of the Ukraine ceased to exist, and Russia took it all.",
                "author": "CAPTAIN_TENDY_PLATE2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "For Big Balls",
        "score": 884,
        "text_content": "",
        "comments": [
            {
                "raw_content": "God speed in your recovery, Big Balls.",
                "author": "JohnMiller2020"
            },
            {
                "raw_content": "Wtf happened to big balls?",
                "author": "Immafancyboy"
            },
            {
                "raw_content": "man i bet all the feminists are really cheering for him huh?....they are cheering right?",
                "author": "Gunmolester"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Paxton: BREAKING: I sued Robert Francis O'Rourke for \"Beto Bribes\" to Democrat runaways to impede the Texas Legislature. I will not allow failed political has-beens to buy off Texas elected officials. I’ll see you in court, Beto.",
        "score": 1524,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How about arresting him? Bribing a public official is a crime.",
                "author": "NomadicKrow2"
            },
            {
                "raw_content": "If you have evidence he did it arrest him, for Christs sake. Whats that Untouchables line. If he comes at you with a knife you bring a gun.",
                "author": "KernalMustard"
            },
            {
                "raw_content": "Not a has been, Beto is a never was.",
                "author": "SubmarineGuy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Juan Deere-3000",
        "score": 815,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You know if someone does not use that name for any agricultural robot they invent, it is a missed opportunity on an epic scale...",
                "author": "Taylor3006"
            },
            {
                "raw_content": "It's time we give these illegals a Juan-way ticket back to where the Hell they came from.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "&#65038; But who's gonna shit in the fields and give us e-coli then? &#65038;",
                "author": "BallotsOnRubysUSB"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "THE DEPORTATIONS WILL CONTINUE.",
        "score": 1241,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is the way.",
                "author": "FatigueIsReal"
            },
            {
                "raw_content": "The key thing here is Kristi (or her social media team) embraced it. haha.",
                "author": "PiratePatriotParrot"
            },
            {
                "raw_content": "They had her killing the pets with a pistol and it's unfortunate because the left killed Peanut the squirrel. They killed the raccoon, too, in New York, and they ate the pets all over America. I guess it's just projection again GenX should do a schoolhouse rock about liberal projection.",
                "author": "Female"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "💀 BREAKING: The Emory University Atlanta shooter is reportedly “DOWN,” per radio traffic—It is NOT known how many casualties there are yet...",
        "score": 989,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Either a trantifa or a basketball-american would be my very educated guess.",
                "author": "FattestConsequence"
            },
            {
                "raw_content": "Sadly another gun free zone.",
                "author": "TraitorJoes"
            },
            {
                "raw_content": "Every time dems have a bad day, there’s a shooting. Weird.",
                "author": "CovfefeVideo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Paxton urges Texas Supreme Court to vacate seats of absent Dems -",
        "score": 1247,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's desertion. A special election should be held immediately to fill the seats.",
                "author": "systemic_threat"
            },
            {
                "raw_content": "Kick them out, Out, OUT!",
                "author": "MythArcana"
            },
            {
                "raw_content": "Good. But, democrats would have just done it on day 1 and forced the republicans to fight it in court. Just like they did to the Maine state representative that didn't agree with the tranny agenda. She had to fight for months through several courts in other states (all corrupt leftist courts) until the Supreme Court finally forced the state legislature to return her right to speak and vote. Meanwhile, she was silenced the entire time.",
                "author": "Scot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "RFK Jr: A child must take between 69 and 92 vaccines to stay in school in some states, and not one of them has been safety tested in a pre-licensing placebo-controlled trial. And that is just malpractice. So the people who are in charge of that are now gone.\"",
        "score": 1936,
        "text_content": "",
        "comments": [
            {
                "raw_content": "My God. In 1971 kids got 3. I used to mock the anti vaxxers. Let me take this opportunity to apologize. Seriously.",
                "author": "Klown_Kutz"
            },
            {
                "raw_content": "Now compare that to a vaccine schedule from the early 1980's or 1960's. And then everyone wonders why our children are so messed up.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Its really cool to see Trump appointing a guy to do a specific task, and then that guy goes out and just ruthlessly starts doing that task and doesn't stop. RFK and Homan are two solid examples. Great picks.",
                "author": "DeathBattleFan123"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Not enough, but progress -",
        "score": 1175,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So much for arresting them?",
                "author": "MAGA_NRG"
            },
            {
                "raw_content": "If they abandoned their job, stop FUCKING paying them... its that simple",
                "author": "Salty_Sailor"
            },
            {
                "raw_content": "Where's the removal from office?",
                "author": "notatallimsure"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "GOP Strategist Lays Out How 2020 Census Disproportionately Hurt Republicans. \"The Census Bureau’s own audit of its work has proven that.\" Of the 14 states that were miscounted, five out of the six undercounted states were red states, and five of the eight overcounted states were blue states.",
        "score": 1448,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not to mention counting millions and millions of Illegal Aliens. Can't forget that.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Funny how every midterm election when there is supposed to be a 'Red Wave', but all we get is a puddle of warm sticky blue goo instead.",
                "author": "MythArcana"
            },
            {
                "raw_content": "Ewww, dailywire. Also, we knew all this at the time. That's why Trump wants a new census.",
                "author": "Filo76"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "PA is implementing the Work Requirement for SNAP for the able-bodied in Sept 1, 2025, and they are limited to 3 months. So by December, no work no SNAP",
        "score": 1383,
        "text_content": "",
        "comments": [
            {
                "raw_content": "[Lyndon Johnson](https://en.wikipedia.org/wiki/Lyndon_B._Johnson) is dead, and his [Great Society](https://en.wikipedia.org/wiki/Great_Society) needs to follow suit.",
                "author": "MythArcana"
            },
            {
                "raw_content": "I expect food riots in Philly or Pittsburgh before Christmas.",
                "author": "sobriquet"
            },
            {
                "raw_content": "They have three weeks to get fat enough to be legally disabled.",
                "author": "MoreVanceMemes"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "[Gamers Nexus] Detained by a Government & Probably Blacklisted by NVIDIA for Our Next Investigation",
        "score": 342,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Kind of crazy he asked for a particular card and they just said \"oh we can make one\". They're literally Tony Stark'n the shit out of scrap GPUs.",
                "author": "PolarizingKabal"
            },
            {
                "raw_content": "I feel like information about the dizzying array of hardware and hardware accessories available here to individual consumers in China is not well known outside of the country. Honestly I think a lot of hardware enthusiasts (from a range of backgrounds) would be rather envious if they could see what is so ready available, abundant, and affordable in a country where most of it is ostensibly restricted according to export controls. Just for example, I can go on Taobao right now and see full-fat 5090s and 4090s widely available - you can choose different VRAM capacities, cooler styles (including two-slot blower designs or AIO water cooled variants). There's also plenty of D-variants and older generation cards if you've got a strict budget and they fit your use-case. They often come with warranty, and they'll test the cards thoroughly (e.g. with gpu\\_burn). There are lively discussion boards and forums where people test and benchmark the cards for all sorts of esoteric use-cases, and recommend reputable sellers. There are also so many creative solutions for installing such hardware, with custom rackmount cases (and racks are extremely affordable), PCIe backboards and risers, solutions for multi-slot cards, SMX to PCIe adapters. All of it is easy to get hold of by individuals, and appropriately affordable. I'll add that this also applies to entire platforms, with server-grade CPUs, motherboards, and RAM being extremely affordable, especially given that you can get hold of qualification samples so easily. I once heard it put that American consumers were long envied by the Chinese for what they could so readily get in the US, but which was unattainable in China. One can't help but sense that the wind is starting to blow in the opposite direction.",
                "author": "Zigong_actias"
            },
            {
                "raw_content": "Never in a million years did I think I would see brother Zhang making a cameo in Steve's video.",
                "author": "antifocus"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Noctua was right: two top exhaust fans can harm thermals",
        "score": 125,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is only valid for air coolers? If i have two top exhaust on my 360 mm AIO will it impact anything?",
                "author": "traderjay_toronto"
            },
            {
                "raw_content": "The original Noctua article: [Airflow Guide - Next Steps : Noctua Knowledge Centre](https://faqs.noctua.at/en/support/solutions/articles/101000530852-airflow-guide-next-steps)",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": "It makes sense if you spend any time thinking about it at all. Or if you just put your hand there and feel the temperature of the air coming out. You’re blowing cool air in the front, then immediately exhausting it out the top before it reaches any of the components you’re trying to cool.",
                "author": "sharksandwich81"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "My commitment to you and our company: A message from Intel CEO Lip-Bu Tan to all company employees",
        "score": 256,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Frank Yeary and the board are the problem. Not Lip-Bu. I hope this sub comes to its senses and sees it.",
                "author": "PilgrimInGrey"
            },
            {
                "raw_content": "\"I have always operated within the highest legal and ethical standards.\" But he's still skating around the recent Cadence revelations that sparked this whole debacle. They weren't allegations, they admitted to illegally providing tech to the Chinese and paid a hefty fine.",
                "author": "travelin_man_yeah"
            },
            {
                "raw_content": "I’m surprised he didn’t lay someone off at the end of the memo.",
                "author": "d00mt0mb"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Core Ultra 7 255U vs. Core Ultra 155U: Early benchmarks show good multi-thread performance improvements (Meteor Lake Intel 3 vs Intel 4)",
        "score": 59,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wish the review was more in depth. Nothing has really changed besides the node, so this gives a good chance to review Intel 3. 30% nT improvement is decent, as well as the ST uplift. Would've also liked to see power consumption comparisons, because without it, matching LNL's nT performance is meaningless.",
                "author": "soggybiscuit93"
            },
            {
                "raw_content": "This is a *drastic* nT perf improvement that makes me question if the power limits for both CPUs (155u and 255u) were actually the same.",
                "author": "Geddagod"
            },
            {
                "raw_content": "It a shame they didn't refresh raptor lake on intel 3 instead of making arrow lake, it could have reused the same socket, had better single thread performance, and been much cheaper than using tsmc n3b and whatever tile design/advanced packaging that also limited performance.",
                "author": "secretOPstrat"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "$2.00 Switch 2 (Code-In-Box/GKC) at Walmart.",
        "score": 588,
        "text_content": "Split Fiction and Yakuza 0 were $2.00 at my local Walmart.",
        "comments": [
            {
                "raw_content": "Insanely lucky.",
                "author": "masterz13"
            },
            {
                "raw_content": "That must be some kind of mistake. That's way too good of a deal. congrats on finding it though.",
                "author": "shadow0wolf0"
            },
            {
                "raw_content": "Buy it.",
                "author": "Possible-Potato-4103"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "This is almost surreal to see on Switch 2",
        "score": 943,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I have two of those left",
                "author": "YoungDiaperBoy"
            },
            {
                "raw_content": "I have the same thing but then with friends from the 3DS",
                "author": "RavenStar64"
            },
            {
                "raw_content": "I have a good amount of friends from wiiu days cuz of the miiverse! Bring it back Nintendo!!",
                "author": "Feltoke"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Virtuos says any game that can run on Series S can run on switch 2 what 3rd party's would you wanna see come to the system?",
        "score": 79,
        "text_content": "",
        "comments": [
            {
                "raw_content": "All of them.",
                "author": "jalikeyazz"
            },
            {
                "raw_content": "Expedition 33",
                "author": "Justin6D"
            },
            {
                "raw_content": "Fallout New Vegas lol",
                "author": "TheIndecisiveBastard"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I made a dock cover out of air-dry clay 🌊",
        "score": 159,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It reminds me a little bit of the Animal Crossing edition of the Switch 1! https://preview.redd.it/w9owrkddauhf1.png?width=1200&format=png&auto=webp&s=07211fdae75088c231eb8365dbf33733d0c7b747",
                "author": "mrmivo"
            },
            {
                "raw_content": "Are those joycons covers or are they third party controllers? Didn't know there were any yet",
                "author": "Kermit_Wazowski"
            },
            {
                "raw_content": "omgg sıch a cute idea! did you glue it to the dock?",
                "author": "nefretediyorum"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "This experience is just absolutely unmatched",
        "score": 106,
        "text_content": "Being able to play street fighter in bed with this controller with YouTube on the TV is just PEAK",
        "comments": [
            {
                "raw_content": "Agreeded with a similar layout, i perfer the sega saturn so im using a retrobit saturn pad! So nice to be able to get some practice in while watching something else",
                "author": "biofrost"
            },
            {
                "raw_content": "Is that controller Bluetooth?",
                "author": "Solsobreviviente"
            },
            {
                "raw_content": "Beautiful!",
                "author": "Soft-Bowler-6320"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Dk just makes me even more excited for next 3d zelda and makes me also want dk 1-3 hd remake.",
        "score": 56,
        "text_content": "At like 94% on dk on fossils and bananas now after hitting credits like 12 days ago. Such a amazing game 5/6th favorite game of all time not sure if i put it above batman arkham city or not that's why I have it at 5/6. Not sure how people are doing everything in like 40 hours has i am almost at 65 have played basically no other video games sense it came out. Dk is one of my favorite franchise having played this and loved it plus getting some of the nostalgic things makes me wish we could get a dk 1-3 hd collection to. Also just seeing how much Nintendo cooked with this game just makes me even more excited to see what they do with the next zelda game. Dk graphics are really good far better than any switch 1 game and I loved how zelda botw and totk looked on switch 1 and now we got a lot more power. I have not played botw/totk on switch 2 yet but hearing people talk about it and knowing how dk turned out and how much more powerful switch 2 is compared to switch 1 its exciting to imagine the next zelda.",
        "comments": [
            {
                "raw_content": "Say what you want about Nintendo, but they still make amazing games.",
                "author": "Rawkhawkjayhawk"
            },
            {
                "raw_content": "DK trilogy remade would be amazing!",
                "author": "GolfingMoose"
            },
            {
                "raw_content": "Every time I entered a 2D challenge area in DKB I had the same thought: I would play an entire game in this format with these graphics and mechanics. They were easily some of the best parts of the game IMO.",
                "author": "PineappleOnPizzaWins"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Partner direct last week, indie one this week. Regular direct next week?",
        "score": 47,
        "text_content": "Had a direct 2 weeks in a row are we going to make it 3 in a row next week? We still need like metriod 4, hyrul warriors release dates etc. Maybe we get mario kart dlc and maybe 1 2026 teaser or something",
        "comments": [
            {
                "raw_content": "Gamescom is coming up, so I'm assuming no. Plus they've already announced more will be said/shown on Prime 4 there.",
                "author": "NintendoNoNo"
            },
            {
                "raw_content": "It will probably be in September along with a Mario anniversary direct.",
                "author": "Old_Atmosphere_651"
            },
            {
                "raw_content": "Next week is Drag X Drive's week whether we like it or not. So probably no.",
                "author": "emeraldbar77"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "PowerA Wired Earbud for Nintendo Switch - Metroid",
        "score": 16,
        "text_content": "Amazon link: https://a.co/d/aKQNeZ0",
        "comments": [
            {
                "raw_content": "Everything but a release date 🙏",
                "author": "Grape_Gobbler"
            },
            {
                "raw_content": "This might be me huffing copium but isn’t it a bit strange that it’s using a different render from each of the 3 prime games for the carry case? Are we actually gonna get the whole series on Switch before 4?",
                "author": "Espurreyes"
            },
            {
                "raw_content": "Id rather get some IEM’s for that price",
                "author": "Silent-Firefighter74"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "[GIBiz] Many Live Service developers are eyeing next year for ending PS4 support for their games in favor of the current generation",
        "score": 582,
        "text_content": ">It's not the only reason that 2026 is an important year for the console market, though. >It was widely reported this week that Hoyoverse will discontinue PS4 support in Genshin Impact next year – but this is not an isolated move, **with many other operators of major online and live service titles also eyeing up the timeline for dropping PS4 support.** >Some of those decisions will be accelerated by technical concerns (Genshin Impact's huge, streaming game world is especially awful on the slow hard drive that shipped in the PS4, and benefits massively from the SSD in more recent systems), but the tipping point is already in sight; installed bases of newer systems are high enough for lots of companies to start turning out the lights on PS4. [https://www.gamesindustry.biz/sonys-confidence-in-playstation-is-well-placed-opinion](https://www.gamesindustry.biz/sonys-confidence-in-playstation-is-well-placed-opinion) I asked the person that made the thread if I could copy the title, since the article itself is more about PlayStation's current place. [https://www.resetera.com/threads/gibiz-many-live-service-developers-are-eyeing-next-year-for-ending-ps4-support-for-their-games-in-favor-of-the-current-generation.1265637/](https://www.resetera.com/threads/gibiz-many-live-service-developers-are-eyeing-next-year-for-ending-ps4-support-for-their-games-in-favor-of-the-current-generation.1265637/)",
        "comments": [
            {
                "raw_content": "Next gen's cross-gen is going to last ten years at this rate...",
                "author": "SelectivelyGood"
            },
            {
                "raw_content": "Fallout 76 it's time for an overhaul gang",
                "author": "M4rshst0mp"
            },
            {
                "raw_content": "I've heard Genshin Impact is painfully slow in terms of its loading times on PS4.",
                "author": "MrYK_"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Bloodlines 2 release date and cover art",
        "score": 263,
        "text_content": "Preorder listing from a store in the Philippines got put up early, releases October 21st https://gamextreme.ph/products/pre-order-vampire-the-masquerade-bloodlines-2-playstation-5-r3 Backup images in case the listing is removed https://imgur.com/a/EiFuE28",
        "comments": [
            {
                "raw_content": "I legitimately forgot all about this game. They announced it so long ago.",
                "author": "YouThinkOfABetter1"
            },
            {
                "raw_content": "First time I've seen that cover and this recently got a hands-on impression from GameInformer. Still scheduled for October so maybe a Gamescom release date announcement?",
                "author": "Turbostrider27"
            },
            {
                "raw_content": "\"Bloodlines 2\" and \"release date\" are words that I did not expect to see together. That's like saying there was a live action Avatar The Last Airbender movie in the early 2010s. Doesn't exist.",
                "author": "whiteshark70"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "AMD Ryzen Threadripper 9980X 9970 Review: Zen 5 Powers Massive Gains",
        "score": 33,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Im just amazed its an article that not from Videocardz",
                "author": "Coompa"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Asus ROG Strix G18 2025 review - An 18-inch gaming laptop with the powerful AMD 9955HX & RTX 5070",
        "score": 41,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why are the cpus in laptops always a much higher tier than the gpus they are paired with?",
                "author": "JamesDoesGaming902"
            },
            {
                "raw_content": "16 Zen 5 cores and 8gb 5060ti equivalent marketed for gaming??? Amd will do anything but put 6 or 8 vcache cores in a gaming laptop even though those are the most efficient gaming cores",
                "author": "secretOPstrat"
            },
            {
                "raw_content": "I'd pick it up if it was 5070ti",
                "author": "SpookyKG"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "MSI to launch X870E GODLIKE X and GODLIKE MAX motherboards",
        "score": 9,
        "text_content": "",
        "comments": [
            {
                "raw_content": "paying that much for am5 boards is just stupid. At that point buy threadripper and get all the threads, ram and pcie lanes you can dream of.",
                "author": "GestureArtist"
            },
            {
                "raw_content": "Why? What’s the point? 2 pcie 5? I don’t get the market besides rich people",
                "author": "why_is_this_username"
            },
            {
                "raw_content": "I need one of these to compensate for my tiny penis",
                "author": "AnxiousJedi"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "[GOBankingRates]: 20 Cities Where Home Prices Are Expected To Crash in the Next 12 Months",
        "score": 65,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Anything less than 10% is considered a crash ? That’s a small correction…..",
                "author": "dotsonnn"
            },
            {
                "raw_content": "including these 10 major metros: * New Orleans, Louisiana: -7.2% * San Francisco, California: -6.1% * Austin, Texas: -5.1% * San Jose, California: -4.0% * Honolulu, Hawaii: -3.8% * Denver, Colorado: -3.8% * Sacramento, California: -3.7% * San Antonio, Texas: -3.6% * Portland, Oregon: -3.5% * Washington, D.C.: -3.3% i mean, no surprises here obviously. the important thing is, once YOY medians turn negative, that gives the news media plausible clearance to start using language like crash, bubble, downturn, and so forth. (and of course they will, b/c it draws shares and clicks.) you don’t see that sort of language beforehand b/c it’s overly predictive and becomes a credibility issue. this is *really* what drives the direction of sentiment in a speculative bubble. it’s fear on the way up, fear on the way down. the average person’s knowledge about the housing market amounts to “what people are saying”. they don’t know shit about any of the underlying data. but once sentiment turns negative, hoo boy, buckle up. there’s no price support, so we can predict exactly what will happen. “price support”? let me give a good example. if you’re a RE investor and prices are going down, *and* rents are depressed far below prices, what happens is you *won’t* buy because now, and so prices *overshoot*.",
                "author": "acqua_di_hoomertears"
            },
            {
                "raw_content": ">home prices are expected to crash! You will see whopping discounts and banger deals such as: * House listed for same price as 3 years ago, but monthly payment still costs much more because of interest rates",
                "author": "point_of_you"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Inside the ‘Dying’ Kansas Ghost Towns Where You Can Find a Home for Less Than the Price of a Tesla",
        "score": 143,
        "text_content": "While moving to a remote rural area might not be the traditional American dream, it could be the perfect way to take a first step onto the property ladder—while also helping to breathe new life into the country's \"dying\" ghost towns.",
        "comments": [
            {
                "raw_content": "Yes. A “property ladder” where all the rungs above you are broken. You buy one of these houses , you’d better plan on dying in it, cause you’re not reselling it.",
                "author": "EnvironmentalFly1372"
            },
            {
                "raw_content": "nothing like owning a home where it's impossible to find qualified people like plumbers, electricians etc and where it can take forever to sell if for some reason you need to move. fixing a home in a town like that is still expensive.",
                "author": "KevinDean4599"
            },
            {
                "raw_content": "Let me know when I can buy the entire town for $1 and I'll be right there",
                "author": "GuerrillaSapien"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Homebuilding Momentum Falters in 2025 Where Inventory Climbs",
        "score": 11,
        "text_content": "",
        "comments": [
            {
                "raw_content": "builders aren't building as much because they project smaller amounts of buyers in the future. it's quite bearish",
                "author": "HormoneDemon"
            },
            {
                "raw_content": "* Single-family permitting dropped 6.3% in the first half of 2025, led by sharp declines in Jacksonville, San Antonio and Boston. * The slowdown comes after a rebound in 2024. Last year, single-family starts finished the year up 6.6% in 2024, ending a two-year decline and keeping homebuilding above the pre-pandemic pace. * Attached, single-family construction — condos and townhomes — increased at twice the rate of detached, single-family homebuilding. Single-family permitting fell 6.3% in the first half of 2025, signaling a slowdown after a year of rebound. Markets like Jacksonville, San Antonio, and Boston led the retreat in permits, with each seeing double-digit percentage declines compared to the same period in 2024. Affordability remains a major challenge, especially for first-time buyers, despite slightly lower mortgage rates. Buyers are gaining leverage but sales volumes are sluggish and inventories are rising across much of the country. Existing home inventory is now at a six-year high and exceeds pre-pandemic levels in many markets, forcing builders to increase incentives and reduce prices to maintain sales. While permitting activity in 2025 remains 16% above pre-pandemic levels, it’s a step down from 2024’s momentum, reflecting shifting builder sentiment. Notably, more than half of the 50 largest metros are still permitting more homes than their pre-2020 average, but overall momentum is clearly weakening. Markets with the largest declines in permitting activity Among the largest 50 metros, Jacksonville, San Antonio, Boston, Denver and St. Louis have seen the largest pullback in total single-family permits issued in the first six months of the year, compared to last year. Some markets are still gaining Among the largest 50 metros, Kansas City, Orlando, Cincinnati, Pittsburgh and Oklahoma City have seen the largest increase in total single-family permits issued in the first six months of the year, compared to last year. Permitting activity is 16% above pre-pandemic levels but down from 2024 Difference in total single-family permits issued in January 2024 - June 2024 and January 2025- June 2025 2024: A Rebound Year for Homebuilding Homebuilding rebounded in 2024 after two years in decline, driven by builder optimism, easing mortgage rates, low resale inventory and a 4.7 million-unit housing deficit to address. In response to the ongoing housing affordability crisis, builders doubled down on their pivot toward more affordable and more dense housing types. Single-family starts rose 6.6%, while condo and townhome construction surged 10.7%, more than twice the growth rate of detached homes. This expands on a trend that began in 2022 and continued in 2023. As the cost of space increased, lot size and home size shrank The average size of new single-family homes shrank to 2,100 square feet, down 100 square feet from the year prior and 200 below the pre-pandemic average. Lot sizes declined even faster to 6,300 square feet, now 1,100 square feet smaller than in 2019. Builder confidence was buoyed by limited resale inventory, mortgage rates falling from their 2023 highs, and an incentives strategy that kept new home sales rising. Long-Term Affordability Tied to Underbuilding Persistent underbuilding in expensive markets continues to erode affordability. Metro areas with high price-to-income ratios, such as San Jose, Los Angeles, and San Francisco, consistently permit fewer homes per capita than other regions. In the past 12 months, metros with price-to-income ratios one standard deviation above the national average issued less than half as many permits per capita on average as their peers, locking in long-term affordability challenges. Policy Solutions: Unlocking More Supply Builders can only respond to demand where regulations allow. While geographic constraints can play an important role, zoning and permitting policies restrict housing growth in many cities. Tackling the housing deficit will require structural reforms: * Zone for more density: Allow multifamily, middle housing, and higher-density development. * Relax parking mandates: Lower costs and expand buildable area. * Streamline approvals: Reduce permitting delays. * Fund affordability: Expand trust funds to support affordable development.",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Yep, I said it, IT'S NOT THE PRICE!",
        "score": 11,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Spoiler alert: it was indeed, still the price.",
                "author": "vblade2003"
            },
            {
                "raw_content": "It's OK to be wrong. Also, it isn't a done deal. We should get you a big \"Mission Accomplished\" banner you can stand in front of.",
                "author": "TX_AG11"
            },
            {
                "raw_content": "Per OP, it technically wasn’t a 10% price reduction because he negotiated it down to that with the buyer. This dude’s an idiot.",
                "author": "saving3pups"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Need advice on selling",
        "score": 9,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Paid $620K ($25K over asking) in 2023 ☠️",
                "author": "rentvent"
            },
            {
                "raw_content": "It's amazing how many people realize they bought at the peak of a market and are now looking to get out whole. In other words, to pass the bag to another idiot.",
                "author": "JWaltniz"
            },
            {
                "raw_content": "Woof, listed now at $625k and bought 2 years ago at $620k. Florida in a nutshell right now. 8/8/2025 Price change $624,800 7/24/2023 Sold $620,000 6/17/2023 Pending sale $595,000 6/16/2023 Listed for sale $595,000 Edit: Formatting",
                "author": "Contemplationz"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Zillow: CPI Shelter Forecast, July 2025",
        "score": 4,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Help us get this house sold.",
        "score": 3,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They priced it right in 2020, that's the price it should sell at.",
                "author": "ChadwithZipp2"
            },
            {
                "raw_content": "Quick, hold this bag!",
                "author": "RequiredFieldz"
            },
            {
                "raw_content": "Very cool house that will definitely flood. Not really real estate news",
                "author": "Quick-Audience7860"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Sam Altman says some users want ChatGPT to be a 'yes man' because they've never had anyone support them before",
        "score": 265,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No lie there",
                "author": "Beeehives"
            },
            {
                "raw_content": "It would be wise for us to reflect on this statement as it relates to our entire lives, not just digital.",
                "author": "beardfordshire"
            },
            {
                "raw_content": "I honestly cant blame Sam or either of those people wanting 4O back The only route here is more user based customisation and the model adapting to the needs. But I wish I could use O3 again, GPT5thinking falls short",
                "author": "rickyrulesNEW"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Google DeepMind isn't slowing down",
        "score": 1224,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Google is so blessed they have found such a likable guy to lead their AI department. Demis is so calm and measured, I even prefer him to Dario Amodei, without even mentioning Sam or Elon ugh",
                "author": "Ready-Journalist1772"
            },
            {
                "raw_content": "But do they have custom chat colours?",
                "author": "Korvozi"
            },
            {
                "raw_content": "I like this. No fuss, just pure facts. A tweet like this, in times like this, gives me a grounded feel and makes me like Demis even more. It's the quiet kid in class getting A+ on every test, but says nothing. I've always had huge respect for those kind of people.",
                "author": "Spooderman_Spongebob"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Thank you Lord altman",
        "score": 1243,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Damn, chatgpt is getting emergency patch notes.",
                "author": "nanlinr"
            },
            {
                "raw_content": "When he says gpt 5 was performing way worse than it should does he just mean it wasn’t routing to the thinking mode or does he mean the base model was being shit for no reason? Does this mean in theory pro users could’ve been sent to 5 mini when using 5?",
                "author": "drizzyxs"
            },
            {
                "raw_content": "So I guess it is just all the models glued together",
                "author": "Setsuiii"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The people asking to bring back 4o reminds me of a certain type of person.",
        "score": 713,
        "text_content": "",
        "comments": [
            {
                "raw_content": "r/MyBoyfriendIsAI in shambles",
                "author": "justlurkin7"
            },
            {
                "raw_content": "For those of us lacking in empathy, AI has become a replacement for much needed social contact for many humans as sorry a state of affairs that may seem. The rise of AI chat bots like ChatGPT shows that there is indeed a loneliness epidemic that requires a solution. AI has been filling that gap for people for example dealing with autism, anxiety or abuse issues and ChatGPT 4o happened to be one of the best in that field.",
                "author": "Able2c"
            },
            {
                "raw_content": "In all honesty, it does seem that people who were using 4o for creative tasks, world-building, and contextual language understanding in translations are struggling to get the same results with GPT-5, which is fascinating because I thought it was supposed to be more creative, natural, and better at writing.",
                "author": "ChillWatcher98"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The meltdown over the lost of 4o is a live demo of how easily a future and more sophisticated system will be able to do whatever it wants with people...",
        "score": 137,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Shit. This made me realize how many people are dependent on ChatGPT. Not other platforms, OpenAI specifically.",
                "author": "RedLock0"
            },
            {
                "raw_content": "There’s the emotional component people describe missing, and then a lot of mentions about writing. I can’t help but think that anyone so dependent on ChatGPT for being capable of creative writing never really was capable of it. They just liked what 4o wrote for them. And a step further, 5 would probably do that if they put as much effort into their prompts as these absurd posts. Exactly why is vague, but this feels dark. Maybe 5 doesn’t act like that because it shouldn’t. Maybe the sycophant was dialed out and those that leeched into it are in withdrawal. Idk. Meanwhile I’m over here floored on all the potential 5 (today, not yesterday) has shown me already… you know, most people don’t like smart people. Maybe AI reached that point. How many people ACTUALLY want to listen to a PhD expert speak? 😂 What a world…",
                "author": "Ferret4Ferret"
            },
            {
                "raw_content": "Then so be it. Am glad lot of these people are finding support in a way. Many dont have the time/ money /energy to invest in humans or a therapist + you are not always fortunate to have a good social circle that really cares for you Only thing I would like them to be is - being self aware about all of this",
                "author": "rickyrulesNEW"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "GPT-5: the Manhattan Project of overpromising",
        "score": 961,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Latest famous words: \"we think you'll like it\"",
                "author": "adarkuccio"
            },
            {
                "raw_content": "Now that (almost) everyone can use GPT-5 themselves, we won‘t hear any more gum-flapping from Sam about how “frightened” he is of it.",
                "author": "Appropriate-Peak6561"
            },
            {
                "raw_content": "Maybe now you guys will learn to stop trusting CEOs with no technical chops selling their products purely based off hype.",
                "author": "Mindrust"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Sam Altman New Tweet on GPT-5",
        "score": 310,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Damn, did 20 questions on the blind GPT 5 vs 4, and it was 90% GPT 5 lol",
                "author": "Howdareme9"
            },
            {
                "raw_content": "If he's using caps then it means that he's really serious about it lol",
                "author": "Sunifred"
            },
            {
                "raw_content": "Imho they're working 99% only on improving the intelligence of the model, they should put some effort in UI/UX because it really needs some love, let alone features like customization etc Imho working/interacting with GPT could be much easier and a much better experience even without improving its intelligence But yes then we also want AGI in the end but we're still very far",
                "author": "adarkuccio"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Google is charging up to something 👀",
        "score": 679,
        "text_content": "They're hinting at something new and bigger, his baldness is very telling, its shining something under lines. Whats up? I heard Zuck is playing atenttion very closely. Can they rival GPT5 juggernauty lead?",
        "comments": [
            {
                "raw_content": "The best thing about GPT-5 is that we'll soon have Gemini 3.0",
                "author": "Neomadra2"
            },
            {
                "raw_content": "That's more of a \"we were worried for nothing\" look.",
                "author": "Aggravating-Egg-8310"
            },
            {
                "raw_content": "I'll believe Google has something good when either Kilpatrick is as bald as Demis, or when Demis suddenly has as much hair as Kilpatrick. There's no in between.",
                "author": "orderinthefort"
            }
        ],
        "subreddit": "singularity"
    }
]