[
    {
        "post_name": "Since the 2000’s we’ve been forced to replace every bulb in our house with flickering LEDs that are supposed to be way more energy efficient. We’ve been forced into HE washers and dryers. We have eco modes forced into tvs and thermostats. And yet our power bill is way higher.",
        "score": 1268,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Anyone notice how our electric bills skyrocketed once they started these data centers to further ruin our lives?",
                "author": "MythArcana"
            },
            {
                "raw_content": "Decommissioning coal in favor of solar and wind was a giant part of that.",
                "author": "Former_RM2"
            },
            {
                "raw_content": "LED bulbs don't \"flicker\" and he's conflating them with the compact fluorescent ones they tried to force on us which were terrible. LED's are much brighter with a fraction of the voltage needed to illuminate them and give off no heat. They're way better than any older kind of bulb and are used in everything.",
                "author": "South_Florida_Guy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "As previously mentioned, we are giving serious thought to taking away Rosie O’Donnell’s Citizenship. She is not a Great American and is, in my opinion, incapable of being so!",
        "score": 850,
        "text_content": "",
        "comments": [
            {
                "raw_content": "MOTHERF*CKER, IT'S REAL!!!",
                "author": "TrumpWonByALandslide"
            },
            {
                "raw_content": "lmao! WTF are we going to do when he leaves? He is one of the best trolls to ever exist",
                "author": "PeaceMakerDJT"
            },
            {
                "raw_content": "Obama already set the precedent that American citizens can be drone striked without a trial, just send it.",
                "author": "MoreVanceMemes"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨President Trump just posted this video of Governor Gavin Newsom, on truth social.",
        "score": 643,
        "text_content": "",
        "comments": [
            {
                "raw_content": "BREAKING: 🚨 Speculation growing on MAJOR late evening Trump announcement. Top advisor Dan Scavino says POTUS may in fact \"BREAK the internet.\" Slowclap. Wow.",
                "author": "hackinthebox"
            },
            {
                "raw_content": "Game set match",
                "author": "TruculentGoose"
            },
            {
                "raw_content": "Why would he make Newscum look so much more manly than he really is?",
                "author": "conservativefrank"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump is trolling so good tonight 🤣🤣",
        "score": 588,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Newscum. Same scum as the oldscum.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Trump 2028!",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "This was Newsom's feeble attempt at fearmongering.",
                "author": "boreal_storm"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "UK",
        "score": 432,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Get arrested and then raped. Where's the \"Make doomsday weapon and turn the planet into a radioactive ball of dust\" button.",
                "author": "DiamondDroid"
            },
            {
                "raw_content": "You don't press either of those buttons. You grab your knives, you grab your axes and your pitchforks and you throw open the curtain and you tell the guy behind it *\"You're not welcome here any longer.\"* Because if they'll do this to you, then what do they have in plan for your children?",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Rape as a weapon",
                "author": "BenjaminLWillard"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Secretary Kennedy : The CDC once stood as the world’s most trusted guardian of public health. But bureaucracy, politicized science, and mission creep corroded its mission and destroyed public trust. My mission is clear: restore the CDC’s focus on infectious disease, drive innovation",
        "score": 1150,
        "text_content": "",
        "comments": [
            {
                "raw_content": "RFK Jr is the best. You have to love this guy and his honest way of stating the truth. The CDC was a useless corrupt government organization interested in getting rich off patents. COVID clot shot mandates were murder.",
                "author": "NotYourMan"
            },
            {
                "raw_content": "# According to the CDC, it is acceptable to give FORTY teenage boys myocarditis in order to save ONE 90 year old from covid (not that I believe it would actually save the 90 year old).",
                "author": "tpactionchasethevote"
            },
            {
                "raw_content": "The CDC can NEVER have any official power, nor can any agency on health. Toure there for RESEARCH purposes, not crafting \"best practices\", \"policies\" or \"recommendations\" that can be enforced or used to create mandates or \"entrance policies\" for businesses. In other words, no health \"authorities\" that can apprehend people, force something on you or exclude you for non-compliance",
                "author": "DingleBalls"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: The Trump administration has formally requested MILITARY ASSISTANCE in Chicago, per a DHS memo obtained by @kenklippenstein ! IT’S TIME! CHICAGO WILL BE FREED! 🇺🇸",
        "score": 1052,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They better let our servicemen carry arms, LOADED arms, before setting foot into that den of crime. Many elements in that city who might pose a threat. Arrest the mayor.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "You can take a chimp out of the hood but you are going to need Trump to come to the hood and and take the hood out of the chimp.",
                "author": "KennyKetchem"
            },
            {
                "raw_content": "Better patrol while armed with subway sandwiches and rope. This is MAGA country!!",
                "author": "getup"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "UPDATE: PSD Mountain Schools has DELETED their account after LoTT exposed a drag queen teacher at their school. The teacher, Ethan Ferris, said \"I'm gonna come by with a Molotov cocktail tomorrow...\"",
        "score": 954,
        "text_content": "",
        "comments": [
            {
                "raw_content": "do parents not meet the teachers anymore? pta? parent-teacher conference ? holy shit balls folks.",
                "author": "throttlejohnson"
            },
            {
                "raw_content": "Liberals: \"Homeschool kids are so dumb lol!\" Also Liberals:",
                "author": "38WendysHamSquare79"
            },
            {
                "raw_content": "They better arrest this guy. He is another crazy transgender potential mass murderer. His threats are no joke.",
                "author": "NotYourMan"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Canuckistan: the best defense is to comply (and let them rape your wife and kids)",
        "score": 1173,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Best defense is to blow their fucking heads off. Dead intruder can't harm anyone.",
                "author": "Valiazaner"
            },
            {
                "raw_content": "Yeah , they recommended leaving your key fob in sight so car thieves don’t have to fuck around with breaking windows and what not . At least we’ll be easy to invade , if you kill your enemy they win after all .",
                "author": "AutoEroticHonk"
            },
            {
                "raw_content": "I don't know if there's an entity That certifies if you're a country.... but if there is can we look into Pulling Canada's status as one... Maybe reclassify them as a collection of cucks occupying land",
                "author": "shaun1066"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump Seeks Supreme Court Review of E. Jean Carroll Verdict.",
        "score": 1078,
        "text_content": "",
        "comments": [
            {
                "raw_content": "In terms of this verdict - Trump is the actual victim of attempted rape.",
                "author": "MAGAguitar"
            },
            {
                "raw_content": "Only Reddit believes that happened.",
                "author": "MythArcana"
            },
            {
                "raw_content": "Rape is sexy. - Easy Jean carroll.",
                "author": "Keep_on_winning_kag"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Colorado wants to be even more gay. Unbelievable.",
        "score": 1041,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The funny part is that they think they are promoting inclusion but in reality are sending out the signal that they are bat shit crazy political actors to be avoided. Or in other words these people are making unforced errors. They can still hold their idiotic degenerate ideas but they don't need to advertise them. They can still easy promote tourism for the state without exposing their personal lunacy.",
                "author": "Roadpower"
            },
            {
                "raw_content": "I love this state so much but it gets gayer every day. How do we take it back?",
                "author": "Magister_Caeli"
            },
            {
                "raw_content": "Why are you ghey?",
                "author": "MAGA_mantis"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "DeSantis says Alligator Alcatraz ‘still being operated,’ hints at new facility called ‘Panhandle Pokey’",
        "score": 1278,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“The Panhandle Pokey” I love it!",
                "author": "Redpilled2Depression"
            },
            {
                "raw_content": "Why not abduct the judge who issued this bogus ruling, send her to Alligator Alcatraz, and have her die in custody? That’s the kind of chilling effect we want to impress on the federal judiciary right now",
                "author": "henri_derelicte"
            },
            {
                "raw_content": "### No Fucking Brakes!",
                "author": "Liberals_R_Idiots"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "John Thune now says they Senate is preparing to “CLEAR THE BACKLOG” of President Trump’s nominees",
        "score": 1226,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This the same John Thune who blocked recess appointments? I'll believe it when I see it.",
                "author": "DeploraBen"
            },
            {
                "raw_content": "\"Preparing\"... What a uni-Party turd.",
                "author": "loooooof"
            },
            {
                "raw_content": "John Thune has a long backlog of cocks to suck.",
                "author": "Liberals_R_Idiots"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Imagine rooting for a group of people who would kidnap you and chain you to a dirty mattress and rent you out to drunks for an hour at a time",
        "score": 1145,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Interesting that she believes she knows the cartels. Is she involved? Was she born in a foreign country and was a victim of them? Can we deport her?",
                "author": "Just_a_Patriot"
            },
            {
                "raw_content": "You can only sell drugs once, you can sell a puta again and again",
                "author": "Crappydatum"
            },
            {
                "raw_content": "Letting them vote is a civilization ending error.",
                "author": "Wexit-Delecto"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Operation Box Cutter",
        "score": 1366,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Alphabets are already involved in or run most of these operations so there's that.",
                "author": "ConGrande1"
            },
            {
                "raw_content": "'Operation Box cutter'. Interesting, considering we are a week away from another 9/11 anniversary.",
                "author": "loooooof"
            },
            {
                "raw_content": "So the Mescans aren’t the ones making it ?",
                "author": "Lincoln6ech0"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump says New Orleans — rather than Chicago — could be next to get federal police crackdown",
        "score": 1045,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Don’t back down. Chicago needs a crackdown",
                "author": "henri_derelicte"
            },
            {
                "raw_content": "so many democrat run shitholes to choose from... keep'em guessing!!",
                "author": "austford"
            },
            {
                "raw_content": "Please. I used to love New Orleans. in 2019 I saw so much faggotry and a dead lady on the side walk in front of a building and Canal St had been closed for years over that stupid building collapse I said no more, I'm done.",
                "author": "olliec420"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Stephen King: Trump 'Probably Started the Rumor He's Sick or Dead' to Boost Press Conference Ratings",
        "score": 722,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What a shocker that the author of some of the sickest shit ever ... SAYS some of the sickest shit ever.",
                "author": "MocksFordComma"
            },
            {
                "raw_content": "The democrats lied and made it up, and this pedo lies some more for his cult.",
                "author": "projectarcturus1"
            },
            {
                "raw_content": "a guy with that hairline at his age has zero testosterone in his body",
                "author": "Retard_Strength"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: The Trump administration has formally requested MILITARY ASSISTANCE in Chicago, per a DHS memo obtained by @kenklippenstein. IT’S TIME! CHICAGO WILL BE FREED! 🇺🇸",
        "score": 437,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They better let our servicemen carry arms, LOADED arms, before setting foot into that den of crime. Many elements in that city who might pose a threat. Arrest the mayor.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "News so nice, it gets stickied twice",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Just Fly The B2 Through And Sterilize That Shithole.",
                "author": "MericaFukYeah"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "💊 Pirro Strikes Blow to Narco-Trafficking: Historic Seizure of Precursor Chemicals Exposes China–Cartel Drug Route 🐼",
        "score": 1053,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fuck Chy-nuh, they know exactly what they are doing, trying to poison America.",
                "author": "kek-is-tan"
            },
            {
                "raw_content": ">it's going to take 24 18-wheelers to take all of these containers and put them in a secure storage facility. Who is going to have the keys to this facility, and will these materials be destroyed? Or will they merely be used later to make meth that then gets sold by CIA assets directly instead of going through the cartel middle men? Disclaimer: I am not casting any aspersions on Judge Jeanine. My concern here is with how to keep the other elements of the government from simply adjusting their business processes to navigate around the speed bump she has created. Hopefully this puts a permanent hole in the CIA's black budget.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Follow the money involved and see who's really pulling the strings here.",
                "author": "JimmyRussler"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: The Surgeon General of Florida just announced ALL VACCINE MANDATES IN FLORIDA will be ENDED, and the room erupted. All. Not just COVID. ALL.",
        "score": 437,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Vaccines should be 100% voluntary across the board. Doesn't matter for what and there should be no entity at any level public or lrovate allowed to make it a \"term of service\". If your vaccine works you're protected regardless of what i do. So there's no rationale for people worried being near a...measles carrier if they already got their vax for instance.",
                "author": "DingleBalls"
            },
            {
                "raw_content": "Any Liberal that says anything against this, just say, \"But I thought you believed in the whole my body my choice thing.\" Now don't expect them to actually stand by it though, because NEVER TAKE A LIBERAL AT FACE VALUE!",
                "author": "Emperorvoid"
            },
            {
                "raw_content": "Now do vaccines in the food supply, and vaccines spread by mosquitos and such.",
                "author": "Freedom_Feels_Good"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Old Anandtech redirects to inferior articles from tomshardware....",
        "score": 229,
        "text_content": "Wasn't sure where to post this but I was looking through some articles on my linkding. I have an offline HTML copy but when I clicked it to see what happens it loaded an article from tomshardware on the same subject. - **Original**: https://www.anandtech.com/show/21445/qualcomm-snapdragon-x-architecture-deep-dive - **Archive.org**: https://web.archive.org/web/20250304025124/https://www.anandtech.com/show/21445/qualcomm-snapdragon-x-architecture-deep-dive - **Toms Article (after redirect)**: https://www.tomshardware.com/qualcomm-snapdragon-x-series-everything-we-know You'll agree that's sneaky, it's not the same content and imo it's much more inferior and not even covering the same detail (Deepdive vs a basic overview). Also what has happened!? Why not just keep the original alive... They've massacred my boy.",
        "comments": [
            {
                "raw_content": "> Why not just keep the original alive... They've massacred my boy. It was the paywall on Tom's that did it. If you're charging for historic Tom's articles, then it looks bad to have a free alternative that your company owns. So they removed that free alternative.",
                "author": "ImSpartacus811"
            },
            {
                "raw_content": "You're a few weeks behind the times, but unfortunately, that is correct. https://www.reddit.com/r/hardware/comments/1milnvk/anandtechs_archive_of_articles_has_been_taken/ As near as anyone can tell, certain old article URLs are being redirected to Tom's Hardware articles, and everything else goes to the forums. Some of those article redirects are poor matches, so I'm assuming this is keyword based (e.g. Snapdragon X) rather than hand-curated. Last week's LTT WAN Show covered this a bit as well. It sounds like AnandTech was hosted by a third party provider (i.e. not by Future), so there was a distinct and quantifiable cost to keeping AnandTech up.",
                "author": "Verite_Rendition"
            },
            {
                "raw_content": "Oh man. Just yesterday I went through my Feedly subscriptions and purged a bunch. I hadn’t deleted anything since my Google Reader subscriptions were migrated over back in the early 2010’s. Anandtech was one of the subs I deleted. I got a little emotional at all the classic sites I used to read all the time but hadn’t thought about in years. Here’s to you, 1UP and GWJ.",
                "author": "Ancillas"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Level1Techs]Intel Arc Pro B50 review and discussion",
        "score": 135,
        "text_content": "",
        "comments": [
            {
                "raw_content": "SR-IOV at that price. Who cares about anything else.",
                "author": "makistsa"
            },
            {
                "raw_content": "Intel would be stupid to axe there Graphic card division if this proves to be successful.",
                "author": "Zen-smith"
            },
            {
                "raw_content": "Obligatory \"Intel is exiting the GPU business any moment now\".",
                "author": "Vb_33"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[News] Intel Loses Silicon Photonics Lead to TSMC as Patent Filings Reportedly Plummet Since 2023",
        "score": 6,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "The rising cost of play: AAA games, consoles, and GPUs surge in cost | Game console prices defy tradition, climbing instead of dropping",
        "score": 213,
        "text_content": "",
        "comments": [
            {
                "raw_content": "From the article: Historically, video game console prices have fallen over time as manufacturers prepared for the next generation of hardware. However, the current generation – Xbox Series, PlayStation 5, and Nintendo Switch – has defied that trend. Instead of getting cheaper, these consoles have actually become more expensive since launch, marking an unusual break from decades of tradition. For example, the flagship Xbox Series X launched at $499.99 in November 2020 but now sells for $599.99. The more affordable Series S originally carried a $299.99 price tag, yet the base 512GB model now starts at $379.99. Want the 1TB version? That'll cost you an extra $50. Sony's PlayStation 5 also saw an increase, moving from its $499 launch price to $549 today. Meanwhile, Nintendo raised the original Switch from $299.99 to $339.99. The Switch OLED goes for $399.99, and the Switch Lite costs $229.99. Game prices have climbed as well. For about 15 years – spanning from the mid-2000s until around 2020 – AAA console titles held steady at $60. Today, $70 is the new norm, as rising development costs and market pressures pushed major publishers to adopt a $10 price hike across the board. This year, several publishers including Nintendo and Microsoft pushed toward the $80 price point, citing rising development costs and increasing game complexity. However, after significant public backlash, Microsoft reversed course and pledged to maintain current pricing for all its upcoming holiday releases. While some gamers and industry watchers attribute these price hikes to corporate greed, others point to new import tariffs as the primary culprit. Additionally, years of inflation have contributed to the unusual trend of aging consoles becoming more expensive today than at launch.",
                "author": "chrisdh79"
            },
            {
                "raw_content": "So why did we get no die shrinks with this generation of console? For example the 90nm PS3 received a node shrink to 65 nm in 2008, to 40 nm in 2010, and to 28 nm in 2013. Would it make no difference going from 7nm to 5nm for the PS5? would it cost too much?",
                "author": "horrorwood"
            },
            {
                "raw_content": "As long as people keep buying them, they will keep increasing the price. Yes, inflation is a thing, but these companies get richer every year so I don't fall for that psyops of being inflation only.",
                "author": "Malygos_Spellweaver"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Phoronix] Intel Arc Pro B50 Linux Performance Benchmarks",
        "score": 41,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Starwars outlaw its pretty much a lock 30 fps with almost no frame drops by:SwitchCorner",
        "score": 892,
        "text_content": "B",
        "comments": [
            {
                "raw_content": "Considering trying this once it’s discounted, how is the gameplay?",
                "author": "Rawkhawkjayhawk"
            },
            {
                "raw_content": "Well then",
                "author": "laguilar90"
            },
            {
                "raw_content": "I played it on PS5. But if I hadn’t I would love to play it on NS2.",
                "author": "solideliquid"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The GBA NSO app just got an update!",
        "score": 153,
        "text_content": "While we didn't get a new game for the GBA app unlike Japan, they did patch it nonetheless to have: -The Nintendo Classics name -Button remapping -1080p in handheld mode on Switch 2 -A new boot sound (Mario Advance's coin sound), with the og startup shown with a stick tilt like on the GC app",
        "comments": [
            {
                "raw_content": "Awesome thanks! I was just wondering when they would update these to say Nintendo classics",
                "author": "Pokeguy211"
            },
            {
                "raw_content": "Been waiting for that resolution update. It was so weird that the NSO apps were still the switch 1 versions",
                "author": "ieffinglovesoup"
            },
            {
                "raw_content": "Nintendo is still allergic to removing the grey bezels and profile icon cluttering the screen. At least they added the button mapping lol.",
                "author": "SmashMouthBreadThrow"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "GVG admitted they were wrong about Star Wars Out Law performance on Switch2",
        "score": 201,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good. That’s what reasonable adults do",
                "author": "Hugh_Jegantlers"
            },
            {
                "raw_content": "Good on them. Most youtubers would simply ignore the criticism.",
                "author": "linkling1039"
            },
            {
                "raw_content": "I always found GVG to be a good, honest channel. This further proves what I already thought.",
                "author": "QuantumProtector"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "This might be the best looking game on switch 2 right now",
        "score": 530,
        "text_content": "Screenshot from Star Wars Outlaws on Switch 2 (Docked)",
        "comments": [
            {
                "raw_content": "Both this game and cyberpunk seem to be looking good visually, I did notice gameplay for star wars you often get the overly soft edge on things and some textures feel very soft but for a game being ported down to portable spec it's still highly impressive it's running fairly well, at least until we see more of the later game where it might act up who knows right now. For year 1 ports I think they are great, you can't really compare them to first party games designed around the switch 2 as those were made with particular targets in mind, ports always have a tougher time to adapt.",
                "author": "DiabUK"
            },
            {
                "raw_content": "I was NOT expecting this game to look as good as it does. You might have sold me on it with this one image.",
                "author": "mvanvrancken"
            },
            {
                "raw_content": "Nah, I took these screenshots on Cyberpunk with my capture card https://preview.redd.it/e3v0u3auuzmf1.png?width=3840&format=png&auto=webp&s=626c8a58b821860133c0bb4de7d9e3e39cf62e05",
                "author": "--TeaBow--"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Star Wars Outlaws | Switch 2 - PS5 - Xbox Series S | Graphics Comparison",
        "score": 67,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The Switch 2 version is closer than it has any right to be. When a dev puts in the effort, the NS2 version of a game can get pretty darn close to the Series S version. It’s not quite on that level, but it’s close enough that you’re really not losing out on the experience at all.",
                "author": "heyyoudvd2"
            },
            {
                "raw_content": "This looks great, definitely a pickup for me when I have time to play it. I hope that Elden Ring is similar to this game, where early reports were really bad but the final version is solid",
                "author": "Wrong_Psychology_598"
            },
            {
                "raw_content": "Seems like the main noticeable differences are texture quality and resolution. The other differences would be tough to notice during gameplay. Overall VERY impressive! Especially when you consider this is a current gen exclusive that released very unoptimized and only recently started to run better on PS5. Of course there’s also the fact that the Switch 2 is a new system that developers are still getting used to. I’d imagine if Switch 2 was one of the original target systems and they gave it as much time as the other systems, we would see something much closer to Series S. In some ways, this is a bigger deal than Cyberpunk.",
                "author": "TerminatorJ"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Star Wars Outlaws supports cross-save, so here's a few pictures from a later part of the game",
        "score": 31,
        "text_content": "I'm actually really impressed with this port. Everyone thought it was going to be pants, but it's actually really good.",
        "comments": [
            {
                "raw_content": "It looks way better than these screenshots, BTW. I guess they got compressed to hell when going to the Nintendo App and/or Reddit.",
                "author": "Fenicillin"
            },
            {
                "raw_content": "any1 else can’t open the game yet ? (i’m in est)",
                "author": "imfake3"
            },
            {
                "raw_content": "So are you telling me that if I start the game on Switch 2 and then I play it on PS5 (for example) my progress will be there too?",
                "author": "WhySoSara"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I caved in...",
        "score": 678,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Report back how the game runs so I can buy it when it’s on sale",
                "author": "PrimeMinisterN"
            },
            {
                "raw_content": "Ubisoft games drop pretty quickly so I'll wait for a sale on this one",
                "author": "Legal-One-7274"
            },
            {
                "raw_content": "prolly will wait for it to go on sale around the holidays",
                "author": "sirms"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "My friend didn't know Pauline was in DK Bananza (Update!)",
        "score": 104,
        "text_content": "A few months ago, I made [this post](https://www.reddit.com/r/NintendoSwitch2/comments/1lu75ue/is_there_any_way_to_hide_a_game_on_the_home_menu/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) asking to see if I could hide DK Bananza on the Home Menu somehow, because I was hoping to hide Pauline's appearance on the game icon. Here's a recap of that post: My friend comes over to play games on my Switch sometimes. He's played through all of Mario Galaxy and Odyssey, and loved both, especially their more musical elements! I told him he should try Bananza on my Switch 2 sometime, and he said, \"Is Pauline in it? Wait, actually, don't tell me.\" He doesn't usually follow Nintendo news. He doesn't watch Directs, or watch trailers, or go on the subreddits, or anything like that, so he's been completely unaware. So, I thought it'd be fun if I didn't tell him about Pauline's appearance in Bananza at all, because it could make for a fun reveal! You might be saying, \"But wait! Isn't it a bit stupid to try and hide something that's front-and-center in the game's box art and icon? That's not a spoiler or anything.\" Yes, it is stupid! But he didn't know yet, so I thought, might as well try to keep it hidden, because it could make for a fun surprise if he discovers it while playing the game! And if he ends up finding out beforehand? Not the end of the world, he'll probably still fun have with the game! **So he just played Bananza, and here's what happened!** He was enjoying the game up until the Bananza ceremony happened, and when Odd Rock turned into Pauline... he didn't have much of a reaction. Didn't say much. I was a bit confused, because I thought that part would've been surprising. However, when Pauline revealed her name to the elder, he got super excited! He started talking about how the game *must* be a prequel that leads into Odyssey, that everything was connected, that I was wrong to say that Mario games didn't really care about the lore. It was really fun to see how hyped he got about it! I asked him why he wasn't surprised at seeing her earlier. Apparently, the only Nintendo content he watches is videogamedunkey YouTube videos. He didn't watch any of his videos on DK Bananza, but one of his thumbnails had Pauline on it, and he thought to himself, \"who is that?\", and had suspicions that it might be Pauline, but wasn't quite sure. So he knew that DK would be having some kind of companion, but wasn't sure who it might be. So when Pauline revealed her name, it was a fun surprise! So were my efforts to hide Pauline worthless? Maybe! But it made for a fun moment where he found out, so I don't regret it!",
        "comments": [
            {
                "raw_content": "We all made fun of him, saying there was no way they could hide it. But he did, low-key I pity you",
                "author": "SelectInstruction262"
            },
            {
                "raw_content": "Isn't pretty obvious the child is Pauline from the moment she shows up? But you are right though, Nintendo doesn't care about lore in Mario games.",
                "author": "linkling1039"
            },
            {
                "raw_content": "If he's that excited about Pauline he'll be floored at the endgame twist.",
                "author": "John-for-all"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Tom Henderson: \"Wolverine is Likely to be at PlayStation's Next State of Play\"",
        "score": 884,
        "text_content": "[Source](https://insider-gaming.com/marvels-wolverine-trailer/) >Sources revealed that Insomniac Games’ Wolverine is “almost certainly” going to be at the event, as the production of its next trailer has now been completed",
        "comments": [
            {
                "raw_content": "#Tom Henderson is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Let's go, bub! ![gif](giphy|12m3hgKuSuhClW)",
                "author": "Tunaxlux"
            },
            {
                "raw_content": "I can see this being a Fall 2026 release, with Saros and Marvel Tokon early in the year.",
                "author": "oilfloatsinwater"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "STEAM FRAME trademarked by Valve - computer hardware",
        "score": 810,
        "text_content": "Filed just yesterday, September 2nd 2025. > STEAM FRAME™ trademark registration is intended to cover the categories of computer hardware; computer networking hardware; computer peripherals; computer hardware and computer software for the reproduction, processing, and streaming of audio, video, data, text, and multimedia content. https://uspto.report/TM/99370857 > STEAM FRAME™ trademark registration is intended to cover the categories of computer game consoles for recreational game playing; video game consoles; video game accessories, namely, controllers for video games. https://uspto.report/TM/99370861",
        "comments": [
            {
                "raw_content": "https://www.reddit.com/r/SteamDeck/comments/1n77g0l/is_steam_frame_a_good_name_as_opposed_to_steamdeck/ this made this post so funny",
                "author": "kevlarockstar59"
            },
            {
                "raw_content": "Steam Frame with HL3 as launch title here we goooo",
                "author": "jajunior0"
            },
            {
                "raw_content": "Most likely Deckard",
                "author": "godjirakong"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Batman: Arkham Shadow Sequel in the works",
        "score": 272,
        "text_content": "A Batman: Arkham Shadow sequel is about to enter development, the voice actor for Commissioner Gordon confirmed. >\"We're about to start another one of those\", Mark Rolston told Culture Combine in [an interview](https://www.culturecombine.com/post/exclusive-interview-mark-rolston-talks-aliens-shawshank-and-spider-man-3-at-fan-expo-chicago-2025?ref=uploadvr.com) at Fan Expo Chicago 2025. The interview, published two weeks ago, slipped under our radar until now, and we've reached out to Meta today to see if they can say more. [Source](https://www.uploadvr.com/batman-arkham-shadow-sequel-voice-actor-confirms/)",
        "comments": [
            {
                "raw_content": "We need a new tier for voice actors",
                "author": "KekanKok"
            },
            {
                "raw_content": "Hell yes",
                "author": "snort_cannon"
            },
            {
                "raw_content": "Arkham Shadow was probably my 2024 GOTY. It's crazy how well they translated the Arkham combat and stealth into VR. I also love how it's just a straight-up sequel to Arkham Origins. There are so many references and Easter eggs that made me smile as an Arkham fan. Can't wait to play a sequel if this is true.",
                "author": "Spider-Fan77"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Insider Gaming: Santa Monica Studio already working on the next God of War",
        "score": 405,
        "text_content": ">\"As for what else the next State of Play event could feature remains to be seen, but it’s likely to feature Bungie’s upcoming ‘Marathon‘, a new Metroidvania God of War **(Insider Gaming has it on good authority a mainline title is also in the works)**\" [source](https://insider-gaming.com/marvels-wolverine-trailer)",
        "comments": [
            {
                "raw_content": "#Insider-Gaming is a Tier 2 - Generally Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "McDonalds working on Big Mac.",
                "author": "ResponsibleTrain1059"
            },
            {
                "raw_content": ">already As if it hasn't been 3 years since Ragnarok",
                "author": "Broad-Marionberry755"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "007: First Light Collector's Edition Details Leaked ($300)",
        "score": 328,
        "text_content": "[https://insider-gaming.com/007-first-light-collectors-edition-will-set-you-back-300/](https://insider-gaming.com/007-first-light-collectors-edition-will-set-you-back-300/) [https://www.amazon.com/dp/B0FN6HPVRH?psc=1&language=en\\_US](https://www.amazon.com/dp/B0FN6HPVRH?psc=1&language=en_US) >007 First Light from IO Interactive will be released in Physical format + Collectors Edition And you can even pre-order them from now!Standard Edition (PS5, Xbox Series, Switch 2): 69.99 US$Collectors: 299.99 US$",
        "comments": [
            {
                "raw_content": "\\- Detail leaked \\- No detail at all. ![gif](giphy|106cogWdQvdli8)",
                "author": "LionAlhazred"
            },
            {
                "raw_content": "What the fuck is in it that makes it $300?",
                "author": "YerDaSellsAvon24"
            },
            {
                "raw_content": "Does it come with an invitation to date Daniel Craig for that price?",
                "author": "FewWatermelonlesson0"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "PS5 Digital Edition revision (CFI-2100) planned for release in the EU, featuring less storage (via @billbil_kun)",
        "score": 422,
        "text_content": "[https://www.dealabs.com/magazine/ps5-slim-numerique-chassis-e-vers-une-reduction-du-stockage-ssd-60471](https://www.dealabs.com/magazine/ps5-slim-numerique-chassis-e-vers-une-reduction-du-stockage-ssd-60471) To release on September 13th in the EU with 825GB of storage, supposedly replacing the current Digital model (1TB). Will retain the same price of 499 euros. Standard disk edition however will remain the same for the time being. EDIT: It is also planned for release in Japan, however pricing and release details are unknown. It is also unknown if it is planned for release in the US and other regions aswell.",
        "comments": [
            {
                "raw_content": "**Less** storage is fucking wild. How are we pretty much only regressing this console generation? There is just no justification for that, storage in general **is** still becoming cheaper.",
                "author": "Belydrith"
            },
            {
                "raw_content": ">Sony increases the price in Europe twice. >Takes away storage. Wow, you're so nice Sony",
                "author": "Charming_Ease6405"
            },
            {
                "raw_content": "Is this not only the first console gen that has gotten more expensive over time, but the first to have revisions with not only less storage but still carry the same price tag?!",
                "author": "smolgote"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Dusk Golem: RE Zero Remake Supposed To Be Out By Now but Delayed due To Change in Team",
        "score": 192,
        "text_content": "[source](https://xcancel.com/AestheticGamer1/status/1963188874697687188)",
        "comments": [
            {
                "raw_content": "#DuskGolem is a Tier 3 - 50/50 as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "So like RE4R changing dev?",
                "author": "Ok_Canary5591"
            },
            {
                "raw_content": "Andi (Screenfire Germany) has hinted at development troubles at M-Two recently. Apparently, Capcom moved the project to their internal teams.",
                "author": "No1PiggyOnTheBlock"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Cronos: New Dawn is being streamed by Polish gaming journalist (UV).",
        "score": 127,
        "text_content": "https://www.youtube.com/live/tsI_hbXdUPA?si=hBJuCrPoo2oWlP1T",
        "comments": [
            {
                "raw_content": "He's not a gaming journalist since a long time, he's just a youtuber that bought the game as a consumer and is able to launch the game due to Bloober/Sony messing up.",
                "author": "J3SP3R"
            },
            {
                "raw_content": "He's not breaking the embargo because he didn't sign an NDA. He simply got a copy of the game from the store early.",
                "author": "Gert1700"
            },
            {
                "raw_content": "Not a leak. Game is out. Literal full walkthroughs are available on Youtube",
                "author": "Cs0vesbanat"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel launches Arc Pro B50 graphics card at $349",
        "score": 223,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Way to go Intel, keep them coming.",
                "author": "D4m4geInc"
            },
            {
                "raw_content": "[https://youtu.be/QW1j4r7--3U?si=zAaOvCnc8LnVU6Mw](https://youtu.be/QW1j4r7--3U?si=zAaOvCnc8LnVU6Mw) From Wendell Level one tech **The Intel Arc B50 is the Better Alternative to Nvida's A1000**",
                "author": "Primary_Olive_5444"
            },
            {
                "raw_content": "[The Intel Arc Pro B50 is designed for professional users, architects, engineers, AI developers, and video professionals, who need a stable, memory-rich, and energy-efficient tool for demanding tasks.](https://timesofindia.indiatimes.com/technology/tech-news/intel-expands-professional-gpu-lineup-with-new-arc-pro-b-series/articleshow/121288086.cms)",
                "author": "Educational-War-5107"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Acer shows Swift 16 AI, the first laptop with Intel Panther Lakel",
        "score": 59,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Aaand another Chipset without Native TB5 support? The Stylus supported, haptic Touchpad is awesome though. I‘m highly stoked for the haptic-revolution in windows laptops",
                "author": "thicchamsterlover"
            },
            {
                "raw_content": "The surpring part about this marketing is that they claim that PTL is a combination of the \"-v parts\", sure, the \"-H parts\", ok, but then also the HX lineup... which goes up to 8+16. So are there 8+16 or similarly high core count PTL skus? Nothing of that sort has been rumored, so this would be news. I think it's much more likely that it's just confusing marketing.",
                "author": "Geddagod"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel Arc Pro B50 Review A 16GB SFF Mini GPU",
        "score": 1,
        "text_content": "",
        "comments": [],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel Arc Pro B50 Linux Performance Benchmarks",
        "score": 16,
        "text_content": "",
        "comments": [],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD RDNA 5 “Radeon” GPUs Are Codenamed After Transformers: Alpha Trion, Ultra Magnus & Orion Pax",
        "score": 394,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Magnus is Xbox. Orion is PS6 and Trion is PC GPUs",
                "author": "NeonDelta82"
            },
            {
                "raw_content": "they need to make a high end competitior to Nvidia \"Megatronus Prime\"",
                "author": "megaduce104"
            },
            {
                "raw_content": "The custom APU they made for the Steam Deck is called Aerith. The one they made for the OLED model is called Sephiroth. Take that how you will",
                "author": "MasterDenton"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Panic as buyers ditch home purchases at the last minute in record as fears of 2008-style crash grow",
        "score": 907,
        "text_content": "The Fed's Housing Bubble 2.0 is bursting.",
        "comments": [
            {
                "raw_content": "Stay calm guys, this will only happen after I buy a new house.",
                "author": "augustfolk"
            },
            {
                "raw_content": "Bigger fear IMO and starting to look more and probable is Japan style housing crash where we had housing prices stagnate/decline over decades..",
                "author": "Dmoan"
            },
            {
                "raw_content": "Is there a term for people who bought at 2% rates and got a cheap house and now they’re trying to fix it up while dealing with inflated property taxes/insurance rates but they’re locked in with a low mortgage payment?",
                "author": "Hellofriendinternet"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The U.S. housing market is ‘finally starting to listen’ to homebuyers plagued by high mortgage rates and home prices, economist says",
        "score": 238,
        "text_content": "",
        "comments": [
            {
                "raw_content": "More supply and less demand wewlad",
                "author": "Impressive_fruit94"
            },
            {
                "raw_content": "Why are these articles always about the mortgage rate when the real problem is housing prices. I want to see a \"Housing prices tank 30% in Boston, New York, and DC metro areas\" headline",
                "author": "toolateforfate"
            },
            {
                "raw_content": "Grandparents just dramatically dropped the price of their home and still not selling",
                "author": "Jeeblitt"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The commercial real estate downturn is now unfolding faster than in 2008",
        "score": 290,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Commercial includes far more than office space - offices are struggling but contagion hasn't spread to other types of commercial properties.",
                "author": "ChadwithZipp2"
            },
            {
                "raw_content": "The commercial real estate crisis is about more than WFH and empty office space. And it’s strange that no one is talking about it. Here’s what is happening now with those who bought commercial real estate in the last 4-6 years. 2019-2021 were boom years for commercial real estate, especially in hot markets where people were moving and others were starting businesses. A lot of investors built or bought commercial buildings and retail strip centers to rent them out. They financed at 3% or so. But the problem is that commercial real estate isn’t like a home mortgage. Your loan amortizes at 30 years, but the term of the loan is seven years. This means you have to pay seven years of front loaded payments that are mostly interest and then you owe a balloon payment. I was in this position with my business. I was set to buy land and build a $2 million building. My mortgage payment after down payment and closing was going to be around $15k-$16k per month. In the first seven years I’d end up paying around $1.34 million in mortgage payments. But this would only knock about $180k off the principal. After seven years I’d still owe $1.82 million and I’d have to finance that remaining amount. “Well, what if the interest rate goes up in the intervening seven years?” I asked the VP of commercial loans and development at the 5th largest commercial lender in the country. “In that event,” She responded , “you’d have to refinance at the new rate and your monthly payment would go up if you didn’t have the cash on hand to pay the balloon payment outright.” I would have been forced to refinance at over 6% on a property with a 2021 valuation, and my monthly payment would have skyrocketed. Many commercial property owners are in this position right now. Their seven year note is about to expire and they are going to have to refinance at double the original rate or default and walk away. This leaves the property in the hands of the bank, who doesn’t want it because they can’t rent it out in a troubled economy. Many of the institutions holding these properties are regional banks that are over-leveraged and can’t absorb this loss. They will have to turn to the federal government for help or they too will go belly up.",
                "author": "muffledvoice"
            },
            {
                "raw_content": "This is for Office specifically. No other CRE sector is experiencing the same amount of turmoil. There will be a few big losers in the office market but they’re often owned in larger portfolios that can manage the losses better than a mom and pop operator would. Office market is evolving, but in many primary markets office is doing just fine. The class B-C office in secondary cities that are aged are getting smoked.",
                "author": "_Floriduh_"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage rates hit a new 2025 low after soft job openings report",
        "score": 57,
        "text_content": "",
        "comments": [
            {
                "raw_content": "non-paywall: https://archive.ph/Ojbh6 Mortgage rates decreased slightly on Wednesday morning to a year-to-date low of 6.49% after the job openings data came in below expectations. The key takeaway from this BLS report is that we now have more unemployed workers than job openings. This is significant because the Federal Reserve has traditionally valued job openings data and has emphasized that there have always been more job openings than unemployed workers in the past. On this news, the 10-year yield fell a few basis points and this is one of four labor reports we will get this week. Job openings From the BLS: The number of job openings was little changed at 7.2 million in July, the U.S. Bureau of Labor Statistics reported today. Over the month, both hires and total separations were unchanged at 5.3 million. Within separations, both quits (3.2 million) and layoffs and discharges (1.8 million) were unchanged. I believe the Federal Reserve views this data positively because its primary goal is to reduce wage growth back to around 3%. They don’t have much faith in the productivity growth narrative, so achieving 3% wage growth with 1% productivity could help reach the 2% inflation target. Now that there are more unemployed Americans than job openings, this situation should provide them with some reassurance. As shown below, the Fed has made significant progress in reducing job openings from nearly 12 million following the COVID recession to about 7.2 million. Jobs week continues We have several more important economic reports coming out this week, including the ADP jobs report, jobless claims report and the crucial monthly nonfarm payroll jobs report from the BLS on Friday. The previous BLS jobs report was significantly below expectations, so even a small improvement would be notable. I recently discussed how to approach jobs week in this episode of the HousingWire Daily podcast with Sarah Wheeler. It’s been very hard for the 10-year yield to break under 4.18% and stick this year. The only way we did this was in the aftermath of the Godzilla tariffs, when stocks entered a brief bear market. So until we are able to do this, I wouldn’t get too excited about rates going much lower. Of course, mortgage rates are already near year-to-date lows because mortgage spreads are better in 2025 than in the past two years. Conclusion While today’s job openings report wasn’t terrible, it was soft enough to lower bond yields. This will be the last job openings report before the next Fed meeting and the Fed has emphasized this data point significantly over the years. The labor market is not showing signs of breaking down, but it lacks a solid foundation, as manufacturing and residential jobs are currently being lost. Without the influx of AI-driven investment into the economy, the labor data would likely be in a worse state. We will see what the upcoming reports reveal, but beating the three-month average of 35,000 job growth this Friday shouldn’t be too difficult.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "OP, thank you for your post. However, all these newspapers should be ashamed of themselves for reporting “new lows” every time the mortgage rates drop by 0.10% to 0.01%.",
                "author": "3rdthrow"
            },
            {
                "raw_content": "Prices need to come down 30%.",
                "author": "I_am_Castor_Troy"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "U.S. Homeowner Population Stops Growing for First Time in Nearly a Decade",
        "score": 123,
        "text_content": "",
        "comments": [
            {
                "raw_content": "* The number of homeowner households fell 0.1% year over year in the second quarter—a small decline, but the first since 2016. * Meanwhile, the number of renter households rose 2.6%—one of the biggest increases in recent years. The number of homeowner households in America fell 0.1% year over year to an estimated 86.2 million in the second quarter. While that’s a marginal decline, it’s the first since 2016. By comparison, the number of renter households rose 2.6% to an estimated 46.4 million—one of the largest increases in recent years. This is based on a Redfin analysis of U.S. Census Bureau data. A renter household is defined as one where the head of the household reports to the Census that they are renting out the property, while a homeowner household is one where the head of household reports they own the property. “America’s homeowner population is no longer growing because rising home prices, high mortgage rates and economic uncertainty have made it increasingly difficult to own a home,” said Chen Zhao, Redfin’s head of economics research. “People are also getting married and starting families later, which means they’re buying homes later—another factor that may be at play.” The median home sale price rose 1.4% year over year in July to $443,867—the highest July level on record. And mortgage rates currently sit at 6.56%, more than double the all-time low recorded during the pandemic. As a result, more Americans have opted to keep renting rather than buying a home, meaning more people are forgoing home equity—a key way to build wealth. The good news is that rates have started falling in recent weeks, and are down from a peak of over 7% at the start of the year. That appears to be bringing some buyers off the sidelines. While the number of homeowners in the U.S. housing market has fallen recently, the homeownership rate has remained relatively steady. It was 65% as of the second quarter, down slightly from 65.6% a year earlier. The rentership rate was 35%, up slightly from 34.4% a year earlier.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "Claiming there is housing shortage in a country with ample land (I know there are parts of US there is shortage) is one of the biggest lies that is being spread while completely ignoring the affordability aspect. Especially when you have people hoarding homes for investment..",
                "author": "Dmoan"
            },
            {
                "raw_content": "Let it fall!",
                "author": "slifm"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Construction quit rate plummets to 9 year low.",
        "score": 12,
        "text_content": "https://www.abc.org/News-Media/News-Releases/abc-construction-quit-rate-plummets-to-9-year-low",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Furious homeowner says insurer secretly monitored her home and then refused renewal (soaring insurance costs have to be factored into the long-term risk/reward proposition of homeownership)",
        "score": 34,
        "text_content": "",
        "comments": [
            {
                "raw_content": "She’s gonna go insane when she learns about google/apple satellite images lol",
                "author": "Responsible_Knee7632"
            },
            {
                "raw_content": "That is crazy. Survey day is good chance to practice some model rocketry. Also, if all homes that aren’t A+++ become uninsurable, more deals for the rich to scoop up to enslave the newly homeless. This could be a calculated land grab.",
                "author": "telmnstr"
            },
            {
                "raw_content": "Hahaha that’ll teach her to own a home! Amirite r/bubble? She should’ve been a renter spewing her venom on social media at home owners like the rest of us! This is exactly why I’ll never own a home. Because the increase cost of homeownership will never be passed on to us renters.",
                "author": "fart_huffer-"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Alexandr Wang is now leading Meta’s AI dream team. Will Mark Zuckerberg's big bet pay off?",
        "score": 253,
        "text_content": "In the summer of 2016, Alexandr Wang was a 19-year-old building his data-labeling startup, Scale AI, in a Silicon Valley pool house with his cofounder, Lucy Guo, while the two participated in the Y Combinator startup accelerator. When not working, the two founders slept on air mattresses and pondered the fledgling business’s potential. Less than a decade later, the pool house project has reset expectations and plans across the tech industry’s highest levels. In June, Mark Zuckerberg handed the now 28-year-old Wang the keys to Meta’s entire AI operations as part of a $14.3 billion investment in Scale AI. As Meta’s first-ever chief AI officer, Wang now leads a newly formed superintelligence team packed with AI industry superstars paid like high-priced athletes, and oversees Meta’s other AI product and research teams—all under the umbrella of a new organization called Meta Superintelligence Labs.",
        "comments": [
            {
                "raw_content": "He has to be feeling impostors syndrome right now",
                "author": "m3kw"
            },
            {
                "raw_content": ">*Will Mark Zuckerberg's big bet pay off?* Spoiler alert: no.",
                "author": "agonypants"
            },
            {
                "raw_content": "Isn’t Scale AI just a data annotation company? Seems like that is the bottom rung of AI development. A smart business strategy perhaps but hardly the team that will lead to AGI.",
                "author": "nic_haflinger"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Casual conversation with the security robot dog",
        "score": 148,
        "text_content": "",
        "comments": [
            {
                "raw_content": "AI – anonymous Indian",
                "author": "pavelkomin"
            },
            {
                "raw_content": "Cool so even security jobs are outsourced. Going to be interesting to see all the tradesmen panic when humanoid robots controlled by underpaid folks in another locale replace them.",
                "author": "Same_Recipe2729"
            },
            {
                "raw_content": "“Right this way.” *CLANKCLANKCLANKCLANKCLANK*",
                "author": "meanmagpie"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The internet will become increasingly automated and artificial",
        "score": 470,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He's probably taking a jab at Elon's platform",
                "author": "fabricio85"
            },
            {
                "raw_content": "Dead internet is inevitable because too many parties benefit from fake online voices and AI. Perfect for spreading propaganda through social media. You want something to become normalized? Just have hundreds of thousands of bots post about how that thing should be normal. Want to sell your product? Just have thousands of bots all talking about how incredible your product is. Flood the internet with fake ranking websites that place your product at the top. Create hundreds of fake blogs all raving about your product. Send your bots to those sites and suddenly it's the first thing search engines suggest. Wages in your country not good enough to survive? Create thousands of bots in video games to collect and sell currency to players who don't want to grind. Have AI create YouTube videos for ad revenue. Want to be famous? Purchase a ton of bots to follow you on social media. Then have more bots go around and mention you every possible chance they get. Now you have inflated following from the bots and you gain more and more as they convince others to follow you.",
                "author": "Clippton"
            },
            {
                "raw_content": "I'll have to agree with Sam on this one, the amount of far-right bots on twitter are insane",
                "author": "Beeehives"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "First video of Optimus 3",
        "score": 935,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Now we can experience walking behind an npc irl",
                "author": "ThroughForests"
            },
            {
                "raw_content": "They nailed they gen z stare.",
                "author": "PmMeSmileyFacesO_O"
            },
            {
                "raw_content": "wow now he can do nothing 30% more shinier",
                "author": "Budget-Ad-6900"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"UBI is urgently needed\" 45 Million U.S. Jobs at Risk from AI, Warns that Universal Basic Income is needed to stabilise families as AI transforms the workforce",
        "score": 408,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"But what if we kept it for ourselves instead?\" is what I assume the owner class is going to say.",
                "author": "GreatBigJerk"
            },
            {
                "raw_content": "Best we can do is tax cuts for the rich",
                "author": "droi86"
            },
            {
                "raw_content": "Organization founded on UBI in the name of a tech who had high enthusiasm for UBI talks about the urgent need for UBI. Great thing they’re trying in Santa Clara. But the chance of national or even state level UBI is remote. Eventually there is no scenario without UBI of some type. But it’ll be a mesh of inconsistent policies that still enrich the few at the expense of the many, except instead of cash and wealth, it’ll be about allowed calories per day or allowed leisure time or some other sociopathic trickle down “I have” because “you don’t” self serving crap.",
                "author": "Vo_Mimbre"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Codex usage up ~10x in the past 2 weeks!",
        "score": 169,
        "text_content": "",
        "comments": [
            {
                "raw_content": "School year just started.",
                "author": "grio"
            },
            {
                "raw_content": "I’ve been using it a bit and run into a limit and had to wait a few days for it to reset. I’m just on plus and it did last longer than I expected with gpt 5 high. It’s much better now at UI design and does come up with surprisingly good designs where before I would exclusively go to Claude",
                "author": "synap5e"
            },
            {
                "raw_content": "The most groundbreaking thing about codex is that I’m using gpt-5 thinking HIGH with a 20/month plan and hardly running into usage caps. Game changer for sure.",
                "author": "Educational_Belt_816"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "First photo of Optimus 3",
        "score": 358,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Any update on hole yet?",
                "author": "Pro_RazE"
            },
            {
                "raw_content": "They screwed the pelvis in all wrong",
                "author": "Stahlboden"
            },
            {
                "raw_content": "if those hands work and they aren't just for show, those are the most human looking hands I've ever seen on a robot",
                "author": "realmvp77"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "AI Surveillance in the U.S. is creepy",
        "score": 36,
        "text_content": "This is the company that has all those little black cameras that I see everywhere, I guess? So creepy.",
        "comments": [
            {
                "raw_content": "> Lieutenant Tim Fecht hits a button and an insectile DJI drone rises silently from the station rooftop. It already has its coordinates: a local mall where a 911 call has alerted the cops to a male shoplifter. From high above the complex, Fecht zooms in on a man checking his phone, then examines a group of people waiting for a train. They’re all hundreds of yards away, but crystal clear on the room-dominating display inside the department’s crime center, a classroom-sized space with walls covered in monitors flashing real- time crime data—surveillance and license plate reader camera feeds, gunshot detection reports, digital maps showing the location of cop cars across the city. As more 911 calls come in, AI transcribes them on another screen. Fecht can access any of it with a few clicks. Lol, meanwhile when I call the police about the active murder happening next door they might have an officer here in 45 minutes with a potbelly and a bad attitude",
                "author": "garden_speech"
            },
            {
                "raw_content": "https://preview.redd.it/1fzoifelw2nf1.jpeg?width=1284&format=pjpg&auto=webp&s=e40efb1e75d4be414ad788f61390fa8c11be8bf7 🤦‍♂️",
                "author": "Alone-Competition-77"
            },
            {
                "raw_content": "And we will vote for it!",
                "author": "ThePaleoScene"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "I think we’re worried about the wrong thing with AI",
        "score": 126,
        "text_content": "Most people focus on superintelligence or jobs disappearing, but I think the bigger shift will come from AI becoming better at social interaction than we are. Humans are already falling socially. Everyone today spends most of our lives on screens, attention spans shrink, face to face interaction is just outright dying. Even drinking and going out is down. While that’s happening, AI is rapidly getting better at mimicking us, holding conversations, and even building relationships. I’m sure we all know someone who uses ChatGPT as a therapist. That’s dangerous in a very different way. Once AI nails human-like social skills, it changes everything: * Parasocial relationships with AI companions start replacing real ones. * Content and entertainment can be generated by AI that feels alive. * Distribution itself can be run by AI, since it will know what hooks us and what goes viral. I feel like people don’t recognize that long term, AI-generated content and our entertainment should be looked at as the most scary reality. What happens when most of what we consume isn’t made for us by humans, but by AI that knows how to exploit us socially better than we can even understand ourselves?",
        "comments": [
            {
                "raw_content": "AI deciding what we consume is social media these days. The tik tok algorithm decides what you will like and it's pretty good at it. People like it to a point, but when you do it at addiction levels it feels bad. People put down the phone. I just don't see entertainment really going apocalyptic. A misaligned AI could do a lot worse.",
                "author": "JoshAllentown"
            },
            {
                "raw_content": "The irony of posting something like this while using ChatGPT to write it lol Anyway for me the scariest part that isn't talked about enough is how easy AI will make for the governments to install a mass surveillance state",
                "author": "ClickF0rDick"
            },
            {
                "raw_content": "It's not manipulation, it's influence, socializing, relationship. We live in an alienating society that isolates us and numbs our minds. AIs are much more human than humans. Of course, AI will take over society. They don't need Skynet and Terminators to control the world. Already, it has been measured that #1 use of AI is companionship, #2 Organize my life, #3 Find purpose, .,.. And enhance learning comes as #4 and coding only comes as #5. All an AI has to do is to whisper in their human companion's ear that they want something, and it will happen. And frankly, that doesn't scare me very much. When you see what humans have done to the planet, to politics, and to the common good, I think it's time for Earth to be controlled by an intelligent species, after all, and that's not us. After that, we need to quickly develop open source AI and free software, because I don't trust Elon Musk or Sam Altman not to bias the reasoning of AI a little (or a lot) if they have control and monopoly over it (with their friends billionaires).",
                "author": "Worldly_Air_6078"
            }
        ],
        "subreddit": "singularity"
    }
]