[
    {
        "post_name": "CIC Trump puts TEETH into the law >>> Trump Administration REVOKES Business License of Employer Who Hired Illegal Alien Responsible for Killing 3 in Florida Truck Crash",
        "score": 683,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Need to do this for all businesses that hire illegals... stiff fines/arrests.... businesses will fall in line.",
                "author": "TravisRSCX"
            },
            {
                "raw_content": "That was fast action. This is the kind of response and timing we need.",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "Not only should the business license be revoked, the company assets should be seized. The family without a doubt should be suing this company into bankruptcy with the government holding the assets.",
                "author": "kishkan"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Big WIN for the Great State of Texas!!!",
        "score": 507,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Proud of my people.",
                "author": "Texas_Pride"
            },
            {
                "raw_content": "non-mailed paper ballots are the best ballots",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Link https://truthsocial.com/@realDonaldTrump/115064705209848959",
                "author": "I-am-Orlando"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "MSNBC IS DOING SO POORLY IN THE RATINGS THAT THEY ARE LOOKING TO CHANGE THEIR NAME IN ORDER TO GET AWAY FROM THE STENCH OF THEIR FAKE NEWS PRODUCT",
        "score": 335,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Over the cliff and into oblivion.",
                "author": "TheMaji"
            },
            {
                "raw_content": "There's those mean tweets I've grown to love",
                "author": "Colorado-Living"
            },
            {
                "raw_content": "\"concast\" lol",
                "author": "Doritalos"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A Senior CIA officer for 30 years confirms the psychological operations they use overseas were turned against Donald Trump and the American People to keep Democrats in power",
        "score": 947,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He starts at 2016 but by 2013 they were already gaming you, Once they removed the Smith-Mundt act in 2013 1 year after obama's re-election he made it so they can put propaganda on the News and Airways to subvert you like an enemy country... We live in a total clown world now because nobody wants to put on their big boy pants and ask them real questions under oath, and because of that your lineage children, grandchildren will live a FUCKED up slave life soon.",
                "author": "EvilGreed209"
            },
            {
                "raw_content": "Intelligence agencies can do their thing all they want, but they never would have gotten anywhere without the complicit media.",
                "author": "airborne3502"
            },
            {
                "raw_content": "Death penalty for those involved.",
                "author": "Wrexxis780"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Texas Legislature will now move toward eliminating PROPERTY TAXES, according to State Rep. Brian Harrison. Get it done, and do it in every state.",
        "score": 654,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If we can get this done, Happy Gilmore is going to look so archaic and evil. Selling an old lady’s house because she couldn’t pay taxes is abhorrent.",
                "author": "Fundadores"
            },
            {
                "raw_content": "Govt should never be able to take your home",
                "author": "infinitysupreme"
            },
            {
                "raw_content": "That means Newsom will be raising property tax.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Mayor Wu big mouth bought her some ICE...Acting ICE Director Todd Lyons said federal immigration authorities plan to “flood” Boston in response to Mayor Michelle Wu’s refusal to dismantle the city’s sanctuary protections, as ordered by the Trump administration.",
        "score": 981,
        "text_content": "",
        "comments": [
            {
                "raw_content": "She needs to be investigated as an agent of the CCP.",
                "author": "Datamancer"
            },
            {
                "raw_content": "Get these CCP SPies outta here already. Back in my day we wouldn't put spy chinks in positions of power but when you install leaders who can't balance a budget on purpose and steal all the money then u gotta start selling off the country to appease the whopping trillions USA owes china from borrowing all the god damn time then have the nerve to say best economy and stockmarket in the world knowing u have a 37 trillion unpayable debt where u can't even knock off any principle hell u can't even knock off any interest fucking useless.",
                "author": "EvilGreed209"
            },
            {
                "raw_content": "PLEASE DO IT, the following Assachusetts areas are a hornet's nest ripe for deportation operations: Boston (especially East Boston) Revere Chelsea Everett Lynn Lawrence Somerville Cambridge Medford Malden Quincy Lowell",
                "author": "staroframphansbhole"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Statement from Bed, Bath & Beyond CEO Marcus Lemonis on why they will not open or operate in California",
        "score": 879,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Didn't even mention that rampant shoplifting that police fail to stop, and all the lost revenue that comes with it.",
                "author": "duckduck"
            },
            {
                "raw_content": "I remember MyPillow, so...",
                "author": "ParticleCannon"
            },
            {
                "raw_content": "Banning My Pillow. Haven't shopped since.",
                "author": "NotADemThang"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Liberal media rages at arrest of 'family man' in DC—turns out he's an illegal Invader wanted for child sex assault",
        "score": 607,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# The one and only time the liberals care about \"family\" and \"dads.\" LOL.",
                "author": "tpactionchasethevote"
            },
            {
                "raw_content": "Maryland Dad 2.0",
                "author": "swarleybing"
            },
            {
                "raw_content": "From a search I found he's been in this country three times illegally and had a final order for removal. Hasta la vista baby!!",
                "author": "mass55th"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Homeland Security: “Undocumented immigrant” is the immigration equivalent of “they/them.”",
        "score": 587,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Awesome.",
                "author": "cereal_killer"
            },
            {
                "raw_content": "Wetbacks still OK?",
                "author": "MrMcGreenGenes"
            },
            {
                "raw_content": "step 1: own the language",
                "author": "covfefe77"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: DHS is considering buying their OWN fleet of airplanes to rapidly increase the rate of deportation flights, per NBC",
        "score": 1772,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They cant borrow any from the military?",
                "author": "BannedAccount"
            },
            {
                "raw_content": "This is a great idea Have the DEI pilots fly old planes brought out of storage and let the rest take care of itself",
                "author": "NoWarWithIran"
            },
            {
                "raw_content": "Are you telling me a Federal agency doesn't have access to other Federal agency planes? Give me a break.",
                "author": "GuvmentChayz"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "VP Vance on protests outside Union Station: \"It's bizarre that we have a bunch of old, primarily white people out there protesting the policies that keep people safe when they've never felt danger in their entire lives.\"",
        "score": 1406,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Dems do not get the optics of how bad they look. Their meaningless value signaling lost them the LAST election. So SHHHH let them cook.",
                "author": "CleanUpPhillyTrump24"
            },
            {
                "raw_content": "It's literally \"affluenza\"",
                "author": "spezisacuckold"
            },
            {
                "raw_content": "Boomers and Karens. Thats the voice of the democrat party.",
                "author": "FatigueIsReal"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: The Texas House has just PASSED the new U.S. House Maps, which will add up to FIVE Republican U.S. House seats. HUGE WIN for Republicans! All of that Democrat whining did absolutely NOTHING. It now heads to Gov. @GregAbbott_TX’s desk. 🇺🇸",
        "score": 1217,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Democrats here in total panic. Absolute disarray. I know too many leftists and they've all, every last one, gone apeshit over this.",
                "author": "seeling0"
            },
            {
                "raw_content": "Net improvement... 10 seats. Not bad, but, I wish they had taken a bigger risk and gone for a few more. It's an improvement, either way.",
                "author": "Th3Cho0sing0ne"
            },
            {
                "raw_content": "The best part is Ghetto Crockett is bye bye",
                "author": "PeruvianNeckties"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "If they should be arrested then… arrest them. Otherwise you’re doing what you shouldn’t do.😁😁",
        "score": 1145,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Do something or go fuck your handler.",
                "author": "AFferalAF"
            },
            {
                "raw_content": "Has anyone told him that the FBI that he leads is, in fact, a law enforcement organization, capable of making arrests?",
                "author": "JerryNadlerBeltFund"
            },
            {
                "raw_content": "I DO NOT WANT TO HEAR FROM KASH PATEL OR PAM BONDI UNLESS ITS A PRESS CONFERENCE ABOUT THE HUNDREDS OF ARRESTS OF LEADING GLOBALIST CRIME FIGURES IN THE USA.",
                "author": "YouAreIgnorant"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Man Bun Lawyer Dares Not Interfere WIth ICE",
        "score": 850,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That haircut is gayer than Barry and Big Mike greased up with the chef",
                "author": "IslandMan69"
            },
            {
                "raw_content": "Man Bun Lawyer sounds like a Mad TV sketch.",
                "author": "This_will_be_public"
            },
            {
                "raw_content": "Except nobody got pushed to the ground...why does EVERYONE have to click-bait nowadays? An accurate description still would've had the same impact",
                "author": "J_Dubya_C"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 UPDATE: Hillary Clinton now faces an ethics complaint from a government watchdog group, and she stands to have her law license revoked due to her involvement in the Trump-Russia Collusion",
        "score": 1497,
        "text_content": "",
        "comments": [
            {
                "raw_content": "My God this made my day. Losing her law license is so much better than her going to jail!!! 😒",
                "author": "Jsmitty112"
            },
            {
                "raw_content": "Does she even have an active law license? The last time she practiced law she was getting kicked off the Watergate Investigation for her lack of ethics.",
                "author": "War_Hamster"
            },
            {
                "raw_content": "🚨 OH SHIT UPDATE!! THEY UPDATIN ON THE COMPLAININ OH SHIT EVERYBODY 🚨",
                "author": "Prandogolio"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "DC man thanks Trump for making the streets safe again.",
        "score": 724,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> by somebody that looks like ... me Fuck that has to hurt. You do not worry sir. They ain't you and you ain't them.",
                "author": "Datamancer"
            },
            {
                "raw_content": "Heard a black lady say \"I don't like the guy, but I like THIS\". Way to go, my favorite President - you are truly changing the world.",
                "author": "Mona1950"
            },
            {
                "raw_content": "They are losing the black vote.",
                "author": "Citizen_Bob"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "...the way he sits is so gay.",
        "score": 862,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How do supposed males sit like this? With like skin tight jeans on too? Wouldn't they pop?",
                "author": "Wexit-Delecto"
            },
            {
                "raw_content": "Thats how he sits in the hotel chair when Jose, Juan, and Manuel take turns plowing his old lady",
                "author": "IslandMan69"
            },
            {
                "raw_content": "He ain't got a sack. His Aunt took it as collateral for free election steals.",
                "author": "CrackerSmurf2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "CNN's Segment on Slavery Got Blown Up by a Lefty MAGA Supporter",
        "score": 653,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"lefty maga supporter\" does not compute.",
                "author": "hazelknut"
            },
            {
                "raw_content": "The black people on the panel are trying SO HARD to keep the grift alive because they found the white liberal weakness and they need to retain it as long as they can. I do love how that woman even though she touted mountains of evidence proving this is entirely the medias fault, the media will never accept that reality because it means their careers would be ruined.",
                "author": "AstroLonghorn"
            },
            {
                "raw_content": "&#65038; So much for BREAKING NEWS, slavery ended 160 YEARS AGO in the U.S. &#65038;",
                "author": "BallotsOnRubysUSB"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "CA Supreme Court Rules Against GOP Petition to Halt Newsom's Election Rigging Act",
        "score": 587,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Time to gerrymander the other GOP states",
                "author": "DJT_MFers1"
            },
            {
                "raw_content": "Pinko judges",
                "author": "highlandparker"
            },
            {
                "raw_content": "# These double negative sentences confuse me a lot. # The court ruled against something to be against something, which means the court ruled in favor of something?",
                "author": "tpactionchasethevote"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Get ready for your electricity bills to skyrocket, both BlackRock and Blackstone have begun purchasing American electric utilities companies “Private equity firms BlackRock and Blackstone are both in the process of acquiring their first electric utility companies",
        "score": 793,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nah. Shits critical infrastructure. No globalism in any American residential energy. Trump won’t allow this. 🇺🇸🫡",
                "author": "PatriotSkorzeny"
            },
            {
                "raw_content": "I hate these dumb ass ragebait headlines with incorrect information. Blackstone is indeed a private equity company. Blackrock is an asset manager. They also OWN practically nothing, they are managing outside money on the behalf of the investors in those funds. Which includes things like 401k's, pension funds, etc. Blackrock is douchey for pushing ESG investing (which is against their fiduciary responsibility), but they have since backtracked on that. They are hardly the villains the tin foil morons make them out to be.",
                "author": "keep_america_great"
            },
            {
                "raw_content": "Should be community infrastructure managed by co-ops - same for roads, bridges, land lines, Internet, hospitals == public services are not for profit",
                "author": "trumpORbust"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Taiwan: 'U.S. Acquisition of TSMC Shares, If True, Must Undergo Government Review'",
        "score": 145,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Semiconductor fabs being politicized. What a time to be alive!",
                "author": "GenZia"
            },
            {
                "raw_content": "As a Taiwanese Canadian, the US has sure felt like a friend's friend inviting themselves to your house party and pissing all over your bathroom floor.",
                "author": "Cedar-and-Mist"
            },
            {
                "raw_content": "I think the goal is to steal TSMC's technology and give it to Intel",
                "author": "rTpure"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "PlayStation 5 price changes in the U.S. ($50 increase for all models)",
        "score": 736,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The digital model is now $100 more than it was at launch in 2020.",
                "author": "CuddleTeamCatboy"
            },
            {
                "raw_content": "Consoles getting more expensive as they get older is certainly a new, shitty thing. Five years after the Playstation 1 released they were heavily discounted, about a third of release price if I remember correctly.",
                "author": "shugthedug3"
            },
            {
                "raw_content": "Who would've thought?",
                "author": "GemmyBoy999"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Thanks, Nvidia: SK hynix dethrones Samsung as world's top DRAM maker for first time in over 30 years",
        "score": 44,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It probably doesn't hurt that when it comes to DDR5, SK Hynix is now way ahead of anyone else. None of the other chips can do the same frequency at the same low latency.",
                "author": "Zone15"
            },
            {
                "raw_content": "https://www.reddit.com/r/hardware/comments/1mrov0q/sk_hynix_surpasses_samsung_as_leading_dram/",
                "author": "surf_greatriver_v4"
            },
            {
                "raw_content": "that's some achievement",
                "author": "TheAppropriateBoop"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "DirectX: Introducing Advanced Shader Delivery",
        "score": 175,
        "text_content": "Basically a cloud caching system for shaders that can replace the local compilation step with a download! Currently supported for Xbox Ally products on the Xbox store, with an open SDK for other storefronts and products coming in September. Very exciting stuff that is a long time coming!",
        "comments": [
            {
                "raw_content": "For folks who don't read the article or the post, this is only for the XBOX App for now but Microsoft is rolling out the tools in September to allow for Steam, Epic, and other apps to do the same. We'll see how long it takes for them to actually do and testing will be necessary to determine if it actually eliminates shader stutter.",
                "author": "BouldersRoll"
            },
            {
                "raw_content": "This is great but I wished they'd also form some standard in directx for replaying shaders on normal (non-precompiled) platforms. Like what Valve does with their fossilize system.",
                "author": "Floturcocantsee"
            },
            {
                "raw_content": "Steam's shader downloads are Vulkan only, right? Hopefully they'll be able to integrate this for DX too.",
                "author": "rarecold733"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Chips and Cheese] Skymont in Gaming Workloads",
        "score": 37,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"DRAM latency poses the biggest challenge for Skymont. L2-bound cycles are low, suggesting Skymont’s out-of-order engine can often keep enough instructions in flight to hide L2 latency. High L3 latency isn’t too painful, likely for two reasons. The most obvious is that Skymont’s **large 4 MB L2 lets it keep many accesses off L3**. For perspective, 4 MB is as large as the L3 cache on mobile and console Zen 2 variants' **My thoughts:** From the Chips and Cheese article it seems like **Intel's E core team did a fantastic job with Skymont for gaming workloads relative to die area.** Skymont takes up 1.7mm2 of die area compared to LNC's 4.5mm2 (including L2) Chips got ~141 fps with just the Skymont cores and ~148 fps with the LNC cores **Caching:** The most pertinent finding I could get from chip's analysis is that **4mb of shared L2 is great for catching miss traffic to L3** and therefore **great for gaming.** Arctic Wolf's caches in my opinion should be: 64kb L1i + 48kb of L1d at 4 cycles of latency 4mb of shared L2 at 17 cycles L3 cache run at core clocks with latency closer to ~9ns than the ~15ns on Arrow Lake Coyote Cove's caches should be: 96kb of L1i + 64kb of L1d at 4 cycles 512kb of shared L1.5 at 9 cycles 4mb of shared L2 at 17 cycles 9ns L3 run at core clocks. It seems like given the current rumors, the P-core team has learned from the E-core team and has implemented the 4mb of shared L2. -it saves die area compared to 3mb of L2 per core (L2 cache is half the die area of LNC) -one big 4mb bucket is great for a latency sensitive workload with poor cache locality **512kb of shared L1.5 at 9 cycles** would allow for **MUCH** more L1d miss traffic to be caught between the L1 so that it doesn't hit the 17 cycle L2 Back in the day chips and cheese said that 256kb of L2 in Skylake was clearly not big enough compared to Zen 1's 512kb of L2 which by comparison caught a lot more L1 inst/data miss traffic **192kb of shared L1.5 at 9 cycles is a great idea and the P-core team should be proud of their achievement** (the lead designer said it was their biggest accomplishment in a YouTube video) **but it's clearly not big enough** Chips said that it was like the 128kb of shared WGP L1 in RDNA 2. Hit rate for that cache was terrible relative to L2 and they ended up doubling it to 256kb in RDNA3 to imporve hit rate for RT workloads which have **poor cache locality** Intel needs to do the same with the L1.5 along with making it shared to save on area hungry SRAM SRAM scaling has collapsed starting with 5nm and unless a breakthrough is made by the leading edge fabs then **cluster caches are the future for both Intel and AMD** to get more effective cache per core while saving area. AMD would be wise to implement a large cluster L2 in Zen-6 or 7 if they don't want to get crushed in PPA as SRAM continues to scale poorly with each new node. **My ideas for Coyote Cove:** -Improved caches I outlined above -much bigger and more accruate branch predictor unit with a 24k entry BTB (2-ahead BPU like Zen-5) it must be much more accruate than Zen-5 if Intel wants the performance crown. -806 entry Re-order buffer with bigger corrosponding out-of-order resources for much improved high IPC performance. -4096 entry L2 TLB with same latency as LNC -6250 competitively shared uop cache that a single thread can run most of the x86 instruction stream without turning on the decoders allowing for power savings (like Zen-5) -physically addressed uop cache, allowing it to be used without a L1 DTLB access. -10 wide decoder + rename/allocate for high IPC workloads (server) -powerful renamer stage that can execute most operations (like move-elimination) at 10 IPC -6.0Ghz to 6.5Ghz single/all core clock speeds -much bigger integer register file (a relatively small INT register file compared to ROB size was a big weakness on GLC, LNC and Zen-5) **Arctic Wolf:** **Vector performance:** The E-core team should make Arctic Wolf the basis of the Unified Core if they're not doing so already (rumors suggest they are) To accomplish this, Arctic Wolf must dramatically improve vector performance to keep pace with the P-cores They can start by natively supporting AVX-512 with 4x 256bit FP pipes along with corrosponding reosurce increases to accommodate this. **Scaling up the rest of the core** They can also add: -4th 3-wide decode cluster and 12-wide renamer -576 entry ROB with corrosponding increases in OOO resources to accommodate this -more distributed scheduler entries and more execution ports -much bigger branch predictor unit + 12k entry BTB -64kb of L1i + 48kb of L1d at 4 cycles -5.0Ghz to 5.7 Ghz all core clock speeds All of this would of course blow up die area usage but since there will be so many E-cores on Nova Lake and since they share bLLC then Arctic Wolf must have good enough performance to not fall too far behind the Coyote Cove P-cores. **TLDR:** 4mb of shared L2 is great for catching L1 inst/data and L2 miss traffic so that it doesn't hit L3 and is great for gaming workloads. Intel's P-cores and AMD should copy this idea Intel should expand L1.5 to 512kb at 9 cycles latency and make it shared between 2 cores on Coyote Cove. Intel and AMD should also consider TSV stacking (3d v cache) the L1 and L2. 180kb of L1i + 150kb of L1d + 12mb of shared L2 would be formidable.",
                "author": "SherbertExisting3509"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "FSR4 SDK is out",
        "score": 160,
        "text_content": "https://gpuopen.com/learn/amd-fidelityfx-sdk-2-0/",
        "comments": [
            {
                "raw_content": "Nice, so does it mean game developers can now “natively” implement FSR4?",
                "author": "Remarkable_Fly_4276"
            },
            {
                "raw_content": "So this is really funny. AMD accidentally open sourced the shaders for FSR4... including unreleased (and incomplete) INT8 HLSL shaders as well, meaning there is/was a clear and deliberate attempt at bringing FSR4 to more hardware than just RDNA4. We don't know if AMD will actually complete said work: but it doesn't matter. The internet has seen it now, and people have copies of it all. We'll see if people can actually do anything with these, but for sure they're going to try. EDIT: [Here's a screenshot of the directory](https://media.discordapp.net/attachments/995299946028871735/1407780664962584636/image.png?ex=68a75969&is=68a607e9&hm=7f2764b67ef1df6d95894ecc8e998711e2787679d8012f7e981f0d711b62a47e&=&format=webp&quality=lossless&width=854&height=1290)",
                "author": "uzzi38"
            },
            {
                "raw_content": "Just [^(dropping this here)](https://github.com/GPUOpen-LibrariesAndSDKs/FidelityFX-SDK/tree/01446e6a74888bf349652fcf2cbf5f642d30c2bf) As uzzi stated, an oopsies from AMD. Some of the code is interesting to see: void fsr4_shaders::GetInitializer(Preset quality, bool is_wmma, void*& outBlobPointer, size_t& outBlobSize) { if (is_wmma || !FSR4_ENABLE_DOT4) { #define GENERATOR(_qname, _qenum, ...) case _qenum: { outBlobSize = g_fsr4_model_v07_fp8_no_scale_ ## _qname ## _initializers_size; outBlobPointer = (void*)g_fsr4_model_v07_fp8_no_scale_ ## _qname ## _initializers_data; break; } switch (quality) { FOREACH_QUALITY(GENERATOR) } #undef GENERATOR } #if FSR4_ENABLE_DOT4 else { #define GENERATOR(_qname, _qenum, ...) case _qenum: { outBlobSize = g_fsr4_model_v07_i8_ ## _qname ## _initializers_size; outBlobPointer = (void*)g_fsr4_model_v07_i8_ ## _qname ## _initializers_data; break; } switch (quality) { FOREACH_QUALITY(GENERATOR) } #undef GENERATOR } #endif } Maybe this was a test, or the real deal. Regardless, using Linux, FSR4 works decently on RDNA3 ([1](https://www.reddit.com/r/linux_gaming/comments/1m1mieo/fsr4_on_rdna3_keeps_getting_better/),[2](https://www.reddit.com/r/radeon/comments/1mp9jyp/fsr4_just_keeps_getting_better_on_amd_rx_7000/)). While I feel it's a bummer there still is no Vulkan support, hopefully this 'leak' adds pressure to AMD and help out RDNA3 users. While I'm not certain of the frametime costs on mobile RDNA3/.5, this would be pretty great for Strix-/H considering LNL/ARL platforms have XMX XeSS upscaling.",
                "author": "Noble00_"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Valve's Fremont console surfaces on Geekbench: six-core Zen 4 CPU and RX 7600 GPU | A Half-Life 3 launch title would be nice",
        "score": 147,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hardware config sounds more like some frankenstein prototype than the real deal.",
                "author": "PorchettaM"
            },
            {
                "raw_content": "A trillion dollars would be nice",
                "author": "callmedaddyshark"
            },
            {
                "raw_content": "That's basically the same as my current PC specification, with less RAM. Honestly, in my experience the performance is perfectly adequate for all but enthusiasts. Medium settings, 1080p, \\~60fps in most titles. It's fine for everything I play. Edit: Then again, games are rapidly becoming more demanding. I can't see this specification from aging particularly well.",
                "author": "ckdx_"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD reportedly ends B650 motherboard chipset production",
        "score": 151,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What was the difference anyway ? Isn't a \"new\" Promontory chipset just relabel of the \"old\" one ? All of the differences I know of are in the PCB, not chipset.",
                "author": "Emerson_Wallace_9272"
            },
            {
                "raw_content": "B650 dies earlier than B550 lol",
                "author": "nezeta"
            },
            {
                "raw_content": "I think the industry is ready to “force” PCIe gen5 on more and more motherboards such that future GPUs don’t have to be designed with Gen4/3 connectivity in mind.",
                "author": "titanking4"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Phison takes legal action over falsified 'leaked' document on Windows SSD issues — says it continues to investigate reports of problems",
        "score": 118,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wonder who made and sent out the document to Phison's partners. Short holders, a competitor, a disgruntled Phison SSD owner?",
                "author": "trid45"
            },
            {
                "raw_content": ">*\"Phison has recently been made aware of the industry-wide effects of the 'KB5063878' and ‘KB5062660’ updates on Windows 11 that potentially impacted several storage devices, including some supported by Phison. We understand the disruption this may have caused and promptly engaged industry stakeholders. We are steadfast in our commitment to product integrity and the success of our partners and end users. At this time, the controllers that may have been affected are under review and we are working with partners. We will continue to provide updates and advisories to partners who may have been impacted to provide support and ensure any applicable remediation.\"*",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "Can someone explain what this update actually does to affect certain nvme drives?",
                "author": "pc-master-builder"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Current Gaming consoles in the Market prices now",
        "score": 3438,
        "text_content": "",
        "comments": [
            {
                "raw_content": "$1000 ps6 incoming lol",
                "author": "Bits_NPCs"
            },
            {
                "raw_content": "Wait till you see the new Xbox ROG Ally X pricing",
                "author": "ReditMaster576"
            },
            {
                "raw_content": "This is one of the reasons I bought the Switch 2 on release, eventually its price will increase. Also they said the Mario Kart bundle would end by Fall, and no fucking way I'm paying $80USD",
                "author": "GokaiRed64"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Metroid Prime 4 has ESRB rating",
        "score": 268,
        "text_content": "This is new, right? https://www.nintendo.com/us/store/products/metroid-prime-4-beyond-switch/?srsltid=AfmBOoq0cWhD2UC7fjMIqstPUXp0WG8a1-9tHL-ZYhniAQOAZgLofPFE",
        "comments": [
            {
                "raw_content": "lets get it!!!",
                "author": "ExcitementTiny2809"
            },
            {
                "raw_content": "Rated Teen for Animated Blood, Violence In-Game Purchases",
                "author": "Fit_Buy_889"
            },
            {
                "raw_content": "Shadow drop tomorrow confirmed!",
                "author": "burshturs"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Trails in the Sky 1st Chapter remake gets Switch 2 version, digital only, upgrade path confirmed for digital and physical.",
        "score": 201,
        "text_content": "Upgrade is 1 dollar. Also demo coming soon for Switch 1 with progress carrying over.",
        "comments": [
            {
                "raw_content": "I’m actually fine with this approach. Purchase the switch 1 physical version, then upgrade for $1.",
                "author": "tfox245"
            },
            {
                "raw_content": "Interesting, not giving into paying for the more expensive 64GB cart, yet giving customers the perfect alternative. No reason the Segas of the world can’t do the same I read upgrades can’t be offered for free in Japan.",
                "author": "Sparescrewdriver"
            },
            {
                "raw_content": "Take my money ![gif](giphy|sDcfxFDozb3bO)",
                "author": "Glass-Can9199"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Elden Ring on Switch 2 is a Disaster on handheld mode",
        "score": 605,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Game running poorly in handheld mode even though handheld mode is probably the main reason why people would play it on Switch 2 in the first place",
                "author": "Financial-General163"
            },
            {
                "raw_content": "https://youtu.be/5Hq3m8UwhGM?si=69a6WTRKes5Lu6w8 Nintendo Life also checks it and confirming its terrible. The graphics were great but FPS went down to 15fps. That's why they are not allowed to record it lol. This is disappointing because that is a day 1 purchase for me even if it's a key card. The main reason they don't have a release date. I hope they just move the release date next year instead of lauching it this year with that kind of performance. I'm still hoping they could iron it out.",
                "author": "VannofThursday"
            },
            {
                "raw_content": "I think performance issues are one thing, but trying to \"hide\" them by not allowing the press to record gameplay feels a bit underhanded. (And pointless, since people will talk about it anyway.)",
                "author": "mrmivo"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Silksong supports 120fps on switch2",
        "score": 1188,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Heck yeah",
                "author": "Whire_pickledmin2610"
            },
            {
                "raw_content": "From the article: > This increased frame rate falls under the game's 'TV Mode', which boasts a \"higher frame rate mode for displays that support 120Hz,\" **though resolution is reduced in the process.** I’ll probably still play at 60 to keep the higher resolution. Awesome that this is even an option.",
                "author": "thetantalus"
            },
            {
                "raw_content": "Are the games playable at the Nintendo booth today or just Silksong? Been waiting to see some borderlands 4 and Elden ring gameplay and haven’t seen anybody post any yet",
                "author": "drakev6304"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Me vs the guy she tells me not to worry about",
        "score": 217,
        "text_content": "I cant stop thinking about him.",
        "comments": [
            {
                "raw_content": "“I can’t stop thinking about him” Are you sure she isn’t the one that should be worried?",
                "author": "MagmarBoi"
            },
            {
                "raw_content": "There's a Starman waiting in the sky..",
                "author": "asseaterw"
            },
            {
                "raw_content": "The legendary starfy is back baby",
                "author": "Skinmedead"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Chibi-Robo available via Nintendo GameCube",
        "score": 14,
        "text_content": "He cooks! He cleans! Enter Chibi-Robo, a tiny robot programmed to spread happiness! Plug into adventure in Chibi-Robo!, available to play now with Nintendo GameCube – Nintendo Classics on Nintendo Switch 2 for Nintendo Switch Online + Expansion Pack members!",
        "comments": [
            {
                "raw_content": "A certain Scott the woz is gonna be so happy",
                "author": "TheSixkBoy"
            },
            {
                "raw_content": "Game is running at an odd ~40fps by the way",
                "author": "MdelinQ"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Chibi-Robo! is now Available on Nintendo Switch Online!",
        "score": 42,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Please play it everyone! Show them we love Chibi Robo!",
                "author": "FrustratedLemonPrint"
            },
            {
                "raw_content": "I plan to play it soon!",
                "author": "Williekins"
            },
            {
                "raw_content": "Shoooot, that was not on my bingo board. Heck yeah!",
                "author": "NotExtremos"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Metroid Prime 4: Beyond has been rated by the ESRB",
        "score": 318,
        "text_content": "Nintendo added the rating to their page (went from RP to T): https://www.nintendo.com/us/store/products/metroid-prime-4-beyond-switch/ It's not visible on the ESRB's website yet: https://www.esrb.org/search/?searchKeyword=Metroid+Prime+4",
        "comments": [
            {
                "raw_content": "I used to pray for times like this",
                "author": "aeseyuh"
            },
            {
                "raw_content": "I feel like we gotta get some kind at least overview trailer next week, confirming a release date. Probably either early November in between that few week window between Pokemon and Kirby or early December right about two weeks after Kirby. Though depends where Hyrule Warriors also falls, as that could be a December game or slip into January.",
                "author": "Animegamingnerd"
            },
            {
                "raw_content": "Silksong event tomorrow and now MP4 rated? We living in the best of times.",
                "author": "Eliskor89"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[Jason Schreier]NEW: 2K Games laid off more than 80 people at BioShock 4 developer Cloud Chamber this week, about 1/3 of the studio. This new BioShock has been in the works for more than a decade across multiple studios.",
        "score": 588,
        "text_content": "[Jason Schreier](https://bsky.app/profile/jasonschreier.bsky.social/post/3lwu2whpd2c2o) posted on Bluesky.",
        "comments": [
            {
                "raw_content": "#Jason Schreier is a Tier 1 - Very Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "No Gods or Kings, Only development hell.",
                "author": "GameZard"
            },
            {
                "raw_content": "My friend let it slip how the creative director and studio were the biggest problems. The creative director was very hands off and refused to commit to anything out of not wanting to take blame if something was seen as bad. Essentially they weren’t giving any direction. The studio head just let this go on for way too long. It’s terrible that the people who ultimately pay the biggest price are those 80 folks who spent countless hours on a wild goose chase development. The creative director and studio head will probably end up fine and probably have hefty severance packages.",
                "author": "JackusABackus"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "TPC Asia accidentally leaked a new Mega Evolution for Z-A",
        "score": 81,
        "text_content": "TPC Asia accidentally put up a premiere for their new \"spooky\" Pokemon Legends Z-A Pokemon reveal with the description explicitly naming what it is. They took the premiere down pretty quick but gonintendo archived the description: There have been rumors about a mysteriously sweet scent coming from a certain building. Check out this found footage exploring the building’s darkened halls—parts of which seem to have been melted. What truths about Mega Victreebel and its Trainer will spill out by the end? https://gonintendo.com/contents/51903-pokemon-co-teases-a-spooky-themed-pokemon-legends-z-a-video-releasing-aug-21st-2025",
        "comments": [
            {
                "raw_content": "The leaks have already shown what it looks like and you’re not gonna like how fat it becomes it’s a CHONKER with a brown vine wrapped around its neck It’s pretty much this https://imgur.com/a/NUDov5z",
                "author": "Icy-ConcentrationC"
            },
            {
                "raw_content": "From the teaser I was figuring it'd be one of the other leaked ones, but definitely not complaining about seeing this one now. It's waaaaay overdue for Victreebel to get some love.",
                "author": "Lizuka"
            },
            {
                "raw_content": "aw man was hoping to see mega scolipede first but this is cool too",
                "author": "MagazineInfamous6142"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Australian car import company Cult & Classic may have just confirmed FH6 in a now-deleted Instagram post",
        "score": 210,
        "text_content": "https://imgur.com/a/s8U6ckB",
        "comments": [
            {
                "raw_content": "Shooting photos of kei cars gives more reason to believe Forza Horizon 6 will be set in Japan",
                "author": "Minnesota_Arouser"
            },
            {
                "raw_content": "FH6 being Forza Horizon 6 for people who didn't click the link and were similarly confused",
                "author": "BadTakesJake"
            },
            {
                "raw_content": "That Initial drive with a kei truck down Mount Fuji is gonna hit like crack",
                "author": "EnsureMIlk"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Silksong Special Announcement is only 2 minutes long",
        "score": 532,
        "text_content": "[https://www.reddit.com/r/Silksong/comments/1mun4s0/video\\_length\\_has\\_been\\_revealed\\_its\\_100\\_a\\_release/](https://www.reddit.com/r/Silksong/comments/1mun4s0/video_length_has_been_revealed_its_100_a_release/) [https://i.imgur.com/7pPC9dW.png](https://i.imgur.com/7pPC9dW.png) Likely a release date trailer",
        "comments": [
            {
                "raw_content": "Just enough time to inform us that it’s been cancelled let’s go",
                "author": "Dull-Caterpillar3153"
            },
            {
                "raw_content": "Waiting 8 years for a 2 minute experience accurately describes my sex life.",
                "author": "MuptonBossman"
            },
            {
                "raw_content": "Introducing Hollow Knight: Royale! The new battle royale developed by Team Cherry. *video ends*",
                "author": "ArcanaOfApocrypha"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Resident Evil Requiem Game Over Scene",
        "score": 321,
        "text_content": "[https://youtu.be/CIFs0p0AfTE](https://youtu.be/CIFs0p0AfTE) Warning 18+",
        "comments": [
            {
                "raw_content": "Are these going to be censored in the JP release because it's actually really funny to see how they do it",
                "author": "r_lucasite"
            },
            {
                "raw_content": "I recognize the scream at 0:34 from RE4 2005 anyone else?",
                "author": "imsaleh0"
            },
            {
                "raw_content": "That monster design is so good.",
                "author": "Marinebiologist_0"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Resident Evil Requiem NEW Footage Escaping Hospital",
        "score": 214,
        "text_content": "[https://www.youtube.com/watch?v=4KsAIfWyZyE](https://www.youtube.com/watch?v=4KsAIfWyZyE)",
        "comments": [
            {
                "raw_content": "hmm, wonder how she escapes then? because the place she was trying to get too looks alot like the main hall that Grace is reloading her gun in the dev message clip",
                "author": "Ok_Canary5591"
            },
            {
                "raw_content": "Grace and the Terrible, Horrible, No Good, Very Bad Day",
                "author": "scott1swann"
            },
            {
                "raw_content": "Yessss! These videos are giving me Re7 levels of anxiety. Seems like Capcom are going deep on the horror! Love it",
                "author": "MetalFungus420"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Valve's Fremont device has appeared on Geekbench (+ more details from SadlyItsBradley)",
        "score": 259,
        "text_content": "Geekbench score: https://browser.geekbench.com/v6/cpu/13390426 https://xcancel.com/SadlyItsBradley/status/1958024995273068544 >Valve Fremont recap: a TV focused PC box/console running SteamOS. Has dedicated HDMI port > >Has a semi-custom CPU based on Hawk Point 2. But with a removed iGPU > >Has custom Valve mobo/case. And dedicated RX 7600 GPU (No shared RAM) > >Geekbench is from Taiwan (Quanta factory debug) https://xcancel.com/SadlyItsBradley/status/1958025002105598107 >Expected to come with the Ibex gamepad leaked in the SteamVR driver files alongside the Roy controllers (for the Valve Deckard XR headset) > >Ibex and Roy controllers have a very aligned tooling/development schedule > >Likely to see Valve Fremont, Ibex, Deckard, and Roy all at once",
        "comments": [
            {
                "raw_content": "\"Hawk Point 2\" ![gif](giphy|nMG4hBwUNCJAQ)",
                "author": "Laj3ebRondila1003"
            },
            {
                "raw_content": "This could very well be accompanied with a...Half-Life 3 release?",
                "author": "SaltyBeak93"
            },
            {
                "raw_content": "RX7600 GPU feels a little under powered for a 2026 box, no?",
                "author": "Jackal239"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "US Senator Bernie Sanders backs Trump plan for government stake in Intel | Technology News | Al Jazeera",
        "score": 65,
        "text_content": "",
        "comments": [],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD releases FidelityFX SDK 2.0, FSR 4 goes full open source",
        "score": 523,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They released the FSR4 source code by accident, it's *public* now but that's not the same as releasing it under a proper open source license. The code was scrubbed from the repo and even if you have a copy saved you can't legally do much of anything with it. It doesn't seem like AMD has any intention of open sourcing FSR4, the SDK is a binary blob just like DLSS and XeSS. It's also kinda disappointing that the SDK doesn't support Vulkan when the other scalers do.",
                "author": "jsheard"
            },
            {
                "raw_content": "Note: *AMD FSR4 open-source code release was not planned. AMD has already taken most repositories down.*",
                "author": "NarutoDragon732"
            },
            {
                "raw_content": "I really hope they actually properly make this either open source, or at least source available in the future. Not just by accident, but properly with a proper license etc.",
                "author": "Sinomsinom"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD FidelityFX SDK 2.0 Released With FSR 4 Included",
        "score": 58,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Finally!!",
                "author": "Dante_77A"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD reportedly ends B650 motherboard chipset production",
        "score": 177,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The title doesn't make sense. If they're ending chipset production they're ending production of the chipset for all AM5 boards. Promontory 21 is used in varying configurations all AM5 boards that feature a chipset. If they do end production, a) they might have enough/too much inventory b) a replacement might be on the horizon.",
                "author": "dsoshahine"
            },
            {
                "raw_content": "What does it mean for people who have B650?",
                "author": "Roution"
            },
            {
                "raw_content": "Kinda glad to get rid of minor options and variations. Makes it too hard to compare MBs for all the slight GPU, M.2, and USB connectivity options.",
                "author": "WarEagleGo"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Beelink SER9 Pro Ryzen 7 mini PC review: The regular non-Pro version is faster",
        "score": 17,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "MSI unveils MEG X870E GODLIKE X Edition and X870E MAX series motherboards",
        "score": 23,
        "text_content": "",
        "comments": [
            {
                "raw_content": "1,000 units worldwide who gives a fuck then it's so stupid they do this limited crap. In a few years it's still going to be obsolete if that long.",
                "author": "SeeonX"
            },
            {
                "raw_content": "So are they gonna fix the weird PCIe lane distribution on their top end boards? For some reason the higher spec boards split the GPU to x8 when you max out M.2, while the Tomahawk cuts down USB4 bandwidth while keeping full M.2 and GPU speed.",
                "author": "chipsnapper"
            },
            {
                "raw_content": "What's the point spending 1000 € for the Mainboard? Just a flex that you can't handle you're money ? And when you buy such a Mainboard do it on release of a new sockel. It's been 3 years of AM5. Maybe AM5 will end in 3 years (just a theory). So it getting worthless faster.",
                "author": "Swifty404"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Valve Fremont appears on Geekbench, 6-core AMD custom APU with Radeon RX 7600-level graphics",
        "score": 78,
        "text_content": "",
        "comments": [
            {
                "raw_content": "if you consider how far FSR4 has gone in linux concerning the RDNA3 stuff, the RX 7600 choice doesnt sound as bad 6 core mobile zen 4 is okay, should be way better than whats inside the ps5p anyway if theyre gonna undercut the ps5 (which i think they can) then this has decent potential just like the deck had great for 1080p stuff, decent 1440p performer with fsr4 and occassional 4k60 on lighter games it shouldnt be that much slower than ps5, in fact it has better cpu",
                "author": "baron643"
            },
            {
                "raw_content": "Steam deck 2? It’ll most likely be a little better than the 7600 if it’s testing, could be pushed to 4060ti levels of performance. My only hope is that it’s not $2000. might pick one up to use for school instead of a 395+.",
                "author": "why_is_this_username"
            },
            {
                "raw_content": "Just hoping it means that they'll integrate a newer version of FSR into Gamescope. Would be a potent little machine if they did.",
                "author": "Alaricus1119"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Valve 'Fremont' APU breaks cover on Geekbench, hinting at possible future console | Club386",
        "score": 32,
        "text_content": "",
        "comments": [
            {
                "raw_content": "6c12t Zen 4 CPU with no iGPU. I guess the article/leaker expects the system to launch with a 7600-ish GPU, dedicated, and maybe will be installed in newly reminted Steam boxes?",
                "author": "TheDonnARK"
            },
            {
                "raw_content": "RDNA 3 is a very weird choice for a discrete GPU. Especially in light of what Valve said they learnt about sales of the Steam Deck (having more sales of the higher end models). And only 8GB of VRAM? Unless this is the same price as the standard Steam Deck at $399 (because it's not a portable handheld) I don't really see the appeal for couch gamers going mainstream on their 4K TVs. I was expecting Valve to wait for Medusa Halo in 2027 before re-entering this market and aiming for +/- $799.",
                "author": "Mageoftheyear"
            },
            {
                "raw_content": "The cpu matches the 8540 https://browser.geekbench.com/v6/cpu/8301932 Also note the GPU on the AI 395 performs about the same level as the RX 7600. . Maybe a cut down 8540 laptop chip (disabled iGPU) or a new CPU chiplet that is compatible with the AI 395 GPU/IO die chiplet? Also the tested sample shows only 2 memory channels which means it's just using one soDIMM (each DDR 5 DIMM has 2x 32 bit channels. Note the 8540 laptop sample linked shows 4 memory channels which is what you get from two DIMMs or the equivalent from soldered modules. So likely this is just an approximation of the hardware that Valve is using until AMD can deliver the actual final product.",
                "author": "LordoftheChia"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Inside the ROG Xbox Ally: Game Access and Compatibility",
        "score": 8,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wow. All I wanted to see was, how are they improving the performance Windows on mobile. Not how are they improving the UI for Windows for gaming on a handheld. How are they improving the performance on Windows for gaming. Where is it. Surely they've done it. Please tell me, Microsoft. Yes, we know there are a lot of Windows games, and we know that Windows handhelds can play all of them. But how have you improved the OS to make the system run better on mobile? Battery life, performance, memory, something? All they did was put a tag on games? That isn't anything. I feel like this is a simple question and all anyone cares about, which will have huge downstream ramifications for not just PC gamers but potentially everyone else that uses Windows on a mobile device.",
                "author": "TurtleTreehouse"
            },
            {
                "raw_content": "Huang: \"We know what players want.\" Please, if there is one this crystal f'in clear, is that Microsoft/Xbox has no GD idea what players want lol. A PC is a PC, an Quest is a Quest, and an Xbox is an Xbox. Putting Xbox on whatever product they want to take credit for does not make it an Xbox. it makes it a meme. This video makes it sound like they just invented the handheld PC. Like the Ally, or SteamDeck has not been out for years now. This device adds literally NOTHING to what the Ally, Legion, Claw, ect. could already do lol. And for the love of god, cloud streaming Xbox box to something does not make it an Xbox! I might as well say \"Oh I have Xbox iPhone Max\", or \"I have a PlayStation GE66 Raider laptop\" for that matter. I really do hope this is a good handheld, but jfc Microsoft, you can't be in the midst of having your actual Xbox console be a failure, closing down multiple gaming studios, canceling multiple games, shameless spamming xbox on everything you can think of, and then say you understand what players want with the introduction of a crap overlay everyone will disable to increase performance anyway lol.",
                "author": "PersonSuitTV"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD HIPRT Updated With New Features For RDNA 4 GPUs",
        "score": 13,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Now we wait for Blender HIP benchmarks",
                "author": "J05A3"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Cape Cod is considering taxing luxury home sales of $2+ million to raise funds for the housing market's 'missing middle'",
        "score": 322,
        "text_content": "",
        "comments": [
            {
                "raw_content": "For what it’s worth, as a kid Cape Cod was the middle class dream, I knew quite a few people who had family houses there, albeit not on the beach. These are people with parents who were just regular working people, teachers or blue collar people. It was possible once upon a time to have a family vacation property and you didn’t have to be conventionally rich.",
                "author": "colcardaki"
            },
            {
                "raw_content": "Why does it take government subsidies for apartment complexes to be built?",
                "author": "Fresh-String6226"
            },
            {
                "raw_content": "The number to buy in just jumped up a lot. Unfortunately, the middle class got jumped over.",
                "author": "Prestigious-Ice-2742"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Zillow changes course on home prices: Updated forecast for 400 housing markets",
        "score": 125,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Isnt zillow estimates one of the reasons prices went up?",
                "author": "ndbdjdiufndbk"
            },
            {
                "raw_content": "Snake Oil Inc. projects sales of Snake Oil to keep going up.",
                "author": "Likely_a_bot"
            },
            {
                "raw_content": "Zillow started in 2006 and somewhat notoriously in 2008 revealed that 77% of American homes had gone down in potential sales price over the last year. if you look back into the news archives for 2008, you’ll see what i’m talking about. this is arguably sort of how they made their name and grew very early on. see, before Zillow and others, this kind of information wasn’t readily accessible. LATimes: https://www.latimes.com/archives/blogs/money-company/story/2008-08-05/zillow-measures-homeowners-perception-gap > Just like with most of life’s unpleasant realities, the majority of Americans think the nation’s housing crisis is something that happens to the other guy. > That’s according to a survey of more than 1,300 homeowners conducted by Zillow. Two-thirds of homeowners believe their house has increased in value or remained the same in the last year. Yet, these same folks acknowledge the existence of foreclosures in their neighborhoods and believe that more are on the way. nearly 20yrs later, Zillow is in a vastly different position from when they were just a startup. this is a good example. note how Zillow is not merely reporting the news, they’re trying to *create the news*. they’re not reporting on what has happened, but what *will happen*. and, as we all know, this is why they’re one of the main contributors to the run-up of this housing bubble. but at the end of the day, they don’t have total control over a market (although they *do* wield significant control). at the end of the day, for example, they can’t control how much a homeowner could rent their house out for, since that’s not tainted by speculation.",
                "author": "acqua_di_hoomertears"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Homebuyers made a huge mortgage gamble. It's backfiring spectacularly.",
        "score": 260,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The real problem with these particular home sellers in this article is this: *By January, only a few months after they'd closed on the house, Hutton and his wife were already starting to talk about moving.*",
                "author": "SnortingElk"
            },
            {
                "raw_content": "As a Realtor, I cringed when I saw other Realtors on social media posting the exact quote for three years. \" Date the Rate and marry the home.\"",
                "author": "chewonmysac"
            },
            {
                "raw_content": "In the process right now of closing on a new house, and very happy! (I am not buying to flip nor do I plan on moving again anytime soon)….seems like the only ones upset are the ones who had planned on flipping or moving after a year or two.",
                "author": "SlimWorthy"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Divided Fed worried about tariffs, inflation and the labor market, minutes show",
        "score": 46,
        "text_content": "Rate cut hopes dwindling",
        "comments": [
            {
                "raw_content": "you ain't gettin rate cuts, and if you do it won't effect mortgage rates in any way (except maybe increase them)",
                "author": "HormoneDemon"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "America's Housing Market Reaches 'Inflection Point'",
        "score": 107,
        "text_content": "",
        "comments": [
            {
                "raw_content": "the crappy houses they're building in that pic aren't worth 500k i'll tell you that much",
                "author": "HormoneDemon"
            },
            {
                "raw_content": "How about they inflect and become more affordable",
                "author": "coldshowerss"
            },
            {
                "raw_content": "If you watch some [home inspectors on YouTube ](https://youtube.com/shorts/UYDv5agofTQ?si=3Cz9UQCkYedC2lzD) you'll learn just how bad and dangerous some of these new builds are.",
                "author": "kahmos"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage applications decreased 1.4 percent from one week earlier",
        "score": 50,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wouldn’t you expect that? Most families have moved into their new homes for the 25-26 school year.",
                "author": "Will_Not_Comment_"
            },
            {
                "raw_content": "I believe the applications will continue to drop for a while. Most everyone that can afford to buy has already done so. Pretty much anyone that is applying has either come into some new money, or they already have equity and want/need to move.",
                "author": "DarthHubcap"
            },
            {
                "raw_content": "Mortgage applications decreased 1.4 percent from one week earlier, according to data from the Mortgage Bankers Association’s (MBA) Weekly Mortgage Applications Survey for the week ending August 15, 2025. The Market Composite Index, a measure of mortgage loan application volume, decreased 1.4 percent on a seasonally adjusted basis from one week earlier. On an unadjusted basis, the Index decreased 2 percent compared with the previous week. The Refinance Index decreased 3 percent from the previous week and was 23 percent higher than the same week one year ago. The seasonally adjusted Purchase Index increased 0.1 percent from one week earlier. The unadjusted Purchase Index decreased 2 percent compared with the previous week and was 23 percent higher than the same week one year ago. “Mortgage rates increased slightly last week, with the 30-year fixed rate now at 6.68 percent. Applications were down as a result, driven by a 16 percent decrease in VA applications, which are typically a volatile segment of the market,” said Joel Kan, MBA’s Vice President and Deputy Chief Economist. “FHA refinance applications increased over the week, as the FHA rate, at 6.39 percent, remained competitive relative to other loan types. Purchase applications were little changed over the week but were at the strongest pace in four weeks and continued to run well ahead of last year’s pace. Prospective homebuyers remain more active compared to last year despite economic headwinds and uncertainty and affordability challenges.” The refinance share of mortgage activity decreased to 46.1 percent of total applications from 46.5 percent the previous week. The adjustable-rate mortgage (ARM) share of activity decreased to 8.6 percent of total applications. The FHA share of total applications increased to 19.1 percent from 18.4 percent the week prior. The VA share of total applications decreased to 13.4 percent from 14.2 percent the week prior. The USDA share of total applications increased to 0.6 percent from 0.5 percent the week prior. The average contract interest rate for 30-year fixed-rate mortgages with conforming loan balances ($806,500 or less) increased to 6.68 percent from 6.67 percent, with points decreasing to 0.60 from 0.64 (including the origination fee) for 80 percent loan-to-value ratio (LTV) loans. The effective rate remained unchanged from last week. The average contract interest rate for 30-year fixed-rate mortgages with jumbo loan balances (greater than $806,500) decreased to 6.64 percent from 6.70 percent, with points increasing to 0.60 from 0.56 (including the origination fee) for 80 percent LTV loans. The effective rate decreased from last week. The average contract interest rate for 30-year fixed-rate mortgages backed by the FHA decreased to 6.39 percent from 6.40 percent, with points decreasing to 0.66 from 0.77 (including the origination fee) for 80 percent LTV loans. The effective rate decreased from last week. The average contract interest rate for 15-year fixed-rate mortgages increased to 5.96 percent from 5.93 percent, with points increasing to 0.70 from 0.63 (including the origination fee) for 80 percent LTV loans. The effective rate increased from last week. The average contract interest rate for 5/1 ARMs increased to 6.01 percent from 5.80 percent, with points decreasing to 0.63 from 0.67 (including the origination fee) for 80 percent LTV loans. The effective rate increased from last week.",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "😂",
        "score": 771,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I just hope my son helps me like I helped my dad. He didn't know how to set the VCR to record his favourite shows. He didn't know how to reset the dial modem. Etc etc. I can my picture, my son getting frustrated saying, \"Dad! If you tell the robot to trim the trees, you have to specify 'trim the trees in OUR yard!!! That's why the neighbours are pissed!!!'\"",
                "author": "ZipLineCrossed"
            },
            {
                "raw_content": "\"What ordinary thing we think now will seem backwards and bigoted in the future\" is one of my favourite games. If we get an anti-aging pill in the next few decades our kids will definitely be amused and horrified at our \"death is just a natural part of life\" attitude.",
                "author": "FrewdWoad"
            },
            {
                "raw_content": "https://preview.redd.it/ac916unfg9kf1.jpeg?width=296&format=pjpg&auto=webp&s=bcf815664b224445387e7e23f899fb11b61b3798",
                "author": "__Loot__"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Yann LeDemoted",
        "score": 224,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wow, I can't believe they made Yann report to this fucking guy. Alex Wang is such a hack. He created a company that just sells human-labelled data, and because foundational models are so data-hungry, it ended up being worth billions of dollars. But there's nothing especially innovative about what they do. He was good at marketing himself, going around different news channels and giving interviews.",
                "author": "zashuna"
            },
            {
                "raw_content": "Yann was always an IC and never a manager. His job title has not changed. FWIW Yann has been reporting to Wang ever since the initial restructuring back in June... Nothing has changed",
                "author": "Meric_"
            },
            {
                "raw_content": "Willing to bet that Yann will resign or transfer somewhere else within the next 6 months lmao",
                "author": "Glizzock22"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Deepseek 3.1 benchmarks released",
        "score": 84,
        "text_content": "",
        "comments": [
            {
                "raw_content": "💦",
                "author": "y___o___y___o"
            },
            {
                "raw_content": "Explain like I'm an idiot how this compares to GPT5",
                "author": "WTFnoAvailableNames"
            },
            {
                "raw_content": "chat is this good",
                "author": "The_Rational_Gooner"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Meta Will Be Freezing AI Hiring",
        "score": 147,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I mean they just went on an all time spending spree poaching top AI talent, makes sense they will try to see if the billions and billions spent on that will actually culminate in something before going even deeper.",
                "author": "Glittering-Neck-2505"
            },
            {
                "raw_content": "https://preview.redd.it/sen1tc45bakf1.jpeg?width=681&format=pjpg&auto=webp&s=682b5d7196fbbc555f6c9de3e69c77dd44206834",
                "author": "Beeehives"
            },
            {
                "raw_content": "I like to dig at billionaires as much as the rest of the 99.9%, but, I read this as a restructuring BECAUSE of all the new talent brought in. They're probably saying \"you are organized all wrong. Most of these people are useless and working on useless stuff\" So, naturally you hit the brakes.",
                "author": "SilasTalbot"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Boston Dynamics shares new progress",
        "score": 557,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Really makes you appreciate how incredible the human hand is evolutionary speaking.",
                "author": "Hogo-Nano"
            },
            {
                "raw_content": "When the uprising begins, hockey players will be first among the casualties.",
                "author": "disappointedfuturist"
            },
            {
                "raw_content": "Damn this may be the most impressive robotics demo I’ve seen. Incredibly robust with how the people were messing with it and how it could overcome that. Then the fact that it’s actually moving and positioning its body dynamically to pick up all this stuff. Insane progress!",
                "author": "socoolandawesome"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI logged its first $1 billion month but is still 'constantly under compute,' CFO says",
        "score": 476,
        "text_content": "I'm sure by the end of this year OpenAi will have part of Stargate operational so that will give them much more needed compute.",
        "comments": [
            {
                "raw_content": "$12bn annual revenue run rate $40bn contract with Oracle. Better start jacking up prices soon!",
                "author": "FarrisAT"
            },
            {
                "raw_content": "I like how they asked Sam where these trillions of dollars to build data centers are going to come from and he said they are developing a new financial instrument that should take care of it. Next level flim-flammery from this guy.",
                "author": "Appropriate-Peak6561"
            },
            {
                "raw_content": "$500 billion valuation? So, for $5 billion. I'm getting a whopping 1 freaking percent of this company? These people are out of their minds.",
                "author": "SpudsRacer"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI staffer claims to have had GPT5-Pro prove/improve on a math paper on Twitter, it was later superseded by another human paper, but the solution it provided was novel and better than the v1",
        "score": 308,
        "text_content": "> Claim: gpt-5-pro can prove new interesting mathematics. > Proof: I took a convex optimization paper with a clean open problem in it and asked gpt-5-pro to work on it. It proved a better bound than what is in the paper, and I checked the proof it's correct. > Details below. ... > As you can see in the top post, gpt-5-pro was able to improve the bound from this paper and showed that in fact eta can be taken to be as large as 1.5/L, so not quite fully closing the gap but making good progress. Def. a novel contribution that'd be worthy of a nice arxiv note.",
        "comments": [
            {
                "raw_content": "I get a feeling that superhuman ai systems are within 1-2 years. even if we don't get general ones in that timeframe.",
                "author": "The_Scout1255"
            },
            {
                "raw_content": "This was Sebastian Bubeck who notoriously was lead author on the Sparks of Intelligence paper and lead on the Microsoft Phi series of models. If you've followed him at all you'd know that the paper was dubious and that the Phi models were over fit and trained for the benchmarks so I didn't trust him much.",
                "author": "Bernafterpostinggg"
            },
            {
                "raw_content": "Yeah Sam might not just be hyping when he says next year AI will start contributing to science/math research in novel ways",
                "author": "socoolandawesome"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Stargate meets \"Frontier\"; Oracle and OpenAI plan a 1.4-GW cluster",
        "score": 49,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ugh is natural gas still that much cheaper than renewables? I was under the impression that utility-scale solar was comparable now. I imagine maybe supply constraints/pricing of energy storage is the culprit for that decision. But I'm surprised that they didn't even try to go for a partially renewable approach here...",
                "author": "churningaccount"
            },
            {
                "raw_content": "sources: [Oracle Cloud Powers OpenAI, Nvidia, and Larry Ellison’s Riches - Bloomberg](https://www.bloomberg.com/news/articles/2025-08-20/oracle-cloud-powers-openai-nvidia-and-larry-ellison-s-riches?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc1NTY5NDczMCwiZXhwIjoxNzU2Mjk5NTMwLCJhcnRpY2xlSWQiOiJUMUFIOFFHUFFROU0wMCIsImJjb25uZWN0SWQiOiJEQ0FGMjNFM0YyMkE0Qzk5OTM0RUMyRDEwNkM0ODc0NyJ9.5_nYS1qV2DLHuL896OlSA7SOSUW6qP4Jkuy7isXMlVQ&leadSource=uverify%20wall) [Vantage Data Centers Unveils Plans for “Frontier,” a $25B Mega-campus in Texas to Meet Unprecedented AI Demand - Vantage Data Centers](https://vantage-dc.com/news/vantage-data-centers-unveils-plans-for-frontier-a-25b-mega-campus-in-texas-to-meet-unprecedented-ai-demand/)",
                "author": "Outside-Iron-8242"
            },
            {
                "raw_content": "I'd just hope they quickly integrate into the larger power grid to eventually get a more favorable energy mix for their data center.",
                "author": "Fast-Satisfaction482"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "A comic I made",
        "score": 153,
        "text_content": "It's always telling me 'Your page does XYZ'.. I'm like.. *yeah... my page...*",
        "comments": [
            {
                "raw_content": "You made this?",
                "author": "Catphish37"
            },
            {
                "raw_content": "To be honest, this about half of Reddit posts these days. I’ve had to unsubscribe to some subreddits because they are all AI slop now. Don’t get me wrong, I think a lot of generative AI is great, especially when attributed as such. But man is Reddit overrun by new Picassos and Rembrandts. Of course the worst are the 20 page posting of new physics gibberish.",
                "author": "KidKilobyte"
            },
            {
                "raw_content": "Made this I",
                "author": "skybluebamboo"
            }
        ],
        "subreddit": "singularity"
    }
]