[
    {
        "post_name": "Soon...",
        "score": 1162,
        "text_content": "",
        "comments": [
            {
                "raw_content": "he is a creepy fvcker eh?",
                "author": "VanillaCupCake"
            },
            {
                "raw_content": "Ballsack eyes.",
                "author": "1st_Covfefe"
            },
            {
                "raw_content": "I was just thinking about him earlier today, about how he said that when he worked with the NotZees to collect the art work, silverware, and other valuables of jews sent to the death camps, that it was the best time of his life. What a ghoul.",
                "author": "HillarysBeaverMunch"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🤡 CNN’s Kasie Hunt is now alleging that everyone in America commits mortgage fraud",
        "score": 1029,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Someone check her mortgage for fraud and let’s see.",
                "author": "Blackmore"
            },
            {
                "raw_content": "What? Buying a primary residence w/ an FHA, FannieMae type loan is quite different than buying investment property. Hmm..., Does Ms. Hunt own investment property with a primary residence mortgage loan?",
                "author": "dataonly"
            },
            {
                "raw_content": "Hey DOJ. Have a look at Ms Hunt's mortgage documents.",
                "author": "PatrioticVideo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "He’s Bringing Them Home",
        "score": 959,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Now let's start finding democrats homes in prison. 🐸👍",
                "author": "MythArcana"
            },
            {
                "raw_content": "So we can stop caring about muh Israel our greatest muh ally now?",
                "author": "madeaprofilejustforu"
            },
            {
                "raw_content": "Best President Ever. I love this celebration.",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Sanchez Nicholson has been arrested for murdering a 29-year old in Charlotte NC. Sanchez has been arrested a mind-boggling 33 TIMES, including for 2 attempted murders — only 13 DAYS APART.",
        "score": 571,
        "text_content": "",
        "comments": [
            {
                "raw_content": "𝘐𝘵'𝘴 𝘢𝘭𝘭 𝘴𝘰 𝘵𝘪𝘳𝘦𝘴𝘰𝘮𝘦...",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Time to start charging DAs and judges for their collusion in this corruption and murder.",
                "author": "terribletwos"
            },
            {
                "raw_content": "Anarcho-tyranny",
                "author": "Squentin"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "MELANIA TRUMP : MELANIA, The Film January 30, 2026 Worldwide Premiere",
        "score": 100,
        "text_content": "",
        "comments": [
            {
                "raw_content": "More details about the documentary at NY Post: https://nypost.com/2025/10/08/opinion/miranda-devine-melania-documentary-highlights-the-first-ladys-life-behind-the-scenes/",
                "author": "ItsFunToSay-M-A-G-A"
            },
            {
                "raw_content": "has she released her book yet?",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Fucking really?",
                "author": "IForgotToAddAnEmail"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I see a lot of people aren’t too happy with President Trump ending the war between Palestine and Israel. I’d probably feel the same way if he shut down my grifting train and I had to find something new to complain about just to keep my bank account afloat.",
        "score": 1100,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://x.com/ImMeme0/status/1976460617281327537",
                "author": "SweetBeef"
            },
            {
                "raw_content": "I’m sure Greta is upset since Gaza was her excuse to walk away from the climate grift for awhile.",
                "author": "goldkeyboardwarrior"
            },
            {
                "raw_content": "Dear Trump:Stop fixing stuff so I can earn my paycheck via grifting. If Not I will make up stuff so I will grift some more. I wonder why they get their followers to Doom and gloom everywhere. Their \"Influencers\" do it and they are parroting the same BS onto other people.",
                "author": "DT170x"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The sad state of the democratic party.",
        "score": 1213,
        "text_content": "",
        "comments": [
            {
                "raw_content": "To the poor bastard that didn't get the sticky. https://patriots.win/p/1ARJYDYdO9/accurate/c/",
                "author": "nakedjay"
            },
            {
                "raw_content": "Who is the blue haired freak praying to? Moloch?",
                "author": "Armiakrajowa"
            },
            {
                "raw_content": "Marxists never want peace.",
                "author": "ThorsonTT"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Game changer",
        "score": 1629,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Thanks for the sticky. This is YUGE 🪗",
                "author": "YodaBannon"
            },
            {
                "raw_content": "# Rico antifa",
                "author": "CommieCrats"
            },
            {
                "raw_content": "Billions, not millions. The NGOs weren't just funded by USAID. Tons of dark money out there.",
                "author": "I_Am_John_Galt"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Dominion Voting Systems acquired by former GOP elections director",
        "score": 989,
        "text_content": "",
        "comments": [
            {
                "raw_content": "....who is probably a fucking RINO.",
                "author": "CrispyCracker2"
            },
            {
                "raw_content": "I’m going to enjoy the left’s freak out over this.",
                "author": "RuprechtThaMonkeyBoy"
            },
            {
                "raw_content": "pRedditors are melting down on r/news",
                "author": "GodKingHarambe"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: New York AG Letitia James indicted on criminal bank fraud charge",
        "score": 2380,
        "text_content": "",
        "comments": [
            {
                "raw_content": "BWAHAHAHAHA",
                "author": "NYforTrump"
            },
            {
                "raw_content": "Hey wait is this what she projected onto Trump when she was going after him?",
                "author": "Wrexxis780"
            },
            {
                "raw_content": "Finally.",
                "author": "DeusVult1096"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "CAN'T MAKE THIS UP! Letitia James says her indictment is the \"weaponization of our justice system.\" \"This is political retribution.\" She cannot be serious.",
        "score": 1541,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Retribution for what Letitia?",
                "author": "Reg_Llama_Of_Brixton"
            },
            {
                "raw_content": "note HER case is CRIMINAL, her case against Trump was only civil and it was overturned as ridiculous by the appeals court",
                "author": "ebuy123"
            },
            {
                "raw_content": "70iq something something",
                "author": "holytrpbatman"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Play stupid games, win stupid prizes",
        "score": 1226,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\\*ZAP\\*",
                "author": "uxername27"
            },
            {
                "raw_content": "Only one red beam?",
                "author": "Wrexxis780"
            },
            {
                "raw_content": "Laws should be changed. You should be able to shoot someone who tries to blind you with a laser pointer.",
                "author": "ModsAreCucked"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "@POTUS : \"He got a prize for doing nothing... He got elected, and they gave it to Obama for doing absolutely nothing but destroying our country... Obama was not a good president.\"",
        "score": 1395,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Obama greased the skids for Sleepy Joe. He also ran the entire administration from just down the street. We need to put Obama on trial for treason/sedition. Dude was born in Indonesia.",
                "author": "BlackPiIIedMAGA"
            },
            {
                "raw_content": "Yeah, if you love Obama or hate him, you have to admit honestly to yourself that he did not deserve the award. He hadn't done shit, just got elected. The idea that you can receive such an honor for just getting elected to office while black, demeans every other Nobel laureate.",
                "author": "Taylor3006"
            },
            {
                "raw_content": "0bama was nominated for the \"prize\" before he was even inaugurated. It was literally IMPOSSIBLE for 0bama to have done anything at all. He got the prize because he's black. It was a racist, pandering prize.",
                "author": "TrumpyMadeThemGrumpy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "It’s Letitia’s Turn",
        "score": 875,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Oh I'm so wet now smfh",
                "author": "MAGAGIRL69"
            },
            {
                "raw_content": "Can't wait to see how many friends this bitch doesn't have.",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "I don't know about you guys but I fuckin love these sombrero memes.",
                "author": "Stansdad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Who's next?",
        "score": 1663,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I want all of them to be indicted and face actual justice, not just be let off with a slap on the wrist.",
                "author": "DManthey"
            },
            {
                "raw_content": "Demonic freak Peter Stzrok and deranged Jack Smith .",
                "author": "TrumpAndGodWin"
            },
            {
                "raw_content": "Great Halloween movie to watch 😎",
                "author": "Tabascocat12"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Just wanted to tell everyone the great news. I survived my surgery. Big headache.",
        "score": 727,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Get well soon. 👍",
                "author": "MEME-SUPREME"
            },
            {
                "raw_content": "Praying for you brother. God please bless KungPaoMcChicken as he makes his recovery and let him find peace and good health. We ask this through Christ our lord, amen 🙏",
                "author": "Zskills"
            },
            {
                "raw_content": "🙏🏻🙏🏻🙏🏻 feel better brother",
                "author": "Bongos"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "No one is above the law.",
        "score": 1388,
        "text_content": "",
        "comments": [
            {
                "raw_content": "She will blame Whitey before morning",
                "author": "Sea_Still"
            },
            {
                "raw_content": "LOCK HER YUGE ASS UP!!",
                "author": "eclectic22"
            },
            {
                "raw_content": "Please Mr. President. Post this with her wearing a sombrero.",
                "author": "ImpeachThisBitch"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "On his Desk, President Trump had a 3D Model for a Triumphal Arch on the National Mall",
        "score": 1299,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is planned it in celebration of when Los Angeles goes back to being English speaking or for when Dearborn goes back to being Christian?",
                "author": "RINO_fatigue"
            },
            {
                "raw_content": "Very cool. I want Trump to leave as big of a thumb print on this nation as possible and that includes statues, monuments and structures as well as his policy legacy. Hell, I want his face on Mt. Rushmore. I want to be reminded of the Golden GEOTUS days, by as many things as possible, forever.",
                "author": "SALTYinSeattle"
            },
            {
                "raw_content": "L'arc de Trump.",
                "author": "Mamapedia"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"BREAKING - Residents in Dearborn, Michigan are now pleading for action over Muslim prayer calls echoing through neighborhoods five times per day\"...",
        "score": 800,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Find the speakers, destroy them. Hell, find the speakers and get a can of foaming wasp spray and blast it into them. Get active, it won't stop otherwise.",
                "author": "PsychoDodo"
            },
            {
                "raw_content": "churches must start their bells at the same time as the Muslims. problem solved",
                "author": "DenturesNancy"
            },
            {
                "raw_content": "Find a disturbing the peace ordinance on the books and demand enforcement.",
                "author": "MrMcGreenGenes"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Farmers in northern Israel have now carved out a MASSIVE message in their fields - \"NOBEL 4 TRUMP\". Friday the 10th is Nobel Prize announcement, millions of people around the world vouch for Trump!",
        "score": 1700,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The Nobel Peace Prize has been worthless for awhile. The Nobel Prize for other things still hold value.",
                "author": "SubmarineGuy"
            },
            {
                "raw_content": "And farmers in the US are writing \"stop giving all of our money to sand people that hate us\" on their fields.",
                "author": "kek-is-tan"
            },
            {
                "raw_content": "When they gave it to Barry for being a mulatto with the most drone kills of civilians, it kinda lost it's value.",
                "author": "AlexPKeaton"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Intel's open source future in question as exec says he's done carrying the competition",
        "score": 411,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The Reg has two titles, as they are wont to do. Google’s index has the other one: >Intel rethinking how it contributes to open source community https://imgur.com/a/t1eChZE",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": "Do they contribute to any significant projects in ways that aren't just optimizations for their hardware? I was looking through their open source contributions page and most of it seems to fall in this category. If the above is true, what the fuck are you carrying? You can choose to let your products run like shit but don't act like you're carrying open source just because you don't want to be left in the dust on major projects.",
                "author": "Therabidmonkey"
            },
            {
                "raw_content": "It's a bad statement, but I read it less as being about the carrying the competition and more about Intel failing to get what it wants out of its investments",
                "author": "Limited_Distractions"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Logitech will brick its $100 Pop smart home buttons on October 15",
        "score": 148,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Your daily reminder not to buy things that \"need\" to connect to the internet unless you intend to use them to read the internet. Because it always ends like this.",
                "author": "INITMalcanis"
            },
            {
                "raw_content": "> As an attempt at compensation, Logitech gave affected customers a coupon for 15 percent off some Logitech products, including its Ultimate Ears speakers. The coupon is only valid in the US until March 31, 2026, and doesn't apply to Logitech’s Pro or RS racing wheels for gaming, videoconferencing products, its Logitech for Business line, or \"newly released products,” according to the email. Logitech: We're sorry to brick your devices that you paid for. But we'll make it up to you by asking you to spend more money on our products which we may or may not brick at a later date too.",
                "author": "Schnitzel725"
            },
            {
                "raw_content": "They are called smart buttons because they teach you a lesson.",
                "author": "DeliciousIncident"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel announces XeSS 3 with XeSS-MFG \"Multi Frame Generation",
        "score": 79,
        "text_content": "\"The company also outlined upcoming shader precompilation support through Microsoft’s Advanced Shader Delivery system. This will allow Intel’s drivers to download precompiled shaders from the cloud, reducing first-launch stutter and improving loading times.\"",
        "comments": [
            {
                "raw_content": "Thanks to r/IntelArc for spoiling this. Sarcasm aside, this is cool to see. Though, parts of me somewhat feel slightly disappointed that there isn't an update to the upscaler as DLSS4/FSR4 have leap frogged Intel. As for supporting MS Advanced Shader Delivery, this is great to see. [AMD ](https://www.amd.com/en/resources/support-articles/release-notes/RN-RAD-MS-AGILITY-SDK-25-10-07-01.html)have already started to test it, to be specific, enable it for future support. That said, I feel much more confident in Intel's cadence in driver updates than AMD lol, but with the [Asus Xbox handheld](https://devblogs.microsoft.com/directx/introducing-advanced-shader-delivery/), it seems at least for Z2 products they'll be getting these precompiled shaders consistently... hopefully?",
                "author": "Noble00_"
            },
            {
                "raw_content": "Support for Alchemist and Xe1 as well, surprising to see but welcome.",
                "author": "RHINO_Mk_II"
            },
            {
                "raw_content": ">This will allow Intel’s drivers to download precompiled shaders from the cloud, reducing first-launch stutter and improving loading times.\" Has anyone actually agreed yet how this will work? I thought all this was up to this point was some proposal, but is anyone actually building the software, and hosting the service?",
                "author": "bubblesort33"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "RISC-V set to announce 25% market penetration — open-standard ISA is ahead of schedule, securing fast-growing silicon footprint",
        "score": 46,
        "text_content": "",
        "comments": [
            {
                "raw_content": "One other key part of RISCV is that it potentially end-runs US export laws. In many chips (STM32 included) there are little bits here and there with licences from US companies; not just ARM. Things like the encryption. This then puts the product under \"arms control\" and other US bullying. RISCV is a huge opportunity to end run this abuse. Also, I really don't trust anything where the US and encryption overlap. I don't really trust anything where china and encryption overlap either; so my question is: How long before companies like ST start making RISCV chips?",
                "author": "LessonStudio"
            },
            {
                "raw_content": "zero presence in consumer products main processors. only thing RSIC V is doing is allowing companies to skirt royalties on co-processors, networking chips and such which benefits some companies but hurts others obviously. our only hope is China making anything high performance from RISC V. probably benefits large companies more so than smaller ones. small companies literally do not have the resources to develop their own RISC V cores, but some small companies might have legacy IP. and large companies dont have to license such legacy IP when they can just have their own RISC V cores RISC V was introduced 11 years ago, if by the end of this decade we see no consumer application in high performance then it might as well not exist from a consumer standpoint",
                "author": "Quatro_Leches"
            },
            {
                "raw_content": "Hello 3G6A5W338E! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel Unveils Panther Lake Architecture: First AI PC Platform Built on 18A",
        "score": 184,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I was interested in power consumption. Their press release mentions www.intel.com/performanceindex but it does have nothing on Core Ultra 3.",
                "author": "ElementII5"
            },
            {
                "raw_content": "This is where I miss anandtech and Ian’s analysis. :(",
                "author": "remnant_x"
            },
            {
                "raw_content": "Interesting how they are managing power and scheduling on the platform, looks like they're tired of Windows messing up the core scheduling and are using internal tools to shove loads onto cores themselves. They're confident enough it's better that they mentioned getting rid of power profiles. That doesn't totally make sense to do, sometime you have to limit power consumption even if performance takes a massive hit, but clearly they think they've made a ton of progress in optimizing which load goes where.",
                "author": "grumble11"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[TPU] Intel Panther Lake Technical Deep Dive",
        "score": 95,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So far the most interesting thing to me is this [https://tpucdn.com/review/intel-panther-lake-technical-deep-dive/images/dies.jpg](https://tpucdn.com/review/intel-panther-lake-technical-deep-dive/images/dies.jpg) Seeing the scalability of configs. AMD playbook of min/maxing for your die yields. While at first to me it seems there is a lot of variances in tiles, I think it's an easy decision for Intel to make for the large market that they own in laptops and supply",
                "author": "Noble00_"
            },
            {
                "raw_content": "I'm less interested in the impossible-for-end-users iso-**perf** comparisons and instead glad to see Intel's iso-**power** comparisons. +10% 1T perf at similar power is good: at least there are no regressions with PTL. Expect every Windows OEM to push 1T power to the maximum Intel allows → in the end, PTL 1T is the same power as LNL with +10% perf. // This video has a great explainer why [iso-perf often exaggerates the improvements](https://youtu.be/V3rMVyAKsLI?t=211) in the final product. Even with \"40% less power at iso-perf!\", expect products \\~10% more 1T perf at the same power. Now, if users could easily *choose* a maximum power (W) like we do with dGPUs, then iso-perf comparisons are much more interesting because now you can fully exploit the generational gains.",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": "10% ST jump vs LNL Power efficiency jump is quite good 30-40% vs LNL/ARL. Gives some breadcrumbs 18A has some frequency issues. But at less than max frequency it's very power efficient vs TSMC N3B in those products",
                "author": "SlamedCards"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Is the Sand Thinking? Intel's 18A process at Fab52 w/ Panther Lake and Xeon 6+ Preview",
        "score": 13,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Battlefield 6, 43 GPUs Benchmark @ 1080p, 1440p & 4K",
        "score": 66,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'd love to see a CPU benchmark for this one.",
                "author": "Paraphrasing_"
            },
            {
                "raw_content": "Pretty amazing what the devs managed with medium settings.",
                "author": "Felatio-DelToro"
            },
            {
                "raw_content": "BF6 seems to love Blackwell. The 5070 and 5070 TI look really impressive and you can even see one of the most polarizing GPU's the 5060 TI 16gb matching the regular 4070 and 3080.",
                "author": "dororodo30"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel’s Panther Lake has dual-antenna Bluetooth and Auracast support",
        "score": 25,
        "text_content": "Intel’s latest mobile platform (Panther Lake/Core Ultra Series 3) integrates Wi-Fi 7 and Bluetooth Core 6.0 and debuts a dual-antenna Bluetooth design that uses both laptop antennas to boost range and link robustness—Intel’s wireless CTO even cited ~52 meters in demos—while also adding native support for Auracast, the Bluetooth LE Audio broadcast feature that lets one PC stream a synchronized audio program to many receivers (earbuds, headsets, or hearing aids) without traditional pairing. In practice, the dual-antenna path helps Auracast casts hold steady in congested 2.4 GHz environments and across larger spaces, and LE Audio’s efficient LC3 transport keeps latency and power in check for multi-listener scenarios at home or in public venues. Intel has also showcased Auracast experiences on its Evo ecosystem, underscoring the push toward simple, multi-device listening and accessibility use cases on upcoming Intel-based laptops.",
        "comments": [
            {
                "raw_content": "Yeah I heard about this. Finally.",
                "author": "Some-Following-392"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "As a 3D platformer fan, I love the Switch 2",
        "score": 1584,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Same for me with JRPGS. Filled to the brim with them at the moment.",
                "author": "rockland_beaumont"
            },
            {
                "raw_content": "Nintendo is the king of 3D platformers, they have so many quality hits over the years.",
                "author": "mlvisby"
            },
            {
                "raw_content": "Before the top comment is “only one of these is technically ‘new’”, yes, I know, but let me have my moment",
                "author": "NinBendo1"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Playing through Cyberpunk for the first time on Switch 2 and it’s crazy a game like this can run on it. Excited to see the console pushed to its limits in a few years.",
        "score": 407,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Check out Star Wars Outlaws. It’s even more impressive technically.",
                "author": "Sandy12315"
            },
            {
                "raw_content": "Am I wrong for thinking it’s already being pushed to its limit?",
                "author": "djrayhasmusic"
            },
            {
                "raw_content": "Loving it so far, but there’s no game of similar appeal coming any time soon, sadly.",
                "author": "Moose2157"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Final Fantasy VII / VIII / IX Switch physicals are releasing in North America on Dec 9th",
        "score": 175,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I was always fascinated by FF8 as a kid, but never got to play it. Would it be worth visiting now?",
                "author": "ThrustersOnFull"
            },
            {
                "raw_content": "Ooh this can go alongside my Pixel Remaster to have 1-9. 10 is already on it too right?",
                "author": "Susurrus03"
            },
            {
                "raw_content": "I'll never understand square release strategies these have been out for years in Japan and now they randomly decided to have a us release",
                "author": "Sky_Rose4"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "what do you guys think of the Xenoblade games???",
        "score": 61,
        "text_content": "It's the only major Nintendo franchise I never touched. To be frank, I started looking into them when 3 came out and when I saw each game is at minimum 60 hours, I got scared. It seems like a lot. However, I love the aesthetics and the music (I listen to the first game's OST consistently having never played it), and I like RPGs unless they are super grindy for a casual playthrough (wont go for 100% so if its grindy then it doesnt matter) what do you guys think?? I dont have a lot of time. Are the games worth playing? Do you like them? Where do I start? Do I just play XC1 and commit to only the first one and go from there? Is the entire trilogy a must? Really any takes are welcome, games are expensive which is why I ask for opinions",
        "comments": [
            {
                "raw_content": "I love the Xenoblade games. I think most people who enjoy JRPGs would enjoy them. I just wish they would get Switch 2 updates already.",
                "author": "DJ_Lionheart"
            },
            {
                "raw_content": "Xenoblade is definitely not grindy if anything it’s way too easy to get over leveled by just playing the game tbh. The main issues with Xenoblade is how often exploration is broken up with story cutscenes (at least for me) but I’m sure people like how guided they are. It’s a fantastic series overall",
                "author": "HoxpitalFan_II"
            },
            {
                "raw_content": "I bought switch 1 to play xenoblade 3. My top-1 game ever. That what i think) Ideally, it’s best to start with the first game, but you can totally jump into the third one, for example. If you end up liking it, you can then go back and play the first and second games - and only after that, move on to the DLC for part three. If we don’t count the DLC, each entry is essentially a standalone game with its own mechanics and even its own story, though there *is* an overarching plot that connects them. Xenoblade X is a separate game entirely — you can either start the series with it or finish with it. But in my personal opinion, Xenoblade X ranks last among all four titles. HOWEVER! It’s still a very, VERY cool game. All in all, if you enjoy JRPGs with deep storytelling and an awesome combat system, you definitely won’t regret diving in.",
                "author": "xKoDu"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Error code 2016-2430: Too many downloads!",
        "score": 18,
        "text_content": "I finally got a 1 TB card for my Nintendo Switch 2, so I started redownloading all my games that wouldn't fit in the internal storage. I eventually got what appears to be an undocumented error: 2016-2430. I had some downloads pending, but this message occurred whenever I tried to add another game to the queue, no matter the game. I had a suspicion, so I waited until the next notification I received that a download had completed. I then tried again — and I was able to add another game to the queue! But just one — at least until another one finished. IOW, the number of queued downloads is capped, probably at a hundred (per the iOS notification I received). (This error occurred only on the Virtual Game Cards screen; if I was viewing my games library \\[from the \"Show More\" icon on the home screen\\] and tried downloading there, I'd just get stuck in a loop of being prompted to download a game until I hit \"Cancel\".) I waited for a bunch of downloads finish, then I queued the remainder.",
        "comments": [
            {
                "raw_content": "This code seems to be specific to microSD card usage, but is a subcode that isn't documented anywhere, as you mentioned. 2016 is the error code for most microSD card issues, with subcodes appended for the specific cause of the error. It could be that the limit is actually 100 concurrent microSD installs, or that the 100 download limit is system wide but it's almost impossible to do 100 installs within the Switch/Switch 2 base storage amounts. Maybe the error is triggered from the microSD install path in this case, but throws an \"unexpected error\" subcode because it wasn't specifically handled by the devs. Always interesting to see edge cases that no one expected to be reached be tested by end users. A reminder to devs that no matter how remote the possibility is of an edge case actually being tested, the end user will somehow find a way.",
                "author": "nftesenutz"
            },
            {
                "raw_content": "Isn't Pac-Man 99 dead.",
                "author": "LynxyShinx"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Amazon France has lowered the price of Switch 2 to €419 and the Switch 2 + Mario Kart World bundle to €469 [Shipping to all of Europe]",
        "score": 9,
        "text_content": "Switch 2: https://www.amazon.fr/Nintendo-Switch-Mario-Kart-World/dp/B0F2J4SYJ2 Switch 2 Mario Kart World bundle: https://www.amazon.fr/Nintendo-Switch-Mario-Kart-World/dp/B0F2JCL3NZ Shipping in all of Europe for less than €10. Probably the best deal in the continent right now.",
        "comments": [
            {
                "raw_content": "Thats more expensive than it is in the us currently",
                "author": "hsong_li"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "30% owners discount for yooka replaylee is not available on switch 2.",
        "score": 290,
        "text_content": "From the pics you can see i own the original but the 30% owners discount isn't available on the eshop. Only the 10% launch discount is available.",
        "comments": [
            {
                "raw_content": "It's only available in Nintendo of America regions for Switch 2 users. Those outside of those regions don't get the 30% discount.",
                "author": "Critic97"
            },
            {
                "raw_content": "https://preview.redd.it/1qq4c3l912uf1.png?width=1080&format=png&auto=webp&s=e477304389747a84c605e994c85714df672450be According to playtonic the reason other regions for switch 2 don't have owners discount is because other regions don't support this type of discount. That is a lie because that type of discount has happened in my region several times, an example i can give right now is yakuza kiwami where i can get the switch 2 version for 7.99 because i own the switch 1 version.",
                "author": "Howwy23"
            },
            {
                "raw_content": "[Seemingly North America only](https://www.reddit.com/r/YookaLaylee/s/YvhC8M4Cjy)",
                "author": "Jaketrix"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Super NES – October 2025 Games Update",
        "score": 233,
        "text_content": "1. Mario & Wario 2. BUBSY™ in: Claws Encounters of the Furred Kind 3. FATAL FURY SPECIAL [https://www.youtube.com/watch?v=13ieq0wTB2E](https://www.youtube.com/watch?v=13ieq0wTB2E)",
        "comments": [
            {
                "raw_content": "I'm just waiting on some GC news we didn't get a game last month.",
                "author": "firebaron"
            },
            {
                "raw_content": "Seeing Fatal Fury and Bubsy is super cool but where is my Luigi's Mansion 1 trailer 😭 It's almost Halloween",
                "author": "Madness-NX"
            },
            {
                "raw_content": "I may be one of the only people in the world excited to see Bubsy here.",
                "author": "crocicorn"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Kepler2 - PlayStation 6 Release Locked for 2027, “Not Just on the Table, It’s the Plan,”",
        "score": 474,
        "text_content": "Replying to a comment that said the PlayStation 6 releasing in 2027 “is on the table,” Kepler replied, “Not just on the table, it’s the plan unless any unexpected delays happen.” Source - https://www.neogaf.com/threads/from-project-amethyst-to-the-future-of-play-amd-and-sony-interactive-entertainment’s-shared-vision.1688947/page-4#post-270885018 https://thegamepost.com/playstation-6-release-2027-sony-amd-project-amethyst/",
        "comments": [
            {
                "raw_content": "Nice can't wait to play ps5 games remastered on the ps6",
                "author": "James_bd"
            },
            {
                "raw_content": "Due to how messed up the global economic situation is I bet both Sony and MS have multiple \"plans\".",
                "author": "ResponsibleTrain1059"
            },
            {
                "raw_content": "Too soon imo with how anemic this gen has been",
                "author": "Zoeila"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "According to Actress Salóme Gunnarsdóttir there is no Silent Hill 2 Remake DLC in the works.",
        "score": 242,
        "text_content": "Actress Salóme Gunnarsdóttir who portrayed Maria and Mary is currently livestreaming the game. When asked about Born From A Wish she claimed that she wasn't contacted about it. https://www.reddit.com/r/silenthill/s/OwiwnGgXiP",
        "comments": [
            {
                "raw_content": "Not saying it will happen, but NDAs",
                "author": "Lordy_De"
            },
            {
                "raw_content": "Well, might be true or might be a voice actor who can actually keep their mouth shut and not spoil unnanouced stuff.",
                "author": "Correct_Refuse4910"
            },
            {
                "raw_content": "I am not saying it absolutely is happening and I know VAs leak shit all the time but she could just actually be sticking to her NDA and lying about recording for a DLC.",
                "author": "Decimator1227"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "AMD Magnus (Xbox Next Gen) APU Full Leak",
        "score": 498,
        "text_content": "https://youtu.be/X_pjrZQDerw?si=IMSrOW991BvDFUAu Summary: AMD Magnus APU, which is slated for the next-generation Xbox console, targeting a 2027 launch. This APU is described as the largest ever used in a gaming console, boasting a significant 408 mm² die size composed of two chiplets, including a 264 mm² GPU die shared with desktop RDNA 5 products. The leaker suggests that this expensive hardware, which could result in a console costing over $800, signifies a strategy by Microsoft to position the new Xbox as a PC console hybrid that can run a version of Windows, potentially challenging the broader PC gaming market. The discussion covers specific technical specifications, such as three Zen 6 cores and eight Zen 6C cores, up to 48GB of GDDR7 RAM, and an integrated 110 TOPS NPU",
        "comments": [
            {
                "raw_content": "OP you should've said the name of the source somewhere in your post #**Moore's Law Is Dead (MLID) is Tier 5 - Pretty Much Clickbait** >This tier is for leakers who are almost never correct and potentially just make things up. Anything they claim should be taken with a grain of salt.",
                "author": "ChiefLeef22"
            },
            {
                "raw_content": "Launches at $849 1 year later: $999 5 years later $1199 with an all new galaxy look!",
                "author": "dmckidd"
            },
            {
                "raw_content": "Man MS probably leaked this on purpose to get people off their backs bout exiting hardware so that people continue to feel ok with buying games on Xbox",
                "author": "000extra"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Kang & Kodos Fortnite glider leaked ahead of The Simpsons season next month",
        "score": 115,
        "text_content": "https://xcancel.com/ShiinaBR/status/1976199725121716706",
        "comments": [
            {
                "raw_content": "\"Can you believe it kodos? They left us out of the battle pass!\"",
                "author": "nicksuperdx"
            },
            {
                "raw_content": "That is certainly a sentence if i've ever seen one",
                "author": "TechnicalTip6578"
            },
            {
                "raw_content": "Nothing beats my Petercopter! *Hehehehehe*",
                "author": "LtRapman"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Becomes the First to Produce the World’s Most Advanced Chips in the US; Announces Fab 52 to Be Fully Operational For Cutting-Edge 18A",
        "score": 242,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good job, Pat.",
                "author": "arko_lekda"
            },
            {
                "raw_content": "Thanks Pat!",
                "author": "ACiD_80"
            },
            {
                "raw_content": "Competition is good for consumers. I want Intel to succeed so we have options based on our needs. Right now AMD is just kicking Intel to the ground. I want both to be an option so cost stays down.",
                "author": "Cradenz"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel announces XeSS 3 with XeSS-MFG \"Multi Frame Generation\"",
        "score": 91,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Precompiled shader distribution is pretty terrific.",
                "author": "battler624"
            },
            {
                "raw_content": "I really amazed by Arc engineering team, they are fast at implementing new features to catch up Nvidia features while Amd still figuring out.",
                "author": "no_salty_no_jealousy"
            },
            {
                "raw_content": "I really hope the NVIDIA investment doesn't destroy Intel's world into dGPU stuff, because their engineering team must be excellent to adopt this kind of technology so quickly.",
                "author": "Killercoddbz"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel Xe3 Graphics Official: Over 50% Faster Than Xe2, Enhanced RT Units, 12 Xe Cores For Panther Lake \"Arc B-Series\" iGPU & Xe3P Successor For Next-Gen Arc",
        "score": 52,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Despite the vast improvement more Xe3 cores than we saw Xe2 cores in Lunar Lake, we're only seeing minor gains in average framerate performance at the same wattage based on the internal benchmark, though there are much more meaty improvements in the 1% lows. I guess its bottlenecked by its RAM bandwidth. Also I'm sure Xe3 will scale better beyond 17W. I wonder how the 4 Xe3 SKUs will fare, that's a good way of knowing how much RAM bandwidth affects things.",
                "author": "Johnny_Oro"
            },
            {
                "raw_content": "The problem is how much is the price?",
                "author": "IGunClover"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel Unveils Panther Lake Architecture: First AI PC Platform Built on 18A",
        "score": 49,
        "text_content": "",
        "comments": [
            {
                "raw_content": "just tested 13 games on 14700k vs 9800X3D and this is how it was system specs 14700k+DDR5 7200+Z790 STRIX-E 9800X3D+DDR5 6000+X870E STRIX-E [https://www.youtube.com/watch?v=RuhXQX1JReY](https://www.youtube.com/watch?v=RuhXQX1JReY) The YouTube video looks a bit blurry, I made it using a free program. I’ve uploaded the screenshots to Twitter (X) if you want to see them in better quality. [https://x.com/factsseeke6738](https://x.com/factsseeke6738)",
                "author": "SelfSilly9478"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel Announces Xeon 6+ For Clearwater Forest CPUs",
        "score": 26,
        "text_content": "",
        "comments": [],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel Showcased Panther Lake & Xe3 Graphics At Tech Tour Arizona 2025",
        "score": 23,
        "text_content": "",
        "comments": [],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel's New GPU: Xe3 Architecture Changes, Handheld Gaming CPUs, & XeSS3",
        "score": 15,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Thanks Steve",
                "author": "Atretador"
            },
            {
                "raw_content": "I'm not impressed. The 12EU gpu core should also be paired to the 4+4 CPU tile for a handheld unit. The beefy CPU tiles often eat into GPU power budget. Steam Deck is a good example where less cpu and more GPU pay off by maximizing 15W performance. vs the strix halo 16 cpu core having awful performance below 20w",
                "author": "PsyOmega"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD discusses Next-Gen RDNA tech with Radiance Cores, Neural Arrays and Universal Compression",
        "score": 178,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why are mods deleting everything? This is not an AMD site. lol",
                "author": "Dante_77A"
            },
            {
                "raw_content": "Video that the article is based on: https://www.youtube.com/watch?v=ItXPvGrI6gY&t=2s",
                "author": "Darksider123"
            },
            {
                "raw_content": "NGL radiance cores sounds pretty cool",
                "author": "Savage4Pro"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD CEO confirms Instinct MI450 uses 2nm process technology",
        "score": 360,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What is this? AI for ants?",
                "author": "chibiace"
            },
            {
                "raw_content": "100% marketing BS “ The term \"2 nanometer\", or alternatively \"20 angstrom\" (a term used by Intel), has no relation to any actual physical feature (such as gate length, metal pitch or gate pitch) of the transistors. According to the projections contained in the 2021 update of the International Roadmap for Devices and Systems published by the Institute of Electrical and Electronics Engineers (IEEE), a \"2.1 nm node range label\" is expected to have a contacted gate pitch of 45 nanometers and a tightest metal pitch of 20 nanometers.[1] Process Gate pitch Metal pitch Year 7 nm 60 nm 40 nm 2018 5 nm 51 nm 30 nm 2020 3 nm 48 nm 24 nm 2022 2 nm 45 nm 20 nm 2025 1 nm 42 nm 16 nm 2027 As such, 2 nm is used primarily as a marketing term by the semiconductor industry to refer to a new, improved generation of chips in terms of increased transistor density (a higher degree of miniaturization), increased speed, and reduced power consumption compared to the previous 3 nm node generation.[2][3]”",
                "author": "spencer2294"
            },
            {
                "raw_content": "I wouldn't be surprised if Nvidia still had more perf/watt on a slightly older (and cheaper) node. Hopefully AMD can make some architectural gains to pull ahead with a better node instead of just barely getting to a tie.",
                "author": "HatBuster"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD ROCm7 + Pytorch 2.10 Huge Performance Gains - ComfyUI | Flux | SD3 | Qwen 2509 | OpenSUSE Linux",
        "score": 42,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "I am not smart about the economy but this seems bad",
        "score": 111,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There are cities in Texas with less than 100k population that have more homes for sale than all of North East..",
                "author": "Dmoan"
            },
            {
                "raw_content": "should see those down about $100k ok avg before we’re done",
                "author": "NoviceAxeMan"
            },
            {
                "raw_content": "Austin is just hitting the next part of the real estate cycle. It's shifting into a buyer's market after years of being hot. It's not inherently bad for the economy but of course there will be immediate negative impacts for sellers. Long term though, it can help stabilize things.",
                "author": "SylviaAmer"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Fed Officials Discussed Risk of Housing Market Collapse at Recent Meeting to Cut Interest Rates",
        "score": 210,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The FED trying to solve a problem they created.",
                "author": "ohhellnaah"
            },
            {
                "raw_content": "This is what Fed presidents and elected officials are all most afraid of. Why? Because there’s an awful lot of debt on the books that says “these values are fine”. And that debt is wrapped up inside other instruments, and large bets are placed on those instruments keeping their valuations. Forget unemployment. Forget inflation. Forget elections even. It’s about the whole house of cards.",
                "author": "HartbrakeFL21"
            },
            {
                "raw_content": "[deleted]",
                "author": "None"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Five New Polls Show 70% of Americans Are Pessimistic on the Economy",
        "score": 129,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If you're not pessimistic about the economy, you're not paying attention.",
                "author": "ThisKarmaLimitSucks"
            },
            {
                "raw_content": "Evidence that about 30% of Americans are not on the ball continues to mount",
                "author": "Dapper_Mud"
            },
            {
                "raw_content": "And yet the top 10% is spending like there is no tomorrow.",
                "author": "gk_instakilogram"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "China's property slump this year is looking much worse than expected, S&P says",
        "score": 4,
        "text_content": "",
        "comments": [
            {
                "raw_content": "China's massive economic slowdown is making the US's look tame by comparison. Either way, the world is headed for a global recession.",
                "author": "Deadpools_Boxers"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "More Home Sellers Test the Market, But Buyers Aren’t Budging",
        "score": 68,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There’s been an influx of half flipped shit boxes on the market in my area for what it’s worth. I think “investors” might be on edge. I look forward to winter.",
                "author": "poorat8686"
            },
            {
                "raw_content": "I'm not in the mood to make someone else rich right now...",
                "author": "Different-Celery-461"
            },
            {
                "raw_content": "Great insight from the article: we sold for $15k less than the list price! Great it was prob listed for $750k and was only worth $400k a few years ago. Keep on dropping.",
                "author": "dbtdub"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Homeowners Are Pouncing on the Tiniest Drop in Mortgage Rates",
        "score": 34,
        "text_content": "",
        "comments": [
            {
                "raw_content": "My friend’s neighbor refinanced twice already in past two years just to take advantage of every small dip in rate 🤦‍♂️ We need teach people how mortgage amortization works before they are allowed to refinance..",
                "author": "Dmoan"
            },
            {
                "raw_content": "\"Beat dog cries tears of joy during slightly lesser beating\"",
                "author": "GreyNoiseGaming"
            },
            {
                "raw_content": "Reminder that more buyers run rn investors than ever before",
                "author": "Frienderlyy"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Introducing Figure 03",
        "score": 1430,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Phew! It didn't open the Mac and start doing Grapic Design work.",
                "author": "Maximum_Deer5151"
            },
            {
                "raw_content": "If this isn't HEAVILY leveraging tricks, it is by far the most impressive robot. I want to see it operating live in front of people though.",
                "author": "Ambiwlans"
            },
            {
                "raw_content": "Man, the use cases are starting to pile up! That's a lot of improvement from figure 02!",
                "author": "torb"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Microsoft unveils the first at-scale NVIDIA GB300 NVL72 cluster, letting OpenAI train multitrillion-parameter models in days instead of weeks",
        "score": 54,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Multi trillion? GPT6 in 2027 here we come.",
                "author": "Anen-o-me"
            },
            {
                "raw_content": "Does anyone have a good comparison of this vs other supercomputers? Everyone says theirs is the biggest and best, but I can’t find any good comparisons",
                "author": "Mindless-Lock-7525"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Will Smith eating spaghetti - 2.5 years later",
        "score": 130,
        "text_content": "",
        "comments": [
            {
                "raw_content": "will smith eating spaghetti, the eternal benchmark.",
                "author": "tlnayaje"
            },
            {
                "raw_content": "In 2030 you will BE Will Smith eating the spaghetti",
                "author": "allthatglittersis___"
            },
            {
                "raw_content": "It’s incredible how AI has helped poor Will Smith learned to eat spaghetti.",
                "author": "Mbando"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Figure 3 Gets a Time article - In depth look into the state of humanoids",
        "score": 366,
        "text_content": "**Article:** [https://time.com/7324233/figure-03-robot-humanoid-reveal/](https://time.com/7324233/figure-03-robot-humanoid-reveal/) **Youtube interview:** [https://m.youtube.com/watch?v=4ZP943-gARQ ](https://m.youtube.com/watch?v=4ZP943-gARQ%C2%A0)",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/7gr7auvyi5uf1.jpeg?width=1170&format=pjpg&auto=webp&s=a5c26d1a25d5e07be96733755987fffd0d47ab95 Definitely my biggest takeaway. This is brand new and the hardware hasn't had that much time. But from the demo it still looked ok so I kinda believe the 2026 claim for home use.",
                "author": "Anxious-Yoghurt-9207"
            },
            {
                "raw_content": "I dont know when the prices of these will be public, I guess can start at $50000 or something? I think at that price very few will buy, but eventually something like 10K?",
                "author": "BalancedCivil"
            },
            {
                "raw_content": "Wow, this is pretty in depth.",
                "author": "Academic_Battle1217"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Figure doing housework, barely. Honestly would be pretty great to have robots cleaning up the house while you sleep.",
        "score": 30,
        "text_content": "",
        "comments": [
            {
                "raw_content": "My poor poor robot. He is struggling",
                "author": "bimbalum_bambam"
            },
            {
                "raw_content": "This is seriously impressive",
                "author": "gerredy"
            },
            {
                "raw_content": "\"Barely\" now will be \"extremely well\" in a couple of years. I'm hyped",
                "author": "DeterminedThrowaway"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini deepthink achieves sota performance on frontier math",
        "score": 235,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Love the tier 4 progress, would like to see GPT-5 Pro tested on it",
                "author": "socoolandawesome"
            },
            {
                "raw_content": "Gemini 3 deep think is going to slap",
                "author": "AverageUnited3237"
            },
            {
                "raw_content": "Math as a whole might fall to AI before 2030.",
                "author": "FarrisAT"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "New ARC-AGI SOTA: GPT-5 Pro - ARC-AGI-1: 70.2%, $4.78/task - ARC-AGI-2: 18.3%, $7.41/task",
        "score": 203,
        "text_content": "",
        "comments": [
            {
                "raw_content": "o3 preview 4%, around 200$/task GPT5 Pro 18.3%, 7.41/task Insane It hasn't even been a year. I do wonder why that same GPT5-Pro isn't able to do better than o3 preview on ARC-AGI 1 though",
                "author": "Bright-Search2835"
            },
            {
                "raw_content": "Did J. Berman eat $50 worth of bananas to finish the task?",
                "author": "Working_Sundae"
            },
            {
                "raw_content": "We're getting close to the grand prize Though still lots of progress to be made on ARC-AGI-2",
                "author": "Mindrust"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "I hate how fragile the human body is",
        "score": 26,
        "text_content": "I get pretty bad anxiety thinking about how fragile my body is and how vulnerable my life is from moment to moment, either from outside or within something could go terribly wrong and thats just it...im done for, i hope AI helps usher in a new age for biotechnology and makes me feel a little less fragile and maybe even more fixable...",
        "comments": [
            {
                "raw_content": "I, too, crave the certainty of steel.",
                "author": "unskippableadvertise"
            },
            {
                "raw_content": "Would be nice. One injury has sent my entire life tumbling downhill where I often consider what even is the point",
                "author": "Right_Turnover490"
            },
            {
                "raw_content": "We're gelatinous, only the skeleton offers any resistance. If only we had exoskeletons, we'd feel more secure.",
                "author": "OniblackX"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Figure 03 was only ready a week before the demo?!",
        "score": 75,
        "text_content": "Actually insane if this is true, they've had zero time with the hardware. Makes me want to believe the claim of house-use for 03 by 2026 Time: https://time.com/7324233/figure-03-robot-humanoid-reveal/",
        "comments": [
            {
                "raw_content": "I highly recommend everyone to read the article, it is very extensive and easy to read. The most important thing I read was that they have built it so it can't easily fall down. I pretty much gave up owning a robot for now after seeing so many videos of robots falling down, cuz I worry they may squish my cats, but it sounds like it is near impossible for the Figure robot to fall.",
                "author": "TinySmolCat"
            },
            {
                "raw_content": "The article said that the new version, Figure 3, has 90% cheaper parts and is lighter too. Tech advances are happening incredibly fast, which is why the 24 month deployment date described on the article seems plausible. I think there are so many nonstop AI advances that are occurring faster than expected that they will push the timetable for robotics even faster. Remember, a robot can do anything physical a human does, it is all software now, and LLMs are advancing fast",
                "author": "TinySmolCat"
            },
            {
                "raw_content": "Give it a few years for those Japanese 8k skin prints to go main stream with these robots and you'll have your Ex Machina in no time!",
                "author": "PigOnPCin4K"
            }
        ],
        "subreddit": "singularity"
    }
]