[
    {
        "post_name": "Luigi Mangione got beaten up by 7 ‘ladyboys’ in Thailand months before UnitedHealthcare CEO shooting",
        "score": 781,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Bet he tried to leave without paying.",
                "author": "Girthquakes"
            },
            {
                "raw_content": "Did he end up in the hospital? Did United Health pay the cost of treatment?",
                "author": "HumphreyPlowjogger"
            },
            {
                "raw_content": "I've been to Thailand... Anyone who tells you they \"couldn't tell\" is a liar. Its easy as fuck to see who are ladyboys and who are sexy girls. For one thing, the ladyboys look creepy and not feminine. Secondly, they're so much taller then the girls are.",
                "author": "MAGA9428"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "U.S. Senate Candidate in Nebraska Claims to be an Independent But is Being Bankrolled by Prominent Democrats",
        "score": 763,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The party is so toxic this is what they have left. Keep up the pressure. Out them at every turn.",
                "author": "TheRedPike"
            },
            {
                "raw_content": "Literally know the tracker on the trail of this fake candidate. Osborn's wife is his campaign manager. Tracker's job is to ask questions of Dan anywhere he shows up in public. Dan Osborn is obviously a spoiler candidate meant to pull just enough independent retards away from voting for the Republican. Let me know what gotcha questions you want me to pass on to ask this shitbird and I will run it by management. Your creativity is what makes freedom ring!",
                "author": "BobDolesBanana"
            },
            {
                "raw_content": "Commie faggot.",
                "author": "AwShitHereWeGoAgain"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Only a shitlib would suggest that owning a book in the 1800's implies adoption and/or adherence to the material within. The appeal to \"authority\" fallacy was icing on the cake and a hallmark of their unbridled, hubris-laden retardation.",
        "score": 814,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Gotta know your enemy",
                "author": "TRUMPWON2020BYALOT"
            },
            {
                "raw_content": "Jefferson likely got a Quran to better understand the Muslim Barbary Pirates he sent the US Marines to Destroy...",
                "author": "Moebius"
            },
            {
                "raw_content": "The median IQ of shitlibs must be below room temperature, so books wouldn't do them any good anyway.",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "No Kings Wrap Up!",
        "score": 633,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Link to Ben Garrison cartoon https://gab.com/GrrrGraphics/posts/115413118242152619",
                "author": "I-am-Orlando"
            },
            {
                "raw_content": "\"Mostly PUERILE Protests\" lol another slam dunk by Ben Garrison. A real MVP. Thanks, Ben! u/GrrrGraphics",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Furry got stretched out 🍑💨",
                "author": "makersmarx"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚗 JUST IN: Person just drove a vehicle into barricades of White House complex at 17th and E St NW in Washington, D.C. Area on lockdown. - PenguinSix",
        "score": 556,
        "text_content": "",
        "comments": [
            {
                "raw_content": "there goes another reddit mod",
                "author": "Covidrrhea"
            },
            {
                "raw_content": "Women drivers are the worst.",
                "author": "briantrash"
            },
            {
                "raw_content": "If this retard did not get shot up by the secret service I will be disappointed.",
                "author": "DT170x"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Democrats have a violent history.",
        "score": 1191,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's because they've learned it works because nobody just walks up and shoots them in the face right back.",
                "author": "CLF3"
            },
            {
                "raw_content": "Only problem with this is that John Wilkes Booth was never a Democrat. And then there's the part about how it was the Radical Republicans were the ones who instigated and started the War of Northern Aggression. I don't know why we have to feed into the false history we've been taught to make the point that it is the big government parties who are almost always the violent ones. In the 1860's, it was the Radical Republicans. Today it is most certainly the Radical Left. See a pattern yet?",
                "author": "War_Hamster"
            },
            {
                "raw_content": "What is with all these gay **Democrats are the real racists** posts today? The North was gay, just a bunch of big government snobs and tyrants who wiped their ass with the constitution and rewrote the civil war to be all about muh slavery when it wasn’t. The war could have been avoided if the north simply paid the south for their slaves pursuant to the Takings Clause of the Fifth Amendment, which is what had just happened in England — but that’s never what the war was about. It was about federal government controlling the economy, taxes, and judiciary of the states in the south. It’s what gave us “birthright citizenship.” The South was better. The Civil Rights movement was gay. Just a bunch of communists gaslighting the world into thinking the reason people don’t want blacks in their cities is the “color of their skin,” when it was really their atrociously high crime rates, support for communism, and hostility to America. The Civil Rights movement was the precursor to white genocide, DEI, affirmative action, gay/trans bullshit, cancel culture, Obamaism, Colin Kaepernick, etc We will never make America great again with this type of cuckold propaganda. I’m not ashamed of my ancestors for trying to preserve America as what it was intended to be when it was created.",
                "author": "ModsAreCucked"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Democrat Running For US Senate Has Literal Nazi Tattoo On His Chest",
        "score": 964,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Its (D)ifferent. You see sweetheart that is a symbol of peace and togetherness not like those MAGA nazis. 💅",
                "author": "DT170x"
            },
            {
                "raw_content": "Very much on brand. Did nazi that kkkoming.",
                "author": "Th3Cho0sing0ne"
            },
            {
                "raw_content": "\"He got drunk and had it done and didnt know what it meant\". His story is he was on leave, got drunk then thought it looked cool so he got a tattoo and claims he didn't find out what it meant.",
                "author": "DingleBalls"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Secretary of War Pete Hegseth : EXTENDED VERSION: The Chairman and I felt the need for speed with TOPGUN at Naval Air Station Fallon. Incredible Americans!",
        "score": 694,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Pete Hegseth is the most badass Cabinet member in 𝐀𝐌𝐄𝐑𝐈𝐂𝐀𝐍 𝐇𝐈𝐒𝐓𝐎𝐑𝐘.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "When permission to buzz the tower comes from INSIDE the aircraft.",
                "author": "TDAF"
            },
            {
                "raw_content": "This is hella sick!!!",
                "author": "shrbrn"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Walmart has stopped making job offers to candidates who require H-1B visas.",
        "score": 1444,
        "text_content": "",
        "comments": [
            {
                "raw_content": "GOOD. I have had to show photos to Walmart employees to get help finding a product because they cannot speak or read English.",
                "author": "Perseverant"
            },
            {
                "raw_content": "I would really like to understand more about the hiring practice and why they believe the require H1B employees. I suspect they would need to pay more for Americans. In the case of Walmart, the company is just not very sexy on the resume. I started working at BofA as a Network Administrator, I had better offer but I was building my career, and it held value above salary.",
                "author": "bigbadchows2"
            },
            {
                "raw_content": "and they'll start again as soon as the heat is off of them",
                "author": "MudDog"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "SHOCK: Biden Judge Orders ICE Agent Arrests at Courthouses - Cristina Laila",
        "score": 916,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Do it. And the insurrection act passes.",
                "author": "ChyNahAzzWhole1"
            },
            {
                "raw_content": "The activist judges are encouraging insurrection.",
                "author": "eclectic22"
            },
            {
                "raw_content": "Nignore.",
                "author": "MagnumOpus1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "NEW PRIME MINISTER OF JAPAN MAKES MASS DEPORTATIONS FIRST POLICY - Sanae Takaichi was sworn in and IMMEDIATELY created a ministry for mass deportations",
        "score": 2092,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yeet the pajeets!",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "I support the Japanese ethnostate. Japan for the Japanese!",
                "author": "Zskills"
            },
            {
                "raw_content": "Ironically makes me want to live there",
                "author": "ParticleCannon"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Wages would go up, house prices would fall, the remaining population would begin to feel more safe and pair up. Birth rates would likely go up as well.",
        "score": 2102,
        "text_content": "",
        "comments": [
            {
                "raw_content": "True. Diversity has been shown to result in lower social cohesion and lower birthrates of the native population.",
                "author": "Seeker_17"
            },
            {
                "raw_content": "Start with those that hold dual citizenship under false pretenses and a singular loyalty to an extremely hostile foreign state.",
                "author": "Roadpower"
            },
            {
                "raw_content": "It was estimated in the 90s there were 30 million illegals. Conservatively that means there are at least 60 million illegals here today but it's probably more. There is also over 50 million foreigners here on visas. That's over 100 million non-Americans by the most conservative estimates. Get them all out until every American man has a house, two cars, a stay at home wife with three kids, and a dog and a grill.",
                "author": "cjsr4c90"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "British woman telling us what it's like living in England today. She's angry.",
        "score": 1195,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's gonna get a lot worse if you don't do anything. You literally only have one man standing up for the entire country. Where the fuck are the british men? Wake up! You are being f****** invaded for God's sakes. I know America is not far behind. Trump and MAGA gets it. Shit. we are on the verge of Civil War.",
                "author": "MEME-SUPREME"
            },
            {
                "raw_content": "She's gonna get arrested now.",
                "author": "Spawnlingman"
            },
            {
                "raw_content": "Shit like this is why we did 1776!",
                "author": "patrioticwinning3"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "NEW YORK: Federal officers tackle and tear the mask off of a leftist who pushed ICE agents during their operation.",
        "score": 1150,
        "text_content": "",
        "comments": [
            {
                "raw_content": "deport him",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Waterboard that motherfucker",
                "author": "Mindcrym"
            },
            {
                "raw_content": "# DEADLY FORCE MUST BE AUTHORIZED",
                "author": "redditadminssuckit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "PRESIDENT TRUMP: Gas is WAY down. Grocery prices WAY down. Energy is WAY done. Mortgage rates are down. We have a real STIFF at the Federal Reserve. Can't help that, but he's leaving soon. Inflation has been defeated. Despite his rates being too high, the economy has been amazing.",
        "score": 1161,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sorry President Trump but not where I live. Gas is 3.49…energy is NOT down… my interest rate on a parent plus loan for my kids Tuition was over 9%(which is freaking robbery)..and I haven’t seen one thing at the grocery store go down in price — trust me I’m watching it every time I go —- Hamburg is 6.99 /lb",
                "author": "carbonsteel"
            },
            {
                "raw_content": "Dude doesn’t buy things. Groceries and energy are way up.",
                "author": "For_All_Mankind"
            },
            {
                "raw_content": "Insurance arbitrarily went up. For no reason.",
                "author": "PatriotSkorzeny"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This inter-web thingy never disappoints",
        "score": 1555,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And she gave Bill a pass.",
                "author": "BlackJack1776"
            },
            {
                "raw_content": "[A lot of FAKE OUTRAGE over construction of the big, beautiful (and privately funded) White House Ballroom.](https://x.com/RapidResponse47/status/1980411112307700146) FACT: Presidents have been renovating and expanding the White House for more than 100 years. In 1902, President Theodore Roosevelt built the West Wing — replacing expansive greenhouses constructed during the Jefferson Administration and establishing the modern day executive office wing with a “classically leaning design” — along with a colonial garden and East Terrace, which eventually became the East Wing. In 1909, President William Howard Taft added the first Oval Office during a West Wing expansion. In 1913, President Woodrow Wilson demolished the colonial garden, modernizing it with a rose garden. In 1927, President Calvin Coolidge oversaw the renovation of the upper floors and attic of the White House. In 1929, President Herbert Hoover remodeled the West Wing, including reconstruction work in the basement level and remodeling the first floor; after a fire on Christmas Eve, the West Wing was repaired and reopened in 1930. In 1934, President Franklin D. Roosevelt overhauled the West Wing, adding a second floor, a larger basement, and a swimming pool, and relocating the Oval Office to its current location; in 1942, President Roosevelt constructed the East Wing. In 1948, President Harry Truman began completely gutting and rebuilding the White House interior, preserving only the exterior walls. In 1962, President John F. Kennedy constructed the modern Rose Garden. In 1970, President Nixon converted FDR's pool into the press briefing room; in 1973, he added a bowling alley in the basement. In 1975, President Gerald Ford installed an outdoor swimming pool on the South Grounds, financed entirely by private donations. In 1993, President Bill Clinton undertook a restoration and refurbishment of the Executive Mansion. In 2009, President Obama upgraded the tennis court into a full basketball court. In 2020, President Trump and the First Lady completed a new White House tennis pavilion, refurbishing the White House Tennis Court and Grandchildren’s Garden, as well as constructing a new building. Now, in 2025, President Trump has broken ground on a grand ballroom — modernizing the wing while privately funding the project. https://www.whitehouse.gov/articles/2025/10/white-house-ballroom-proud-presidential-legacy/",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "> It's your house... Except it really isn't. It's the living quarters of the elected president of the United States. It is defacto, The President's house, whomever that may be at a given time. The *People's* house is the Capitol Building. Which, funny enough, is the place all of you shitbag elitists lost their shit over when The People decided to pay it a visit 5 years ago.",
                "author": "bidensmissingbrain"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This is exactly what I voted for!",
        "score": 1859,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No place for mental illness.",
                "author": "Farqquard"
            },
            {
                "raw_content": "You guys don't realize these trannies weren't there to serve the country. They were there so they can get free hormone drugs and faggot-affirming procedures paid for by the taxpayers.",
                "author": "fluffykitten"
            },
            {
                "raw_content": "Dear God imagine having to serve under these prats. It's really clear the trans crap is a sign of porn addiction and fetishistic autogynophilia aka they are not at all well in the head.",
                "author": "shadypollster"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "States Where it’s Almost Impossible to Prove Voter Fraud. When the election integrity laws are this bad, you almost wonder if it’s on purpose.",
        "score": 1238,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Spoiler Alert: It is on purpose.",
                "author": "duehuckleberry"
            },
            {
                "raw_content": ">New Mexico Yup, the name makes sense.",
                "author": "aloha_snackbar22"
            },
            {
                "raw_content": "Remember the doors wide open in Georgia with the alarms blaring in Fulton County? Remember Jim Miller Park in Cobb County? # PEPE-ridge Farms Remembers...",
                "author": "TulsiSimp2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Thats just the tip of the iceberg, its much worse...",
        "score": 1568,
        "text_content": "",
        "comments": [
            {
                "raw_content": "AMERICAN POLITICANS, not illegal aliens. Stop passing the buck, our government allowed and even encouraged this shit.",
                "author": "AFferalAF"
            },
            {
                "raw_content": "What's frustrating is that Republicans have controlled Texas for many years, but it's only now that they think to check for this?",
                "author": "hansgruber7"
            },
            {
                "raw_content": "Now do California voter rolls, where illegals get driver's licenses and we are registered to vote at the same time we apply for a license. Oh yeah, you can declare you're ineligible to vote, but it's honor system only. No verification.",
                "author": "freebirdie"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "DUDE CRACKED THE CODE HOLY SHIT",
        "score": 434,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Every liberal, whether they'll admit it or not, is a devil worshipper.",
                "author": "Kaarous"
            },
            {
                "raw_content": "They want so badly to jump to their \"but unborn arent people\" line.",
                "author": "DingleBalls"
            },
            {
                "raw_content": "This worked well because he hit them in the narcissism. When you meet a leftist, they HAVE to be the smartest person around, just ask them. When you make it obvious to them and everyone else they are the dumbest, they snap. It doesn't covert them, but it does anyone reasonable they might be influencing.",
                "author": "USDMaga"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "AMD Readies 16-Core Ryzen 9 9950X3D2 CPU with 192 MB L3 Cache and 200 W TDP",
        "score": 322,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That cache is bigger than my first HDD lmao",
                "author": "djent_in_my_tent"
            },
            {
                "raw_content": "FYI: AMD has an Epyc with **1152MB** of L3 caches over 96 cores. And that's over 2 years ago. Yes 1+ fricking **GIGABYTE** of cache. https://www.techpowerup.com/cpu-specs/epyc-9684x.c3253",
                "author": "ghostsilver"
            },
            {
                "raw_content": "Are there real workloads getting an uplift from this? As I understand it cross CCD talk significantly reduces the benefit and for gaming the 9800X3D and many workloads just run basically equally fast on the non-X3D CCD of the 9950X3D such that gaming + background tasking seems fine on that chip. So I don't think this will be any special chip other for maybe fluid simulations or the likes where it might be better but those workloads are probably better served with workstation/server hardware either way.",
                "author": "EloquentPinguin"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Are M.2 SSDs dead? | (The M.2 connector might not provide acceptable signal integrity for upcoming PCIe generations)",
        "score": 61,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Consumers SSDs aren't going to be made for Gen 6 & 7 for a while. At the same time trace length may make it cable connectors only.",
                "author": "Slasher1738"
            },
            {
                "raw_content": "For server yes but we don't even need 4.0 drives at full speed for gaming or PC use or even local AI",
                "author": "Obvious-Flamingo-169"
            },
            {
                "raw_content": "Time for M.3 to shine",
                "author": "Tasty-Traffic-680"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "China's homegrown 90GHz oscilloscope ( previously limited to 60Ghz by sanctions)",
        "score": 107,
        "text_content": "",
        "comments": [
            {
                "raw_content": "For somebody who has no ideas about what this device is doing: 90GHz oscilloscope is the equipment for testing and validating the advanced chips up to 3nm 60GHz ones are for 14nm chips",
                "author": "Glass_Elevator5360"
            },
            {
                "raw_content": "Not a big fan of the lack of hardware controls, and having to use a touch screen. If your gonna go full touchscreen, do something new, don't simulate a turning knob, those are always shitty and clunky on touchscreens.",
                "author": "adaminc"
            },
            {
                "raw_content": "chinese manufacturers absolutely shit on western manufacturers of testing equipment, I mean most equipment is already made in china anyway, but you can get a good chinese brand equipment for less than half the price of a similar western corp model. usually with more features not hidden behind software locks",
                "author": "Quatro_Leches"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "(Geekerwan, M5 MacBook Pro review) MacBook Pro M5性能测试：新架构GPU能带来什么？",
        "score": 15,
        "text_content": "Video has english subtitles.",
        "comments": [
            {
                "raw_content": "Summary: Cpu and Gpu has gotten some improvements. In Cinebench: R23: M5 gets 2569pts in single core while in multicore it gets 16130pts. This puts its single core higher then its previous gen and current Intel H processorers, however its multicore is slower then the Ultra 9 285H. R24: M5 gets over 200pts (208pts), being the fastest single core Cpu in this benchmark. In multicore it ties with the Ultra 9 285H. 3D mark (Steel Nomad 4k & Solar Bay Extreme 2k): The M5 gpu performs around a mobile 3050 Ti in this benchmark. Blender: The gpu is somewhere in between a mobile 3050 Ti and a 4050 in this benchmark. In games: Fps is close to a mobile 3050Ti Battery life: In Geekerwan's battery test, the M5 MacBook Pro gets the longest battery life at 15h 9min.",
                "author": "Chairman_Daniel"
            },
            {
                "raw_content": "Unfortunately, no perf / W data points, just Geekerwan's custom battery life test (where it did *very* well at over 15 hours). Perhaps coming in a future video. If it's LPDDR5X-9600, it's hopefully the last generation before LPDDR6? // So now with M5 officially released, here's the cadence: M1 - Nov 2020 ***+19 months →*** M2 - June 2022 ***+15 months →*** M3 - October 2023 ***+12 months →*** M4 - October 2024 ***+12 months →*** M5 - October 2025 So far Arm, Apple, and likely Qualcomm with X2 Elite are the only CPU firms that deliver annual microarchitecture updates. And not unexpectedly, they are also the only ones that re-use their mobile-first microarchitectures across bigger designs. Mobile remains the dominating market for CPU volume → huge resources → faster updates.",
                "author": "-protonsandneutrons-"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Russia outlines EUV litho chipmaking tool roadmap through 2037 — country eyes replacing DUV with EUV",
        "score": 18,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's old news, but the interesting part is that the Russian institute is claiming they're going to develop their own unique EUV ecosystem, completely separate from ASML's ecosystem. And they're trying their custom EUV first on 40nm, then 28nm. > The first system, scheduled for 2026–2028, is a 40nm-capable lithography machine with a two-mirror objective, 10nm overlay accuracy, an exposure field of up to 3 x 3 mm, and throughput exceeding five wafers per hour. > The second stage (2029–2032) introduces a 28 nm (with potential for 14 nm) scanner utilizing a four-mirror optical system. It offers 5 nm overlay precision, a 26 x 0.5 mm exposure field, and output exceeding 50 wafers per hour. I'm not sure if they would even be able to import Chinese semiconductor equipment if they go down this \"unique\" route, in contrast, the PRC's SMIC's is pursuing 7nm with DUV. Which would mean the Russians are completely on their own, compared to ASML having the global ecosystem to support them and SMIC having the PRC's immense backing. All of this is assuming that the Russian project has absolutely zero corruption (insert laugh track) and isn't derailed by an ongoing war. For context on just how difficulty EUV is, Asianometry has a video on how Japan lost the race to ASML despite being one of the early pioneers of it: https://www.youtube.com/watch?v=8_OOta7Y6Ik The equivalent of a a brand new startup launching a new GPU except it uses its own proprietary APIs for everything (no compatibility with DirectX, Vulkan, OpenGL CUDA, ROCm, DLSS, XeSS, FSR and etc). Oh, and while we're at it, it uses AGP connector instead of PCIe. It's a bold strategy Cotton. Let's see if it pays off for them.",
                "author": "Blueberryburntpie"
            },
            {
                "raw_content": "Russia says a lot of things...I doubt this will ever come to fruition",
                "author": "rTpure"
            },
            {
                "raw_content": "Hello Blueberryburntpie! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "NVIDIA RTX PRO 5000 \"Blackwell\" GPU with 72 GB GDDR7 Memory Appears",
        "score": 57,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"the RTX PRO 6000 Blackwell, is retailing just under $10,000, we could see the 72 GB version just a grand or two lower.\" Lol significantly slower, with less ram \"a grand or two cheaper\". I hate this market.",
                "author": "atape_1"
            },
            {
                "raw_content": "I still can't comprehend how fucking stupid these names are. They've changed the scheme every single generation since 2017. At least the numbering is somewhat consistent, though it does clash with the GeForce line's generations.... Quadro -> Quadro RTX -> RTX A# -> RTX # Ada Generation -> RTX PRO # Blackwell series But I guess it must be very exciting for middle management to order some GPUs and they get a completely new, this year's freshly rebranded most newest, most best pro max edition generation max-q series product.",
                "author": "yabucek"
            },
            {
                "raw_content": "Lol NVIDIA listing their own product spec wrong (512 bit)",
                "author": "bazhvn"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "MacBook Pro: Apple’s most awkward laptop is the first to show off Apple M5 | Ars Technica",
        "score": 41,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Pretty nice numbers, but I think I'll keep using my M3 Max until next year when M6 on N2 is rumored to be arriving with a new laptop (and dual-oled screen like the iPad Pro).",
                "author": "theQuandary"
            },
            {
                "raw_content": "I yield I thought >50% gen over gen was impossible with similar architecture & node",
                "author": "NeroClaudius199907"
            },
            {
                "raw_content": "IMO, they need to call these non-Pro chipped \"Pro 14 inch\" laptops just \"MacBook\". That makes more sense, just like iPhones.",
                "author": "tired_fella"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Notebookcheck M5 MacBook Pro review [German]",
        "score": 23,
        "text_content": "https://www.notebookcheck.com/Test-Apple-MacBook-Pro-M5-2025-Der-schnellste-Single-Core-Prozessor-der-Welt.1142597.0.html The GPU sees big gains, around 40% to 50% depending on game or application. CPU ST in Cinebench is 200 and nT beats Intels 285H and AMD HX AI 370",
        "comments": [
            {
                "raw_content": "Great to see *some* improvement on the atrocious response times (14\" M4 MBP @ **77ms** → 14\" M5 MBP @ **49ms**), but still way, way outside the 120 MHz window (1000ms / 120 Hz = **8.3ms** per refresh). The updated panel may also be responsible for the noticeably worse max brightness battery life vs M4, even as standardized 150 nits brigtness result was only somewhat worse. For display-heavy folks, no doubt waiting for the *rumored* M6 OLED models will be worth it. Hopefully they can start squeezing in 80 WHr units into the 14\" MBPs.",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": ">CPU ST in Cinebench is 200 That is a little nuts. It's a random number, but I think it will be some time before Intel & AMD get anywhere close to 200 and maybe even by that time, it may well be the M6. >nT beats Intels 285H and AMD HX AI 370 A 4+6 beating a 6+8+2 (285H) and 4+8 (370), though I'd classify the 370 closer to a real 12-core under nT load, is quite good. Like folks have said for ages, if Intel or AMD released CPUs with the same improvements at the same cadence as Apple's M-series, we'd never hear the fucking end of it. Apple? Updates a webpage and goes home.",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": "They write as a con \"only one year warranty\" but I think this is inaccurate as 2 years are mandatory for these kind of device by EU law. Might be true for other region but if I am not confuzzed rn in Germany it should be at least 2.",
                "author": "EloquentPinguin"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "ASUS unveils 8K ProArt Display with motorized color calibration and 4,032-zone Mini LED backlight",
        "score": 13,
        "text_content": "> ASUS’s newly launched ProArt Display 8K PA32KCX is built for color-critical workflows. The 32-inch display monitor comes with an 8K Mini LED panel, 4,032 dimming zones, and motorized self-calibration. > > The panel gives 8K UHD resolution and uses 4,032 local dimming zones which improve contrast and brightness control. The technology manufacturer rates the screen for 1,200 nits peak and 1,000 nits sustained brightness. This is made possible with the HDR10, and HLG formats integrated into the monitor.",
        "comments": [
            {
                "raw_content": "Hello Balance-! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Luigi’s Mansion - GameCube - Nintendo Classics",
        "score": 391,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The whole Luigi's Mansion trilogy is now available in one console. This is the right timeline.",
                "author": "linkling1039"
            },
            {
                "raw_content": "This is great. But why so late in the spooky season, surely it's ready to upload now.",
                "author": "Jardolam_"
            },
            {
                "raw_content": "Sweeeeeeeeeeeeet.......but the wait for Path of Radiance continues.",
                "author": "KelvinBelmont"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I have a comprise for Nintendo. Instead of Game-Key Card, we get Game-Install Card. Create a new super cheap cartridge, it's slow but can hold the whole game. It will require installation on the Switch 2 to play but that's ok. We get to own the actual game still.",
        "score": 95,
        "text_content": "Everyone hates Game-Key Card. Like, literally hates them. How about we meet in the middle with Game-Install Card? Use the old Switch 1 cartridge, they are cheaper for developers and they have more size options. Or, you can create an even cheaper cartridge that is super slow. We don't care. These cart will require installation just the first time you play it. You'll need to insert the cart every time you want to play the game as well. Consumers will buy more physical games which is a win win for everyone.",
        "comments": [
            {
                "raw_content": "Been saying this for a while i'm totally happy if i need to install a game from a card to the NS2. You could also have Nintendo make these games on switch 1 cards which would be lower cost again",
                "author": "profchaos111"
            },
            {
                "raw_content": "the reason installing from a disc is so much more feasible is because they're cheap as dirt, even 100gb blurays cost less to manufacture than game-key cards even if you gave publishers the option to install from 64 gb switch 1 carts (which don't exist), they wouldn't pick them for the same reasons barely any publishers chose 32gb carts on switch 1 this also doesn't solve the filling up of storage issue, which is a main reason why people complain about game key cards in the first place",
                "author": "TiocStudios"
            },
            {
                "raw_content": "Most companies refused to buy cards over 16GB, and preferred to go with 8GB and a big download if they could get away with it. They're not chomping at the bit to pay for 32, 64, or 128GB cards.",
                "author": "JoshuaJSlone"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Next pokemon graphics",
        "score": 125,
        "text_content": "I have been seeing some people say that they want the next pokemon game to look like beast of reincarnation. I think anyone who wants pokemon to look like that doesn't like pokemon or doesn't play the games. As a long time fan of the series I played almost every game except x and y and sun and moon as I couldn't afford or emmulate 3ds games at the time. Skipped over the gen 1 and 2 games and played their remakes fire red,leaf greenand heart gold and soul silver. Other than that I played every generation. Don't get me wrong beast of reincarnation is a great looking game but that doesn't fit Pokemon. I think the monsters and people would look too out of place. I think what we want for a pokemon game is a constant art style like how the people and creatures and buildings are in monster hunter stories. Having the render distance of botw/totk would be great pokemon and people wouldn't disapear when your a stone's throw distance away. And if the next games are open world which they most likely will be. As I don't see them going back to linear traversal like in sword and shield. It would offer people a reason to actually travel to locations imagine seeing a grup of pokemon far away with a spyglass or something and then traveling to that location. Instead of just coming across locations because you set a marker on the minimap and it happens to be between your a-b line. Having the detail of dk bananza I mean this for stuff like the land trees grass water. Although I do think they improved greatly with the environment detail in legend za There's always room for improvements cuz the water movement looks weird if you stare at it for more than like 6 seconds. What are your guys thoughts. I would love to hear if you have better things to say",
        "comments": [
            {
                "raw_content": "Stylization is much better than realistic graphics. The issue is that the games are not polished at all. Low-quality textures, lackluster animations, terrible lighting and no details is what has been plaguing the games for the entirety since Pokémon released on Switch. Pokémon doesn't need a new artstyle, it needs to be more polished.",
                "author": "ItaLOLXD"
            },
            {
                "raw_content": "People aren't asking for realistic graphics. They are asking for graphics that are on par with the rest of Nintendo's IPs",
                "author": "Wise-Nebula-6321"
            },
            {
                "raw_content": "I would be happy with let's go pickachu graphics at 60 fps and a higher res. Those games are gorgeous.",
                "author": "Chickat28"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Another hour long Kirby Air Riders direct tomorrow",
        "score": 560,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Isn't that two days from now?",
                "author": "sportspadawan13"
            },
            {
                "raw_content": "HOW??? Didnt he already cover everything?",
                "author": "RuanauR"
            },
            {
                "raw_content": "Please have an unlockables grid Please have an unlockables grid",
                "author": "AleroRatking"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Donkey Kong Bananza 2.0.2 update out now, patch notes",
        "score": 18,
        "text_content": "Fixed Issues Fixed the issue causing Pauline’s voice not to play at times when acquiring a fossil in Ver. 2.0.0 and Ver. 2.0.1. Several other changes have been made and issues addressed to improve the gameplay experience.",
        "comments": [],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Air Riders 2nd Direct - There is a lot we don't know it seems",
        "score": 20,
        "text_content": "I am seeing an awful lot of comments stating that Sakurai has revealed the whole game in the 1st direct so why need a 2nd one. Do people really think this? This is a Sakurai game. There are likely new features and modes he is revealing in the next one. The first direct was basically \"If you played the original game and loved it, here is how this game expands on that\". The 2nd one will be \"Now here's all the new stuff\". I am actually kinda shocked a lot more are not thinking this.",
        "comments": [
            {
                "raw_content": "Sakurai would not make a 60 minute presentation if he had nothing interesting to talk about. The internet is so pessimistic man holy shit",
                "author": "Possible-Potato-4103"
            },
            {
                "raw_content": "Well the first Direct teased some degree of story mode at the end. Seems like the first one was about the stuff brought over from the original, and now this second one will be about the new stuff.",
                "author": "SomeBoxofSpoons"
            },
            {
                "raw_content": "He has [a great video](https://www.youtube.com/watch?v=nkNSNGJvFXk) about the essence of good presentations being speed. If he has an hour of material, he's got a lot to show.",
                "author": "notamouse418"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Star Wars Outlaws Update 3 Patch Notes",
        "score": 162,
        "text_content": "Should've just gone live. Here are the full patch notes (I have spoiler tagged the story mission related notes just in case): **General Gameplay** * Fixed an issue where the 'stealth takedowns restore health' equipment perk was not triggering **Performance** * Improved stability **Graphics** * Fixed an issue where textures could appear low resolution after extended play sessions * Fixed some broken assets on Toshara * Reduced cliff popping when travelling to Jaunta's Hope on Toshara * Improved texture quality * Fixed shadow flickering when adjusting brightness from the Quick Menu **UI** * Improved the accessibility screen when starting the game for the first time or as a new user * Fixed an issue where the enemies were not highlighted when tagging them with adrenaline rush **Story (BEWARE OF SPOILERS)** >!**Main Game:** !< * >!Fixed an issue where Kay would have stiff movements after the adrenaline rush tutorial during 'The Gunslinger' quest !< * >!Fixed an issue where the blaster module could reset during 'The Scavenger' quest !< * >!Fixed an issue where the Pyke Syndicate would not help Kay in combat during 'Recover the Cargo' contract !< >!**Wild Card Story Pack** !< * >!Fixed an issue where players could not leave Renpalli station during the 'Wild Card' quest if there was a contract active !< >!**A Pirate's Fortune Story Pack** !< * >!Fixed an issue where NPCs could disappear if Kay moves far enough away during 'A Pirate's Plight'!<",
        "comments": [
            {
                "raw_content": "\"A surprise to be sure, but a welcome one.\" -Senator Palpatine",
                "author": "av8ernate"
            },
            {
                "raw_content": "They are still improving this very fine Port. Rare Ubisoft win. Props to them! I hope they get the sales they deserve for their efforts!",
                "author": "RoughLifeguard6568"
            },
            {
                "raw_content": "Unfortunately I've finished the game now, was enjoying it so much as well.",
                "author": "Best-Food-4441"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Scarface: The World Is Yours store page shows up on Epic",
        "score": 244,
        "text_content": "https://store.epicgames.com/p/scarface-the-world-is-yours-7c3e6f Publisher is listed as EC Digital now. The publisher for the original game was 'Vivendi Games'. https://egdata.app/builds/68f85f67abef73e1245d770f/files Edit: store page is up on Steam now https://store.steampowered.com/app/4113570/",
        "comments": [
            {
                "raw_content": "Holy shit. This is one of those random PS2 era games that I mentally filed under ‘want to replay but no way a single publisher ever remembers it exists, let alone rereleases’ Godfather 1/2 next pls!",
                "author": "mediciii"
            },
            {
                "raw_content": "Impressive if they figured out the licensing mess around this game",
                "author": "KMoosetoe"
            },
            {
                "raw_content": "I don’t care how much it is; they can take my money. Incredible game based on a beloved classic",
                "author": "Davinci20192019"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Microsoft is significantly increasing the price of its Xbox Development Kit",
        "score": 870,
        "text_content": "By Tom Warren After raising prices on Xbox consoles and subscriptions, Microsoft is now turning its attention to Xbox developers. Sources familiar with Microsoft’s plans tell *The Verge* that the company is significantly increasing the price of its Xbox Development Kit (XDK) — the custom hardware used by developers to build Xbox games. The current Xbox dev kit is moving from $1,500 to $2,000, a 33 percent jump in price. “The adjustment reflects macroeconomic developments,” says Microsoft in an announcement to Xbox developers, seen by *The Verge*. “We remain committed to providing high-quality tools and support for your development efforts.” I asked Microsoft to comment on the price rise, but the company didn’t respond in time for publication. The short announcement from Microsoft’s Xbox developer relations team makes it clear that this price increase goes into effect immediately. I understand it’s not just impacting US developers, as the price of these development kits is also going up across Europe and elsewhere. That’s likely because those “macroeconomic” conditions extend beyond just US tariffs, with currency fluctuations, production costs, and other elements impacting pricing. [Source](https://www.theverge.com/report/803237/microsoft-xbox-devkit-price-hikes-developers)",
        "comments": [
            {
                "raw_content": "Microsoft: *\"Let's make it harder for developers to make games for our platforms AND raise the price of our hardware for consumers!\"* Talk about a terrible business strategy.",
                "author": "MuptonBossman"
            },
            {
                "raw_content": "Microsoft is doing everything in its power not to have a single day of good press",
                "author": "ElVaNoS7"
            },
            {
                "raw_content": "![gif](giphy|mh7DKz8UhQQGk)",
                "author": "SuddenDepact"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Sarah Bond: \"The next-gen [Xbox] console is going to be a very premium, very high-end curated experience\"",
        "score": 459,
        "text_content": "[https://www.youtube.com/watch?v=yDmwJ7tuoD8&t=376s](https://www.youtube.com/watch?v=yDmwJ7tuoD8&t=376s) Skip to 6:17 Semi-confirms recent rumors about it being a \"high end\" or \"expensive\" system: [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1o26xax/amd\\_magnus\\_xbox\\_next\\_gen\\_apu\\_full\\_leak/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1o26xax/amd_magnus_xbox_next_gen_apu_full_leak/)",
        "comments": [
            {
                "raw_content": "Read as: “it’s going to be expensive as fuck, and we don’t fucking care if you’re priced out. You can pay a subscription to play your library on Cloud.”",
                "author": "AtaxicHistorian"
            },
            {
                "raw_content": "So, is the series X/S technically their last \"traditional\" console?",
                "author": "TypeExpert"
            },
            {
                "raw_content": "Brilliant strategy, Microsoft. Doomed to fail.",
                "author": "Sxoob"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Everything known from Resident Evil 0: Remake",
        "score": 190,
        "text_content": "* [Screenfire Germany](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1dhxv98/screenfire_germany_info_on_resident_evil_9_code): >The game started development at M2 in 2023. Partner Zapping System returns. It will include online co-op * [MP1st](https://mp1st.com/news/report-resident-evil-0-remake-in-development-new-casting-and-plot-details-unearthed): >The game's codename is *Chamber.* Casting with new lead actors started sometime in 2024. Jon Mclaren (Star-Lord in GotG game) could play Billy Coen. The story would be expanded, like in previous remakes, such as the inclusion of a train conductor in the train section. * [DuskGolem](https://xcancel.com/AestheticGamer1/status/1978210267512316173): >It would've been originally scheduled for 2024. Capcom Dev 1 took over development last year. The game went through a retooling, but not a full reboot. Scheduled to release in 2028.",
        "comments": [
            {
                "raw_content": "My question is: how are we learning so much about 0 when CV is supposedly next after Requiem.",
                "author": "darkcomet222"
            },
            {
                "raw_content": "Damn. Was hoping for maybe a late 2026 or early 2027.",
                "author": "doublej101622"
            },
            {
                "raw_content": "2028? Damn, I was hopping for a shadow drop by next Friday 😔",
                "author": "FransD98"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Promotional pamphlet for Nintendo Switch 2 advertises Luigi's Mansion",
        "score": 216,
        "text_content": "Went into my local Target store (the Australian version) and saw some promotional material for the Switch 2. Not much else to see that we don't know already, but in the section advertising the Nintendo Switch Online subscription, the game shown as an example of the GameCube games on the service is Luigi's Mansion... Even though it's not out yet. I took an (admittedly awful) picture of the page (https://cdn.discordapp.com/attachments/349459203573678080/1430333511931396249/rn_image_picker_lib_temp_ae42cac4-5b58-4583-bf49-33cf3d5d925a.jpg?ex=68f96563&is=68f813e3&hm=fb03db0478cd2413528962c617300566fa3c29987d6beeebdcbb6a9d79ea9294&) and I'll get more evidence if needed. So... Is this just advertising a game coming soon? Did this get sent out a bit early before the game actually drops? Edit: officially announced, will be added to the service on the 30th. *Is there an achievement for leaking Nintendo info ahead of release? This would qualify right?*",
        "comments": [
            {
                "raw_content": "Luigi's Mansion was one of the first games announced when they revealed the Gamecube Classics. It isn't out yet, so odd for it to be the *only* title shown here, though.",
                "author": "IrishSpectreN7"
            },
            {
                "raw_content": "I think people kinda figured the game would release around Halloween. Nintendo has done some spooky theme releases on NSO around this time of year for the past 2 years (Devil World, Murasume Castle, and Castlevania Legends in 2023, and [this announcement](https://www.youtube.com/watch?v=FN6IbpsG9wM) last year for Shadowman and Turok 2)",
                "author": "Juklok"
            },
            {
                "raw_content": "!legit! [https://xcancel.com/nintendoamerica/status/1980801529272549441?s=61](https://xcancel.com/nintendoamerica/status/1980801529272549441?s=61)",
                "author": "TheNintenGuru"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Warner Bros Discovery announces that it is up for sale",
        "score": 708,
        "text_content": "[https://www.nbcnews.com/business/media/warner-bros-discovery-for-sale-rcna238857](https://www.nbcnews.com/business/media/warner-bros-discovery-for-sale-rcna238857) Had been [previously reported](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1nehgml/wall_street_journal_paramountskydance_is/) by the Wall Street Journal that WBD was in talks with Paramount for a sale. They have now confirmed in a press release a \"review of potential alternatives,\" Wall Street speak for a sale. Naturally, this would extend to and affect its gaming section (Rocksteady, NetherRealm Studios, etc)",
        "comments": [
            {
                "raw_content": "Yeah just keep selling the company, it's sure to work out eventually, for sure.",
                "author": "CarbVan"
            },
            {
                "raw_content": "Wonder how much it would go for if they'd put it on ebay",
                "author": "opanm"
            },
            {
                "raw_content": "Up for sale, **again**.",
                "author": "JonPX"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Rebs Gaming: Grunt is re-confirming that a new Halo game, specifically the one being announced on Friday, is coming to PlayStation 5. He didn’t find any evidence for Nintendo Switch.",
        "score": 362,
        "text_content": "[Source](https://xcancel.com/Mr_Rebs_/status/1980674753267404968?t=ifd7nJQniuQs0_wvr1ou1w&s=19)",
        "comments": [
            {
                "raw_content": "There's a new Halo being announced on friday?",
                "author": "Fluffy_Moose_73"
            },
            {
                "raw_content": "Didn't say it was Combat Evolved Anniversary Anniversary so I'm just going to delude myself into thinking it's Master Chief Collection + Halo 3 Anniversary as a free update for existing owners /s The people below me are slow as fucking hell. Do I need to circle and underline the sarcasm mark next time",
                "author": "MyMouthisCancerous"
            },
            {
                "raw_content": "Not a surprise at all. Everything on Xbox will be coming to PlayStation.",
                "author": "Objective_Love_6843"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Jez Cordon clarifies statement about generative AI in new Halo games, says he wasn’t discrediting Rebs Gaming’s report.",
        "score": 23,
        "text_content": "Source: https://xcancel.com/JezCorden/status/1980786501957963865#m Rebs reported they were told generative AI is woven into all areas development, and Jez tweeted: “Halo is not using generative AI in its game dev / art assets, etc. for its next game. Microsoft has no mandate on studios to use generative AI for games. I'm sure it's being used for emails n shit like that but they're not making a gen AI game here.” Jez’s new statement: “Btw, this was not me discrediting @Mr_Rebs_ report, it was me discrediting the reporting on his report. Like I said in replies, Halo isn't gonna be some twisted ai slop thing, like most corps on earth there's most likely mild use of \"ai\" to expand human made backgrounds or fix bugs, etc.” “I can also see them allowing gen ai in a future Forge mode or in other UGC games like Minecraft. Or maybe in advanced NPC behaviour. “Generate me a map with giant Elites that players fight like a raid boss,\" etc. Those are the kinda experiments worth expecting. Sorry to @Mr_Rebs_ for not being clearer about what I was addressing.” Post about Rebs report: https://www.reddit.com/r/GamingLeaksAndRumours/s/whYeemkpQA",
        "comments": [
            {
                "raw_content": "#Jez Corden is a Tier 2 - Generally Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "This is just him defending Rebs statement that his statements were being misrepresented. Which wouldn’t surprise me if true (I’m not exactly sure in what context Rebs talked about generative AI), considering use of AI is huge powder keg in the community right now.",
                "author": "SoldierPhoenix"
            },
            {
                "raw_content": "Are they using AI? Well, yes, but no, maybe, most likely not, but in reality, we will, even if we don't.",
                "author": "Zealousideal_You_938"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Panther Lake Compute & Power Management",
        "score": 44,
        "text_content": "A little more info on P-Cores, E-Cores, Thread Director and some more on 18A",
        "comments": [
            {
                "raw_content": "panther lake handhelds with Xe3 are going to slap",
                "author": "DannyzPlay"
            },
            {
                "raw_content": "TL:DR?",
                "author": "DefSysteam"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel Core Ultra X7 358H Panther Lake leak reveals Xe3 Arc GPU performance in Geekbench",
        "score": 82,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Think pretty easy naming. Any X infront just automatically means better iGPU",
                "author": "Ecstatic_Secretary21"
            },
            {
                "raw_content": "Looks pretty snappy at \\~75% faster than the top-end LNL chipset and this is with pre-release drivers. Granted TDP is probably higher. If they get the drivers cleaned up then it might release a bit higher which makes it a viable (though still materially weaker) thin and light XX50 dGPU model alternative some some of the market. Should do well addressing the 'I want a thin and light laptop, but I want it to have an ok GPU' crowd.",
                "author": "grumble11"
            },
            {
                "raw_content": "Nice to see the G14 with an Intel CPU. Thought the lineup was AMD only tbh, while the larger G16 laptops get Intel.",
                "author": "Geddagod"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD Ryzen 9 9950X3D2 with dual 3D-VCache and Ryzen 7 9850X3D with 5.6 GHz boost reportedly in the works",
        "score": 382,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "Rumors are always wildin' out, I'm over believing anything until AMD actually announces it. There's always a new 3D V-Cache chip with crazy specs being rumored.",
                "author": "spacemanspliff-42"
            },
            {
                "raw_content": "would they be able to fix the latency problems that made a dual X3D chip not worth it?",
                "author": "aintgotnoclue117"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "ASUS confirms new AM5 APU support with AGESA 1.2.7.0",
        "score": 69,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "Ok",
                "author": "JamesLahey08"
            },
            {
                "raw_content": "Well, I guess if it is monolithic they can do some things to improve memory bandwidth slightly, and maybe even have some SLC for the APU to improve performance. Certainly it will be no strix halo, but it could be a step above all the other AMD APUs.",
                "author": "BFBooger"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Mortgage Rates Won’t Fall Below 6% Anytime Soon, Top Economist Says in Grim Forecast",
        "score": 31,
        "text_content": "",
        "comments": [
            {
                "raw_content": "the maximum someone can pay is their max PITI. Principal, Interest, Taxes and Insurance. If insurance keeps climbing, taxes are dependent on the home sale price, and interest rate being sticky… it means one more variable can change, that’s principal/sale price. It’s just basic economics. Folks wishing to sell to cash out, should do sooner than later.",
                "author": "OptimalFunction"
            },
            {
                "raw_content": "Mortgage rates could remain stuck above 6% for the next several years, according to newly released projections from the economists at the Mortgage Bankers Association. MBA Chief Economist Mike Fratantoni presented the forecast at the group's annual conference in Las Vegas on Sunday, projecting that 30-year fixed mortgage rates will remain roughly in the range of 6% to 6.5% through the end of 2028. \"As we move over the next couple of years, we think it's more likely that long [term] rates are going to go up rather than down, given the fiscal pressures on the economy,\" Fratantoni told the conference, referring to the impact of rising federal deficits on bond markets. That's a grim forecast for prospective homebuyers, who have already suffered through three straight years of mortgage rates hovering above 6%, with rates averaging 6.27% as of last week, according to Freddie Mac. It's also among the bleaker predictions issued by top economists in the housing industry, with Fannie Mae's forecast more optimistic that mortgage rates will dip below 6% in late 2026. Frantantoni predicts that the Federal Reserve will cut its short-term policy rate twice more in 2025, but only once next year, as concerns about inflation force the central bank to halt its cuts. The economist believes that growing government budget deficits and elevated inflation expectations will keep longer term rates from falling further, even as the Fed cuts short-term rates this year and next. This will keep the key 10-year Treasury yield above 4% and mortgage rates between 6% and 6.5%, he predicts. However, he expects there will be periods where rates ease, which will provide spurts of refinance activity, similar to what has occurred several times in 2025. Despite the bleak outlook on rates, Frantantoni expects that total home sales will increase next year to just above 5 million, up from the 4.8 million the MBA projects for 2025, including sales of both new and existing homes. “While mortgage rates are not expected to decline further, housing supply has increased in recent months, which will ease home-price growth and provide more housing options for prospective buyers,\" he says. \"The increase in inventories will put downward pressure on home prices across the country.\" The MBA economists predict that home prices will decline nationally for several quarters over the next few years, before returning to modest annual growth in late 2027. Kan emphasized that housing market developments are location specific, as growing housing inventory in markets such as Florida, Colorado, and Arizona have led to annual home-price declines, while tight inventory and challenges to homebuilding in the Northeastern and Midwestern states such as New York, Connecticut, Illinois, and New Jersey drive price appreciation well above the national average. MBA Deputy Chief Economist Joel Kan also spoke at the conference, where he noted that housing market developments are increasingly market-specific, with home prices now falling in much of the Sun Belt but continuing to grow in Northeast and Midwestern markets. Kan said that mortgage payment affordability had improved slightly, with the typical mortgage payment now at $2,067, down marginally from the peak “While median principal and interest payments are gradually declining, they are significantly higher than they were five years ago, given cumulative home-price appreciation and the current level of mortgage rates,\" says Kan. Kan says that borrowers have increasingly shifted to adjustable-rate mortgages (ARM) and FHA loans to manage these affordability challenges. \"Additionally, the cost burdens from increasing taxes and homeowners’ insurance continue to pose challenges to both prospective homebuyers and existing homeowners,” says Kan.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "The 10y treasury yield has been going down lately. I think a lot of these articles are fear mongering, because rates going down means the economy is weakening and that would mean house prices would also decline.",
                "author": "jhtyjjgTYyh7u"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "U.S. Home Prices Rose 0.2% in September",
        "score": 82,
        "text_content": "",
        "comments": [
            {
                "raw_content": "As someone trying to buy in the Chicago metro area I think I might just have to accept it's never happening. These price increases and near zero inventory are insane.",
                "author": "Bromine__Barium"
            },
            {
                "raw_content": "Prices keep rising yet I was told the housing market was crashing.",
                "author": "Lootefisk_"
            },
            {
                "raw_content": "So barely keeping pace with inflation on average.",
                "author": "mattjouff"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "\"NDFIs Are The New Alt-A\": BofA Warns Of \"Forced Selling\" If Private Credit Issues Persist... But Is It Really That Bad",
        "score": 16,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Bofa lol",
                "author": "poorat8686"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "DC Private Landlords - Has the Rental Market Crashed?",
        "score": 8,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "NVIDIA Introduces StarCloud, GPUs in Space",
        "score": 247,
        "text_content": "ladies and gents its pantheon season 2 all over again",
        "comments": [
            {
                "raw_content": "The post title is misleading, TBH. It makes it sound like this is some new NVIDIA project, but it's not. The post is just an NVIDIA blog profile of StarCloud, which is a startup that's part of NVIDIA's Inception program, which is just like a developer support program for startups using NVIDIA technology.",
                "author": "leaflavaplanetmoss"
            },
            {
                "raw_content": "Essentially the plan is to launch up a giant 5GW datacenter thats 4km wide into space... cooling is taken care of via space (assuming they keep it in the right spots) and it'll be infinitely more energy efficient. peak",
                "author": "YaBoiGPT"
            },
            {
                "raw_content": "Won't cosmic rays fuck with GPUs in space without a huge amount of shielding?",
                "author": "WoddleWang"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Amazon hopes to replace 600,000 US workers with robots, according to leaked documents﻿. Job losses could shave 30 cents off each item purchased by 2027.",
        "score": 967,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Robots are the second and larger wave of AI displacement",
                "author": "ketosoy"
            },
            {
                "raw_content": "The 30 cents is not the important part of this. Amazon burns though workers like nobodys business and literally can't find enough labor to work in their crappy FC's. Without robots to handle the labor they won't have anyone available to pick/pack/ship orders. Side note, they've \"hoped\" to replace 600,000 workers since they purchased Kiva over 10 years ago, it's just taking way longer than expected. Source: worked at Amazon Robotics for over 5 years",
                "author": "theungod"
            },
            {
                "raw_content": "Could shave off? They won’t shave anything of the selling price.",
                "author": "Slow_And_Difficult"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "When you tell ChatGPT Atlas you're going to the beach and it spends $50 on \"the usual beach-day stuff\"",
        "score": 306,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I really cannot tell if you are upset that it only got 5 items and missed a bunch of stuff like chairs and an umbrella or if you don’t need 2 sunscreens or don’t like oranges or something else.",
                "author": "Ok-Improvement-3670"
            },
            {
                "raw_content": "There should be a option to click \"I am poor, please don't spend too much\"",
                "author": "liquidflamingos"
            },
            {
                "raw_content": "i mean, with that little context what did you expect, i guess since you said \"usual\" it oculd of assumed you would of already had buckets?",
                "author": "RedditLovingSun"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "UCLA researcher uses GPT-5 pro to solve an open problem in convex optimization",
        "score": 36,
        "text_content": "Another case of AI-assisted mathematical discovery. Ernest Ryu from UCLA used GPT-5 pro to solve an open problem about whether Nesterov's accelerated gradient descent (a fundamental optimization algorithm) always converges to the minimum of a convex function. The collaboration model is pretty interesting: over 12 hours (spread over 3 days), the AI generated dozens of proof attempts (\\~80% wrong), but occasionally suggested genuinely novel approaches the researcher hadn't considered. Final contributions looks like this (from the tweet): Ryu's contribution: \\- Filtering out incorrect arguments and accumulating a set of correct facts. \\- Identifying promising new lines of reasoning and guiding ChatGPT to explore them further \\- Recognizing when a strategy had been fully explored and deciding when to move on. GPT-5 pro contribution \\- Producing the final proof argument. \\- Significantly accelerating Ryu's (or their) exploration of the many dead-end arguments, rapidly ruling out approaches that did not work. I can't wait for the IMO gold winning models to be released and the mathematicians getting access to them. Source: [https://x.com/ErnestRyu/status/1980759528984686715](https://x.com/ErnestRyu/status/1980759528984686715)",
        "comments": [
            {
                "raw_content": "I think it's interesting that it's only GPT-5 Pro I hear doing stuff like this, not Gemini 2.5 Pro or Claude 4.5 or (lol) Grok 4. Seems like GPT-5 Pro is truly a special model.",
                "author": "derivedabsurdity77"
            },
            {
                "raw_content": "I wonder Yann LeCun will say about this...",
                "author": "peakedtooearly"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "My tests with long form generation ~2min on my 4080",
        "score": 36,
        "text_content": "Using Wan 2.2 a custom ComfyUI workflow to chain together multiple I2V. Lmk if anyone wants the workflow.",
        "comments": [
            {
                "raw_content": "Not sure why it forced it landscape on Reddit this video is meant for portrait.",
                "author": "trevor1400E"
            },
            {
                "raw_content": "Does it support more than 10 seconds generation?",
                "author": "QLaHPD"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Livestream of ChatGPT Atlas announcement",
        "score": 219,
        "text_content": "",
        "comments": [
            {
                "raw_content": "YouTube description says: \"Introducing our new browser, ChatGPT Atlas. Sam Altman, Will Ellsworth, Adam Fry, Ben Goodger, Ryan O’Rouke, Justin Rushing, and Pranav Vishnu introduce ChatGPT Atlas — our new browser. Now available globally on macOS. Windows, iOS, and Android are coming soon.\"",
                "author": "ry8"
            },
            {
                "raw_content": "They will become the 4th major player in the agentic AI browser space, after Perplexity’s Comet, Copilot Mode on Microsoft Edge and Gemini in Google Chrome (which is still not out globally outside the US). Edit: Anthropic did as well with Claude for Chrome.",
                "author": "Bolt_995"
            },
            {
                "raw_content": "Initial thoughts before it finishes: Mildly useful. Having the history/bookmark searching ability is nice, read page contents and talk about it directly without copy/pasting. However, probably not going to use it myself. Was hoping (with my ultra high r/singularity-level expectations) for [something I talked about before](https://www.reddit.com/r/singularity/comments/1lvpy6q/openai_web_browser_coming_soon_reuters/n2aq381/), where the browser has awareness of all background browser logs and ability to modify itself. So you could say something in the chat like, \"Hey Atlas, add a feature to yourself where whenever I hover over Japanese kanji with the mouse, automatically display furigana so I know how to pronounce this kanji.\" Yes such a thing could be created as a Chrome extension, perhaps with the help of existing AI, add it yourself as an unpacked extension, etc. Very manual, but the worse aspect also low-context for the AI in case something goes wrong. Needing to manually copy/paste any browser logs to the AI you use. Having an AI browser that has full context of itself, can modify itself, etc. through natural language prompting, would be so much cooler. Maybe just maybe, one can accomplish this idea setting up a million MCP tools through Claude Code + Chrome, but that sounds hard for the user to set up, many ways to break, etc. Edit: Oh and what makes it dead in the water for me personally is if it's non-Chromium-based (uncertain, this may not be a problem and then ignore this), that would mean my **must have** extensions, SponsorBlock, uBlock Origin, Violentmonkey, Dark Reader, etc. can't be installed, then it's just lol. Again uncertain if this is an issue or not though.",
                "author": "koeless-dev"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "New OpenAI livestream at 10amPT. Possibly launching a browser?",
        "score": 176,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Agentic browser - Atlas",
                "author": "BitterAd6419"
            },
            {
                "raw_content": "I feel like they're spreading themselves too thin. Google also announced that they want to release something today, so the strategy continues...",
                "author": "FeathersOfTheArrow"
            },
            {
                "raw_content": "No thanks.",
                "author": "TimeTravelingChris"
            }
        ],
        "subreddit": "singularity"
    }
]