[
    {
        "post_name": "ANTIFA: Post Millennial journalist Katie Daviscourt was assaulted by TRANTIFA, leaving her with a black eye, and says Portland police refused to arrest the attacker even after she tracked the suspect for 35 minutes and pointed her out to officers.",
        "score": 1032,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The Violent, Savage Left continues their reign of terror, emboldened by lack of consequences.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Portland Police are the enemy",
                "author": "FiresideRant"
            },
            {
                "raw_content": "Antifa is gay",
                "author": "Theannihilatrixx"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Federal agents raid Dallas strip club, arrest 41 illegal immigrants in human trafficking investigation — Fox",
        "score": 636,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Get Them Out",
                "author": "k-doe3"
            },
            {
                "raw_content": "thats 82 tits",
                "author": "YodaBannon"
            },
            {
                "raw_content": "Not the big booty latinas!",
                "author": "dc53dc53"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "An Antifa militant, who dumped red paint on the ICE facility here in Portland last night, was just arrested after he returned tonight",
        "score": 570,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Withdrawals.",
                "author": "BlackLightsMatter2"
            },
            {
                "raw_content": "I read in another thread he’s a paid agitator from Los Angeles who travels frequently to Portland, pockets the return fare money they give him and begs other protesters to help him out return home. Apparently they don’t like him very much either.",
                "author": "Quiznos585"
            },
            {
                "raw_content": "shaking like a bitch",
                "author": "k-doe3"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Gavin Newsom took $26 billion and reduced homelessness from 35,000 to 175,000.",
        "score": 1293,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The more money spent on the homeless, the more homeless you get. Every time.",
                "author": "TD_Covfefe_Crusader"
            },
            {
                "raw_content": "In the ghetto that's called \"hustling backwards\"",
                "author": "Bongos"
            },
            {
                "raw_content": "I can vouch for that claim, I went back for a week after leaving five years ago and the hobo population has grown times twenty but don’t worry, every third car is a Tesla.",
                "author": "Whiteemo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Dollar Store Obama's live stream on the shutdown got \"At times, just a few dozen viewers\"",
        "score": 1198,
        "text_content": "",
        "comments": [
            {
                "raw_content": "NO ONE with a brain supports DNC. Every single one of their supporters steals money from the government or rapes children. That is the full DNC platform right there.",
                "author": "USDMaga"
            },
            {
                "raw_content": "He's been demoted to the discount 50₵ rack now.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "\"It did not go off without a hitch. In fact, there were many hitches.\" This sounds so unprofessional. Something just rubs me the wrong way. Is this how they teach you to write in journalism school?",
                "author": "Aquamine-Amarine"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Fake news CNN pushing fake news",
        "score": 1041,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Both articles archived, both written by Tami Luhby https://archive.is/lLYMR https://archive.is/t8vjQ >Tami Luhby covers health care policy, including the Affordable Care Act, Medicaid and Medicare, as a senior writer for CNN. She also writes about Social Security, safety net programs, the federal budget and tax policy. She has covered presidential candidates’ health care and economic policy proposals since the 2008 election. >An explanatory writer, Luhby focuses on informing readers of the importance and impact of policy decisions made by Congress and presidential administrations. >Before joining CNN in early 2008, Luhby was a personal finance columnist at Newsday and covered retail banking for Crain’s New York Business. She teaches at Columbia’s Graduate School of Journalism, from which she graduated in 1997. >A lifelong Bronx resident, she is also a triathlete and marathon runner.",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "You gotta love how illegal aliens is in quotes as if it's a bullshit term Trump invented and undocumented immigrants is the correct term, when that's actually the bullshit one. You can't hate the media enough.",
                "author": "OutlawPurpleHairDye"
            },
            {
                "raw_content": "They're funding health care for UNDOCUMENTED immigrants, not ILLEGAL immigrants. Checkmate Drumpf!",
                "author": "ThorsonTT"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "10 times bigger!!!!!",
        "score": 1392,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is this some kind of super dei thing? Black, gay, and mexican?",
                "author": "BlackCrimesMatter"
            },
            {
                "raw_content": "BUILD THAT SOMBRERO!",
                "author": "MemeWarsVet"
            },
            {
                "raw_content": "Absolutely bludgeoning them with hilarity.",
                "author": "DrJosephWarren"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ICE agents to attend Super Bowl after Bad Bunny announcement, says Lewandowski",
        "score": 1236,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nice, they should be embedded in a checkpoint.",
                "author": "darkmodeforgotpass"
            },
            {
                "raw_content": "I'd rather see ICE perform halftime than Bad Bunny.",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "Why? Illegals can't afford the ticket prices.",
                "author": "1Wyrmshadow1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "SHOCK: Armed NYPD Detective Snuck Past Secret Service Into Ryder Cup While Pretending to Be Part of President Trump’s Security Detail",
        "score": 1041,
        "text_content": "",
        "comments": [
            {
                "raw_content": "someones getting fired lol",
                "author": "Merica4EVER"
            },
            {
                "raw_content": "Replace SS with Delta or equivalent bad asses. They aint getting it done and I'd rather error on the side of caution",
                "author": "Tulkas71"
            },
            {
                "raw_content": "WTF ...Butler, mar largo, now this. Wtf?",
                "author": "Counterwhat"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Our social media manager was furloughed, but making America great again isn’t 🇺🇸",
        "score": 975,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That shit is funny.",
                "author": "NancyPeloci"
            },
            {
                "raw_content": "Make MS paint great again",
                "author": "Comntrinchief"
            },
            {
                "raw_content": "Still better than anything the left comes up with.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "FBI to ADL. Fuck off.",
        "score": 1813,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Now do the SPLC",
                "author": "Hantif"
            },
            {
                "raw_content": "..TPUSA “James Comey wrote ‘love letters’ to the ADL and embedded FBI agents with them - a group that ran disgraceful ops spying on Americans,” Patel said “That era is OVER. This FBI won't partner with political fronts masquerading as watchdogs.”",
                "author": "NewGoldenAge"
            },
            {
                "raw_content": "What “ties” did the FBI have with them?",
                "author": "mercynurse"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "SICK! University of Delaware TV Network Thanks “Charlie Kirk’s Killer” – Then Deletes It, Tries to Cover It Up (VIDEO)",
        "score": 1155,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Expel the students and fire any staff/teachers involved or lose federal funding",
                "author": "Deadpool"
            },
            {
                "raw_content": "Universities are the poison that corrupts our youth",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "I dunno about this. Shitty, yes, but they also thanked cocaine, and ChatGPT. It was clearly a satirical reference. I'm really not sure where to draw the line. Still in very bad taste... Kids are stupid.",
                "author": "Nothing007"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "High Plains Grifter",
        "score": 869,
        "text_content": "",
        "comments": [
            {
                "raw_content": "El Spartacita.",
                "author": "ThorsonTT"
            },
            {
                "raw_content": "Joaquin Jeffries",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Aids Obama just cares about his voters aka illegal invaders and NOT YOU",
                "author": "mmmpillsaregood"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🤩 Walmart to Eliminate Synthetic Dyes from Store-Brand Products",
        "score": 865,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# ⚕️ **𝙼𝚊𝚔𝚎 𝙰𝚖𝚎𝚛𝚒𝚌𝚊 𝙷𝚎𝚊𝚕𝚝𝚑𝚢 𝙰𝚐𝚊𝚒𝚗**",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "In other words they still have two years worth of dyes they want to use up first.",
                "author": "XlDEN"
            },
            {
                "raw_content": "Bet they won’t stop tomorrow and show off the giant piles of poison they’re not gonna put in the food.",
                "author": "PatriotSkorzeny"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Secret Service Agent Fell Asleep on the Job at United Nations General Assembly – And Left His Semi-Automatic Rifle Unattended (PHOTOS)",
        "score": 1156,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fat, check. Black, check. Stupid, check (not the first time this happened). Dei needs to die.",
                "author": "BlackCrimesMatter"
            },
            {
                "raw_content": "> The same officer, an overweight African American man, also has been accused of leaving his semi-automatic rifle (what appears to be a SR16) unattended while taking a bathroom break from his security duties, according to these sources. Every fucking time.",
                "author": "MythArcana"
            },
            {
                "raw_content": "Holy shit. I thought this was security inside the building, which I thought was bad enough. He was OUTSIDE on the street. Fool left his weapon unattended in public, good grief. That should be a guaranteed firing.",
                "author": "mykillk"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "#1 costume this year",
        "score": 1046,
        "text_content": "",
        "comments": [
            {
                "raw_content": "meme them until they cry then make memes about them crying",
                "author": "SweetBeef"
            },
            {
                "raw_content": "Can you imagine ICE wearing these for Halloween, and to help them blend into the crowd? 🤔😏🤣",
                "author": "Deadpool"
            },
            {
                "raw_content": "Juankeem",
                "author": "grenades_and_ham"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔴A leftist decided to physically attack me at Union Station tonight. I deployed mace in self defense.",
        "score": 831,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You can't even let them get that close to you. Notice how they always slither up into your space and then sucker punch you or surprise attack you out of nowhere.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "video ended too soon. Needed to see the chem agent take effect. I need to hear their screams.",
                "author": "Cop-Morty"
            },
            {
                "raw_content": "the fuck was she doing that close? dancing for you? what the fuck was that?",
                "author": "ThePatriotGames2016"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I LOVE HAVING A VEEP THAT SPEAKS SPANISH!!!🇲🇽😂😂😂",
        "score": 1149,
        "text_content": "",
        "comments": [
            {
                "raw_content": "LMAO \"in el 2028\" Es muy malo JD",
                "author": "here2red"
            },
            {
                "raw_content": "I wish to give him taco flavored kisses.",
                "author": "posedgeclk"
            },
            {
                "raw_content": "Mucho retardo.",
                "author": "projectarcturus1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Faith in the Current Administration: The Most Openly Christian Administration in 200 Years",
        "score": 1041,
        "text_content": "",
        "comments": [
            {
                "raw_content": "God Bless President Trump.",
                "author": "VanillaCupCake"
            },
            {
                "raw_content": "In my humble opinion Zionism and true Christianity are mutually exclusive.",
                "author": "Roadpower"
            },
            {
                "raw_content": "May our Christian faith continue to grow more powerful then ever. The muzzies are wanting to be Mayor of NYC and President while never integrating, which means sharia law if we do nothing. The illegals do not assimilate and Joe Biden was a Catholic.",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "US Senate ADVANCES the confirmation of Hung Cao as Under Secretary of the Navy, 52-47. He's about to be formally CONFIRMED. Cao is a badass.",
        "score": 1659,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I do appreciate how President Trump found places in his administration for the patriots who were blatantly cheated out of their race: Kari Lake, Eric Hovde, Sam Brown, Hung Cao and several others should all be senators right now.",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "Hung tough.",
                "author": "eclectic22"
            },
            {
                "raw_content": "He should be my Senator right now but they cheated",
                "author": "hairless_ap3"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "OpenAI's Stargate project to consume up to 40% of global DRAM output — inks deal with Samsung and SK hynix to the tune of up to 900,000 wafers per month",
        "score": 446,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It might double your electricity bill and the price of your next PC, but once you see all the generated slop on youtube you'll understand why it was all worth it.",
                "author": "VastTension6022"
            },
            {
                "raw_content": "I wonder what they expect to get out of building such massive data centers. Is scaling machine power up the only way to improve the LLMs at this point or what is going on here?",
                "author": "DestroyHost"
            },
            {
                "raw_content": "When the bubble on AI inevitably pops, there's going to be so much junked hardware that I fully expect memory, cpu and nand prices to completely collapse.",
                "author": "vandreulv"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel stock pops on news company is in early talks to add AMD as a customer",
        "score": 199,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So Intel fabs part of their stuff at TSMC instead of their own foundry, and AMD fabs part of their stuff at Intel. What a weird time to be alive.",
                "author": "klti"
            },
            {
                "raw_content": "I knew I should’ve held on to my shares of intc…",
                "author": "Handsome_fart_face"
            },
            {
                "raw_content": "Maybe to replace Global Foundries I/O chiplets which don't need to be very compact, but not the good stuff.",
                "author": "HatchetHand"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Steam Hardware & Software Survey - September 2025",
        "score": 22,
        "text_content": "All 50 series Nvidia GPUs increased this month outside of the 5050 which is still not on the list. RNDA4 still missing, but that's given, as AMD GPU shipment is low overall. CPU wise - AMD gained 1.15% while Intel lost that much Windows 11 gained \\~3% as well",
        "comments": [
            {
                "raw_content": "RAM configuration 1. ⁠16GB (41.76%) 2. ⁠32GB (36.26%) 3. ⁠8GB (8.05%) 4. ⁠64GB (4.33%) Most popular VRAM configuration 1. ⁠8GB (33.66%) 2. ⁠12GB (18.99%) 3. ⁠6GB (10.40%) 4. ⁠16GB (7.52%) 5. ⁠24GB (2.3%) 16GB and 24GB GPUs are still in the minority while 8GB and 12GB are the most prevalent",
                "author": "Quiet_Try5111"
            },
            {
                "raw_content": "Most popular 50 Series: 1) RTX 5070 (1.69%) 2) RTX 5060 (1.12%) 3) RTX 5070Ti (0.91%) 4) RTX 5060Ti (0.89%) 5) RTX 5080 (0.84%) 6) RTX 5060 Laptop (0.80%) 7) RTX 5090 (0.31%) 8) RTX 5070Ti Laptop (0.21%) Most popular 40 series: 1) RTX 4060 Laptop (4.84%) 2) RTX 4060 (4.25%) 3) RTX 4060Ti (2.92%) 4) RTX 4070 (2.16%) 5) RTX 4070 Super (1.79%) 6) RTX 4050 Laptop (1.50%) 7) RTX 4070 Laptop (1.14%) 8) RTX 4070Ti (1.11%) 9) RTX 4090 (0.89%) 10) RTX 4070Ti Super (0.89%) 11) RTX 4080 (0.69%) 12) RTX 4080 Super (0.77%) 13) RTX 4080 Laptop (0.22%)",
                "author": "Quiet_Try5111"
            },
            {
                "raw_content": "Don't mind me, just waiting for the comments explaining how either rigged or broken the Steam Hardware Survey is for AMD GPUs hence we should disregard this data along with John Peddle Research data and every data survey / analyst out there.",
                "author": "ShadowRomeo"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Raspberry Pi adds $5–$10 price increases for some 4GB and 8GB products",
        "score": 81,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Even without the price increases weren’t these still overpriced? I thought I remembered several cheaper alternatives popping up years ago and most people gravitated to those because for like 6 years Raspberry Pi all but stopped selling to home users and focused on business sales.",
                "author": "ComputerEngineer0011"
            },
            {
                "raw_content": "Still waiting for a Raspberry Pi Zero 2W successor...",
                "author": "GumshoosMerchant"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Reuters: \"Arm plans to appeal final ruling in Qualcomm dispute\"",
        "score": 58,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Here's the [archive](https://archive.is/OvEpr) to the Reuters article.",
                "author": "Dakhil"
            },
            {
                "raw_content": "Ah no 😭. This shit won't end.",
                "author": "thelastsupper316"
            },
            {
                "raw_content": "More corporate sabotage by Arm sending the message that they will sue their customers. That’s about on-par with SoftBank leadership I suppose.",
                "author": "bradtraine"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Report that Qualcomm will adopt ARM v9 in Oryion CPUs",
        "score": 53,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is about Qualcomm basing their custom cores on ARM V9 Architecture and not about using ARM licensed cores in their SoC",
                "author": "Working_Sundae"
            },
            {
                "raw_content": "Good that's what I've been waiting for them to do.",
                "author": "thelastsupper316"
            },
            {
                "raw_content": "Is moving to v9 going to speed up the Orion CPU's more?",
                "author": "Top_Requirement8545"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "MSI Afterburner 4.6.6 (final) released",
        "score": 119,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is this the one which finally supports RX 9000 series GPU for voltage/frequency curve?",
                "author": "Corentinrobin29"
            },
            {
                "raw_content": "No changes since last beta btw",
                "author": "nightstalk3rxxx"
            },
            {
                "raw_content": "Huh, just yesterday I was looking into updating it in hopes that it would update rivatuner too and get rid of that reminder every boot. Saw the final update was in 2023-something, so I left it alone. It's confirmation bias / frequency illusion, of course, but odd nonetheless.",
                "author": "autumn-morning-2085"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Harvard Researchers Develop First Ever Continuously Operating Quantum Computer",
        "score": 3,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "The state of console gaming subscriptions, highest tiers right now.",
        "score": 1433,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not only that but I split it with friends for the \"family pack\". It comes to about $13/yr for each of us",
                "author": "Negative-History-110"
            },
            {
                "raw_content": "I mean Nintendo doesn’t really compare to the other two. But gamepass going up another 50% is hilarious.",
                "author": "Bootychomper23"
            },
            {
                "raw_content": "Welcome back Xbox $360",
                "author": "MultiSprawl"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Let’s goooo",
        "score": 678,
        "text_content": "I",
        "comments": [
            {
                "raw_content": "How are the motion controls? It's the only thing putting me off",
                "author": "Bombasaur101"
            },
            {
                "raw_content": "Out in a specific region?",
                "author": "ChickenOrBeans"
            },
            {
                "raw_content": "I cant wait. This is my holy grail game. I dont care if its not a giant remaster. getting it in HD for modern TVs and playable on Switch is amazing. Its my favorite game of all time",
                "author": "bambambigelowww"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "This is my only major complaint about the Switch 2",
        "score": 689,
        "text_content": "The Micro SD Express prices are beyond exorbitant, when you compare them to NVME SSD prices. The fact that you can get a top brand 2TB PCIe 5.0 SSD for less than a 1TB Micro SD EX card, which is slower than PCIe 3.0, is just insane. I looked prices of M.2 2230 NVME drives and you can get a solid PCIe 4.0 1TB one for <$100. Nintendo could have designed the S2 to fit an M.2 2230 drive, which are about the same size as a regular SD card (actually a little smaller). Such a frustrating missed opportunity.",
        "comments": [
            {
                "raw_content": "I can explain this actually. So the Switch 2 in handheld runs off only 10 watts of power. One of these drives consumes around 5-8 watts. So basically adding one of these would decrease battery life anywhere from 50-80%",
                "author": "Zyvyn"
            },
            {
                "raw_content": "Different technologies. NVME drives are a mature product. Cost is cheap now. Micro SD express is a brand new tech. It will come down in price over time.",
                "author": "RedZephon"
            },
            {
                "raw_content": "I got a 512 for $70 at Walmart.",
                "author": "Crackabean"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Out on Nintendo Switch 2 | Nintendo Switch in October. What's on your wishlist?",
        "score": 281,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Galaxy 2 and Mina. Like a 5% chance I'd check out Yooka Replayee, but the reviews would have to be ecstatic.",
                "author": "Soft_Researcher702"
            },
            {
                "raw_content": "Little Nightmares 3",
                "author": "Plus_Influence_4525"
            },
            {
                "raw_content": "What is the source of this image? Was it you who made OP? Very cool",
                "author": "likeassassin_"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Playasia order",
        "score": 116,
        "text_content": "Anyone ever encounter this?",
        "comments": [
            {
                "raw_content": "There seem to be some new laws that came into effect a few days ago that means the USPS will now trash any package or post they believe to have counterfeit postage (basically fake stamps, incorrect package details etc.). So this package has most likely already been thrown away/destroyed by USPS now and will not be delivered. [The USPS announcement from around a week ago](https://www.uspis.gov/news/scam-article/counterfeit-postage)",
                "author": "Sinomsinom"
            },
            {
                "raw_content": "Alot of folks are going through this right now with PlayAsia. Seized mail is never released as it's considered US property when that happens. I have an order which up to now seems to be fine, it just left what should be my states last sorting center and should be headed to my local post office so I'm hoping I avoid this since one of the games is not available anywhere anymore. https://www.reddit.com/r/NSCollectors/comments/1nqixpf/playasia_customer_service/",
                "author": "ollidab"
            },
            {
                "raw_content": "Happened to others in Limited Print Games https://www.reddit.com/r/LimitedPrintGames/comments/1nt4omv/play_asia_shipments_seized_for_counterfeit_postage/",
                "author": "Mikey-Insanity"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Satisfye ZenGrip2 thoughts!",
        "score": 52,
        "text_content": "Just got a ZenGrip 2! Went with the Beatemups bundle because I feel like he's just a nice guy who likes games, and his videos make me smile and relax. Also, I have a bad habit of buying everything in black, and the bright colors just caught my eye. (I always regretted getting a grey switch 1 instead of the, at the time, childish looking, but now iconic, red/blue version). All of Woods branding looks great on the case, zip pulls are cute, and the signature on the back is a nice touch. No back order on this unit, shipped out quick. DHL beat the box up, but I couldn't choose a shipper. Ordered 9/27, estimated delivery 10/03, arrived 10/01. Overall good experience ordering. Case and unit had no damage. Case is sturdy, with lots of room in the zip pouch area for... Stuff. Not sure what I'll put there. The rubber pads in the grip hold the switch 2 firmly in place. It ain't coming out unless a 2 year old starts slamming it around, and even then maybe not. Offers some protection, but that's not really it's purpose. Switch and grip fit in the case perfect, (so no need to ever remove it from the grip), and that's where the protection comes from. I can't imagine the S2 getting damaged in this case. Ergonomics are perfect. Super comfy to play with, hand pain is a thing of the past. I'm 6'5\" with large-ish hands, and it feels great to me. I cannot express in words the difference between using the grip vs using a naked S2. It's night and day. I don't think I can ever go back. Last pictures are confirmation: S2 totally docks with the ZenGrip2 installed. Zero hassle. Honestly it's exactly what you'd want. How does this compare to the Dbrand Killswitch 2? Don't know, I only have this one. But if comfort amd ease of use (never have to remove it) are your priorities, I can't imagine you'd regret getting one.",
        "comments": [
            {
                "raw_content": "The color scheme is not my cup of tea, but it looks super comfy tho",
                "author": "Obienator"
            },
            {
                "raw_content": "Still waiting for splitpad pro",
                "author": "mybutthz"
            },
            {
                "raw_content": "Beatemups... ![gif](giphy|RJAjTowsU0K1a)",
                "author": "trunks2003"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Traveling to Japan. What physical editions/exclusive merch should I look out for?",
        "score": 11,
        "text_content": "I’m going to be visiting in a week! I’ll be visiting for 7 days, and besides visiting the Nintendo Store, are there any places you’d recommend to pick up cool stuff? I’m wanting to get exclusive editions of games (for example the physical edition of Fantasy Life) and store exclusive merch if possible. Sorry for the pretty generic question, I’m a bit overwhelmed 🤣",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/tjcodtlmimsf1.png?width=1920&format=png&auto=webp&s=a5b49974b97a15952d320e3dee8feebc96deabc6 They sell these at the nintendo store in tokyo",
                "author": "blowupnekomaid"
            },
            {
                "raw_content": "Splatoon is insanely popular in Japan, there's a lot of exclusive merch there.",
                "author": "linkling1039"
            },
            {
                "raw_content": "The amiibo wall is pretty stocked, when I was there it had virtually every amiibo and variant. Also they had gatcha machines with old Nintendo controller buttons",
                "author": "poopstoodamnbig"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Fatal Fury City of the Wolves",
        "score": 9,
        "text_content": "Wonder when they are gonna bring this game to switch 2. Seems like a perfect game for handheld, same with the latest Kof",
        "comments": [
            {
                "raw_content": "Hopefully next year around the summer",
                "author": "Jeezy52"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Microsoft revamps Xbox Game Pass plans and hikes Ultimate to $29.99 a month, Removing PC Game Pass, Ultimate gets Ubisoft+ Classics",
        "score": 2241,
        "text_content": "[https://news.xbox.com/en-us/2025/10/01/xbox-game-pass-ultimate-premium-essential-plans/](https://news.xbox.com/en-us/2025/10/01/xbox-game-pass-ultimate-premium-essential-plans/) >Starting today, we're introducing three upgraded Game Pass plans based on how players play: Essential, Premium, and Ultimate. Each includes expanded game libraries, including PC titles, unlimited cloud gaming, in-game benefits (including Riot Games titles), and a revamped Rewards with Xbox experience. Today's Game Pass Core subscribers will automatically move to Essential, Standard subscribers will transition to Premium, and Ultimate subscribers will remain in the Ultimate plan. Previous Rumor: [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1nv58ow/resetera\\_moderator\\_supposed\\_upcoming\\_changes\\_to/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1nv58ow/resetera_moderator_supposed_upcoming_changes_to/)",
        "comments": [
            {
                "raw_content": "They’re out of their fucking mind",
                "author": "Ferzsc_"
            },
            {
                "raw_content": "Come again? 30 dollars?",
                "author": "fluxaboo"
            },
            {
                "raw_content": "At $30/month that's $360 a year. One might as well just go back to buying games.",
                "author": "wreemde"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "I Am Alive - leaked gameplay footage of Darkworks cancelled version of the game",
        "score": 340,
        "text_content": "Turns someone leaked gameplay footage of Darkworks version of I Am Alive years ago, I've never seen it before and it seems even Unseen64 missed it: https://youtube.com/watch?v=yugsGhsnuNY Looks far more interesting than the final game with major Spec Ops: The Line vibes. The game was supposedly near finished when Ubisoft axed it, took it away from Darkworks and restarted development with Ubisoft Shanghai, resulting in a scaled back disappointing 15$ title.",
        "comments": [
            {
                "raw_content": "God, that game. I remember a scene with a water bottle and whether to share it or something, like it was supposed to be a core gameplay mechanic to help people or not. Also using guns to hold up people without ammo. Then the game released and it was absolutely nothing like that.",
                "author": "Even-Standard7233"
            },
            {
                "raw_content": "This kind of reminds of Alone in the Dark from 2008, at least the initial section.",
                "author": "powerhcm8"
            },
            {
                "raw_content": "I remember being floored by [the teaser trailer back when I was a kid and thought a cool CG scene would make an amazing game.](https://youtu.be/HZ6Aely9YrQ?si=V1E-_VmTX1TPjq5W)",
                "author": "johnnybags44"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Warhorse studio Upcoming Upgrade and Fantasy Game Info",
        "score": 161,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Jesus christ be praised",
                "author": "Iamnotacommunist"
            },
            {
                "raw_content": "Didn’t they find the kingdom come deliverance one PS5 version on that website that pretty much confirms this rumor? I’ll try to find the post after work, but I really think this is happening and I’m super excited. I just finished the second one and that game was unbelievably fantastic and super fun. I’m gonna take a break from it before jumping into the new DLC, but that looks really fun too. Edit: https://www.reddit.com/r/kingdomcome/s/mrodxF0Swx",
                "author": "Medici1694"
            },
            {
                "raw_content": "The lack of a source is suspicious but otherwise it sounds like just an educated guess. KCD1 Remaster has already been leaked & basically confirmed at this point so that bit is true. And it's not hard to imagine them doing something new after KCD2, especially with reporting that they'd split into two internal teams to avoid burnout from only working on KCD for the past decade.",
                "author": "drumjolter01"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Iron Man and Phoenix are the final 2 characters in Marvel Cosmic Invasion",
        "score": 238,
        "text_content": "Datamined from the newly released demo on Steam. Edit: The sprite sheet also seems to confirm that Knull will be a boss [Source](https://www.reddit.com/r/CosmicInvasion/comments/1nvfrwf/roster_leak_datamine_from_the_demo/)",
        "comments": [
            {
                "raw_content": "Can’t wait for this game. Also hoping Disney works with someone to do like a Star Wars heroes version of this.",
                "author": "spiderman897"
            },
            {
                "raw_content": "Certainly a choice to take so long for Iron Man",
                "author": "Placidao"
            },
            {
                "raw_content": "I don’t get why none of the FF are playable when annihilus’ story is intertwined with them",
                "author": "Forsaken_Baby_1725"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Eurogamer: Ubisoft and Tencent announce new subsidiary, Vantage Studios, to lead development for the Assassin’s Creed, Far Cry, Rainbow Six franchises",
        "score": 365,
        "text_content": ">The breakout game development business co-owned by Tencent and Ubisoft finally has a name: Vantage Studios. Eurogamer understands from a source that it's starting operations today, and will be responsible for new games across many of Ubisoft's biggest IPs, such as Far Cry, Rainbow Six Siege, and Assassin's Creed. >Vantage Studios is composed of 2,300 employees across multiple Ubisoft game development teams, including those from Montreal Quebec, Sherbrooke, Saguenay, Sofia, and Barcelona. The studio will be run by the duo of Christophe Derennes and Charlie Guillemot. Vantage Studios operate under a less centralised model compared to Ubisoft proper, with each development team having more ownership over its own respective project. This in theory would allow developers to be more fluid, and pivot according to industry changes and player expectations, per Eurogamer sources. [Source](https://www.eurogamer.net/ubisoft-and-tencent-announce-new-subsidiary-vantage-studios-to-lead-development-for-the-assassins-creed-far-cry-rainbow-six-franchises)",
        "comments": [
            {
                "raw_content": "you can fit so many cancellations into this bad boy",
                "author": "scott1swann"
            },
            {
                "raw_content": "BTW Charlie Guillemot is the son of Yves Guillemot. Yes, he is the one with the NFTs. Totally not a nepobaby.",
                "author": "Aggressive_Rope_4201"
            },
            {
                "raw_content": "Am I misremembering or has this been known for months?",
                "author": "LogicalError_007"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "ResetEra Moderator: Supposed upcoming changes to Game Pass (Price increase, tier name changes, free with advertisments tier)",
        "score": 560,
        "text_content": "A ResetEra moderator decided to share upcoming Game Pass changes coming soon. >\"PC Gamepass going away and will be GamePass Standard and GamePass Core and no day 1 games. Increase in price for GamePass Ultimate to $25 (this may be delayed to 2026) Cloud streaming included in all tiers >Subscription name changes,similar to PSN tiers (unconfirmed): Gamepass core -> gamepass essential Gamepass Standard -> Gamepass premium >2026: >cheaper ad based tier streaming only free/cheap tier, time based and forced ads >PC will be rolled into Standard and core will not have access to Day One launch games. Ultimate will be the only tier with access to day one launch games.\" Source: [https://www.resetera.com/threads/rumor-big-changes-to-gamepass-including-a-free-cheaper-tier-with-ads.1313263/](https://www.resetera.com/threads/rumor-big-changes-to-gamepass-including-a-free-cheaper-tier-with-ads.1313263/) **EDIT** Shinobi602 posted with a grimace face emoji, \"More than that\". Shinobi responded to \"More than that as in more expensive? Or more changes?\" saying \"The former\", meaning Game Pass might be even more expensive with the rumoured price increase. Shibobi post: [https://www.resetera.com/threads/rumor-big-changes-to-gamepass-including-a-free-cheaper-tier-with-ads.1313263/post-145876027](https://www.resetera.com/threads/rumor-big-changes-to-gamepass-including-a-free-cheaper-tier-with-ads.1313263/post-145876027)",
        "comments": [
            {
                "raw_content": "Core and standard are the differential names? Jesus Christ.",
                "author": "galgor_"
            },
            {
                "raw_content": "Man. I've had gamepass for a while, it's gonna feel weird cancelling it. That's the way it goes though I guess",
                "author": "Keviticas"
            },
            {
                "raw_content": "From putting their games on other platforms, to increasing the price of their hardware twice in 6 months, to making these awful changes to Game Pass, Microsoft has done a great job in encouraging everyone NOT to invest in an Xbox.",
                "author": "MuptonBossman"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel rumored to introduce \"Core Ultra X\" tier CPUs alongside Panther Lake",
        "score": 41,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Core Ultra XXX for HEDT",
                "author": "Lord_Muddbutter"
            },
            {
                "raw_content": "I honestly hope it will be competitive in price if not performance. I use Intel's 258V, it is a solid performer and great on battery life. Not sure if Panther Lake will pan out, but one can hope",
                "author": "Alauzhen"
            },
            {
                "raw_content": "We’ve seen the 6980P on Newegg. Maybe it’s Granite Rapids-W? I think that will use 7529 with up to 86 cores. GNR with an unlocked multiplier would be sick.",
                "author": "JRAP555"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "PC Build Questions, Purchase Advice and Technical Support Megathread — Q4 2025 Edition",
        "score": 8,
        "text_content": "Welcome to the r/AMD Q4 2025 PC build questions, purchase advice and technical support megathread — if you have questions about AMD hardware, need help with a purchasing decision, PC build question or require technical support, **please read this post in full, as the majority of issues or queries can be resolved or answered by trying the steps outlined in this post or visiting one of the recommended websites, subreddits or forums linked below.** Remember that r/AMD **is not** a technical support, purchase advice or PC building help subreddit. r/AMD is community run and does not represent AMD in any capacity unless specified — there is no guarantee anything posted in this thread or subreddit will be seen by AMD. If you want your query or issue is seen by AMD, please visit the [AMD Community Forums](https://community.amd.com/) or by contacting [AMD Support.](https://www.amd.com/en/support.html) If you've **discovered a bug and want to report it**, use the [AMD Bug Report Tool](https://www.amd.com/en/resources/support-articles/faqs/AMDBRT.html) and include as much information as possible — AMD can't fix something unless they know it exists and have enough information to reproduce it. The [AMD Community](https://discord.com/invite/012GQHBzIwq1ipkDg) and [AMD Red Team](https://discord.com/invite/k4wtjuQ) Discord servers are also available to ask questions and get help from other AMD users and PC enthusiasts. The [Wikipedia](https://www.reddit.com/r/Amd/wiki/index) also contains answers to common questions, troubleshooting tips, how you can check if your PC is stable, a jargon buster for FSR, RSR, EXPO, SAM, HYPR-RX and more. It's strongly recommended to read the [Wikipedia](https://www.reddit.com/r/Amd/wiki/index), in addition to what is detailed below, before you make any post in this thread. AMD Support also has many solutions and troubleshooting guides you may find helpful: * [AMD Software Help Center](https://www.amd.com/en/support/graphics/software.html) * [Troubleshooting Tips for Resolving System Stability Issues](https://www.amd.com/en/resources/support-articles/faqs/TS-TIPS.html) * [Troubleshooting System Stability Issues](https://www.amd.com/en/resources/support-articles/faqs/PIBRMATS2.html) * [Troubleshooting Common Boot Failures](https://www.amd.com/en/resources/support-articles/faqs/PIBRMATS1.html) * [How to Troubleshoot Power Supply Issues](https://www.amd.com/en/resources/support-articles/faqs/GPU-104.html) * [Troubleshooting CPU Performance and Temperature Issues](https://www.amd.com/en/resources/support-articles/faqs/PIBRMATS3.html) * [Information About PCIe Riser Cable and Extender Compatibility with PCIe Gen 4.0 Desktop Systems](https://www.amd.com/en/resources/support-articles/faqs/PA-270.html) **You may also want to consider the following subreddits, websites and forums, which may be more appropriate for your question or issue and may increase the chances of getting a helpful response**. --- r/AMDHelp: Troubleshooting help Subreddit for all things AMD! [PCPartPicker](https://pcpartpicker.com/): PCPartPicker provides computer part selection, compatibility, and pricing guidance for do-it-yourself computer builders. Assemble your virtual part lists with PCPartPicker and we'll provide compatibility guidance with up-to-date pricing from dozens of the most popular online retailers. We make it easy to share your part list with others, and our community forums provide a great place to discuss ideas and solicit feedback. r/buildapc: Planning on building a computer but need some advice? This is the place to ask! /r/buildapc is a community-driven subreddit dedicated to custom PC assembly. Anyone is welcome to seek the input of our helpful community as they piece together their desktop. r/pcmasterrace: Welcome to the official subreddit of the PC Master Race / PCMR! All PC-related content is welcome, including build help, tech support, and any doubt one might have about PC ownership. You don't necessarily need a PC to be a member of the PCMR. You just have to love PCs. It's not about the hardware in your rig, but the software in your heart! Join us in celebrating and promoting tech, knowledge, and the best gaming, study, and work platform there exists. The Personal Computer. [OBS (Open Broadcaster Software) Forums](https://obsproject.com/forum/): Discussion forums for OBS Studio, the free and open source software for video recording and live streaming. r/overclocking: All things overclocking go here. Learn to overclock, ask experienced users your questions, boast your rock-stable, sky-high OC and help others! r/techsupport: Stumped on a tech problem? Ask the community and try to help others with their problems as well. [ASRock Forum](https://www.asrock.com/support/forum.asp): Wanna discuss or find out something for your ASRock products? Come and get in ASRock worldwide forums to chat with ASRock global users! [ASUS Republic of Gamers (ROG) Forums](https://rog-forum.asus.com/): Discuss and discover the best ways to make the most out of your ROG gear. [MSI Global English Forum](https://forum-en.msi.com/index.php): Need more people to discuss with? Click here to find help. r/buildapcforme: A subreddit dedicated to helping those looking to assemble their own PC without having to spend weeks researching and trying to find the right parts. From basic budget PCs to HTPCs to high end gaming rigs and workstations, get the help you need designing a build that precisely fits your needs and budget. r/GamingLaptops: Definitive hub for gaming laptop enthusiasts—insights, reviews, news, expert advice, and latest trends. r/SuggestALaptop: A place for prospective laptop buyers to get suggestions from people who know the intimate details of the hardware. --- If you are having an issue with or need to raise an RMA for a product not directly from AMD, you may want to consider contacting the manufacturer of your laptop, graphics card, motherboard or system. Below we have linked the support pages for the most common brands and manufacturers that sell AMD graphics cards, motherboards and systems. --- [XFX Support](https://www.xfxforce.com/support/contact-us) [SAPPHIRE Customer Service](https://support.sapphiretech.com/Default.asp?lang=eng) [PowerColor Service Support](https://www.powercolor.com/contact) [MSI Service And Support](https://www.msi.com/support) [Gigabyte Support Services Center](https://www.gigabyte.com/Support) [ASRock Support](https://www.asrock.com/support/) [ASUS Support](https://www.asus.com/support/) [Dell/Alienware Support](https://www.dell.com/support/home/) [HP Customer Support](https://support.hp.com/) [Lenovo Technical Support](https://support.lenovo.com/) [ACER Support](https://www.acer.com/support) --- # READ BEFORE POSTING — READ BEFORE POSTING — READ BEFORE POSTING If you are experiencing any issues, including, but not limited to; games or programs crashing, system crashes, hangs, blue screens of death (BSoD), driver timeouts, system not starting, system freezes, data corruption, system shutting down unexpectedly, visual artifacts, lower than expected performance or any other issue, **please read and try the following before making a post** — the majority of problems can be resolved by trying the steps listed below. The suggestions below are not necessarily in any particular order, if a step has already been performed or is not relevant, please move to the next step. * If your system won't power on, make sure all cables are plugged in and seated correctly, that the power supply is plugged into a working wall outlet and any switches on the wall outlet and/or power supply are in the ON position. It's also worth check your front panel connectors to make sure they are connected properly and trying a different wall outlet. * If you have any power related issues, like your system not starting, shutting down, sleeping, restarting or waking from sleep, try to test with another power supply, as unstable voltages (such as on the 12V, 5V, 5VSB and 3.3V rails) can cause a myriad of issues that can be inconsistent and hard to diagnose. * Make sure your memory modules (RAM) are installed in the primary DIMM slots, as some motherboards will not POST (Power-on self-test) if the memory is installed in the secondary DIMM slots. The primary DIMM slots should be labelled on the motherboard or specified in the motherboard manual. * If your system does power on, but won't get past the POST screen, please ensure your CPU, RAM and GPU are installed correctly and try clearing the CMOS. This can usually be done by disconnecting the motherboard from power and removing the CMOS battery for a few minutes. Some motherboards may also have clear CMOS reset jumpers or buttons you can use, please consult your motherboard or system manual on how to clear the CMOS. * If your system still won't POST, check if your motherboard has a Debug LED and consult your motherboard manual to check what step it's stuck on. * Make your motherboard is compatible with the CPU you have — most AM4 and AM5 motherboards should have BIOS flashback, which will allow you to update the BIOS without needing a CPU or RAM installed. Consult your motherboard manual as the BIOS flashback procedure will very depending on the make and model. When using BIOS flashback, we recommend using a USB 2.0 drive that is 8GB or less and formatted as FAT32, as some implementations of BIOS flashback don't work reliably with USB 3.0 drives and/or USB drives that are larger than 8GB. * If you are using an AMD Radeon RX 6000, RX 7000, RX 9000 or NVIDIA GeForce RTX 30, RTX 40 or RTX 50 GPU, please ensure you are using separate 6 - 8pin PCIe cables or dedicated 12VHPWR/12V-2x6 cables and not using daisy-chained or splitter cables, as these may not be able to supply adequate power to the GPU — some cards may have LED indicators by the connector to let you know if the GPU isn't receiving enough power. Please consult your GPU and PSU manual for information on how to correctly connect your GPU. * Make sure your Monitor or TV is plugged into the HDMI or DisplayPort output from your graphics card and not the motherboard. If this still doesn't work, try a different Monitor or TV and if you are using any HDMI or DisplayPort adapters, converters or splitters, remove these and use a direct connection, try switching between HDMI and DisplayPort and try different HDMI or DisplayPort cables to rule out any problems here. For best results, always use certified HDMI or DisplayPort cables. * Make sure you are running the latest software updates for your operating system, games and applications. * Scan your PC for any viruses or malware using Windows Security (formerly Windows Defender) or other reputable Anti-Virus or Anti-Malware solution, as malware, viruses, adware and other unwanted software can cause crashes, freezes, hangs and other performance, security, stability and compatibility issues. * Make sure you are running the latest [AMD Chipset or Graphics Drivers](https://www.amd.com/en/support/download/drivers.html). Some devices, such as laptops and handhelds may have custom hardware IDs or other manufacturer changes, in which case, you may have to download drivers from the device manufacturer's support page. * If you need to reinstall GPU drivers, we recommend using the [AMD Cleanup Utility](https://www.amd.com/en/resources/support-articles/faqs/GPU-601.html) or [Display Driver Uninstaller (DDU)](https://www.wagnardsoft.com/display-driver-uninstaller-DDU-) to perform a clean installation of the GPU drivers, a guide on how to use DDU can be found [here](https://docs.google.com/document/d/1xRRx_3r8GgCpBAMuhT9n5kK6Zse_DYKWvjsW0rLcYQ0/edit) * If you have installed GPU drivers after using the AMD Cleanup Utility or DDU, you may experience stutter in some games while the shaders are cached again. * If Windows Update is replacing your GPU drivers (example of what that looks like [here](https://imgur.com/a/DLLMZ3L)) please [view the following thread](https://www.reddit.com/r/Amd/comments/1hdjxba/guide_how_to_resolve_windows_update_installing/) on the steps you can take to resolve and prevent this happening in future. * If you are on Windows 10 or Windows 11 and experience flickering, stuttering or brightness issues during gaming or video playback with hardware acceleration enabled, try disabling Multiplane Overlay (MPO), as some users have reported this has resolved their issues — more information on disabling MPO is available in this [thread](https://www.reddit.com/r/Amd/comments/yvyqc7/disabling_multiplane_overlay_mpo_fixed_all/). * If a game is crashing, freezing, not starting, performing poorly or having other issues, please verify and repair the game files through [Steam](https://help.steampowered.com/en/faqs/view/0C48-FCBD-DA71-93EB), [Epic Games Store](https://www.epicgames.com/help/en-US/c-Category_EpicGamesStore/c-EpicGamesStore_LauncherSupport/how-do-i-verify-game-files-in-the-epic-games-launcher-a000084923#:~:text=Find%20the%20game%20in%20your,Click%20the%20Verify%20button), [Ubisoft Connect](https://www.ubisoft.com/en-us/help/connectivity-and-performance/article/verifying-game-files-in-ubisoft-connect-pc/000060529), [EA App](https://answers.ea.com/t5/EA-Services-General-Questions/How-to-verify-game-files-of-installed-games/m-p/6578960), [GOG Galaxy](https://support.gog.com/hc/en-us/articles/360003930017-My-game-data-is-corrupt-How-can-I-repair-my-game), [Battle.net](https://battle.net/support/article/7655) or whichever game client you are using. * If a program is crashing, freezing, not starting, performing poorly or having other issues, please reinstall the program or attempt to repair the installation using the program installer/uninstaller. * If you are on Windows and are experiencing stuttering or lower than expected performance, make sure you are using the Balanced or High Performance power plan and restore them to their default values, this can be checked under Control Panel > System and Security > Power Options. * Make sure you are using the latest BIOS, Firmware and Drivers for your motherboard, laptop, desktop and any other components and peripherals you have connected to your system. These updates often contain bug fixes, new features and improve compatibility and interoperability. * If you have any overclocks, underclocks, overvolts, undervolts, custom power curves or similar: **revert everything to stock clocks, timings, voltages and settings**, this includes disabling XMP/EXPO/DOCP — to do this, go into your BIOS and restore the factory settings — this is typically labelled 'Restore Default', 'Restore Optimized Defaults', 'Load Optimized Defaults' or some similar variation. If you are using other utilities like MSI Afterburner or Ryzen Master, you may also have to restore default settings in those utilities as well. * If you are using Windows 10 or Windows 11, use the built-in System File Checker (SFC) and Deployment Image Servicing and Management (DISM) commands to check for any corrupt or missing operating system files and attempt to repair them, a guide is available here * If you have a custom built PC, recently upgraded, started overclocking or want to know if your current PSU will support a hardware upgrade, please use one of the *below PSU calculators* and make sure the PSU you have (or intend to buy) can supply enough power when your system is under full load — If your PSU isn't able to supply enough power, you are likely to have issues starting your system and may experience system shutdown when under load. * PSU Calculators: [FSP](https://www.fsplifestyle.com/landing/calculator.html) — [Cooler Master](https://www.coolermaster.com/power-supply-calculator/) — [Seasonic](https://seasonic.com/wattage-calculator) — [Newegg](https://www.newegg.com/tools/power-supply-calculator/) — [be quiet!](https://www.bequiet.com/en/psucalculator) — [MSI](https://www.msi.com/power-supply-calculator) — You can also add all your components into [PCPartPicker](https://pcpartpicker.com/list/) and it will provide an estimate wattage. * Try and apply common sense to an issue, for example if you have flickering on your TV or Monitor, try simple things like changing the HDMI or DisplayPort cable and port on the GPU and display you are using. If you've recently installed a mod and that game now crashes, uninstall that mod. If one of your memory modules is no longer being detected, is there any physical damage to the memory module, DIMM slot on the motherboard or pins, have you tried reseating it etc... * If you experience crashes, freezes, unexpected shutdown or just want to check if your system is stable, you can stability test your system with the utilities linked below. Remember that **just because your system turns on, doesn't make it stable** and that overclocking is not guaranteed and can vary depending on the setup you have and the silicon lottery of your CPU/GPU/RAM, you should always thoroughly stability test your system — many reading this post will have unstable systems and won't even know it. --- [OCCT](https://www.ocbase.com/occt/personal) — OCCT is the only comprehensive stability testing software available. 20 years of experience have proved OCCT to be the community's software of choice in terms of stability and performance testing. CPU, GPU, Memory, VRAM, Power supplies are tested in the most efficient and accurate way possible. If there's anything wrong, we'll find it and report it. OCCT includes many advanced features, ranging from per-core CPU testing, varying GPU loads, and much more. [Prime95](https://www.mersenne.org/download/) — Prime95 has been a popular choice for stress / torture testing a CPU since its introduction, especially with overclockers and system builders. Since the software makes heavy use of the processor's integer and floating point instructions, it feeds the processor a consistent and verifiable workload to test the stability of the CPU and the L1/L2/L3 processor cache. Additionally, it uses all of the cores of a multi-CPU / multi-core system to ensure a high-load stress test environment. [AIDA64 Extreme](https://www.aida64.com/downloads/latesta64xe) — AIDA64 Extreme is an industry-leading system information tool, loved by PC enthusiasts around the world, which not only provides extremely detailed information about both hardware and installed software, but also helps users diagnose issues and offers benchmarks to measure the performance of the computer. [Furmark 2](https://geeks3d.com/furmark/downloads/) — FurMark 2 is the successor of the venerable FurMark 1 and is a very intensive GPU stress test on Windows (32-bit and 64-bit) and Linux (32-bit and 64-bit) platforms. It's also a quick OpenGL and Vulkan graphics benchmark with online scores. FurMark 2 has an improved command line support and is built with GeeXLab. [MSI Kombustor](https://geeks3d.com/furmark/kombustor/downloads/) — MSI Kombustor is MSI's exclusive burn-in benchmarking tool based on the well-known FurMark software. This program is specifically designed to push your graphics card to the limits to test stability and thermal performance. Kombustor supports cutting edge 3D APIs such as OpenGL or Vulkan. [MemTest86](https://www.memtest86.com/download.htm) — MemTest86 boots from a USB flash drive and tests the RAM in your computer for faults using a series of comprehensive algorithms and test patterns. Bad RAM is one of the most frustrating computer problems to have as symptoms are often random and hard to pin down. MemTest86 can help diagnose faulty RAM (or rule it out as a cause of system instability). As such it is often used by system builders, PC repair stores, overclockers & PC manufacturers. [MemTest86+](https://memtest.org/) — Memtest86+ is a stand-alone memory tester for x86 and x86-64 architecture computers. It provides a more thorough memory check than that provided by BIOS memory tests. Memtest86+ can be loaded and run either directly by a PC BIOS (legacy or UEFI) or via an intermediate bootloader that supports the Linux 16-bit, 32-bit, 64-bit, or EFI handover boot protocol. It should work on any Pentium class or later 32-bit or 64-bit x86 CPU. [SeaTools](https://www.seagate.com/support/downloads/) — Quickly determine the condition of the drive in your computer with this comprehensive, easy-to-use diagnostic. --- For more advanced SSD/HDD diagnostic utilities, please check the website of your SSD/HDD manufacturer, as they usually offer manufacturer specific software to check the health of the drive and update drive firmware, some examples include [Samsung Magician](https://semiconductor.samsung.com/consumer-storage/magician/), [SanDisk Dashboard](https://support-en.sandisk.com/app/answers/detailweb/a_id/31759), [Western Digital Kitfox](https://support-en.wd.com/app/answers/detailweb/a_id/51537/~/download%2C-install%2C-test-drive-and-erase-using-western-digital-kitfox), [Corsair SSD Toolbox](https://www.corsair.com/downloads) and [Crucial Storage Executive](https://www.crucial.com/support/storage-executive). Some motherboards, laptops and desktops may also have built-in BIOS diagnostic utilities to stress test certain components or the entire system. Please consult your motherboard or system manual for more information. A truly stable system should be able to run any of these utilities or built-in diagnostics without any crashes, freezes, errors or other issues. These utilities can help you narrow down which component(s) in your system are faulty, aren't installed correctly or have unstable overclocks, underclocks, overvolts, undervolts, custom power curves etc... If you require help using any of these programs, please read the help sections on each website or use Google and YouTube, as there are a plethora of guides and tutorials available. If you have tried all of the above and are still facing the same issue, please **backup any important files/data** and perform a reinstall/clean install of Windows, using a USB or DVD. **Only use Windows ISO images that come directly from Microsoft.** The latest Windows 10 and Windows 11 ISO images can be downloaded from the Microsoft [Software Download](https://www.microsoft.com/software-download/) page and you can create a bootable USB or DVD by using the Media Creation Tool. It's not recommended to use utilities or programs which modify Windows or to use 3rd party, custom or slimmed Windows ISO images, as these are non-standard ISO images, they could have viruses, malware and may cause stability and compatibility issues. If you have done all the above steps and are still facing an issue, please follow the below template for submitting a request, the more detail you can include the better. **If you post something like 'pc crashes', don't list your PC specifications, what you've tried to resolve the issue or don't provide any helpful information, then don't expect a response, as there's not enough useful information to go on and it will be assumed you haven't read this post or tried any of the steps outlined above.** *Below is an example template you could use...* **Summary of the issue**: The Last of Us Part II Remastered will crash when compiling shaders with Adrenalin 25.6.2, this is not an issue if you revert to the WHQL Adrenalin 25.6.1 drivers **What I've tried to solve the issue**: I have reinstalled 25.6.2 with the AMD Cleanup Utility, reset my in-game graphics settings, verified game files in Steam and re-compiled shaders to confirm the issue. **System specifications:** * Operating System: Windows 11 24H2, OS Build 26100.4482 (Windows Key + R and type winver) * CPU: AMD Ryzen 5 9600X, default settings, cooled by Cooler Master MasterAir MA824 Stealth * GPU: Sapphire Radeon RX RX 9060 XT Nitro+, default settings * Motherboard: MSI MAG B850M MORTAR WIFI with 7E61v1A4 BIOS * RAM: G.Skill Trident Z5 Neo RGB (F5-6000J3238F16GX2-TZ5NR) 32GB DDR5-6000 CL32 with EXPO enabled * Storage: 1TB Samsung 9100 PRO, using motherboard heatsink * PSU: be quiet! Power Zone 2 750W * Display: MSI 27\" MAG 271QPX QD-OLED E2 240Hz OLED with Certified Ultra High Speed HDMI Cable If you are using a prebuilt PC or don't know your full specifications, please include as much information as you can, e.g, HP Z2 Mini G1a workstation with an AMD Ryzen AI MAX+ PRO 395, AMD Radeon 8060S Graphics, 128GB RAM, 2TB SSD and Windows 11. Please include any logs, dump files, videos, screenshots and images of the inside of your case and setup, as this will assist in answering questions relating to airflow, cabling and component installation. We would like to reiterate that r/AMD is community run and does not represent AMD in any capacity unless specified — there is **no guarantee anything posted in this thread or subreddit will be seen by AMD.** If you have any suggestions on how to improve this megathread or the Wikipedia, please [message us](https://www.reddit.com/message/compose/?to=/r/Amd) with your suggestion.",
        "comments": [
            {
                "raw_content": "Looking for some help on a ram purchase decision. I have repurposed my old rig into a little home server and have run into a need for more ram. The issue is that in the capacity I need, I am not able to find anything on my motherboard's QVL list available anywhere. Since this is 1st gen Ryzen, I know it's not as straightforward, but it's old enough that all the recommendations I can find online are not available or for \\~8 AGESA versions ago. **System Specifications:** * Operating System: TrueNAS Scale v25.04.0 * CPU: AMD Ryzen 5 1600, default settings, cooled by stock AMD Wraith Spire * GPU: NVIDIA GeForce GTX 750T (ASROCK)i, default settings * Motherboard: ASRock X370 Killer SLI/ac with P7.10 BIOS * RAM: G.Skill Trident Z (F4-3200C16D-16GTZB) 16GB (2x8GB) DDR4-3200 CL16 with EXPO enabled * Storage: OS is running on a mirrored pair of LITE-ON SATA M.2 drives at 32 GB each. 8 spinning rust disks, and a pair of Micron SATA 256 GB ssds for my app pool * PSU: Corsair CX 750M * Display: headless I'm running a few other apps (audiobookshelf, mealie, minecraft, plex, and scrutiny. Between the system and these few apps, my ram gets maxed quickly when I have the Minecraft server actively running (it's just my son and I who use it). Trying to get to 32GB as it's the max this CPU can handle and there's nothing on the QVL that I can find available even on the secondary market except for some extortionist $300+ new old stock. Any recommendation here? Are there certain sets and speeds/timings to look for with the first gen chips? Do I just need to get something in the right area and downclock it? I recall Trident Z being recommended for stability with 1st gen Ryzen. Are there others? Just trying to minimize the lottery risks of 1st gen compatibility if I can. Thank you!",
                "author": "mattrblackwell"
            },
            {
                "raw_content": "I want to record clips using AMD Adrenaline that capture both of my monitors simultaneously (1440p main + 1080p secondary), but currently clips only record one screen at a time, often the wrong one. I tried using AMD Eyefinity, but I wasn't satisfied with the results. After reading about it, I understood it was because Eyefinity downscales my 1440p monitor to match the 1080p resolution, which defeats the purpose of having a higher resolution main display. **System Specifications:** * Operating System: Windows 11 * CPU: Intel Core i5-10400, default settings * GPU: AMD Radeon RX 6650 XT, default settings * Monitors: * Main: Game Factor MG701 (1440p) - DisplayPort * Secondary: ASUS VG24VQ1B (1080p) - HDMI Sometimes I'm gaming or watching something on the secondary monitor and want to capture a moment, but the clip records my main screen instead (or vice versa). Is there any way to configure AMD Adrenaline to capture both displays at their native resolutions simultaneously without having to merge them into a single desktop via Eyefinity? Thank you!",
                "author": "Lalonchera19"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD FSR 4 on Radeon RX 6000 “RDNA2” works with latest drivers using simple file swap workaround - VideoCardz.com",
        "score": 314,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Once the drivers are installed with the swapped files, do i get the option to enable fsr4 on any game that supports it ? its that easy ?",
                "author": "ireg4all"
            },
            {
                "raw_content": "Neat, hopefully they make it official. I would love to try it on my 6950XT",
                "author": "Symphonic7"
            },
            {
                "raw_content": "Also works on Linux (and seemingly does so better than on Windows).",
                "author": "kiffmet"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "ASUS says \"As You Wish\", releases AYW Gaming B850M motherboard for AMD Ryzen CPU overclocking",
        "score": 49,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Much like the MSI counterpart, too late to the party",
                "author": "Nunkuruji"
            },
            {
                "raw_content": "Oh so that's what AYW stands for...",
                "author": "Swooferfan"
            },
            {
                "raw_content": "Nothing about global release.",
                "author": "Obvious_Drive_1506"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Homeowners With Sub-4% Mortgage Rates Are On the Move—and They’re Buying Newly Built Homes",
        "score": 124,
        "text_content": "",
        "comments": [
            {
                "raw_content": "As the sub 4% rate owners gain enough equity and rates come down for new buyers, many of those sub 4%’era will slowly cash out and move, using their gains to either pay off or put a significant down payment on a new house. That’s what happening here.",
                "author": "fatfiremarshallbill"
            },
            {
                "raw_content": "\"Many potential borrowers feel 'trapped' by their current rates\" Oh what a horrible trap, to own a home with sub-4% mortgage. I don't know how they even cope with that dread.",
                "author": "Giantmeteor_we_needU"
            },
            {
                "raw_content": "It's crazy to think how if an average American making about $40,000 got offered a \"life-changing\" job opportunity to move for a $20,000 raise, then there's a very real chance they're better off just not progressing their career and staying in their current home to keep their rates.",
                "author": "Dapper-Maybe-5347"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "A Once Unstoppable Luxury Housing Market Is Starting to Crack",
        "score": 172,
        "text_content": "**Luxury Market Slowdown** * Luxury home sales in the U.S. dropped 0.7% year-over-year for the three months ending August 31, marking the lowest level since 2013, according to Redfin. * Price growth also slowed: median luxury sale price rose 3.9%, down from 6.1% the previous year. * Economic uncertainty and volatile household wealth—especially after the April tariff shock—have made wealthy buyers more cautious. **Regional Trends** * Dallas–Fort Worth: Prices returning to pre-pandemic norms; inventory rising; buyers rushing to purchase before interest-rate cuts drive prices up. * San Francisco Bay Area: August sales above $5 million fell 13% year-over-year. * Miami: Sales dropped 19.4%, despite a 9.8% rise in median luxury prices; low inventory is driving prices higher. * Tampa: Hurricane damage and rising inventory led to a 9.4% drop in sales and a 5.5% dip in prices. **Where Sales Are Rising** * Indianapolis: Luxury sales rose 19.1%; inventory up 16.1%; homes selling quickly, including multimillion-dollar estates. * Fort Worth: Sales up 14%; listings jumped 25.7%; spec homes selling within days. **Buyer Behavior & Market Sentiment** * Buyers in the $2.5M+ range are less rate-sensitive but more value-conscious. * Luxury prices, inflated during COVID, are now normalizing. * Life events (job changes, family growth, etc.) are pushing some sellers back into the market.",
        "comments": [
            {
                "raw_content": "I'm in Kansas City and I've noticed that all the 400k houses are now 350k just in the past 3 months.",
                "author": "GrubberBandit"
            },
            {
                "raw_content": "\"buyers rushing to purchase before interest-rate cuts drive prices up.\" Knife catchers detected.",
                "author": "PresidentAdolphMusk"
            },
            {
                "raw_content": "Make those lowball offers. No one raises a flag at market bottom. You only see it in retrospect. Lowball offers can provide insurance against further drops, meanwhile locking in the current declines. The prospect of declines may make more desperate sellers willing to negotiate.",
                "author": "GurProfessional9534"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage refinance demand plunges 21%, as interest rates hit 3-week high",
        "score": 112,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's wild that there isn't just a live chart for this stuff.",
                "author": "MysticHLE"
            },
            {
                "raw_content": "There goes the pent up demand lol",
                "author": "sifl1202"
            },
            {
                "raw_content": "KEY POINTS * The average contract interest rate for 30-year fixed-rate mortgages with conforming loan balances, $806,500 or less, increased to 6.46% from 6.34% * Applications to refinance a home loan fell 21% for the week and were 16% higher than the same week one year ago. * Applications for a mortgage to purchase a home dropped 1% for the week and were 16% higher than the same week one year ago. A brief roller-coaster ride for mortgage rates caused yet another swing in demand. After dropping to a three-year low two weeks ago, rates then shot right back up again. As a result, total mortgage application volume declined 12.7% last week compared with the previous week, according to the Mortgage Bankers Association’s seasonally adjusted index. The drop was mostly driven by a pullback in refinancing. Applications to refinance a home loan fell 21% for the week and were 16% higher than the same week one year ago. This, even though mortgage rates were 32 basis points higher last week than the year before. The refinance share of mortgage activity decreased to 55% of total applications from 60% the previous week. The average contract interest rate for 30-year fixed-rate mortgages with conforming loan balances, $806,500 or less, increased to 6.46% from 6.34%, with points rising to 0.61 from 0.57, including the origination fee, for loans with a 20% down payment. “Mortgage rates increased to its highest level in three weeks as Treasury yields pushed higher on recent, stronger than expected economic data. After the burst in refinancing activity over the past month, this reversal in mortgage rates led to a sizeable drop in refinance applications, consistent with our view that refinance opportunities this year will be short-lived,” said Joel Kan, vice president and deputy chief economist at the MBA. Refinance activity pulled back for all loan types, including a 22% drop in conventional refinances and a 27% decline in VA refinances. The average loan size for refinances fell to $380,100 from $461,300 two weeks ago, “as these higher rates eliminated the refinance incentive for many borrowers with large loans,” added Kan. Applications for a mortgage to purchase a home declined 1% for the week and were 16% higher than the same week one year ago. This is after three consecutive weeks of gains. “The strength of the purchase market has also been impacted by other factors such as broader economic conditions, the health of the job market, and housing inventory,” said Kan. Housing inventory in August fell for the first time since the beginning of this year, according to a recent report from the National Association of Realtors. While homes are sitting on the market longer now, keeping supply higher than a year ago, more sellers are starting to delist their properties. Other potential sellers are choosing to wait for a better market. Mortgage rates haven’t moved at all at the start of this week. The expectation was that rates could move more decisively on Friday, when the monthly employment report was set for release, but the government shutdown now has that in limbo.",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Starter-Home Sales Up 4% as Demand for Higher-Priced Options Stumbles",
        "score": 29,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Starter homes? What are those? The only kind of housing being built around me are mcmansions and medium rise apartments",
                "author": "WrongThinkBadSpeak"
            },
            {
                "raw_content": "What is the definition of a starter home these days?",
                "author": "HerefortheTuna"
            },
            {
                "raw_content": "Berkshire Hathaway put out article recently saying they expected smaller homes to rise in value as boomers downsize and also first home buyers as well look to buy smaller houses",
                "author": "Nearing_retirement"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "How bad is this going to age",
        "score": 660,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"This is likely the best it will be\" They said, with no evidence as to why it would randomly stop at this exact point",
                "author": "Impossible-Topic9558"
            },
            {
                "raw_content": "That is called living in denial.",
                "author": "Healthy-Nebula-3603"
            },
            {
                "raw_content": "The whole world needs to wake up.",
                "author": "Enormous-Angstrom"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Unlocked consistency for sora 2",
        "score": 791,
        "text_content": "Not perfect but took me 1 hour to make, i just screenshotted last frame and used it for next generation and used same character description each time.. i think i will continue this scene as it was so much fun to make",
        "comments": [
            {
                "raw_content": "when is the next episode coming?",
                "author": "NewerEddo"
            },
            {
                "raw_content": "Yeah, it's lowkey insane. It's not perfect, yes, but it's getting closer and closer. With more time, you probably could fix a lot of the issues. And that's just with the current tech. What about next year. What about the year after that. I think it's good enough to replace some of the elements of animation. But we all know it won't stop anytime soon.",
                "author": "KainDulac"
            },
            {
                "raw_content": "cool, though we'll need some way to say \"This character\" as a reference, like a mini LORA",
                "author": "PwanaZana"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "how did they get the physics this good?",
        "score": 358,
        "text_content": "",
        "comments": [
            {
                "raw_content": "In technical terms...they did a fuckload of training.",
                "author": "Siciliano777"
            },
            {
                "raw_content": "“Sure it’s significantly better than before, but it’s not perfect yet so why are you praising it 😡” - incoming skeptics",
                "author": "ArmandSawCleaver"
            },
            {
                "raw_content": "AI is learning...",
                "author": "Healthy-Nebula-3603"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Sora 2 is a paradigm shift. I have been browsing several social networks for examples. This is the first time that I am seeing people try to pass REAL content as AI generated to attract views.",
        "score": 142,
        "text_content": "There’s a lot of that going on on X especially. Some are racist videos that are claimed to be made by Sora 2 but they don’t have the logo. The uncanny valley is slowly collapsing in front of us.",
        "comments": [
            {
                "raw_content": "People were doing it when Veo 3 came out as well.",
                "author": "yaosio"
            },
            {
                "raw_content": "The shift is going to be seen in the complaints. Until now, haters have been motivated by outputs not looking real enough. Uncanny valley, 6 fingers on the hand, etc. It's now tilting. The complaints are increasingly that it's too real, putting \"key grips\" and set designers out of work.",
                "author": "TacomaKMart"
            },
            {
                "raw_content": "> The uncanny valley is slowly collapsing in front of us. Agreed. So now we're entering the viral stage, where AI videos will flood human culture like nothing we've ever seen - because that's what it's about: ever-better novelty. Very soon algorithms will be generating the latest novel content, based on clicks and views. A race to the bottom? So do we turn our eyes away, or gaze into The Medusa?",
                "author": "ldsgems"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Sora 2 physics benchmark (double pendulum) first video is soda and second is actual simulation",
        "score": 152,
        "text_content": "I gave Sora the exact parameters and starting positions and lengths for it to try and mimic the original simulation. Physics isn't there yet",
        "comments": [
            {
                "raw_content": "Can you try an analog clock ticking from a random time like 5.43",
                "author": "Prudent-Sorbet-5202"
            },
            {
                "raw_content": "I'm not doubting you, but if you gave it exactly the same thing, why does it have a 3rd segment from the start?",
                "author": "Fun_Yak3615"
            },
            {
                "raw_content": "Stop fucking posting these without your prompt. Benchmarks are relatively-stable, qualified, and quantified. This isn't a benchmark it's just a random video you generated.",
                "author": "ChloeNow"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"Announcing Tinker\"",
        "score": 26,
        "text_content": "The first product from Mira Murati's Thinking Machines Labs: [https://thinkingmachines.ai/blog/announcing-tinker/](https://thinkingmachines.ai/blog/announcing-tinker/) \"Today, we are launching [Tinker](https://thinkingmachines.ai/tinker), a flexible API for fine-tuning language models. It empowers researchers and hackers to experiment with models by giving them control over the algorithms and data while we handle the complexity of distributed training. Tinker advances our mission of enabling more people to do research on cutting-edge models and customize them to their needs. Tinker lets you fine-tune a range of large and small open-weight models, including large mixture-of-experts models such as Qwen-235B-A22B. Switching from a small model to a large one is as simple as changing a single string in your Python code. Tinker is a managed service that runs on our internal clusters and training infrastructure. We handle scheduling, resource allocation, and failure recovery. This allows you to get small or large runs started immediately, without worrying about managing infrastructure. We use LoRA so that we can share the same pool of compute between multiple training runs, lowering costs.\"",
        "comments": [
            {
                "raw_content": "Amazing /s",
                "author": "johnkapolos"
            },
            {
                "raw_content": "Good /s",
                "author": "Psychological_Bell48"
            },
            {
                "raw_content": "Big if true /s",
                "author": "XInTheDark"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "A longer sora 2 showcase",
        "score": 46,
        "text_content": "",
        "comments": [
            {
                "raw_content": "People were talking about how Sora 2 has this flickering quality that once you see you can't unsee. I didn't see it until this compilation but I get it now.",
                "author": "PURELY_TO_VOTE"
            },
            {
                "raw_content": "6 finger chef",
                "author": "Boreras"
            },
            {
                "raw_content": "I can relate to the burnt toast. Also, I can't unsee the flickering now.",
                "author": "ShieldMaidenWildling"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI's new Sora video generator to require copyright holders to opt out, WSJ reports",
        "score": 40,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I mean that's how it works with consumer data so I'm happy that corporations are feeling the effect of these shit laws too. Maybe it'll actually change. i.e. you can remove your address and phone number from a data broker site, then the next day databrokersite2 launches and you have to request removal from that one.",
                "author": "FakeTunaFromSubway"
            },
            {
                "raw_content": "I can't imagine the volume of lawsuits involved at this point.",
                "author": "Ignate"
            },
            {
                "raw_content": "Just generate some Nintendo shit and see how long before they try to going after OpenAI lol.",
                "author": "PineappleLemur"
            }
        ],
        "subreddit": "singularity"
    }
]