[
    {
        "post_name": "UC Berkeley (Nov. 10) — A TPUSA supporter and a far-left militant got into a fight. A leftist racially mocks the conservative. Masked militants tried to pull their violent comrade away from police.",
        "score": 644,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Kirk gets assassinated at a college campus, antifa is declared a domestic terrorist organization, and TPUSA gets attacked on college campuses like nothing's changed.",
                "author": "Beat_to_Quarters"
            },
            {
                "raw_content": "“Hey white boy!” President Trump better get involved and start going after these anti-white terrorists. He won’t like the alternative where we curb stomp these fucking mutts.",
                "author": "JoeMcCarthyWasRight"
            },
            {
                "raw_content": "I'm blaming republican leadership all the way to trump for this. You can't start the war we started, then not do everything necessary to protect the troops. Enough is enough, invade with the national guard or declare the insurrection act and get going.",
                "author": "MakeAmericaGreat9"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Kash Patel’s Big Test: How He Handles the Government's J6 Pipe Bomb Suspect",
        "score": 569,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He’s already failed",
                "author": "Thomm"
            },
            {
                "raw_content": "Nope. His big test was Epstein and Maxwell. According to Mossad, he passed with flying colors.",
                "author": "Ch3f4554551n"
            },
            {
                "raw_content": "Between him and Bongino, who were two of the most vocal people on the subject before joining the admin, I'm really struggling to figure out how they haven't driven this to ground yet. Yeah...I know...I'll be quiet now.",
                "author": "I_Am_John_Galt"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Another limousine Socialist who still gets an allowance from her parents is poised to win the Seattle Mayoral race - yes, they are STILL COUNTING ballots in Seattle after last Tuesday's vote.",
        "score": 544,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Voter fraud has to be stopped.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "the socialist takeover gameplan: Destroy the ever living fuck out of the economy and when the opposition gets in, blame him for the terrible costs and run on lowering the costs you elevated.",
                "author": "Scumbag-reddit"
            },
            {
                "raw_content": "Seems like vote counting is slow when things are not going the establishment Democrat's way.",
                "author": "Scatter-Shot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Two months ago, we lost one of our best ally in the fight against evil. RIP Charlie Kirk.",
        "score": 1869,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It really is still very hard to take it in.",
                "author": "CleanUpPhillyTrump24"
            },
            {
                "raw_content": "They killed our friend. He didn't know me from Adam but I would have loved to have spoken with him.",
                "author": "shadypollster"
            },
            {
                "raw_content": "And Trump capitalized on zero percent of it. When is Antifa going down?",
                "author": "UndercoverSpez"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Immigration without assimilation is invasion. ~ Charlie Kirk.",
        "score": 738,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If a cat is born in a stable, can it assimilate and become a horse? Just asking.",
                "author": "Trumpwon306"
            },
            {
                "raw_content": "Assimilation is basically a myth. It can be accomplished by a few individuals, but those are rare exceptions. We need to stop expecting people to assimilate. Most people couldn't even if they wanted to, and most don't even want to or try to.",
                "author": "VoteThing"
            },
            {
                "raw_content": "correct quote: “… is *an* invasion”",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "MAGA America blamed after Disney pulls out of Doctor Who deal",
        "score": 64,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Gay, trans and black in Dr. Who. No one wants that shit, ratings down but it's MAGA's fault.",
                "author": "Shitsbrokeyo"
            },
            {
                "raw_content": "Nah, it's the writers and faggots who ruined the show.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "If it was making enough money they wouldn't pull out. Blame is firmly at the writers feet.",
                "author": "Saxonlady"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Keep up the good work, boys.",
        "score": 900,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Bump it up so no more bumps can go up",
                "author": "lovemylibs"
            },
            {
                "raw_content": "What I'm curious about is: how many are we missing? We can't possibly know. Monitoring our coastline is just fucking insane, 17 THOUSAND miles! Blessed be on our Protectors. Deus Vult. Strike them from the Sky.",
                "author": "RuleoVicus"
            },
            {
                "raw_content": "Here's a better idea: destroy them on land before they are launched at sea.",
                "author": "knnbccb"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Wait Harvard has the cure for breast cancer but they won't spend any of their 50 billion dollar endowment to develop it and instead demand that the taxpayers give them the money? Wow these people are even more evil than I ever imagined.",
        "score": 922,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fuck that even…. How about the pharma companies who have shit loads of money to fund this research but they won’t. So, the system is designed for you to pay with your tax dollars liberal researchers to come up with something that they sell to a pharma company that makes it and sells it back to you for 10000% markup.",
                "author": "Prof_Smith"
            },
            {
                "raw_content": "She *says* her work has potential to *prevent* (not cure) breast cancer. I can't be bothered to watch this, but \"breast cancer\" is a whole bunch of different types of cancer, with different developmental pathways and different sensitivity/resistance to various treatments. Nobody has \"*the* cure for breast cancer\" or even \"*the* prevention for breast cancer\", and nobody ever will. Most preventive measures that are already proven to be highly effective involve lifestyle changes and self-discipline that most women are unwilling to adhere to (no alcohol use, no getting significantly overweight). There are many thousands of biomedical researchers who are hoping that their idea will prove to be very significant for treating or preventing some common life-shortening or disabling disease. They can't all be given all the money they want to try to prove their idea actually works. In most cases, their idea will turn out not to work, or to work a little bit but less effectively than somebody else's idea.",
                "author": "Deplora"
            },
            {
                "raw_content": "What she said was her research had POTENTIAL which is the same as all other research. Nobody said she had the cure for breast cancer. Clickbait trash.",
                "author": "Yaemz123"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "📊",
        "score": 1348,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> What's my dad wearing .. Dunno, but I want one. 😎",
                "author": "OGpsywar"
            },
            {
                "raw_content": "Literally all you have to do is look around Rule #1 Avoid the groid.",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "Pattern recognition.",
                "author": "MAGA_mantis"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "No Mortgages! Just Deportages!",
        "score": 1293,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Usury is not a viable solution to inflation and depressed wages.",
                "author": "Coprolite"
            },
            {
                "raw_content": "Trump's MO: Floats some crazy assed idea, just to see how people take it. Then lets MAGA decide.",
                "author": "BlackJack1776"
            },
            {
                "raw_content": "I want to see hundreds of thousands of deportations a day.",
                "author": "Sugz_Da_Feefth"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Harvard’s Hype Heist: Joan Brugge’s Breast Cancer Bullsh*t – My Paper, Her Glory, Zero Lives Saved, All for the Grift!",
        "score": 646,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“I am actually the lead and corresponding author on the most cited research paper of this person's career. Someone told me that today, and I verified it. The claim that her work has had any substantial effect on breast cancer is a dramatic overstatement. Like much of what’s being presented in this 60 Minutes segment, it’s a PR narrative designed to grab money. It’s dishonesty from these institutions about what technology from the life sciences can actually do—and it says more about the way universities grift the public for sympathy and funding than anything about science itself.” https://x.com/locasalelab/status/1987994762893254754",
                "author": "davidac1982"
            },
            {
                "raw_content": "Great post, OP. Yet another reason our institutions no longer have our trust.",
                "author": "duehuckleberry"
            },
            {
                "raw_content": "Same with the cancer society grifters. Look how much money they take in, and how much they donate towards research. It's a pittance.",
                "author": "Bythrfruitsyknow"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "UC Berkeley currently looks like a war zone. An ANTIFA member just lit off a flare resulting in TPUSA event attendees being rushed inside.",
        "score": 628,
        "text_content": "",
        "comments": [
            {
                "raw_content": "UC Berkeley is Antifa Ground Zero. Pepe Farms remembers the Battle for Berkeley and Professor Bike Lock, Based Stickman, and Moldylocks. Spez: Obligatory - [The Ballad of Moldylocks](https://www.bitchute.com/video/h1knSD29fYv9/)",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Lotta good declaring them a domestic terrorist org did…",
                "author": "Jack_Dupp"
            },
            {
                "raw_content": "Nuke it from orbit it's the only way to be sure.",
                "author": "MEME-SUPREME"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "TDS 2.0",
        "score": 1477,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Consistently inconsistent",
                "author": "kippo_hard"
            },
            {
                "raw_content": "“Don’t reopen the government” Your terms are acceptable on that too.",
                "author": "ChrisSuperDude"
            },
            {
                "raw_content": "It's possible to be both evil and stupid at the same time.",
                "author": "ColonelKlink"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🇺🇲",
        "score": 1013,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# SEMPER # FI",
                "author": "UH69MAGA"
            },
            {
                "raw_content": "I will continue to patronize restaurants that are proud to be American.",
                "author": "duehuckleberry"
            },
            {
                "raw_content": "https://x.com/SteaknShake/status/1988034172284440855?s=20",
                "author": "Looniz74"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The only thing the Schumer Shutdown accomplished was alerting Americans that 59% of Illegal-Headed Households receive American taxpayer funded welfare. There’s no going back now. Thanks Chuck!",
        "score": 1861,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If we have this data, we have their addresses, too. Deport them all!",
                "author": "JoeBidensDementia1"
            },
            {
                "raw_content": "Oof, that chart hurts to look at. The 52% of legal immigrants receiving benefits is horrible also. We shouldn't have any gibs. If gibs ARE to be had, though, all foreigners should be disqualified from receiving said gibs. Edit to add: I also do not, for a second, believe those housing assistance numbers.",
                "author": "ModernKnight"
            },
            {
                "raw_content": "The purple and orange categories need to be completely eliminated",
                "author": "Formerlurker92"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Liberal logic",
        "score": 1351,
        "text_content": "",
        "comments": [
            {
                "raw_content": "At this point, leftism is literally a form of brain damage.",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "The left: \"No Kings!!!!!!\" Also the left: \"Trump should break the law and go outside of Congress to fund government programs! Reeeee!!!!!\"",
                "author": "ravonaf"
            },
            {
                "raw_content": "Liberals don't possess any logic.",
                "author": "UnderHisWings"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Thoughts & prayers for these frontline workers.",
        "score": 661,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I work part-time at the Garden center at Walmart. The department covered Toys,Garden Center, and Seasonal. EBT unsupervised Crotch Goblins always go to Toys and throws and misplaced merchandise every where and leave Stolen Half eaten foods and drinks everywhere. What make me mad is the unsupervised children and the crying of the babies and if you call them out except a chimp out. Also I found a Lunch Box full of urine once. 😕",
                "author": "DT170x"
            },
            {
                "raw_content": "EBT Strikes Back",
                "author": "RentFree2020"
            },
            {
                "raw_content": "I used to work overnight grocery in a super ghetto store in South Carolina in the late 2000’s. The first of the month our trucks were around 2200 cases but closer to the end of the month they’d be around 700. I remember the first of the month every night coming into a ransacked department. The shelves were totally trashed. You’d have to sit there and sort out all the cans and boxes, etc. and don’t get me started on the koolaid packets. Good grief, it was like a hurricane went through.",
                "author": "Marianasoctober"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "On the brink of starvation.",
        "score": 789,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You weak-minded fool! He's using a old Trump mind trick!",
                "author": "Nezock_theKnight"
            },
            {
                "raw_content": "I saw a video by some guy who delivers for Walmart saying the first thing people were ordering once the EBT started up again was soda and chips. He also said he delivers a lot of expensive shit like Playstation games to the same places that use the EBT. Like they have no priorities and make no efforts when the government feeds them for free.",
                "author": "OnlyTrump20"
            },
            {
                "raw_content": "They need the food stamps to get a new hairdo, and to paint their nails at a salon.",
                "author": "knnbccb"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "There are 1.8 million nonprofits operating in America and they get $303 billion taxpayer dollars per year",
        "score": 544,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I work with a number of NFPs and boy the story's that would turn you red in the face...",
                "author": "bidensmissingbrain"
            },
            {
                "raw_content": "I need to start an NGO. I'll lie and claim it's for left wing causes, but fund conservative causes.",
                "author": "nakedjay"
            },
            {
                "raw_content": "NGO's are the elite left's gofundme's. DOGE uncovered USAID misuse and abuse but the fact that open borders of invaders was accomplished with NGO's using our tax dollars has never formally, or legally, been addressed. I still think NGO's need to be made to pay for deportations somehow, reversing the damage they created.",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Herp-teh-Derp 🤤",
        "score": 776,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What exactly is going on here?",
                "author": "bigdar"
            },
            {
                "raw_content": "… Cause this is thriller, thriller night And no one's gonna save you From the beast about to strike You know it's thriller, thriller night You're fighting for your life inside a killer, thriller, ow",
                "author": "GeorgeBailey"
            },
            {
                "raw_content": "I have been at parties where everyone is shitfaced drunk and it looks way more sane than this.",
                "author": "KennyKetchem"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Intel says software engineer took ‘top secret’ documents after getting fired",
        "score": 88,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TLDR: He stole data after being laid off, possibly on the run. \"On July 23, Intel claims, Luo tried to download a file from his work laptop to an external hard drive. Internal company controls prevented that. But five days later, Intel says that Luo connected another storage device and downloaded 18,000 files.\" \"Intel declined comment and Luo could not be located\"",
                "author": "Consistent-Theory681"
            },
            {
                "raw_content": "Semi-tangent here but when there were bad news INTC leaks I was told by a number of people in no uncertain terms that the news was all fake because no sources would risk careers or legal jeopardy, NDA's blah blah. In the real world when you fire 30,000 people, there are bound to be some disgruntled among them who will be more than happy to steal and/or reveal your secrets. Perfect example right here.",
                "author": "ProfessionalPrincipa"
            },
            {
                "raw_content": "Intel​ and dropping the ball Name a more iconic duo",
                "author": "Bomb-OG-Kush"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "NAND Flash Prices Doubled in Six Months, Warns Phison CEO",
        "score": 32,
        "text_content": ">***Terabit TLC NAND jumped from $4.80 in July 2025 to $10.70 in November 2025*** ***Earlier this year he also said shortages could last a decade*** \\-https://www.techpowerup.com/341578/nand-flash-shortages-may-last-10-years-phison-ceo-warns",
        "comments": [
            {
                "raw_content": "Sacrificing everything in the name of making lines go up. Just like with crypto and NFTs, there will be no accountability for people who push it either. A new dotcom bubble and 2008 financial crisis where AI infrastructure companies will get bailed out.",
                "author": "BlueGoliath"
            },
            {
                "raw_content": "RAM prices go up 10% per week since September so every 2 months, it doubles.",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "I just bought a Samsung 9100 pro 8tb nvme because I feared it would go up. It was $899 yesterday. Today it’s $908. At its highest it was $1000. I expect it to be higher than that very soon. I",
                "author": "GestureArtist"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Silicon Valley data centers totalling nearly 100MW could 'sit empty for years' due to lack of power — huge installations are idle because Santa Clara can't cope with surging electricity demands",
        "score": 259,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">The SCALE of the renewables revolution in China is almost too vast for the human mind to grasp. By the end of last year, the country had installed 887 gigawatts of solar-power capacity—close to double Europe’s and America’s combined total. The 22m tonnes of steel used to build new wind turbines and solar panels in 2024 would have been enough to build a Golden Gate Bridge on every working day of every week that year. In contrast, the US government is going all in on AI data centres while actively blocking new wind and solar projects.",
                "author": "datums"
            },
            {
                "raw_content": "California is probably the worst place you could find to build datacenters. The regulatory burden there is going to be a significant impediment to getting power quickly and the state already has a massive generation deficit. Way better off going to a state with more power and less regulations or potentially even overseas where money matters more than laws.",
                "author": "Visible-Advice-5109"
            },
            {
                "raw_content": "So giant data centers will be obsoleted before ever getting powered on?",
                "author": "Nicholas-Steel"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[News] Memory Price Surge: Macronix NOR Flash Reportedly +30% in 1Q26, SanDisk NAND Up in Nov.",
        "score": 11,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">As the memory supersycle accelerates, the latest wave of price increases has spread from DRAM to other segments, with major suppliers reporting sold-out orders and aggressive price adjustments. Taiwan’s Macronix, according to the Economic Daily News, is said to be preparing a 30% price hike for NOR Flash in the first quarter of 2026, while SanDisk, as noted by Tom’s Hardware, has reportedly raised NAND flash contract prices by about 50% for November.",
                "author": "imaginary_num6er"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "NVIDIA CEO Jensen Huang says “without TSMC, there would be no NVIDIA today”",
        "score": 519,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I would add the same probably without ASML =]",
                "author": "nohup_me"
            },
            {
                "raw_content": "Not the first time when Jensen admits that. He called Morris Chang, the founder of TSMC, his hero before.",
                "author": "1oarecare"
            },
            {
                "raw_content": "Something interesting to think about is that AMD failing horribly with Bulldozer was partially GloFo's fault. GloFo's 32nm was slower than their last gen 45nm, so AMD had to cut down Bulldozer tremendously to hit their clockspeed targets. In an alternate reality where AMD used TSMC for Bulldozer, FX might have come out differently.",
                "author": "Just_Maintenance"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Jeff Geerling] Minisforum Stuffs an Entire Arm Homelab in the MS-R1",
        "score": 33,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why would they release such a terrible device? And holly hell it cost $500, while being about on par with a raspberry pi. You could get a Zen4 8 core Beelink for that price.",
                "author": "FrogNoPants"
            },
            {
                "raw_content": "With also news of [CrossOver Preview linux ARM64 support](https://www.codeweavers.com/blog/mjohnson/2025/11/6/twist-our-arm64-heres-the-latest-crossover-preview) gaming on Linux may be quite interesting as well.",
                "author": "Noble00_"
            },
            {
                "raw_content": "I don't understand what the point of this product is. Who is this for?",
                "author": "BlueGoliath"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[News] SK hynix, Samsung, and SanDisk Bet on HBF — The Next Battleground in Memory Sector",
        "score": 4,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">According to Kim, memory will play an increasingly pivotal role in the age of artificial intelligence, to the point that NVIDIA may one day acquire a memory company. He also highlighted the emerging significance of HBF (High Bandwidth Flash), predicting new progress by early 2026 and formal debut between 2027 and 2028.",
                "author": "imaginary_num6er"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Google debuts AI chips with 4X performance boost, secures Anthropic megadeal worth billions",
        "score": 104,
        "text_content": ">**Inside Ironwood's architecture: 9,216 chips working as one supercomputer** >Ironwood is more than incremental improvement over Google's sixth-generation TPUs. According to technical specifications shared by the company, it delivers more than four times better performance for both training and inference workloads compared to its predecessor — gains that Google attributes to a system-level co-design approach rather than simply increasing transistor counts. > >The architecture's most striking feature is its scale. A single Ironwood \"pod\" — a tightly integrated unit of TPU chips functioning as one supercomputer — can connect up to 9,216 individual chips through Google's proprietary Inter-Chip Interconnect network operating at 9.6 terabits per second. To put that bandwidth in perspective, it's roughly equivalent to downloading the entire Library of Congress in under two seconds. > >This massive interconnect fabric allows the 9,216 chips to share access to 1.77 petabytes of High Bandwidth Memory — memory fast enough to keep pace with the chips' processing speeds. That's approximately 40,000 high-definition Blu-ray movies' worth of working memory, instantly accessible by thousands of processors simultaneously. \"For context, that means Ironwood Pods can deliver 118x more FP8 ExaFLOPS versus the next closest competitor,\" Google stated in technical documentation. > >The system employs Optical Circuit Switching technology that acts as a \"dynamic, reconfigurable fabric.\" When individual components fail or require maintenance — inevitable at this scale — the OCS technology automatically reroutes data traffic around the interruption within milliseconds, allowing workloads to continue running without user-visible disruption. > >This reliability focus reflects lessons learned from deploying five previous TPU generations. Google reported that its fleet-wide uptime for liquid-cooled systems has maintained approximately 99.999% availability since 2020 — equivalent to less than six minutes of downtime per year. > >",
        "comments": [
            {
                "raw_content": "> ...roughly equivalent to downloading the entire Library of Congress in under two seconds... > ...That's approximately 40,000 high-definition Blu-ray movies' worth of working memory, instantly accessible by thousands of processors simultaneously... > ...\"For context, that means Ironwood Pods can deliver 118x more FP8 ExaFLOPS versus the next closest competitor,\"... Am I the only that doesn't get any \"context\" from these comparisons? How was the Library of Congress converted to what kind of files for this comparison to make any sense? What is the next closest competitor for this chip? What codec is being used in those HD BRD movies, at what bitrate? All those movies are 120 minutes long, or do we have 90 minutes, 60, or 300 minutes long movies in there too? Sure I know, banana for scale, and throwing around numbers that make it seem like it's a huge thing. And it sounds interesting, but these comparisons don't add any value and are just numbers drawn on paper for appearances only.",
                "author": "total_zoidberg"
            },
            {
                "raw_content": "\\~4.6 BF16 PFLOPS and \\~8.3 INT8 POPS per chip sounds insane. I wonder if it has FP4 and sparsity support, in theory this thing blows Rubin out of the water (minus the software stack and all).",
                "author": "PriscFalzirolli"
            },
            {
                "raw_content": "Incredible stuff. I’m absolutely speechless reading that. What’s the software stack for training & inference on these systems?",
                "author": "AbheekG"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "KTC H27P3 Review: Exceptional Value 5K Monitor for Creators and Office Work​​​​​​​​​​​​​​​​",
        "score": 2,
        "text_content": "### Specs - **Display**: 27” IPS panel, 5120×2880 (5K) @ 60Hz or 2560×1440 (QHD) @ 120Hz dual-mode - **Color Accuracy**: Factory calibrated to ΔE<2, 100% sRGB, 99% DCI-P3, 99% Adobe RGB coverage - **Brightness & Contrast**: 500 nits, 2000:1 static contrast, HDR400 support - **Panel Specs**: 178° viewing angle, 8-bit + FRC color depth, anti-glare coating - **Connectivity**: USB-C (65W PD), HDMI 2.0, DisplayPort 1.4, 2× USB 3.0, 3.5mm audio out - **Design**: Aluminum T-shaped stand with tilt adjustment (-5° to +15°), VESA mountable, thin bezel - **Dimensions**: 614mm × 365mm × 41-78mm (monitor only), 453mm desktop height ### Review summary The KTC H27P3 delivers exceptional value as an entry-level 5K creative monitor at $569. Testing with Spyder X2 confirmed strong color accuracy (98% P3, 100% sRGB) and good uniformity, making it suitable for non-critical photo/video work, though it falls short of high-end AdobeRGB requirements (88% coverage) and HDR workflows (73% REC2020). The minimalist design features excellent build quality and a matte finish that effectively reduces glare, though the fixed-height stand offers limited ergonomic adjustment—easily remedied via VESA mounting. The dual-mode capability switching between 5K@60Hz for creative work and QHD@120Hz for gaming adds versatility. While not meeting professional pre-press or HDR color standards, this monitor represents an ideal balance of quality and affordability for content creators, designers, and office environments where color accuracy matters but isn’t mission-critical.​​​​​​​​​​​​​​​​",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nintendo Switch Firmware Update 21.0.0 is out now!",
        "score": 419,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/6z8r2pfmsj0g1.jpeg?width=2048&format=pjpg&auto=webp&s=7027294b64d3aa80b36f12f1e2fbadd76ce33b54 Physical Game vs Digital Game with the new update",
                "author": "Skullghost"
            },
            {
                "raw_content": "Wow they actually have notes other than improved stability. This is a game changer.",
                "author": "uchuskies08"
            },
            {
                "raw_content": "I’ve just discovered a new setting in the eShop that lets you disable automatic video playback. Thank GOD!",
                "author": "Gavintendo"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "New Switch 2 software updates change the icon depending on whether it is a Switch 1, Switch 2, or digital.",
        "score": 296,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I like the difference that’s cool.",
                "author": "Pokeguy211"
            },
            {
                "raw_content": "Nice touch! I hope this is the beginning of making the UI feel more alive",
                "author": "twinflxwer"
            },
            {
                "raw_content": "Also, switch 2 edition games that you upgraded from a switch 1 physical shows the switch 1 cartridge icon",
                "author": "Alickseff"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Hades II - Physical Edition releases later this month. Releases with the game on a cart, a 32 page character book, and a download for the game's soundtrack. Now THIS is how you do a physical release!",
        "score": 698,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is a cross compatible physical btw. The red switch 2 edition game card in this release will also play on a switch 1, it contains both the switch 1 and switch 2 versions.",
                "author": "Stealthinater1234"
            },
            {
                "raw_content": "Glad I waited for this to play Hades 2",
                "author": "dpowellreddit"
            },
            {
                "raw_content": "@SquareEnix see it’s not that difficult",
                "author": "CelticSith"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Mario Galaxy Movie Direct (No game information)",
        "score": 351,
        "text_content": "",
        "comments": [
            {
                "raw_content": "not gonna watch it probably modern movie marketing is too spoilery for my liking",
                "author": "HonestWhile2486"
            },
            {
                "raw_content": "SMG3 shadowdrop confirmed",
                "author": "CalypsoSauvin"
            },
            {
                "raw_content": ">Please note that no game information will be included in this presentation. Close enough. Welcome back, \"There will be no mention of the Nintendo Switch successor\".",
                "author": "letsgucker555"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "My Walmart just added a new holiday sign to their Switch 2 section",
        "score": 322,
        "text_content": "",
        "comments": [
            {
                "raw_content": "tried to slip madden in there like we wouldn’t notice",
                "author": "TrentSaylor"
            },
            {
                "raw_content": "Why tf did they not put the only switch 1 game in the middle looks uneven",
                "author": "brojooer"
            },
            {
                "raw_content": "Mario galaxy 1 and 2 looks so out of place. Like...why couldn't they add something like kirby and the forgotten land? Or....you know....HYRULE WARRIORS AGE OF IMPRISONMENT?",
                "author": "Thegoodgamer32"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Are you guys going to pick up something this sale?",
        "score": 505,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Splatoon 3 and the games to the left of it are 30$. Princess Peach Showtime and the games to the right of it are 40$.",
                "author": "Juklok"
            },
            {
                "raw_content": "Slightly misleading image. Only the first four games from the left will be $29.99. The rest will be listed at $39.99. I'll probably get Paper Mario and maybe Return to Dreamland.",
                "author": "jek1994"
            },
            {
                "raw_content": "Target had Dreamland at $30 bucks 2 years ago. Why cant we have it again? Paper mario and splatoon seems worth though.",
                "author": "MrCracker3000"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo reveals Black Friday and Cyber Monday 2025 sales and deals",
        "score": 776,
        "text_content": "",
        "comments": [
            {
                "raw_content": "From the article: $39.99: >Princess Peach: Showtime >The Legend of Zelda: Echoes of Wisdom, >Donkey Kong Country Returns HD >Luigi’s Mansion 3 >Kirby’s Return to Dream Land Deluxe $29.99 >Super Mario Odyssey >Nintendo Switch Sports >Paper Mario: The Thousand-Year Door >Splatoon 3 Samsung SD Express $20 off Amiibos for $10 off Cyber Deals between November 20th and December 3rd",
                "author": "Copperhead881"
            },
            {
                "raw_content": "TTYD and Splatoon 3 at $30, nice",
                "author": "KingAcorn85"
            },
            {
                "raw_content": "Shocked Nintendo is selling Odyssey at 30 bucks lol. I could have sworn the lowest they went on first party games wss 40.",
                "author": "CrashandBashed"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Cronos - the atmosphere in this game is incredible",
        "score": 66,
        "text_content": "Few screenshots I took so far",
        "comments": [
            {
                "raw_content": "I did not expect to enjoy the game as much as I did but the gameplay was really fun with a great atmosphere and the story was decent ..the graphics are solid too & I think it looked great in handheld . Made me excited to play the new Resident Evil on switch 2",
                "author": "FCA_Eughhh"
            },
            {
                "raw_content": "Did this get a demo?",
                "author": "GronWarface"
            },
            {
                "raw_content": "Is this like resident evil?",
                "author": "Infamous-Date-7663"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Discussion, News, and Request Thread - Week Beginning 11/10/25",
        "score": 48,
        "text_content": "[https://i.redd.it/53354migv9qf1.png](https://i.redd.it/53354migv9qf1.png) Discussion threads are your weekly central hub for all requests, gaming news, and any other gaming topics you want to talk about. *Please keep all content that doesn't need it's own post to this thread to de-clutter the sub for proper leaks and rumors. Thanks!* **Join our new companion sub for super secret Resident EVIL 9 and Half-Life 3 leaks** \\-- [r/OkBuddyGLAR](https://new.reddit.com/r/OkBuddyGLAR/) Hot Threads of the past week: * [Rockstar Games Employee posts about recent union-busting efforts (verified by GTAForums Mod)](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1oqgb4v/rockstar_games_employee_posts_about_recent/) * [Rockstar Games said that the dozens of employees it fired last week were leaking company secrets, disputing allegations by labor leaders that it was disrupting workers’ attempt to unionize.](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1opjkg4/jason_schreier_rockstar_games_said_that_the/) * [Symbols that include \"Cross-Buy\" with \"PS5/PC\" that playstation has added recently have been leaked by a dataminer.](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1ooll5n/symbols_that_include_crossbuy_with_ps5pc_that/) * [IGN - Inside Dante’s Purgatorio, the Cancelled Sequel to EA’s Dante’s Inferno](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1opau1o/ign_inside_dantes_purgatorio_the_cancelled_sequel/) * [\\[BillBill-Kun\\] Confirms the existence of the cross buy symbol in the PlayStation store files.](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1op1bfx/billbillkun_confirms_the_existence_of_the_cross/) # [Want to help us improve this subreddit? ](https://forms.gle/w9JaYTjVN1Zie9e39)[Provide us with feedback here](https://forms.gle/w9JaYTjVN1Zie9e39)[!](https://forms.gle/w9JaYTjVN1Zie9e39) # [Click here to join the discord to enjoy further conversations with the community!](https://discord.gg/6jdBvCSqbj)",
        "comments": [
            {
                "raw_content": "Vi Von Zulul",
                "author": "Dollar99Man"
            },
            {
                "raw_content": "Its interesting how the out of nowhere State of Play shows that leakers and journalists in this industry have almost no sources in Japan, as none of them said an SoP was even happening this month and how with it being completely East Asia focus, none of them are even bothering teasing things for it.",
                "author": "Animegamingnerd"
            },
            {
                "raw_content": "If Red Dead 2 PS5/Switch 2 is still happening this year there must be an announcement this week or next week at the latest no?",
                "author": "Fozi16"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Park on Weibo: League of Legends 2 launching next year",
        "score": 344,
        "text_content": "[https://www.reddit.com/r/leagueoflegends/comments/1otq0ro/league\\_2\\_might\\_be\\_actually\\_coming\\_as\\_soon\\_as\\_next/](https://www.reddit.com/r/leagueoflegends/comments/1otq0ro/league_2_might_be_actually_coming_as_soon_as_next/) will basically be a similar game but on a new engine and reworked etc.",
        "comments": [
            {
                "raw_content": "League of Legends 2 sounds like one of those meme names people say like Minecraft 2",
                "author": "MelkorBlackFoe"
            },
            {
                "raw_content": "Hope they learn from their mistakes and include free body soap",
                "author": "siliconwolf13"
            },
            {
                "raw_content": "I’d imagine it’s a Counter Strike 2 situation where all skins and purchases carry over. Gives the devs a clean engine to work with without all the spaghetti code, and allows them to add some experimental gameplay elements.",
                "author": "donkdonkdo"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "At Least 9 New Game Modes For Battlefield 6 Are In Development",
        "score": 57,
        "text_content": "Insider Gaming on their X shared that 9 new modes for Battlefield 6 are under development. No official announcement yet. [Source](https://xcancel.com/InsiderGamingIG/status/1987995941161288115?ref_src=twsrc%5Etfw)",
        "comments": [
            {
                "raw_content": "Ill just keep playing conquest or breakthrough anyway haha",
                "author": "johncitizen69420"
            },
            {
                "raw_content": "Just for me to only play rush and breakthrough",
                "author": "jonathanisaacisgoat"
            },
            {
                "raw_content": "Why? The menu is bad enough without an extra 9 modes, gonna be more of a clusterfuck if they release.",
                "author": "South_Buy_3175"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "VGC; TES VI still a long ways away, Fallout 3 Remaster is in development",
        "score": 1023,
        "text_content": "https://www.videogameschronicle.com/news/7-years-after-it-was-announced-the-elder-scrolls-6-is-still-a-long-way-off-todd-howard-says/",
        "comments": [
            {
                "raw_content": "it's been 14 years since Skyrim dropped lol",
                "author": "FlowersByTheStreet"
            },
            {
                "raw_content": ">“I like to just announce stuff and release it,” he explained. “My perfect version – and I’m not saying this is going to happen – is that it’s going to be a while and then, one day, the game will just appear.” >Asked if he wanted Bethesda to shadow-drop The Elder Scrolls 6 like it did with Oblivion Remastered, he replied: “You might say that was a test run. It worked out well.” It's annoying it was announced so early but I've resigned myself to just forgetting that announcement exists because nothing has come from it yet, so it's nice to see that they don't want to pull a GTA VI and re-announce the game with 3+ years still left of development.",
                "author": "MrEpicFerret"
            },
            {
                "raw_content": "Sounds like TES VI is two-years away from being two-years away.",
                "author": "Hovi_Bryant"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "State of Play Japan announcement gives more credence to the rumor first appeared on a chinese private forum of a PS5 Digital exclusively for Japan, region locked, sold at 50.000 yen",
        "score": 592,
        "text_content": "The original source is unavailable, but the rumor was discussed over the weekend on InstallBase here: https://www.installbaseforum.com/forums/threads/media-create-sales-week-44-2025-oct-27-nov-02.4124/page-4#post-365207 >Hearing rumors that Sony might drop a Japan-only PS5 Digital Edition for ¥50,000 on Nov 21… 👀 Now Sony just announced a \"State of Play Japan\" for tomorrow: https://blog.playstation.com/2025/11/10/state-of-play-japan-airs-this-tuesday-november-11/ >This Tuesday, we're bringing you a special episode of State of Play running for more than 40 minutes, focusing on games created in Japan and across Asia, alongside a few other exciting updates. The current PS5 Digital price in Japan is ¥72.980, so it would be a ¥20.000 permanent discount effectively. Strategically for Sony, it would price-match the Nintendo Switch 2 (¥49,980) with no game. In recent months, key partners like Capcom have been extremely vocal about the PS5 price in Japan being too high, explicitly comparing it to Switch 2's more affordable pricing (interview from March 2025): https://xtrend.nikkei.com/atcl/contents/18/01186/00001/?wovn=en >**--You've achieved initial sales of 10 million units. You need to build on that.** >**Tsujimoto:** That's correct. However, we also found that the \"PS5 barrier\" is unexpectedly large. *The console costs about 80,000 yen in Japanese yen. When you factor in the cost of software and monthly subscriptions, it comes to about 100,000 yen at the time of purchase. This is not an amount that can be easily reached, especially for younger generations.* This situation is not limited to Japan, but is similar overseas as well. >Our next challenge is to overcome these obstacles and get Monster Hunter Wilds to as many people as possible. Sales will begin in the future, so we are currently formulating a strategy to take advantage of these opportunities to boost sales throughout the year. >The Nintendo Switch 2 was released in June 2025 at a price of 49,980 yen (tax included), and the response was better than we had expected. While prices vary by country, this reaffirmed the high level of cost-consciousness among ordinary consumers.",
        "comments": [
            {
                "raw_content": "that's around £250 or $330",
                "author": "Tarnished13"
            },
            {
                "raw_content": "A lot of people in the comments not knowing how economics / currency works. You have to frame it from the Japanese perspective. ¥70,000 yen is the equivalent to the feeling of $700 in America. The PS5 has gotten so expensive because the price has been pegged to the U.S. dollar. With the yen having been weak for the past 4 or so years, anything tech related has ballooned in price. This is why Nintendo now sells a region-locked Japanese only Switch 2 and undercut Sony. Now Sony may or may not follow suit.",
                "author": "blueraycd"
            },
            {
                "raw_content": "FF9 Remake lets goooo 🤡",
                "author": "Flash-Over"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Konami may have accidentally leaked Silent Hill f coming to Switch and previous gen.",
        "score": 295,
        "text_content": "https://www.konami.com/games/us/en/products/silenthill_f/",
        "comments": [
            {
                "raw_content": "its a screw up most likely. it lists the ps4 and xbox one also.",
                "author": "mickeyphree1"
            },
            {
                "raw_content": "Ue5 game running on orginal switch? Must be a typo",
                "author": "CutProfessional6609"
            },
            {
                "raw_content": "they should also leak a Symphony of the Night PC release (PLEASE)",
                "author": "YukYukas"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Mr. Big DLC release date for Fatal Fury: COTW leaked before any confirmation",
        "score": 93,
        "text_content": "https://www.eventhubs.com/news/2025/nov/09/mr-big-ffcotw-release-leak/ 12.9.2025, way earlier than the planned window of “Early 2026”",
        "comments": [
            {
                "raw_content": "I, as a person with no idea about Fatal Fury, read this as \"Mr. Big DLC\" like it was describing the DLC instead of listing the name of the character being sold.",
                "author": "timeman95"
            },
            {
                "raw_content": "Sex and the City crossover is wild.",
                "author": "strangegoo"
            },
            {
                "raw_content": "\"Mr Big is pleased.\"",
                "author": "venom_daemon"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[Need4Games] Infold Games is working on an Infinity Nikki movie.",
        "score": 126,
        "text_content": "\\- It's in early works \\- ex Disney that made Wreck it Ralph, Tangled and Frozen are on this project \\- They said that they have another report about Infold Games \"very soon\" (a game this time) Original Leak: [https://need4games.ro/en/exclusive-infinity-nikki-is-getting-a-movie](https://need4games.ro/en/exclusive-infinity-nikki-is-getting-a-movie)",
        "comments": [
            {
                "raw_content": "Damn, we really are in that era of so many games being adapted into movies/shows, not that I'm complaining, It's pretty cool that for the most part, people have started taking adapting games more seriously nowadays.",
                "author": "OwnAHole"
            },
            {
                "raw_content": "I'm curious to which plotline. completely standalone, the original launch story, or the retconned story that helped usher the public image destruction of the game.",
                "author": "FewAdvertising9647"
            },
            {
                "raw_content": "So the home release will cut anything interesting from the plot to be accurate to the game?",
                "author": "ShadowStealer7"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Valve engineer who keeps decade-old Radeon GPUs alive on Linux, now pushes for AMDGPU to become the default driver",
        "score": 1024,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Interesting. The old Mac Pro trashcans also use GCN1 for their GPUs, on linux these light up with the AMDGPU driver but are unstable as hell if certain commands are sent to them from games. Proton causes hard lockups often. Wonder if these improvements might lead to stability and a tiny bit more shelf life for these things.",
                "author": "AmethystIsSad"
            },
            {
                "raw_content": "GCN 1.1, as in the R9 390X for example, is still an 8GB card with a lot of life left, so long as the drivers keep progressing! Finewine at its finest!",
                "author": "algaefied_creek"
            },
            {
                "raw_content": "My old Vega 56 is still working fine for 1080p gaming. It's got like a memory bandwith of 400GB/s",
                "author": "IWasNotMeISwear"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD’s 2025 Financial Analyst Day starts tomorrow with new technology roadmap updates",
        "score": 89,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Agenda: AI HPC with AI Gaming with AI AI with AI Did we mention AI?",
                "author": "EmergencyCucumber905"
            },
            {
                "raw_content": "So we should get any info about redstone? there is like a month left before they take the winter break",
                "author": "ByteAxon"
            },
            {
                "raw_content": "Can’t wait for UDNA to appear questionably over 2026/2027 dates.",
                "author": "kuug"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "50 Year Mortgage Explained",
        "score": 827,
        "text_content": "",
        "comments": [
            {
                "raw_content": "According to Redfin the average homeowner keeps a 30 year mortgage for 11.8 years, 20 years for California. Life happens. The problem with 50 year mortgages is the amortization schedule. It will be very tough to gain equity without holding very long term.",
                "author": "LikesPez"
            },
            {
                "raw_content": "The average first time home buyer is 40. So 30 year imply pay off at 70. 50 yr mortgage would be payoff at 90 which means you are just renting from the bank with a higher payment and having to pay the maintenance",
                "author": "dankroll69"
            },
            {
                "raw_content": "Lmao at 50 years. The interest would be insane. It’ll turn 500k houses into 2-3 million dollar purchases.",
                "author": "gladfanatic"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "But my mortgage will be cheaper",
        "score": 375,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A 50 year mortgage is essentially the return of the circa 2006-2008 interest only loan.",
                "author": "Satoshislostkey"
            },
            {
                "raw_content": "People move, people refi, I doubt that many will lock into a 50 year and stay there. Options are optional, you don’t have to exercise them.",
                "author": "satoshisfeverdream"
            },
            {
                "raw_content": "In the future, the types of people that use reverse mortgages to pay for their retirement and elder care won’t even have equity for that. Meanwhile line go up",
                "author": "drtij_dzienz"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "A staggering 84% of Gen Z say they’re delaying milestones to buy a house. There’s 'no single fix' for the affordability crisis, real estate exec says",
        "score": 189,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’m delaying milestones INCLUDING buying a house",
                "author": "malaka_alpaca"
            },
            {
                "raw_content": "There is a fix, but it would involve real estate execs becoming less wealthy and powerful, so they’ll never even consider it",
                "author": "pugsington01"
            },
            {
                "raw_content": "There is a fix. But the \"more growth and ever-increasing asset valuations requires importing millions\" needs to be reversed.",
                "author": "W2WageSlave"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The Trump administration wants to allow crypto-backed mortgages. Here's why",
        "score": 42,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not sure why it can’t be done when a Bitcoin ETF can be included in underwriting",
                "author": "boboman911"
            },
            {
                "raw_content": "\"I'm tired, masta\" , Started my adult hood with a 20 year war, fought my family though the financial crisis of 2008. Carried kids though a global pandemic. Now this cluster F. Can I get a Netflix and Chill decade?",
                "author": "hellalg"
            },
            {
                "raw_content": "What in the actual fuck is going on in this administration?",
                "author": "Dry-Interaction-1246"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "November ICE Mortgage Monitor: Home Prices \"Firmed\" in October, Up 0.9% Year-over-year",
        "score": 21,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Brief excerpt: • Negative equity rates, after years at record lows, have risen slightly toward more typical levels • As of Q4, 875K mortgage holders (1.6%) owe more on their homes than they are worth, the highest rate in three years but comparable to pre-COVID levels and long-term averages outside the Great Financial Crisis • The share of borrowers with limited equity has also increased, reaching 6.9% in September ‒ the highest since mid-2020 but still below long-term averages * While overall negative equity rates, remain low, certain markets are showing signs of concern, particularly in the Gulf Coast of Florida and Austin, Texas • In Cape Coral, Fla., where home prices have dropped 15% from their peak, 11% of mortgages are underwater, including over one-third of those originated in 2023 and 2024 • In Austin, with prices down 21% from their highs, nearly 7% of mortgages are underwater, including about 25% of loans from 2022 and over 15% from 2023 and 2024 • Borrowers with low down payment FHA/VA loans in these areas face even higher negative equity rates, exceeding 60% in some cases • In contrast, markets like Bridgeport, Hartford, New Haven (Conn.), San Jose, Los Angeles, Boston, and New York City, which have resilient home prices and larger down payments, have virtually no negative equity",
                "author": "SnortingElk"
            },
            {
                "raw_content": "ICE?",
                "author": "tetherbot"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Inflation on an inelastic commodity.",
        "score": 1,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Appraisal came in way low what do I do?",
        "score": 6,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Flipsters just add grey paint and LVP to get it from $660K to $935K. 👑",
                "author": "rentvent"
            },
            {
                "raw_content": "Realize you over paid and get the chapter 7 bankruptcy paperwork ready",
                "author": "VendettaKarma"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Nano Banana 2 CRAZY image outputs",
        "score": 1193,
        "text_content": "I was lucky enough to know someone who has access to nano banana 2 and have tested many outputs over the last 2 weeks, here are some of my favourites. Images will also be shared by others in my group on other socials, I will update this post with links accordingly. EDIT - this version of NB2 is different from the one posted on [media.io](http://media.io) a few days ago and is a much later checkpoint.",
        "comments": [
            {
                "raw_content": "Very cool. Funny how modern AI's like present day kids can't understand analog clocks.",
                "author": "JoeS830"
            },
            {
                "raw_content": "If that translation for that manga is legit and works consistently, that will definitely change the way manga scanlation is done, making it happen a lot quicker.",
                "author": "CRoseCrizzle"
            },
            {
                "raw_content": "The remake images look like they lifted the visuals from the actual remakes… would be curious what the result would be if you tried a title that doesn’t have a remake",
                "author": "Bobobarbarian"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Peak AI",
        "score": 1507,
        "text_content": "Steve acts as an Agent, or a series of Agents if you choose to employ all of them. You describe what you want, and he understands the context and executes. https://github.com/YuvDwi/Steve",
        "comments": [
            {
                "raw_content": "So now I don't even have to play games anymore. Hehe all kidding aside, then this could be great in a game where you control a city, or an army and all you have to do is tell them with your words what you want and then the AI takes orders.",
                "author": "Scandinavian-Viking-"
            },
            {
                "raw_content": "I know it probably sounds dumb but I really think AI companions are the future of gaming",
                "author": "LordSprinkleman"
            },
            {
                "raw_content": "That may look stupid but translating AI chatbot text mess to actual game events is hard",
                "author": "AleriaGoodpaw"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Google Deepmind: Robot Learning from a Physical World Model. Video model produces high quality robotics training data",
        "score": 69,
        "text_content": "[https://arxiv.org/abs/2511.07416](https://arxiv.org/abs/2511.07416)",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/sr09bnjfqk0g1.png?width=724&format=png&auto=webp&s=c17150d3692280ce61f9b7d5bc2ea7f99e7ad84e Average task success **82%** vs **67%** for the strongest prior that imitates generated videos without a world model. **Better transfer than hand-centric imitation:** object-centric policies vastly outperform embodiment-centric ones (e.g., *book→bookshelf* **90% vs 30%**; *shoe→shoebox* **80% vs 10%**). scales as video models improve",
                "author": "gbomb13"
            },
            {
                "raw_content": "This actually seems like a really clever training method",
                "author": "thelegend_420"
            },
            {
                "raw_content": "Realistic world models will expedite training And allow edge case (dangerous) testing to be done without any real consequences.",
                "author": "FarrisAT"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Touching the Robot Booby",
        "score": 60,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Mam/sir please stop molesting the androids . These models are not water resistant yet.",
                "author": "caman20"
            },
            {
                "raw_content": "https://preview.redd.it/o6bejb8l2l0g1.png?width=4636&format=png&auto=webp&s=9dc707babe1cf10c4fba2d5e27c19ee711a245c7",
                "author": "borntosneed123456"
            },
            {
                "raw_content": "do you think its able to balance when i \"upgrade\" its chest (for more battery storage)",
                "author": "Evening_Archer_2202"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Nano banana 2 vs ChatGPT Dall-E",
        "score": 151,
        "text_content": "So where is the goal post supposed to be? I’m just curious, I’ve also included more generations from Nana Banana after the gpt image. My bachelors degree in Digital Arts and Design was $76k, most of that degrees worth has already been rendered obsolete, don’t even get me started on suno ai, we are stepping into a completely different era.",
        "comments": [
            {
                "raw_content": "Manga translator and recolor groups might be over…",
                "author": "GoldAttorney5350"
            },
            {
                "raw_content": "Very impressive. I think we spend way too much time on edge cases where models fail that it blinds us to just how mind blowing what they can already do actually is.",
                "author": "10b0t0mized"
            },
            {
                "raw_content": "Weird. The holes are on the wrong side of the paper and I believe the correct row order is: THE CAT BALANCED DELICATELY ON THE EDGE OF THE WOODEN FENCE Kind of wild it could read it though.",
                "author": "createthiscom"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI hires Intel's CTO and AI lead",
        "score": 59,
        "text_content": "Wonder if it is for the design of their custom chips. Original tweet: [https://x.com/gdb/status/1987996461846659372?s=20](https://x.com/gdb/status/1987996461846659372?s=20)",
        "comments": [
            {
                "raw_content": "partly, i am sure. hardware build out..",
                "author": "kaggleqrdl"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI Could Be Blowing As Much As $15 Million Per Day On Silly Sora Videos",
        "score": 41,
        "text_content": "",
        "comments": [
            {
                "raw_content": "$15 million a day is a small price to pay to ruin short form content sites forever",
                "author": "Jeb-Kerman"
            },
            {
                "raw_content": "“Could” is doing a lot of heavy lifting. The author is just doing napkin math and assuming lot of things to get that 15 million amount",
                "author": "HaloMathieu"
            },
            {
                "raw_content": "I could almost taste the anti-AI bias in that opinion piece. Anyone saying \"AI is slop that will never be profitable\" needs to take a step back and wait 5-10 years to see where we are at, otherwise they will look like idiots for doubting the technology if it ever reaches AGI level.",
                "author": "Outside-Ad9410"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Former Chief Business Officer of Google Mo Gawdat with a stark warning: artificial intelligence is advancing at breakneck speed, and humanity may be unprepared for its consequences coming 2026!",
        "score": 164,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Humanity doesn't prepare ever. It adapts and survives except for that one time.",
                "author": "Whole_Association_65"
            },
            {
                "raw_content": "The writing is on the wall for quite some time now, if \"humanity\" failed to prepare for it by the time it matters then it would have never done so anyway meaning that \"it getting hit by the impact\" is the wake up call it needs to take action. Personally I'd prefer it if various issues are tackled in a more proactive fashion but society shows time and time again that adapting after the fact is its preferred way to handle these things.",
                "author": "UnnamedPlayerXY"
            },
            {
                "raw_content": "Mo Gawdat uses way too much evocative language for my liking. We will not see MAJOR labor disruption in 2026, but we will see it in the next 10 years. His target audience is normies and when he tells them \"this is going to happen in the next year\" and it doesn't happen, then they'll end up denying that it will ever happen.",
                "author": "10b0t0mized"
            }
        ],
        "subreddit": "singularity"
    }
]