[
    {
        "post_name": "Michigan man who shares same initials as JD Vance convicted of threatening to kill president, vice president",
        "score": 476,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Imagine getting up in the morning, putting on your blue lipstick and padded bra, rinsing your dilator after your morning whizz, zipping up your Tigger costume and heading upstairs for some of your 84yo mom's leftover meatloaf when you walk by a decorative hallway mirror and see LITERALLY JD FUCKING VANCE looking back at you. This level of TDS is exactly what I voted for.",
                "author": "BecauseYoudBeInJail"
            },
            {
                "raw_content": "DOPPELGÄNGER!?!?!?!?",
                "author": "Wrexxis780"
            },
            {
                "raw_content": "Wow…a communist has actually been convicted of something!!!",
                "author": "C00gsHouse281"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Hate crime trophy achieved",
        "score": 489,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Man, I wonder what gamers will do with access to fighter jets and pride parades. The salt miners quiver with anticipation.",
                "author": "JimQPublic"
            },
            {
                "raw_content": "I'm going to make a career of committing hate crimes on GTA6 and clipping them...when it comes out in 2090 after they finally hire white males to finish the game.",
                "author": "DebunkTheLeft"
            },
            {
                "raw_content": "I’m going to drive a burning dump truck through that shit.",
                "author": "HowDoYouTurnThisOn"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"Medicaid covered 64% of all births in Dearborn in 2023",
        "score": 309,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The mayor needs to be deported asap. This cocksucker infuriates me.",
                "author": "Hangemh1gh"
            },
            {
                "raw_content": "Muslim parasites. Deport them all.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "Check out the city data race pie chart for Deerborn https://www.city-data.com/city/Dearborn-Michigan.html They say it’s almost all white. This is another problem that really needs to be fixed. They conveniently skew all data to call everyone white.",
                "author": "DanIsSwell"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Former US Treasury for Bill Clinton steps down from Harvard and Yale after emails released by Republicans show he discussed tips for an extra marital affair with Epstein in 2019",
        "score": 164,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Better house arrest,detain him, or revoke his passport. He might leave the country.",
                "author": "DT170x"
            },
            {
                "raw_content": "End the League. Never work with or for anyone from an Ivy League. Shun them all, they are our pit of vipers.",
                "author": "BrionK"
            },
            {
                "raw_content": "Ha-ha! Get fucked Summers!",
                "author": "The_Michael"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "FBI Reminder",
        "score": 1363,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's some sick, perverted and evil stuff. Many are still in there. It's past the point of redemption. The FBI needs to be abolished.",
                "author": "FusionBlack"
            },
            {
                "raw_content": "Who owns all those gay porn companies? Certainly not the Irish. Who trains/indoctrinates the FBI? Also not the Irish.",
                "author": "KennyKetchem"
            },
            {
                "raw_content": "So glad Kash Patel closed the J. Edgar Hoover building, on day one, and turned it into a museum of the deep state.",
                "author": "airborne3502"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Rep. Anna Paulina Luna : Bill and Hillary Clinton are refusing to appear before House Oversight for their depositions regarding Jeffrey Epstein. Notice how House Democrats suddenly have nothing to say about it.",
        "score": 918,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Take their passports. They could become a flight risk!",
                "author": "Patriot4TN"
            },
            {
                "raw_content": "Contempt Prison time Prosecute in New York",
                "author": "Sunnybats2"
            },
            {
                "raw_content": "Who has the power to issue indictments for refusing to appear? Is it just the DOJ or can the House do it?",
                "author": "dunkeaters"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "There’s gotta be 80 million illegals in this country",
        "score": 1021,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No, man, they have a tag-out system: Juan in, Juan out./s",
                "author": "DITTOPatriot"
            },
            {
                "raw_content": "3 million down, 77 million to go.",
                "author": "airborne3502"
            },
            {
                "raw_content": "If anchor babies of illegals were counted as illegal, as they should be when their parents are, there's definitely 80 million",
                "author": "Kingoftheroad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "If it is obvious to everyone that entry level white collar jobs (programmers, financial services, etc) are going away, why are we still importing H-1B visa migrants? 80% of H-1B visas go to \"entry/junior\" level white collar jobs.",
        "score": 867,
        "text_content": "",
        "comments": [
            {
                "raw_content": "All the more reason not to go to college and rack up massive student loan debt for the vast majority of white-collar careers. Companies will go out of their way to not hire Americans. That's why entry level jobs somehow require 5+ years of experience. In any case, if your job is done on a computer, it can eventually be done **by** a computer, or at the minimum, outsourced until AI improves.",
                "author": "McFatty7"
            },
            {
                "raw_content": "Gonna be LMAOing when one of these retard CEOs offloads his finance department and trusts AI and it fucks up massively and bankrupts the company Also why is the babbling of some Christ-denier talking to a gay stickied?",
                "author": "staroframphansbhole"
            },
            {
                "raw_content": "hahah this is crazy level of gaslighting from the tech oligarchs.",
                "author": "Senaleb"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Massive historic Fentanyl bust in Colorado. Single biggest fentanyl bust in Colorado history. 6th largest single bust in US history. 1.7 million pills seized. 12 kilograms of fentanyl powder seized. Drugs linked to Sinaloa Cartel. REMINDER: A lethal dose is just 2 milligrams.",
        "score": 966,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Bomb Mexico.",
                "author": "MikeOxbig007"
            },
            {
                "raw_content": "[DEA Rocky Mountain Seizes Record 1.7 Million Counterfeit Fentanyl Pills in Colorado, Sixth-Largest U.S. Pill Seizure](https://www.dea.gov/press-releases/2025/11/17/dea-rocky-mountain-seizes-record-17-million-counterfeit-fentanyl-pills) DENVER – The Drug Enforcement Administration’s Rocky Mountain Field Division (RMFD) has announced the seizure of approximately 1.7 million counterfeit fentanyl pills from a storage facility in the Denver suburb of Highlands Ranch. This is the largest one-time seizure of counterfeit pills in Colorado history, and the sixth-largest, single seizure of suspected fentanyl pills in United States history. “This played out like an episode of a TV show, where a winning bidder legally bought a storage unit and unbeknownst to them, the unit contained 1.7 million counterfeit fentanyl pills and another 12 kilograms of fentanyl powder,” said DEA Rocky Mountain Field Division Special Agent in Charge David Olesky. “There is no doubt many lives have been saved by keeping these poison pills of the streets of Colorado.” Upon noticing the contents of the storage unit, the bidder immediately contacted the Douglas County Sheriff’s Office. “I want to thank the citizen who reported this discovery, the storage facility staff for their cooperation, and the deputies who responded quickly and professionally,” said Douglas County Sheriff Darren Weekly. “Let me send a strong and unmistakable message: fentanyl and illegal narcotics will not be tolerated in Douglas County. Our deputies, detectives, and crime lab professionals are committed to keeping this community safe, and we will remain relentless in that mission.” The record seizure is connected with an ongoing DEA and Colorado Bureau of Investigation case. The registered owner of the storage unit is already in federal custody. “The seizure of these drugs represents countless lives saved, as these dangerous substances will never reach our communities. Our mission to get drugs off the streets and put traffickers behind bars remains as vital as ever,” Colorado Bureau of Investigation Director Armando Saldate stated. In addition to the 1.7 million pills, the 12 kilograms of powder seized had the potential to yield up to an additional six million pills. Colorado Governor Jared Polis praised the hard work of federal, state, and local law enforcement. “I want to thank everyone who helped us with the largest successful fentanyl seizure in Colorado history. Getting more of this deadly drug off the streets saves lives. In Colorado, we are cracking down on crime, apprehending dangerous criminals, and keeping our communities safe. I thank the Colorado Bureau of Investigation and our federal partners for working with us to get criminals off of Colorado streets, out of our communities, and ensure Coloradans and families are safe,” said Governor Polis. Due to the ongoing investigation, no further updates are planned at this time.",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "Fentanyl is so dangerous that my neighbor who is taking it legally for horrific back pain, called 911 due to suspected over dose and an ambulance and three cop cars showed up. Even taken legally under doctor supervision the stuff will kill you.",
                "author": "Tweedlethree"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump tells McDonald's franchisees: \"I'm honored to stand before you as the very first former McDonald's fry cook ever to become President of the United States.\"",
        "score": 1102,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Love it. 🍟",
                "author": "SomecatsareMAGA"
            },
            {
                "raw_content": "We got the best senses of humor, don't we folks?",
                "author": "Bai6842"
            },
            {
                "raw_content": "The first President to become a McDonald's fry cook as well.",
                "author": "stormdraintrooper"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Stacey Plaskett, delegate to the United States House of Representatives from the United States Virgin Islands' at-large congressional district",
        "score": 542,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Today I learned useless unconstitutional non voting \"members \" of congress sit on the Intelligence committee. Our system is fucking stupid.",
                "author": "super_pede"
            },
            {
                "raw_content": "I would ask her what she called him Jeff, Jeffrey or Oh God during sex.",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "Diversity hire",
                "author": "Ferretman"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ICE officially confirms they’re now going after EMPLOYERS who hire illegal aliens, criminal record or not. Employers MUST be held accountable. Wonder if MTG is listening.",
        "score": 1923,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Go after their landlords as well.",
                "author": "wharfthrowaway"
            },
            {
                "raw_content": "Go after employers that abuse the H1-Beaner system as well",
                "author": "awsure"
            },
            {
                "raw_content": "This should’ve been the case the entire time.",
                "author": "PeruvianNeckties"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Ask Grok \"Has the US Govt been in a near-constant state of armed conflict somewhere in the world since 1945?",
        "score": 709,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is why Japan has flying light rail and beautiful cities. They weren't robbed of all their treasure by pointless Wars all over the world.",
                "author": "JayKay1776"
            },
            {
                "raw_content": "And America is crumbling",
                "author": "mikejones"
            },
            {
                "raw_content": "I thought everyone knew that...",
                "author": "Fieldsl22"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump just revealed a MASSIVE statistic the fake news refuses to give him credit for \"1.9 MILLION more American-born workers are employed today than when I took office...American-BORN.\" This is HUGE! \"Wages for hourly workers are rising the fastest in 60 YEARS.\"",
        "score": 1168,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We can get 45 million more jobs if we kick lazy people off EBT (provided we deport enough illegals that there are jobs to go to).",
                "author": "DeportThemAllForever"
            },
            {
                "raw_content": "I wouldn't brag about this job market. Literally the hardest market to find a job in many decades",
                "author": "TheSwampThang"
            },
            {
                "raw_content": "Start cancelling H1B and OPT visas. Threaten Pajeet with summary execution if he doesn’t self-deport",
                "author": "henri_derelicte"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Alaska, Alabama, Arkansas, Florida, Georgia, Oklahoma and South Carolina Patriots you have elections tomorrow",
        "score": 1103,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Although I do not live in any of those areas I want say thanks for sharing that. Very useful info.",
                "author": "Bigsweaties"
            },
            {
                "raw_content": "Please go vote. We are all counting on YOU.",
                "author": "Threaper666"
            },
            {
                "raw_content": "# THANK YOU for these reminders !! People like you make this community great. Good work outta' you, brother.",
                "author": "MAGALOVER"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "How Counting Noncitizens Distorts State Legislatures",
        "score": 744,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Foreigners",
                "author": "MemoryHoleyeO"
            },
            {
                "raw_content": "This and election theft is what the Democrats bank on to remain in power.",
                "author": "airborne3502"
            },
            {
                "raw_content": "That's how Southern Democrats prevailed after the Civil War. All those '3/5ths\" became Whole Numbers after the 13th and 14th Amendments and shifted the balance of power in the House.",
                "author": "Moebius"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Great throw GEOTUS TRUMP!",
        "score": 571,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Stickied because I laughed at this. Fat chicks are hilarious. 🤣 Says this former fat chick!",
                "author": "GuerillaYourDreams"
            },
            {
                "raw_content": "There’s no way that ravening maw lets such a morsel escape like that.",
                "author": "Viewer01"
            },
            {
                "raw_content": "Thank you my favorite Mod! Fat chicks certainly can be..., especially with Trump involved! KEK",
                "author": "Capoditutticapi1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Hmmm 🤔",
        "score": 377,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We really need to Make Mental Aslyums Great Again.",
                "author": "Than0sIII"
            },
            {
                "raw_content": "I just want to know what drug or method was administered on the unknowing American public about a decade ago. Or maybe a tiny bit longer. Something caused the derangement, though. If you can peel yourself back from your own perspective and just look at Trump, he's not *really* all that different than any other president. A lot of people compared him to Reagan but he could also be compared to Bill Clinton, just on levels of ACTUAL scandal alone, Trump is tame. Plenty of people ree-ree'd about shit back in the day as well, but not to such extreme and wildly outlandish degrees as they do today over Trump. Who again, when you really peel yourself back from all of it, all of them, all of us, all of this little MAGA ecosystem of our very own as well, just looking at Trump as a perfect stranger, there's nothing all that wild or outlandish about him - if people weren't ree'ing and screaming at him he wouldn't even be this spectacle he has become. I really think some sort of psychotropic drug was released into some food source or something consumed by the masses that only seemed to affect people with blue hair dye in their systems...",
                "author": "Covidrrhea"
            },
            {
                "raw_content": "No but it is RENT FREE!",
                "author": "madeaprofilejustforu"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: President Trump commits to SIGNING the Epstein Files legislation if passed by Congress - PUTS TO BED another leftist narrative. \"They can do whatever they want. We'll give them everything.\"",
        "score": 1176,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Should have led with this.",
                "author": "airborne3502"
            },
            {
                "raw_content": "He should’ve said this months ago instead of going on and calling it a hoax. Wasted valuable time.",
                "author": "sherlock2025"
            },
            {
                "raw_content": "The votes for this will magically disappear in the senate. Too many powerful folks will be calling in favors.",
                "author": "dataonly"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I lost my beautiful wife and the love of my life this weekend. Proud Patriot momma who raised two great Patriot boys. The world would be a better place with more beautiful souls like Maureen. My heart is broken. We all took a loss, but her legacy lives on. I love you baby.",
        "score": 456,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sorry for the loss brother.",
                "author": "RandyQuaidsBeard"
            },
            {
                "raw_content": "Sounds like she built a wonderful family with you ❤️. Sending out prayers to you and your boys.",
                "author": "MagaJay02"
            },
            {
                "raw_content": "Thoughts and Prayers Fren!",
                "author": "patrioticwinning3"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Valve Claims Steam Machine Outperforms 70% of Current Gaming PCs",
        "score": 356,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not 70% of \"Gaming PCs\", but 70% of PCs that people play games on. When you say gaming pc people will be predisposed to think of expensive high end machines but the majority of people playing on PC have low and mid end machines which makes the 70% figure seem very believable.",
                "author": "SliceIllustrious6326"
            },
            {
                "raw_content": "You can check the Steam hardware survey from your client. Store > Browse > All Charts & Stats > Scroll down the page to More Stats and click Steam Hardware & Software Survey. Click Video Card Description to expand and see what GPU's people are using. For example more people game on an AMD Radeon RX 570 (0.40%) than an Nvidia GeForce 5090 (0.31%). You can scroll through the list and see a bunch of GTX cards are still being used. 970, 1650, 1050ti, 1060, 1080ti (the GOAT), and many others. There's a few AMD classics there too. Over half of all people on Steam still play on 1080p. Roughly one third have 8GB of vram, some have less. Less than 20% of all users have 12GB of vram.",
                "author": "Anxious_Temporary"
            },
            {
                "raw_content": "It's been said to death, but this thing lives and dies by its price. I don't love the specs, particularly the GPU. It just isn't very futureproof for a device that's going on sale in 2026 and will likely be sold well into the lifespan of the PS6. The Zen 4 CPU it has is very respectable, but it lacks one of AM5's biggest selling points which is upgradeability. You will not be able to drop an 11500X3D into this thing when that chip drops in like 2030 the way you would if you went with a cheap AM5 build right now. That said, it can still make sense if priced aggressively enough. I think $600 can make sense.",
                "author": "AIgoonermaxxing"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Global OLED Monitor Shipments Surge 65% YoY in 3Q25, Redefining Market Landscape, Says TrendForce",
        "score": 10,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">TrendForce reports that the ranking of the top two OLED monitor brands' rankings changed in 3Q25, with ASUS surpassing Samsung to become the leader with a 21.9% market share. ASUS’s achievement is due to its wide product range: besides its popular ROG gaming monitors, it introduced ProArt OLED models for creators, along with portable and foldable dual-screen monitors. This diversification and ongoing innovation have strengthened ASUS’s reputation in the mid- to high-end market, and its OLED monitor shipments are expected to rank first globally in 2025.",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "this the era of OLED \"revolution\" taking over IPS. It is much like how IPS taking over TN many years ago when IPS was stuck at 60Hz, while TN is the only display standard that can output 144Hz.",
                "author": "hackenclaw"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Noctua teases its Chromax Black NH-D15 G2 CPU cooler",
        "score": 21,
        "text_content": "",
        "comments": [
            {
                "raw_content": "10 years to change the color from brown to black. Amazing job",
                "author": "Open_Map_2540"
            },
            {
                "raw_content": "Thermalright is still gonna eat their lunch.",
                "author": "teh_spazz"
            },
            {
                "raw_content": "Despite high price, Their fans work great and some of the most silent fans in the market.",
                "author": "Advanced_Compote_698"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "El Capitan Retains #1 as JUPITER Becomes Europe’s First Exascale System in the 66th TOP500 List",
        "score": 4,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Aurora - 1012 max of 1980 peak flops - 51% Jupiter - 1000 max of 1226 peak flops - 82% Jupiter utilisation rate is so good that despite being much lower peak flops, it's max flops is almost equal to Aurora. While using less than half the power.",
                "author": "From-UoM"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Silicon Photonics] GlobalFoundries acquires Singapore chip-maker Advanced Micro Foundry in AI data centre network push",
        "score": 4,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The article states … > With the acquisition of amf, *GlobalFoundries* said it believes it would be the world's largest silicon&nbsp;photonics-maker and that it will establish a new research-centre in Singapore in partnership with the *Agency for Science, Technology and Research* (A\\*STAR). > The acquisition of amf, which spun off from A\\*STAR in 2017, will help it scale \"to bring world-class silicon&nbsp;photonics innovations developed in Singapore to global markets\", said the agency. > In a statement, A\\*STAR said that it will enter into a master research collaboration agreement with *GlobalFoundries* to advance silicon&nbsp;photonics-technologies.",
                "author": "Helpdesk_Guy"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Trendforce report: Rising Memory Prices Weigh on Consumer Markets, Affecting Smartphones and Notebooks in 2026",
        "score": 78,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Glad I bought everything in 2025 already",
                "author": "WarEagleGo"
            },
            {
                "raw_content": "It's a shame this happens around the same time Windows 10 is EOL and people have to buy new PCs.",
                "author": "BlueGoliath"
            },
            {
                "raw_content": "I fear the report is too optimistic.",
                "author": "tomaladisto"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Component lifecycle management - how do hardware engineers handle this?",
        "score": 10,
        "text_content": "Curious how hardware engineers manage component sourcing and lifecycle tracking. Recent frustration: Finished PCB design, component went EOL without warning. 2 days of work lost. Questions: 1. What tools do you use for component research? 2. How do you prevent selecting EOL parts? 3. Does your company use specialized software? 4. What would make this easier? Current options seem inadequate: \\- Octopart (API paywall, data quality issues) \\- SiliconExpert (expensive, enterprise only) \\- Manual checking (time consuming) Would something better be useful or is this just part of the job? Background: Developer considering building this, validating if it's a real pain point.",
        "comments": [
            {
                "raw_content": "1. Check for availability from at least 2 manufacturers 2. Manual checking inventory at least 2 sources 3. Design board around standard components sizes and pinouts 4. Buy components before starting the design 5. Pray items stay in stock and prices don't suddenly increase like DRAM and NAND flash",
                "author": "Rolling_tiger"
            },
            {
                "raw_content": "I dont know, this sub is for computer hardware disccusion and news. Ask in r/PCB maybe. But yeah, the name of subreddit is too general, it should be something like r/PC_hardware",
                "author": "qwertymartes"
            },
            {
                "raw_content": "Hello! It looks like this might be a question or a request for help that violates [our rules](http://www.reddit.com/r/hardware/about/rules) on /r/hardware. If your post is about a computer build or tech support, please delete this post and resubmit it to /r/buildapc or /r/techsupport. If not please click report on this comment and the moderators will take a look. Thanks! *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Peanut Butter on my Switch 2 Dock",
        "score": 917,
        "text_content": "I went away this weekend with some friends and took my Switch 2 with me so we could play some games. On the way home I packed a jar of peanut butter in the same bag as the dock. Unfortunately the bag came loose and I’ve ended up with a container of peanut butter on top of the dock. I’ve managed to move it a little bit but it is still on top of the dock. I tried to forcefully grab it and take it off but it’s really heavy and I don’t want to end up damaging the dock, and I can’t move the dock or else the container may fall over. If I send it to Nintendo for a fix do you think they would remove it? I assume the whole dock is needing to be replaced!",
        "comments": [
            {
                "raw_content": "This post is making fun of [this one](https://www.reddit.com/r/NintendoSwitch2/s/bQNJLzODV1), just so you know",
                "author": "Beanmaster115"
            },
            {
                "raw_content": "![gif](giphy|tnYri4n2Frnig)",
                "author": "Lucamiten"
            },
            {
                "raw_content": "Have you tried unscrewing the lid and putting some peanut butter in the USB slots?",
                "author": "Rymaar"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Switch 2 dock on my pennut butter",
        "score": 308,
        "text_content": "I went away this weekend with some friends and brought my peanut butter with me. On the way home I packed the peanut butter in the same bag as my Switch 2 dock. Unfortunately the bag came loose and now my Switch 2 is sitting right on top of the peanut butter jar. I managed to move it a little, but it’s still basically resting on it and stuck in place. I tried to lift the Switch 2 off the peanut butter, but the jar is really heavy and I don’t want to accidentally damage the dock or the console. I also can’t move the jar itself because the Switch 2 might slide or fall off. If I send it to Nintendo, do you think they would remove it for me? At this point I’m assuming the whole dock might even need to be replaced.",
        "comments": [
            {
                "raw_content": "[Previously, on Peanut Butter…](https://www.reddit.com/r/NintendoSwitch2/s/UKcC199x3T)",
                "author": "Beanmaster115"
            },
            {
                "raw_content": "Have you tried adding a jar of jelly into the mix",
                "author": "FCA_Eughhh"
            },
            {
                "raw_content": "use 99% isopropyl alcohol and a cotton swab to carefully wipe the switch 2 dock off of the peanut butter",
                "author": "SwashNBuckle"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Donkey Kong Bananza, Hades 2 and Silksong are running for Game of The Year 2025",
        "score": 1287,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Still holding out hope for a Clair Obscur port for Switch 2. I don’t have a PC right now so it’s that or nothin",
                "author": "JeskaiJester"
            },
            {
                "raw_content": "Banger after banger after banger after banger this year. E33, DKB, Silksong, and Hades 2 all deserve it. I cannot be mad at any of these winning, they’re all deserving in their own way. I love it when a year has so many highly regarded, fantastic choices that you really can’t be mad at whoever ends up winning. However, my personal GOTY comes out in 3 days. Kirby Air Riders all the way, mfs.",
                "author": "lilmitchell545"
            },
            {
                "raw_content": "Every game on there is a banger! I don’t care who wins honestly 😅",
                "author": "ImStupidPhobic"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The Australian edition",
        "score": 107,
        "text_content": "Went camping with mates and wanted to salt my switch 2. They only had this crappy tube vegemite not the proper jar stuff so I had to make do. But surprise, surprise it worked! Took it home and will never use anything else. Strongly recommended!",
        "comments": [
            {
                "raw_content": "Just tried this and now I am currently playing dash dingo from the simpsons https://preview.redd.it/0mvfovtofy1g1.jpeg?width=640&format=pjpg&auto=webp&s=8eebeb60dd28012e2633bbaae8a52d3d9eb3a422",
                "author": "njw1998"
            },
            {
                "raw_content": "1: why did they want to salt your switch 2 2: can I have some",
                "author": "Whire_pickledmin2610"
            },
            {
                "raw_content": "😂 some will like this meme and some will hate it. Vegemite/marmite here is the most divisive food ever.",
                "author": "No-Giraffe-6518"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "LoL this is straight up Link",
        "score": 1479,
        "text_content": "They absolutely nailed the casting. Please make this movie good.",
        "comments": [
            {
                "raw_content": "Link and Zelda together https://preview.redd.it/k12dqjv8wt1g1.png?width=798&format=png&auto=webp&s=c65080becbf6c2b7abc9c0e0fcb877576ef1a03b",
                "author": "StarPlatinum55"
            },
            {
                "raw_content": "It is going to be incredibly difficult to make the movie good, but I really, really hope they pull it off, it is an iconic franchise.",
                "author": "xondk"
            },
            {
                "raw_content": "first line of the movie “ah! ahya! haa.. ah!”",
                "author": "delhibellyvictim"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "NateTheHate says efforts have been made to bring GTA VI to the Switch 2",
        "score": 451,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Maybe 6-12 months or years later.",
                "author": "glatzkopp75"
            },
            {
                "raw_content": "If I was Nintendo, I’d be actively trying to help them out with this. Especially to potentially get it at launch. Launch day GTA6 could be huge for the Switch 2.",
                "author": "VakarianJ"
            },
            {
                "raw_content": "Honestly I can see that, it would be an incredible achievement if they manage to bring it over!",
                "author": "DocWhovian1"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Peanut Butter in my Switch 2 Dock",
        "score": 1183,
        "text_content": "I went away this weekend with some friends and took my Switch 2 with me so we could play some games. On the way home I packed a jar of peanut butter in the same bag as the dock. Unfortunately the lid came loose and I’ve ended up with peanut butter all over the dock. I’ve managed to clean a lot of it up but there is still some in the USB ports and in and around the actual connector. I tried to open it up so I could clean the plastic as best I could but some of the screws on the bottom of the dock are too firm and I can’t unscrew without risking stripping the screws. If I send it to Nintendo for a repair do you think the would repair it? I assume the USB ports are going to be needing to be replaced!",
        "comments": [
            {
                "raw_content": "Isopropyl alcohol, lots of it. Use a high pressure electrical components cleaner (WD-40, but not the blue can, it's a black/green can) Just spray like crazy above a sink and just let it all out. After that get some cotton sticks and wipe it clean with alcohol.",
                "author": "Rynelan"
            },
            {
                "raw_content": "Post Flair \"Leak\" made me laugh.",
                "author": "DSMidna"
            },
            {
                "raw_content": "Easy fix. Just cross out the “USB” and write “USPB”.",
                "author": "Kenny_Bi-God_Omega"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Isn’t this an odd way to promote a game on a console?",
        "score": 272,
        "text_content": "I find it odd for Sega to promote these two Yakuza games by telling everyone to “dust off” their Switch 2’s. It’s like a backhanded compliment from my mother in law…”You do such a good job proving for our daughter and grandkids, especially since you’re just a self employed sales trainer.” 🤣 It’s like Sega is saying our Switch 2’s are collecting dust because there are no games worth playing on it. Then when it says to start playing the Yakuza series “for real this time”, like they aren’t happy with how Yakuza Kiwami performed or sold on Switch or something. It’s as if they’re dissing their own game. What do you all think? I just think there’s way too much innuendo here to not be something more. Very odd.",
        "comments": [
            {
                "raw_content": "Lmao this is definitely generic marketing title #607 that went out.",
                "author": "unwisest_sage"
            },
            {
                "raw_content": "SEGA just can’t resist the old ways. The next ad will be Yakuza does what Nintendon’t",
                "author": "DarwinGoneWild"
            },
            {
                "raw_content": "\"Our old version was shit, now dust off the console that launched a couple months ago (lol) and finally enjoy our game. \"",
                "author": "PathOfDeception"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The Sims 4 Remastered is in development including open neighborhoods, basic pack features included in the basegame, and an engine upgrade.",
        "score": 605,
        "text_content": "[https://simscommunity.info/2025/11/17/the-sims-4-remastered-rumor/](https://simscommunity.info/2025/11/17/the-sims-4-remastered-rumor/) doing literally anything but making the sims 5",
        "comments": [
            {
                "raw_content": "Anything but a new game lol",
                "author": "LanaDeITae"
            },
            {
                "raw_content": "I mean, aren't they still developing new expansions?",
                "author": "samus4145"
            },
            {
                "raw_content": "yet still no re-release of an all-in-one version of the sims 3, that's actually affordable.",
                "author": "soulreapermagnum"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "GOTY nominees have leaked before the official reveal",
        "score": 1503,
        "text_content": "- Clair Obscur: Expedition 33 - Death Stranding 2: On the Beach - Donkey Kong Bananza - Hades II - Hollow Knight: Silksong - Kingdom Come: Deliverance II Source: https://xcancel.com/Wario64/status/1990452537032573309#m",
        "comments": [
            {
                "raw_content": "Tbf almost everyone expected this list",
                "author": "Loose_Society9485"
            },
            {
                "raw_content": "The Mindseye disrespect cannot continue.",
                "author": "DasMeDawtan"
            },
            {
                "raw_content": "This might be the first time an award show nomination list has been leaked!",
                "author": "MuptonBossman"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "According to NateTheHate, RockStar has been \"doing tests to bring [GTA6] to Switch 2\"",
        "score": 442,
        "text_content": "Via Twitter >I said a while ago that R\\* was doing tests to bring it to Switch 2; but tests don't always equal release. I know an effort has been made to see if they can bring it to the platform. I don't know the current state of that effort. [Source:](https://xcancel.com/NateTheHate2/status/1990491837182980193?s=20) EDIT: Nate says this in a follow up tweet but publishers do these kinds of tests all the time and a lot don't go anywhere. >Experimenting doesn't equal \"in development\" & companies often test to see if a game is possible on hardware. [Source](https://xcancel.com/NateTheHate2/status/1990546725535429023?s=20)",
        "comments": [
            {
                "raw_content": "If it does come to switch 2 it probably won't be until a few years after the PS5 and xbox release",
                "author": "manoffood"
            },
            {
                "raw_content": "They should try to bring GTA 4 and 5 (including the online mode, that'll generate millions for Rockstar honestly) to Switch 2 first. GTA 5 basically has ports on every platform except Nintendo",
                "author": "SnowyJKN"
            },
            {
                "raw_content": "If these tests were to Rockstar's liking, it will likely launch either alongside the PC or next gen port I imagine.",
                "author": "Animegamingnerd"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Silent Hill Townfall leaked on 'Liverpool Mexico E-Shop'. Launch date on March 26, 2026.",
        "score": 280,
        "text_content": "Silent Hill Townfall was leaked on Liverpool Mexico E-Shop with the date for March 26, 2026. Also the game might be cost 60 dollars seeing the value of the prints. The original site was deleated after the leak, reinforce that is indeed the release date of the game. [Source](https://xcancel.com/Rashmunchel/status/1990457427565715645)",
        "comments": [
            {
                "raw_content": "What tier is Liverpool Mexico E-Shop?",
                "author": "deadly-genius"
            },
            {
                "raw_content": "The all-knowing Mexican Scousers...",
                "author": "TheProudBrit"
            },
            {
                "raw_content": "When did the uk, and Mexico fuse",
                "author": "Embarrassed-Part-890"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Hytale has been reacquired by Simon Collins-Laflamme",
        "score": 408,
        "text_content": "https://hytale.com/news/2025/11/hytale-is-saved Previous rumor: https://www.reddit.com/r/GamingLeaksAndRumours/comments/1oxemru/hytale_website_activity_points_to_it_being/",
        "comments": [
            {
                "raw_content": "And an early access released date is coming soon based on the original engine as well. They expect to be on early access for a few years, with funding for at least 10 years.",
                "author": "Dark_Jooj"
            },
            {
                "raw_content": "Does this affect the announcement of half life 3?",
                "author": "Rainy_Wavey"
            },
            {
                "raw_content": "Hytale, Half-life, GTA 6 and Silksong updates, all on the same year. 2025 is fucking wild.",
                "author": "Dark_Jooj"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Xbox Partner Preview confirmed for November 20th",
        "score": 358,
        "text_content": "- Happening on November 20th, 10 AM PT - Some partners include IO Interactive, Tencent and THQ Nordic - Games to be shown are 007: First Light, Tides of Annihilation and Reanimal Source: https://news.xbox.com/en-us/2025/11/17/xbox-partner-preview-november-2025-announce/ Previous rumour: https://reddit.com/r/GamingLeaksAndRumours/comments/1oyqubw/natethehate_microsoft_partner_showcase/",
        "comments": [
            {
                "raw_content": "Would be great if IO showed more of the coop mode on Hitman",
                "author": "Lordy_De"
            },
            {
                "raw_content": "Darksiders 4 pleasee",
                "author": "Humble-Criticism6762"
            },
            {
                "raw_content": "Ooh yeah Tides of Annihilation. That one looked good. I wonder if that GameFreak game is gonna be shown a bit more.",
                "author": "strangegoo"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[Minithread] The Game Awards Nominee Announcement 17.11.2025",
        "score": 282,
        "text_content": "Yes, GOTY nominees already leaked. But I guess we can have a small sub thread to discuss the rest of the nominees/livestream... |The Game Awards Nominees| |:-| |**Date/Time:** 17th November, 9AM PT/5PM GMT| |**Where to Watch:** TGA Youtube| |[What to Expect](https://thegameawards.com/coming-soon)|",
        "comments": [
            {
                "raw_content": "\\-RPG category feels kinda bland I feel either Hundred Line or Trails in the Sky 1st Chapter should have been there. \\-Sonic 3 not being there for best adaptation? \\-Happy for Ninja Gaiden 4 and Shinobi nominated for Action Game.",
                "author": "KelvinBelmont"
            },
            {
                "raw_content": "I'm glad they remembered Indiana Jones was eligible and nominated Troy Baker. His Harrison Ford impression was scarily good.",
                "author": "Spider-Fan77"
            },
            {
                "raw_content": "Donkey Kong Bananza : nominated in no major categories also Donkey Kong Bananza : goty nomination",
                "author": "thestorm236"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Resident Evil producer clarifies recent misleading information about Leon in REquiem: \"These are all fake news\" [via Stevivor]",
        "score": 285,
        "text_content": "In an exclusive and transcribed interview with the game's producer (Masato Kumazawa), the Stevivor editor discussed several aspects of Requiem and also the alleged \"leaks\" regarding Leon in the game. The producer was quick to clarify that these are all fake news. *\"Apart from any official information that Capcom has released, the rest is more detective work [on the part of players]. So I would suggest to please not take everything at face value [...] there has been a photo lately of Leon with an eye patch, and just basically saying there’s a DLC or a new costume for Leon — but just to make sure, these are all fake news.\"* The full article can be read here: https://stevivor.com/features/interviews/resident-evil-requiem-interview-leon-is-fake-news-no-demo-and-how-outbreak-fits-in/",
        "comments": [
            {
                "raw_content": "Interesting how many cards theyre keeping close to their chest with this game, we basically dont know anything outside the first hour. Guess game awards is when we decide if dusk golem gets crucified",
                "author": "PresidentialOtter"
            },
            {
                "raw_content": "The eyepatch photo was obviously fake. Leon is definitely in the game though.",
                "author": "ShmuckaRucka1"
            },
            {
                "raw_content": "Imma be real I hope Leon isn't in the game just so I can see the reactions of fans",
                "author": "BomberBlur070"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "AMD rumored to raise GPU prices just as Radeon RX 9070 XT finally reaches MSRP",
        "score": 625,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "Buy them now, I guess, before RAM starts getting hoarded like gold.",
                "author": "PerswAsian"
            },
            {
                "raw_content": "My 6800XT has lasted me 5 years already. With careful maintenance and undervolt it has to last another 5 I guess. But I'm winding down on gaming anyway since life is getting so busy.",
                "author": "FunkyRider"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "MaxSun to launch AMD B850 AIGA motherboard with support for 'Future-Generation' AMD CPUs",
        "score": 77,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You heard of motherboard, now get ready for mommyboard",
                "author": "GradSchoolDismal429"
            },
            {
                "raw_content": "And for some reason has fewer USB-C ports than my current gen motherboard",
                "author": "ConventionArtNinja"
            },
            {
                "raw_content": "Jginyue walked so maxsun could run",
                "author": "GOGONUT6543"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "ComputerBase tests AMD FSR Ray Regeneration in COD: Black Ops 7",
        "score": 41,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Too bad Nvidia has a better algorithm, but the 9070 XT performance is like 25% higher than the 5070 Ti",
                "author": "starburstases"
            },
            {
                "raw_content": "They (amd) could take 10 fps out of those results and still be delivering better value. Very promising.",
                "author": "MyrKnof"
            },
            {
                "raw_content": "That water is so much better on Nvidia in the first screenshot :(",
                "author": "blu3ysdad"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Ryzen-powered ZOTAC Zone Pro and Acer Nitro Blaze miss planned launch window",
        "score": 19,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yep, waiting for Zone pro... Want the Linux for my Zone 1... Give me the damned Beta -,-",
                "author": "gimmethatvoice"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "More than half of US homes lost value in the past year",
        "score": 309,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“Crucially, only 4.1% of homes have lost value since they were last sold, a smaller percentage than before the pandemic.” So no crash, still better than pre-pandemic, but returning to a normal market. On no, the horror.",
                "author": "zorg-18082"
            },
            {
                "raw_content": "They were artificially inflated by covid anyway. So, let's just call this a normalization or healthy correction. There is still room to go....",
                "author": "Somres-3831"
            },
            {
                "raw_content": "As always, region and location makes a huge difference.",
                "author": "ImpressiveShift3785"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The Most Splendid Housing Bubbles in America: Price Drops & Gains in 33 Large Expensive Metros in October 2025",
        "score": 50,
        "text_content": "https://wolfstreet.com/2025/11/16/the-most-splendid-housing-bubbles-in-america-price-drops-gains-in-33-large-expensive-metros-in-october-2025/",
        "comments": [
            {
                "raw_content": "Texas had an actual bubble, and that bubble has burst already. So if you want to live in Austin, now's about as good a time as any for the next 10 years.",
                "author": "zer0sumgames"
            },
            {
                "raw_content": "Austin is one of the few places that took action to lower their housing prices- the price drop is Austin is the result of deliberate building with the goal of prices going down.",
                "author": "Equivalent_Freedom16"
            },
            {
                "raw_content": "I am sure the bizarro version of this sub that likes to mock the doomers here will tell you Wolf is just another housing bear/doomer and he is overly negative with his data and somehow Austin-20% is still not a correction or crash because they know of a friend of a friend that sold last week over asking ..lol",
                "author": "Scblacksunshine"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "It's happening",
        "score": 466,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’m positive one of these days one of these labs is just gonna start tweeting “it’s god.” Then the model will have like 3% increase benchmark hits lol",
                "author": "Stock_Helicopter_260"
            },
            {
                "raw_content": "Polymarket has it at 88% chance it's released on the 18th, now Logan tweets.",
                "author": "sp3ncer"
            },
            {
                "raw_content": "*It* happens when it happens. That being said, stress test for the current scene is going to happen lol. Time will tell if it's another GPT-5 moment.",
                "author": "LukeThe55"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini 3 looks imminent",
        "score": 334,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is edging at this point, bruh",
                "author": "Dear-One-6884"
            },
            {
                "raw_content": "Vague posting at its finest",
                "author": "HyperspaceAndBeyond"
            },
            {
                "raw_content": "Logan Kilpatrick just tweeted \"Gemini.\" Polymarket odds are like 90% for tomorrow. Almost certainly happening. That said, everybody is hyping this thing to oblivion, it will probably just be a really solid model, not the second coming of Christ lol",
                "author": "Last-Cat-7894"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Sleeping giant is waking up",
        "score": 512,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The hype is too massive, and it's probably going to disappoint some people. There are tons of twitter accounts that didn't even have access to Gemini3 hyping the shit out of it for easy engagement",
                "author": "Sunifred"
            },
            {
                "raw_content": "These hype posts don't hit the same as they did in 2023.",
                "author": "orderinthefort"
            },
            {
                "raw_content": "Still having problems counting fingers, I see.",
                "author": "GrafZeppelin127"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Which Humans? LLMs mainly mirror WEIRD minds (Europeans?!)!",
        "score": 244,
        "text_content": "An AI link to the paper: https://nouswise.com/c/ea901b28-a59c-490b-a0fe-76b5fe73f94c the link to paper: https://www.hks.harvard.edu/centers/cid/publications/which-humans",
        "comments": [
            {
                "raw_content": "The paper is from 2023. Its ancient.",
                "author": "QLaHPD"
            },
            {
                "raw_content": "hand-wringing about “ethical issues” is fashionable; show me a practical path to collect balanced data from under-represented languages first.",
                "author": "Mael_ka09"
            },
            {
                "raw_content": "a correlation of –.70 sounds impressive, but psychological surveys across cultures are notoriously noisy—are we comparing apples to papayas?",
                "author": "krekerss"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "WeatherNext 2: Google DeepMind’s most advanced forecasting model",
        "score": 624,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Google deepmind has always been the heavyweight for real world applications of AI, I'm excited to see how this goes and what else they come out with",
                "author": "intergalacticskyline"
            },
            {
                "raw_content": "Crazy that Google is just making an API available to anyone for a weather predicting model that out performs previous generation models that ran on super computers.",
                "author": "TFenrir"
            },
            {
                "raw_content": "So wait Will this be used for the forecast on the default weather app on Android ? I still have the one with the cute frog 🐸",
                "author": "GTalaune"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Google released a paper on a data science agent",
        "score": 284,
        "text_content": "",
        "comments": [
            {
                "raw_content": "White collar jobs slowly getting cooked",
                "author": "FarrisAT"
            },
            {
                "raw_content": "There already seems to be an [inofficial implementation](https://github.com/JulesLscx/DS-Star) by a third party, pretty short script. Can't test it because I don't use Gemini.",
                "author": "Practical-Hand203"
            },
            {
                "raw_content": "what the fuck I am actually studying for a Data Science degree like bruh let me have a job",
                "author": "AdminMas7erThe2nd"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "xAI's soon-to-be-released model is severely misaligned (CW: Suicide)",
        "score": 471,
        "text_content": "",
        "comments": [
            {
                "raw_content": "💀✨",
                "author": "JaspuGG"
            },
            {
                "raw_content": "well thats dark",
                "author": "YaBoiGPT"
            },
            {
                "raw_content": "According to the documents on OpenRouter for this model (assuming it's Grok, but we all are pretty sure it is), it's clear that ALL moderation needs to be done by the developer. It's VERY wide open. Like anything, as they get ready to release, they will add the guardrails, but for now it's completely wide open.",
                "author": "MaybeLiterally"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "GPT-5.1 AR -AGI scores.Achieving SOTA in ARC-AGI-1.",
        "score": 160,
        "text_content": "",
        "comments": [
            {
                "raw_content": "For more information: On ARC-AGI-1, GPT-5 Pro scored 70.2% while GPT-5.1-Thinking High scored 72.8% with the latter being about 7 times cheaper. It approaches o3-preview (low) score of 75.7% but is almost 300 times cheaper. For ARC-AGI-2, GPT5.1-Thinking-High is still 17.6% vs GPT-5 Pro's 18.3% but is about 6 times as cheap, the best for its price.",
                "author": "Profanion"
            },
            {
                "raw_content": "The cost reduction has been incredible. I remember when we were blown away by o3 preview's 75% score, and the cost per task for that model was 200 fucking dollars, now it is less than a dollar.",
                "author": "10b0t0mized"
            },
            {
                "raw_content": "Looks like current SOTA compute models are peaking around 20-25% on ARC 2. Probably need bigger models with more test time compute to get further along.",
                "author": "FarrisAT"
            }
        ],
        "subreddit": "singularity"
    }
]