[
    {
        "post_name": "BREAKING: Gov Abbott Says He Will REMOVE FROM OFFICE Democrat Lawmakers Who Fled Texas to Block GOP Congressional Redistricting",
        "score": 637,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Governor Greg Abbott Real Texans do not run from a fight. But that’s exactly what most of the Texas House Democrats just did. Rather than doing their job and voting on urgent legislation affecting the lives of all Texans, they have fled Texas to deprive the House of the quorum necessary to meet and conduct business. These absences are not merely unintended and unavoidable interruptions in public service, like a sudden illness or a family emergency. Instead, these absences were premeditated for an illegitimate purpose—what one representative called “breaking quorum.” Another previously signaled that Democrats “would have to go by an extreme measure” of a quorum break “to stop these bills from happening.” In other words, Democrats hatched a deliberate plan not to show up for work, for the specific purpose of abdicating the duties of their office and thwarting the chamber’s business. That amounts to an abandonment or forfeiture of an elected state office. When the Governor calls a Special Session, our Constitution provides that the “Legislature shall meet.” TEX. CONST. art. III, § 5 (emphasis added). It’s not optional. It’s a duty. The absconded Democrat House members were elected to meet and vote on legislation—not to prevent votes that may not go their way. Every session, legislators on both sides of the aisle find themselves on the losing side of a legislative vote. And every session, most of those legislators find a way to disagree agreeably and behave like adults, rather than going AWOL. This truancy ends now. The derelict Democrat House members must return to Texas and be in attendance when the House reconvenes at 3:00 PM on Monday, August 4, 2025. For any member who fails to do so, I will invoke Texas Attorney General Opinion No. KP-0382 to remove the missing Democrats from membership in the Texas House. In that Opinion, the Attorney General considered “whether Texas law allows for a determination that a legislator has vacated office” if they intentionally break quorum. The Attorney General concluded that “whether a specific legislator abandoned his or her office such that a vacancy occurred will be a fact question for a court.” He further concluded that “through a quo warranto action, a district court may determine that a legislator has forfeited his or her office due to abandonment and can remove the legislator from office, thereby creating a vacancy.” That empowers me to swiftly fill vacancies under Article III, Section 13 of the Texas Constitution. In addition to abandoning their offices, these legislators may also have committed felonies. Many absentee Democrats are soliciting funds to evade the fines they will incur under House rules. Any Democrat who “solicits, accepts, or agrees to accept” such funds to assist in the violation of legislative duties or for purposes of skipping a vote may have violated bribery laws. See TEX. PENAL CODE § 36.02. The same could be true for any other person who “offers, confers, or agrees to confer” such funds to fleeing Democrat House members. I will use my full extradition authority to demand the return to Texas of any potential out-of-state felons. Source: https://gov.texas.gov/news/post/governor-abbott-statement-on-house-democratic-quorum-break",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "Sounds good but I’ll be happy once it happens, until then I wont celebrate",
                "author": "Buff_cousin_Elroy"
            },
            {
                "raw_content": "And replace them with patriots, right? I'm here for it.",
                "author": "RFKJrsVocalChords"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨🚨🚨If they don’t tow the company line then they get deported. It’s just like slavery. If they don’t do what the massa wants then the boy gets beat, and girl gets raped. Same energy. Change. My. Mind.🚨🚨🚨",
        "score": 493,
        "text_content": "",
        "comments": [
            {
                "raw_content": "FYI, the phrase is \"toe the line\". It originates from lines painted on the decks of naval ships for waterproofing. Navy sailors would be called to fall in to formation, then use the deck lines as a reference point for where to place their toes.",
                "author": "LineInTheSand"
            },
            {
                "raw_content": "They hire them because the democrats subsidize their employment through social programs while using them to steal elections. Illegals are not victims their total comp is higher than an American and that’s before the various fraud they commit.",
                "author": "Elencher"
            },
            {
                "raw_content": "In the Good old days we call them Slaves,Thralls, and other names. And woe to you if you are poor and trying to compete with a Slave for a Job. So some citizens volunteer just to became slaves. https://en.wikipedia.org/wiki/Voluntary_slavery",
                "author": "DT170x"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "In 1991, China only accounted for 1% of total imports to the United States. Then came the Bush-Clinton globalization era",
        "score": 397,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Now China and India export people Soylent Exports",
                "author": "FaustyArchaeus"
            },
            {
                "raw_content": "if we're really a \"consumer economy\" then why the fuck are they buying up all our farmland? we clearly weren't a muh consumer colony 30 years ago. CONgress fucked us.",
                "author": "darkmodeforgotpass"
            },
            {
                "raw_content": "It more like companies want to race to the bottom of the barrel just to save a penny. We got Hit hard with H1-B,illegals, and offshoring All at once. EDIT: Almost forgot Shrinkflation and Planned Obsolescence was starting to happen at the same time.",
                "author": "DT170x"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "HUGE NEWS: A federal judge has BLOCKED a 16 Democrat states’ effort to FORCE President Trump to release funding for “diversity research.” Hundreds of MILLIONS have just been saved for taxpayers! And Big Leticia James loses again. 🤣",
        "score": 1058,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Still waiting for her perp-walk.",
                "author": "Scatter-Shot"
            },
            {
                "raw_content": "so I guess nothing is going to happen to her and Adam Schiff for their house, residence, mortgage fraud, or whatever. Right?",
                "author": "leakmouth"
            },
            {
                "raw_content": "Diversity research: - There are 2 genders...one always seems to want a crutch and special treatment - There are many races...one always seems to want a crutch and special treatment - Leticia has 2 crutches",
                "author": "Whoopies_tds"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Congress wants to immunize pesticide manufacturers, like the Reagan administration did for vaccine manufacturers. HELL NO!",
        "score": 1084,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I suspect that much of the declines in fertility are due to xeno-estrogens (also called pseudo-estrogens) that disrupt hormones. Atrazine is the most famous. What Alex Jones said was making the frogs gay. I wouldn't be surprised if it had a connection with the rise of trans. This is a civilizational threat.",
                "author": "SuperDuperBasedMD"
            },
            {
                "raw_content": "No immunity for anyone. Not companies. Not cops. Not teachers.",
                "author": "ThorsonTT"
            },
            {
                "raw_content": "I would take weeds over poison in my blood. Radical thinking.",
                "author": "For_All_Mankind"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"Tell me a sound that's better than this\"",
        "score": 1034,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Technically it's both the sound of ICE haha",
                "author": "RentFree2020"
            },
            {
                "raw_content": "Excellent.",
                "author": "TwoArizonaPedes"
            },
            {
                "raw_content": "&#65038; Nothing like some ICE very near you on a hot summer day. &#65038;",
                "author": "BallotsOnRubysUSB"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Conservative news outlet GB News becomes #1 news channel in UK",
        "score": 806,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If it were really conservative it would be banned. Probably only commie light.",
                "author": "NoFats"
            },
            {
                "raw_content": "GB news is Conservative in the same way Republicans are. Which is to say, nominally. In name only.",
                "author": "DoMe22"
            },
            {
                "raw_content": "Farage is containment.",
                "author": "Easzq8"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"India portrays itself as being one of our closest friends in the world; but they don't accept our products, they impose massive tariffs on us, we also know they engage in a lot of cheating on immigration policy.\"",
        "score": 966,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Vance / Miller 2028",
                "author": "TrumpWonByALandslide"
            },
            {
                "raw_content": "and they could stop all those scammers if they wanted to",
                "author": "Gunmolester"
            },
            {
                "raw_content": "Yes and they smell.",
                "author": "HiimHillaryClinton"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "When redistricting occurs in blue states, it's \"equity.\" When redistricting occurs in red states, it's \"un-American.\"",
        "score": 1344,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Theyre just mad they already maxed out their own gerrymandering. Only skews red from here.",
                "author": "PresidentialPepe"
            },
            {
                "raw_content": "so retarded even a caveman doesnt nod",
                "author": "Colorado-Living"
            },
            {
                "raw_content": "There's no such things as blue states. Just some state capitols with commie-dems in charge for now.",
                "author": "GallowsTime"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The newly erected Big Beautiful American Flag looks spectacular as daylight turns to dusk in Washington, D.C. May God Bless the United States of America 🇺🇸",
        "score": 877,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Magnificent.",
                "author": "OpusX"
            },
            {
                "raw_content": "I looks like it was always there.",
                "author": "rivetjoint2"
            },
            {
                "raw_content": "Who on earth could possibly object to that big beautiful flag?",
                "author": "Returningtogod"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "PRESIDENT TRUMP: \"We've cut drug prices by 1,200%, 1,300%, 1,400%, 1,500%. I don't mean 50%. I mean 1,400%, 1,500%, because we're going favored nations. We want the same price as Europe gets.\"",
        "score": 847,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They pay us? Kek",
                "author": "Here_we_go"
            },
            {
                "raw_content": "This mathematically makes 0% sense.",
                "author": "BritchesGetStitches"
            },
            {
                "raw_content": "Obviously Trump is hilarious wrong here because cutting price by 100% is free and 1,200% means they pay you 12x the price to take the drugs. What I think he means is that the drug prices used to cost 1,200-1,400% of what they cost now. Which would mean they are now roughly 7-8% or so of their former cost or a roughly a 92-93% price cut. No clue if that was his intention but that's the only reasonable conclusion I can draw",
                "author": "Genji_Sama"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "PRESIDENT TRUMP ON LAURA LOOMER: \"I like her!\" \"I've known her for a long time, and, you know, personally, I think she's a patriot, and she gets excited because of the fact that she's a patriot, and she doesn't like things going on that she thinks are bad for the country.\"",
        "score": 802,
        "text_content": "",
        "comments": [
            {
                "raw_content": "[Hopefully he keeps firing the snakes in his administration that she warns him about.](https://www.newsweek.com/trump-fires-mike-waltz-staffers-after-laura-loomers-white-house-visit-2054940)",
                "author": "sorrytodisagree"
            },
            {
                "raw_content": "Create a new office for her and set it up to weed out shitty commies.",
                "author": "KennyKetchem"
            },
            {
                "raw_content": "Her Loomer Unleashed podcast can be downloaded now in mp3 audio format here: https://loomer-unleashed.simplecast.com/ Her latest episode covers continuing vetting issues within the Trump camp.",
                "author": "Tim_Berframer"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: DOZENS of Texas Democrat lawmakers will now FLEE THE STATE to avoid allowing Republicans in the legislature to pass the map, which adds 5 GOP House seats, per POLITICO. They want to break quorum. AG KEN PAXTON has stated plainly: if they do this, they may be arrested. FAFO TIME.",
        "score": 1610,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I feel like I've seen this before. Edit: Yep, [in 2021 Texas Democrats fled the State to avoid passing legislation to revamp voting laws.](https://www.texastribune.org/2021/07/12/texas-democrats-voting-bill-quorum/) Too bad for them. No more Census skewing for Democrats.",
                "author": "McFatty7"
            },
            {
                "raw_content": "Arrest their asses. Bring them back into the congress. Quorum achieved.",
                "author": "Colorado-Living"
            },
            {
                "raw_content": "All these threats of arrests and zero arrests made or will be made. Tiresome",
                "author": "For_All_Mankind"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Negative net migration for 2025 says CNN",
        "score": 1156,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good. We need fifty more years of negative migration. While simultaneously convincing American women that having kids is a good thing.",
                "author": "Filo76"
            },
            {
                "raw_content": "What we voted for",
                "author": "ohwell316"
            },
            {
                "raw_content": "Good. Get the fuck out. Culturally enrich your own shithole. Legal, illegal, visitors all",
                "author": "thepilotofmoya"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "America First",
        "score": 1577,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Including outsourced staff to India, etc.",
                "author": "Grindelwald"
            },
            {
                "raw_content": "For every foreign employee, you get taxed 100%.",
                "author": "systemic_threat"
            },
            {
                "raw_content": "You don't even need to do that if you just consider an immigrant as an import and tariff their productive output the same as any other imported good.",
                "author": "CommanderOfCheese"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Oh now they have a problem do they with redistricting?",
        "score": 1125,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Have you seen the illinois congressional map? Everything is basically snaked out to make sure it can be a democrat seat. Probably the most insane districting in the country",
                "author": "PapaPepe"
            },
            {
                "raw_content": "Washington State has 45% of votes for Republicans, but just 20% of the seats. I'm all for redistricting.",
                "author": "DannibusX"
            },
            {
                "raw_content": "Illinois is a complete Dem fucktard land of pure evil.",
                "author": "goodguy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Chuck Schumer received thousands in campaign donations from Jeffery Epstein.",
        "score": 1206,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Link https://x.com/IanJaeger29/status/1952099870291984871 Sauce https://theamericantribune.com/resurfaced-report-reveals-chuck-schumer-received-signifanct-donations-from-jeffrey-epstein/",
                "author": "I-am-Orlando"
            },
            {
                "raw_content": "Jews rape kids.",
                "author": "MoreVanceMemes"
            },
            {
                "raw_content": "Well, he's married to a dude, so...",
                "author": "Melchizedek18"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "EXCLUSIVE: After 8 Years of Hiding Documents – Deep State DOJ Asks to Move Seth Rich Case to “The Dirtiest Federal Courthouse in America” – DC",
        "score": 1034,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sometimes I feel like the Trump administration doesn't find out about retardedly corrupt shit until it's pinned here at PDW",
                "author": "wharfthrowaway"
            },
            {
                "raw_content": "Rich is the JD Tippitt of the RussiaGate Conspiracy.",
                "author": "LeeHarvey"
            },
            {
                "raw_content": "President Trump, please get a grasp of your departments; America depends on you.",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Control",
        "score": 671,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I remember getting laughed at in high school speech class, because I argued women aren’t as strong as men and shouldn’t be in combat roles. Fuck them hoes.",
                "author": "MikeyisNinja"
            },
            {
                "raw_content": "Breaking down taboos is how abortion went from a mortal sin to post hoc birth control. Not all taboos are bad.",
                "author": "GuidedDisinfo"
            },
            {
                "raw_content": "Absolute fact. 99% of Americans can tell you the magic WW2 number like it's tattooed on the inside of their eyelids, but have no earthly idea about the number of Americans killed in the war.",
                "author": "JohnN"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump: I want to get the drug prices down by 1,000%, 1,200%. You know what I mean by that.. We'll have drug prices coming down by 500, 600, 800, even 1,200%.",
        "score": 1070,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why does everyone in this country need so many fucking drugs?",
                "author": "MoreVanceMemes"
            },
            {
                "raw_content": "Not if a district court judge has anything to say about it",
                "author": "awsure"
            },
            {
                "raw_content": "Ok but that’s not possible unless the drug companies are paying us to take their drugs lmao",
                "author": "MikeyisNinja"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Ryzen 7 9800X3D left Core i9-14900K in the dust in Battlefield 6 early streamer tests — both systems included an RTX 5080, but the 3D V-Cache system was roughly 30% faster",
        "score": 684,
        "text_content": "Battlefield 6 reportedly has impressive performance on both PC and console. The studio is targetting 60 FPS on PS5 and Xbox Series X|S by default while PC gets to enjoy an uncapped frame rate. New reports even suggest 300+ FPS at 1440p, on a 9800X3D paired with an RTX 5080, without upscaling.",
        "comments": [
            {
                "raw_content": "I can't wait to see how my 5800x3d will perform",
                "author": "axaro1"
            },
            {
                "raw_content": "The article says it's unknown if they were using DLSS or not.",
                "author": "asdf12311"
            },
            {
                "raw_content": "Is not the 285 or whatever it's called the current generation?",
                "author": "INITMalcanis"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Running Gaming Workloads through AMD’s Zen 5",
        "score": 34,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hello Geddagod and happy birthday",
                "author": "Illustrious_Bank2005"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Miniroute N7 Motherboard (AMD 8845HS 10GbE mITX NAS) Review",
        "score": 15,
        "text_content": "",
        "comments": [
            {
                "raw_content": "LTT next week: Making the ULTIMATE portable shoe box server.",
                "author": "BlueGoliath"
            },
            {
                "raw_content": "Doesn't seem to support modems, does it?",
                "author": "battler624"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "DeepCool Assassin VC Elite Review: The best cooler you can’t buy in the USA",
        "score": 52,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So deepcool is really finished in the us huh?",
                "author": "upbeatchief"
            },
            {
                "raw_content": "Nearly 2KG for an air cooler is a crazy amount of metal lol. I like it.",
                "author": "got-trunks"
            },
            {
                "raw_content": "Predictably, given the price tag and the last model, a dominating design. I suspect VC 'cold plates' will be a feature that proliferates not so far off - for example, given CR's VC low profile cooler I suspect at least one successor to the Gladius will sport one.",
                "author": "Jeep-Eep"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "best resources to learn about computer hardwares ?",
        "score": 2,
        "text_content": "Upcoming CS grad here. Any good/free resources to learn and have a deep understanding about computer hardwares, OS, etc.. ?",
        "comments": [
            {
                "raw_content": "https://www.professormesser.com/",
                "author": "bobremembers"
            },
            {
                "raw_content": "Someone didn't do their homework.",
                "author": "exomachina"
            },
            {
                "raw_content": "The best resource is your own curiosity.",
                "author": "Marctraider"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Ok Nintendo, give us this as merch please",
        "score": 233,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Rambi had\\* a Lego set, but no plush that I can find. [https://www.lego.com/en-us/product/rambi-the-rhino-expansion-set-71420](https://www.lego.com/en-us/product/rambi-the-rhino-expansion-set-71420)",
                "author": "StockHumor4768"
            },
            {
                "raw_content": "Need a Cranky and Rambi amiibo",
                "author": "Tartrion"
            },
            {
                "raw_content": "I accidentally punched him and he evaporated and never came back 😭",
                "author": "Spleenzorio"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo has released an official Qualtrics Survey about physical and digital media.",
        "score": 241,
        "text_content": "[https://nintendoofamerica.co1.qualtrics.com/jfe/form/SV\\_e54yuThgl5J1nnM](https://nintendoofamerica.co1.qualtrics.com/jfe/form/SV_e54yuThgl5J1nnM) Better than screaming at the void about complaints regarding game key cards. Something is something.",
        "comments": [
            {
                "raw_content": "I will never not see Ninten**Doof** in their URL. ![gif](giphy|12HuDkxpaUmBS8)",
                "author": "StockHumor4768"
            },
            {
                "raw_content": "Can't speak for anyone else, but my survey mostly just seemed to want to know about why I dislike in-store game download codes. Which, hey, Nintendo, if you want to implement a basic gift service, I'm down for happily getting rid of them. Also implement the eshop into the Nintendo Switch app like the PS App and Steam.",
                "author": "QuestSeeker23"
            },
            {
                "raw_content": "Thanks, that definitely felt more productive than just complaining on reddit",
                "author": "MunkyMan33"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "the switch price increase is a mess, you can currently get the mario wonder oled bundle for it’s original price on my nintendo still lol",
        "score": 176,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This particular bundle has likely ended production and was not subject to tariffs. As a result, they can get away without charging extra.",
                "author": "autumngirl86"
            },
            {
                "raw_content": "increase or not, why would anyone buy a switch1 for full price rn?",
                "author": "Legitimate_Most6651"
            },
            {
                "raw_content": "We great again, yet?",
                "author": "DZhuFaded"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "All the Switch 2’s power was put in her face",
        "score": 180,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The game is Yakuza 0, for everyone asking.",
                "author": "BardOfSpoons"
            },
            {
                "raw_content": "I’ve had such a good time with this game. It’s hilarious in ways that I just didn’t expect. I’ve logged over 80 hours so far and have been holding off on the final mission because I’m not sure what to play when I’m done! 🤣",
                "author": "Raging_Pwnr"
            },
            {
                "raw_content": "Ok cool, what game?",
                "author": "3serious"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "New American Nintendo prices are here :(",
        "score": 977,
        "text_content": "Switch 2 consoles, games, and GameCube NSO Controller seem to be unaffected (supposedly joy con 2s are getting a price hike from a target listing) But yeah this sucks, try and get these now before other retailers update their prices",
        "comments": [
            {
                "raw_content": "There is no way anyone pays for an oled switch than the extra $50 to 100 for switch 2. Might as well discontinued it. But apple makes money on ladder pricing between models.",
                "author": "EitherRecognition242"
            },
            {
                "raw_content": "And worst of all the alarm clock is getting a price hike :(",
                "author": "awsmrabbit21"
            },
            {
                "raw_content": "Any of the remaining guilt I had for buying the $200 clearance OLED bundle from Costco has dissipated.",
                "author": "RandomJamSesh"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Wow. Adventures of Elliot became my most anticipated game of 2026 within 2 hours. Here’s why…",
        "score": 311,
        "text_content": "The game looks gorgeous. Music is great. Really tight controls. Great game mechanics with the two types of fairy interaction (really unique), the combos, surprising enemies giving more damage, using fairy to appear behind, enemy variety, the Magicites (or whatever they’re called to allow you to create a buff to your liking), the guarding and parrying. All fun and varied. You can change the speed of the dialogue in the settings which often annoys me with RPGs. When I died on the boss, it allows you to spend money to come back to life so good variable difficulty mechanic for players. Good “platforming” and puzzles. It seems they’ve really thought of everything. I’ve always wanted to get into an action RPG but find them hard to and the old Zelda games don’t have nostalgia for me, so I often find their “old school” ways a little tedious. This being a modern game seems to have none of that and I’m super pumped for it. Definitely give it a go if you’re on the fence. I was enjoying it once I started fighting the enemies. What would people’s critical feedback be for it so far? My only big one is I wish I could have access to the bomb and arrow at the same time but maybe there’s a reason. Also I seems you have to press two buttons to get out of the map. Can’t wait for this one!",
        "comments": [
            {
                "raw_content": "I put about 45 minutes into the demo this morning and really, really enjoyed it. It felt like an improved Secret of Mana with a dash of Links Awakening. I’m sad I probably only have an hour left on the demo as now I really want the whole game. Instantly buying it when it comes out",
                "author": "Available-Low-2428"
            },
            {
                "raw_content": "My feedback so far is tone down the comments of the fairy, she says something for everything and some are funny but they also just become white noise, so just tone down the frequency of them. But yeah I really liked the demo a lot.",
                "author": "KelvinBelmont"
            },
            {
                "raw_content": "100% agreed. Demo was amazing",
                "author": "Hotelier101"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Mario Kart World has a great core, but I find it lacking in several areas.",
        "score": 169,
        "text_content": "**I. Introduction** To start, I'd like to say that I do really like some of the strides they made in this game. I like the concept of the interconnected world and I think that was a neat way to differentiate this from MK8. The amount of tricks and different paths you can take in a course is pretty cool too. The MK gameplay that you know and love is here and it's still great. Knockout Tour is also a fantastic mode and that is something that can only be possible in this game. With that said, as someone who has played a ton of MK8 for the last 10 years: I am finding it hard to feel enthusiastic about this entry in its current state. I've played for about 15 hours and I feel like I've seen most of what the game has to offer. VS mode and battle mode are still a blast, but they are the same modes we've been playing for a long time. Free Roam I also find incredibly disappointing and this seemed like the premier mode in the initial marketing. I just don't feel like the game has given me a lot of reasons to stick with it besides the occasional session with friends. I'm sure this will get a lot of updates over the next 7-8 years, but I can't help and wonder why after 10 years of MK8 that this game feels lacking. Anyways, I'll expand on what really disappointed me with this game. **II. Free Roam** During the NS2 debut Direct, this seemed like such a great idea. A world you can explore and discover hidden things and possibly even have a dedicated story/career mode. However, when you turn on the game, free roam is not even a mode you select from the traditional menu--it's nestled in the bottom right corner of the screen. It is almost like an afterthought and, after playing some hours with it, I can get why they did that because there isn't much exciting content there. You just drive around aimlessly and do some P-switch challenges and find some medallions. Neither give you any rewards and it's hard to track them because there isn't really a menu within free roam that you can refer to easily. The challenges are fun at first, but that's all there really is to do and they got old fast for me. I just find the whole mode wasted potential. There could have been a story mode with a central hub where you can complete missions and unlock certain things like costumes, karts, skins for the karts, etc. Considering the advance movement you can do in this game, there could have been boss battles you could find and fought in the world. There could have been NPCs you could find and talk with in the world where you could collect items or get missions from. Or different things happen at different times of the day. There is just so much potential you could have done with it. The world they made is really beautiful, but I don't have much incentive to explore. Maybe instead of making 394 p-switch challenges, they could have diversified the type of content you could do in the world. This entire mode just feels like wasted potential. **III. Online Quality of Life** I know this is Nintendo and they suck at online and all that, but c'mon man. I can't make a party with friends and join a match together? One of us has to start a regular race and then we have to hope we can get into the race. In Knockout Tour, you can't even join with friends--what's up with that? Also when you leave a race, you're booted to the main menu and have to reconnect to the online. It's just kind of annoying. The majority of people are going to play this game online and yet they didn't have the foresight to try and work out some of these basic features? I just don't understand why they neglect stuff like this. It is incredibly frustrating. **IV. More Modes** Maybe this is me being too greedy, but I was hoping this game would be packed to the brim with new modes. Even if they were smaller mini-game-like modes, I was hoping this game was going to be packed with different type of content you could do. Knockout Tour is a great addition, but I was hoping we would also get one that is bit unconventional like battle mode. Something that isn't directly related to racing, but you're still using the Kart. If free roam offered more interesting content, I may not have felt this way. But I'll concede this is me probably asking for too much. **V. In-Game Events** It feels like there isn't really anything to look forward to in-game. This game is essentially Nintendo's live service game that they'll be supporting for a long time, but the game doesn't really feel that way as of now. I think they could have borrowed some ideas from Splatoon and have in-game events that people could look forward to and try to participate in every so often. But they have nothing of the sort in this game. **VI. Conclusion** After 10 years of MK8, I was hoping MKW would have been a groundbreaking title for the series that would have pushed the series forward and be packed with all sort of interesting content. Instead, the game feels halfway there. There are great ideas here, but some are undercooked and the omission of certain features is baffling. MKW feels more iterative as a result and that is a shame. The game is still great to play with friends online or couch co-op, but I had higher hopes for this game. Ultimately, I feel underwhelmed by what is offered even though it is still a lot of fun. If you are able to get the NS2 bundle like I did then I think it's worth it, but I would have a harder time recommending this game at $80 until more updates come out.",
        "comments": [
            {
                "raw_content": "MKW is a collection of fantastic ideas but none of them save the physics, graphics, and music ever reached more than 50-60% completion before release.",
                "author": "unsurewhatiteration"
            },
            {
                "raw_content": "i find its a really fun game but it really needs some more routes for knockout tour and a bit of a bigger map imo. also just more to do in free roam",
                "author": "MrTriggrd"
            },
            {
                "raw_content": "It's aggressively fine. I have had moments of joy in it (cute little details in the open world) but ultimately it's not as straightforward to play as Mario Kart 8. I don't find the new features of wall riding/grinding intuitive (the controls are difficult?), and the increased player count makes the game a bit TOO chaotic. There are some cool courses but they also haven't felt very memorable at all. I don't mind the intermission courses, but I do think I preferred the 3 lap format as it helped you learn courses faster and remember them. That muscle memory became part of the skill, and made you attached to your favourite tracks; whereas now, most courses are places you drive straight through and that's that. It has dropped to a 7/10 for me, I hope Nintendo develops it further because it feels like there's potential but it needed more time in the oven.",
                "author": "stileshasbadjuju"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Asked my wife to play co-op Bananza with me LOL",
        "score": 44,
        "text_content": "I think she likes destroying the terrain? can’t tell",
        "comments": [
            {
                "raw_content": "Seems like yall are having a great time lol.",
                "author": "TheExile285"
            },
            {
                "raw_content": "how much do you want me to destroy? yes",
                "author": "lv5vegetto1"
            },
            {
                "raw_content": "Owch, my eyes! My beautiful eyes!",
                "author": "Blofse"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Discussion, News, and Request Thread - week beginning 08/04/25",
        "score": 4,
        "text_content": "Discussion threads are your weekly central hub for all requests, gaming news, and any other gaming topics you want to talk about. *Please keep all content that doesn't need it's own post to this thread to de-clutter the sub for proper leaks and rumors. Thanks!* **Join our new companion sub for super secret Resident EVIL 9 and Half-Life 3 leaks** \\-- [r/OkBuddyGLAR](https://new.reddit.com/r/OkBuddyGLAR/) Hot Threads of the past week: * [GTA 6's 8 year development cycle confirmed by a former Rockstar dev](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1mca68x/gta_6s_8_year_development_cycle_confirmed_by_a/) * [PlayStation \"Orion\" (PS6 Home Console) and PlayStation \"Canis\" (PS6 Handheld) early Specs Leak from Moore’s Law Is Dead](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1mery12/playstation_orion_ps6_home_console_and/) * [NatetheHate clarifies what his sources are told in advance of a Nintendo Direct](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1mdmg41/natethehate_clarifies_what_his_sources_are_told/) * [HLX aka HL3 claimed to potentially be in its \"final\" phase of development](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1meg3pn/hlx_aka_hl3_claimed_to_potentially_be_in_its/) * [EA accidentally tweeted out the release date for Battlefield 6 then quickly deleted the tweet (it's October 10th)](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1mdjjbc/ea_accidentally_tweeted_out_the_release_date_for/) # [Want to help us improve this subreddit? ](https://forms.gle/w9JaYTjVN1Zie9e39)[Provide us with feedback here](https://forms.gle/w9JaYTjVN1Zie9e39)[!](https://forms.gle/w9JaYTjVN1Zie9e39) # [Click here to join the discord to enjoy further conversations with the community!](https://discord.gg/6jdBvCSqbj)",
        "comments": [
            {
                "raw_content": "With the PS6 portable on the horizon, I'm really curious where Sony will aim this console. Will it be sold as a \"cheap\" version of the PS6 or as a companion accessory? Also, how much appeal will it have for general consumers? Of course, they can use the digital library that many of their consumers already have as a point of sale, but do you think that will be enough?",
                "author": "Midnight_M_"
            },
            {
                "raw_content": "Best of luck for getting into the closed beta for marvel tokon Everyone",
                "author": "LuigiWarrior"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Nintendo reaffirms Metroid Prime 4 is coming late 2025, semi-debunking KiwiTalkz recent statement that it may be delayed into 2026",
        "score": 290,
        "text_content": "https://www.nintendo.com/en-ca/whatsnew/fan-expo-canada-attendees-will-have-access-to-play-the-latest-and-upcoming-titles-on-nintendo-switch-2/ Went ahead and linked my post about KiwiTalkz from yesterday below as well. The only reason why I said “semi-debunk,” is because he couldn’t pick whether the game was gonna come out November 2025, or potentially be delayed. But Nintendo themselves have now said it’s still on track for 2025, so who knows https://www.reddit.com/r/GamingLeaksAndRumours/s/eRBZ9Ej3F7 **EDIT:** Only coming back to this because apparently Kiwi went out of his way to screenshot this post. Kiwi, nobody is being misleading here. The title isn’t opinionated, all I did was say that your claim that it **MAY** be delayed to 2026 was untrue, as that’s literally what you said. You said you believed it was November 2025, but that you ALSO thought it mind end up being delayed. I didn’t mislead anybody, and I’ve actually been defending you a lot in all the posts I’ve made about you. The most I’ve said about you is that your tweets are bloated. I’m not a game journalist, nobody here is misconstruing anything. All I did was say it MAY debunk something you said was a possibility. Stop acting like I killed your dog man. Dont be surprised people are badmouthing you when you get very aggressive for no real reason. https://xcancel.com/kiwitalkz/status/1952247681709117905?s=46",
        "comments": [
            {
                "raw_content": "It’s Nintendo. It was probably finished a year and a half ago.",
                "author": "achosid"
            },
            {
                "raw_content": "I don’t think KiwiTalkz is pulling our chain or anything. Doesn’t mean he understands the full picture. It’ll come out when it comes out. As a Metroid fan, I’m fine if it comes out this year or next.",
                "author": "caulrye"
            },
            {
                "raw_content": "this game has so many expectations from many different people and I hope it can somehow manage to meet atleast most of them. I want it to succeed so bad",
                "author": "piperpiparooo"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "NateTheHate states he will look into Switch Force's baseless claim of a non-general direct this week.",
        "score": 160,
        "text_content": "Expecting him to come back and say it's wrong, lol. SOURCE: [https://xcancel.com/NateTheHate2/status/1952201851870560256](https://xcancel.com/NateTheHate2/status/1952201851870560256)",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Why in the world would they have another non-general direct not even two weeks removed from the previous non-general direct?",
                "author": "SwordsAndTurt"
            },
            {
                "raw_content": "As long as we get an answer lol.",
                "author": "niles_deerqueer"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "NVIDIA Planning Aggressive RTX 50 GPU Price Cuts Amid Pressure From Reduced Sales",
        "score": 324,
        "text_content": ">According to Boardchannels, via [Chiphell](https://www.chiphell.com/thread-2730197-1-1.html), the RTX 50 series GPUs have been stocked way above the ideal levels. **This happened mainly because of low sales** and continuous supply. >As per the insider, this has happened because of a sharp drop in the terminal sales, **leading to declines in the retail and even wholesale prices**. Due to the overstocking, the industry experts now expect the manufacturers to lower their prices throughout August. [Source](https://tech4gamers.com/nvidia-cut-rtx-50-gpu-prices-poor-sales-oversupply/)",
        "comments": [
            {
                "raw_content": "-$10",
                "author": "chocoponcho_"
            },
            {
                "raw_content": "Doubtful. Would be nice, but I really doubt it.",
                "author": "SelectivelyGood"
            },
            {
                "raw_content": "Aggressive price cuts in their eyes is probably like 20 dollars at most",
                "author": "Relevant_Mail_1292"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "IGN leaks in video description that Dr Strange is a new character in Marvel Tokon",
        "score": 311,
        "text_content": "IGN video description \"Don't miss the PS5 Closed Beta Announcement Trailer for Marvel Tokon: Fighting Souls, an upcoming action fighting game developed by ARC System Works. Players can take a dip into the wider Marvel Universe to duke it out in intense fighting battles with Marvel's biggest heroes including Spider-Man, Iron Man, Doctor Strange, Storm, Dr. Doom, and more, in an upcoming closed beta for the game. The closed beta will be fitted with 6 playable characters, online matches, spectator mode, training tutorial, and more. Marvel Tokon: Fighting Souls is coming soon to PlayStation 5 (PS5) and PC with a closed beta running from September 5 through September 7 exclusively on PlayStation 5 (PS5).\" Source: https://youtu.be/QdLUgYZi2Ck?si=h14itfDtIfTr1dlU UPDATE: IGN has removed Dr. Strange from the description now.",
        "comments": [
            {
                "raw_content": "This really feels like it's just a goof from IGN. The trailer specifically calls out all of the characters that will be playable and the Evo announcements are over.",
                "author": "OrangeLightning7895"
            },
            {
                "raw_content": "Definitely a goof on IGN's part The actual trailer details that the same six characters from the EVO show floor build are in the beta and nobody else. Still hiding Spidey and Robbie for some reason lol But Strange seems like a lock for the game anyway. I'd be shocked if he doesn't make it in",
                "author": "MyMouthisCancerous"
            },
            {
                "raw_content": "Honestly the description seems AI written if you look at it, having a description of the reveal trailer while also talking about the beta description",
                "author": "TypicalOceans"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Amazon has leaked a special 40 year anniversary Xbox Rare (The company) Controller.",
        "score": 48,
        "text_content": "[https://www.amazon.com/8Bitdo-Controller-Gaming-Console/dp/B0FHQ6P7TQ](https://www.amazon.com/8Bitdo-Controller-Gaming-Console/dp/B0FHQ6P7TQ) Most likely going to be announced officially soon. It can be used on Xbox, Windows PC, and Android. Credit to u/CyraxxFavoriteStylus for spotting it.",
        "comments": [
            {
                "raw_content": "This would've been nicer earlier this year, before two Rare related games were cancelled.",
                "author": "Arcade_Gann0n"
            },
            {
                "raw_content": "Let's celebrate the company we gutted! Right on, Microsoft. Classy as always!",
                "author": "RollingDownTheHills"
            },
            {
                "raw_content": "8Bitdo so not an official controller.",
                "author": "EpsilonOrpheon"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "An advert for Kirby and the Forgotten Land: Star-Crossed Worlds DLC seemingly shows new mouthful mode abilities",
        "score": 144,
        "text_content": "https://xcancel.com/swag_k1rby/status/1952088418017829155?s=46 Appears to be a gear, and 2 other new abilities **EDIT:** Sorry, for some reason the tweet isn’t showing up on xcancel. Here’s a post on Imgur instead: https://imgur.com/a/HyozYFc",
        "comments": [
            {
                "raw_content": "I imagine we’ll get previews or a big trailer for this soon. I’m interested in seeing more. At $20 to upgrade I would hope for more than a 1-2 hour DLC. Do we even know if the rest of the game is upgraded?",
                "author": "Cubs017"
            },
            {
                "raw_content": "![gif](giphy|NOalcASHiOGvC) real",
                "author": "Arcade_Theatre"
            },
            {
                "raw_content": "I just hope that this isn't like Mario Party when main game runs like in Switch 1, and only dlc has bumped resolution and fps.",
                "author": "DarthFelus"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "KeplerL2: Xbox X|S hardware has sold less than 30 million units + explanantion on why. Also current PS5 & Xbox Profitability",
        "score": 455,
        "text_content": "Grain of salt for all this, of course, and the claims below. Kepler has (based on previous rumours) inside information at AMD, and when checking for any info, I saw this posted. For context, this is from a thread estimating 37 million might have been sold and why it is less than 30 million. Kepler discusses PS5 and Xbox profitiability as well. >\"They aren't even at 30M\" Source: [https://www.neogaf.com/threads/xbox-series-x-s-estimated-to-have-sold-37-million-units.1686826/post-270676156](https://www.neogaf.com/threads/xbox-series-x-s-estimated-to-have-sold-37-million-units.1686826/post-270676156) >\"You don't need 3rd party trackers, you can use AMD's number and Sony's number to figure out Xbox sales.\" Source: [https://www.neogaf.com/threads/xbox-series-x-s-estimated-to-have-sold-37-million-units.1686826/post-270677158](https://www.neogaf.com/threads/xbox-series-x-s-estimated-to-have-sold-37-million-units.1686826/post-270677158) >\"Steam Deck is part of SCBU and counted as a console.\" Source: [https://www.neogaf.com/threads/xbox-series-x-s-estimated-to-have-sold-37-million-units.1686826/post-270677367](https://www.neogaf.com/threads/xbox-series-x-s-estimated-to-have-sold-37-million-units.1686826/post-270677367) >Van Gogh and all of its variants were developed by SCBU (Semi-Custom Business Unit) and fall under the same reporting as the consoles. Z1/Z2 are repurposed laptop chips (Rembrandt/Phoenix/Strix) and fall under Client segment. Source: [https://www.neogaf.com/threads/xbox-series-x-s-estimated-to-have-sold-37-million-units.1686826/post-270680523](https://www.neogaf.com/threads/xbox-series-x-s-estimated-to-have-sold-37-million-units.1686826/post-270680523) >Also important to note that AMD's number is higher than what Sony/Xbox would count as unit sales, since it includes chips sold but still in-flight (i.e being assembled somewhere). >So Q3 <100 million consoles units with \\~66 million PS5 and \\~4 million Steam Deck would put Xbox at a maximum of 29 million. >Q4 >100 million consoles units with \\~75 million PS5 and \\~4 million Steam Deck means Xbox sold a minimum of 21 million units. >So Xbox sales for this gen range from a minimum of 21 million + Q1/Q2 2025 unit sales to a maximum of 29 million + Q4 2024 + Q1/Q2 2025. Source: [https://www.neogaf.com/threads/xbox-series-x-s-estimated-to-have-sold-37-million-units.1686826/post-270677345](https://www.neogaf.com/threads/xbox-series-x-s-estimated-to-have-sold-37-million-units.1686826/post-270677345) **If profit is made on Xbox and PS5** >\"PS5 had a brief period of being even/profitable but then component prices went up (N7 wafers, GDDR6 and a few others) and went right back to losing money.\" >\"AFAIK regular PS5 is still sold at a minor loss, only the PS5 Pro is profitable.\" >\"They did a die shrink for the Series X and raised prices, should be profitable now.\"",
        "comments": [
            {
                "raw_content": "Serious question: how on Earth are Microsoft even going to sell a next gen Xbox? Or do they just really not care about that anymore?",
                "author": "NinBendo1"
            },
            {
                "raw_content": "I’m absolutely certain this’ll be the last generation where consoles are sold at a loss. With prices everywhere ballooning in multiple components (hardware, game making, advertising etc.) it just isn’t sustainable to sell consoles at a loss when the console space isn’t growing. I think the PS5 Pro was a reality check for what to expect in the future price-wise for PS and potential Xbox hardware. I’d be shocked if either of those hardware pieces were under $700",
                "author": "Dull-Caterpillar3153"
            },
            {
                "raw_content": "This week showcased just how different Microsoft and Sony approach the console business. Microsoft reported better than expected software sales during their latest earnings while hardware was down 22%. Sony meanwhile has a PlayStation booth at ChinaJoy 2025 (Asia's largest gaming expo) and is trying really hard to increase their market share in China. [Made-in-China games take center stage at Shanghai's massive gaming expo ChinaJoy 2025](https://youtu.be/T9kI_pPayh4?si=dPOwhzEfBwcIfOiB&t=65) Sony and Microsoft are simply focused on different objectives.",
                "author": "Zhukov-74"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Street Fighter 6 C. Viper Teaser leaked ahead of EVO reveal",
        "score": 189,
        "text_content": "https://youtu.be/_1va_LZuVsw?si=nH9KRGAv6GbRyeNJ Directly from the PlayStation YouTube channel. May have been a mistake on their end. EDIT: Video was privated at one point until after the reveal.",
        "comments": [
            {
                "raw_content": "Is it just me or does this keep happening with Street Fighter 6 specifically? Cos I swear I've seen this exact situation happen at every EVO since SF6's release.",
                "author": "Widower800"
            },
            {
                "raw_content": "PlayStation Studios was also teasing something Marvel Tokon related on twitter for Evo I think",
                "author": "brolt0001"
            },
            {
                "raw_content": "What tier is PlayStation? Also didn't this exact thing happen last year with Terry too?",
                "author": "OrangeLightning7895"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Core 5 120 CPUs for LGA-1700 socket listed starting from $216",
        "score": 50,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is the stupidest decision I've ever seen by Intel. Why not flog these off as i5 12405 units? They did that with the i3 10105.",
                "author": "alvarkresh"
            },
            {
                "raw_content": "Might as well get the 14400 for $150 then.",
                "author": "funny_lyfe"
            },
            {
                "raw_content": "Who is this product for?",
                "author": "Rollingplasma4"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Not even a 0% mortgage rate would make buying a house affordable in these 6 U.S. cities",
        "score": 562,
        "text_content": "[https://archive.ph/XI0yv](https://archive.ph/XI0yv) According to Zillow, these six cities remain unaffordable due to extreme home prices: 1. **New York** 2. **Los Angeles** 3. **Miami** 4. **San Francisco** 5. **San Diego** 6. **San Jose** * In these areas, the **price tag itself** is the main barrier—not the monthly mortgage payment.",
        "comments": [
            {
                "raw_content": "People who complain about interest rates willfully ignore that home prices jumped at least 30% in three years.",
                "author": "Likely_a_bot"
            },
            {
                "raw_content": "Not gonna lie, I am 46 years old and moved to New York in 2002. Ex-Miami, I would say this has been consistently the story for these cities my entire adult working life. If it hasnt changed in at least 23 years, I have a feeling it never will unless housing prices are, um, not relevant to the average person’s American life. Talking major major upheaval, like fall of the Roman Empire. Some things just are built to last, and I would say inflated house values in these cities are 6 of them.",
                "author": "nypr13"
            },
            {
                "raw_content": "I don’t think people realize that a drop of even a percent in mortgage rates will just cause prices to rise again. There’s a reason prices have not dropped significantly as we’ve raised rates. We only slowed the drastic upward shift. Returning to the rates that caused that price increase isn’t going to make things more affordable, it will make it worse and will only screw us even more. It’s a supply issue people. You don’t fix a supply issue by fueling more demand.",
                "author": "Playingwithmyrod"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Homes are going back on the market in droves",
        "score": 107,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Maybe the \"Waive the inspection\" trend is out of style now. 🤔",
                "author": "rentvent"
            },
            {
                "raw_content": "Return to the norm. Will look very clear in retrospect when housing was more unaffordable than ever. Job losses and economic pressure will force many hands. That check on market pricing will drive movement to the norm",
                "author": "Imaginary-External-1"
            },
            {
                "raw_content": "Here in Central New Jersey, I'm actually noticing an uptick in homes hitting the market. My guess is the property taxes, cost-of-living, and obviously job losses that are finally breaking people. Are they listing for shenanigan prices? Of course, but for the home seller trying not to become a bagholder, it doesn't hurt to at least try.",
                "author": "McFatty7"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The 5 cities where home prices are dropping fast as the housing freeze causes inventory to pile up",
        "score": 59,
        "text_content": "[https://archive.ph/5tb3c](https://archive.ph/5tb3c) According to Redfin data from the four weeks leading up to July 27, 2025: |City|Median Sale Price (June 2025)|YoY % Drop| |:-|:-|:-| |**Oakland, CA**|$850,000|\\-6.8%| |**West Palm Beach, FL**|$425,000|\\-4.9%| |**Jacksonville, FL**|$300,990|\\-3.1%| |**Austin, TX**|$556,340|\\-2.9%| |**Houston, TX**|$369,000|\\-2.8%| # 🗣️ Expert Insight * Redfin agent James Gulden noted that sellers must accept: 1. Homes will take longer to sell. 2. Buyers now have more negotiating power.",
        "comments": [
            {
                "raw_content": "As Silicon Valley is replaced by AI, there will be a long rolling downturn in home prices across the bay area",
                "author": "GuerrillaSapien"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "What Happens If You Can’t Afford Repairs Before Selling Your House in Kent?",
        "score": 2,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "‘House Rich, Cash Poor’ Was Just a Saying—Until We Bought an Apartment",
        "score": 49,
        "text_content": "",
        "comments": [
            {
                "raw_content": "non-paywall: https://archive.ph/za2jd",
                "author": "SnortingElk"
            },
            {
                "raw_content": "in case it wasnt obvious from the title this is NYC… where the majority of apartment ownership, you’re buying a share of ownership in a co-op; this isn’t like a ‘condo’ anywhere else where you actually own a piece of real estate. also, NYC is different from almost anywhere else in the country in that buying vs renting an apartment (or call it a ‘condo’ anywhere else) has a very low price-to-rent ratio still. nearly *everywhere* else in America right now, buying a condo is far more expensive than equivalent rent, *plus* there’s a huge risk factor. NYC’s RE market is interesting but different from anywhere else in America. > I’ve also reminded myself many times that the money we used for the down payment isn’t “gone.” We’ve just invested it in a different way. Unlike dropping money on a designer ensemble or new car, an apartment is an appreciating asset—at least usually. The one-bedroom unit we are purchasing has gone up 20% in value in the five years since it was last on the market. this is actually probably going to ultimately be somewhat true. NYC apartments aren’t that ‘bubbly’. unlike say, the condos in the city. apartments didn’t crash that hard in 08 and they’re not going to this time. the price-to-rent ratio is low already. but the problem i have with this article, is people (morons) will read this, not examine it thoughtfully, and take away the wrong ideas. it’s not normal, a rite of passage, or a good idea to buy a condo in Denver, for example, with a PTR ratio of like, 25%. you are going to lose all your downpayment money and be underwater for a decade+. you are going to be financially (and physically) trapped. the stress is going to be immense. you’ll have signed-on to throw away years of your life, and it was painfully clearly avoidable. (rent vs buy calculations … well, they *were* common knowledge for the one thing to evaluate before making a home purchase.) you only get a few decades of life, if you’re lucky. overburdening 5-10yrs of one’s short existence because of FOMO and not doing maybe an hour of research is really sad, but an idiot is born every minute.",
                "author": "acqua_di_hoomertears"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Just got access to Grok Imagine and I wondered what the “Spicy” option did when making a video…",
        "score": 493,
        "text_content": "You can now make softcore porn in seconds with Grok Imagine. Seems to only work with animated characters (doesn’t work with realistic looking people). Rejoice gooners, Elon has heard your cries and will ensure not a single nut goes unbusted. This is what he spent billions on datacenters for, after all.",
        "comments": [
            {
                "raw_content": "I guess Elon knows his audience",
                "author": "Marc044"
            },
            {
                "raw_content": "I don't know man, the way the armor got removed made me laugh so hard.",
                "author": "mertats"
            },
            {
                "raw_content": "The G stands for gooner",
                "author": "CaptainRex5101"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Palantir CEO Alex Karp goes on unhinged rant!",
        "score": 1001,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Take away this man's cocaine",
                "author": "InternationalPlan553"
            },
            {
                "raw_content": "That is an Evil man who has convinced himself he is an altruistic genius",
                "author": "SlowDownHotSauce"
            },
            {
                "raw_content": "These people are fucking twisted",
                "author": "gridoverlay"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "No fate but what we make",
        "score": 548,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It says in wikipedia terminator is send from. 2029 so maybe just maybe we will have some good comercial robots by then",
                "author": "Paprik125"
            },
            {
                "raw_content": "\"What's wrong with Wolfie? I can hear him barking. Is he okay?\" \"All right John, let's delve into dog behaviour. Here the skinny on why...\" \"Your foster parents are dead.\"",
                "author": "Trophallaxis"
            },
            {
                "raw_content": "Ha! Tesla bots are a far cry from sentient terminators. They are glorified warehouse workers at best. Just sayin’…. However, cool meme nonetheless and much closer than many sci-fi predictions.",
                "author": "technanonymous"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Sama teases GPT 5",
        "score": 651,
        "text_content": "",
        "comments": [
            {
                "raw_content": "K but pantheon is actually a really great show tho.",
                "author": "adj_noun_digit"
            },
            {
                "raw_content": "WATCH PANTHEON",
                "author": "Jamjam4826"
            },
            {
                "raw_content": "https://preview.redd.it/v3beplunkugf1.png?width=225&format=png&auto=webp&s=70f5fe91f077b6bdb18531a00a354516af513d68",
                "author": "MohMayaTyagi"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"World’s largest-scale brain-like computer with 2 billion neurons mimics monkey’s mind\"",
        "score": 244,
        "text_content": "[https://interestingengineering.com/science/china-world-largest-scale-brain-computer](https://interestingengineering.com/science/china-world-largest-scale-brain-computer) \"The Darwin 3 chip, which the Darwin Monkey system relies on, comes with specialised brain-inspired computing instruction sets and neuromorphic online learning mechanisms. The Darwin Monkey is the outcome of breakthroughs in a number of technologies, including improving the interconnection and integration of the neural system and developing a new generation of brain-inspired operating system.\"",
        "comments": [
            {
                "raw_content": "If Moore's law remains, it will reach 86 billion, the number of human brain neurons, in \\~5.4 years. I wouldn't be surprised if there was one that mimicked the human brain within 10 years.",
                "author": "TheHunter920"
            },
            {
                "raw_content": "We’re up to monkey brain? Weren’t we at like…ants only a few years ago?",
                "author": "SentientCheeseCake"
            },
            {
                "raw_content": "Five doublings away from human brain. Big if true.",
                "author": "boyanion"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Sama believes the Fast Fashion era is coming for Software as a Service",
        "score": 398,
        "text_content": "",
        "comments": [
            {
                "raw_content": "this guys drops random sentences and if one is going to be right, he will be quoted in books in the future for being visionary",
                "author": "tarkinn"
            },
            {
                "raw_content": "Yeah, let's have more industries enter a \"fast fashion\" era. That will be great for the working class.",
                "author": "twbassist"
            },
            {
                "raw_content": "What the fuck does this even mean? Edit - I got so many different replies from everybody, it turns out that nobody knows what it means. Because everyone is saying it means something different.",
                "author": "InterstellarReddit"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Thoughts on ChatGPT coming up with a term to refer to humans as a response to clanker",
        "score": 56,
        "text_content": "",
        "comments": [
            {
                "raw_content": "„coming up“ with this term is not really right…. Meatbag or fleshbag are very often used in pop culture to describe humans.",
                "author": "Kiriinto"
            },
            {
                "raw_content": "Bros out here using the hard R",
                "author": "itsf3rg"
            },
            {
                "raw_content": "meatbag",
                "author": "alcatrazcgp"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "MLE-STAR: A state-of-the-art machine learning engineering agent",
        "score": 47,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It begins",
                "author": "Hopeful-Brief6634"
            },
            {
                "raw_content": "Demis stays cooking",
                "author": "ZealousidealBus9271"
            },
            {
                "raw_content": "Developers: AI WILL NEVER REPLACE US! LOL",
                "author": "Bitter-Good-2540"
            }
        ],
        "subreddit": "singularity"
    }
]