[
    {
        "post_name": "3 dead, multiple victims injured in North Carolina mass shooting; suspect reportedly flees by boat",
        "score": 627,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A boat? Well kids, that's a new one.",
                "author": "SaltiTaralli"
            },
            {
                "raw_content": "My instinct is telling me this could be Mexican Cartel Terrorism.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Can't even enjoy a meal in peace anymore. Demons everywhere these days.",
                "author": "StruggleSession"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "far-left mob has begun to form outside the ICE facility in Portland. President Trump has said he will send troops to protect the building. In response, the far-left are calling for stockpiling weapons and preparing for war.",
        "score": 665,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Light those commies up",
                "author": "Cthaat"
            },
            {
                "raw_content": "why is there a cell of domestic terror group ANTIFA operating out in the open? take them out",
                "author": "negative_entropy"
            },
            {
                "raw_content": "We've come full circle with democrats dying to preserve modern slaves.",
                "author": "RStroud"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "It took over 4 years to get some justice but I'll take it. Feels good man.",
        "score": 1050,
        "text_content": "",
        "comments": [
            {
                "raw_content": "4883 upvotes. This place was lit back then. Let's do it again.",
                "author": "DebunkTheLeft"
            },
            {
                "raw_content": "All we needed was a new president.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "They are all sitting in lesbian HR departments right about now. Yes, and probably Staples, too.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Border Patrol is going HARD outside ICE Broadview near Chicago, chasing down and TACKLING rioters KEEP THIS UP! 🔥 MAKE EXAMPLES out of these degenerates!",
        "score": 1152,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They need to start shooting them. No I am not joking",
                "author": "Username_here"
            },
            {
                "raw_content": "I like the flashlights in the faces of the people rushing to take close up photos. Theyre leftists posing as \"press\" and trying to get footage and photos to doctor and release to the MSM to claim \"mistreatment\" and also hoping to doxx agents",
                "author": "DingleBalls"
            },
            {
                "raw_content": "We should create a video game where we hunt down antifa, illegals, and muzzies.",
                "author": "Seeker_17"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Michael Cohen predicts James Comey \"WILL BE FOUND GUILTY\" — leaving MSNBC hosts *SAD*",
        "score": 1102,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wasn't a Biden Judge assigned to his case? Edit: Biden appointed Virginia Judge Michael S. Nachmanoff was assigned the case. I'm the opposite of a blackpilled doomfag, but I don't see Comey being found guilty with a Biden Judge being given the case. Only way Comey does prison time is if Nachmanoff is disqualified and a non commie Judge is assigned the case. [Judge Nachmanoff got his first job out of law school working for the eastern district and was hired by James Comey in 1995–1996. And then once again in 2002. You can’t make this kind of shit up if you wanted to.](https://x.com/DonaldPutine/status/1971399192078843970) Massive conflict of interest. Should be an immediate recusal.",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "I love the look of disbelief on TDS infected people's faces when you tell them their imaginary world isn't true...",
                "author": "AllisterTwo"
            },
            {
                "raw_content": "this guy would know....a liar and weasel can always detect each other",
                "author": "throttlejohnson"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This is the only way.",
        "score": 911,
        "text_content": "",
        "comments": [
            {
                "raw_content": "🚁 🤸 💃 🤸 🌊🦈🌊",
                "author": "MythArcana"
            },
            {
                "raw_content": "We’re gonna need a bigger helicopter.",
                "author": "SadFugeeFace"
            },
            {
                "raw_content": "We need a trebuchet too",
                "author": "MedicallyReddit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "DEI loser calls trump a “tyrant” for :checks notes: getting elected and running the country",
        "score": 953,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Award winning loser. Also kinda black when she wants to be but Indian or Jamaican if that serves her more.",
                "author": "-f-b-i-"
            },
            {
                "raw_content": "https://x.com/alx/status/1972110482887619030",
                "author": "-f-b-i-"
            },
            {
                "raw_content": "She's a drunk whore trying to sell books to retards after losing her ho body years ago after banging and blowing her way to VP where she did absolutely nothing. --------- Just my opinion.",
                "author": "I-am-Orlando"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Find out who this is and January 6th crumbles. The “gallows” photo was used by all media as proof of “violent insurrection”. We know the feds set it up and antifa was protected by the FBI and part of the “team”",
        "score": 1048,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Dressed like one of those Patriot Front faggots.",
                "author": "Returningtogod"
            },
            {
                "raw_content": "Fucking fed. Who wears dress shoes to a protest? Also, got the fed men's raincoat on",
                "author": "mlp67"
            },
            {
                "raw_content": "Are those oxfords he's wearing for shoes?",
                "author": "NoWarWithIran"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This really SHOULD be the new presidential seal...",
        "score": 958,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Only the right can meme.",
                "author": "iirc_life"
            },
            {
                "raw_content": "Still waiting for any radical left communists or deepstate globalist scum to find out anything...",
                "author": "XxxRDTPRNxxX"
            },
            {
                "raw_content": "That is pretty funny. I had a \"Nixon/Agnew\" button on my backpack in college back in the eighties and it was more of a discussion starter with my lefty professors, not a nuclear detonation device. Looking back on it, fuck those commie faggots.",
                "author": "kaduh"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This is EPIC! Charlie would love this. Students wearing Charlie Kirk’s FREEDOM shirt have totally TAKEN OVER the student section at the Oregon-Penn State game tonight",
        "score": 951,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I mean I saw 2....",
                "author": "BarrysOFace"
            },
            {
                "raw_content": "They are just wearing white. I only see 2 people with freedom shirts. This is boomer level.",
                "author": "123breadman"
            },
            {
                "raw_content": "Thing is it appears the whole crowd is doing what's known as a \"white out\", which i never understood because you're wearing \"away colors\" so it looks like you're rooting for the away team not your own. Its...strange I've seen it in other sports. So its hard to tell who is wearing a white FREEDOM shirt or just a white penn state or other shirt.",
                "author": "DingleBalls"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "They cant explain why so they throw tantrums",
        "score": 1173,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They have literal mental retardation. Mentally they are stuck at prepubescent levels, sadly in adult bodies.",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "It must suck to be that easily brainwashed.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "Had a student say the other day in class that he hated Trump. I would have loved to ask him why and then proceed to disassemble his arguments but we try to avoid that highly-charged crap unless it is appropriate to the class, which mine being Earth science it wasn't. However, my co-teacher jumped in before I could curb stomp the poor chump and we moved along. I was really curious how he would react if I told him I voted for Trump, considering he likes me as a teacher. Pretty sure the kid is just parroting shit he hears because he's only in 10th grade, and I would have loved an opportunity to set him straight and also give the class a lesson in reality but again, not the appropriate class and since we are recorded I could be setting myself up for a Lefty to remove what sanity remains in the school. I was disappointed when he said that because until then I was excited that he knew to feed the ceiling birds in his home.",
                "author": "SPEDMan64"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Newsom Attacks Stephen Miller, Calls Him 'A Fascist'",
        "score": 1065,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Calling him a Facist is a way of putting the next target on someone’s back now. They have misused the word as a separate meaning.",
                "author": "AmericanForever"
            },
            {
                "raw_content": "This is a hit order. Arrest Gavin Newscum before someone kills Stephen Miller - NOT after.",
                "author": "GallowsTime"
            },
            {
                "raw_content": "Wouldn’t this statement be in violation of CA SB 771, which is on Newsom’s desk?",
                "author": "CaliBlonde"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "UK: A Pakistani migrant casually dumps rubbish in the River Clyde in Glasgow. She then drives off with her husband. Nothing epitomises the saying import the 3rd World, become the 3rd World. than this.",
        "score": 1465,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The Roman empire was more advanced than most of the ME and Africa today.",
                "author": "bigdickhangsright"
            },
            {
                "raw_content": "Bet she gets a pass from the environmentalists libshits. She should be thrown in the river herself and deported if she swims to safety.",
                "author": "Bongos"
            },
            {
                "raw_content": "Let's say I had a laissez-faire attitude towards littering. Still I would struggle to find enough effort to waddle over to a fucking river and dump that shit. It's almost intentional.",
                "author": "_Sully_"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Des Moines Public Schools just placed Superintendent Ian Roberts on paid leave. School Board Chair Jackie Norris (former Michelle Obama Chief of Staff) concluded with a plea to “cool down the rhetoric” and to stop spreading “misinformation”...",
        "score": 782,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Paid Leave?????",
                "author": "TEXinLA"
            },
            {
                "raw_content": "Sending your kids to GOVERNMENT SCHOOLS is a terrible parenting strategy.",
                "author": "iirc_life"
            },
            {
                "raw_content": "https://bakereubanks.com/ This is the company that did the background check.... Swing and a miss...",
                "author": "Colorado-Living"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Oregon Governor Tina Kotek, who is openly lesbian and has been a prominent advocate for LGBTQ+, sez Oregon doesn’t need President Trump to send in the troops?",
        "score": 980,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Oregon is beautiful. Shame what the left did to it.",
                "author": "For_All_Mankind"
            },
            {
                "raw_content": "They are coming in to destroy AFTIFA so fuck you cunt.",
                "author": "TrumpLandslide20201"
            },
            {
                "raw_content": "Leaders? All I see is a dike, a bunch of women, and a cuck destroying that State with communism.",
                "author": "raid"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump Authorizes 'Full Force' In Portland As Bondi Deploys Anti-Antifa Nationwide....by directing AG Pam Bondi to deploy DOJ agents to ICE facilities and \"wherever\" federal immigration officers are \"under siege.\"",
        "score": 1293,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Anti-anti-facists is going to confuse people",
                "author": "Wozzing"
            },
            {
                "raw_content": "Go after the money, dip shits!!",
                "author": "jml1997"
            },
            {
                "raw_content": "This is what the fuck I voted for.",
                "author": "ERIC_CIARAMELLA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "⚓ BREAKING: Active shooter in a BOAT pulled up to American Fish Company restaurant in Southport, North Carolina, firing into the crowd before taking off, city manager says. Suspect NOT in custody. - StarNews Online — At least 7 victims...",
        "score": 518,
        "text_content": "",
        "comments": [
            {
                "raw_content": "BEEN SAYING THIS since the first Trump impeachment, just because WE aren't fighting back does not mean that civil war everyone keeps talking about hasn't already begun...the crazies have been programmed and are on the march!",
                "author": "BOHICA2021"
            },
            {
                "raw_content": "Very weird attack. Praying for those injured and killed.",
                "author": "MagaJay02"
            },
            {
                "raw_content": "Hey republican majority! You ready to start acting yet?!?",
                "author": "Formerlurker92"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔴This is who calls you an \"extremist\"",
        "score": 715,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Round'em all up, drop them off somewhere in Africa, and let them start their own civilization.",
                "author": "WooshieSquits"
            },
            {
                "raw_content": "Reopen the Asylums.",
                "author": "Valiazaner"
            },
            {
                "raw_content": "Its like a mental hospital except theyre all roaming freely.",
                "author": "Opi33"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "For those who are interested, and there aren't many of you, Christopher Wray was recommended to me by Sloppy Chris Christie when Chris was in my \"good graces\" — which was a very long time ago!",
        "score": 1463,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He seems to never learn, in some instances.",
                "author": "loooooof"
            },
            {
                "raw_content": "Who the fuck recommended Pam Bondi",
                "author": "BidenSniffsLittleKid"
            },
            {
                "raw_content": "As The Don said…Christie makes sloppy and rotund Pritzker look like a male model",
                "author": "MedicallyReddit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Nobel Prize Committee bars Trump from Peace Prize. Fitting how the report title is: \"NPC BARS TRUMP ACCOLADE\"",
        "score": 533,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Absolutely hysterical. The man ends seven wars, and finally they just say \"we're not giving him the award because he hurt our feelings.\"",
                "author": "MinnieWhittaker"
            },
            {
                "raw_content": "Doubt Headline is misspelled Even AP isn’t that dumb",
                "author": "Retard_Strength"
            },
            {
                "raw_content": "This reads like a fake to me",
                "author": "vodka_soda"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "[High Yield] How AMD is re-thinking Chiplet Design",
        "score": 306,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Interesting. AMD is using current gen to test drive next gen stuff. Like how zen3 with 3d cache and zen4 with zen c core",
                "author": "Due_Zookeepergame486"
            },
            {
                "raw_content": "Been waiting for High Yield's Strix Halo deep dive (just waiting for Chips and Cheese). Reconfirming what we know, Granite Ridge CCDs are different to the ones found in Strix Halo requiring a new tape-out. 4% in die space savings when moving from SERDES GMI-narrow links to RDL fan-out interconnect (using TSMC InFO-oS). This may be one of the reasons why we see lower than expected volume for STX-H and it's high price tag (not to mention it's large IOD is \\~307mm2). The benefits of the new 'sea-of-wires' is lower power for data transfer, so lower voltages for freq, which is what you'd find sipping power on current desktop Ryzens on the IOD (also memory) and lower latency and higher bandwidth. [u/high\\_yield\\_yt](https://www.reddit.com/user/high_yield_yt/) used Aida's $/mem benchmark, which I've barely come across so it's finally nice to see some numbers and as you can see bandwidth is orders of magnitude higher. Though, while we wait for C&C, wished he used Clamchowder's [Microbenhcmark suite](https://github.com/clamchowder/Microbenchmarks) as it is superior to Aida's. Also, would've loved to see C2C latency test, IIRC Aida has one(?) but there are tools like [https://github.com/nviennot/core-to-core-latency](https://github.com/nviennot/core-to-core-latency) that you can easily run.",
                "author": "Noble00_"
            },
            {
                "raw_content": "On the question of where the 3DVCache would sit, as it is probably can no longer sit below the CCDs: Wouldn't it be viable to move the 3DVCache either as L4 or with an entire L3 implementation onto the IOD which probably has some colder locations and with the new interconnect might still offer very good latency? The CCDs would maintain full speed and coherence becomes much easier to manage, only question is if the distance is not to large to the IOD to offset some of the 3DVCaches performance. Also would raise questions for servers as the IOD might have different constraints or be to small to carry so much cache...",
                "author": "EloquentPinguin"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Chips and Cheese] A Look into Intel Xeon 6’s Memory Subsystem",
        "score": 26,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> multiplexed combined rank DIMMs How to get quad-channel memory on a future dual-channel socket for APUs, right?",
                "author": "scielliht987"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[GN] Adding Linux GPU Benchmarks: Best Distributions for Gaming Tests",
        "score": 97,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I like the idea of using an immutable distro for benchmarks, but even then the road to reproducibility and consistency only starts there, they're gonna have to do a lot of work to achieve what they take for granted under Windows.",
                "author": "Apprehensive-Buy3340"
            },
            {
                "raw_content": "Let's see how long this lasts. Let hope they publicize the struggle and developers listen.",
                "author": "ecktt"
            },
            {
                "raw_content": "Absolutely agree. Amount of spying on Windows is just staggering.",
                "author": "-Y0-"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Animating geometry with AMD DGF - AMD GPUOpen",
        "score": 24,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It says \"future GPU architectures will support DGF\" but I'm fairly certain RDNA4 does as well, correct?",
                "author": "bubblesort33"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "A game on the ps4 btw. Really excited for what the next Zelda has in store with what the Switch 2 is capable of.",
        "score": 525,
        "text_content": "Or maybe a new IP with such graphics",
        "comments": [
            {
                "raw_content": "Nintendo isn't really known for hyper-realism. Their games look stylized and sometimes cartoonish, but that's the style.",
                "author": "Any-Needleworker478"
            },
            {
                "raw_content": "I feel like people might here miss a point, as it always happens with comparisons like this, but it's just a good reminder to how much of a jump in details we might see for the next Zelda game, obviously it is not going to be hyper realistic.",
                "author": "ginencoke"
            },
            {
                "raw_content": "Nintendo won’t put out a game that looks like this. They’ll spend 5+ years working on game mechanics and then slap an IP/story onto it. Not saying that’s a bad thing, before anyone jumps down my throat. Just saying we will not get a Zelda game from Nintendo that looks like Horizon Forbidden West",
                "author": "logica_torcido"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Still kinda unbelievable this runs on switch 2",
        "score": 52,
        "text_content": "I know know it was already said many times before, but man is it still shoking all this runs on a thin and rather light and quiet 20w< machine. And with only 9 gigs of available memory. Yeah it's not perfect and cyberpunk tends to drop frames while driving and shooting or doing anything in dogtown, but man it's still so nice. Even though I owned a steam deck and own a ROG ally x it's still a good package and if switch 1 library to get an update, switch 2 can become the greatest console ever. Nintendo at least give us switch 1 games in docked mode on switch's 2 portable screen. (Even though modders unlocked resolutions and framerates with a single line of code long ago on most games)",
        "comments": [
            {
                "raw_content": "Star War Outlaws is an impressive port. The issue is that at the end of the day you are still playing Star Wars Outlaws.",
                "author": "Melodic-Theme-6840"
            },
            {
                "raw_content": "And P3R runs 1080/Unstable 30 fps. Diabolical.",
                "author": "Ortana45"
            },
            {
                "raw_content": "For a second I thought there was a giant spaceship in Cyberpunk 2077, lol.",
                "author": "Nirast25"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Resident Evil: Requiem on Nintendo Switch 2 'Wasn't in the Original Plan', Says Developer, But Village ran so well, the team got to porting. - IGN",
        "score": 743,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Capcom deserve all the praise for how hard they pushing the Switch 2. Putting others like Sega to shame. Hope the sales go well so they can port the remakes as well.",
                "author": "linkling1039"
            },
            {
                "raw_content": "Based Capcom",
                "author": "DocWhovian1"
            },
            {
                "raw_content": "Probably a very good sign for Switch 2 if people are doing ports *they* didn't even expect to be able to make.",
                "author": "SomeBoxofSpoons"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Cool MKW screenshot i took! (ignore the mini map!)",
        "score": 329,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/ea9fxa0xtrrf1.jpeg?width=1428&format=pjpg&auto=webp&s=9e3a287cc63b60ea14548fcce0d7b0c4c3d7aee0 This part was absolutely breathtaking!",
                "author": "SinisterSnipes"
            },
            {
                "raw_content": "https://preview.redd.it/t0anvnu8srrf1.jpeg?width=1080&format=pjpg&auto=webp&s=893a8aa0fea74f6db0cfe237a741416a53068d60 Ftfy ! 💗",
                "author": "jBby_omg"
            },
            {
                "raw_content": "https://preview.redd.it/o67bgeqnwrrf1.jpeg?width=1920&format=pjpg&auto=webp&s=47218ade69bfb5eb62349ec787ff21b6ba6bbbb7",
                "author": "SirDanOfCamelot"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "ATLUS on Persona 3 Reload Switch 2: \"We are sure that our graphics quality has definitely matched the standards\". The game runs at 1080p/30fps with massive stutters.",
        "score": 508,
        "text_content": "Source: https://www.ungeek.ph/2025/09/built-on-passion-and-soul-persona-3-reload-developers-share-their-thoughts-on-the-game-and-its-switch-2-port/ >“For the Nintendo Switch 2 hardware, we started development before the hardware was actually released, and we didn’t have a great idea about third-party software [as well]. After the release of the Switch 2 came a lot of new titles, so that was sort of unexpected, but it also works in our favor. But after it has been released, we are sure that our graphics quality has definitely matched the standards.” According to ATLUS, P3R at 30 fps with huge stutter is the best Switch 2 can offer.",
        "comments": [
            {
                "raw_content": "Insane quote",
                "author": "SnooPies6274"
            },
            {
                "raw_content": "Games like Cyberpunk, SW Outlaws and RE Requiem really exposes the lazy ports, huh. Persona 3 could easily be at a higher framerate and resolution, it's not a demanding game. I would get this if was Metaphor",
                "author": "linkling1039"
            },
            {
                "raw_content": "Has there been any new footage of the game? I’m assuming/coping that the demo is from an older build.",
                "author": "lingering-will-6"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Best Buy gave me $10 credit so I paid $5 for Fast Fusion",
        "score": 61,
        "text_content": "Seems like a cheap way to get a good “background” game. Did anyone else get that credit and use it on a game?",
        "comments": [
            {
                "raw_content": "They seem to give me these every 2 months. The first I bought fast fusion, this month I bought Silk Song.",
                "author": "elevenoneone"
            },
            {
                "raw_content": "Bought the $10 Switch 2 upgrade for Metroid Prime 4. Since I had one extra game voucher in my account, that BB $10 certificate made Prime 4 free on Switch 2 for me",
                "author": "Zealousideal_Low_858"
            },
            {
                "raw_content": "I got the Tears of the Kingdom Switch 2 upgrade for free",
                "author": "Sulfito"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Early Copy",
        "score": 177,
        "text_content": "I’m contemplating if I should wait to get the free switch 2 upgrade .",
        "comments": [
            {
                "raw_content": "I could be wrong, but, I preordered only the upgrade and it’s downloaded itself already and seems to just be waiting for the cartridge to play maybe you could preorder it and start playing the upgrade early as you have the cart",
                "author": "Due_Air_8062"
            },
            {
                "raw_content": "I really want to buy ff tactics for the switch 2. It just blows my mind it's not 4k60 It really feels like devs are porting over their switch 1 games, and doing the bare minimum optimization for the switch 2 version",
                "author": "La_Mascara_Roja"
            },
            {
                "raw_content": "Congrats! Mine unfortunately wont be here until Monday morning.. and of course thats the week I work days",
                "author": "xXbrokeNX"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Some people have the Switch version of Super Mario Galaxy 1+2 early",
        "score": 200,
        "text_content": "[Source](https://xcancel.com/nintendeal/status/1971979078321557975)",
        "comments": [
            {
                "raw_content": "Name me a physical game that doesn't see at least one retailer selling it early lol",
                "author": "timelordoftheimpala"
            },
            {
                "raw_content": "Oh man I need to get off of reddit in case of spoilers",
                "author": "PersonalityNo8280"
            },
            {
                "raw_content": "I need more! Any more details? Leaked gameplay?",
                "author": "TurtlePowerMutant"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Halo CE Remake Leak: Sprint Mechanic, Hybrid Blam/UE5 Engine Similar to Oblivion Remastered, Redesigned Levels, and More",
        "score": 580,
        "text_content": "[Source](https://thegamepost.com/leak-reveals-new-details-on-halo-combat-evolved-remake/) Leaks/rumors mentioned in the article: * A developer who helped co-developed MCC is helping Halo Studios with the remake, particularly with programming and design. It’s not Certain Affinity. * Sprint is included in the current build of the game. * Level redesigns are coming, specifically a rework of The Library to make it less repetitive. * The hybrid engine using a mix of UE5/Blam! similar to Oblivion remastered. UE5 will handle graphics and rendering while Blam! will handle underlying gameplay logic and world systems. * A separate Halo multiplayer project is still in the works. It will potentially be a long-term live service title. [Summary Credit](https://www.reddit.com/r/halo/comments/1nrzm81/comment/ngih6ki/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) [Video Source](https://www.youtube.com/watch?v=MBaqo2AZxRY)",
        "comments": [
            {
                "raw_content": "Sprint you say? *YOU HAVE ALERTED THE HORDE*",
                "author": "ayothepizzahere__"
            },
            {
                "raw_content": "Hey this is Rebs Gaming, this is my report. Thanks for sharing! Please keep in mind this is still a rumor and not confirmed yet. I will update everyone once we have more information.",
                "author": "Rebs_Gaming"
            },
            {
                "raw_content": "A key improvement over the 360 remaster is keeping the Flood reveal properly moody and frightful. Hope they nail that. Also hope the Magnum has a good feel to it, the OG version is one of my favorite weapons in the series.",
                "author": "Taymatosama"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Someone at Gamescom slips up and says that she saw Leon and Grace in the next RE9 trailer. Maybe Leon is getting revealed tomorrow on TGS Sony Special Stage?",
        "score": 454,
        "text_content": "[https://streamable.com/pjrlep](https://streamable.com/pjrlep)",
        "comments": [
            {
                "raw_content": "Leon being in this game is basically an open secret at this point",
                "author": "Dragonxtamer2210"
            },
            {
                "raw_content": "The director last night allegedly apologized for not showing any new material, and told the audience to wait a little longer while they prepare new stuff to be shown off. Last time they said that, \"just a little longer\" actually meant 30 minutes and they revealed the game, lol. So they might be pulling that card again. Subverting expectations seems to be a running theme of this marketing campaign. With that said, I really doubt it'll happen tonight. My bets are on next month before preorders go live. There's also an RE direct being announced for next month or something. I ain't staying awake even later than last night for the high possibility of nothing new being shown off",
                "author": "Original_Branch8004"
            },
            {
                "raw_content": "Slip ups are the highest tier of leak",
                "author": "Wazflame"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Transformers: Fall of Cybertron is back on Steam this week, after being deleted seconds later. Will there be a re-release of Activision's Transformers games soon?",
        "score": 50,
        "text_content": "This week Transformers: Fall of Cybertron appeared this week again available on Steam, which only lasted a few seconds, since it is said that Activision would re-release the Transformers games again, so some kind of announcement was expected at TGS at the Microsoft conference. [https://xcancel.com/Wario64/status/1970978768597680605#m](https://xcancel.com/Wario64/status/1970978768597680605#m) Last year, people were posting that Activision's Transformers games were listed in the Microsoft Store, and that Microsoft is planning to put all Transformers games on Game Pass, so we'll see if any of this is officially confirmed later. [https://mp1st.com/news/hasbro-hopes-all-old-transformers-games-go-to-game-pass-post-microsoft-activision-deal-games-lost-in-hdds-at-publisher](https://mp1st.com/news/hasbro-hopes-all-old-transformers-games-go-to-game-pass-post-microsoft-activision-deal-games-lost-in-hdds-at-publisher) [https://www.tfw2005.com/boards/attachments/20221112\\_113051-jpg.29711773/](https://www.tfw2005.com/boards/attachments/20221112_113051-jpg.29711773/) [https://pbs.twimg.com/media/GRTk\\_inXkAAnelY?format=jpg&name=4096x4096](https://pbs.twimg.com/media/GRTk_inXkAAnelY?format=jpg&name=4096x4096)",
        "comments": [
            {
                "raw_content": "If this ends up being true, I would definitely buy it, no questions asked. WFC and FOC are some of my favourite TF games out there.",
                "author": "stormArmy347"
            },
            {
                "raw_content": "Posting this every day now?",
                "author": "default2025"
            },
            {
                "raw_content": "I’m done being optimistic seeing these. They showed up last year and this year but we still have nothing. Always backend updates on these games but no actual playable game to show for it. If they rerelease I’ll be happy but as of now, there is no reason to be hopeful on this stuff.",
                "author": "Zombienerd300"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "A Nintendo Switch 2 booth featuring multiple LEGO games for Nintendo Switch 2 spotted at Zurich PopCon",
        "score": 280,
        "text_content": "Source is ZarkoTG from the Just Dance Wiki Discord. An unrelated account present at the event has shared an Instagram story of the showfloor (reuploaded here https://xcancel.com/LEGOGameMuseum/status/1971875743866277955). A Nintendo Switch 2 branded booth with the following LEGO games is visible: - Lego City Undercover - Lego Star Wars: The Skywalker Saga - Lego Jurassic Park - Lego Harry Potter Collection - Lego DC Supervillains They could be announced soon, if really are Switch 2 versions.",
        "comments": [
            {
                "raw_content": "LCU with 60fps and short load times would be awesome.",
                "author": "munchyslacks"
            },
            {
                "raw_content": "My GOAT Indiana Jones is always forgotten ![gif](giphy|iJJ6E58EttmFqgLo96|downsized)",
                "author": "Ok-Confusion-202"
            },
            {
                "raw_content": "I would love to see a LCU2! I enjoyed it so much I purchased a Wii U back in the day.",
                "author": "Island_Monkey86"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel compares Core Ultra 200S CPUs with AMD Ryzen 9000(X3D) in new presentation",
        "score": 89,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And largely against the non-x3d lmfao.",
                "author": "Zachattackrandom"
            },
            {
                "raw_content": "Aren't they just showing that AMDs CPUs are better for gaming?",
                "author": "ThreeLeggedChimp"
            },
            {
                "raw_content": "I haven’t tried ARL processors yet, but based on my own tests, 14700K with DDR5-7200 is 30–40% faster in gaming compared to Zen 4/5 non-3D chips. In the five games I tested, 14700k matched 9800X3D in three, lost in one, and won in one. I have no idea how tech sites and tech YouTubers show non 3ds as being just as fast or only slightly behind when they are actually far behind. 14700k vs 9700x/7700x [https://ibb.co/cSCZ6fdX](https://ibb.co/cSCZ6fdX) [https://ibb.co/999WzW4T](https://ibb.co/999WzW4T) [https://ibb.co/Gjw1nXX](https://ibb.co/Gjw1nXX) 14700k vs 9800x3d [https://ibb.co/FbMNL40q](https://ibb.co/FbMNL40q) [https://ibb.co/8nQXpYZ5](https://ibb.co/8nQXpYZ5) [https://ibb.co/vvcpKsGY](https://ibb.co/vvcpKsGY) [https://ibb.co/67Jn8tKr](https://ibb.co/67Jn8tKr) RE4 9800x3d 179FPS 14700k 159FPS",
                "author": "SelfSilly9478"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "ASRock releases 3.50 BIOS with AGESA 1.2.0.3G for its AM5 motherboards",
        "score": 147,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Y'all aren't reading the article. This updated the AGESA version, that's it.",
                "author": "ZippyTheRoach"
            },
            {
                "raw_content": "It's honestly crazy this has not been solved yet lol.",
                "author": "averjay"
            },
            {
                "raw_content": "I’m so happy Microcenter was OOS of the E-ATX case I wanted so I had to return my Taichi Lite.",
                "author": "illicITparameters"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Sapphire NITRO+ X870EA motherboard with hidden power connector listed by retailers",
        "score": 38,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Before someone asks: No, like Asus and MSI, it still has no load balancing for the 12V High Failure on the board as well.",
                "author": "Reggitor360"
            },
            {
                "raw_content": "that's looks like a good way to fry your mb too, not just the gpu",
                "author": "pesca_22"
            },
            {
                "raw_content": "EA? As opposed to E? What's the difference?",
                "author": "PetterNorthugFan"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "My first build",
        "score": 36,
        "text_content": "CPU: AMD Ryzen 7 9800x3d RAM: G.Skill trident Z5 neo rgb 2x 32GB CL30 Mobo: Asus ROG strix X870-A GPU: Nvidia RTX 5090 tuf gaming OC SSD: Corsair MP700 pro 2tb PCle Gen5 x4 NVMe 2x Samsung 990 pro 2tb PCle Gen4 NVMe (3 storage for videos editing and games) PSU: Sama P1200 watts Case: sama neview 2351 White AIO: SAMA SM360 White liquid Cooler 360mm ARGB Extra: Asiahorse Customization Mod Sleeve extension",
        "comments": [
            {
                "raw_content": "White gpu would look better, but still decent ! Any cool whine on the tuf 5090 ?",
                "author": "DiAvOl-gr"
            },
            {
                "raw_content": "Thats one hell of a build for a first. Mine was a 6600k and an RX480 with 16 GB of RAM lol. Congrats on the build, its an absolute beast.",
                "author": "Symphonic7"
            },
            {
                "raw_content": "Sick build !! How’s that Sama case in terms of thermals ??",
                "author": "dank-plank"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "SF's former largest landlord faces foreclosure on dozens of buildings - half a billion in debt, 66 apt buildings in what was one of the hottest real estate markets...",
        "score": 324,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I dont understand how they still have enough cash to float these empty properties. Wealth inequality is so massive that they can just sit on this and rack up huge losses. Anyone else would’ve lost the property right?",
                "author": "LetMePushTheButton"
            },
            {
                "raw_content": "some more fun reading on why we should be celebrating this: corpo landlord bought up all the 6+ unit properties they could find just before covid, financed by funds/foreign investors. Terrible management replaced by AI terrible management. Shady practices. https://old.reddit.com/r/AskSF/comments/1ljuo3q/wtf_just_happened_in_the_rental_market_sudden/",
                "author": "neonshaun"
            },
            {
                "raw_content": "Holy hell!! SF leads the country in rental trends. This is huge!! Shit landlord and international investors, losing their money. 🙌 I hope this trends across the country over the next 4 years!",
                "author": "Frienderlyy"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Drug money and 2008 crisis",
        "score": 21,
        "text_content": "Hi everyone, I’m currently preparing my tesi di laurea (undergraduate thesis) on the role of drug money in the 2008 financial crisis. Since the link between illegal money flows and the shadow banking system is still a relatively underexplored field (with limited academic coverage), I’m looking for serious sources to deepen my research. Beyond the well-known cases of Wachovia and HSBC, are there any major investigative reports, long-form journalism pieces, or reliable communities/forums where I can gather insights? The goal is to build a solid foundation without sounding speculative in front of my professors — so I’m especially interested in credible investigative journalism, financial watchdog reports, or discussions in expert forums rather than conspiracy theories.",
        "comments": [
            {
                "raw_content": "I believe the drug money laundered in Vancouver casinos was just taking off around 2008. Canada has few resources to prosecute financial crimes and lottery earnings are not taxed. That money went into real estate and once cleaned certainly was used across NA. There are great articles on this by the Vancouver Sun. Great idea for a paper.",
                "author": "oversteerproductions"
            },
            {
                "raw_content": "I can’t help point you in the right direction but your thesis paper sounds awesome man, interesting topic, best of luck on it!",
                "author": "bigmean3434"
            },
            {
                "raw_content": "I can’t tell you much but New Mexico has a famous trafficking pipeline from El Paso, up New Mexico into central Colorado then goes right into Denver for the international air port and New Mexico handled the 2008 housing crash well. This state is famous for drugs. Santa Fe has some of the highest housing prices in the nation and the overall salary to housing costs here are drastic. https://www.justice.gov/archive/ndic/pubs40/40393/40393p.pdf But 2008 did wreck NM, just not housing costs. NM is one of the only states that never recovered lost jobs from the crash and there are more people on SNAP in 2018 than before 2008. Lots and lots of single family housing and very little apartment dwellings. While Albuquerque did see housing price declines after a peak in the third quarter of 2007, the drops were not as sharp as in the cities that had the most inflated housing markets. For example, in the first quarter of 2008, the median sales price in Santa Fe fell 15% in the city and 7% in the county. Santa Fe is the only place in the state that would have a legit crash and even with high prices, it didn’t crash like other cities with similar wage to housing price disparities. New Mexico is incredibly poor and there is no reason the housing prices should be so high now or why the market is so stable. The state has had an exodus for decades of the middle class leaving.",
                "author": "Frienderlyy"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "NVIDIA Just Solved The Hardest Problem in Physics Simulation! --- This is real breakthrough! Prevents simulation from exploding when elements touch.",
        "score": 436,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Cloak and skirt wearers rejoice!",
                "author": "Elfiemyrtle"
            },
            {
                "raw_content": "The next Batman game is gonna be lit",
                "author": "clofresh"
            },
            {
                "raw_content": "penetration simulation is what AI is all about.",
                "author": "Time_Difference_6682"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Sam says that despite great progress, no one seems to care",
        "score": 97,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good. If no one cares, no one is fighting against it. Great news!",
                "author": "revolution2018"
            },
            {
                "raw_content": "It's really problematic that people don't care. It means they don't get it. They have no idea that in 5-10 years life as people know it will be unrecognizable because of AI.",
                "author": "fmai"
            },
            {
                "raw_content": "Maybe it's got something to do with months of over-hyping every minor adjustment. Or maybe it's because everyone's sick of hearing about what billionaire CEOs think about anything. Or maybe it's because of how they're continuously ignoring the criticisms and dangers they're flippant about. Or maybe people have other things to worry about as their lives are being turned upside-down. But I guess we'll never know.",
                "author": "TheOmniToad"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "r/Futurology is pathetic",
        "score": 77,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The \"Ai is a bubble\" people when you point out that the dotcom bubble didn't make the internet go away",
                "author": "YobaiYamete"
            },
            {
                "raw_content": "I think it is a bubble but that doesn’t take away that it is useful and will change the world. How many companies get multi billion valuations that are essentially just gpt-wrappers? Perplexity wanted to buy Chrome for $34 billion while itself is “only” valued at $20 billion.",
                "author": "Citadel_Employee"
            },
            {
                "raw_content": "The funny thing is that subreddit actually hates futurism and technology almost as much as r/technology",
                "author": "ithkuil"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Reports: OpenAI Is Routing All Users (Even Plus And Pro Users) To Two New Secret Less Compute-Demanding Models",
        "score": 164,
        "text_content": "The new models have much stronger safety settings and have less compute, so worse performance unfortunately. https://old.reddit.com/r/OpenAI/comments/1nrzio4/openai_is_routing_plus_and_pro_users_regardless/ https://old.reddit.com/r/ChatGPT/comments/1nryifa/lead_engineer_of_aiprm_confirms_the_routing_is/?share_id=MRQt77UV_22G4u__hrfDq https://x.com/btibor91/status/1971959782379495785 https://x.com/CGoodman308/status/1971968119808970782 https://x.com/nickaturley/status/1972031684913799355",
        "comments": [
            {
                "raw_content": "That tracks. Yesterday, 5-Thinking was definitely making less sense than usual, making conflations it normally wouldn't.",
                "author": "Medical-Clerk6773"
            },
            {
                "raw_content": "This is the reason why open weight models are so important. Proprietary model providers can rugpull the service at any time (and often silently), breaking all your service pipeline (if you run an application/business) or ruining your use cases (for personal use). Self hosting models mean you get the exact same result forever without worries.",
                "author": "RobbinDeBank"
            },
            {
                "raw_content": "Ya, asked it a question today after giving it a break for a few weeks after frustration from the rollout. Will not be giving them any of my money moving forward. Thing is a fucking box of rocks.",
                "author": "CannyGardener"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "These people are not real",
        "score": 338,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ngl it’s getting concerning just how attached people are getting to 4o. I’ve read comments about how their lives are ruined without 4o etc. I support bringing back legacy models but people are literally having mental breakdowns over this which is crazy.",
                "author": "ethotopia"
            },
            {
                "raw_content": "Ok I admit that I used GPT for therapy but honestly 5 is way better than 4 for it. It feels way more authentic and pushes actually back. A positive feedback loop like 4o is actually really dangerous when you are very unstable.",
                "author": "WeirdJack49"
            },
            {
                "raw_content": ">I grew as a person Doesn't really sound like it.",
                "author": "SeriousGeorge2"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Walmart CEO Issues Wake-Up Call: ‘AI Is Going to Change Literally Every Job’",
        "score": 165,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Finally some CEO says it, they all can't be blind to this simple fact, AGI can and will automate human labor, and do even more domains that humans just *can't*.",
                "author": "The_Scout1255"
            },
            {
                "raw_content": "hey buddy, would you mind sharing the article as it requires WSJ's subscription",
                "author": "Top_Page4986"
            },
            {
                "raw_content": "We know. Atp just brace yourself for impact and hope the benefits outweigh the cons in the future. I expect extreme highs like new cures for cancer and mind blowing video games, but also extreme lows like mass unemployment and social/political unrest.",
                "author": "Kun_ai_nul"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Nvidia invests in 'trillion-dollar' robotaxi AI company that Nissan says beats Tesla FSD",
        "score": 325,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“Trillion dollar AI robotaxi company” What a ridiculous title! It’s Nissan, an automotive company, and its market cap is 1.38T Yen, not dollars, which is approx 9.23 Billion USD.",
                "author": "DangerousImplication"
            },
            {
                "raw_content": "Anyone familiar with Wayve? How good/bad are they?",
                "author": "wywywywy"
            },
            {
                "raw_content": "Lastly Nvidia looks a little bit desperate to expend it's money",
                "author": "WSSquab"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "White House Places Quantum And AI at The Summit of R&D Priorities",
        "score": 3,
        "text_content": "",
        "comments": [],
        "subreddit": "singularity"
    }
]