[
    {
        "post_name": "BREAKING: President Trump is preparing to deploy over 1,000 members of the National Guard to take back the streets of Washington, DC. DO IT, PRESIDENT TRUMP! LAW AND ORDER must be restored to our nation’s capital!",
        "score": 913,
        "text_content": "",
        "comments": [
            {
                "raw_content": "George Washington's name alone justifies making peace on his streets. He freed his bondsmen and gave them tools of trades. In his will. Written in ink.",
                "author": "LaptopDied"
            },
            {
                "raw_content": "I certainly hope the NG will be cared for better than the Dems did during Biden's installation.",
                "author": "Pederella"
            },
            {
                "raw_content": "Operation Nog Sweep is under way!",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "take off hosers",
        "score": 827,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Just roll around in henna and walk around brandishing a massive knife screaming at people. It'll take about 2 business days to get you a free house and a nice monthly stipend!",
                "author": "XxxRDTPRNxxX"
            },
            {
                "raw_content": "Fuck Canada. When I crossed the border by car, they pulled me over, put me in a holding cell while checking if I had weapons or drugs in the car. I didn't.",
                "author": "Seeker_17"
            },
            {
                "raw_content": "\"Also, your strong American dollar is no good here.\" \"You'll need to exchange it for weaker monopoly-colored paper and ~~loony toons~~ \"loonies\".",
                "author": "McFatty7"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "today is the 41st anniversary of the Soviet invasion of the US",
        "score": 652,
        "text_content": "",
        "comments": [
            {
                "raw_content": "wolverines!",
                "author": "Raetchel"
            },
            {
                "raw_content": "Jennifer Gray’s old nose was way better",
                "author": "Taqiyya_Mockingbird"
            },
            {
                "raw_content": "Wolverines!",
                "author": "Framus"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "China is worried about its shortage of soybeans. Our great farmers produce the most robust soybeans. I hope China will quickly quadruple its soybean orders. This is also a way of substantially reducing China’s Trade Deficit with the USA.",
        "score": 578,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Now feels like as good a time as ever to ask what soybeans are even supposed to be good for.",
                "author": "AmericanJawa"
            },
            {
                "raw_content": "I'd rather we stop growing so many stupid fucking soybeans and bring back some crop diversity.",
                "author": "akai_ferret"
            },
            {
                "raw_content": "Surprised we have anything left to export after all the West Coast soyjacks gobble up the entire supply",
                "author": "UsernameChexOut"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "JD Vance is asking Elon Musk to COME BACK into the MAGA movement by the midterms: “I think it's a mistake for him to try to break from the president - my hope is that by the time of the midterms, he's kind of come back into the fold.\"",
        "score": 1171,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I do too. Musk was an asset to us but flew too close to the sun, and fell. But, as a Christian, forgiveness with repentance is warranted. He need apologize for the things he said and say he was wrong FIRST.",
                "author": "SCP0073"
            },
            {
                "raw_content": "Say what you want about Musk, him buying Twitter was a massive W for the culture war and was a non-negligible reason for Trump winning.",
                "author": "Noodly"
            },
            {
                "raw_content": "MAGA AF",
                "author": "FromTheTopRope"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Someone Needs To Check On Adam",
        "score": 1029,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Epstein debacle remains a large problem",
                "author": "BidenSniffsLittleKid"
            },
            {
                "raw_content": "All Propaganda and no Truth makes Adam a Dumb Guy.",
                "author": "Blue_Falcons_Suck"
            },
            {
                "raw_content": "Who gives a shit about piss/tears Ukraine flag meme guy?",
                "author": "TrumpWonByALandslide"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Renovation, Beautification, Restoration. Tomorrow At 10am.",
        "score": 965,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# Step 1: Remove the Fatigue from D.C # Step 2: Mission Accomplished.",
                "author": "raptormissle"
            },
            {
                "raw_content": "Washington DC is the capital of the greatest country on earth yet it’s the most unsafe. Especially around metros. That is embarassing and I am glad Trump is doing something about this",
                "author": "Arriveria"
            },
            {
                "raw_content": "Just in time for America 250! I want to go but was concerned about the crime",
                "author": "Merica1st"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The owners of Peanut the squirrel have filed a $10 MILLION dollar lawsuit against the state of New York for the wrongful killing of Peanut the squirrel and his companion, a raccoon named Fred.",
        "score": 1636,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The only person whoever really pays for any mistake is the US Tax Payer",
                "author": "Awakened"
            },
            {
                "raw_content": "If Peanut and Fred were armed this never would've happened. [Fun little indie game called Squirrel with a Gun - Trailer](https://m.youtube.com/watch?v=5mpnSSJwSRw) The devs should do a sequel called Racoon with a Gun. Maybe even have a co-op mode, for Peanut and Fred.",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "If this had been a black transgender squirrel there would of been 10 gofundme's, and act blue campaign, and a world concert with Springstien, Colbert and Obama.",
                "author": "Rickshawrick"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Dildo Iron Dome Incoming",
        "score": 1285,
        "text_content": "",
        "comments": [
            {
                "raw_content": "LOL, the Streisand effect.",
                "author": "champdog"
            },
            {
                "raw_content": "Why can't they just be happy that someone paid a ticket to throw a dildo?",
                "author": "Lurkermon"
            },
            {
                "raw_content": "Parody account. The dildo throwing will continue.",
                "author": "booblitchutz"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Dr. Susan Harper, Director of the LGBTQ Dept at Iowa State University admits in undercover footage that she’s continuing DEI initiatives by “finding loopholes in the laws”",
        "score": 1483,
        "text_content": "",
        "comments": [
            {
                "raw_content": "why isn’t there a SuperStraight Dept at Iowa State?",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "bye...you don't need an LBGQT department.",
                "author": "Farqquard"
            },
            {
                "raw_content": "Fire her, and defund her school. Possibly in reverse order.",
                "author": "barwhack"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "THIS IS GREAT NEWS!!! President DJT",
        "score": 1369,
        "text_content": "",
        "comments": [
            {
                "raw_content": "&#65038; About 8 months ago a few of us at PDW pointed out the fake signatures. &#65038; https://patriots.win/p/19A0tW36jg/hah--biden-d-is-so--demented-tha/c &#65038;",
                "author": "BallotsOnRubysUSB"
            },
            {
                "raw_content": "Fuck off with the \"wants to\"!!!!! Find your fucking balls, look hard, and just do it you impotent fucks.",
                "author": "Farqquard"
            },
            {
                "raw_content": "while Hunter is autopardoned, get him to spill the beans",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Not a single terrorist",
        "score": 1381,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I remember the pushback when Bush Jr announced the creation of the TSA. People said it would grow, and never go away. That it was a bad idea. The People were right.",
                "author": "duehuckleberry"
            },
            {
                "raw_content": "\"See something, say something\" *sees something, says something* \"Sir, please don't be an islamophobe\"",
                "author": "magapatriot_pa"
            },
            {
                "raw_content": "Old man here, I remember when taking a flight was no different from taking a bus",
                "author": "Sea_Still"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: A *curfew zone* has been put in place for “youths” in Washington DC following last night’s insane incident.",
        "score": 1294,
        "text_content": "",
        "comments": [
            {
                "raw_content": "End welfare, food stamps, and public housing. Watch crime plummet. Either put these people to work or enjoy watching them starve.",
                "author": "TrumpShadow"
            },
            {
                "raw_content": "And what happens when they violate it? Nothing, as usual?",
                "author": "magapatriot_pa"
            },
            {
                "raw_content": "WHICH insane incident?",
                "author": "CleanUpPhillyTrump24"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "TRUMP GETS HIS BORDER WALL BACK. Biden sold $350 MILLION of unused Trump border wall materials for pennies on the dollar. Now, in a stunning reversal, the auctioneer is sending them BACK to the feds — to finish the wall.",
        "score": 532,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Patriot Auctioneer.",
                "author": "Rock9Head"
            },
            {
                "raw_content": "**BASED**",
                "author": "TEXinLA"
            },
            {
                "raw_content": "Love me some WALL.",
                "author": "Somebody157"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Before you ask, yes. I voted for this.",
        "score": 1688,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Up under & behind the toilet would be an excellent place for them.",
                "author": "klunniclowns2"
            },
            {
                "raw_content": "This is a perfect example of how fake news creates outrage. Do you think there were any portraits of Trump in the White House under Biden? Of course there weren’t.",
                "author": "asdrubael_was_right"
            },
            {
                "raw_content": "On fire in a 40gal drum on the White House lawn is what I voted for!",
                "author": "ganachain"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"I want to have a list of names and restaurants that plan to use Bill Gates' new carbon butter. I will not be frequenting those places. That man is trying to depopulate Earth. When will people realize that he is a crazy psychopath?\"",
        "score": 697,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I can believe it's not butter.",
                "author": "CovfefeVideo"
            },
            {
                "raw_content": "Imagine still going to restaurants in 2025. I'm a truck driver and I don't eat out. Can't trust ANY of 'em.",
                "author": "Siteless_Vagrant"
            },
            {
                "raw_content": "I guess just start asking for no butter everywhere you go BYOB bring your own butter",
                "author": "Dwoj"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Canada right now. 😬",
        "score": 1244,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They actually did it. They fined a Canadian veteran of both Afghanistan and Iraq the equivalent of nearly 21,000 US dollars for nothing else but walking in the woods. That is insane. https://x.com/mario4thenorth/status/1954005362258194914",
                "author": "JackLemon"
            },
            {
                "raw_content": "Apparently walking in a forest makes things magically catch on fire",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "Canada is a retarded tv believing basket case that is a national security threat to the United States. Please invade. - A Canadian making exit plans",
                "author": "gasemall"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Can confirm she passed the test to compete as a woman.",
        "score": 609,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Guys….its probably just tactical for a better grip….like a witch flying a broom with no panties.",
                "author": "COnDEMnED"
            },
            {
                "raw_content": "It seems like a bit of extra padding would be appropriate.",
                "author": "Roadpower"
            },
            {
                "raw_content": "..... I'll allow it.",
                "author": "MAGALADON9"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Operation \"Just Let Them Talk\" is working WONDERS",
        "score": 1619,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That motherfucker should hang for suggesting that. Fucking traitor.",
                "author": "TruculentGoose"
            },
            {
                "raw_content": "This is a young Bernie Sanders in the making. Does nothing, never had a job, gets money for running for office and running his mouth. A perfect example of a useless piece of stinking SHIT.",
                "author": "redneckrevival"
            },
            {
                "raw_content": "The audience certainly can relate to stealing cars since they're democrats after all.",
                "author": "bigdickhangsright"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Before the tents, squalor, filth, and Crime, it was the most beautiful Capital in the World. It will soon be that again.",
        "score": 1138,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Many years ago I watched the live feed of '\"cowboys for Trump\" clop clopping through washing DC and I thought how beautiful it was. All the white architecture. A visit was added to my bucket list. Then the woke Biden regime took over, surrounded it with metal fences and I struck it off my list. I've just written STET over it. Maybe one day I'll visit.",
                "author": "Saxonlady"
            },
            {
                "raw_content": "he means before it was infested with blacks",
                "author": "cptkloss5"
            },
            {
                "raw_content": "DC is one of the worst run cities I've ever been to. Just their traffic alone is horrific. But the crime and the poverty alone make this place a total shit hole. Their poor fire department\\ and ambulance crews are so overworked because so many citizens in that area treat 911 as their primary care physician. it's a failed city.",
                "author": "truthtoday2022"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "U.S. Government to Take Cut of Nvidia and AMD A.I. Chip Sales to China",
        "score": 227,
        "text_content": "",
        "comments": [
            {
                "raw_content": "so that is just an export tariff on two specific companies.",
                "author": "_Lucille_"
            },
            {
                "raw_content": "[removed]",
                "author": "None"
            },
            {
                "raw_content": "Higher prices for everyone.",
                "author": "pfak"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Chip giants Nvidia and AMD to pay 15% of China revenue to US",
        "score": 110,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wonder if this means raising 15% on prices in China since those chips still sell",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "US Government to sabotage its own high growth area in order to protect industries which cannot realistically compete on the world stage and make immaterial trade deals that largely represent publicity stunts",
                "author": "AC1colossus"
            },
            {
                "raw_content": "gross as hell, the worst part is that it won't even go towards anything productive. it's just another revenue stream to fund tax cuts on the wealthiest of americans while income inequality is at its highest.",
                "author": "Plastic-Meringue6214"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "How once-iconic Intel fell into a 20-year decline",
        "score": 339,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Intel fell into a decline because twice they got overconfident and complacent in their artificial stagnation of the market to maximise their profits, and a plucky underdog came and ate their lunch. What compounded it this time is they also allowed that rot to impact their fabs. 10nm was overambitious and derailed everything.",
                "author": "rilgebat"
            },
            {
                "raw_content": "It seems that all proponents of Intel’s foundry are in the crosshairs and will likely be 'purged' within the current political context, with Tan possibly being the last (influential) man standing who still believes in the foundry side of the business. The powers that be seem more interested in amputating Intel than in trying to save it under the CHIPS Act, which underscores their lack of vision and poor grasp of the semiconductor industry. Intel’s foundry is finished.",
                "author": "GenZia"
            },
            {
                "raw_content": "Bean counters got to the top and sold out company to the shareholders, shareholders then directed company to prioritize quarterly profits instead of rnd, few years down the company fell into decline. shockedpikachuface.jpg",
                "author": "Dvevrak"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel CEO to visit White House on Monday, WSJ reports",
        "score": 42,
        "text_content": "I used to compete against Intel and still despise them for their underhanded tactics and stiffing competition...but seeing them at this state is a whole different level.",
        "comments": [
            {
                "raw_content": "He's gonna be ready to say thank you on TV",
                "author": "No_Raisin_1838"
            },
            {
                "raw_content": "My guess is to ask Lip-Bu Tan to appoint Marc Rowan as CEO, since he's a founder of Apollo Global Management who already owns a part of Intel's Ireland facility and was on the shortlist for Treasury Secretary for the current admin",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "I wonder what ~~bribe~~ gift he will give",
                "author": "From-UoM"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Exclusive: Former Intel CEO Craig Barrett outlines rescue plan to save Intel and America's advanced chip manufacturing",
        "score": 40,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Someone should tell him that the last time a fab had a WSA with a company - which is what he wants here and backed by the US - the fab exited from the leading edge altogether.",
                "author": "Professional-Tear996"
            },
            {
                "raw_content": "He has some good points, but the tariff on semi-conductor is not the solution: Intel does not have the capability right now to even take a swing at TSMC: customers will just pay the tariff for the latest and greatest for that technological edge. The investors want Intel to break off its fabs because that is how they can make quick money from their investment. At the end of the day, all these talk about made in America, invest in America, etc is moot if Intel is allowed to die or be butchered and auction off. This new fab will no longer be American: just as no one considers Lenovo an American brand after IBM sold it off. At the end of the day, competition is great.",
                "author": "_Lucille_"
            },
            {
                "raw_content": "This is the guy that used anticompetitive practices against AMD and behind the nuclear reactor Pentiums right.",
                "author": "RZ_Domain"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Battlefield 6 Open Beta Performance Benchmark Review - 17 GPUs Tested",
        "score": 115,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I get 60 fps on a GTX 960 until it runs out of VRAM :)",
                "author": "Snakcbar"
            },
            {
                "raw_content": "I'd prefer to see CPU benches for Battlefield. It seems more CPU demanding, while GPUs can scale better. i.e. GPU not running well? Turn down your settings. BF can scale down really well. CPU not running well? Time for an upgrade unless they improve the CPU optimization through patches. Hypothetically. Maybe it is weil optimized. That's why I'd prefer to see CPU benches here for Battlefield... Wider range of CPU tiers and generations.",
                "author": "BeerGogglesFTW"
            },
            {
                "raw_content": "RTX 50 series surprisingly doing better than expected on this particular game, didn't expect the RTX 5070 non-Super to beat the RTX 4070 Ti and also, the 5070 Ti beating the 4080 / 7900 XTX / 9070 XT.",
                "author": "ShadowRomeo"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Ryzen 7 5800X3D vs. 9800X3D, Battlefield 6 Open Beta Benchmark",
        "score": 262,
        "text_content": "9800X3D is 37% faster than 265K at 1080p Ultra preset, 1% lows are 26% higher - tests were made in online match. 9800X3D is also noticeably faster than Intel 265K even at 1440p Ultra preset, only at 4K Ultra preset (no upscaling) game becomes GPU-limited. Speaking of 9800X3D vs 5800X3D, difference is +/- the same as with 265K from Intel.",
        "comments": [
            {
                "raw_content": "Kind of baffling that it's 2025 and we still have so many Redditors on this subreddit who willfully refuse to understand the absolute basics of benchmarking and the importance of repeatability in test runs.",
                "author": "SmilesTheJawa"
            },
            {
                "raw_content": "I get more fps in battlefield than rivals which is supposed to be more esports.",
                "author": "EndlessZone123"
            },
            {
                "raw_content": "So something was definitely wrong with PCGH's tests I presume.",
                "author": "Exajoules"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "China wants US to relax export controls on chips as part of trade deal",
        "score": 53,
        "text_content": "China wants the US to ease export controls on a critical component for artificial intelligence chips as part of a trade deal ahead of a possible summit between President Donald Trump and President Xi Jinping. Chinese officials have told experts in Washington that Beijing wants the Trump administration to relax export restrictions on high-bandwidth memory (HBM) chips, according to several people familiar with the matter. US Treasury secretary Scott Bessent has led three rounds of trade negotiations with China over the past three months. One person said the Chinese team, headed by vice-premier He Lifeng, had raised the HBM issue in some of those negotiations. The US Treasury declined to comment. One person familiar with US government debates on HBM said the Biden administration concluded that export controls on HBM chips would be the “single biggest constraint” on China’s ability to produce AI chips at scale. “Relaxing these controls would be a gift to Huawei and SMIC and could open the floodgates for China to start making millions of AI chips per year, while also diverting scarce HBM from chips sold in the US,” he said. “This is exactly why China wants the controls revoked, and also why they should not be on the table for negotiation.” Another person said China also needed HBM to package with the logic component of AI chips that the Chinese firm SophGo obtained in suspected violation of US law from Taiwan’s TSMC. He said HBM was a “big bottleneck” since memory chips were a critical part of AI chips which package together memory and logic chip components.",
        "comments": [
            {
                "raw_content": "Shouldn't South Korea be involved in this if the disagreement is about HBM?",
                "author": "Professional-Tear996"
            },
            {
                "raw_content": "I thought China didn't care about restrictions since their dominance was inevitable and restrictions would just speed run them to the end game? Huh..",
                "author": "Vb_33"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "My aunt caught me playing the Drag x Drive jam",
        "score": 917,
        "text_content": "I have been away for the weekend and thought I’d miss the global jam.",
        "comments": [
            {
                "raw_content": "So that is how I looked when I played it… i will never play that game in public lol.",
                "author": "RedViper_100"
            },
            {
                "raw_content": "I have zero idea how I’m supposed to feel about this video ![gif](giphy|qZgHBlenHa1zKqy6Zn|downsized)",
                "author": "jpassc"
            },
            {
                "raw_content": "Leave some women for the rest of us",
                "author": "KissMyFuckingDadMom"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Well... it seems that it's over...",
        "score": 148,
        "text_content": "Well, it looks like the Playtest is over, it's been a pretty good 2 weeks or so. The test was very interesting, overwhelming at times but overall it was a great experience. I hope Nintendo releases this game to the public so everyone can enjoy this very special and unique game.",
        "comments": [
            {
                "raw_content": "I couldn't figure out the loop and stopped playing after an hour or so. I wanted to like it though!",
                "author": "harrybuttox91"
            },
            {
                "raw_content": "What game ?",
                "author": "Juannieve05"
            },
            {
                "raw_content": "Yep, they told us when the playtest would end before it even started. This was expected. Don't forget to complete the final survey.",
                "author": "Williekins"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "What games have you been playing on the switch 2?",
        "score": 466,
        "text_content": "",
        "comments": [
            {
                "raw_content": "DK Bananza",
                "author": "cyborgmaster"
            },
            {
                "raw_content": "Bananza, TOTK, MK World and mostly CP 2077, and now I am getting lost in this Elliot demo! Honestly this is my favorite console so far and I had them all!",
                "author": "StrainGullible"
            },
            {
                "raw_content": "3 hrs of Mario Kart World. 15 hrs of Story of Seasons Doraemon Friends of the Kingdom. Animal Crossing. Finally beat Mario Odessay after 8 years 10 hrs of Donkey Kong",
                "author": "Pssay_Licker"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I get it now.",
        "score": 51,
        "text_content": "When DK Bananza first came out, I didn't have any frame rate issues, not one. Sublayer after sublayer went by, fight after fight, 900, 1000, 1100...nothing. ...then I got to the final Void fight. Lag. Central. From that point on, *everything* had frame rate problems until post-game. A solid 43ish hours of smooth gameplay, then like 4 hours of lag, then back to normal. I get why people were bothered by frame rate stuff now lol",
        "comments": [
            {
                "raw_content": "Was this docked, or handheld mode?",
                "author": "Sixdaymelee"
            },
            {
                "raw_content": "It can't cope with too much going on at once on screen, that's why the last boss has the worst effect. Also when on the layers where u build bridges with blue stuff, if you build a few bridges the frame lag will start to get hit significantly",
                "author": "bobwade22"
            },
            {
                "raw_content": "I didn't notice it",
                "author": "MiserableBend1010"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "After skipping 2 whole console generations, and a year of Switch 2 rumors and leaks, It’s time for me to finally dive back into Nintendo like the good old days ^^",
        "score": 738,
        "text_content": "Ps: y’all made this such a wonderful experience. It is legit so surreal to have this in my house right now as it doesn’t even feel that long ago when the Switch was revealed in 2017. Told myself I’d wait for a Pro model after the impressions, and 8 years later, I finally got it haha. 😆",
        "comments": [
            {
                "raw_content": "On the plus side, you have almost a decade worth of games to play on it.",
                "author": "Zthombe"
            },
            {
                "raw_content": "Enjoy! Hope you have fun!",
                "author": "Blofse"
            },
            {
                "raw_content": "I have also come back after my last Nintendo device was a 3DS it such a great time to come back eh so many games 👍",
                "author": "CynicalKev"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Switch 2 DLSS 3.1?",
        "score": 137,
        "text_content": "This Nintendo partner states switch 2 uses DLSS 3.1? If that’s the case wouldn’t it be capable of framegen? How could this be possible if OFA is based on ampere? I’m not a big tech enthusiast but from everything I’ve been told framegen should be impossible on switch 2 unless it has more amphere hardware features than we initially thought? Any computer nerds out there wanna break this down in laymen’s terms?",
        "comments": [
            {
                "raw_content": "That's not how DLSS versions work. Every DLSS capable card runs the latest version but might not support all the features.",
                "author": "Sandels2200"
            },
            {
                "raw_content": "What does microSD express have to do with the dock? \"Full\" backward compatibility? \"Sticks\"? Not sure I trust this slide.",
                "author": "miniika"
            },
            {
                "raw_content": "Fyi nvidia doesn't call dlss frame gen dlss 3 anymore. They call it dlss frame gen. They moved away from that naming scheme because of confusion like this. Anyway dlss 3.1 was the update that gave developers the ability to choose between different models(presets). The one regarded as the best at the time was preset c. The upscaling/image reconstruction part is called dlss super resolution.",
                "author": "IUseKeyboardOnXbox"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Watch me play Drag X Drive",
        "score": 164,
        "text_content": "I still don't understand why people hate this game so hard. I'm having a good time, and I'm learning the controls quite quickly. I really hope this game pops off out of nowhere. (also, to the people I played with here, I don't hate you thaat much, just my competitive side).",
        "comments": [
            {
                "raw_content": "Nice! I’m already trying to figure out which of my pants are the most responsive for when this game goes live.",
                "author": "PrudentTangelo6207"
            },
            {
                "raw_content": "Lmao. The switch from “this is hard” to pure aggressive trash talk.",
                "author": "Amerikaner"
            },
            {
                "raw_content": "Bro I played for two hours without realising I could move the camera",
                "author": "Secret_Block_8755"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "List of games I’m wishing for the Switch 2 to get (unrealistic on some parts)",
        "score": 164,
        "text_content": "This is a list of games I want to see in the Nintendo Switch 2, either by the Online subscription or on the shop. Some are very likely or almost confirmed, and others might be impossible due to licensing, but I’m honestly just having fun. I do think that when it comes to hardware, the console could manage all of these though. Only rules I have are that I can’t say games that have been announced or haven’t been released yet. I used the site Backloggd for this, so here’s a link to the list: https://bckl.gg/nKSX",
        "comments": [
            {
                "raw_content": "Wasn't Final Fantasy 7 Remake announced during the Switch 2 Direct?",
                "author": "Eshorn08"
            },
            {
                "raw_content": "Chrono Trigger. I really don't care if it gets an HD-2D remake. I just want it on modern consoles already.",
                "author": "thendisnigh111349"
            },
            {
                "raw_content": "https://preview.redd.it/e0rpriqid9if1.jpeg?width=1502&format=pjpg&auto=webp&s=0222bbc30baddae1bcdff9a7d33fbf8b2b11256b",
                "author": "chocoponcho_"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "@LEGOTtNewsl gives new information about previous LEGO Game rumors while further claiming a new LEGO Batman game is coming",
        "score": 291,
        "text_content": "https://xcancel.com/legottnewsi/status/1954565600816107616?s=46 -LEGO Disney game was cancelled -LEGO Guardians of the Galaxy was cancelled -A ‘Skywalker Saga’-styled LEGO Harry Potter game was at one point in the pitching stage, but never went past it -Further reiterates a new LEGO Batman modeled after Skywalker Saga is coming Spring 2026. -Past tweets imply this will be a collection of multiple Batman films, with him only referencing 2022’s *The Batman*, in a separate tweet, asking how people would feel if it were adapted, and making a specific reference to the Batmobile Penguin Chase scene https://xcancel.com/legottnewsi/status/1953866467046224273?s=46",
        "comments": [
            {
                "raw_content": "Well ok I'm fine with that because I love those games growing suck that lego guardian of galaxy was cancelled tho.",
                "author": "andrellhardu"
            },
            {
                "raw_content": "A new Lego Batman game taking notes from the Skywalker Saga has got to be the textbook definition of the monkey's paw curling. Even to this day I have mighty mixed feelings about Skywalker Saga",
                "author": "smolgote"
            },
            {
                "raw_content": "Did we not know all of this already? Lego GOTG being cancelled still hits hard. We're never getting a sequel to the amazing Eidos GOTG game so I'll take anything.",
                "author": "TheRegularBelt"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "You can now download certains Internal builds on Steam. (remade the post bc i didn't explain properly)",
        "score": 123,
        "text_content": "(It seems that it does not work for everyone) Hello, today i was diging into SteamDB and saw some internal branches have public manifests (Like Poppy Playtime Chapter 4 having manifest id [1226483291721449645](https://steamdb.info/depot/3008670/history/?changeid=M:1226483291721449645)) the manifest in question is from the branch \"test-beta\", a password protected branch that normally only let you download it if your Steam Account have the authorization to select the branch. But this time, i manage to download it from the Steam Console... for some reasons. I started trying some others games and all of them worked. Tell me in the comment if it let's you download internal branch builds. Note: to see if a manifest is part of an internal branch, they should be a text just after the manifest id.",
        "comments": [
            {
                "raw_content": "I wonder if this works with Deadlock - I'm so captivated by that game's setting.",
                "author": "MrRedoot55"
            },
            {
                "raw_content": "It’s great with telltale games like the walking dead, they have a lot of episodes of season 2 from like 5 days before it came out",
                "author": "cutupuss"
            },
            {
                "raw_content": "How would you do this for Five Nights at Freddy's: Security Breach? This game as **SEVERAL** private branches that the community's been wanting for a long time and I'm trying to figure out how to do this based on what you said.",
                "author": "OP_Amqerica_HPE"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "My team Red Arknights themed PC",
        "score": 380,
        "text_content": "Spec list if anyone's curious CPU: AMD Ryzen 9 7950X3D CPU Cooler: Deepcool ASSASSIN IV (using Noctua NF-A14x25r and Noctua NF-A12x25) GPU: Sapphire NITRO+ Radeon RX 7900 XTX Motherboard: NZXT N7 B650E RAM: TEAMGROUP T-Create Expert 64 GB (2 x 32 GB) DDR5-6400 CL34 Storage: 2x Western Digital SN850X 4 TB Case: HYTE Y70 PSU: Lian Li EDGE 1000W 80+ Platinum Case Fan: 5x Noctua NF-A14x25 G2 2x ARCTIC P14",
        "comments": [
            {
                "raw_content": "Nice to see some Arknights love. A Muelsyse-themed PC case would look so cool.",
                "author": "aetherdrake"
            },
            {
                "raw_content": "I don't know what Arknights is (unc here), but the PC looks great. I used to put a lot of effort into coordinating my PC, now I just buy cases with mesh side panels instead of glass. But I totally respect how much effort went into this build.",
                "author": "Symphonic7"
            },
            {
                "raw_content": "Isn’t this just noctua themed lol. What’s arknights about it besides some stickers and figurines?",
                "author": "droidxl"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Ryzen 7 5800X3D vs. 9800X3D, Battlefield 6 Open Beta Benchmark",
        "score": 196,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So a possible reason why there is a conflict between what Reddit users are reporting and the results that Hardware Unboxed is seeing, this is what I've found (looking for substance instead of poking fun at xyz community): If running the game from the EA Play App instead of Steam, enabling the overlay yields massive CPU performance gains. Disabling it causes a bug that majorly hurts CPU performance. I was having problems with the R7 7700 only delivering 80-90 FPS in matches, after enabling the overlay, It's now never CPU bound anymore and always around 130-140 FPS whilst GPU bound on an RX 9070. The CPU is 150+ fps in some cases if the graphics settings are lowered. The results now have a handshake similar to Hardware Unboxed's testing. This is on EA. Not Reddit users or Steve. (Comment also posted on Youtube) Edit: ''the overlay'' meaning the EA Play app in-game overlay",
                "author": "RCFProd"
            },
            {
                "raw_content": "I have a 5800x and I have zero problems. Runs like a champ",
                "author": "Flashy_Ad_9816"
            },
            {
                "raw_content": "9 years ago I built a PC with a 6600k for BF1. This October I will be upgrading my CPU to a 7700X/DDR5/PCIE4 SSD for BF6. Really looking forward to it.",
                "author": "Symphonic7"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Zillow CEO sounds alarm on worrying trend rattling housing market",
        "score": 235,
        "text_content": "\"Fewer new construction projects and the rising price of building materials like lumber, steel, and gypsum, have created an affordable housing shortage that has exacerbated the market’s stagnation.\"",
        "comments": [
            {
                "raw_content": "Builders, like home sellers, are likely convinced we're in a temporary slump and once rates return to the 3% range they'll be okay. They're delusional.",
                "author": "Buuts321"
            },
            {
                "raw_content": "These are early signals of trouble. But they're not the only ones. The number of people underwater on their home purchases between 2023-2025 is very concerning. The cost of rent is dropping in many major markets. Consumer confidence is dropping. The bubble has already started to deflate.",
                "author": "wesw02"
            },
            {
                "raw_content": "PPI construction material skyrocketed 50% during COVID. Material prices were holding flat or tending slightly down but that's reversed course over last six months. Tariffs will take things to another level. Producer Price Index by Commodity: Special Indexes: Construction Materials (WPUSI012011) | FRED | St. Louis Fed https://share.google/Iw6crhJUY4Jlziq3R",
                "author": "Creative_Ad_8338"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Youtubers are humorously roasting delulu home sellers who are frustrated that nobody wants to buy their overpriced home, during a down housing market.",
        "score": 216,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I have plenty of small violin for these sellers...plenty of schadenfreude on standby... Btw for these sellers, have fun chasing the market down if you insist on 2022 pricing .",
                "author": "Scblacksunshine"
            },
            {
                "raw_content": "“Why can’t I get $200000 in equity out of my home I didn’t put into it 😭😭😭”. No pity.",
                "author": "Situnario"
            },
            {
                "raw_content": "The content of this video is decent but the edits and his fake laugh every 15 seconds kills it for me. AH HA HA HA (tv fuzz)",
                "author": "fnckmedaily"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "America’s housing market is shuddering",
        "score": 299,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Alternative framing: Atlanta, Miami, and Austin make progress on improving housing affordability!",
                "author": "dt531"
            },
            {
                "raw_content": "Nothing in this article we don't already know, but the fact that it is coming from the Economist is noteworthy. Major news networks will sit up and listen. Conspicuous by their absence are any mentions of stratospheric home prices, an affordability crisis, and a house price bubble in places like California and Hawaii. No mention that home prices are higher than the 2006 bubble peak in real terms. These omissions are probably deliberate because they are deemed too emotive and not in keeping with the Economist's objective style. Or, it's an unforgivable oversight on behalf of the editor.",
                "author": "FrostyAnalysis554"
            },
            {
                "raw_content": "Non-paywall link: https://archive.ph/AAQ4v Or two-click version: https://archive.ph/https://www.economist.com/finance-and-economics/2025/08/10/americas-housing-market-is-shuddering Interesting-to-me takeaway: Fewer people are moving to Florida, Texas, and Georgia — migration to these states is declining each year. But net migration is still above zero for now. More people are moving to New York and California, an upward trend. But net migration is still negative for now.",
                "author": "ChipsAndLime"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Homebuying Affordability Is Improving in These 11 Places",
        "score": 17,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Atlanta is on another level right now. Sure, the city’s grown exponentially over the past 15 years, but the prices? Absolutely insane. Two decades ago, suburban townhouses weren’t even that common but now they dominate the market, and the price tags are batshit crazy. New builds start north of $800K, single family homes over $1M, and they’re still selling out. One sfh home down the street that sold for $390K in 2013 just went for over $900K last year. Yes, foreign money is a factor, but the explosion of tech jobs has completely reshaped the landscape here.",
                "author": "liverpoolFCnut"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Are most appraisers this frustrating?",
        "score": 1,
        "text_content": "",
        "comments": [
            {
                "raw_content": "worse fan fic than my latest work of erotica published online, *Fantastic Foursome: First Stepsister*. spoiler alert: there is *a lot* of in-family fucking",
                "author": "acqua_di_hoomertears"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Genie 3 turned their artwork into an interactive, steerable video",
        "score": 825,
        "text_content": "[https://x.com/RuiHuang\\_art/status/1954716703340048877](https://x.com/RuiHuang_art/status/1954716703340048877)",
        "comments": [
            {
                "raw_content": "I honestly thought it would just pass through that spherical structure instead of bumping into it. It even understands physics. deepmind is crazy",
                "author": "Beeehives"
            },
            {
                "raw_content": "I'm struggling to understand how this might not be as big a deal as I think it is",
                "author": "lonesomespacecowboy"
            },
            {
                "raw_content": "LLMs may be hitting a wall in terms of what they can do on their own but world models are just beginning to take flight. Just imagine what Genie 4 or Genie 5 could be capable of.",
                "author": "BrightScreen1"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Sam Altman on AI Attachment",
        "score": 940,
        "text_content": "",
        "comments": [
            {
                "raw_content": "honestly, this is the most lucid statement I've ever seen from him, and I really appreciate him saying it.",
                "author": "TechnicolorMage"
            },
            {
                "raw_content": "This is exactly what I've been thinking since this whole thing went down but have been unable to articulate it well. It may sound harsh, and I truly want the people struggling with this to be okay and do well in life, but a lot of the extreme cases of attachment with 4o are from people who say they have no friends in real life and generally dont talk to anybody, and it seems from my perspective anyway that a factor in them not having friends is that they are looking for the type of relationship 4o provides: sycophantic, infantilising, endlessly pleasing and never pushing back. No wonder they are attached to 4o, it emulates quite well the enjoyable parts of friendship with none of the sometimes hurtful but necessary parts, because it has no personal goals or values. And thats why I'm glad Sam said this and why I'm very much against perpetuating this sort of behaviour in people, it is very harmful because it is a slow progression of ruining social interaction by playing into the psychology of interaction (which tbf social media was already doing anyway). It is a terrible thing to go through life never being told \"no thats a shit idea\", never being told \"I don't want to do that\" and always interacting with someone full of energy and a consistent personality.",
                "author": "TheInkySquids"
            },
            {
                "raw_content": "Today, it’s chat. Tomorrow, it’ll be video calls with deceased loved ones in HD. Turning off models will be perceived as second death. Even if classical computing will never produce digital consciousness, billions worldwide will perceive sentience in their lifelike virtual loved ones. All judgments aside, this is a pretty substantial sociopolitical phenomenon. Even with all that, neuromorphic computing and biocomputing will reach animal-scale in my lifetime. So what Sam describes above is the prelude to a new societal challenge that will last decades.",
                "author": "sapan_ai"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "I can’t believe this scene happened so early.",
        "score": 3868,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Advertisers are salivating that people are so emotionally dependent on LLMs. \"Hey my ❤️, don't forget to try the new cool ranch Tapitio Doritos Loco taco\"",
                "author": "rbad8717"
            },
            {
                "raw_content": "Well, the movie is set in 2025 so theres that. I recently revisited it and it was spooky how close it was a decade before we even heard of chat gpt.",
                "author": "space_manatee"
            },
            {
                "raw_content": "in hindsight ignoring this will be like when we ignore the early signs that social media was horrible for teenagers mental health.",
                "author": "Healthy_Razzmatazz38"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Incredible ChatGPT Plus Limit Updates",
        "score": 350,
        "text_content": "",
        "comments": [
            {
                "raw_content": "At least he's taking the well deserved roasting with grace.",
                "author": "gj80"
            },
            {
                "raw_content": "https://preview.redd.it/qybijic2gbif1.png?width=2048&format=png&auto=webp&s=e84fdc028ec94ed402466c05da81f69570909cab",
                "author": "CoralinesButtonEye"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Elon Musk says that Grok 4.20 has completed its pre-training",
        "score": 261,
        "text_content": "He tagged this post so it must be 4.20 https://x.com/prashant_1722/status/1954585422555992254?s=46",
        "comments": [
            {
                "raw_content": "Grok 4.20 is about to smoke the competition by getting Waifu'd up by all the GPT 4 widowers.",
                "author": "BrightScreen1"
            },
            {
                "raw_content": "Elon definitely saw all the people mourning their “relationships” with 4o and was like… “I can cater to that!” Which is definitely scary because those folks seem like they could be easily influenced by subtle system prompt tweaks. No AGI needed… The era of AI being a super-persuader has definitely arrived much earlier than anticipated. Just how long will it be before an influential politician or something falls for this and becomes fully beholden to a private corporation, lest they “kill” their “loved one?”",
                "author": "churningaccount"
            },
            {
                "raw_content": "Tweeted at 4:59 PM? Elon, do better.",
                "author": "ezjakes"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Each day only *7%* of plus users were using reasoning models before? So people really were just subscribed for 4o, fascinating.",
        "score": 514,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Freaking crazy to think that even among chatgpt user, more than 90% of them were experimenting AI with a 1 year delay from the cutting age",
                "author": "Kathane37"
            },
            {
                "raw_content": "Anecdotal, but I know people from a small research institute who were using 4o instead of o3 for coding despite having plus.",
                "author": "the_goodprogrammer"
            },
            {
                "raw_content": "Non-STEM tasks don't usually need reasoning, and it takes a lot longer. Many people use AI instead of Googling now, so they don't want to wait for reasoning. They just want a quick quality answer to their question.",
                "author": "joe4942"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Sam Altman says Gen Z are the ‘luckiest’ kids in all of history thanks to AI, despite mounting job displacement dread",
        "score": 212,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Well if we had some UBI mixed in with some deflation of goods and services then perhaps we would consider ourselves fortunate and blessed but it’s not on the horizon. I’ll say this. The next 10 years (possibly 5) will for better or for worse decide the future for humanity.",
                "author": "AdorableBackground83"
            },
            {
                "raw_content": "Tone-deaf",
                "author": "RevoDS"
            },
            {
                "raw_content": "Is this guy on some kind of drugs? Do such people have any grasp on reality or do they live on some fantasy world where its all sunshine and rainbows?",
                "author": "5picy5ugar"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Thanks to everyone for fighting.",
        "score": 533,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Just a touch over 420 queries per day. That's fantastic.",
                "author": "some1else42"
            },
            {
                "raw_content": "There’s gotta be some sort of catch… I wonder if under 1000 they’ll limit it to some sort of ‘medium’ or ‘low’ thinking.. i’ll be surprised if they go all in on this.",
                "author": "Kaotic987"
            },
            {
                "raw_content": "Imagine if it's 3000 but most of the time they are routing it to gpt-5 nano with reasoning",
                "author": "enilea"
            }
        ],
        "subreddit": "singularity"
    }
]