[
    {
        "post_name": "This is in New Jersey Newark City Hall is raising an Islamic flag while the Muslims in attendance chant \"Allahu Akbar! Allahu Akbar!” This is the Islamic Takeover of America",
        "score": 43,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This only exists in a place that tolerates it. Become intolerant.",
                "author": "DoMe22"
            },
            {
                "raw_content": "Where're the Situation and Snookie when you need them?",
                "author": "BigMikesChef"
            },
            {
                "raw_content": "Fry these fuckers. Pig fat.",
                "author": "Speedgraphic69"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨NO BRAKING: A new meme format has dropped and it’s a banger!🚨",
        "score": 39,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Deploy the trebuchets",
                "author": "MedicallyReddit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This is how OUT OF CONTROL California is. 449,000 REGISTERED VOTERS couldn't perform jury duty because they weren't citizens. But they are REGISTERED VOTERS! A half a million of them. ABSOLUTELY NO federal aid without Voter ID.",
        "score": 57,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You know it's true when Snopes can't do some epic mind bending reality fact twisting to say it's false...",
                "author": "AllisterTwo"
            },
            {
                "raw_content": "That's half a million ballots that can be used, they don't even have to vote, the ballots can be filled out by anyone.",
                "author": "grassshrimp"
            },
            {
                "raw_content": "Ignore Snopes, as they are trying to deboink what’s already been proven through multiple sources. That’s the point.",
                "author": "GuerillaYourDreams"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Insidious",
        "score": 31,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"And then we're coming for your children!\"",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "Are they Siamese twins? They share an arm, gay twin incest is quite concerning.",
                "author": "BigMikesChef"
            },
            {
                "raw_content": "And then the collapse of the western world.",
                "author": "tpactionchasethevote"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The people of Greenland are ready to be liberated from Denmark by President Donald Trump.",
        "score": 870,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I was told that the rest of the world hates Trump.",
                "author": "Apersonofinterest"
            },
            {
                "raw_content": "# LIBERATE THEM TODAY, PRESIDENT TRUMP!",
                "author": "Patriot34TN"
            },
            {
                "raw_content": "Why do so many greenlanders look like mongolians. What's the history behind that?",
                "author": "gravenspine"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Elon Musk's Starlink cracks the digital blackout in Iran. Leaked videos from Tehran show the people's revolt, burning Iranian government buildings.",
        "score": 846,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# INTERNET blackout, **DUMBASSES**",
                "author": "Broomstikchik"
            },
            {
                "raw_content": "Between starlink, DOGE and Twitter, Elon is a godsend despite all his shortcomings. Say what you want about him but we’d be living in a very different world if not for this man",
                "author": "HunterBidensPC"
            },
            {
                "raw_content": "Liberals need to be shown this so they know what a REAL insurrection looks like…J6 was a guided tour of Disney World compared to Iran",
                "author": "Define_Assault"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Tom Homan just revealed the HEROIC ICE Agent who defended himself against the vehicle ramming anti-ICE protestor is now living in “fear for him and his family.”",
        "score": 836,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They should use a fake as bait somewhere and capture all the people who come for him",
                "author": "VirTW"
            },
            {
                "raw_content": "What are you doing about it, Tom?",
                "author": "KekistanPM"
            },
            {
                "raw_content": "He was \"doxxed\" by Kristi Noem and other federal officials, who were telling media and posting on X that it was the same agent who was dragged 100 yards by an illegal alien child sex offender's vehicle last year (June). That perp was just convicted on December 10. The agent's name is not redacted in the publicly accessible court documents. Not clear if Noem and others realized this when they publicly described what happened to the agent last year. > Homeland Security officials said the immigration officer involved in this week's fatal shooting in Minneapolis is the same officer who was injured in June 2025 in another vehicle incident. That Enforcement Operations Officer is identified in court documents as Immigration and Customs Enforcement's Jonathan Ross. https://www.usatoday.com/story/news/nation/2026/01/08/jonathan-ross-ice-officer-shot-renee-good/88087720007/",
                "author": "Deplora"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ICE is rolling up on obstructionists in Minnesota with red dots, and extended mags. Voted so hard for this.",
        "score": 1078,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They must have some Quality Learing Centers in Rosemout (Rosemount).",
                "author": "Build_Back_Bankrupt"
            },
            {
                "raw_content": "Start breaking the windows and yanking these worthless fucks out of the vehicles.",
                "author": "Buff_cousin_Elroy"
            },
            {
                "raw_content": "Good. I hope we get some mass executions. Fuck these people.",
                "author": "DrHavick"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Big Banks and Credit Card Companies love offshoring their work force abroad and employing H-1Bs while charging 20 to 30% on credit card debt to previously employed or underemployed Americans. Bring the jobs back and end the carnage.",
        "score": 1032,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Trump is threatening to put the screws to the credit card companies. Will be interesting to see how that turns out.",
                "author": "Datamancer"
            },
            {
                "raw_content": "I'm tired of foreign accents in general every time I call a company i do business with. Going to start being a lot more vocal about this when I call.",
                "author": "America_No_1"
            },
            {
                "raw_content": "The problem I see with the credit card interest rate push is the people this is aiming to protect (people paying interest on credit card debt) are the ones that are going to fuck themselves regardless of what any credit card interest rate is.",
                "author": "Beef_Vegan"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Minnesota Outrage - We've seen this unfold several times",
        "score": 872,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And yet everyone from the top on down just stands by and watches the trainwreck happen",
                "author": "5854110203868847"
            },
            {
                "raw_content": "I am not worried about the rioters. I am worried about the politicians who will not stop them, will encourage them, and will pay for them.",
                "author": "tpactionchasethevote"
            },
            {
                "raw_content": "doesn't take liberals and Somalis very long to go all jungle chimpout mode.",
                "author": "BidenShowerDrool"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "(Better pic) A US Marine honor guard presented the colors of the USS Iwo Jima as the NCO's took the oath to up to E-5 during this ceremony today at the old Spanish garrison in Old San Juan.",
        "score": 845,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is the sacred ground where the key to the capital city was handed to American forces in 1898, officially proffering the surrender of Spanish sources. Old Glory has been waving from the battlements ever since.",
                "author": "BoricuaPede"
            },
            {
                "raw_content": "Crooked ass formation. Come on Army.",
                "author": "Snooptwo"
            },
            {
                "raw_content": "*\"All this over a flag?\"* - Michael Obama",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Residents of MN - stop paying state taxes.",
        "score": 1270,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They wave any flag but the American flag and fight for any people but the American people.",
                "author": "wharfthrowaway"
            },
            {
                "raw_content": "Totally agree. Ill only be filing federal this year as to not get fed prison arrested. Suggest rest of MN inhabitants follow suit and ignore state filing...",
                "author": "jbaum517"
            },
            {
                "raw_content": "I want militias to come in and crush this shit by force. Brutally.",
                "author": "DoMe22"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This is good. 😂 😂 😂 They LOVE trump so much",
        "score": 789,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Soon 👍",
                "author": "Live_free_or_die_55"
            },
            {
                "raw_content": "4d chess from Trump. Greenland, Venezuela, Cuba, Columbia....... This is Trump's response to Putin. You don't want to end the war so I'm kicking the commies out of our hemisphere and taking over Greenland. Suck on that pootie poo. What about Mexico? Well he's been talking about eliminating the cartels for years and years.",
                "author": "MEME-SUPREME"
            },
            {
                "raw_content": "We need to absorb Greenland first!",
                "author": "RogueLeaderX"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The United States of America is the Hottest and most Successful Country anywhere in the WORLD!!! President DJT",
        "score": 1236,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yeah I'll believe this when I am not giving 60% of my paycheck to the fucking government",
                "author": "Wfdeacon88"
            },
            {
                "raw_content": "Happy to contribute to global warming on this one.",
                "author": "JoeBidensDementia1"
            },
            {
                "raw_content": "Lmao president trump is delulu. It's hot for fraudsters, for illegals, for Israel, NOT for the citizens of the USA. WE'RE LAST!!",
                "author": "EstadosUnidosPrimero"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "they want it both ways because their motivations is starting war. You cant reason with the deliberately unreasonable.",
        "score": 1386,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's called Bolshevism. Aleksandr Solzhenitsyn tried to warn the West.",
                "author": "loooooof"
            },
            {
                "raw_content": "Not in Florida. We can run them over here. Passed a law about it and everything.",
                "author": "Badfinz_FL"
            },
            {
                "raw_content": "If it weren’t for double standards, they’d have no standards at all.",
                "author": "GuidedDisinfo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Frens need to infiltrate this",
        "score": 1272,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Put “pro-Trump” “back the blue” stickers on protesters’ vehicles so they will end up getting destroyed by other protesters",
                "author": "BasedCostanza91"
            },
            {
                "raw_content": "Stickied for visibility. Hopefully Trump’s people see it, if they haven’t already.",
                "author": "GuerillaYourDreams"
            },
            {
                "raw_content": "These also work on protesters cars...",
                "author": "Wizard_Glick"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Get Out the Good Snax",
        "score": 1015,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Where are they all parking? These people are from out of state that is why it took so long.",
                "author": "Great_Gazoo"
            },
            {
                "raw_content": "LETS GOOOOO!!! burn the Somali neighborhoods first. This would be a perfect opportunity lol",
                "author": "EdBuck"
            },
            {
                "raw_content": "Popcorn and Beer What didn't burn during the George Flyod riots will burn tonight.",
                "author": "TEXinLA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The only way space is fake and gay",
        "score": 999,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Like I'm watching this and literally the only thing I can think of is: \"Why is she handing her glasses to the fat black alien?\" Like, those are her glasses. For her eyes. Tailored to her prescription. She had them walking up and needed them to read. And she just, like, hands them off. So when she needs them again she has to go find who she gave them to? In fact, why would anyone in the Star Trek universe need glasses at all? Geordi LaForge had a congenital condition that destroyed his optic nerves, and they were even able to fix that. She has hyperopia and has to wear Problem? glasses.",
                "author": "ICEisNICE"
            },
            {
                "raw_content": "Apparently in the future they ran out of Ozempic",
                "author": "RedditStillSucks"
            },
            {
                "raw_content": "This looks so good! Finally someone who looks like me! (Hideous fat alien)",
                "author": "ModsAreCucked"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Jack Smith team approved $20k payment to informant to snitch on Trump team during Arctic Frost case",
        "score": 1385,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's inconceivable that the President would have assigned a team of strong women feminists to oversee this crisis, and that he just doesn't understand that they're doing nothing. -from my suicide note",
                "author": "Yemen"
            },
            {
                "raw_content": "You're in charge of the executive branch. Go arrest him.",
                "author": "SleazyE"
            },
            {
                "raw_content": "We need to vote this guy for President so he could build an administration that will go after the corrupt prosecutors!",
                "author": "BirthHole"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: Was just sent a video showing the moments before the shooting.",
        "score": 1346,
        "text_content": "",
        "comments": [
            {
                "raw_content": "When the camera finally panned over to the source of the racket (40 seconds in), and she's just sitting there *dancing with her shoulders* I burst out laughing. In that moment all the dems' narrative propaganda collapsed, as we see clearly on display a performative anti-social nuisance!",
                "author": "BeetlejuiceForSenate"
            },
            {
                "raw_content": "If Elon didn't purchase twitter, none of these videos would have seen the light of the day.",
                "author": "PeaceMakerDJT"
            },
            {
                "raw_content": "Lies flow from the lips of leftists to the point that it's clearly habitual at this point. 1) \"She was just dropping someone off!\" - Yes, her \"\"\"\"\"wife\"\"\"\"\" who specifically got out to agitate and cause a scene and record it to signal her leftoid virtue. 2) \"She didn't know who they were!\" - And yet both of them are screaming at the agents who are both marked and in cars with flashing lights, and they outright were there to antagonize. 3) \"She was waving them through!\" - At no point does she actually do that, and who cares if she did? Is she authorized to direct traffic? 4) \"They told her to leave!\" - She's literally being shouted at to get out of the car. 5) \"She was scared!\" - She has a giant grin on her face the entire time. 6) \"She didn't move an inch until she turned all the way!\" - And yet you can clearly see the wheels spin, pointed straight forward, as she floored it initially but slipped on the ice and the traction control saved it from moving. 7) \"The officer was nowhere near the front of the car!\" - I love how this one evolved, from 'he wasn't near' to 'okay he was near but she wasn't going to hit him' to 'okay she hit him but he could've dodged'. 8) \"She had her family in the car!\" - Literally just her and a dog. 9) \"She was a mother of three!\" - Yeah and lost custody of two of them, had decided going to prison to agitate ICE was more important than being there to raise her kid, and besides, so did half the women who are dead at the hands of the very illegal immigrants she's out there defending. 10) \"She was a LEGAL OBSERVER!\" - Legal Observer isn't a real thing, and she wasn't anyway. 11) \"He was untrained!\" - Agent basically channeled Deadshot with that draw. 12) \"She was just trying to turn around to leave!\" - It's a one-way street, how did her car get sideways in the road if it wasn't intentional? What'd I miss? I'm literally at the point where I simply don't care about liberals anymore. I just want them gone, forever.",
                "author": "ICEisNICE"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Intel showed up for consumers at the 'Consumer Electronics Show;' AMD didn’t",
        "score": 39,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Consumers electronics show: \"We don't care about you anymore, goodbye.\"",
                "author": "MotherFunker1734"
            },
            {
                "raw_content": "Consumer electronics = AI AI AI Datacenters Datacenters",
                "author": "SpecialistLocal416"
            },
            {
                "raw_content": "CES = Corporate Electronics Show. AMD must have got the wrong memory thinking it should be selling AI.",
                "author": "BlueSiriusStar"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "GPU crisis hits Japan as RTX 5060 Ti and up are in short supply — GPUs sell out as soon as they arrive",
        "score": 5,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hello imaginary_num6er! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "People really need to pay attention. Since China it's catching up - and sometimes surpassing - the US, *'Mericaaaaaa* decided to fuck all the world trying to contain them. Memory? GPUs? Look how much the cost of metals rised! Copper and aluminum prices are on the roof.\\ Your cards will be least of your worries, even coolers and fans will cost more.",
                "author": "Dementia13_TripleX"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "I Tried a 6K Gaming Monitor From Samsung - Does it Make Sense?",
        "score": 16,
        "text_content": "Love there's more 5k 27\" and 6k 32\" IPS models with matte coatings, always happy consumers have more options. Hope there's options with lots of mini-LEDs that have good tuning too, including in SDR mode.",
        "comments": [
            {
                "raw_content": "If this is OLED, it is an instant buy for me.",
                "author": "milk-jug"
            },
            {
                "raw_content": "where even get 3D content? new gpus dont even support the old games that had 3D.",
                "author": "EmilMR"
            },
            {
                "raw_content": "The answer is always no. A monitor doesn't make anything. That's not what it was supposed to be for.",
                "author": "Repulsive_Music_6720"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Google Willow: The secrets of the world's most powerful quantum computer",
        "score": 3,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Hands-On with DLSS 4.5 vs 4 Image Quality & 6X Dynamic Frame Gen",
        "score": 68,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Looking forward to Tim’s full breakdown of DLSS4.5 upscaling. His recent DLSS/FSR/XESS analyses have been the gold standard for judging the gains, regressions, and comparisons of these techniques. That said, DLSS4.5 feels significantly more complex to evaluate properly. DLSS4.0-4.5 is a far messier transition than DLSS3-4.0, there's highly variable frametime cost depending on not just input/output res but GPU architecture as well, the per-game image quality improvements/regressions compared to DLSS4.0 seem wildly inconsistent, there's that odd pseudo-oversharpening artifact especially noticeable at 1080p, it's all rather unintuitive now compared to the rather simple duality of DLSS3CNN vs DLSS4-T. And so on. Hoping the full video manages to cover all these nuances.",
                "author": "KekeBl"
            },
            {
                "raw_content": "This is more positive than their previous video.",
                "author": "siraolo"
            },
            {
                "raw_content": "Glad to see Tim defend the concept of bumping frame interpolation ratios from 4 to 6 for 500Hz+ monitors. It's not surprising given his knowledge of motion portrayal coming from his experience testing monitors including very high refresh rate ones. But it's nice to see integrity where it would have been easy to pander to the audience and shit on frame generation.",
                "author": "2FastHaste"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "dexxIT, together with ZTE, is bringing CXMT memory to Germany for the first time",
        "score": 56,
        "text_content": "German company dexxIT announced that it will be shipping AMD EPYC 9124–based servers equipped with 24 modules of 64 GB DDR5-5600 RAM made by CXMT. This makes dexxIT one of the first distributors to bring CXMT’s products to market Machine translation available here: https://www-dexxit-de.translate.goog/dexxit/dexxit-bringt-zusammen-mit-zte-erstmals-cxmt-speicher-nach-deutschland/?_x_tr_sl=de&_x_tr_tl=en&_x_tr_hl=en-US&_x_tr_pto=wapp",
        "comments": [
            {
                "raw_content": "Good. Samsung, Hynix and Micron need to be slapped hard for taking money from OpenAI to sell memory they haven't produced yet to power GPUs that haven't been made yet for datacenters that haven't powered on yet, all because stock prices have gone up.",
                "author": "TwoTimeHollySurvivor"
            },
            {
                "raw_content": "Personally I‘m interested to see how their product is gonna perform, especially in regards to timings and sub-Timings. Hoping we get some crazy sys admins trying to OC these at some point The press statement also talks about quick delivery times, indicating decent availability",
                "author": "ThePresident44"
            },
            {
                "raw_content": "Is there a price difference? Has buildzoid got any CXMT RAM yet?",
                "author": "vegetable__lasagne"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "This would be my ideal version of the new joycons",
        "score": 860,
        "text_content": "I get that they want to differentiate the aesthetic from the Switch 1 and make it seem more mature, but not being able to see the colors on handheld besides the very little near the driftstick is a lil underwhelming. A minimalist gradient looks so much better and true to Nintendo while still feeling \"mature\" and classy.",
        "comments": [
            {
                "raw_content": "Now this I could get behind, do hope they go in this direction for the immediate Future.",
                "author": "Sea_Macaron_8789"
            },
            {
                "raw_content": "Ps5 version just releases the gradient black pop neon colors",
                "author": "ejcitizen"
            },
            {
                "raw_content": "Color would fade on the controller, but the stark change to black would clash IMO with the console. I'd prefer solid colors for the buttons, black controllers. No fading anywhere. These are still cooler than what we have though lol",
                "author": "Fresh-Chemical-9084"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "What's everyone playing this weekend?",
        "score": 229,
        "text_content": "Full Metal Schoolgirl and watching football",
        "comments": [
            {
                "raw_content": "Fire Emblem: Path Of Radiance. Aged well!",
                "author": "Revolution64"
            },
            {
                "raw_content": "I just finished the Dragon Quest 7 demo and now I'm sad 😔",
                "author": "The_Invisible_Hand98"
            },
            {
                "raw_content": "Wind waker on nso, just finished it! Some parts were a bit of a slog tbh and outdated, but at its best it was peak zelda",
                "author": "grossbard"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Is this a good micro SD card for Switch 2?",
        "score": 73,
        "text_content": "I’m looking to buy some more memory for my Switch 2 and I was wondering how are these SD cards compared to other brands?",
        "comments": [
            {
                "raw_content": "As long as you didn't overpay, any (authentic) Express card should be fully sufficient.",
                "author": "SirImpossible7969"
            },
            {
                "raw_content": "You can currently buy a sandisk 512gb card for $99 at Walmart. Walmart sells Onn 512gb for cheaper. At less than $90",
                "author": "Garamenon"
            },
            {
                "raw_content": "They are made by Lexar. I have the 1TB one and it has been working fine for me.",
                "author": "VolitarPrime"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo's official website confirms that Animal Crossing: New Horizons will get a free Switch 2 upgrade alongside the Nintendo Switch 2 Edition. It will increase resolution ONLY in portable mode.",
        "score": 666,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Almost every switch 1 game should get this exact update. 720p stretched to a 1080p display just looks plain bad. It rendering at 1080p directly instead is gonna be a big improvement. Luckily Animal Crossing didn't already use upscaling on the switch 2, otherwise it would have looked horrible instead of just bad (looks at the Xenobalde games which _still_ haven't got an update to fix the handheld resolution)",
                "author": "Sinomsinom"
            },
            {
                "raw_content": "Wait, free upgrade increases resolution in handheld only but paid increases resolution in docked and handheld?",
                "author": "temporary_location_"
            },
            {
                "raw_content": ">**Animal Crossing™: New Horizons** >**Update available:** January 15, 2026 >**Updates included:** >*Visuals: Optimized for the Nintendo Switch 2 display and improved image quality.*",
                "author": "Joseki100"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "RDR1 looks great on Switch 2!",
        "score": 457,
        "text_content": "I just tried it, and the graphic doesn't look like the game from 15 years ago, also the frame rate is very stable. Definitely worth trying.",
        "comments": [
            {
                "raw_content": "I really love this era of graphics. Something about how detailed it was but the world wasn't cluttered by filler set dressing objects.",
                "author": "effhomer"
            },
            {
                "raw_content": "Could I buy the Switch 1 physical copy and then be automatically able to get a switch 2 update (for free), or would I need to purchase the digital switch 2 version?",
                "author": "Ducky-Tie"
            },
            {
                "raw_content": "Now all we need is rdr2",
                "author": "JakeTheSmall"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "So I guess yakuza kiwami 1 and 2 will be on sale forever?",
        "score": 11,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Dosent look like there's a specific sale for it, just that buying the bundle saves you $10. Pretty common for game bundles to be a slightly better deal than buying individually.",
                "author": "sargentcloset"
            },
            {
                "raw_content": "Most bundles have a discount or include DLC so yes this will be here for the foreseeable future. For those who haven’t played Yakuza yet, I recommend starting with Yakuza 0.",
                "author": "mmmcookiesss"
            },
            {
                "raw_content": "Sadly won't be on sale when cyberpunk 2077 becomes real",
                "author": "jrpbateman"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Will 2026 be the year?",
        "score": 226,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Probably gonna get insanely downvoted, but I feel the future of Star Fox should derive from Adventure and becoming something similar to Star Wars Outlaw.",
                "author": "Most-Handle9776"
            },
            {
                "raw_content": "Man. Another starfox would be so sick.",
                "author": "BobaF4t"
            },
            {
                "raw_content": "I really want one on foot StarFox. Like character action game. But assault is good too.",
                "author": "Independent_Aerie_44"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "My Nintendo Switch 2 home",
        "score": 52,
        "text_content": "Our friend just made me the Link and Zelda crochet stuffies!",
        "comments": [
            {
                "raw_content": "Id knock everything over each time I took it out",
                "author": "at-m1"
            },
            {
                "raw_content": "Hello! Welcome to r/NintendoSwitch2! Your post has been sent to the moderators for review. To help manage spam, trolling, and repetitive posts, we restrict new posts from accounts that do not have much comment karma earned in this subreddit. Please contribute through comments on other posts in the meantime. If you are trying to ask about an issue with your Switch console or otherwise seeking help, you may want to check out the peer support community at r/NintendoSwitchHelp. You can find our rules here: https://www.reddit.com/r/NintendoSwitch2/wiki/rules *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NintendoSwitch2) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Those are awesome! 🙂👍",
                "author": "Forstmaschine"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Jez Corden [Xboxtwo]: Age of Empires is going to back in a big way\". Next title is under development with Unreal Engine due the difficult to adapt Essence Engine (proprietary Engine of RELIC Entertainment) to Age of Empires. Microsoft is interested to bring back StarCraft as RTS.",
        "score": 449,
        "text_content": "Source [https://www.youtube.com/live/-iRcYtswLDw?si=9H2V4m4beKIWO-vF](https://www.youtube.com/live/-iRcYtswLDw?si=9H2V4m4beKIWO-vF) (From 2:11:00 - 2:14:00) A really interesting episode of Xboxtwo by Jez Corden and he corroborate the recent rumors on next Age of empires title and also something info about the new StarCraft game, a third persone shooter: according to Jez who has seen a gameplay video, It looks Amazing and It could remind Space marine. About Age of empires and XBOX's efforts on Real time strategy Games. i don't know a great deal but i will say this \" i think it's being developed on Unreal Engine because one of the big issues they had with Age Of Empires 4, from what i heard, was Relic's Engine and this engine and development pipeline was very difficult for them to work with and to adapt to the Age of empires, what people expect from Age of Empires. So they (World's Edge) are moving to something more proprietary built on Unreal Engine though. Something more custom and things like that. i don't know who's building it but at least the bones are being made by World's Edge Studios. I would presume they're going to partner with another developer on it\". Again \"\"Age of Empires remains one of Microsoft's most prolifics IPs and they've really cornered that niche, the whikw real tielme Strategy that it doesn't have the same popularity that it did back in the day. But as Xbox moves deeper into PC gaming i do think like Age of Empires and games like it are definitely going to be a Major part of their purview. And another thing i'll say by the ways, is that they are interested in also bringing StarCraft back as an RTS altough the next StarCraft i expect will be the third person shooter wich i've actually seen gameplay footage of the next StarCraft and it looks stunning. if you enjoy games like Space Marine , the StarCraft fans are going to gave a lo look forward to. But they want to bring back StarCraft as an RTS as well. Microsoft obviously wants to continue cornering the RTS audience. Age of Empires is still a big deal for Microsoft and it's going to back in a big way\".",
        "comments": [
            {
                "raw_content": "#Jez Corden is a Tier 2 - Generally Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Listen, free money = Age of Middle Earth.",
                "author": "burohm1919"
            },
            {
                "raw_content": "They have done a service to RTS genre. AoE 2 still gets content updates after around 20 years. AoE 4 also released and still getting content updates. AoM Remake got released and all of them have good reviews and healthy player base.",
                "author": "LogicalError_007"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Talked with Jez Corden About Prototype IP, he denied it",
        "score": 112,
        "text_content": "Jez Corden:There's currently no plans for the Prototype IP as of right now, anyone who claims otherwise is sadly misinformed. Need to point that prototype subreddit modder partly against the conclusion that credits update meaning something about this franchise https://xcancel.com/DailyDeatholder/status/2009247584360059187#m",
        "comments": [
            {
                "raw_content": "#Jez Corden is a Tier 2 - Generally Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "There’s really been no indication otherwise.",
                "author": "SoldierPhoenix"
            },
            {
                "raw_content": "Kinda nuts to me if no one comes up to do something with it, considering how much superhero(or antihero ig) media is popular in general rn.",
                "author": "ExAshura"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "AMD shows first renders of Ryzen AI 400 for AM5 socket",
        "score": 121,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And just like that… not a f\\*ck was given. ![gif](giphy|RVW5PilbP2tLG)",
                "author": "Hrmerder"
            },
            {
                "raw_content": "Could make for a pretty decent light, power efficient home server. If the ram prices come back down :(",
                "author": "niwtskeap"
            },
            {
                "raw_content": "they should just name it a 9700g and call it a day. anyone who wants this for \"AI\" instead of gaming will know to buy it. this 400 nonsense on desktops just causes more confusion for pc gaming builders. am5 socket is only half the story, as we still don't know what bios will backwards support this igpu. i mean if i have to get a new mobo simply for the bios change, what difference does it make to me what socket it's using. bottom line for me is; if my b650 ever gets updated to support this \"9700g\", i would get it, even if it means i have to change my ram stick timing to make it work (sell my current 6000 sticks for something with some other cas timing etc).",
                "author": "stonecats"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Mortgage rates drop to lowest level in nearly 3 years as Trump orders buying of $200 billion in mortgage bonds",
        "score": 175,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">“This is not enough to really get the market going because we know people can’t qualify even at 4.99%. They can say that the mortgage rates are going to go down to below 5, but we have people that still can’t qualify at 4.99%, so I think there’s more work to be done,” Zelman said. So much for that.",
                "author": "fatfiremarshallbill"
            },
            {
                "raw_content": "[removed]",
                "author": "None"
            },
            {
                "raw_content": "home prices are prohibitive, it was never the mortgage rates that were the issue. Asking people to take out loans for 6x their salary over 20-40 years means insane interest already, but it also means people need to work to save up large sums of money. But housing being a business means that even renting, they're paying absurd prices just to survive. We need starter homes to be built, but builders make more off of $500k+ homes and so they don't build starter homes, which means more and more people are competing for less and less available homes, many of which are being held as rentals.",
                "author": "Practical-Ad-2387"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "US household wealth hit record in third quarter 2025, Fed data shows",
        "score": 54,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Because the top of the curve is skewing the average.",
                "author": "Kriznick"
            },
            {
                "raw_content": "Household Net Worth The net worth of households and nonprofit organizations increased by $6.1 trillion to $181.6 trillion in the third quarter. The value of directly and indirectly held equity on the household balance sheet increased by $5.5 trillion in the third quarter, while the value of directly and indirectly held debt securities rose by $0.4 trillion. The value of owner-occupied real estate decreased by $0.4 trillion, as house prices declined slightly in the third quarter. https://fred.stlouisfed.org/series/BOGZ1FL192090005Q",
                "author": "SnortingElk"
            },
            {
                "raw_content": "So many continue to pay down their cheap loans",
                "author": "TrainDifficult300"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Residential Construction Falls to Post-Pandemic Low",
        "score": 46,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Slowing construction is bad. See post 2008 under building causing 2020 pandemic inventory shortage and skyrocketing prices. Only way to lower prices long term is building more and increasing supply",
                "author": "Whole-Reserve-4773"
            },
            {
                "raw_content": "I literally just heard, this morning on the news, that home building in Los Angeles has nearly stopped, as ICE agents are seizing the workers needed to build housing. I've heard home builders on Reddit say their employment staff is trained with many years of experience, so no, those workers cannot be replaced by the typical unskilled person who has done nothing but flip burgers.",
                "author": "RealisticForYou"
            },
            {
                "raw_content": "Residential construction activity slowed dramatically in the fall, reaching a five-year low in October amid the federal government shutdown, a delayed report reveals. Total housing starts were at a seasonally adjusted annual rate of 1.246 million in October, down 4.6% from September and 7.8% less than a year earlier, the U.S. Census Bureau reported on Friday. The October figure, delayed by several months due to the shutdown, was the lowest level for housing starts since May 2020, during the heart of COVID-19 lockdowns. https://www.census.gov/construction/nrc/current/index.html The decline was driven by a sharp decrease in multifamily construction, with starts on buildings with five units or more falling almost 25% on the month to a five-month low. Single-family starts, on the other hand, rose 5.4% on the month to an annualized 874,000 pace, though they remained near their lowest level in two years. \"All told, this delayed but much anticipated data release paints a bit of a gloomy picture for home construction that is driven by builders’ lack of confidence in their ability to sell homes at a price that makes it economically viable for them,\" says Realtor.com® senior economist Joel Berner. \"What’s plaguing the market in 2025 is uncertainty.\" Homebuilder sentiment remains low despite recent rate cuts at the Federal Reserve, with builders reporting headwinds from high materials costs and weak demand from buyers who are struggling with affordability and uncertain about the economy. Overall builder confidence in the market for newly built single-family homes remained low at 39 last month, according to the National Association of Home Builders/Wells Fargo Housing Market Index. Any reading below 50 reflects negative sentiment about the market. \"The housing market is struggling with trepidatious buyers, leading to an inventory glut and rising time on market, especially in the South and West, where a majority of new homes are built,\" says Berner. \"Builders, in response, are pulling back.\" In recent days, President Donald Trump has renewed his vow to tackle the housing affordability crisis, proposing a ban on institutional investor ownership of single-family homes. Trump also said on Thursday night that he had directed Fannie Mae and Freddie Mac to purchase $200 billion in mortgage-backed securities, a move intended to bring mortgage rates lower. \"This will drive mortgage rates down, monthly payments down, and make the cost of owning a home more affordable,\" he promised on his Truth Social site. \"It is one of my many steps in restoring affordability, something that the Biden administration absolutely destroyed.\" Permits rise off August low, offering hope of a rebound The new census report, delayed by several months due to the government shutdown, is the first reading on residential construction activity since August, and includes combined results for September and October. The report shows that permits, a sign of future construction activity, rose 6.4% in September from the five-year low reached in August. Permit activity was little changed in October, down just 0.2% from the September level. The September uptick breaks a five-month streak of declines that marked the longest stretch of falling permit activity since late 2008, when the housing crash and Great Recession all but halted new building activity. Permits rose in September for both single-family homes (+2.6%) and multifamily buildings with five units or more (+14%). In a positive sign, the strongest permitting gains for all project types were in the inventory-strapped Northeast, where they were up 5.8% year over year. \"This is an encouraging sign that builders are responding to price signals that show new-home demand is the strongest in that region,\" says Berner. Meanwhile, the sharpest decline in permits was among single-family homes in the West, where inventory now exceeds pre-pandemic levels, and the price premium on new-construction homes compared with existing homes is low. \"Again, we see the market working as intended, attracting builders to parts of the country where housing is most needed and their profits can be higher,\" says Berner.",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Are today’s US house prices hiding a historic debt problem, like the UK?",
        "score": 14,
        "text_content": "I recently started a discussion in a UK subreddit about the housing crisis called: *“Is the supply/demand narrative masking a historic debt problem as the cause of high house prices?”* [https://www.reddit.com/r/HousingUK/comments/1q78luh/comment/nytv7sd/?context=1](https://www.reddit.com/r/HousingUK/comments/1q78luh/comment/nytv7sd/?context=1) Reddit suggested I share it here too. I’m not sure if this counts as a re-post, so I’ll just link it for context. The discussion includes references to a BBC Money Programme undercover investigation from 2003 and a thread debate on the topic. I've given the links to the BBC programme below, in case you want to access it quickly. There are striking parallels between the housing situation in the UK and the US today, and with the sub-prime era of the 90s/00s. My suspicion is that a portion of the high house prices in the US, as in the UK, reflects equity that was never “cleared” after 2009. Instead, it remained in the system and has compounded over the last couple of decades. This equity was originally due to borrowers lying about their incomes on Stated-income mortgage forms (\"liar loans\") which required no income verification. 'Stated-income mortgage' was the equivalent of 'Self-certification' in the UK. It would be interesting to hear whether US homeowners and economists see similar structural leverage driving prices, beyond simple supply-and-demand explanations. **(1) BBC Money programme - \"Mortgage Madness\" (29/10/2003)** (1/3) [https://www.youtube.com/watch?v=vT1UnGS91BY](https://www.youtube.com/watch?v=vT1UnGS91BY) (2/3) [https://www.youtube.com/watch?v=sGbd95Ac1D4](https://www.youtube.com/watch?v=sGbd95Ac1D4) (3/3) [https://www.youtube.com/watch?v=\\_OAc6JRb3Bg](https://www.youtube.com/watch?v=_OAc6JRb3Bg)",
        "comments": [
            {
                "raw_content": "I don’t know about your theory but something is definitely up. I know politicians are stupid but not this stupid. We have a supply problem in the housing market but every single administration, republican or democrat, has been trying to solve the demand problem. They find all sorts of ways to make it possible for people to buy. So I think there’s definitely another unseen force that is manipulating our government.",
                "author": "Aggressive_Chicken63"
            },
            {
                "raw_content": "The national debt has quadrupled since i bought my house, but my house has only doubled in price. My pay has 5x’d. So i dont know that its all inflation but probably a lot.",
                "author": "HeKnee"
            },
            {
                "raw_content": "There's a debt problem all right, but it's a government debt problem. [House prices have followed the total money supply slavishly since 2010.](https://i.redd.it/9oaxpwowv59d1.jpeg), as govts expand the money supply and spend like a drunken sailor buying a Corvette for his stripper girlfriend. The 2000s were a bubble - you can see that on the chart. Today's prices aren't in a bubble, they're just matching the rate of inflation (which is far higher than what governments are reporting for \"consumer inflation\"). The real question is why are wages are not matching inflation as well.",
                "author": "ThisKarmaLimitSucks"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "10 January 2026 - Weekly /r/REBubble Discussion",
        "score": 2,
        "text_content": "What's the word on the street? Share your questions, comments, and concerns below.",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Musk's X to open source new algorithm in seven days",
        "score": 91,
        "text_content": "According to Reuters, X plans to **open source** its recommendation algorithm, including how organic and paid posts are ranked. Musk says this will be **repeated every four weeks** with detailed change logs. If this actually happens, it would be one of the **first** large social platforms to expose its ranking logic publicly. **Do you think open sourcing the algorithm increases trust or will it just make the system easier to game?** **Source: Reuters** 🔗: https://www.reuters.com/business/media-telecom/musks-x-open-source-new-algorithm-seven-days-2026-01-10/",
        "comments": [
            {
                "raw_content": "Does anyone care? Everyone I know only uses the 'following' tab as for you tab is 100% spam.",
                "author": "JackStrawWitchita"
            },
            {
                "raw_content": "The platforms recommendation system is garbage already. Explicit ads, spam ads, AI ads. For You page is just engagement farming completely or bot accounts. So realistically it doesn't matter.",
                "author": "Haunting-Dare-5746"
            },
            {
                "raw_content": "How can we be sure that that’s actually the algo being used without internal overrides?",
                "author": "nodeocracy"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "True",
        "score": 784,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I just won myself the thermostat battle - claude wrote me a script which connects to my smart thermostat and which automatically resets the temp to my preset, only minutes after someone who is not paying the heating bill turns it up. Vibe coding FTW.",
                "author": "Economy-Fee5830"
            },
            {
                "raw_content": "True :)",
                "author": "Healthy-Nebula-3603"
            },
            {
                "raw_content": "I'm just a hobby solo game dev wannabe, never finished a single game, took years and years to learn enough to do anything interesting in Python. I have these awesome stories buzzing around in my head with no feasible way to make them. Cut to three days ago when I decided to try using chatgpt to help me learn to use Godot and supply the code for the various aspects I have no idea how to script. I instruct it to comment the hell out of every line of code it writes so I can learn as I read through it. We solve errors together fairly quickly. Not only do I have a personal tutor in Godot who will help me make exactly the type of game I've been dying to, it's given me enough of a confidence boost to go hunting for tutorials that expand my understanding even more. Tutorials that I would have felt completely overwhelmed by if I didn't have chatgpt to ask every question that popped into my head. Vibe coding may end up leading me into actually being a competent game developer.",
                "author": "8bitRawr"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "GPT-5.2 Solves *Another Erdős Problem, #729",
        "score": 416,
        "text_content": "As you may or may not know, Acer and myself (AcerFur and Liam06972452 on X) recently used GPT-5.2 to successfully resolve Erdős problem #728, marking the first time an LLM resolved an Erdos problem not previously resolved by a Human. \\*Erdős problem #729 is very similar to #728, therefore I had the idea of giving GPT-5.2 our proof to see if it could be modified to resolve #729. After many iterations between 5.2 Thinking, 5.2 Pro and Harmonic's Aristotle, we now have a full proof in Lean of Erdős Problem #729, resolving the problem. Although a team effort, Acer put MUCH more time into formalising this proof than I did so props to him on that. For some reason Aristotle was struggling with formalising, taking multiple days over many attempts to fully complete. Note - literature review is still ongoing so I will update if any previous solution is found. link to image, Terence Tao's list of AI's contributions to Erdos Problems - [https://github.com/teorth/erdosproblems/wiki/AI-contributions-to-Erd%C5%91s-problems](https://github.com/teorth/erdosproblems/wiki/AI-contributions-to-Erd%C5%91s-problems)",
        "comments": [
            {
                "raw_content": "When I sent Erdos 728 to chat GPT it asekd if I wanted to work with it to solve 729 because of the similarities. Kinda interesting.",
                "author": "Tkins"
            },
            {
                "raw_content": "Gpt killing it. Congrats",
                "author": "Kooky_Tourist_3945"
            },
            {
                "raw_content": "Erdos was an OpenAI shill who secretly solved the problems and gave the solutions to Sam Altman's grandfather. This is all a marketing stunt",
                "author": "averagebear_003"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Defenderbot ends CES with a glitch",
        "score": 119,
        "text_content": "",
        "comments": [
            {
                "raw_content": "it's got a bad motivator",
                "author": "emteedub"
            },
            {
                "raw_content": "That leg movement could have hurt someone pretty bad for the sound of it",
                "author": "Walkin_mn"
            },
            {
                "raw_content": "It comes with a convenient carrying handle for just such occasions.",
                "author": "hawkwings"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Anthropic vs OpenAl vibes",
        "score": 304,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Its so wild watching people pick teams on this. Its like watching Nintendo v Sega v Sony v Microsoft console wars. 1. They're all massive companies that don't give a shit about you. 2. Just pick the most recent model since its the best.",
                "author": "jefftickels"
            },
            {
                "raw_content": "Take it in the success of ChatGPT is the reason why Anthropic was able to secure funding after funding You can thank OpenAI for their ability to survive while being behind",
                "author": "MTheModernist_"
            },
            {
                "raw_content": "🎯 i think OpenAI has become cartoonishly commercial but i guess it's expensive to keep the lights on",
                "author": "orangotai"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Meta makes nuclear reactor history with ‘landmark’ 6.6 GW deal to power AI supercluster",
        "score": 144,
        "text_content": "Meta has signed a series of agreements to secure up to **6.6 gigawatts of nuclear power** to run its next generation AI infrastructure, including its Prometheus AI supercluster in Ohio. The deals involve **Oklo**, **TerraPower** and **Vistra** covering both new advanced reactors and upgrades to existing plants. Meta says the goal is to secure **24/7 carbon free firm power** to meet the massive energy demands of large scale AI systems without relying on intermittent sources.",
        "comments": [
            {
                "raw_content": "Holy crap haha that is awesome 😎 Meta refuses to not be involved in AI (and it's the right choice imho)",
                "author": "Revolutionalredstone"
            },
            {
                "raw_content": "They keep investing money on it yet are so far behind even xAI and Grok make them look like a joke, I sincerely hope they have something up their sleeve for the near future",
                "author": "LightVelox"
            },
            {
                "raw_content": "This should be online and active about a decade from now. Edit: LOL I said this before looking at the article. They actually are saying this won't be done until 2035. Add 5 years onto that at minimum",
                "author": "awesomeoh1234"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "I feel like I can learn anything thanks to AI",
        "score": 26,
        "text_content": "A few days ago I came across this: [AI tutoring outperforms in-class active learning: an RCT introducing a novel research-based design in an authentic educational setting](https://pmc.ncbi.nlm.nih.gov/articles/PMC12179260/), and it made me slightly sad because, upon reflection, I realized that I didn't suddenly become 10x smarter, but rather that AI has been supercharging my learning. Aside from the obvious stuff, like being able to search for information far quicker or generate custom-made explanations, there's another point I'd like to touch upon. All throughout my education I suffered from terrible anxiety and a “competency complex”. This made it very difficult for me to ask questions for fear of appearing “stupid” or “hopeless”. This extended into my first job too and eventually resulted in me being fired because I was “that guy” who’d rather spend hours trying to self-teach rather than just asking. Since then I’ve forced myself to act in spite of this fear, but the terror has not gone away. I regularly entertain negative scenarios where whoever I asked has now written me off as an idiot with zero common sense and no capacity to think for themselves. I love to learn, I want to grow, I absolutely despise asking. This, as you might imagine, has made it hard for me to study things in my leisure time. At work it’s a lose-lose situation: either I ask and look stupid, or I don’t ask, underperform, and then look stupid anyway. Outside of work it’s different. I don’t need to ask questions online and risk being humiliated; I can just make up untested assumptions about the things I don’t know or understand yet and carry on bumbling through whatever I’m trying to learn. Sure, I should probably ask someone, but that’s scary, why would I do that? When these assumptions collapse, I can just give up, doomscroll, and repeat the cycle a few months later. And this is why I really appreciate AI as a study aide. I’m never scared interacting with it. It’s not going to tell my coworkers that I’m secretly a fraud, nor is it ever going to call me an idiot and instruct me to give up on studying. Instead, it writes everything out, encourages me to ask more questions, precisely analyzes my mistakes, gives me sources for all of its information if I ask, never calls my questions stupid, and works at exactly my pace. This is priceless. AI is the best tutor (well, the only one. I’ve always been too scared of real ones) I’ve ever had. I’m genuinely envious of those who have access to this tool whilst still in their education. Now, that being said, they’re not perfect. Occasionally GPT-5.2 will make a mistake here or there, but I think I’ve spotted all the contradictions that have appeared so far. After all, I’ve been blazing through textbooks and acing the practice questions. My performance at work has skyrocketed. Not because I’m blindly following instructions, but because my AI-assisted self-study outside of work has been paying dividends. I even have debates with AI about the news. This is in stark contrast to how people typically deride LLMs as a tool to outsource thinking. For me, it’s the opposite. I’ve never been able to accomplish so much.",
        "comments": [
            {
                "raw_content": "Not sure why the comments are giving you such a hard time. Although the phrase \"not because... but...\" being very LLM-like might have something to do with it. I have the same experience, LLM's are amazing for fact-checking, researching new topics and learning in general. I'm learning heaps more just because the barrier of entry is so low. Can learn about an interesting topic in 5 minutes instead of 20.",
                "author": "AgentStabby"
            },
            {
                "raw_content": "I’m wonder how much more I would know if I had AI as a kid. I was so curious, I think having it as a personal tutor would have really accelerated my learning. I still find it helpful for learning but supposedly those early years are transformational. Or maybe I’m better off having struggled through things. I’m not sure. I’m very curious how kids these days end up, cracked, or helpless",
                "author": "Inevitable_Tea_5841"
            },
            {
                "raw_content": ">This is in stark contrast to how people typically deride LLMs as a tool to outsource thinking Much of education and academia feels under siege from AI cheating. And sure, when people perceive education as a system they must pass through to get a degree, they'll use any available means to get to that end goal. But for folks who enjoy learning for the sake of learning (or who need to actually understand things to perform a job), it's an entirely different story, which usually doesn't get told. Thanks for sharing your experience. Enjoy the self-study, and don't let any haters get you down.",
                "author": "xirzon"
            }
        ],
        "subreddit": "singularity"
    }
]