[
    {
        "post_name": "Epstein: \"I would like to set up some HD cameras so that i can log on and see from anywher in the world\" Ruan: \"will an 8 camera system be enough to cover all locations you wish to survey\"",
        "score": 248,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Epstein is a Jew.",
                "author": "TiggerLovingPooh"
            },
            {
                "raw_content": "If I recall, Epstein had lipstick cameras hidden everywhere. But they were also kinda in plain sight. He knew the people that he was about to blackmail could tell, and he'd get off to that.",
                "author": "TheVanNuys"
            },
            {
                "raw_content": "\"Four and five stars\" his guy was searching on Amazon for this system? Seems kind of .. ghetto for someone with hundreds of $millions.",
                "author": "chickeninoven"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "YOU KNOW WHAT THE BIGGEST CRIME COMMITTED BY TRANS DUDES IS?",
        "score": 260,
        "text_content": "",
        "comments": [
            {
                "raw_content": "that's a lol, but the crime is grooming children and school shooting",
                "author": "Raetchel"
            },
            {
                "raw_content": "kek",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "They are their own worst enemy, like every other commie.",
                "author": "ColonelKlink"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This isn't getting coverage in the media but the gun person who allegedly fired upon and tried to kill a Border Patrol agent in New Hampshire is trans. This is the third trans shooting this month. \"Blu Daly\" is the trans name for Cullan Zeke Daly.",
        "score": 82,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The attack is eerily similar to the neighboring Vermont deadly shooting attack on a Border Patrol agent last year by trans suspect Teresa Youngblut. https://thepostmillennial.com/andy-ngo-reports-trans-terror-trans-duo-revealed-as-suspects-in-killing-of-a-vermont-border-patrol-officer https://x.com/MrAndyNgo/status/2026843484754215388?s=20",
                "author": "Capoditutticapi1"
            },
            {
                "raw_content": "Using the term gunperson to describe a trans shooter should be mainstreamed. #ARCMPAB",
                "author": "Scatter-Shot"
            },
            {
                "raw_content": "This transgression will not stand, ma'am.",
                "author": "TiggerLovingPooh"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: US Capitol Police ARRESTED Ilhan Omar’s State of the Union guest after she REFUSED to stop standing and BLOCKING others in the gallery during Trump’s speech This is the SAME deranged activist arrested in Minneapolis for using her car to BLOCK ICE agents’ cars on a street.",
        "score": 826,
        "text_content": "",
        "comments": [
            {
                "raw_content": "BREAKING! BOOM! BOMBSHELL!",
                "author": "Electrocutioner"
            },
            {
                "raw_content": "&#65038; # &#8199; &#8199; &#8199; D&#65038; # &#8199; &#8199; &#8199; E&#65038; # &#8199; &#8199; &#8199; P&#65038; # Ilhan Omar # &#8199; &#8199; &#8199; R&#65038; # &#8199; &#8199; &#8199; T&#65038; &#65038;",
                "author": "BallotsOnRubysUSB"
            },
            {
                "raw_content": "Cool, now arrest Omar.",
                "author": "BigMikesChef"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: FBI Director Kash Patel just FIRED 10 Deep State agents involved in seizing the PHONE RECORDS of Kash Patel and now-White House Chief of Staff Susie Wiles before Trump began his 2nd term",
        "score": 1262,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He’s only been director for 368 days or so. Slow clap good job you fired some people",
                "author": "gorilla_grip"
            },
            {
                "raw_content": "PROSECUTE. VIOLATION OF 4A. Fired.. pffft",
                "author": "Shitsbrokeyo"
            },
            {
                "raw_content": "The guy from India has been there a year, and the only big thing he did was to do something to people who were mean to him?",
                "author": "magnokor"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Tulsi Gabbard:The quiet moments are often the most important. Last night just before Cabinet members walked onto the House floor for the President’s State of the Union, we joined together in PRAYER",
        "score": 756,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They could start by implementing Trump’s mandate, codifying his executive orders and obeying the will of Americans.",
                "author": "Taqiyya_Mockingbird"
            },
            {
                "raw_content": "We are the most attacked group in the history of politics. But we have souls and believe in one God. With this, we will not be defeated.",
                "author": "DeltaSierra"
            },
            {
                "raw_content": "THIS is what The United States of America was FOUNDED on, our FAITH in the ONE and LIVING GOD!",
                "author": "forefatherstanding"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "OUTRAGEOUS: Florida House Democrats Oppose Bill Honoring TPUSA Founder Charlie Kirk — Insist He Was “Not Assassinated,” but Died from “Gun Violence”",
        "score": 682,
        "text_content": "",
        "comments": [
            {
                "raw_content": "When you use \"gun violence\" in a targeted murder by shooting someone with said gun from a rooftop during a speech it is called...an \"assassination.\" There really is no moving forward with these cunts. They're not Americans, they're terrorists, plain and simple.",
                "author": "Kamalaharrisisacunt"
            },
            {
                "raw_content": "I'm tired of their word games and ever-changing definitions. Fatigued, even.",
                "author": "wartooth6"
            },
            {
                "raw_content": "I pray that some day the American right will be 1/10th as extreme as the left pretends we are.",
                "author": "bejeavis"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "That's the face of someone who will royally fuck up sometime in the foreseeable future",
        "score": 1013,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I only see evil.",
                "author": "brutustyberius"
            },
            {
                "raw_content": "We should only ever post her covid masking bubble pic. Absolutely retarded bitch.",
                "author": "LawyersPlayDota"
            },
            {
                "raw_content": "We truly do live in some demonic times man",
                "author": "LegalAlien1776"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This is so funny; I laughed so hard! I needed that so much; feeling sad knowing we are up against these people and pray God hears our prayers that they fall into the very trap that they set for us.....",
        "score": 577,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You can't NOT laugh!",
                "author": "FredRedd"
            },
            {
                "raw_content": "Based!!!",
                "author": "TravisRSCX"
            },
            {
                "raw_content": "😂😂😂😂😂",
                "author": "TEXinLA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "DO it!",
        "score": 1775,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wait until they hear that people need valid ID to open up a checking account.",
                "author": "FromBilgewater"
            },
            {
                "raw_content": "Oh shit... This is a nuke on illegals, if this gets pushed thru it will be huge win for USA!",
                "author": "lostmypants"
            },
            {
                "raw_content": "The last bank account I opened I had to bring a who bunch of identification shit. How are illegals opening bank accounts?",
                "author": "Coprolite"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "‘Like An Award Show’: Democrat Senate Candidate Mocks Trump Honoring Veterans",
        "score": 820,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Honestly, leftists are straight from the pits of hell and you can’t change my mind. They love killing babies, love illegal alien rapist drug dealers, have no morals, support body mutilation, child grooming, endless fraud, etc.",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "These Dem retards don't seem to realize that a majority of people don't like seeing our military and vets disrespected. It would have been prudent to keep their mouths shut.",
                "author": "Stars-n-Stripes"
            },
            {
                "raw_content": "That's the thing, I wouldn't really say it was like an awards show though. The current-day emmys or grammys are complete shit and only known for staged \"drama\" involving gay black actors or fake musicians saying buzzwords. Cannot wait for next year's grammys where lizzo comes out, says \"fuck ice\" 20 times, then attempts and fails to have sex with the entire chicago bulls lineup.",
                "author": "IamM"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "REMINDER: All taxation is theft",
        "score": 1299,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Shit...now I have to hide my bottlecaps.",
                "author": "MericaFukYeah"
            },
            {
                "raw_content": "An alternative money supply would be nice. Something that all patriots agree to use.",
                "author": "RockyBalboa"
            },
            {
                "raw_content": "> And he puzzled and he puzzled until his puzzler was sore, maybe all taxation is theft and nothing more?",
                "author": "kek-is-tan"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: FBI raids Los Angeles school district headquarters and superintendent’s home",
        "score": 1345,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Guaranteed to find child porn.",
                "author": "JoeBidensDementia1"
            },
            {
                "raw_content": "Remember, this is the dude that BRAGGED that he was illegal. He told Team Trump to come after him, because he'd been illegal so long in the US, and had climbed the Dem ladder of patronage. It was a bold strategy, Cotton. Let's see how it plays out for him.",
                "author": "CleanUpPhillyTrump24"
            },
            {
                "raw_content": "Child 🌽 and probably a jerky dealer too!",
                "author": "Jetjockey"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Donald Trump wants to eliminate taxes for anybody making less than $150,000 a year",
        "score": 567,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How about no capital gains tax as well.",
                "author": "HyperCarbs"
            },
            {
                "raw_content": "According to \"Wild Video\"/@FightStorage?",
                "author": "Deplora"
            },
            {
                "raw_content": "No one is asking what the tax rate above 150k would be. Also keep on mind 150k today buys you what 75k did 10 years ago.",
                "author": "HanginChad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Former Harvard President & Barack Obama Treasury Secretary Lawrence Summers resigns from Harvard Over Ties To Jeffrey Epstein.",
        "score": 1366,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Funny they accuse our side of being the pedis when their side are the ones facing the repercussions of the Epstein Files! Good riddance!",
                "author": "HockeyMom4Trump"
            },
            {
                "raw_content": "Oy gevaIt! ... Has Larry a schtickle of credibility left?",
                "author": "loooooof"
            },
            {
                "raw_content": "Resigns?? And wexner still breaths. What a crock of shit.",
                "author": "MySidesGoUp"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "💸 𝐁𝐎𝐌𝐁𝐒𝐇𝐄𝐋𝐋: Sen. Eric Schmitt just DROPPED the hammer, CRIMINAL PROSECUTIONS are COMING for the massive fraudsters, and we’re talking potentially $𝟏 𝐓𝐑𝐈𝐋𝐋𝐈𝐎𝐍 stolen EVERY YEAR! -- “Minnesota, I think that’s the tip of the iceberg...\"",
        "score": 1329,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Oh, just fuck you at this point. **FUCK. YOU.** EDIT: Even downvoted you for BOMBSHELL. Simp.",
                "author": "MemeWarsVet"
            },
            {
                "raw_content": "Stop telling me they’re coming. Tell me when they are here. Two more weeks",
                "author": "Snooptwo"
            },
            {
                "raw_content": "So he's letting it be known he's ready for a bribe to make it disappear from public eye",
                "author": "BillGateCanSuckIt"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Rupert Lowe Is The Chosen One",
        "score": 854,
        "text_content": "",
        "comments": [
            {
                "raw_content": "End a rapey invader, then down the pub for a cheeky pint or six, and take bets on how many invaders we deported that week.",
                "author": "Wellingtons_Cone"
            },
            {
                "raw_content": "This would be huge, also mandatory ethnicity and race statements in police reports and media stories for all criminals and suspects.",
                "author": "AerialRush"
            },
            {
                "raw_content": "How about we allow Police Profiling again and be able to call a spade a fucking spade. Also make being called a racist by Islamist scum a joke so we can all have a wonderful laugh while they get arrested for being child rapists and terrorists.",
                "author": "BidenShowerDrool"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "At a minimum, only natural-born citizens should be able to hold elected office. Americans should not be ruled by foreigners.",
        "score": 448,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Any government office",
                "author": "Salty_Sailor"
            },
            {
                "raw_content": "Someone steal this fucker's toupee already. Goofy fuckwit.",
                "author": "1inchgroup"
            },
            {
                "raw_content": "Mongoloid or wax figure?",
                "author": "Handypatriot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Tom Homan responds to Pope Leo opposing Trump's deportations \"If we jumped the wall at the Vatican, penalties are MUCH harder than in America.\"",
        "score": 784,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Air drop the illegals at the Vatican",
                "author": "TrumpWonByALandslide"
            },
            {
                "raw_content": "The Catholic Church are the biggest fucking hypocrites on the planet on this topic and many others so they should just STFU",
                "author": "South_Florida_Guy"
            },
            {
                "raw_content": "Take away their tax exempt status that will shut up the Poop. I don't see the catholic church doing much in these shit hole countries.",
                "author": "aqua27"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "CNN’s Data Guru: Democrats’ 2028 Lineup Is a ‘Downright Clown Car’ – ‘It Is a Total Mess’",
        "score": 1082,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not one of them would be able to go toe-to-toe with JD Vance or Marco Rubio. Tulsi Gabbard or RFK Jr. were their only chances of having a Democrat candidate that stood a chance. Now they stand out as strong Republican VP possibilities.",
                "author": "FatigueIsReal"
            },
            {
                "raw_content": "All three have cock sucking lips",
                "author": "Colorado-Living"
            },
            {
                "raw_content": "Big booty Latina has some CRAZZZYYYYY EYES!\"",
                "author": "Mount_10_ear"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Why 10 GHz CPUs are impossible (Probably)",
        "score": 103,
        "text_content": "",
        "comments": [
            {
                "raw_content": "remember, the original Pentium to Pentium 3 had only 25w tdp. The original Athlon/AthlonXP which getting slam for \"high power consumption\" had only 40-75w Tdp. Pentium D (a dual chiplet Pentium 4) where said to be power hog. (it was rated 95w-130w) you can even see this from GPU, the once \"high powered\" Radeon 9700 pro is 40w, Fermi GTX480 is 250w, now we got 5090 taking 600w. So we werent getting performance from just shrinking transistor; we are also trading it with higher power consumption.",
                "author": "hackenclaw"
            },
            {
                "raw_content": "There was so much free performance available back in the late 90s early 00s. I was running a 3.4 pentium 4 at 4ghz with mad cooling. I don't know if software development has mitigated the problems of parallel processing but when we started to see the rise of multicore processors it was a major concern.",
                "author": "DaddaMongo"
            },
            {
                "raw_content": "\\* with silicon based transistors",
                "author": "NerdProcrastinating"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Insane piece of engineering inside of a DLP projector (Digital Micromirror Device)",
        "score": 4,
        "text_content": "It's a chip developed in 70's by Texas Instruments, widely used in 90's and 00's DLP projectors.",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Resident Evil Requiem is almost entirely sold out online with physical copies only available at select retailers",
        "score": 488,
        "text_content": "Can't remember when was the last time a physical game was sold out even before release, super hyped for RE9 Requiem!",
        "comments": [
            {
                "raw_content": "Gonna sell gang busters. Huge accomplishment to have a AAA game drop from a studio on a legendary run as CAPCOM is on, and have it release day and date on all the consoles cross-platform. 👏🏻 Also every review is 9+.",
                "author": "JozuJD"
            },
            {
                "raw_content": "Considering a lot of people were waiting for the first reviews to buy and that it will release on every current gen platform, i think it's safe to say this is guaranteed to be the highest and fastest selling Resident Evil game ever, and the franchise deserves this a LOT. As a Resident Evil fan, i could only be happier if the Zach Cregger movie actually delivers.",
                "author": "Unhappy_Gazelle392"
            },
            {
                "raw_content": "I just preordered the Generation Pack, was just waiting to make sure reviewers were saying that they ran well on Switch 2. I hope this leads to RE2R, RE3R and RE4R getting ported over sooner rather than later!",
                "author": "JoshieKrueger"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The Switch 2 is finally closing the \"generational gap\" and it feels amazing",
        "score": 784,
        "text_content": "​I just wanted to take a moment to appreciate how much of a game-changer the Switch 2 has been lately. For years, we were used to waiting months (or even years) for \"impossible ports,\" or settling for versions that looked like they were running on a potato. ​But seeing Resident Evil 9 launch day and date with other consoles is a massive milestone. It’s not just about getting the game at the same time, though—it’s the fact that it looks and runs nearly identical to the other platforms. ​ I actually own a PS5. But with RE9, I consciously chose the Switch 2 version. For the first time, I made that choice for such a big game without any second-guessing or \"fear of missing out\" on the visuals. ​We are finally at a point where: ​No more \"wait and see\": We get to join the hype cycle and day-one discussions with everyone else. ​Visual Parity: The gap in lighting, textures, and resolution has shrunk so much that the differences are negligible in motion. ​True Portability: Being able to take an experience of this caliber on the go without it feeling like a \"compromised\" version is still mind-blowing to me. ​This feels like a huge green flag for the future of the Switch 2. If third-party devs are already hitting this level of optimization, the next few years are going to be incredible for the community. ​What do you all think? Does the Switch 2 change how you’ll be buying multi-platform games?",
        "comments": [
            {
                "raw_content": "And the best part is all Nintendo has to do is keep making a better Switch. They literally have the perfect console.",
                "author": "RickDeckard31"
            },
            {
                "raw_content": "I was just thinking about how, for most of my life, the portable consoles usually lagged about 2 generations behind the home consoles. I was playing GBC during the N64/PS1 generation, which was roughly equivalent to an NES. The GBA coexisted with the PS2/GCN/Xbox and its library was heavily subsidized by SNES ports, etc. I think the distinction became a little less clear when the Vita and 3DS coexisted with the tail end of the PS3/360 generation and the beginning of the PS4 era. When the Switch came out, I generally thought of it as a portable PS3/360 - it was nice to really only be about one generation behind the home consoles, though that chasm grew wider towards the end of the Switch's lifespan. The Switch 2 is clearly behind the PS5 and the Series X in power. But I do think we're at a phase where it's a lot harder for me to conceptualize any specific type of game that wouldn't be able to work on the Switch 2 in some way, shape, or form - it just seems like a matter of whether devs are willing to put in the work/money and players are willing to overlook the sacrifices made on the graphics/performance side of things. One thing that I do hope is that Epic finds a way to get Unreal Engine 5 to play nicer with Switch - it feels like the ports that have had real trouble (e.g. Borderlands 3) come down to UE5 just not working super-well on Switch 2.",
                "author": "Soft_Researcher702"
            },
            {
                "raw_content": "I expect it will be tough when ps6 / the next Xbox release and that this has a shorter lifecycle before the switch 3 compared to the first switch.",
                "author": "Bostongamer19"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Fallout 4 will receive an update that will add DLSS to Switch 2 later on.",
        "score": 764,
        "text_content": "This means that it is not included in the base game. I feel that the 60fps mode will look much better with DLSS enabled.",
        "comments": [
            {
                "raw_content": "Dlss will help the 60fps mode not look so soft so thats good to hear",
                "author": "DiabUK"
            },
            {
                "raw_content": "It looks pretty good in the 30fps mode so the fact they aren’t already using the DLSS is impressive. Also hope they add gyro and mouse controls soon",
                "author": "PaleFondant2488"
            },
            {
                "raw_content": "wow doesn’t have dlss? currently looks great on 30/40fps modes? hopefully this means 60 doesn’t looks blurry",
                "author": "Legitimate_Dot_7311"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Building my collection",
        "score": 52,
        "text_content": "All my Switch 2 games",
        "comments": [
            {
                "raw_content": "I’ve been playing tf out of Assassins Creed and MP4 the last couple months",
                "author": "PaleFondant2488"
            },
            {
                "raw_content": "Switch 2 is just 7 months old and it's already crowding up the library with so many games.After the drought in the launch year for Switch 1 all the users are feasting now.",
                "author": "NoLocal1776"
            },
            {
                "raw_content": "So many great games.",
                "author": "Key_Raccoon_5342"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I think it's amazing that we are now playing games like cyberpunk, fallout 4 and assassin's creed shadows on a device the shape of a tablet",
        "score": 445,
        "text_content": "I mean, what previously required a whole box to run it, now just requires an 8 inch tablet shaped device. It's amazing. I've really been enjoying fallout 4 more than I ever have thanks to the switch 2.",
        "comments": [
            {
                "raw_content": "Switch 2 is saving my gaming experience because I love these type of games but I simply cannot sit in the couch or in front of my PC and game for hours anymore. However I can always squeeze a few minutes of my time while playing on the Switch 2 in portable form.",
                "author": "Beneficial-Issue8005"
            },
            {
                "raw_content": "I've been gaming since the 80's. Everything about modern games and consoles these days blow my mind.",
                "author": "shiny1117"
            },
            {
                "raw_content": "Don’t forget RE9 and Pragmata at 60fps as well! Capcom deserve credit for their support.",
                "author": "Loose_Society9485"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Just lending the Resident Evil game to my kid real quick",
        "score": 58,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Father, thank you for this gaaaaaaaaa, (chucks the switch and hides in a corner knowing he will not be sleeping for awhile), lol.",
                "author": "Substantial_Book3701"
            },
            {
                "raw_content": "How is this a meme?",
                "author": "PhilSwiftHereSamsung"
            },
            {
                "raw_content": "I started my first Resident Evil when I was 8. Good times!",
                "author": "Hordest"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Balatro - Switch 2 Edition - Free Upgrade",
        "score": 538,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We love the free upgrades",
                "author": "OriolesMets"
            },
            {
                "raw_content": "Oh god yes. Mouse mode and 60fps, please. I didn’t even realize that it was 30 on Switch 1 until I tried it out on PS5. EDIT: It does indeed allow the mouse! Glory be! EDIT 2: I hope they fix mouse mode. Currently it has an issue where it can’t tell if I’m using the mouse or the buttons, and both control schemes just keep breaking. The click registers to the R button, but that’s also still just functioning as the R button on menus, meaning it is literally impossible to select your run with the mouse. They really need to have a toggle option because as it stands I’m pretty disappointed.",
                "author": "SylviSweetheart"
            },
            {
                "raw_content": "Whats the difference?",
                "author": "AdNovel5207"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "PSA: if the FireRed and leafGreen ports include the events, players with FireRed will only have access to Deoxys attack form, while leafgreen players will only have access to defense form",
        "score": 153,
        "text_content": "Just thought I'd mention this for those that didn't know",
        "comments": [
            {
                "raw_content": "So is speed form just unobtainable in FR/LG? I haven't played through the games in about 4 years",
                "author": "JamesDaDragN"
            },
            {
                "raw_content": "I wanted to get FireRed anyways Love me some glass Canon (although I won't buy it yet)",
                "author": "julesvr5"
            },
            {
                "raw_content": "Let’s hope it has home support and the events",
                "author": "Lupinthrope"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Finally swapped my joycon shells with dark gray transparent ones and colored buttons. This is how the Switch 2 should’ve have looked!",
        "score": 323,
        "text_content": "After going a few years with colored transparent shells on my original switch, I wanted to try something new. I reallllly liked the look of the Switch 1 pro controller and wanted to replicate it here. I also saw these colored buttons and could not pass them up. Man, these pop! But in person they aren’t that overwhelming. If the whole shell was colored I feel like it would lose the “pro” feel that the switch 2 has. These dark transparent shells really keep that feel while adding a bit of fun back into the mix. It honestly reminds me of the switch lite as well. IMO these were a bit easier to work on than the Switch 1 joycons, especially in the trigger area. Took me a few hours for both of these, now I’m itching to try more colors! :)",
        "comments": [
            {
                "raw_content": "I dig it. I’ve been eyeballing this as well.",
                "author": "Ttm-o"
            },
            {
                "raw_content": "I don’t like the look of that at all, so I’m glad NS2 looks the way it does.",
                "author": "theskyopenedup"
            },
            {
                "raw_content": "It definitely looks better, how’s it feel though",
                "author": "MongloidMania"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "MP1st: Wolfenstein 3 plot details from castings for a new character",
        "score": 349,
        "text_content": "[source](https://mp1st.com/news/report-wolfenstein-3-first-story-details-unveiled-as-casting-begins) Codenamed \"Valkyrie,\" it will feature a new character named Sofiya. Performance capture will start in April and continue through this year and 2027.",
        "comments": [
            {
                "raw_content": "I'm just happy we're finally getting Wolfenstein 3 proper",
                "author": "MotorShoot3r"
            },
            {
                "raw_content": "we gonna play as blazko's mom? cool lol",
                "author": "TiocStudios"
            },
            {
                "raw_content": "FUCK YUEAH! WOLFENSTIEN 3 BABY Now MP1ST Please give me SOCOM news please",
                "author": "Hot-Court-5026"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Jeff Grubb: PlayStation had Gran Turismo 7 running on Switch 2",
        "score": 599,
        "text_content": "Just a fun one from the latest episode of Game Mess Decides, you can listen to the clip and watch the whole episode [here](https://www.youtube.com/live/kKtBbg2toiY?si=ThHv28z7Q89cHv9R&t=1637). According to Jeff Grubb, PlayStation/Polyphony at least had Gran Turismo 7 running Switch 2. Grubb explicitly states he does not think its coming to Switch 2, and that's not what he's saying (so do not take this and run with it that GT7 is coming to Switch 2). But its just a fun tidbit that Sony have been playing around with it.",
        "comments": [
            {
                "raw_content": "#Jeff Grubb is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "I *highly* doubt anything comes of this, just like Jeff Grubb said. If anyone remembers Epic Games having a working build of Gears of War 3 on PlayStation 3, I'd imagine this simply being a similar situation. Polyphony/PlayStation doing internal build testing and research on Switch 2, especially in the context of PlayStation having their own handheld coming up that Gran Turismo 7 might need a bespoke version for.",
                "author": "NfinityBL"
            },
            {
                "raw_content": "Probably for research reasons. They are doing a hybrid of their own.",
                "author": "Rampo360"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel, SambaNova Planning Multi-Year Collaboration for Xeon-Based AI Inference",
        "score": 22,
        "text_content": "",
        "comments": [],
        "subreddit": "intel"
    },
    {
        "post_name": "CEO Lisa Su Says AMD Is Placing Bets on AI Winners Following Six-Gigawatt Deal With Meta",
        "score": 33,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Giving 20% of AMD to Mark Zuckerberg and Sam Altman is certainly a choice. What's next? 10% Larry Ellison? 10% to Elon Musk? Lovely bunch of people here.",
                "author": "From-UoM"
            },
            {
                "raw_content": "RIP AMD",
                "author": "kingslayerer"
            },
            {
                "raw_content": "Gigawatts seems an odd choice of measuring business deals. Why not some monetary unit?",
                "author": "TheMagarity"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD introduces EPYC 8005 \"Sorano\" data-center CPU series, successor to \"Sienna\"",
        "score": 15,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hey OP — /r/AMD is in manual approval mode, this means **all submissions are automatically removed and must first be approved before they are visible to others**. This is done to prevent spam, scams, excessive self-promotion and other rule-breaking posts. Your post will be approved, provided it follows the subreddit [rules](https://www.reddit.com/r/Amd/about/rules/). **Posts regarding purchase advice, PC build questions or technical support will not be approved.** If you are looking for purchasing advice, have a PC build question or technical support problem, please visit the [Q1 2026, PC Build Questions, Purchase Advice and Technical Support Megathread](https://www.reddit.com/r/Amd/comments/1q1efc5/pc_build_questions_purchase_advice_and_technical/). *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Amd) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Nearly half of companies are turning to poor ‘peanut butter’ raises—following the same pattern of the 2008 recession, an expert says. And it could take years to recover",
        "score": 81,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A massive capital infusion from 2020-2022 created a spike in consumption and investment which required a ton of labor to fulfill. Additionally, the labor market was artificially restricted due to enhanced unemployment benefits. These factors created enormous leverage for labor. We are now in the hangover phase of the artificially stimulated post Covid economy. It will likely take several years to sort out the distortions in the market created by that stimulus.",
                "author": "Clever_droidd"
            },
            {
                "raw_content": "Seems like healthcare is the only safe industry out there right now assuming we have a AI bubble bursting and a private credit bubble bursting.",
                "author": "socialtrends93"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Layoffs surge in 2026: 10 major companies slashing thousands of jobs",
        "score": 37,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wow we might get rates in the 4’s by year end",
                "author": "G0B1GR3D"
            },
            {
                "raw_content": "There are lots of layoffs across the country but for some reason Miami has a very low unemployment rate. Maybe the stock market eventually crashing one day will cause the unemployment rate in Miami to go higher due to there being so many finance jobs there. [https://fred.stlouisfed.org/series/FLMIAM6URN](https://fred.stlouisfed.org/series/FLMIAM6URN)",
                "author": "socialtrends93"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Curious Google Search Activity",
        "score": 130,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“Is my house too expensive now”",
                "author": "CapitalOneDeezNutz"
            },
            {
                "raw_content": "The answer is always the price",
                "author": "projektvertx"
            },
            {
                "raw_content": "This is true for the entire country that is not tied to AI or finance sectors. If the AI sector enters a downturn or even if the finance sector enters a downturn then things will get very bad.",
                "author": "socialtrends93"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Private Credit Fears Deepen With UBS Warning of 15% Defaults",
        "score": 55,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good. Seems like it’s always UBS, SwissBank, RaboBank, Banco European-o or whatever, that take the bullets first.",
                "author": "Top-Acadia-1936"
            },
            {
                "raw_content": "All private credit companies are fucked…",
                "author": "spazzvogel"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage rates hit lowest level in nearly 4 years, but homebuyers are still stuck on the sidelines",
        "score": 146,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No one’s buying cause prices still are pandemic level. House I was interested in went up by 113% in 4 years. Nope, not gonna happen.",
                "author": "Limp-Text-5209"
            },
            {
                "raw_content": "[deleted]",
                "author": "None"
            },
            {
                "raw_content": "How long till the real price corrections start? No one is buying because they can't afford to buy.",
                "author": "Coupe368"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "U.S. homebuyer purchasing power surges by $30,000 as mortgage rates cool",
        "score": 24,
        "text_content": "",
        "comments": [
            {
                "raw_content": "*Housing prices surges by $30,000*",
                "author": "None"
            },
            {
                "raw_content": "housing prices will increase to compensate lol",
                "author": "Poundcake2RedVelvet"
            },
            {
                "raw_content": "$30k. 7.5% of the median home price. Price increases incoming if these rates hold. Affordability erased.",
                "author": "Top-Acadia-1936"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Buyers beware",
        "score": 2,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Toky Stark was original vibecoder",
        "score": 1884,
        "text_content": "",
        "comments": [
            {
                "raw_content": "*\"Please Jarvis, double check and triple check EVERYTHING. My life depends on it\"*",
                "author": "Arcosim"
            },
            {
                "raw_content": "Make no mistakes Jarvis",
                "author": "Traditional-Grade121"
            },
            {
                "raw_content": "True though he also invented/coded the ai that allowed him to just vibecode",
                "author": "thirsty_pretzelzz"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Andrej Karpathy: Programming Changed More in the Last 2 Months Than in Years",
        "score": 965,
        "text_content": "Karpathy says coding agents crossed a reliability threshold in December and can now handle long, multi-step tasks autonomously. He describes this as a major shift from writing code manually to orchestrating AI agents. **Source:** Andrej [Tweet](https://x.com/i/status/2026731645169185220)",
        "comments": [
            {
                "raw_content": "This matches my personal experience. I've been using Cursor since the past summer, and even thought I had acceptable results from time to time, it often lost the point of its assigned tasks. Everything changed with ChatGPT 5.1 Codex. I am currently using Opus and Codex with one model coding and the other one reviewing the code and pointing out its flaws. The AIs are now easily writing 90% of my code. I'm still reviewing the generated code of course but I have the feeling that step will be made redundant very soon.",
                "author": "AnxiousAngelfish"
            },
            {
                "raw_content": "„The key is to build intuition to decompose the task just right to hand off the parts that work and help around the edges” - not sure how you could do that easily without deep understanding of the problem you’re trying to solve. Spinning up agenta is great for seniors who know what they’re doing. Intuition is not really the greatest strength of LLMs and devs should still learn how to code properly",
                "author": "-emefde-"
            },
            {
                "raw_content": "Andrej is a cofounder of OpenAI and coined the term vibe coding",
                "author": "Outrageous-Tooth-256"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Scoop: Pentagon takes first step toward blacklisting Anthropic",
        "score": 127,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Anthropic must be doing something right if it's pissing off war mongerers",
                "author": "AnonThrowaway998877"
            },
            {
                "raw_content": "Anthropic should go fully the other way and turn Claude into a full on AI hippy.",
                "author": "AngelofVerdun"
            },
            {
                "raw_content": "It’s one thing to just not do business with Anthropic, but it’s a whole other level to designate them a **supply chain risk** as this can prohibit the government from doing business with any company that even uses Anthropic. This administration’s “support whatever I demand or I’ll destroy you” mindset feels so anti-American as sooo much of government contracting has bent over backwards to remove blatant partisanship from its contracting process. And I say that as someone with 20+ years experience as a DoD contractor - this administration is wildly different from previous Republican administrations.",
                "author": "Ntroepy"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "After Anthropic accused Chinese labs of scraping Claude, someone open-sourced 155K of their own Claude conversations — and built a tool for everyone to do the same",
        "score": 121,
        "text_content": "DataClaw README: *\"Anthropic built their models with freely shared information, then pushed increasingly strict data policies to stop others from doing the same. It's like pulling up the ladder after you've climbed it. DataClaw throws the ladder back.\"* 363 GitHub stars in 24 hours. Elon Musk replied \"Cool.\" Context: [Sonnet 4.6 claiming to be DeepSeek-V3 in Chinese](https://reddit.com/r/singularity/comments/1re8uxa/)",
        "comments": [
            {
                "raw_content": "This.",
                "author": "Hopeful_Pressure"
            },
            {
                "raw_content": "If there's one thing I can't stand it's people pulling the ladder up behind them. I never thought of anthropic like that, but it makes sense. It's Dario's only way of enforcing a moat",
                "author": "Stars3000"
            },
            {
                "raw_content": "They Streisand effect'd themselves. Such a gigantic own goal. They could (should) have said nothing and been in a better position.",
                "author": "jazir555"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "GPT 5.3 Codex Tops Agentic Coding, surpasses Opus 4.6 model",
        "score": 239,
        "text_content": "Codex 5.3 TOPS AGENTIC CODING Codex 5.3 surpasses Opus 4.6 to top agentic coding. It's also BLAZINGLY fast. That said, the xHigh version can be very expensive It's overall global average score lags behind Opus 4.6 which is the current leader.",
        "comments": [
            {
                "raw_content": "Weird how 5.1 Codex Max is #1 in regular coding, even over Opus 4.6. I don't know what the benchmark questions are like, but it definitely seems like 5.2 regressed in odd ways from 5.0/5.1 (which were a different model family from 5.2 from what I understand). If anyone from OAI reads this, would love an explain!",
                "author": "Correctsmorons69"
            },
            {
                "raw_content": "Where is Gemini 3.1?",
                "author": "ithkuil"
            },
            {
                "raw_content": "except that… for every other metric it was NOT top.",
                "author": "orville_w"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini 3.1 livebench results",
        "score": 47,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So much shade with one astrix",
                "author": "gentleseahorse"
            },
            {
                "raw_content": "this is the first time they are adding that asterisk ever 👀 practically accusing google of benchmaxing",
                "author": "ihexx"
            },
            {
                "raw_content": "lol they took it down",
                "author": "caughtinthought"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini 3.1 Flash model is imminent - Nano Banana 2 model teased",
        "score": 41,
        "text_content": "Google AI studio team leads Logan and Ammaar teased today about the release of Gemini 3.1 Flash model (next-gen image model) for Gemini AI [Thread](https://x.com/i/status/2026837206149599683)",
        "comments": [
            {
                "raw_content": "Flash model; no Banana model: yes",
                "author": "Tedinasuit"
            },
            {
                "raw_content": "Google really needs a Veo 4 release. It feels like Bytedance is so far ahead with Seedance at this point that it's like they're playing Chess and Google is still playing checkers.",
                "author": "Basil-Faw1ty"
            },
            {
                "raw_content": "i think it's more likely 3.1 pro image generation (nano banana **pro** update)",
                "author": "ihexx"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Math Legend Terence Tao on the Promise and Limits of Generative AI",
        "score": 31,
        "text_content": "In a new Atlantic interview, Terence Tao explains the **promise** of generative AI while weighing in on recent claims that AI systems have helped solve open Erdős problems. He cautions against hype. Many of the AI generated solutions involve less prominent problems in the long tail of over 1,000 Erdős questions. Tao describes several as **cheap wins,** often relying on known techniques that a human expert could likely have applied with sufficient time. However, he acknowledges meaningful progress. **Compared** to 2024, models have improved in certain types of high level mathematical reasoning and are now useful collaborators. Tao **believes** AI is roughly on schedule to reach the level of a trusted junior co author by 2026, particularly strong at handling tedious cases and large scale exploration. He suggests AI may shift mathematics from handcrafted case studies toward broader **population level** exploration of problems at scale. At the same time, AI proofs often lack the conceptual trail and deeper insight that human mathematicians generate. Tao calls for **better** uncertainty signaling from AI systems and favors interactive human AI collaboration over fully autonomous push button workflows. **His overall stance is measured:** AI is not about to solve the hardest open problems overnight, but it is beginning to change how mathematics is practiced. **Source:** The Atlantic (Exclusive)",
        "comments": [
            {
                "raw_content": "Here's a gift link to get past the paywall: [https://www.theatlantic.com/technology/2026/02/ai-math-terrance-tao/686107/?gift=TFOTFakDUkqIR56A7arAPMRVO9VKmk7iKn\\_UoptdRPc](https://www.theatlantic.com/technology/2026/02/ai-math-terrance-tao/686107/?gift=TFOTFakDUkqIR56A7arAPMRVO9VKmk7iKn_UoptdRPc) But yeah, your summary pretty much covers it; it's short & sweet.",
                "author": "xirzon"
            },
            {
                "raw_content": "tao framing most of the erdős results as \"cheap wins\" is important context that keeps getting lost in the hype. applying known techniques with brute-force compute is useful but fundamentally different from discovering novel proof strategies — and the gap between those two is where the real benchmark should be",
                "author": "dee-jay-3000"
            },
            {
                "raw_content": "Seems like this will still mean that something like lawyer or doctor is gonna change hugely because of AI. Because those two professions are tedious brute forcing. They look at a ton of evidence and suggest a diagnosis or juridical conclusion based on knowledge already known from millions of previous cases, there’s not much novel discovery, it’s almost always something that has happened to someone previously in the database.",
                "author": "Fit_Carpet634"
            }
        ],
        "subreddit": "singularity"
    }
]