[
    {
        "post_name": "Tampon Tim accused of Fraud",
        "score": 211,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I heard he's friends with school shooters too",
                "author": "WheresMyStimmy"
            },
            {
                "raw_content": "If only there was a Federal Bureau tasked with Investigating such things!",
                "author": "Iremembermypassword"
            },
            {
                "raw_content": "Kamala would have killed this country. We would have never recovered.",
                "author": "darkmodeforgotpass"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Ohio Sheriff Furious over ‘Piece of S**t’ Illegal Being Released Before Alleged Drunk Driving Crash",
        "score": 49,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If only there was a law enforcement officer who could do something about this",
                "author": "Taqiyya_Mockingbird"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "“Fun fact of the day. Sharks in the Gulf of America are now testing positive for cocaine.” Turns out the Trump administration isn’t just bombing random boats.",
        "score": 48,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Does anyone believe this shit? Can you imagine the dilution rate.",
                "author": "Darkpoisonousshaddow"
            },
            {
                "raw_content": "This is one step down from sharks with laser beams. Can't we at least get an ill tempered sea bass?",
                "author": "tired_of_leftists"
            },
            {
                "raw_content": "hollywood's new movie: Cocaine Shark",
                "author": "MudDog"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "DHS is praising Old State Saloon after the business announced “FREE BEER FOR ONE MONTH” to anyone who helps ICE identify and deport an illegal immigrant in Idaho.",
        "score": 599,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Dang, 12 illegals and you get a years worth of beer. Pretty good deal. Better than a donut for the Shanghai shivers clot shot.",
                "author": "123breadman"
            },
            {
                "raw_content": "Would be nice if this causes a domino effect and other companies also start praising ICE and DHS.",
                "author": "TheJakeFroggy"
            },
            {
                "raw_content": "All illegals need to be shot. Undocumented in life, undocumented in death.",
                "author": "knnbccb"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "22 States do not want to send their SNAP data to the Trump Administration to verify immigration status. 21 of the 22 have Democrat Governors.",
        "score": 696,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Very simple. Everyone needs to apply for snap again. Spez... nobody should be in snap, it should be on a limited basis for Americans. But you know some cuck judge gonna put the cabash on ending it. So make everyone apply again. Deny them then and there.",
                "author": "FuckU/Spez"
            },
            {
                "raw_content": "Is SNAP not federally funded? Just cut it off completely from those states and release the governors home addresses.",
                "author": "The_Yakuza"
            },
            {
                "raw_content": "Call the NSA and hack that sheeit. Oh, no, get Israel to hack it, pretend to be Chinese, then \"sell the data on the darkweb\" and have \"investigators seize the data\". There, God, do I have to think of everything for you?",
                "author": "learntocode"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Post your crimes online",
        "score": 977,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nobody ever said joggettes were smart.",
                "author": "AwShitHereWeGoAgain"
            },
            {
                "raw_content": "It’s amazing they get away with crime at all given how much they text on phones. It’s simply a lack of effort on the police’s part.",
                "author": "Viewer01"
            },
            {
                "raw_content": "They have brains evolved for finding berries and digging nutritious grubs out of the dirt. That's how you end up with this kind of thing.",
                "author": "seeling0"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This is what they think of us. Wake up. 94K likes, think about that.",
        "score": 540,
        "text_content": "",
        "comments": [
            {
                "raw_content": "ROB ME AND FIND OUT",
                "author": "GdotLee"
            },
            {
                "raw_content": "Or how they look before they pull out a pew pew and blast that fucker in the face.",
                "author": "2Clutch"
            },
            {
                "raw_content": "A Law was enacted all White must be armed when they walk out of their home.",
                "author": "MeMargie"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Just when you thought going back out on the road to come home from the Florida victory over Florida State (40-21) was not going to be as exciting as the game was - Nationwide Raids Nab 250 Foreign CDL Truck Drivers — DHS Warns Cartel Exploitation Threatens Homeland Security",
        "score": 938,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I have an EXCELLENT idea. We capture all the foreign CDL drivers and make them sign a contract, where they agree to drive truck loads of ILLEGAL ALIENS back to their homelands, and the foreign CDL drivers get to go free and not be imprisoned for ENDANGERING American lives.",
                "author": "Ballots0nRubysUSB"
            },
            {
                "raw_content": "Jeez. Just now hitting me.... The carnage of crappy driving is only part of the threat. Terrorist and cartel drivers having access to facilities and loads. Holy crap.",
                "author": "Pederella"
            },
            {
                "raw_content": "For every illegal CDL holder there are hundreds or thousands of upstream private and government employees and politicians who actively helped them (or looked the other way) to get those CDLs and put them in trucks. All of those upstream enablers need to be put in jail.",
                "author": "Waco419"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Always liked Norman Rockwell paintings...",
        "score": 1151,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Mass deportations, mass arrests of politicians, mass tax cuts for the citizens.",
                "author": "Aggrieved03"
            },
            {
                "raw_content": "And accountability from our ruling class",
                "author": "bananaguard62"
            },
            {
                "raw_content": "Make Americana Great Again",
                "author": "Bohemyth_2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "So easy....",
        "score": 753,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's awesome.",
                "author": "Ch3f4554551n"
            },
            {
                "raw_content": "I appreciate the bad photoshop. Even if it is AI, I enjoy they made it old-school.",
                "author": "HeyBlinkin"
            },
            {
                "raw_content": "lmfao.",
                "author": "cheech420dog"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Import the 3rd world, become the 3rd world: Muslims STORMED the opening night of the Christmas market in Brussels, waving Palestinian flags, setting off smoke bombs and scaring families.",
        "score": 1157,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why not shoot the fuckers and shove a pork chop down their filthy throats",
                "author": "CheeseAndOnion"
            },
            {
                "raw_content": "I'm going to say it: communists and muslims deserve to be dehumanized. Do you agree or disagree?",
                "author": "TheJakeFroggy"
            },
            {
                "raw_content": "If they're butthurt over Palestine isn't there some kind of Jewish thing they could bother? Or do they attack Christians because they know the government won't protect Christians?",
                "author": "Spicy_cat"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Street Justice. even the thugs are staring to get pissed off. no doubt still a feel good video. haha",
        "score": 664,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Blacks with black fatigue... \"Youse makin' us look bad Nigga...\"",
                "author": "Moebius"
            },
            {
                "raw_content": "America needs more of this.",
                "author": "MrTexan"
            },
            {
                "raw_content": "after seeing this. they need to do the same thing to the guy that has been going around sucker punching white chicks and has been let go god knows how many times.",
                "author": "cheech420dog"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "FBI Director Kash Patel warns James Comey of imminent action, saying developments are expected in the coming days.",
        "score": 471,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The days shall be more than 13 and less than 15.",
                "author": "PeteJeffrey"
            },
            {
                "raw_content": "OMGquit warning people …. Just DO it !",
                "author": "carbonsteel"
            },
            {
                "raw_content": "*IN THE COMING WEEKS* *THE MINIMUM OF WHICH NECESSITATES THE PLURAL, BUT NOT EQUAL TO OR GREATER THAN THREE*",
                "author": "NADSAQ"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"Idaho Bar offering free beer for a month to anyone who reports illegal immigrants\". America is healing!!!",
        "score": 1605,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"You know, it doesn't get any better than this.\" 🍺",
                "author": "airborne3502"
            },
            {
                "raw_content": "I drink maybe twice a year, at most. If I lived there, I would gladly divert my free beer to any fellow patriot.",
                "author": "SarsourCuntReturns"
            },
            {
                "raw_content": "\"Follow me to the back, hombre, that's where all the good cervezas are.\" ...right into the loving cuffs of a waiting ICE agent.",
                "author": "BigMikesSwingingCock"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "👍👍",
        "score": 1227,
        "text_content": "",
        "comments": [
            {
                "raw_content": "End the Fed. Jail the Fed. Investigate all bankers, communists, and corrupt judges and freeze their assets.",
                "author": "toobaditworks"
            },
            {
                "raw_content": "A sales tax and tariffs. The only ethical tax.",
                "author": "Viewer01"
            },
            {
                "raw_content": "My friend won $1M on a scratch ticket a few years ago. Took the lump sum. $430k. That's not right.",
                "author": "DJT4547"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Pres. Trump Ally & Legal Scholar Mike Davis sends STERN WARNING to Oregon Governor Tina Kotek after she threatened to go after ICE & Federal Agents! “You will go to prison for assault, harboring, obstruction, and conspiracy.” Let’s GO! Governor Kotek, you DO NOT SPEAK for the Majority of Oregonians!",
        "score": 906,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Joke’s on us though: She WON’T EVER go to prison or be charged with anything if she did!",
                "author": "Seeing_Red"
            },
            {
                "raw_content": "Oooooo, a sternly warning! I'll bet Kotex is shaking in his knickers.",
                "author": "chickeninoven"
            },
            {
                "raw_content": "Still waiting on repercussions for any on the left who do this",
                "author": "Wrexxis780"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Immigration and Nationality Act, Section 212(f):",
        "score": 1458,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Tired of the gaslighting. JUST FUCKING DO IT.",
                "author": "Here_we_go"
            },
            {
                "raw_content": "No Vacancies",
                "author": "airborne3502"
            },
            {
                "raw_content": "Yes. Executive Power. Please, continue... 🔥",
                "author": "Bongos"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ICE & NYPD were under siege today in NYC.",
        "score": 567,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And then you see the number of arrests and it's like two. When are these people going to get a brain cell together and put these people with Marshalls that can arrest people immediately.",
                "author": "snakeoil"
            },
            {
                "raw_content": "Dear trump administration, I hope this letter finds you well, with that being said let’s get down to business, please do ice raids and 3 am or 4am while the liberals are asleep. Ps don’t announce the raid dates",
                "author": "jdemarco2014"
            },
            {
                "raw_content": "There should be way more baton and emergency dentistry happening.",
                "author": "BlackJack1776"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The heavily tattooed will die from the ink. We warned them.",
        "score": 422,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We all have to die of something. Me, myself? I'll probably get killed by an illegal CDL driver.",
                "author": "Malice"
            },
            {
                "raw_content": "I have always felt on a subconscious level that tattooed people... Especially people who are heavily tattooed... Looked diseased and rotten. I have always thought tattoos made a girl look ugly. I am literally repulsed on a physical level by them. And it turns out, I was more correct then I even realized... Tattoos literally do make you diseased and rotten. I hope this information spreads and more people know about this. I am so sick of everyone poisoning themselves with this disgusting body graffiti.",
                "author": "MAGA9428"
            },
            {
                "raw_content": "I indulged in my share of doodling on my high school notebooks. I'm certainly not going to actually pay someone to doodle on my skin. It's as stupid as can be.",
                "author": "OnlyTrump20"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump posts: Nearly 16% of people in this country are foreigners.",
        "score": 1351,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And to be clear, in those earlier times in history, the foreigners were Europeans with a common religion and similar moral and ethical standards and a common concept of civics and decency.",
                "author": "HoneyBadgerInc"
            },
            {
                "raw_content": "16% are KNOWN to be foreign-born. What's the real percentage look like? How many are born here and \"legal\" when they shouldn't be? The real numbers are much worse.",
                "author": "Shezestriakis"
            },
            {
                "raw_content": "So its probably more lik 30",
                "author": "Miha"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Taiwan authorizes seizure of over $60 million in assets from former TSMC executive who left for Intel",
        "score": 625,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Interesting. I hadn’t heard he worked at intel previously for 18 years before working at TSMC.",
                "author": "Brufar_308"
            },
            {
                "raw_content": "He worked at Intel for 18 years before joining TSMC, I wonder if the suit based on suspicions is because they know he brought secrets with him back then and think he'd do it again.",
                "author": "TheMonarchsWrath"
            },
            {
                "raw_content": "Dude held nearly 65 million in TSMC stock? Clearly not your average worker at TSMC. Makes more sense why they are pursuing this more seriously than when they had a similar situation with Samsung or SMIC.",
                "author": "KR4T0S"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Homegrown Chinese CPUs bring Core i7 Raptor Lake performance to domestic gaming PCs — Hygon C86-4G lands between a Core i7-13700 and Core i7-14700",
        "score": 138,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So it use Zen designs that Hygon licensed from AMD? how does that count as \"homegrown?\"",
                "author": "ClickClick_Boom"
            },
            {
                "raw_content": "Some important points: Speculation is that it's based on Zen 1- this is not the first time this company has made a processor based on Zen with Zen like performance. They basically sold a Chinese version of [Zen 1 Epyc back in 2018](https://www.tomshardware.com/news/china-zen-x86-processor-dryhana,37417.html), where the hardware was so similar to AMD's epyc, the Linux kernal developers listed it as the same device but with different vendor ids. It has similar performance properties to Zen 1. With 16 cores it manages to land between the 13700 and 14700 in V-ray, but still falls well behind the 12700 in single core (about 33% less performance). I haven't had any luck finding price/TDP figures, though I imagine the latter is similar to a 1950x threadripper, maybe a bit lower due to having lower clock speeds. Imo it's an interesting piece of hardware, but the article is click baity. It's essentially a slightly tweaked Threadripper 1950x that is licensed and isn't made with Chinese silicon, so calling it home grown feels like a stretch... Considering they were also doing the same thing 8 years ago with Epyc, it doesn't really feel like the development the article makes it out to be.",
                "author": "Zarmazarma"
            },
            {
                "raw_content": "If they really are trying to link Vray benchmark result with gaming performance, then I'm surprised with how low quality tomshardware can go these days",
                "author": "FitCress7497"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Gamers Nexus - Best CPU Coolers We've Tested (2025): Thermals, Noise Levels, & Value",
        "score": 56,
        "text_content": "26 CPU coolers tested. I do wish Gamers Nexus also had some information on noise profile and not just dBA.",
        "comments": [
            {
                "raw_content": "Surprised there's no mention of the meta thermalrights",
                "author": "reddituserzerosix"
            },
            {
                "raw_content": "Sk 700V as best overall looks like a strange choice over the (more widely available) competition. Impressive results for what it is, but a $59 (with today's discount) single 120mm cooler that requires removal of the ILM for installation is a bit of a stretch for prudent consumer advice - but hey that's all subjective and the video actually notes its ease of installation as a positive. Very cool looking cooler though, the mechanical award makes perfect sense. Also highlights how cheap 360mm AIOs have become. I've always been a fan of the price and mechanical simplicity of aircoolers, but <$50 for a well performing all black 360mm AIO is pretty compelling. It does feel a little like they tried their hardest not to mention Thermalright's most popular offerings, which even according to the charts in that very video should be impossible to ignore at their price point of usually around $35. The budget winner is a $16 aircooler - fair - then the next recommended cooler is a $59 single tower cooler that performs worse noise normalized than the already outdated Peerless Assassin. It's a shame they still haven't reviewed the Phantom Spirit 120 - only the EVO which is a flawed version - I own that one. :')",
                "author": "Scarabesque"
            },
            {
                "raw_content": "Timely video for me as I have been wondering if my old Scythe Mugen 5 is going to suffice for a 7800X3D upgrade for my gaming PC and what potential upgrade options I have.",
                "author": "constantlymat"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Fortnite event on the switch 2 looked amazing 🔥😭",
        "score": 898,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This looks like Ready Player One",
                "author": "Red_Maple"
            },
            {
                "raw_content": "I have not played Fortnite but I have to admit I’m intrigued lol, this is some wild shit wow. Is this what happens all the time? How can I get a mech lol? Just fucking bonkers.",
                "author": "Arthago"
            },
            {
                "raw_content": "https://preview.redd.it/zj1imptk994g1.png?width=864&format=png&auto=webp&s=23c7db7aafcb1d5ae877c150f54c53c577a130ea Need I say more",
                "author": "SelectInstruction262"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo goes live with more Switch 1 backwards compatibility fixes for Switch 2, and Resident Evil 4 is broken",
        "score": 429,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Brilliant Diamond and Shining Pearl continue being messes",
                "author": "DevouredSource"
            },
            {
                "raw_content": "So this is gonna be like a community made emulator Fix 3 games and break 3 others",
                "author": "Thin_Molasses_2561"
            },
            {
                "raw_content": "Oh wow, I'm actually happy for the folks that were dying for that Nier: Automata fix to finally get it, I just can't tell if that now kills any hope for a proper Switch 2 version any time soon?",
                "author": "Key_Artichoke8315"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "It's about time I played this!!",
        "score": 749,
        "text_content": "It feels very different from past Zelda games I've played, but my god, it feels so good! And even at 1080p projected to a plain wall, on more budget focused projector, it looks gorgeous!",
        "comments": [
            {
                "raw_content": "It’s an amazing game. Probably my favourite game of all time. I am now just playing TOTK and it’s great. I prefer BOTW’s vanilla experience but both are outstanding. Edit: spelling",
                "author": "swordedwarrior"
            },
            {
                "raw_content": "What projector is that? The image quality looks good.",
                "author": "base_num_two"
            },
            {
                "raw_content": "What game is it? The Legend of This: Breath of the This?",
                "author": "echoess84"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Who is ready to “Assemble” on Monday?",
        "score": 65,
        "text_content": "https://youtu.be/EKeLz4D8gBs?si=g18qXHd8fVj8JQ8F I loved Shredders Revenge and this game looks like the arcade beat em up I loved when I was a kid in the 90’s. Can’t wait!",
        "comments": [
            {
                "raw_content": "Yeah day one buy for sure. I love most dotemu games.",
                "author": "SuperbSpiderFace"
            },
            {
                "raw_content": "I was until I learned there was a physical edition coming… now to play the waiting game until April :(",
                "author": "complex_personas"
            },
            {
                "raw_content": "WHOA, how come I didn't hear of this til now? Thanks OP.",
                "author": "Magus80"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "My best photo (in Mario Kart World at least).",
        "score": 191,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/69oys0tzt84g1.jpeg?width=1920&format=pjpg&auto=webp&s=e9a48284b69f74942bb09da8d33107c9402b3ff1 One of my favs",
                "author": "SirDanOfCamelot"
            },
            {
                "raw_content": "https://preview.redd.it/cfkgamiija4g1.jpeg?width=1920&format=pjpg&auto=webp&s=8d63df9996e7fba42c0794ca9768dc54628efe01",
                "author": "Lord_Snaps"
            },
            {
                "raw_content": "I like it",
                "author": "BroncoChevalier"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Assasins creed shadows switch 2 portable gameplay",
        "score": 720,
        "text_content": "",
        "comments": [
            {
                "raw_content": "this image is fucking me up. why does the switch 2 look so tiny? is op a giant?",
                "author": "ijblack"
            },
            {
                "raw_content": "Op is Andre The Giant.",
                "author": "Interne-Stranger"
            },
            {
                "raw_content": "Is it out yet?",
                "author": "B0bcat5"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Metroid Prime 4: Beyond will launch with Casual and Normal Modes. Hard mode unlocks after clearing game on normal first time. Nintendo Switch 2 Edition features quality and performance mode.",
        "score": 190,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I normally play my games in whatever the default mode is, then if I like it, the next time I decide to replay it I’ll pick a harder mode if there’s one available. Some games are awful in nightmare mode: for example the RPG Assassin’s Creed games (without NG+)",
                "author": "Another-Username81"
            },
            {
                "raw_content": "That's great for potential newcomers. I seen some people saying they can't get into Metroid because it's too hard for them. Hard mode being unlocked after beating the game is pretty much standard at this point. Edit: seems like I have to specify that I'm talking about Metroid games, not games in general...",
                "author": "linkling1039"
            },
            {
                "raw_content": "Im hearing rumors of there also being an ability to jump",
                "author": "Possible-Potato-4103"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "My Switch 2 screen suddenly died. I have some questions about backing up my data",
        "score": 75,
        "text_content": "I bought it at launch. I've never dropped it or bumped it once, but the screen suddenly died. It started with the \"ghost touch\" issue a couple of days ago, where it acted like it was constantly being touched, causing the home screen to move around by itself like crazy. Now it’s gotten worse, as you can see in the video, the screen is almost completely dead, and the ghost touch is still happening. Now, I need to backup my data before I send it to Nintendo because, from what I know, they usually just give you a new one for replacement instead of repairing the one you sent. I only have one Switch 2 (no microSD Express card) and one Switch 1 (which still contains all my Switch 1 era data). Here’s what I'm planning to do: 1. For games that support cloud save, I'll use cloud save to backup the save data. 2. For games that don't support cloud save, like Pokémon games, I'll transfer the save file back to Switch 1 to overwrite the old save file since the one on Switch 2 is more up to date. 3. After receiving the replacement unit, I'll do the system transfer to bring everything from Switch 1 to Switch 2 again. 4. Finally, I'll download all the Switch 2 exclusive game save data from the cloud save. That should be correct, right? Also, for screenshots, even though all the old data is intact on my Switch 1, it only contains screenshots from the Switch 1 era. What about the screenshots I captured since getting the Switch 2? I know you can transfer screenshots to a PC via a USB cable, but you can't do it the other way around. I believe it's the same with the Nintendo Switch app, which only allows downloading screenshots from the console, not the reverse. So, my questions are: 1. It seems there’s no way to transfer the screenshots from my faulty Switch 2 to the replacement unit without a microSD Express card, right? 2. Can I achieve that if I have a microSD Express card? If I save all the screenshots on it and then plug it into the replacement unit, would that work? I know some of my questions are a bit uncommon, and probably not many people have faced these problems before, but I hope someone can help resolve my issues. Thanks.",
        "comments": [
            {
                "raw_content": "dock it",
                "author": "Jordium-Z"
            },
            {
                "raw_content": "Wait... Pokemon games don't support the cloud save feature??",
                "author": "HollowInfinity"
            },
            {
                "raw_content": "Screenshots are saved in the cloud to the nintendo switch app, download it an check if they are in the Phone app already",
                "author": "ItalianMenBall"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Upcoming 9850X3D Gaming CPU from AMD leaked, rumored to increase clock speed by 400MHz (7.7%)",
        "score": 110,
        "text_content": "Official site leak: https://www.amd.com/en/support/downloads/drivers.html/processors/ryzen/ryzen-9000-series/amd-ryzen-7-9850x3d.html Archive: https://archive.is/FHkJu Found by twitter user: https://xcancel.com/Olrak29_/status/1995002677106020687",
        "comments": [
            {
                "raw_content": "And just like that, my 9800x3d is OBSOLETE. Completely USELESS. TRASH tier. Non-Functioning GARBAGE!",
                "author": "IshTheFace"
            },
            {
                "raw_content": "Intel where are you at?",
                "author": "Opt112"
            },
            {
                "raw_content": "Very nice",
                "author": "Butefluko"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Ghost of Hope says Black Ops 7 Zombies will have a \"remake map\" of Black Ops 4's Alpha Omega (Nuketown Zombies), being one the 5 zombies maps.",
        "score": 87,
        "text_content": "https://xcancel.com/TheGhostOfHope/status/1994923801419943970 An according to Ghost, Nuketown Zombies is being remastered as a Survival Map as well to go alongside the remake. Hot Take, but Alpha Omega is a decent BO4 Zombies reimagined take of Nuketown Zombies. Yeah, it’s claustrophobic and tight, but the story, lore, and the EEs are fun, just a chore under the Blundell umbrella. Out of any map, Buried, Die Rise, Origins, Shadows, and Buried, it had to be Alpha Omega of all maps that’ll be rumored to get a remake treatment. I’m not against it at all, it’s just really funny to see people losing their minds on this.",
        "comments": [
            {
                "raw_content": "Out of Buried, Die Rise, Origins, Shadows…they pick Alpha Omega? Clearly the developers were looking for the most under appreciated map to make a meme out of…",
                "author": "Straight-Ad6926"
            },
            {
                "raw_content": "Alpha omega? Really? Even out of the Primis maps in Bo4 this one is certainly a pick Like I'd say Blood of the dead or Tag Der Totem would've been far better picks for maps to remake, since they also have a way better tie in with the lore of the dark aether, being that in both of them you plunge a world into it",
                "author": "xXx_edgykid_xXx"
            },
            {
                "raw_content": "That’s a wild decision to remake that map specifically. But treyarch has always had a knack for remastering old maps people didn’t like to breathe life into them. I remember hearing that’s specifically why five was chosen as a remake for bo4",
                "author": "steamboatwillies"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Tom Henderson says that Ubisoft still plans to release Prince of Persia: The Sands of Time on January 16th of 2026",
        "score": 490,
        "text_content": "Link: https://youtu.be/UIC2MNxve2I?si=y8VPoj1NMEUb5161",
        "comments": [
            {
                "raw_content": "#Tom Henderson is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "So reveal at the game awards and then launch a month later, can't remember a game ever having such a short window for marketing. Barring shadowdrops. Are they confident or sending it out to die?",
                "author": "Deadly_Toast"
            },
            {
                "raw_content": "Since they wanted to just cut and rip our show and upload it to their own channel, here's the ACTUAL clip from the show. [https://www.youtube.com/live/gDN7P9kiMfU?si=J5UTgN4JavoWM5OT&t=1036](https://www.youtube.com/live/gDN7P9kiMfU?si=J5UTgN4JavoWM5OT&t=1036)",
                "author": "MikeStrawMedia"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "AMD has been my partner in gaming for the last 15 years, here most of my path from HD6990 to 9070XT; another thing I am thankful for this thanksgiving weekend",
        "score": 281,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What a glorious collection. The Radeon VII is still my favorite design. :P",
                "author": "Crazy-Repeat-2006"
            },
            {
                "raw_content": "R9 Nano is so tiny!",
                "author": "Tyr_Kukulkan"
            },
            {
                "raw_content": "From someone who started on a 32MB Rage 128 Pro and is now running a 7900 XTX, nice. Also I wish I would have kept all of my cards over the years. I’ve still got the first, but there’s a bunch missing in between.",
                "author": "Royale_AJS"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "XFX updates Radeon RX 580 4GB BIOS seven years after launch",
        "score": 96,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is this about the GOP VBIOS expiry date?",
                "author": "skylinestar1986"
            },
            {
                "raw_content": "Seven years, eh? Time flies by.",
                "author": "pullupsNpushups"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "ASRock to sell workstations with four Radeon AI PRO R9700 GPUs and Threadripper platform",
        "score": 25,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nice.",
                "author": "VisceralMonkey"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "My first fully AMD build since 2011!",
        "score": 21,
        "text_content": "I've been using AMD CPU's since the first Zen CPU's launched, but had steadfastly stuck with NVIDIA for my GPU's. Now though, I'm rocking a beautiful Powercolor Hellhound 7900 XTX paired with an R7 5800X, and I couldn't be happier. I threw in a new AIO, vertically mounted the GPU, finally managed to get all my fans matching, and now I have the kind of setup I've dreamed of owning for years. Maybe next year I'll move over to AM5, as I already snagged some DDR5 before the prices went utterly haywire, and I've got my eye on a lovely white Gigabyte motherboard to match everything else. I've been building and using PC's for 40 years this year, and this is the first time I've looked at one I own and thought \"Yeah, this is perfect\". It's about time :D",
        "comments": [
            {
                "raw_content": "you can now use a cellphone inside a PC? wow",
                "author": "rynmls22"
            },
            {
                "raw_content": "ah yes the new Samsung Galaxy S25 Ultra AIO👌👌👌👌",
                "author": "Powerful-Ad2869"
            },
            {
                "raw_content": "Which AIO is that?",
                "author": "strahinja3711"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AYANEO Next II gaming handheld packs MAX+ 395 APU, 9\" OLED panel and massive 115Wh built-in battery",
        "score": 8,
        "text_content": "",
        "comments": [
            {
                "raw_content": "115Wh means you can't just bring it with you onto a flight without declaring the device on check-in and getting prior approval. https://www.iata.org/contentassets/6fea26dd84d24b26a7a1fd5788561d6e/passenger-lithium-battery.pdf",
                "author": "ArseBurner"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "29 November 2025 - Weekly /r/REBubble Discussion",
        "score": 4,
        "text_content": "What's the word on the street? Share your questions, comments, and concerns below.",
        "comments": [
            {
                "raw_content": "What are we hearing about second homes ? Non Airbnb, just ones used for leisure if the owner.",
                "author": "JLandis84"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "More than half of US homes lost value in the past year",
        "score": 194,
        "text_content": "\"Across the country, the average drop from peak valuations is 9.7%.\" 😱",
        "comments": [
            {
                "raw_content": "Company that sells houses says it’s never been a better time to buy a house!",
                "author": "OwnLadder2341"
            },
            {
                "raw_content": "i lost 25k in my vegas house that i purchased 2 years ago …",
                "author": "CharacterScarcity695"
            },
            {
                "raw_content": "So … 10% of $399k is $39k So the home that was 199k in 2020 is now $360k.. Kinda makes sense actually",
                "author": "VendettaKarma"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Talk Your Book: The State of the Housing Market",
        "score": 0,
        "text_content": "As we head into 2026, Fed policy will be more important than ever.",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Google is finally working about fix the Gemini’s buggy UI.",
        "score": 576,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They need to fix markdown. Has been a problem since forever.",
                "author": "Dudensen"
            },
            {
                "raw_content": "AI Studio alone is like 10x ChatGPT interface The biggest problem that OpenAI has is they really don't have the senior engineers (software and hardware) in the sense google does, and it's probably getting worse with the vibe coding. I suspect sam is trying some hail mary to get to ASI to somehow make up for it",
                "author": "kaggleqrdl"
            },
            {
                "raw_content": "“Fix Gemini chat UI. Copy ChatGPT. Use Google Colors and formatting” Done. I kid, but it’s getting close!",
                "author": "Stock_Helicopter_260"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "New benchmark: Claude Opus 4.5 broke the efficiency wall.+21% intelligence while getting 66% cheaper",
        "score": 557,
        "text_content": "Researcher Havard Ihle just dropped a chart that quietly destroys the “AI is hitting a wall” argument. Claude Opus 4.5 did not just improve. It jumped **+21% in capability** while becoming **66% cheaper** at the same time. We thought models would get smarter but exponentially more expensive (The \"100 Billion Dollar Cluster\" theory). Anthropic just proved the opposite: Intelligence is getting cheaper. If this \"Efficiency Curve\" holds, we are not hitting a wall but we are entering the phase where powerful AGI becomes affordable for everyone, not just mega corps. **Is efficiency the new scaling law?** **Source:** [X (Peter Gostev)](https://x.com/petergostev/status/1994500760705667524?t=ZAVFu0J4TAQebfU2ji6kwg&s=19)",
        "comments": [
            {
                "raw_content": "Depends on if Anthropic is running on a loss (to draw new users) or is actually making even or a profit. Perhaps they are heavily subsidizing it, and therefore the law may still be true",
                "author": "NoWayYesWayMaybeWay"
            },
            {
                "raw_content": "Their models were always overpriced though",
                "author": "previse_je_sranje"
            },
            {
                "raw_content": "> Claude Opus 4.5 did not just improve. It… I just can’t read this sentence structure anymore.",
                "author": "nowrebooting"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "A universal vaccine to treat all cancers is now entering human trials",
        "score": 121,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Soon we will just need to modify it with the measles virus to make it free.",
                "author": "Illustrious_Image967"
            },
            {
                "raw_content": "Dogs too please and thank you.",
                "author": "rafark"
            },
            {
                "raw_content": "I see a paper there talking about promising results in mice, but nothing about human trials.",
                "author": "Tystros"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Leak: OpenAI is building an Ad Network inside ChatGPT. \"Search Ads\" strings found in latest Android Beta.",
        "score": 981,
        "text_content": "A trusted reverse engineer **Tibor Blaho** found ad system strings inside the latest ChatGPT Android beta(v1.2025.329). This is not a rumor. The code already includes **Search Ads** and ad targeting hooks. Looks like the free era is slowly ending. **Sam Altman** once said, \"I kind of hate ads\" and claimed ChatGPT would be a sanctuary from the ad driven web. Now, it looks like they are building the exact same infrastructure they disrupted Google to escape. **Do you still trust answers from a system that will also sell placement ? Is this the start of the Enshittification of LLMs?** **Source:** [X (Tibor Blaho)](https://x.com/btibor91/status/1994714152636690834?t=531-CnBsHKRK4ujZofBVfQ&s=19)",
        "comments": [
            {
                "raw_content": "I suppose this is some of the least surprising news ever.",
                "author": "FenderMoon"
            },
            {
                "raw_content": "![gif](giphy|3P0oEX5oTmrkY)",
                "author": "Mighty-anemone"
            },
            {
                "raw_content": "Sam Altman has said a lot of things.",
                "author": "Practical-Hand203"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "New LimX Oli demo: Walking on loose construction debris using \"Sim2Real\" learning. Stability on shifting terrain is scary.",
        "score": 13,
        "text_content": "We are used to seeing robots walk on flat lab floors or pre-mapped grass. This is different. This is **LimX Oli** (from China) navigating a chaotic construction site with loose rocks, sand and wood. * **The Sim2Real Gap:** The post claims this wasn't hard coded. They used massive randomized training in simulation and transferred it to the real world. * **Dynamic Control:** Watch how it adjusts when the rocks shift under its feet. That micro adjustment is the difference between a demo bot and a work bot. While we focus on LLMs, the physical bodies for AGI are solving \"Moravec's paradox\" (hard movement) faster than expected. **Does this beat the latest Tesla Optimus demo for real world utility?** **Source:** [YouTube (LimX Dynamics)](https://youtu.be/rRCXeCIFJ0U?si=OAfS6o4yMC_nlMkW)",
        "comments": [
            {
                "raw_content": "Don't get me wrong, it is really impressive - but one thing bothers me with all these walking demos: it almost never seems to plan around the obstacles, only correct after it trips. Seems kinda dangerous to have this around sensitive resources, people, animals and whatnot. Would be nice to add collisions as a penalty on the simulations...",
                "author": "suamai"
            },
            {
                "raw_content": "babe wake up, yet another humanoid that doesn't do anything useful just dropped",
                "author": "borntosneed123456"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The Story of Elon Musk and DeepMind is interesting(was mentioned in The Thinking Game(DeepMind documentary) so i got curious)",
        "score": 267,
        "text_content": "# 2010–2013: Early Connections * Elon Musk had been funding AI research since the 2000s because he was already concerned that advanced AI could pose an existential threat to humanity. * In the early 2010s, he became friends with DeepMind founder **Demis Hassabis**, meeting through London tech and futurist circles. * Musk was an **early believer** in the DeepMind mission. In 2013, he personally invested in DeepMind’s Series A round alongside Hassabis, Mustafa Suleyman, and Jaan Tallinn (Skype co-founder and prominent x-risk donor). * At the time, DeepMind was a small London startup (fewer than 50 employees) pioneering deep reinforcement learning—famously training neural nets to beat human performance at Atari games using only raw pixel input. # Late 2013 – Early 2014: The Secret Sale Process * By late 2013, DeepMind realized it needed **hundreds of millions of dollars** and vast compute resources to stay at the frontier of AI research. * The company quietly explored an acquisition. * Five serious bidders emerged: **Google**, **Facebook**, **Baidu**, **Elon Musk (personally, with Peter Thiel)**, and a mysterious “**Plan West**,” widely believed to be Musk’s internal codename. * Musk’s explicit goal was to **keep DeepMind independent** and aligned with long-term human interests. * He was deeply worried that **Larry Page / Google** held what he described as a **“cavalier attitude” toward AGI risk**. Musk later recalled Page accusing him of being *“speciesist”* for believing humans should survive AGI. # The Bidding War * The final battle came down to **Google vs. Elon Musk**. * Musk and allies reportedly offered **$500–600 million**, promising independence and a powerful ethics board—Musk wanted actual **veto rights** over potentially dangerous research. * Google’s bid was slightly higher in cash (final deal reported between **$500–650 million**) but came with a firm stance: **No outside control.** No external veto. * DeepMind chose Google in February 2014, mainly because: * Google had unmatched compute resources and global engineering talent. * Google agreed to create an **internal ethics and safety board**. * Some founders were uncomfortable with Elon having personal control over the company. # Musk’s Reaction * Musk was **furious**, shocked, and profoundly worried about the future of AGI. * He saw DeepMind’s sale to Google as humanity losing its best chance to keep frontier AI out of a single corporation’s hands. * Almost immediately afterward, he co-founded **OpenAI in 2015** (with Sam Altman, Greg Brockman, Ilya Sutskever, etc.) explicitly as a **counterweight to Google DeepMind**. * OpenAI’s original mission statement heavily implied: **“Google bought DeepMind. We don’t trust their intentions.”** * For years, Musk publicly stated that losing DeepMind to Google was one of the major triggers for both **OpenAI** and later **xAI**. # Long-Term Fallout * DeepMind and OpenAI became bitter research rivals for the next decade. * Ironically, Musk later turned the same criticisms he once aimed at Google toward **OpenAI itself**—especially after GPT-4, the Microsoft partnership, and OpenAI’s shift away from its fully open, non-profit roots. * In 2023, Musk founded **xAI** and launched **Grok**, explicitly framing it as a third competitor to what he called the **Google–OpenAI duopoly**. # TL;DR * Elon Musk was an early investor, friend, and admirer of DeepMind. * In 2014, he made a serious attempt to **buy DeepMind** to keep it independent and safe. * He **lost to Google**, a moment he has said repeatedly “terrified” him. * That loss directly motivated the creation of **OpenAI (2015)** and later **xAI (2023)**. # In Musk’s own words: > That single failed deal in 2014 is one of the major butterfly-effect moments that shaped today’s entire AI ecosystem.",
        "comments": [
            {
                "raw_content": "Nano banana pro is so good at making info graphics, was a pleasure to read",
                "author": "Setsuiii"
            },
            {
                "raw_content": "Not to be that guy, but this isn't really that much of a butterfly effect situation? A 600 million dollar deal is not a tiny flap-of-wing moment that results in seismic change. This is sort of an A-to-B story? He couldn't buy an AI company, so he started one.",
                "author": "Raised_bi_Wolves"
            },
            {
                "raw_content": "This whole chart paints Musk as a normal human being. That raises an eyebrow.",
                "author": "mop_bucket_bingo"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Google CEO Sundar Pichai signals quantum computing could be next big tech shift after AI",
        "score": 9,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's weird watching both these once mythical technologies, AI and Quantum Computing, having MASSIVE breakthroughs in the recent years, to the point of almost reaching widespread usability. Used to feel like these techs would forever be stuck in the trough of researchers saying \"We just managed to make a breakthrough that would potentially maybe make us 1 step closer to practicality... In 10 years!\" Though we've yet to see the practical capabilities of Quantum Computers, but from what we've been hearing, sounds like perpetual, error free qubits are right around the corner",
                "author": "New_Equinox"
            },
            {
                "raw_content": "Sure we will have quantum agi running on the moon in 2026.",
                "author": "Lanky-Cobbler-3349"
            },
            {
                "raw_content": "Great, it's about time quantum takes off.",
                "author": "ScorpionFromHell"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "MIT + Colombia study (Nov 2025): Readers Prefer Outputs of AI Trained on Copyrighted Books over Expert Human Writers",
        "score": 90,
        "text_content": "From the abstract: We conducted a preregistered study comparing MFA-trained expert writers with three frontier AI models: ChatGPT, Claude, and Gemini in writing up to 450 word excerpts emulating 50 award-winning authors’ (including Nobel laureates, Booker Prize winners, and young emerging National Book Award finalists) diverse styles. In blind pairwise evaluations by 159 representative expert (MFA candidates from top U.S. writing programs) and lay readers (recruited via Prolific), AI-generated text from in-context prompting was strongly disfavored by experts for both stylistic fidelity and writing quality but showed mixed results with lay readers. However, fine-tuning ChatGPT on individual author’s complete works completely reversed these findings: experts now favored AI-generated text for stylistic fidelity and writing quality, with lay readers showing similar shifts. These effects are robust under cluster-robust inference and generalize across authors and styles in author-level heterogeneity analyses. The fine-tuned outputs were rarely flagged as AI-generated (3% rate versus 97% for in-context prompting) by state-of-the-art AI detectors. Mediation analysis reveals this reversal occurs because fine-tuning eliminates detectable AI stylistic quirks (e.g., clich´e density) that penalize in-context outputs, altering the relationship between AI detectability and reader preference. While we do not account for additional costs of human effort required to transform raw AI output into cohesive, publishable novel length prose, the median fine-tuning and inference cost of $81 per author represents a dramatic 99.7% reduction compared to typical professional writer compensation. Study: [https://arxiv.org/pdf/2510.13939](https://arxiv.org/pdf/2510.13939)",
        "comments": [
            {
                "raw_content": "Exciting times, but further work definitely needs to be done. Generating 450 words of quality prose is impressive, but i don't think turning it into full novels will be as easy as implied. Definitely hopeful for a future where we have a superintelligence for art though, and writing seems to be one of the likely fields to hit it first.",
                "author": "Dangerous-Sport-2347"
            },
            {
                "raw_content": "Considering the number of functional illiterates in this country, I'm not surprised.",
                "author": "Ozzie-Isaac"
            },
            {
                "raw_content": "Not surprising. In an earlier study, AI (some variation across models) already passed the turing test. This is just another step in that direction. From now on, even if you have a brilliant idea, you need to use AI to augment your writing so to be efficient.",
                "author": "NyriasNeo"
            }
        ],
        "subreddit": "singularity"
    }
]