[
    {
        "post_name": "Man made horrors beyond my comprehension.",
        "score": 486,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Doubt it actually works.",
                "author": "GodIsPerfect"
            },
            {
                "raw_content": "Combine that with a sex robot ... and there ya' go! 🤓",
                "author": "drmrboy"
            },
            {
                "raw_content": "Then there's that pesky little problem of an Umbilical connection... I'm calling bullshit.",
                "author": "Moebius"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Dumbass white liberal in DC was trying to face off with the National Guard but caved in fast.....",
        "score": 422,
        "text_content": "",
        "comments": [
            {
                "raw_content": "'white' that is a jew look at that fucking beak every single jew needs to be deported",
                "author": "computermouse"
            },
            {
                "raw_content": "Don't stop crime. Is the next talking point from the DNC.",
                "author": "JoeBidensDementia1"
            },
            {
                "raw_content": "With the paid actors no wonder employment figures are good",
                "author": "FaustyArchaeus"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "HOLY SHlT... City Councilman Abu Musa (D-MI) on tape stuffing ballots in middle of the night from darkened truck (second incident)... He won last week by 76 votes.",
        "score": 599,
        "text_content": "",
        "comments": [
            {
                "raw_content": "(waits for an arrest) ... ... ... ... ....",
                "author": "PutonyourMAGApants"
            },
            {
                "raw_content": "The penalty for election fraud should be death.",
                "author": "RiffFantastic"
            },
            {
                "raw_content": "Musa is an interesting name...old germanic I'm sure.",
                "author": "MakinBacon"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "DC feels like a ghost town, outside of a few semi-busy streets. When Police Lieutenant was asked if it's quiet tonight, he said \"very\".",
        "score": 252,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How many illegals live in DC?",
                "author": "BlackPilledMAGA"
            },
            {
                "raw_content": "Sounds like a good time to visit DC",
                "author": "Threaper666"
            },
            {
                "raw_content": "Elsewhere outside the US, like east Asia, this is considered normal.",
                "author": "Okannah"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Black Americans have started uploading videos requesting President Trump to ‘Clean up Chicago.’",
        "score": 1082,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Pretty much going to have to kill two generations of super predators to scare the next generation straight. There's no fixing these street thugs.",
                "author": "JesusisLordofAll777"
            },
            {
                "raw_content": "You can't fix chicago, wall it off or sink it.",
                "author": "jaeger"
            },
            {
                "raw_content": "There is a reason it is called Chiraq or Chicongo.",
                "author": "Datamancer"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Why would they do this in the middle of the President’s peace talks?",
        "score": 968,
        "text_content": "",
        "comments": [
            {
                "raw_content": "war mongers who want the war to keep going",
                "author": "HellNoKameltoe"
            },
            {
                "raw_content": "Girly Graham thinks sending others to die makes him a man.",
                "author": "perma-maga"
            },
            {
                "raw_content": "Lindsey graham should be drafted and sent to the front lines. It’s disgusting that he’s so willing to send men to die while he sits at home being a fag",
                "author": "TheEmperorProtects"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "CNBC host Joe Kernan provides a list of Trump’s accomplishments to Democract leader Rep Hakeem Jeffries. Then Joe asks him, “where is the calamity you are talking about?”",
        "score": 1123,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Would have loved to hear his response.",
                "author": "Dvan515"
            },
            {
                "raw_content": "That's what get's me. All of Trump's positions are common sense. The tariffs were a risk, but they are working out thus far. He's backed the Democrats into a corner to take every not-sensible weirdo position possible. Their position is quite literally the opposite of whatever our President does. They are not an American political party anymore.",
                "author": "duehuckleberry"
            },
            {
                "raw_content": "Didn't you hear me? Trump is a racist and a dictator!",
                "author": "Apersonofinterest"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Putin Proposes, in Return for the Control of the Donbas Region, to Freeze the Frontlines in Ukraine’s Southern Kherson and Zaporozhie, No More Russian Territorial Conquests: REPORT",
        "score": 741,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The time is today to rectify the situation before war becomes an inevitability. We must ask God to provide wisdom to all parties involved.",
                "author": "Kodesh"
            },
            {
                "raw_content": "Killing needs to stop and the loser of this fight won’t give up.",
                "author": "Sugz_Da_Feefth"
            },
            {
                "raw_content": "Ukrainians are the stubbornest of Slavs, and also the stupidest! - Joseph Goebbels Looking at a short Ukrainian history, they will fuck this up somehow. Khazerian Jew currently in charge of Ukraine isn’t done yet sacrificing slavic men to Moloch.",
                "author": "shrbrn"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "NOW: President Trump is riding around DC in the Presidential Limo as federal agents work in the streets tonight 47 wants a first hand look at the progress of making DC SAFE AGAIN! 🇺🇸",
        "score": 957,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Did he also grab the steering wheel and later kidnap a non citizen while proclaiming this is Trump country?",
                "author": "MooseStangSally"
            },
            {
                "raw_content": "He should buzz 0bama's pad.",
                "author": "MrMcGreenGenes"
            },
            {
                "raw_content": "Big mac or Quarter pounder?",
                "author": "MotherCoconuts"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Smithsonian Should Tell The Real Slavery Story. Slavery originated in Africa over 4,700 years ago. Slavery was exported from Africa to the West. The U.S. and England were the first to abolish it. 7 million people remain enslaved in Africa in 2025.",
        "score": 1204,
        "text_content": "",
        "comments": [
            {
                "raw_content": "lol. Who owned the boats, eh?",
                "author": "Viewer01"
            },
            {
                "raw_content": "They dont care about slavery at all, it's just a weapon to use against Whites and nothing more",
                "author": "magapatriot_pa"
            },
            {
                "raw_content": "Africans sold out other Africans. Who nose who helped organize the sale. 🤷🏻‍♂️",
                "author": "MAGAguitar"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Judge expands restraining order against 'Beto' O’Rourke, adds ActBlue. The order was issued on Saturday after Attorney General Ken Paxton filed a motion",
        "score": 1014,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Damn, that guy keeps losing.",
                "author": "Agent_Orange"
            },
            {
                "raw_content": "It's Robert O'Rourke, he's about as Hispanic as fauxcahontas is Iroquois.",
                "author": "JimmyRussler"
            },
            {
                "raw_content": "Guy is such a crook it’s actually unbelievable. Beta (Robert Francis) O’Rourke that is",
                "author": "TheRPatriot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨Trump launches 'Manhattan Project' as one of America's largest companies set to be nationalized",
        "score": 677,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's Intel because of tension with TMSC/Taiwan. You're welcome. Why would you do us like that OP",
                "author": "Zskills"
            },
            {
                "raw_content": "Intel is going down the shitter lately after the 13th generation CPUs. As a lifetime Intel/Nvidia user, I'm going to try AMD on my next puter build.",
                "author": "MythArcana"
            },
            {
                "raw_content": "Voting for smaller Government I guess ment bigger Government.",
                "author": "RationalThought"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Our country is desperately SICK and we need GOD ALMIGHTY!!!",
        "score": 931,
        "text_content": "",
        "comments": [
            {
                "raw_content": "These people need to be executed publicly. Give them 48 hours in the stocks for people to do whatever they want to them, then hang/drown/shoot/behead them. We need an absolutely brutal deterrent. Starting at the top with people Israel is blackmailing with Epstein files",
                "author": "BigIgloo"
            },
            {
                "raw_content": "JESUS IS LORD",
                "author": "FearGodTheAlmighty"
            },
            {
                "raw_content": "This is why lynchings happened, folks. It happened when the crime committed was so heinous, so unforgivable, that the locals refused to wait for the judicial system to grind slowly into gear. This trial has been going on for TEN YEARS. This woman should have been publicly executed a long time ago.",
                "author": "tholinz"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "“These are Criminals who Support Crime” – Trump Responds to Democrats Paying Protestors to Fight DC Crime Crackdown",
        "score": 807,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Paying them with our tax money still, not theirs.",
                "author": "MythArcana"
            },
            {
                "raw_content": "Then arrest them. Tired of words.",
                "author": "Spawnlingman"
            },
            {
                "raw_content": "&#65038; Take away the broadcasters FCC licenses for egregious false reporting using the public airwaves. &#65038; These air waves are to be used in the public interest, not the lying DNC interests. &#65038;",
                "author": "BallotsOnRubysUSB"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Just in case California goes through with their redistricting threat, I’ll be reminding everyone that if half of Trump voting Californians left the state, they could permanently flip Oregon, Washington, and Colorado OR basically every state in New England.",
        "score": 954,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Washington and Oregon are 100% vote by mail so they will be Democrat run for all of eternity.",
                "author": "MoreVanceMemes"
            },
            {
                "raw_content": "Californians can flip California, voter fraud needs to be cracked down. Newscum didn’t win his mayoral elections, his gov elections, nor his recall.",
                "author": "Nurrun"
            },
            {
                "raw_content": "They recently found 20% of the \"voters\" in WA are not legally registered. That's the ones which were found - so far. WA will be a red state soon like we knew it was all along.",
                "author": "Tradstew"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Cop tells fat black loudmouth to go eat a salad. Fatso gets triggered",
        "score": 1267,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hahahaah, you can choose to eat a salad :)",
                "author": "Trooph-Hurts"
            },
            {
                "raw_content": "I hope these guys can tolerate this bullshit and see it for what it is and don't take it personally. What a fucking sad state of affairs",
                "author": "hughjasske69"
            },
            {
                "raw_content": "He took her advice and chose to be a dietician.",
                "author": "TheyLETyougrabit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Paxton: I just beat Beto in court again. The cabal of Democrats who have colluded together to scam Texans and derail our Legislature will face the full force of the law, starting with Robert Francis O’Rourke.",
        "score": 1213,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Just TWO MORE WEEKS and the Democrats will face consequences for their crimes. Mark my words!",
                "author": "Liberalism_is_mental"
            },
            {
                "raw_content": "Yes, call him by his actual name. Fucking \"Beto\" lmao. Dude has the whitest of white names and tries to go by \"Beto\" to sound Mexican. Robert Francis O'Rourke.",
                "author": "DegenNerd"
            },
            {
                "raw_content": "Sauce: https://x.com/kenpaxtontx/status/1956796987828732398",
                "author": "BallsackPaneer"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "you know their job would be so much easier if they simply reported the truth. And they would be wildly successful. I just don’t get it.",
        "score": 823,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Their job is to lie. The people who pay for it all, have all the money already, making more isn't a real concern.",
                "author": "drattastic1"
            },
            {
                "raw_content": "This is actually fucking true. The real war should be against the media.",
                "author": "goodguy"
            },
            {
                "raw_content": "They are already knee deep complicit in crimes against humanity (lying about COVID n vax) and treason so they can’t stop now!",
                "author": "AngelMark2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The National Guard is preparing to carry weapons in Washington, D.C",
        "score": 757,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How would you feel being a national guardsman sent into that hell hole without a weapon? Why aren’t they already carrying them?",
                "author": "B-2StealthTrump"
            },
            {
                "raw_content": "They weren't already carring them? Who's the mental midget behind that?",
                "author": "Doritalos"
            },
            {
                "raw_content": "Absolutely no details in the video. Why the fuck is this stickied?",
                "author": "HelluvaEngineer"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Being a Democrat changes a man.",
        "score": 1104,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ew dude. We don't have HAVE to see this shit anymore",
                "author": "TommyLasordasBallBag"
            },
            {
                "raw_content": "Being gay or Trans is the only way in the democrat party for white men to advance in power because of victim hood complex. They twist nature with their demonic image of women. To gain power they must appease the demon 'Istar' who is both male and female. Also known as the Enchantress.",
                "author": "Brownwaterboys"
            },
            {
                "raw_content": "They can chop their dicks off and put on lipstick but can’t change their chromosomes.",
                "author": "panic_scam"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"End-to-end fraud\" with hard drives: Seagate finds counterfeit workshop in Asia",
        "score": 404,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I fell victim to modified smart data (Seagate FARM data reported the correct amount of hours) and I purchased from a well known and legitimate retailer in the UK that were not aware of this at all until I raised it with them as the news was breaking. They were great and replaced the disk with a new one which was sourced from a different supplier.",
                "author": "falloutvertigo"
            },
            {
                "raw_content": "once again, the bullshit that is crypto giving birth to more fraudulent industries",
                "author": "Ok_Fish285"
            },
            {
                "raw_content": "I've been having issues with this with hard drives for the last few months purchased online. They all arrive DoA or with high FARM numbers/usage and they've all been sold as new. Crazy that this story just popped up because I've been wondering if I'm just unlucky or if there's a larger scam going on. I've gone back to shucking for now, because at least I'm guaranteed to get an actual drive from the manufacturer that I can be fairly sure is new.",
                "author": "cluberti"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "German tech firm sues Nvidia for patent infringement, seeks to block Nvidia across 18 European countries — ParTec lawsuit alleges DGX AI supercomputer design theft",
        "score": 217,
        "text_content": "",
        "comments": [
            {
                "raw_content": "the idea this won’t be settled with a deal is funny",
                "author": "cquinn5"
            },
            {
                "raw_content": "Just briefly went through the patent, at first i thought if was just MPI implementation but it seems far more clever. Mainly because I thought i did something similar at work Looks like dynamic allocation of resources (based on the model size and efficiency) directly via bluefield nics and allows compute cpu node to share multiple gpus nodes by just bypassing the cpu of the other nodes and using bluefield? That would just allow you to skip past the traditional issue and just get a big fat ram sized resource manager/ compute to distribute and collect info but still maintain the mega speed that they have. (Might be super wrong but that’s what i got) Looks like this comes off run.ai acquisition they did last year as that’s how there had a commercial offering completely integrated for this. Again might be super wrong.",
                "author": "tecedu"
            },
            {
                "raw_content": "I hope Nvidia loses this, they need to get their head right.",
                "author": "ParthProLegend"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "SK hynix Surpasses Samsung as Leading DRAM Manufacturer",
        "score": 172,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Thank you South Korea for the memories 🫰",
                "author": "got-trunks"
            },
            {
                "raw_content": "Wow, SK Hynix's US subsidiary alone had $18bn in turnover during the first half of 2025.",
                "author": "constantlymat"
            },
            {
                "raw_content": "Not surprising. Beyond the HBM/AI success they have had they have also done really well with DDR5. Samsung B-die was king for DDR4. SK-Hynix A-die and M-die are king for DDR5. I also have two SK-Hynix SSDs and the price to performance has been excellent for both.",
                "author": "fissionmoment"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nintendo needs to change the battery protection wording of 90% to 80% since all of the charge is closer to 80%",
        "score": 522,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Mine is usually 87-89%. It varies, don’t worry too much about it",
                "author": "ErsatzCats"
            },
            {
                "raw_content": "Yeah mine is always 84-86% when I have that setting on.",
                "author": "NuketheCow_"
            },
            {
                "raw_content": "mine is always 83%",
                "author": "redmathk"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "What game do you want to play but hopefully waiting for an update patch?",
        "score": 392,
        "text_content": "I bought Witcher 3 for my OLED but my eyes hurt while playing it. If there is no update on a future patch I will still play it when I am done with TOTK and Cyberpunk but will be hard to go from 60fps TOTK down to 30. Fingers crossed 🤞🏻",
        "comments": [
            {
                "raw_content": "Pokémon Legends Arceus.",
                "author": "UnbegrenzteMacht"
            },
            {
                "raw_content": "Witcher 3",
                "author": "Flat_Refrigerator388"
            },
            {
                "raw_content": "Probably never going to happen but Arkham Knight",
                "author": "Pakmanjosh"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "How is the Pro Controller 2 performing for everyone?",
        "score": 52,
        "text_content": "I love the comfort and feel of it, but for example, in Bananza's skill menu both the left Joystick and the D-pad are really imprecise, sometimes they jump to the wrong direction in a way that's impossible to ignore.",
        "comments": [
            {
                "raw_content": "The issue with the Bananza menu is deff a game thing, not a controller thing.",
                "author": "Horvat53"
            },
            {
                "raw_content": "Probably the most comfortable controller I own. I wish the d pad was better and Nintendo went for analog triggers",
                "author": "fukkdisshitt"
            },
            {
                "raw_content": "I think this is just an issue with Bananza in the menus as I also noticed this. It was before I got my pro controller and was using the Joy Cons 2. It's not the biggest issue, but I won't lie in that, I thought my sticks were drifting already.",
                "author": "OctoLiam"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "How do you get onto this ledge?",
        "score": 173,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Update: I've pulled a muscle trying to make this jump",
                "author": "Jammie_B_872"
            },
            {
                "raw_content": "Your chair is leaving yellow trails behind it. If you pause at the right split-second moment at 0:26 or look at this screenshot, the trails are showing that you jumped a bit early. [https://i.imgur.com/ontuY6f.jpeg](https://i.imgur.com/ontuY6f.jpeg)",
                "author": "LunchPlanner"
            },
            {
                "raw_content": "Does this game have a single player mode in it? Or is it mostly a multiplayer game?",
                "author": "idc8188"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Dream Ports / Wishlist",
        "score": 9,
        "text_content": "What are some of y’all’s dream Switch / Switch 2 ports? For the sake of discussion, they have to be within the realm of reason (especially power & IP-wise). As of right now, my list looks something like this: > Tiny Glade (Pounce Light, 2024) - would benefit a lot from mouse controls, has no console release atm, cutest and coziest art game ever. > Slime Rancher 2 (Monomi Park, 2025) - technically not released yet, sequel to game which has already received a Switch port. > The Henry Stickmin Collection (PuffballsUnited, 2020) - similar to Tiny Glade in both the sense that it has yet to receive a console port of any kind and the fact that it would greatly benefit from mouse compatibility. I love this game to death. > Marvel Rivals (NetEase, 2024) - EVERY SINGLE OTHER PLATFORM HAS THIS GAME, and I can’t even imagine the hours I’d clock on this on a Switch. > Lethal Company - I am aware that this game has not exited early access, but it’d be a great use of those new microphone and camera features > SpyParty (Hecker & Cimino, 2018) - oddball pick, but it ran on the 360 and it feels very Nintendo-esque in its simplicity and nature, like a Wii Play minigame",
        "comments": [
            {
                "raw_content": "The Fallout series.",
                "author": "Snoo_84661"
            },
            {
                "raw_content": "Mass effect legendary edition",
                "author": "Gabbuino91"
            },
            {
                "raw_content": "RE2,3,4 remakes. 7 and Village. The Umbrella and Darkside Chronicles games Blue Prince Clair Obscur Hotel Dusk/Last Window Wind Waker and Twilight Princess at 4K60 Mario Galaxy 2 Metroid Prime 2 and 3 (OD’s on copium)",
                "author": "logica_torcido"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Can I disable the home button and capture button on a switch 2 controller for my toddler so they stop exiting the game by accident?",
        "score": 56,
        "text_content": "Text",
        "comments": [
            {
                "raw_content": "The Home button can't be remapped, but you could give them just a left joycon and disable the Capture button.",
                "author": "RegisPhone"
            },
            {
                "raw_content": "I give my toddler a dead controller to pretend to play with me and our eldest (4)",
                "author": "Suspicious-Screen-43"
            },
            {
                "raw_content": "I use a left joycon 1 or the 8bitdo zero 2 controller for my toddler.",
                "author": "isaymoo2"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Has anyone figured out why Switch 2 gets so hot in the dock when in sleep mode?",
        "score": 3,
        "text_content": "I just removed my Switch 2 from the dock after it was asleep (and fully charged) for several hours,and it's noticeably warm. This is not a new occurrence, it's been doing this for 2 months now. I understand there's the whole \"Ethernet connected in sleep mode\" but that doesn't seem like enough to justify this level of heat output, especially compared to other modern electronics. I leave my laptop on without sleep mode wired to Ethernet, and it never heats up, and neither does my phone. For all the talk about air vents in the Switch 2 dock allowing air flow, and the 3rd party dock not having air vents, it seems the vents on the Switch 2 dock aren't doing much for air flow if removing a Switch 2 asleep for hours still results in a very warm console.",
        "comments": [
            {
                "raw_content": "I had the same issue when using ethernet. After I disabled \"Keep Wired Connection Active in Sleep Mode\", everything went back to normal.",
                "author": "Vertigo3765"
            },
            {
                "raw_content": "This is not a problem. The system is warm because the OS is still running various processes in Sleep Mode, but the fans are switched off because the system isn't getting hot enough to require them. It's 100% okay for electronics like this to sustain warmer temperatures. Unless it's uncomfortably hot to the touch, it's likely just operating as intended.",
                "author": "ConflictPotential204"
            },
            {
                "raw_content": "It's a glitch with ethernet connectivity. If ethernet is disconnected it'll sleep perfectly fine without any heat. If it's connected it'll heat up because reasons.",
                "author": "nater416"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Madden - how do you turn off the awful film grain?",
        "score": 7,
        "text_content": "Haven't played Madden in many years didn't know if there was a way to turn off the film grain or not",
        "comments": [
            {
                "raw_content": "Turn off HDR in the Switch’s system settings. Madden looks terrible with it on.",
                "author": "mvpilot172"
            },
            {
                "raw_content": "Weird side question but can you confirm if there is a halftime show in the Switch 2 version? I've read conflicting things.",
                "author": "Longueurs"
            },
            {
                "raw_content": "Turn off the game. Win.",
                "author": "LawfulnessPractical"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "New Nintendo Code Names",
        "score": 319,
        "text_content": "Before Midori/Ryan from the Bronx was exposed, they had previously shared real code names that were later proven true. Edward - The Legend of Zelda: Echoes of Wisdom Banquet - Mario Party Jamboree Spiral - [Probably Splatoon Raiders](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1l7zic7/splatoon_raiders_revealed_lines_up_with_the/) New code names that weren't reported here for some reason: [\"sts\"](https://imgur.com/a/pYRa1gV) \\- Xenoblade Chronicles X: Definitive Edition - Found by extracting the game rom via an emulator. Archive contains .ard/.arh files that point to code names in other Xenoblade Switch games. Can be read as an acronym of \"SpaceTravelSwitch\", as the Wii U version had the code name \"SpaceTravel\". NOT Legacy. [\"Drive\", \"U-King-O\", \"EX-King-O\"](https://nintendosoup.com/the-internal-project-name-for-mario-kart-world-has-been-confirmed/) \\- Mario Kart World, BOTW Switch 2 Edition, TOTK Switch 2 Edition (respectively) - Reported by Nintendo Soup, corroborates [previous rumor](https://nintendoeverything.com/rumor-nintendo-working-on-project-with-codename-u-king-o-possible-new-version-of-zelda-breath-of-the-wild/) & follows previous Mario Kart code name conventions. Still Unknown: [SilverStar](https://xcancel.com/Nintendeal/status/1794215410054889940?lang=en) \\- Possibly Donkey Kong Bananza ([Cancellation claim was corroborated by Switch 1 version being canned](https://nintendoeverything.com/donkey-kong-bananza-was-originally-a-nintendo-switch-1-game/). Can be read as a variation on the name \"RedStar\", Odyssey's code name. DKB Key staff also worked on Odyssey) Anna - Drag x Drive? [Legacy](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1d2xc4q/midori_i_was_told_a_few_months_ago_that_monolith/) \\- New Monolithsoft game SPRed - [Apparently confirmed by Ryan to be Zapper & Scope SP for the Nintendo Museum according to TCRF](https://tcrf.net/The_Cutting_Room_Floor:Project_Names/Nintendo).",
        "comments": [
            {
                "raw_content": "assumedly Anna was talked about for something Switch sports related mostly due to the fact Elsa was the name for Switch sports code name so frozens \"Anna and Elsa\" would be matching, we also had the patent of some sort of [fish wheel looking thing ](https://www.polygon.com/nintendo-switch-2-joy-con-fishing-crank-wheel-patent/)which looks like it could come with said Switch sports 2 given the first game had a [leg strap ](https://switchsports.fandom.com/wiki/Leg_Strap)that was used with the game",
                "author": "LuigiWarrior"
            },
            {
                "raw_content": ">Anna I know the mascot for Fire Emblem when I see it",
                "author": "noirblancherouje"
            },
            {
                "raw_content": "The leader of a group of gorillas is called silverback, so SilverStar works for DK. Legacy really sounds like it will have a connection to other things... either the pas Xenoblade games... or what came before.",
                "author": "Phos-Lux"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "fairgames is not canceled, Michael Pachter misspoke about Fairgames' cancellation",
        "score": 264,
        "text_content": "https://www.pushsquare.com/news/2025/08/dont-believe-the-speculation-about-ps5s-fairgames-getting-cancelled “I misspoke. Said Jade was let go, and assumed it was cancelled. I have no info on the game at all. Feel free to quote this, I truly don’t know.\" -Michael Pachter",
        "comments": [
            {
                "raw_content": "First hint that this wasn’t true is that Pachter is involved.",
                "author": "ScalaAdInfernum"
            },
            {
                "raw_content": "That Pachter still has a career at this point is crazy",
                "author": "Mazzle5"
            },
            {
                "raw_content": "Pachter has been the single most unreliable voice in gaming for over 20 years at that point. Dude was sure GameCube would break all records and PS2 would fail",
                "author": "realblush"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "According to a former Ubisoft employee, an original Rayman remake was scrapped in 2021, going under the titles, “RAYMAN: FOREVER,” and, “THE STORY OF RAYMAN”",
        "score": 380,
        "text_content": "https://xcancel.com/raymantogether/status/1956755620067209658?s=46 https://xcancel.com/raymantogether/status/1956758605350191247?s=46",
        "comments": [
            {
                "raw_content": "The worst kind of rumor is of cancelled games, because if it’s true we’re not getting the game, and if it’s fake then we’re still not getting the game.",
                "author": "anonsyed"
            },
            {
                "raw_content": "History teaches us games with the subtitle \"Forever\" either take that long coming out or never come out at all.",
                "author": "XthecreatordayX"
            },
            {
                "raw_content": "There is still a Rayman remake in development, by the way. Ubisoft confirmed just last year that it's working on a new Rayman game. Therefore, that Rayman remake can't possibly be the same as this one, since it was supposedly scrapped in 2021",
                "author": "Blue_Sheepz"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[1BF] BF6's two larger maps' (Mirak Valley and Eastwood) sizes leaked",
        "score": 295,
        "text_content": "- The ongoing complaint from the beta is that the maps are too small but both these leaked maps look way bigger which is a good thing - There is also the third big map, Sobek City Source: [https://ibb.co/RpCXgypF](https://ibb.co/RpCXgypF)",
        "comments": [
            {
                "raw_content": "When are the California maps coming? I hope it’s like a CoD situation where the game launches and then season 1 starts only a month later. Maybe it's California themed with the Battle Royale? This could be a game saver because there are 4 California maps that have been leaked: 2 new maps, 1 map taken from a section of the BR, and a remaster of Downtown from BF Hardline. I haven't seen much talk about it. It'd be huge if most or all of these are big maps, which they seem like they are.",
                "author": "Frankospaghetti"
            },
            {
                "raw_content": "Isn’t Eastwood the BR map? Confused on how the multiplayer map bigger then the BR map",
                "author": "Educational_Hawk_552"
            },
            {
                "raw_content": "It's almost like they told people there'd be bigger maps.",
                "author": "FaithlessnessFew6571"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Datamined Mirak Valley and Eastwood map for battlefield 6 (from an early game build), 3d views and a 23k resolution top down view from blender viewport",
        "score": 130,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Getting Eastwood, Badlands, and Downtown for S1 would be so goated.",
                "author": "PiccoloTop3186"
            },
            {
                "raw_content": "Both Eastwood and Mirak are standard all out warfare maps and have nothing to do with the battle royale map coming the leaked video of the “battle royale” was actually from Eastwood",
                "author": "Tickythericky"
            },
            {
                "raw_content": "Is that a fucking drivable golf cart?!",
                "author": "ProlapseFromCactus"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Michael Pachter says that Fairgames is cancelled",
        "score": 419,
        "text_content": "It's in the latest episode of his show [Pachter Factor](https://youtu.be/_WuLcrpCkkc?si=YfYfh3zA4TRqB6rA&t=227)",
        "comments": [
            {
                "raw_content": "On one hand I believe this will happen on the other it requires me to believe Pachter.",
                "author": "Granum22"
            },
            {
                "raw_content": "I wouldn’t be surprised but also Michael Pachter is not a reliable source, I’m honestly shocked he still has a job as an analyst after all the predictions he’s got wrong.",
                "author": "Gen6V"
            },
            {
                "raw_content": "What even did Jade Raymond do, after leaving Ubisoft in like 2014….",
                "author": "skylu1991"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[JoBlo and DanielRPK] Possible logline for Zach Cregger's 'Resident Evil' film",
        "score": 133,
        "text_content": "Just yesterday, rumors began to emerge regarding a tentative synopsis floating around for the upcoming *Resident Evil* film being helmed by Zach Cregger, the filmmaker who wrote/directed *Barbarian* and whose horror-thriler film *Weapons* recently bowed in theaters last week. During the press junket for the latter film, Cregger already confirmed that his cinematic take on the Capcom franchise will feature an **entirely original narrative** set within the continuity of the games as opposed to adapting a pre-existing story, and now film review and news site JoBlo has scooped a rough summary of this potential plot, coupled with a tweet from Daniel Richtman (DanielRPK on Twitter) who has shared a potential logline for the film as well. Grain of salt as always. [JoBlo reported that the screenplay](https://www.joblo.com/resident-evil-logline/), which Cregger co-wrote with *John Wick Chapter 4* and *Ballerina* scribe Shay Hatten, centers on a **downtrodden courier tasked with delivering a package to a remote hospital**. While en route, he will supposedly **be drawn into the middle of a viral outbreak and be forced to fight hordes of mutated creatures**. Shortly thereafter,[ Richtman's alleged logline ](https://xcancel.com/DanielRPK/status/1956075290653868405)elaborated on this brief synopsis, claiming that this courier, who is expected to be played by [*Weapons'* Austin Abrams](https://deadline.com/2025/03/resident-evil-austin-abrams-zach-cregger-1236346563/), is named \"**Bryan**\"; he is coerced into discovering this outbreak by a \"**strange woman**\" he accidentally hits with his car while driving on a snowy mountain range. The creatures in question will supposedly comprise \"**tentacle-based mutations**\" and \"**bio-engineered monstrosities**\", which would be on brand for Umbrella Corp. shinanegans transpiring over the story. Again obviously, none of this is confirmed and people who follow film scoops should know about DanielRPK's particularly spotty track record with regards to general entertainment and industry info, but the viral outbreak backdrop and the activity of experimented creatures does track aesthetically with the games, and despite everyman protagonists being more prevalent in a series like *Silent Hill* overall, a character like Ethan Winters in the last two entries is an example of the games already having a precedent for having a primary point-of-view from a character that is seemingly drawn into conflict with no real combat experience like Jill, Leon, Claire, Ada or Chris. Obviously at present, Cregger is remaining tight-lipped on the nature of whatever story he has planned, but he has expressed the[ film's influence from cult horror classics like *Evil Dead II*](https://bloody-disgusting.com/movie/3892737/zach-cregger-compares-his-austin-abrams-led-resident-evil-movie-to-evil-dead-2/) and his desire to make a more kinetic, journey-driven film than the more methodical pacing of either *Barbarian* or *Weapons*. *Resident Evil* will be co-produced by Constantin Film and Sony Pictures through their PlayStation Productions label, and will be released theatrically on September 18, 2026.",
        "comments": [
            {
                "raw_content": "I think a re7 movie would be very interesting",
                "author": "GoingDeath-"
            },
            {
                "raw_content": "After seeing weapons I trust this guy completely",
                "author": "Rainbowdogi"
            },
            {
                "raw_content": "This sounds good, idk why people want another remake of the existing RE stories as if we’re not gonna see a game remake of resident evil 1 at some point.",
                "author": "VictorVonDoomer"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Core Ultra 7 254V spotted on PassMark, Furmark and Vulkan websites, new Lunar Lake SKU incoming",
        "score": 66,
        "text_content": "",
        "comments": [
            {
                "raw_content": "When are the prices for Lunar Lake handheld gaming systems going to come down? There are versions of the MSI Claw with LL that are close to $1000. Maybe MSI will come out with new Lunar lLake Claws? This should bring the price down. Does anyone know?",
                "author": "quantum3ntanglement"
            },
            {
                "raw_content": "Are there even alot of 256v in the first palce? AFAIK 226v 228v 258v and the flagship 288v are the most common ones",
                "author": "Creative-Expert8086"
            },
            {
                "raw_content": "sorry guys, didn’t mean to leak it",
                "author": "dollarnine9"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "First AMD build",
        "score": 58,
        "text_content": "I am really happy with my first AMD build. 1440p ultra in amost everything I play. Coming from an intel 11thgen+3070 laptop this is a massive upgrade! I was originally planning to go high end with a 9800x3d and a 5070ti or 5080 but I couldn't pass up a screaming deal on this 7800xt. Here's my build list. What would your upgrade path be in the future with this build? Not really asking for personal advice, I'm just curious. I'm flirting with the idea of flipping the 7800xt for cash towards a 5070 7800x3d - undervolted -30 all cores (very happy with this as I've never undervolted anything before and the temps with this are SO LOW) XTX Speedster Merc 319 7800xt PNY xlr8 32gig ddr5 6400 cl36 Msi b650 gaming plus wifi Msi MAG Coreliquid 360AIO Msi MAG 850w psu Msi gungnir 300r airflow case",
        "comments": [
            {
                "raw_content": "Makes think of \" PURPLE RAIN \". Good job 👏.",
                "author": "Icy-Pair-9401"
            },
            {
                "raw_content": "Does 7800x3d get high temps quite easily? Asking cause I'd understand if you had air cooler, but you got water cooler and still undervolted.",
                "author": "InfinityNo0b"
            },
            {
                "raw_content": "That’s a nice pc. Nice colour too.",
                "author": "Darthandroide"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "ASRock Creator Radeon AI PRO R9700 officially costs $1329",
        "score": 87,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What in the coil wine is this?",
                "author": "el_pezz"
            },
            {
                "raw_content": "If you need HDMI, the ones from Gigabyte and Asus have one HDMI output. The others have four Displayport.",
                "author": "Nuck_Chorris_Stache"
            },
            {
                "raw_content": "Should Have Been $1337........",
                "author": "OtisTDrunk"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Best mini PC of the year? AMD Strix Halo, 128 GB RAM & Radeon RX 8060S reviewed in the Bosgame M5",
        "score": 25,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Still waiting for this chip to appear in a non overpriced HP laptop.",
                "author": "Qaxar"
            },
            {
                "raw_content": "$1700 isn't terrible but not what people looking for this chip were hoping for.",
                "author": "Agentfish36"
            },
            {
                "raw_content": "The competition must be two empty beer cans and a string if this is a contender for the \"best mini PC of the year.\"",
                "author": "The_Zura"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "ASUS debuts ROG GM700 gaming desktop PCs with Ryzen 7 9800X3D and Ryzen 7 8700F CPUs",
        "score": 10,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I thought this debuted at CES",
                "author": "996forever"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Lowball offers are insulting",
        "score": 19,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">everything has been well taken care of and functions 100% Isn’t that like the bare minimum? If they wanted to initially list at $550k, and had an offer for $540k, why didn’t they take it?",
                "author": "EdgarsRavens"
            },
            {
                "raw_content": "The fact OP contradicted themselves in the same post is hilarious to me. But that's normal for Reddit. First the house needs work and then it doesn't. Make it make sense.",
                "author": "Total_Anything_1610"
            },
            {
                "raw_content": "Hey look, another one of those folks with a \"locked in\" rate that will never sell.",
                "author": "debauchasaurus"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Lowball offers are insulting",
        "score": 6,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I KNOW WHAT I HAVE!!!!!!",
                "author": "geoguy78"
            },
            {
                "raw_content": "There's gonna be a lot of insulted sellers in the next few years.",
                "author": "ohhellnaah"
            },
            {
                "raw_content": "I'm not offering $70K below asking, you're asking $70K above offering.",
                "author": "indyprivatelending"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "This is fucking insane",
        "score": 7321,
        "text_content": "It's an actual attack on our vulnerable population, old people and children",
        "comments": [
            {
                "raw_content": "Zuck’s vision of the future",
                "author": "Beeehives"
            },
            {
                "raw_content": "Step mom? Lmaooo",
                "author": "swarmy1"
            },
            {
                "raw_content": "I am more surprised by the messages it gets, rather than the mere existence of it. Shocking",
                "author": "lone-guyland"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gpt-5 Took 6470 Steps to finish pokemon Red compared to 18,184 of o3 and 68,000 for Gemini and 35,000 for Claude",
        "score": 437,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Would be nice to also have the total cost for each one",
                "author": "LucasFrankeRC"
            },
            {
                "raw_content": "You can only directly compare o3 and GPT-5. Gemini used a different harness. I wasn't aware a Claude model has finished a Pokemon game. GPT-5 is clearly a big improvement over o3, I've noticed it watching the streams, and chatting.",
                "author": "Atomic258"
            },
            {
                "raw_content": "How is it compared to a human?",
                "author": "MolonDrone"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Do you think sex robots and AI will replace the pornography industry?",
        "score": 125,
        "text_content": "",
        "comments": [
            {
                "raw_content": "replace? you mean the industry will be the ones to supply it",
                "author": "Upset_Programmer6508"
            },
            {
                "raw_content": "I think AI will readily replace all things digital at some point in the fairly near future - from Onlyfans to porn. And it will be ∞-ly better than today. It’s a ginormous, largely untapped market that I feel today’s AI could readily manage if filters were removed plus a decent front end. Sex robots feel much further out, outside of pure novelty. I mean, Real Dolls today represent the high end sex doll robots and they typically cost $5-7k. And that’s just for static silicone models. With decent robotics + AI, they’ll likely premiere at $25-50k. And slowly dropping to $10k models in another 2-4 years. Decent sex robots won’t come until robotics makes considerable improvements in more basic areas - likely as back-end restaurant workers, hotel cleaners, electricians, plumbers, and many other hands on, blue collar work. If robots can do any of those jobs effectively, sex work should be a walk in the park.",
                "author": "AppropriateScience71"
            },
            {
                "raw_content": "Replace? No. Compliment. Yes",
                "author": "VolunteerNarrator"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Sam Altman Absolutely Despises Elon Musk. Now He Is Going After His Empire, One Company At A time",
        "score": 984,
        "text_content": "",
        "comments": [
            {
                "raw_content": "lol in the fight between Sam and Musk, Zuckerberg wins? Remember the times when people hated Zuckerberg more than these two? I don't even know who i like anymore",
                "author": "fli_sai"
            },
            {
                "raw_content": "Gotta love these incendiary headlines from sites like Forbes. And the reality is completely inverse. It's Elon who despises Sam Altman for being in control of OpenAI... which he wanted (at one point) to absorb into Tesla.",
                "author": "Cagnazzo82"
            },
            {
                "raw_content": "Weird spin, Elon is the one who is going after Sam’s company and now he’s sweating",
                "author": "taehyung9"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Sam Altman: “We have better models, and we just can’t offer them because we don’t have the capacity.”",
        "score": 603,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They will suddenly have the capacity for better models after Google release Gemini 3",
                "author": "AaronFeng47"
            },
            {
                "raw_content": "She is blond and live in another country, i wish she was here right now.",
                "author": "Yasirbare"
            },
            {
                "raw_content": "Everyone has better models internally than their public ones. If they didn't they'd have given up on the AI race.",
                "author": "bazooka_penguin"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The “warmer” GPT 5 is annoying",
        "score": 142,
        "text_content": "I instantly vibed with the “helpful assistant” vibe of the OG 5. Now I’m asking about hair follicles and it’s telling me “you really reached the crux of the topic”… gurl stfu and just answer my question 😭 OpenAI should probably have two modes, friendly and helpful",
        "comments": [
            {
                "raw_content": "In the settings just set it to robotic. Easy fix.",
                "author": "ThenExtension9196"
            },
            {
                "raw_content": "Yeah same, putting hearts and shit like bruh, just answer the fucking thing",
                "author": "Oriuke"
            },
            {
                "raw_content": "Blame the botlickers.",
                "author": "After_Self5383"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "There's a new AI model by google (Edit image AI model) named nano-banana (now in LMArena). This is by far THE MOST CONSISTENT MODEL I HAVE EVER SEEN INSANE",
        "score": 251,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That actually is high consistency. Hair length is just about perfect between both images.",
                "author": "o5mfiHTNsH748KVq"
            },
            {
                "raw_content": "Miku is probably one of the worst tests for this. There will be a huge amount of Miku images from all possible angles in the dataset, she is way too popular. Try a less popular character, or even better some OC.",
                "author": "Malfrador"
            },
            {
                "raw_content": "Problem is you used the most known vocaloid on the planet to test this, which it has had millions of images of her to train on probably",
                "author": "Happy7User"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Despite facing many problems and the intense efforts of rival companies, OpenAI still dominates the majority of AI traffic.",
        "score": 96,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Many people are also just using the AI summary at the top of Google searches in place of usually a dedicated LLM chat because it does give you similar output in many cases when trying to search for something while being faster and easier to access. That won't be measured in these graphs but I do think it's good to point out.",
                "author": "DistantRavioli"
            },
            {
                "raw_content": "I hope Gemini is more capable of agentic coding in the next release. Need a lot of competition in the space.",
                "author": "strangescript"
            },
            {
                "raw_content": "Because for lay people, the models do not make that much difference, and openAI has the first mover advantage.",
                "author": "NyriasNeo"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Google develops Projects feature for Gemini",
        "score": 160,
        "text_content": "Finally! Can't wait for the release",
        "comments": [
            {
                "raw_content": "looking forward to this",
                "author": "ThunderBeanage"
            },
            {
                "raw_content": "finally but I'm not sure it'll help if it keeps hallucinating on code as much as it does Either way excited to try it. On paper Gemini should dominate but Claude is still ahead by a bit. idk maybe I am misunderstanding the context window but I've been assuming that such a large window would let it hallucinate less",
                "author": "NeedsMoreMinerals"
            },
            {
                "raw_content": "3mini when?!???!?",
                "author": "The_Scout1255"
            }
        ],
        "subreddit": "singularity"
    }
]