[
    {
        "post_name": "BILL GATES: \"For every disease that we don't have vaccines, we will try mRNA\". He's trying to kill us.",
        "score": 407,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They've traumatized an entire generation with this shit. Even the most diehard vaxers I know haven't kept up with the shots. They are going to have to have the world body confront something truly frightening (like weaponized Ebola) before anyone puts another MrNA shot into their fucking arm. I guess they could try to slip it into the schedule, but parents will pick up on that quick. I think covid and their absolutely shitty response basically killed the technology (which wasn't that great to begin with).",
                "author": "cereal_killer"
            },
            {
                "raw_content": "Who the fuck put him in charge of this shit????",
                "author": "Mungo"
            },
            {
                "raw_content": "WE'RE GONNA NEED A BIGGER PIE",
                "author": "cyberrigger"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Rep. Anna Paulina Luna just said House leadership is trying to pressure her into NOT bringing a petition to pass a ban on Congressional stock trading.",
        "score": 382,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“Let us all keep insider trading” brought to you by the same people who told us “there’s no Epstein files bro trust me” … things that make you go hmmm",
                "author": "BidenSniffsLittleKid"
            },
            {
                "raw_content": "why does Congress need to trade stocks? just keep your portfolio the same until you leave office. also, term limits.",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Work for wages? Imagine their indignation!",
                "author": "Bohemyth_2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Wow! Canada has just announced that it is backing statehood for Palestine. That will make it very hard for us to make a Trade Deal with them. Oh’ Canada!!!",
        "score": 397,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What does Israel have to do with American-Canadian trade deals? Things that make you go hmm",
                "author": "BidenSniffsLittleKid"
            },
            {
                "raw_content": "America first",
                "author": "TwoWords"
            },
            {
                "raw_content": "Why should I FREAKING CARE what's going in the Middle East? I don't. They could wipe each other off the face of the earth and it wouldn't be a scratch on my nose. I can not comprehend why this matters. Go ahead Canada, be Palestine first. As for you, Mr. President, be America first, and don't let us be involved in conflicts that have nothing to do with us.",
                "author": "TheMrStone"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "TRUMP: \"I don't care what India does with Russia. They can take their dead economies down together, for all I care.\"",
        "score": 371,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You know your economy is dead when it's comprised of faggots who don't know how toilets work, scamming grandmothers for gift cards over the phone. *Fuck India*",
                "author": "NewGoldenAge"
            },
            {
                "raw_content": "damn no wonder elon and Trump got into a tissy!",
                "author": "SquirreleeDan"
            },
            {
                "raw_content": "Haha this is great bye bye h1b",
                "author": "Ur2sm4rt"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Fort Hood's name has officially been restored, in honor of WWI hero Colonel Robert B. Hood",
        "score": 1067,
        "text_content": "",
        "comments": [
            {
                "raw_content": "...and the Fort Hood terrorist, who murdered 13 people in 2009 , has yet to be executed.",
                "author": "SubmarineGuy"
            },
            {
                "raw_content": "Cuck ass shit. Name it for who it was named for you fucking pussy.",
                "author": "Toecutter7N6"
            },
            {
                "raw_content": "Good, but still strange. Loophole silly stuff. In the future, will Fort Trump be named due to the fine print that says it was to honor Judd Trump. Braxton Bragg? No, Roland L. Bragg. Henry L. Benning? No, Fred G. Benning. It is sort of likes the Dukes from Hazzard renaming their automobile the Major General Robert G.F. Lee.",
                "author": "magnokor"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "They all got the same script.",
        "score": 923,
        "text_content": "",
        "comments": [
            {
                "raw_content": "dont forget the covid script. i got covid. i am currently recovering. thank god i was vaccinated 7 times. get vaccinated!",
                "author": "Deplorable556"
            },
            {
                "raw_content": "They always get the same script and the same assholes fall for it every time.",
                "author": "harryparatestes"
            },
            {
                "raw_content": "60th Anniversary of…robbing the middle class to buy the votes of the poor and incentivizing people to come here illegally to game the House seat apportionment following each census.",
                "author": "GuidedDisinfo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "DO IT",
        "score": 1330,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Seriously, ive never agreed with Ron Paul so much in my life.",
                "author": "here2red"
            },
            {
                "raw_content": "YES!!!",
                "author": "live3ordye"
            },
            {
                "raw_content": "Apparently it takes an act of congress to end it, and many in congress are owned by Israel. At its founding the jews owned around eighty percent of the fed.",
                "author": "TrumpAndGodWin"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "FBI Atlanta : A Marietta man has been convicted after a week-long trial for stealing $9.6M in PPP loans and $3.4M through tax fraud. Here's a glimpse at the luxury lifestyle he funded with YOUR tax dollars — and what he's now paying the price for.",
        "score": 893,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Glad somebody got caught for something. Facing 170 years. The man lived the good life on our dime. Hope no quarter is given.",
                "author": "airborne3502"
            },
            {
                "raw_content": "\"A Marietta man\"",
                "author": "Gunmolester"
            },
            {
                "raw_content": "If you steal that amount of money, from anyone, you should be living in South America under a new name before they even realize it’s been stolen.",
                "author": "Double_D"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Brown University has agreed to pay out $50 MILLION after the Trump admin cracks down on their woke, discriminatory policies. Brown will also BAN men from women’s sports and ditch DEI, opting for merit-based admissions.",
        "score": 1269,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Great, but without Congress passing legislation to prevent the next admin from funding this idiocy again, this is temporary.",
                "author": "I_Am_John_Galt"
            },
            {
                "raw_content": "We absolutely have to win the next presidential election and continue to marginalize the left. These institutions are hoping to wait out Trump and sleaze back into their shitty worldview politics the minute the pressure is off. We need the time for a national reset to make the thought of this shit so repugnant they self-police it.",
                "author": "Stoya9186"
            },
            {
                "raw_content": "They need to suspend federal funds to these places for a period of time. They have massive endowments that need to be spent.",
                "author": "Narcan"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨Jake Tapper asks Nancy Pelosi to respond to accusations of insider trading. Nancy proceeds to sound as guilty as possible… “That’s ridiculous… I’m not into it, my husband is but it isn’t anything to do with anything insider.”",
        "score": 1194,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Alex Jones says it's common for politicians to do insider trading by using a close relative, spouse, etc.",
                "author": "TrumpAndGodWin"
            },
            {
                "raw_content": "Amazing that the question was even asked. Does he not realize Liberal icons must never be questioned?",
                "author": "SubmarineGuy"
            },
            {
                "raw_content": "\"Of course *I* don't do it, but my spouse that I live with and share a bank account with does, but don't worry there's no incentive for me to tell him privileged information that could also make me rich!\"",
                "author": "Wtf_socialismreally"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I am pleased to announce that the United States of America has agreed to a Full and Complete Trade Deal with the Republic of Korea.",
        "score": 1257,
        "text_content": "",
        "comments": [
            {
                "raw_content": "so that brings the trade deal tally to the UK, the EU, Japan, Korea, the Philippines, Indonesia, and Vietnam. Who did I miss?",
                "author": "OTher55"
            },
            {
                "raw_content": "This trade deal was masterful. Charging South Korea a 15% tariff on their exports while allowing USA products into South Korea with no tariffs.",
                "author": "raptormissle"
            },
            {
                "raw_content": "This is huge. And when we complete the China deal our economy will moon. Tariff's have proved to be smart as fuck.",
                "author": "America_No_1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Clapper Crew Threatened Whistleblower Who Refused To Sign Off On Fabricated Intel Assessment. ‘You need to TRUST ME on this,’ Clapper’s crony told the analyst, saying he ‘would need to demonstrate [his] ability to “outgrow”’ the refusal to sign off on assessments he did not concur with.",
        "score": 1154,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Need to pass it to know whats in it?",
                "author": "ParticleCannon"
            },
            {
                "raw_content": "Clapper is going to be begging for TRUST in prison soon.",
                "author": "raptormissle"
            },
            {
                "raw_content": "By this time next year, he will be in prison and it will be like a hamster cage with an automatic dispenser of nutrition pellets. Not enough to fill you, but enough to keep you alive And just to make it extra special, the autofeeder will be activated using *The Clapper*, and it will only give half the pellets, with each successive clapp activation giving a little bit more but less and less each time Also, six flags commercials play non stop in his cell And he has to share his cell with 7 skunks with their scent glands removed (we're not animals!)",
                "author": "5DchessWatch"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump issued a strong warning to the UK Prime Minister for starting a mass censorship campaign",
        "score": 1355,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Turns out the UK PM WAS lying to Trump's face when the press asked them yesterday about the UK censoring Trump's Truth Social.",
                "author": "OTher55"
            },
            {
                "raw_content": "It should be the British people issuing the strong warning.",
                "author": "Wexit-Delecto"
            },
            {
                "raw_content": "Time to discuss withdrawal from 5 Eyes and NATO.",
                "author": "Citizen_Bob"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "UPDATE: Cincinnati Councilwoman Victoria Parks who celebrated the violent assault on a White couple just nuked her X account.",
        "score": 1305,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Segregation doesn't seem completely unreasonable in 2025.",
                "author": "Coprolite"
            },
            {
                "raw_content": "Blacks are black 100% of the time. Whites need to be white 100% of the time.",
                "author": "JohnN"
            },
            {
                "raw_content": "So tired of these dumb shaved apes even being part of society, let alone having a platform to show just how dumb and low IQ they are.",
                "author": "South_Florida_Guy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Bunch of Faggots: Los Angeles City Council has approved a ban on use of racial, gender slurs at public meetings",
        "score": 997,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The LA council is composed of a bunch of racial and gender slurs.",
                "author": "raptormissle"
            },
            {
                "raw_content": "That’s not how the 1st Amendment works, commies. If you are a government body, we are allowed to be as uncivil, disrespectful, and “hateful” as we believe necessary to get our point across. Enjoy your lawsuits, which will surely be coming soon.",
                "author": "GuidedDisinfo"
            },
            {
                "raw_content": "Just call them retards",
                "author": "Salty_Sailor"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Jerome Powell waiting for inflation from the tariff!",
        "score": 453,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This guy is holding back the real estate market and he needs to go.",
                "author": "Nostrangertotherain"
            },
            {
                "raw_content": "Gonna turn into the Skeleton meme soon :p",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "He should stop inflating the taxpayer renovation costs on a supposedly private institution's building",
                "author": "IncredibleMrE1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Since Netflix loves the guy so much, let's see them air this soon-to-be hit!",
        "score": 449,
        "text_content": "",
        "comments": [
            {
                "raw_content": "America's first and last black president was a real O'bummer.",
                "author": "MythArcana"
            },
            {
                "raw_content": "Since it's a villain, will they cast a white guy?",
                "author": "barwhack"
            },
            {
                "raw_content": "These memes were fun back in 2015, but no so much anymore. They're a sobering reminder that we've been waiting 1 entire first term and we're six months into a second term without any signs of a single significant Deep State arrest.",
                "author": "Oliphaunt"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Dunkin' appears to release its own version of the American Eagle ad featuring actor Gavin Casalegno. The Dallas, Texas-born model was heard talking about his \"genes,\" similar to the American Eagle ad.",
        "score": 915,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Based ladies need their eye candy too",
                "author": "wharfthrowaway"
            },
            {
                "raw_content": "I also find that ad very refreshing.",
                "author": "SubmarineGuy"
            },
            {
                "raw_content": "WHITE BOY SUMMER",
                "author": "RyanKeyOh"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Texas House Republicans unveil new congressional map that looks to pick up five GOP seats. The Democrats are having a massive shitfit with this and will probably try to escape from Texas to stop it.",
        "score": 1194,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good, but the fight isn't over. The Democrats will keep trying to skew the 2030 Census.",
                "author": "McFatty7"
            },
            {
                "raw_content": "Meanwhile, Newsom just spent $124 million in taxpayer funds to gerrymander the state to gain five more seats. Just like that, democrats love gerrymandering after accusing the right of doing it. They really need to change that word to riggerrigging, because that's what it is.",
                "author": "MythArcana"
            },
            {
                "raw_content": "The left does this constantly elsewhere. They’ve got some (fake) ‘nads to complain",
                "author": "ClarenceBeeks"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Cincinnati Representive",
        "score": 1554,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Black Americans are the most racist group in America, they openly hate White people, and I'm tired of Democrats pretending that it's okay, and even encouraging it.",
                "author": "AVeryNakedMan"
            },
            {
                "raw_content": "Ashamed of nothing",
                "author": "Jghou"
            },
            {
                "raw_content": "Cotton wasn't worth it",
                "author": "South_Florida_Guy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "AMD CEO says its chips made in the US will be up to 20% more expensive, but claims that it’ll be worth the price hike",
        "score": 274,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm just curious how this would work. If you see a \"made in US\" and a \"made in Taiwan\" CPU on shelves, you're likely not going to pay extra for the US model. What I find more likely is that they'll sell them at the same price, subsidize the price of the US chip cost losses by raising the prices of all the chips by 5-10%",
                "author": "bubblesort33"
            },
            {
                "raw_content": "If it's not at least 20% more performance (obviously it's not) then it's not worth the price hike to anyone except USA government.",
                "author": "Kinexity"
            },
            {
                "raw_content": "In the end no one on the consumer side would know if the chip are made in USA or Taiwan because all they see is either made in china/malaysia due to amd removing the [diffused in country] from the ihs.",
                "author": "stuff7"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[News] Samsung Chip Division Profit Plunges 90% in Q2; H2 Hopes on HBM3E, 2nm | TrendForce",
        "score": 22,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">According to Samsung’s press release, its Q2 revenue rose 0.7% year-over-year to 74.6 trillion won, in line with its forecast. However, operating profit plunged to 4.7 trillion won ($3.37 billion)—hit by HBM chip shipment delays and U.S. export curbs on advanced chips to China, Reuters reports. Net profit fell 48.01% to 5.12 trillion won. Notably, as the reports suggest, Samsung’s chip division logged just 400 billion won in Q2 profit—plunging from 6.5 trillion won a year ago and slipping below the 1 trillion won mark for the first time in six quarters.",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "We can't get enough GPU's so I hope they can help with that.",
                "author": "vexargames"
            },
            {
                "raw_content": "We need HBM4 with how fast things are moving.",
                "author": "Equivalent-Bet-8771"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Hardware Canucks] The Best Air Coolers for a 9800X3D, 7800X3D & 5800X3D",
        "score": 132,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Phantom Spirit 120 continues to be undisputed high-performance value king",
                "author": "TwinHaelix"
            },
            {
                "raw_content": "I’m running my D15 since 6600k all the way to 9800x3d. Money well spent",
                "author": "robertchenca"
            },
            {
                "raw_content": "I put a Thermalright Phantom Spirit 120 on my 9800x3d and it works great in a Lancool217.",
                "author": "LLMprophet"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Arm 2026 Q1 Financials: Another $1b Quarter, More Growth Expected",
        "score": 11,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">Otherwise, Arm is once again underscoring how much CSS is growing smartphone revenues even when smartphone unit sales growth is rather tepid. All CSS is v9, so which smartphones are built on CSS? [~~Xiaomi said no~~](https://xiaomitime.com/xring-o1-chip-is-not-based-on-arm-css-48323/)~~, even as they have the strongest X925 implementation in terms of 1T perf & 1T perf / W, which is a ding against Arm's CSS, if a third-party is doing it better than Arm.~~ Wait, Xiaomi **IS** using CSS, [per Arm's actual report](https://newsroom.arm.com/news/arm-q1-fye26-results): >Xiaomi’s new XRING O1 silicon incorporates the latest Arm CSS platform for mobile; So I'm wrong: **kudos** to Arm's CSS, as it does make sense for a first-time SoC vendor to use it. But so is Samsung on the Exynos 2500 and those X925 clocks were disappointing, which now I assume is either extreme efficiency *or* SF3 not scaling well with higher clocks. ~~Qualcomm (for non-NUVIA SoCs), MediaTek, Samsung, Google? I thought~~ *~~none~~*~~, but seemingly at least one per the comment above.~~ >Speaking of CSS, while Arm isn’t making any kind of product announcement at this time, as part of the company’s earnings call, the company outlined how it won’t be stopping with just subsystem IP. The long-term plans for CSS will include chiplets as well, **and potentially even full end-to-end chip solutions**. Emphasis original. So we *will* see Arm chips: there's no reason to mention it unless Arm was preparing for it. Though Arm has always competed with its customers, with its ALA vs TLA licenses. The key rub is whether Arm will start to abuse its ISA control or whether it remains an open playing field for all licenses. CSS licenssees doubled from 8 → 16 in a single year: seemingly there **is** a market of people that want / prefer Arm to finish more of the SoC, as you can always just license the uArch alone. >All told, Arm estimates that 70,000 enterprises now run AI workloads on Arm Neoverse-based chips, which is up 40% year-over-year. I wonder how they count that. Wouldn't most of these enterprises be on Microsoft Azure or Amazon AWS?",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": "Only its second over $1 billion quarter. For a company valued at $173 billion it's ridiculously low.",
                "author": "noiserr"
            },
            {
                "raw_content": "A few interesting [tidbits in Arm's release](https://newsroom.arm.com/news/arm-q1-fye26-results), but not mentioned by More than Moore: * A lot of auto OEMs use Arm: Tesla, Rivian, NIO, Mercedez-Benz, Honda, Geely * Xiaomi XRING O1 + Exynos 2500 *both* use CSS; in total, 16 CSS licenses by 10 companies * Hundreds of thousands of Grace Blackwell chips deployed in the past quarter * A \"major smartphone OEM\" has signed a agreement for Arm GPUs in \"their flagship smartphones\" thru 2030. The only smartphone OEMs that make Arm SoCs, AFAIK, are Xiaomi, Samsung, Apple, and Google. It ain't Apple. * Already known: Apple adopted SME2, coming to \"next generation\" Android phones * Reiterates its 50% in hyperscalers goal: \"We expect this shift to drive the market share of Arm Neoverse-based chips shipped to top hyperscalers to nearly 50% this year.\"",
                "author": "-protonsandneutrons-"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD Threadripper 9980X + 9970X Linux Benchmarks: Incredible Workstation Performance",
        "score": 153,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I really wish Michael would include Performance per Watt graphs. I find them very informative. Geometric mean of all results: CPU | Perf | Watt | **perf./w** | rel. perf./w ---|---|----|---- | ---- Threadripper 9980X | 225.05 | 286.89 | **0.78** | 2.36x Threadripper 7980X | 172.57| 308.59 | **0.56** | 1.69x Threadripper 9970X | 156.40| 295.89 | **0.53** | 1.6x Threadripper 7970X | 128.34| 286.89 | **0.45** | 1.36x Ryzen 9950X3D | 94.48 | 174.01 | **0.54** | 1.63x Ryzen 9950X | 92.25 | 173.38 | **0,53** | 1.6x Threadripper 3990X | 89.55 | 267.88 | **0.33** | baseline Core Ultra 9 285K | 66.78 | 156.23| **0.43** | 1.3x Some observations: - The new threadrippers not just have a solid performance upgrade but more importantly didn't achieve this by just sucking up more power. They do have better performance per watt. - It is a nice generational gain in improvements of the architecture. In the case of the 9980X vs the 7980X **1.4x better performance per watt!** - The IOD is made for a lot more chiplets. This makes 64 core part really shine in not just performance but also performance per watt. - What happened to the Core Ultra 9 285k? When it came out they were on par with the 9950X for applications. Now worse performance and performance per watt?! The 9950X has **38% better performance** and **23% better perf/watt!**",
                "author": "ElementII5"
            },
            {
                "raw_content": "Those compile times are delicious.",
                "author": "Kamishini_No_Yari_"
            },
            {
                "raw_content": "Incredible performance, as expected. Recently, I've been thinking about how desktop CPUs seem to be lagging behind when it comes to core count. Strix Halo ships with up to 16 cores (same as Granite Ridge), and mobile Arrow Lake-HX goes up to 8+16 (same as desktop Arrow Lake-S)... It's nice to see AMD keeping HEDT alive. \"Normal\" consumer CPUs have gotten so small when compared to consumer GPUs they're almost funny to look at.",
                "author": "Artoriuz"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Qualcomm's premium smartphone chip reliance, Apple modem loss overshadow upbeat forecast",
        "score": 8,
        "text_content": "",
        "comments": [
            {
                "raw_content": "For more interesting notes, see Qualcomm's presentation: [FY2025 3rd Quarter Earnings Presentation](https://s204.q4cdn.com/645488518/files/doc_financials/2025/q3/FY2025-3rd-Quarter-Earnings-Presentation_7-30-25_Final.pdf) * Extended their Xiaomi collaboration for Snapdragon 8 SoCs on \"flagship devices\" (unsure if Xiaomi is pulling away from XRING O1 or many flagships won't have the Xiaomi SoC) * Snapdragon X design wins wil total 100+ through 2026 * 20+ OEMs, including BMW, will launch Qualcomm's latest ADAS stack, Snapdragon Ride * Snapdragon AR1+ Gen 1 has newly launched for AI smart glasses",
                "author": "-protonsandneutrons-"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Qualcomm working on datacenter CPU for hyperscalers",
        "score": 4,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This will be great. Arm adoption is becoming more mainstream in datacenters and Neoverse / Arm stock cores should not become a monoculture. Arm DC needs competition to thrive. The previous leaks are here: [https://www.androidauthority.com/snapdragon-x-models-3429369/](https://www.androidauthority.com/snapdragon-x-models-3429369/) Code-named the \"SD1\", it looks beastly: * *80 Oryon cores at up to 3.8GHz* * *16 channels of DDR5 up to 5600MHz* * *70 PCIe 5.0 lanes* * *CXL v1.1 support* * *9470-pin LGA socket (98.0×95.0mm)* * *Support for a two-socket configuration* * *Built on TSMC’s 5nm process (N5P)*",
                "author": "-protonsandneutrons-"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Gamers Nexus] AMD Threadripper 9980X 64-Core CPU Review & Benchmarks",
        "score": 33,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Minimal improvement in 7zip and Da Vinci Resolve compared to 7980X",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "I posted this comment over in the Watercooling subreddit already but I really wish there was a benchmark for an application like Zbrush which is where CPUs like the Threadripper really shine especially at extreme to beyond extreme poly counts. I posted a video from Adam Baroody where he was showing how the Threadripper really is an ideal CPU for an application like Zbrush, [he was using a 3970X about five years ago though.](https://www.youtube.com/watch?v=glxwAFEuFFg) It's really a match made in heaven deal between the TR and the software because it makes use of all the strengths of a TR. Not all workloads in an application like Zbrush benefit from raw thread count but receive a bigger boost from core speed, whereas as other tasks are the opposite where more threads are a favored metric. The high memory bandwidth of a TR combined with the high memory capacity are also ideal because Zbrush will use as much ram as you let it and when dealing with super high subdivision sculpting it WILL use it. It's really the perfect processor for those in the 3D modeling space. Due to a lack of a proper benchmark for it there's really no way to get an accurate representation of the generational improvements sadly.",
                "author": "GhostsinGlass"
            },
            {
                "raw_content": "Does GN and other review outlets actually get to keep these? Are they samples or bought I wonder. That's a lot of money.",
                "author": "bubblesort33"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Adaptive brightness - how come desktop monitors and TV's don't have it?",
        "score": 8,
        "text_content": "I've always wondered why Desktop monitors and TV's don't have adaptive brightness like mobile devices have. Having to manually change the brightness multiple times a day is just something you never have to do on a mobile device, and it makes many people look at a very bright screen in the dark for hours before going to bed. Not to mention the increased power usage, when thinking of the billions of TV's and desktop monitors around the world, which hurts the planet, energy prices, and foreign energy dependency. So how come this is so rare for these types of displays?",
        "comments": [
            {
                "raw_content": "vast majority of monitors support DDC/CI, you can use that and a simple time-of-day logic to adjust brightness as needed, as a workaround (I know this doesn't answer your general question, but it can be helpful)",
                "author": "Shadow647"
            },
            {
                "raw_content": "I’ve seen multiple tvs that have it, its a horrible feature on every device ever",
                "author": "Quatro_Leches"
            },
            {
                "raw_content": "I think most TVs have had adaptive brightness for years.",
                "author": "shoneysbreakfast"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Tomorrows Direct",
        "score": 2203,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sega… maybe no key card for persona or something. May be copium but sonic racing crossworlds isnt a key card. There will 99% be at least a game key card in this direct. Don’t want to say 100%. Don’t know what could happen.",
                "author": "Dear_Meeting_1258"
            },
            {
                "raw_content": "TBF i excuse the devs IF the game is 50$ or less. at that price point, the price of the cart itself is over 30%...",
                "author": "TheBraveGallade"
            },
            {
                "raw_content": "Better than cloud gaming.",
                "author": "-Cephiroth"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Why are people upset games will be announced tomorrow?",
        "score": 1518,
        "text_content": "“B-but we need a release date for Metroid Prime 4” bro Nintendo’s just gonna tweet that out on a random Tuesday morning, relax.",
        "comments": [
            {
                "raw_content": "Yep, you got me. I want the Metroid Prime 4 release date. If only it'd be a tweet, they'll put it on Nintendo Today instead.",
                "author": "Williekins"
            },
            {
                "raw_content": "The switch 2 needs a flood of switch 2 optimized 3rd party titles. I’m excited for tomorrow👌",
                "author": "CircaCoda"
            },
            {
                "raw_content": "People see the words \"partner showcase\" and immediately decide the direct is a bunch of slop ahead of time. Doesn't matter how many 3rd party exclusives will be revealed. Doesn't matter if it's the best direct of the year. Hell Nintendo could literally cure cancer in one and people would still hate it without watching.",
                "author": "Protitan20xx"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo Direct Announced",
        "score": 4179,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hoping for a Hades 2 release date.",
                "author": "Hydrak11"
            },
            {
                "raw_content": "Partner eh?",
                "author": "MolotovMan1263"
            },
            {
                "raw_content": "“Partner Showcase” for anyone who scan reads (like I did!). So do not expect any Nintendo/First Party game announcements here.",
                "author": "Masam10"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Me when the partner direct opens with GTA VI footage",
        "score": 566,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"Introducing Youtube for the Nintendo Switch 2! Watch all your favorite game trailers!\"",
                "author": "lockedoutofmymainrdt"
            },
            {
                "raw_content": "I really hope no one is actually expecting this to happen",
                "author": "Grace_Omega"
            },
            {
                "raw_content": "https://preview.redd.it/sxis2xg8g2gf1.jpeg?width=800&format=pjpg&auto=webp&s=e78c1ff6942402ce2b4d8e2386491fdcd060c2bd",
                "author": "Ok-List-2377"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Not a bad price to buy 🤔",
        "score": 346,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Such a friggin scam.",
                "author": "Andovars_Ghost"
            },
            {
                "raw_content": "RAC really is a scam.",
                "author": "Bankirito40"
            },
            {
                "raw_content": "Holy shit, $2,505 after all the payments.",
                "author": "ItsTheWineTalkin"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "My bingo card for the Partner Showcase direct",
        "score": 224,
        "text_content": "I finished one prior because I thought a general was more likely but then it turned out to be a partner showcase so I had to make modifications",
        "comments": [
            {
                "raw_content": "Please note, there will be no mention of the Nintendo Switch 2 successor during this presentation",
                "author": "JustSomeSmartGuy"
            },
            {
                "raw_content": "If we get RDR2 and Hades II announcements I’ll lose it 😭😭",
                "author": "Level-Performance-63"
            },
            {
                "raw_content": "Witcher 3 update due to cyberpunk success",
                "author": "Yoln909"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Partner Direct Bingo",
        "score": 367,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I would set my expectations as low as possible.",
                "author": "Sandy12315"
            },
            {
                "raw_content": "RDR2 is one of the few games that i’ll be willing (but not happy) to pay $60 for. Really hope the rumors are true and a port is on its way later this year.",
                "author": "davidrevilla311"
            },
            {
                "raw_content": "I really hope Halo MCC gets ported. Would love to replay the Bungie games wherever I want.",
                "author": "gswkillinit"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "It's interesting how Masahiro Sakurai is currently the only director of Nintendo games who is so recognizable that his name is featured in his games' trailers",
        "score": 199,
        "text_content": "https://preview.redd.it/qox71allw2gf1.png?width=1920&format=png&auto=webp&s=dedc67edf67861d1c565e9239bdcac2379b48b52 Really, can anyone name any director of a Nintendo game from this decade, other than him? I'm sure some of you can, but he's the only one that most Nintendo fans know. I think it's because he chose to directly promote his games, appearing in almost every game presentation, which is something that most game directors don't do. What do you think?",
        "comments": [
            {
                "raw_content": "Sakurai is the most famous director, because he really doesn’t have anybody above him. For example Fujibayashi which is the most important 3D Zelda director has Aonuma looming over as the producer for Zelda.",
                "author": "DevouredSource"
            },
            {
                "raw_content": "Koizumi and Aonuma are pretty well-known due to their frequent appearances in Directs. I’m also a big fan of Tetsuya Takahashi (Xenoblade series).",
                "author": "PunIntended29"
            },
            {
                "raw_content": "sakurai's the youngest of the OG, first gen 'nintendo' deveopers, thats why. there is also the fact that he's technically a freelancer.",
                "author": "TheBraveGallade"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "[MEGATHREAD] Nintendo Direct: Partner Showcase",
        "score": 319,
        "text_content": "[https://www.nintendo.com/us/nintendo-direct/7-31-2025/?srsltid=AfmBOopR1AYNGSNyF5HJ2onvyFFKzZjLq3naoPmM0MFNhz\\_kWcHGgTDl](https://www.nintendo.com/us/nintendo-direct/7-31-2025/?srsltid=AfmBOopR1AYNGSNyF5HJ2onvyFFKzZjLq3naoPmM0MFNhz_kWcHGgTDl) |NINTENDO PARTNER SHOWCASE| |:-| |**Date/Time:** July 31, 6 AM P.T./ 9 AM E.T. ([SEE IN YOUR TIMEZONE](https://dateful.com/eventlink/3301055833))| |**Where to Watch:** [Nintendo YT](https://www.youtube.com/live/gZoLrfLcIVg)| |[What to Expect](https://www.nintendo.com/us/nintendo-direct/7-31-2025/?srsltid=AfmBOoqdcp_RFu95tjXsJ9BEN6Mayorzwfbwwbg2FlAjvonPASesbcJO)|",
        "comments": [
            {
                "raw_content": "Ace Attorney 7 Capcom. Come on now",
                "author": "Shakacon12"
            },
            {
                "raw_content": "They should port UFO 50 so my obsession can be resparked",
                "author": "Jasen_The_Wizard"
            },
            {
                "raw_content": "Xenogears + Xenosaga 1-3 port Dreamcast Evolution 1 + 2 port ~~this shit is more unlikely than Silksong lmao~~ edit: oh also want to add I hope we see [Morsels!](https://youtu.be/ITLsId98Gkw?si=QQxRYPAVtRPBaA3h) That game has been on my radar since the reveal last fall it looks freaking awesome but was delayed from it's Feb release earlier this year to just generic \"2025\" so really who knows lol",
                "author": "MeMeWhenWhenTheWhen"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "NatetheHate clarifies what his sources are told in advance of a Nintendo Direct.",
        "score": 634,
        "text_content": "For context in case anyone doesn’t know: People were upset this morning to find out that the rumored Nintendo Direct this week was not a 1st party general showcase, but instead a 3rd party “partner showcase” https://imgur.com/a/Y0PniuK After being questioned on why he (or rather his source) didn’t know what the format was: “Partners don’t know the format of the show. They are told they are in a Nintendo Direct & they are in one.” His source(s) is seemingly a 3rd party developer.",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Remember, when the game you want doesn't show up tomorrow, it's because Nate personally told them not to include it. He hates you, specifically.",
                "author": "solarshift"
            },
            {
                "raw_content": "Nate's sources being third parties was obvious What I didn't know is that Nintendo doesn't tell them what kind of Direct they'll be part of But it makes sense they view them equally, and it's not like PlayStation with SoP vs Showcase",
                "author": "KMoosetoe"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "EA accidentally tweeted out the release date for Battlefield 6 then quickly deleted the tweet (it's October 10th)",
        "score": 585,
        "text_content": "Source: https://xcancel.com/Battlefield/status/1950602539826815240 Screenshot: https://i.imgur.com/XeiHjnz.jpeg (ignore the timestamp, their account tweeted this out at 5PM EST, but xcancel struggles with timezones for some reason) Release date trailer that I re-uploaded: https://streamable.com/ak4ff1 (this trailer confirms Firestorm is indeed making a return) I think this tweet was supposed to go live tomorrow.. *(Sorry for reposting, my last post got removed by Reddit's filters because I put the direct link to the video from Twitter's servers)*",
        "comments": [
            {
                "raw_content": "They're just revealing shit on purpose now.",
                "author": "chocoponcho_"
            },
            {
                "raw_content": "More smoke for a potential July Direct, anyone? I'm thinking next week, maybe on July 38th",
                "author": "PikaPhantom_"
            },
            {
                "raw_content": "I become a real man on Oct 10th",
                "author": "Successful_Basket399"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Kingdom Come: Deliverance 1 may be getting a native PS5 version",
        "score": 125,
        "text_content": "[https://xcancel.com/PlaystationSize/status/1950763441628774410#m](https://xcancel.com/PlaystationSize/status/1950763441628774410#m) This is from the same account that found an unannounced Assassin's Creed game on the PlayStation Store backend a few days ago. Presumably this will include 4K/60, high-res texture pack, and other improvements that have been made to the PC version over the years. Did I just drop 200 hours 100%ing the PS4 version last year? Yes. Will I probably do the same here? ...no comment",
        "comments": [
            {
                "raw_content": "Is it too soon to hope that this is announced in a press release tomorrow after a Switch 2 upgrade of KCD1 appears in the Direct? That's currently what I'm hoping for RDR2 lol",
                "author": "drumjolter01"
            },
            {
                "raw_content": "Thank fuck if true, I’ve been dragging my feet playing these games in the hopes of us getting exactly this",
                "author": "Traditional_Dot_1215"
            },
            {
                "raw_content": "This would be massive. The 2nd one is genuinely in my top 3 favorite games of all time, but I’ve refused to play the 1st game again just due to the jank on consoles.",
                "author": "ashdaddy10"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Nintendo Direct Announced for July 31, at 6am PT",
        "score": 1369,
        "text_content": "Partner Direct, 25 minutes [https://www.youtube.com/live/gZoLrfLcIVg](https://www.youtube.com/live/gZoLrfLcIVg) Previous rumors: [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1m8wzfy/vgc\\_has\\_corroborated\\_natethehates\\_claim\\_of\\_an/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1m8wzfy/vgc_has_corroborated_natethehates_claim_of_an/) [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1mb5zck/natethehate\\_continues\\_to\\_believe\\_a\\_direct\\_is\\_next/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1mb5zck/natethehate_continues_to_believe_a_direct_is_next/)",
        "comments": [
            {
                "raw_content": "Nate continues to be T1 lmaooo",
                "author": "VampireInTheDorms"
            },
            {
                "raw_content": "So 1: Glad Japan avoided the worst of it earthquake wise. 2: That Grubb \"is May over you dumb sacks of shit\" once again applies to a number of people in here.",
                "author": "ZeppoJR"
            },
            {
                "raw_content": "Surprised it's not a general direct but we'll take it. I wonder when prime 4 will finally get its release date.",
                "author": "Tired_Gamer"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Cronos new dawn release date?",
        "score": 57,
        "text_content": "Achievement list dropped on true achievements but strangely notes a 5th September release date with 48 hours paid early access, can't find any source confirming this from the devs themselves!!",
        "comments": [
            {
                "raw_content": "That’s pretty close to Silent Hill f… gonna be a spooky fall this year!",
                "author": "Tolsey"
            },
            {
                "raw_content": "God, I love games like this. Anyone got recommendations? Already played and enjoyed Dead Space and The Callisto Protocol. What is this genre called?",
                "author": "Pappa_Alpha"
            },
            {
                "raw_content": "Might be true. Trueachievements are known to have access to game databases like Exophase.",
                "author": "Turbostrider27"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[Insider Gaming] BF6 closed beta is Aug 7th-8th, open beta is Aug 9th-10th",
        "score": 265,
        "text_content": "https://insider-gaming.com/battlefield-6-open-beta/ Pre order or twitch drop for closed beta Second open beta is Aug 14th-17th",
        "comments": [
            {
                "raw_content": "#Insider Gaming is a Tier 2 - Generally Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Do I need to play BF1-5 to understand the plot of BF6?",
                "author": "siliconwolf13"
            },
            {
                "raw_content": "So an $80 preorder for two extra days of access? Not that I was going to preorder it anyways, but that doesn’t sound very enticing.",
                "author": "PhantomCamel"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Female Spartan from Halo coming to Fortnite; potentially as part of next season's insect invasion themed battle pass",
        "score": 97,
        "text_content": "https://xcancel.com/ShiinaBR/status/1950670233426854200",
        "comments": [
            {
                "raw_content": "Since it was Kelly they added to Rainbow Six I imagine that’s who it’ll be in the pass, and then maybe sell the rest of Blue Team in the shop. Nobody is really clamoring for Sarah Palmer or whoever that lady was who appeared in a couple of Infinite’s multiplayer cutscenes before they stopped that. And I highly doubt it’s anyone from the books or comics.",
                "author": "Lazzyman64"
            },
            {
                "raw_content": "Not opposed to more halo in fortnite",
                "author": "perfectevasion"
            },
            {
                "raw_content": "welcome back Dead or Alive 4",
                "author": "Inevitable_Judge5231"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Apparent developer teases Overwatch 2 Season 18 Mythic possibly announced tomorrow",
        "score": 49,
        "text_content": "[https://bsky.app/profile/cappugccino.bsky.social/post/3lv6tyvu3q22d](https://bsky.app/profile/cappugccino.bsky.social/post/3lv6tyvu3q22d) \"it’s our last day to speculate. who do we think is getting the season 18 mythic skin tomorrow? 👀\" Source is interesting, a Japanese person who states being a game developer alongside lots of Overwatch related content on their Bluesky. Crossing fingers for Mei lol, with Wuyang being Chinese and all. Also, it coincides with the Partner Direct and Chinajoy convention. Could be announced at either. Possibly with a Switch 2 upgrade finally?",
        "comments": [
            {
                "raw_content": "Overwatch Season Pass at Direct Partner Showcase? Now that is something new... Even makes sense, because OW2 still doesn't have a Switch 2 base port.",
                "author": "Educational-Arm-7384"
            },
            {
                "raw_content": "Lucio pls",
                "author": "Acid__Gat"
            },
            {
                "raw_content": "I thought Overwatch 2 was dead, the internet funny man told me that",
                "author": "Zakael7"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "MSI Claw 8 AI+ A2VM Review",
        "score": 27,
        "text_content": "",
        "comments": [
            {
                "raw_content": "1000$ handhelds are a very niche market",
                "author": "SYKE_II"
            },
            {
                "raw_content": "Looks like big generous grips, and the chip/iGPU keeps pace with some current handhelds. Not too bad at all. And it can stretch out to 37w. Neat!",
                "author": "TheDonnARK"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Lenovo ThinkPad E14 G7 review - The affordable office laptop stands out from the competition with its 120 Hz display",
        "score": 11,
        "text_content": "",
        "comments": [
            {
                "raw_content": "120hz for business laptop is overrated.",
                "author": "Creative-Expert8086"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD reportedly working on Ryzen 8000G refresh",
        "score": 72,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A cheap six core or even a quad core with an 890m is all they need to do.",
                "author": "DuuhEazy"
            },
            {
                "raw_content": "Did literally anybody buy those CPU's? Or is this like the RX 90 series, just a stall pokemon so they can get some better hitters?",
                "author": "Synthetic_Energy"
            },
            {
                "raw_content": "Typical amd marketing shit....",
                "author": "PutsiMari69"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Threadripper 9980X 64 Core CPU Review & Benchmarks",
        "score": 42,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Conclusion a good budget gaming CPU",
                "author": "a7dfj8aerj"
            },
            {
                "raw_content": "I am finding a lot of the Threadripper reviews just about meaningless. They all feel the need to placate people with gaming benchmarks despite the fact that no gamer is going to buy one of these chips. The chips are for high thread work loads, period. If you can afford a Threadripper CHIP, you can build a much more powerful gaming rig and have a ton of money left over.",
                "author": "Mopar_63"
            },
            {
                "raw_content": "Nice review! amazing budget cpu. I think I'll get one for my little cousins first computer this Christmas.",
                "author": "Epsilon_void"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Threadripper 9980X + 9970X Linux Benchmarks: Incredible Workstation Performance",
        "score": 30,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Thanks! Saw OpenFOAM results which are cool though I am still trying to find if any outlets report a results of ANSYS Fluent bechmark, pls share here if anyone knows. Would be great if there is a comparison data with old Workstation CPU, but probably I am asking too much here.",
                "author": "adimrf"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "9980X Arrives: Threadripper in 2025",
        "score": 26,
        "text_content": "",
        "comments": [
            {
                "raw_content": "man the old threadripper boxes were sweet",
                "author": "Ill-Mastodon-8692"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Emdoor unveils Ryzen AI MAX 300 gaming laptop",
        "score": 23,
        "text_content": "",
        "comments": [
            {
                "raw_content": "*yawn* also no mention of pricing. I'm expecting $3000ish for the 395 version.",
                "author": "Agentfish36"
            },
            {
                "raw_content": "Seems pretty huge and heavy for 120w. It’s as big as some 250w laptops. Kinda a weird niche though. It performs like a 4070m but you can get laptops in this price bracket with 5070m or better.",
                "author": "sittingmongoose"
            },
            {
                "raw_content": "Cool. Less than two weeks from the SixUnited Strix Halo laptop [announcement](https://videocardz.com/newz/sixunited-xn77-laptop-to-feature-ryzen-ai-max-395-strix-halo-up-to-120w-tdp). Hopefully this Emdoor one has an OLED option. Happy to see a numpad and full sized arrow keys. If the internal name for this laptop being \"GAME5\" doesn't make it clear that this \"workstation\" branding is a LARP then I don't know what will.",
                "author": "Mageoftheyear"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Ryzen Threadripper 9000X Review Roundup",
        "score": 19,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "ROG Xbox Ally and Ally X preorders to open at Gamescom, pricing reportedly set at €599 and €999",
        "score": 18,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I could have three Steam Decks for that price!",
                "author": "Tyr_Kukulkan"
            },
            {
                "raw_content": "It's weord to have such huge price gap between two models. I expected it to be around 800eu, but not 1k. At that price it's already dead.",
                "author": "ChefCobra"
            },
            {
                "raw_content": "Looking more forward to the custom Windows these will be running.",
                "author": "superjake"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "The rise of ‘accidental landlords’ is starting to have a serious impact on America’s housing supply — with no end in sight.",
        "score": 289,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> The phenomenon is most concentrated in the same metros where institutional landlords have historically built up large portfolios: **Atlanta, Dallas, Houston, Phoenix, Tampa and Charlotte. According to Parcl Labs, those six cities represent 36.8% of all institutional single-family rental holdings nationwide.** > But these **same cities are now seeing home listings pile up**, leading to a surge in homeowners pulling their listings and turning them into rentals instead. > Houston and Dallas saw the biggest increases in homes that failed to sell and were converted into rentals, followed by Tampa, Phoenix and Atlanta. Charlotte, an outlier, actually had a modest decline in the number of homes that failed to sell. > **Meanwhile, single-family inventory is up sharply too year-over-year, averaging a 32% increase in those key cities.** Since they say the delistings and rentals aren't decreasing SFH levels, here's your Condo scores: [Houston](https://www.realtor.com/realestateandhomes-search/Houston_TX/type-condo/sby-1) [Dallas](https://www.realtor.com/realestateandhomes-search/Dallas_TX/type-condo/sby-1) [Tampa](https://www.realtor.com/realestateandhomes-search/Tampa_FL/type-condo/sby-1) [Phoenix](https://www.realtor.com/realestateandhomes-search/Phoenix_AZ/type-condo/sby-1) [Atlanta](https://www.realtor.com/realestateandhomes-search/Atlanta_GA/type-condo/sby-1) And, the odd child out according to the article: [Charlotte.](https://www.realtor.com/realestateandhomes-search/Charlotte_NC/type-condo/sby-1) Where SFH listings go up, Condos sure *seem to be* being decreasing in price in a hurry. Or is it the other way round?",
                "author": "Jumpy-Ad8831"
            },
            {
                "raw_content": "One real tenant will scare the shit out of new landlords",
                "author": "Material-Orange3233"
            },
            {
                "raw_content": "Not to mention you have a lot of homeowners with sub 3% mortgages. A mortgage that cheap is not something you just want to give up unless you really have to.",
                "author": "Cervenkdatank"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Divided Fed holds key interest rate steady, defying Trump’s demands for aggressive cuts",
        "score": 198,
        "text_content": "",
        "comments": [
            {
                "raw_content": "[removed]",
                "author": "None"
            },
            {
                "raw_content": "WASHINGTON – A divided Federal Reserve on Wednesday voted to keep its benchmark interest rate steady, despite a barrage of criticism from President Donald Trump and dissents from two top officials. The Federal Open Market Committee, the group that sets the overnight borrowing rate, voted 9-2 to stay on hold. The federal funds rate will continue to be set in a range between 4.25%-4.5%. The level sets what banks charge each other for overnight lending, but influences a slew of other rates across the economy. However, the decision met opposition from governors Michelle Bowman and Christopher Waller, both of whom have advocated for the Fed to start easing in acknowledgement that inflation is under control and the labor market could start weakening soon. This was the first time since late 1993 that multiple governors cast no votes on a rate decision. The post-meeting statement offered only a couple changes in how the committee views economic conditions. “Although swings in net exports continue to affect the data, recent indicators suggest that growth of economic activity moderated in the first half of the year,” the document stated. “The unemployment rate remains low, and labor market conditions remain solid. Inflation remains somewhat elevated.“ At the June meeting, the committee had a more optimistic view, saying the economy “continued to expand at a solid pace.“ The Wednesday statement said uncertainty about conditions “remains elevated,” also a less upbeat assessment from June, which noted that uncertainty had “diminished but remains elevated.“ A slower economy would boost the argument for lower interest rates, though the committee stopped short of endorsing that view. Fed Chair Jerome Powell will speak at 2:30 p.m. ET and could address then whether the committee is tilting toward rate cut at the next meeting in September. Markets had overwhelmingly expected no action on rates but were watching the extent of disagreement on the committee, which normally has 12 voters but was without Governor Adriana Kugler at this meeting. Traders expect the Fed to cut in September, though that could change depending on the data flow. Fed officials in June narrowly indicated they see two cuts in total this year. The news follows a remarkable stretch for an entity with great sway over the economy but one that has mostly avoided the political fray, at least overtly. Trump has called for Powell’s resignation and even toyed with the legally questionable idea of firing him. Though he’s largely backed off the threat of sacking Powell, the president has kept up the criticism of a former appointee whom he now regularly calls “Too Late.” The president has suggested the Fed lower its benchmark rate by 3 percentage points, which he said would lower bowering costs on the surging national debt and help the moribund housing market. In addition to the hectoring over rates, the Trump administration has ripped Powell and the central bank for cost overruns on a massive remodeling project at two of the Fed’s buildings in Washington. Powell has insisted that the overruns are not the product of mismanagement but rather escalating costs since the project began. Wednesday brought more news that could influence the Fed’s path, Trump’s badgering notwithstanding. The Commerce Department reported that gross domestic product grew at a 3% annualized rate in the second quarter, considerably stronger than expected. Though much of the headline gain was propelled by a reversion of a massive import surge in the first quarter ahead of Trump’s tariffs, the report nevertheless reinforced the notion of an economy still on solid ground. Moreover, the report showed inflation running at just a 2.1% rate for the period, according to the Fed’s main forecasting tool. Core inflation was a bit higher at 2.5%, but both numbers plunged from their first-quarter levels and neared the Fed’s 2% bogey. “We at the White House 100% respect their independence, but we also like to respect their analysis,” National Economic Council Director Kevin Hassett said Wednesday on CNBC. “We expect that the Fed will catch up to the data soon. That’s going to be a really big, positive story.“ The Fed next will gather at its annual retreat in Jackson Hole, Wyo., in late August. The event historically has featured a major policy speech from the chair. **Federal Reserve official FOMC statement:** https://www.federalreserve.gov/newsevents/pressreleases/monetary20250730a.htm",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Market Flip: Existing Homes Outprice New Homes",
        "score": 18,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yeah people see the quality of new builds lol",
                "author": "Responsible_Knee7632"
            },
            {
                "raw_content": "In the second quarter of 2025, the median price for a new single-family home was $410,800, which was $18,600 lower than the median price of existing homes, which stood at $429,400. This marks the largest historical gap where existing home prices exceeded those of new homes, according to U.S. Census Bureau and National Association of Realtors data (not seasonally adjusted – NSA) Typically, new homes carry a price premium over existing homes. From 2010 to 2019, this pattern held steady, with an average difference of $66,000. However, over the past five years, the gap has narrowed significantly, averaging just $24,800. Notably, this trend reversed in 2024. In both the second and third quarters, the median price of existing homes surpassed that of new homes. Both new and existing homes saw dramatic increases in prices post-pandemic due to higher construction costs and limited supply. While overall home prices remain elevated compared to historical norms, new homes prices have moderated due to tactical builder business decisions, whereas existing homes prices continue to increase because of lean supply and perhaps a lack of price discovery for existing homeowners. Indeed, the median price for a new single-family home sold in the second quarter of 2025 decreased 0.9% from the previous year. New home prices have continued to experience year-over-year declines for nine consecutive quarters. Meanwhile, the median price for existing single-family homes increased 1.7% from one year ago. Existing home prices have continued to experience year-over-year increases for eight consecutive quarters. There are several factors as to why new and existing homes are selling at similar price points. Tight inventory continues to push up prices for existing homes, as many homeowners who secured low mortgage rates during the pandemic are hesitant to sell due to current high interest rates. Meanwhile, new home pricing is more volatile – prices change due to the types and locations of homes being built. Despite various challenges facing the industry, home builders are adapting to affordability challenges by building on smaller lots, constructing smaller homes, and offering incentives. Additionally, there has been a shift in home building toward the South, associated with less expensive homes because of policy effects. Moreover, the least expensive region for new homes in the first quarter was the South, with a median price of $372,100. The Midwest followed closely behind at $385,300. For existing homes, the Midwest was the most affordably region at $328,800, followed by the South at $376,300. New homes were most expensive in the Northeast with a median price of $796,700, while the West sold at $531,100. For existing homes, the West led as the most expensive region at $646,100 homes, followed by Northeast at $646,100. The new home price premium was most pronounced in the Northeast, where new homes sold for $269,500 more than existing homes. The West and South followed the national trend, with existing homes priced $4,200 more than new homes in the West and $115,000 more in the South. With charts: https://eyeonhousing.org/2025/07/market-flip-existing-homes-outprice-new-homes/",
                "author": "SnortingElk"
            },
            {
                "raw_content": "Because the majority of new homes are cookie cutter cardboard boxes with dollar store makeup on to hide that fact. Homes built 10-20 years ago at least had some semblance of quality materials and layouts. Im honestly worried about the wear and tear on these new houses. What happens in another 20-30 years when these homes fall apart and large swaths of neighborhoods are decrepit?",
                "author": "yodog5"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "More Homes Hit the Market, But Buyers Aren’t Rushing In—Yet (An NAR joint)",
        "score": 14,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A lot of these homes suck. They are overpriced pieces of garbage and a metaphor for the poor financial planning of the b00mer generation: “well, I had fun- you pick up the check!” Open houses are basically like a bunch of bad first dates lol",
                "author": "wait_what888"
            },
            {
                "raw_content": "Price is too high for these old ass homes. Interest rate is too high.",
                "author": "SGAisFlopden"
            },
            {
                "raw_content": "the cool thing about Lawrence Yun is you can go back and see what he was saying in 2007: https://www.floordaily.net/flooring-news/nar-cuts-housing-forecast > The national median existing-home price is forecast to slip 1.0 percent to $219,800 this year, and then rise 1.4 percent in 2008. The median new-home price is expected to be essentially unchanged at $246,400 in 2007, and then rise 2.2 percent next year. how this chucklefuck muppet still commands a salary would be a much more interesting and worthwhile thing to study than him analyzing real estate",
                "author": "acqua_di_hoomertears"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Apartment rents drop in July as vacancies move to multi-year high",
        "score": 80,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is the \"I'll just rent it out\" chickens coming home to roost. Good luck covering your mortgage with all that competition.",
                "author": "Likely_a_bot"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Real estate developers say affordable housing could soon become more profitable",
        "score": 72,
        "text_content": "",
        "comments": [
            {
                "raw_content": "doesn’t seem possible with the rising cost of building material and labor . but i sure hope they can",
                "author": "CharacterScarcity695"
            },
            {
                "raw_content": "Now they have to get past the NIMBY zoning",
                "author": "Capital-Giraffe-4122"
            },
            {
                "raw_content": "A massive recession with millions of layoffs and business bankruptcies of all sizes will do that. The big house across the lake from me was built for $120 a sq ft in 2010.",
                "author": "BarlettaTritoon"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "South Florida condo owners are feeling trapped by high costs and a buyer's market",
        "score": 48,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is the home that the article talks about [https://www.zillow.com/homedetails/770-Claughton-Island-Dr-APT-806-Miami-FL-33131/64864752\\_zpid/](https://www.zillow.com/homedetails/770-Claughton-Island-Dr-APT-806-Miami-FL-33131/64864752_zpid/) In 2020 the home was worth $209,000... now $286,000... and she is still trying to sell at $300,000.",
                "author": "UnluckyAssist9416"
            },
            {
                "raw_content": "And this is why if you set a stupid fucking price on listing be prepared to hold onto that bag. She probably could have gotten $300k if she had listed it for that last May. But now she’s chasing the market down and paying property taxes, HOA, and home insurance on it. Lol. That original $450k list price was based off hopes and dreams. 💀",
                "author": "juiceboxhero919"
            },
            {
                "raw_content": "[removed]",
                "author": "None"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Figure 02 doing laundry fully autonomously.",
        "score": 1827,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\\*grabs child, stuffs in washing machine\\*",
                "author": "Grandpas_Spells"
            },
            {
                "raw_content": "Robotics is improving rapidly. ![gif](giphy|uDwKGxTFrADvO)",
                "author": "AdorableBackground83"
            },
            {
                "raw_content": "Filmed at the home of the CEO (Brett Adcock) of Figure. It’s running fully autonomously using their internal neural network called Helix. This took only a month of training on the task to achieve.",
                "author": "BurtingOff"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Strange now, normal in the future",
        "score": 347,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Normal in 5 years.",
                "author": "QLaHPD"
            },
            {
                "raw_content": "the knee-jerk reaction to news like this is \"but the videos suck!\" well, yes, but creating images (let alone video) from prompts was considered black magic just a few years ago, and now Veo 3 is churning out viral clips that get millions of views. if you're in the business of creating content, it's kind of obvious where this is heading.",
                "author": "micaroma"
            },
            {
                "raw_content": "Even if this worked perfectly aren’t there still some issues? Isn’t part of the fun of entertainment the shared experience with others? What happens to in person and online discussion of entertainment when we are all literally watching personalized content?",
                "author": "GainPuzzleheaded598"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Elon on hunger, disease and poverty",
        "score": 684,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/yewxzh29d2gf1.png?width=445&format=png&auto=webp&s=f8529f7aff807d50db27fc0f8e8763be796ef78a",
                "author": "OptimalBarnacle7633"
            },
            {
                "raw_content": "Man with a pantry big enough to feed the world says “just one more investment I promise” Edit: very funny people replying to me like “Aktually if you took all his money it would be like $250/person” or whatever like that’s the kind of resources people need lol. He can make and distribute millions of cars, revamp a global messaging app, and ship products to space and back, you really think people criticizing him simply want to take his wealth and give people gift cards to McDonald’s or something? Edit 2: a lot of odd sentiment calling me ignorant. Pretty odd ngl. Elon has more resources at the tip of his fingers and has refused to do anything for hunger? People talking about government spending is wasteful and hen he has received billions and billions of subsidies? He’s been making promises for literally decades that are either extremely late, underwhelming, or both?",
                "author": "Solid_Anxiety8176"
            },
            {
                "raw_content": "No its land value tax",
                "author": "EricReingardt"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"Meta sees early signs of self-improving AI\"",
        "score": 277,
        "text_content": "[https://the-decoder.com/meta-sees-early-signs-of-self-improving-ai-signals-caution-on-open-source-plans/](https://the-decoder.com/meta-sees-early-signs-of-self-improving-ai-signals-caution-on-open-source-plans/) \"\"Over the last few months we have begun to see glimpses of our AI systems improving themselves. The improvement is slow for now, but undeniable,\" CEO Mark Zuckerberg writes in a [policy paper on the future of superintelligence](https://www.meta.com/superintelligence/). This shift toward self-optimizing AI could mark a turning point. Some researchers believe it could dramatically speed up progress toward superintelligence and introduce new dynamics in how AI develops. \"Developing superintelligence is now in sight,\" Zuckerberg writes.\"",
        "comments": [
            {
                "raw_content": "It’s almost like he’s spending $100b in capex and handing out NBA like contracts to nerds for a reason.",
                "author": "jonknee"
            },
            {
                "raw_content": "Easy to improve on Llama.",
                "author": "FarrisAT"
            },
            {
                "raw_content": "Why does the statement \"we have begun to see glimpses of our AI systems improving themselves\" need to be qualified with \"begun to see glimpses\". Are they improving themselves or not? If they are: Why are we beginning to see glimpses? If they *are* improving themselves, then the correct statement is: \"We have observed our AI systems improving themselves.\" The reason why you qualify a statement like that is so you can walk it back and not be called a liar. Plain and simple.",
                "author": "027a"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Google Deepmind Announces AlphaEarth Foundations",
        "score": 481,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Overall, this is what I love about deepmind. They find practical applications for existing technologies, showing that we don't have to create a huge, universal AI model to solve a specific problem.",
                "author": "GloryMerlin"
            },
            {
                "raw_content": "They've done it again After Weather prediction, code, biology, maths and Go, another W for Deepmind",
                "author": "ihaveaminecraftidea"
            },
            {
                "raw_content": "Congrats to DeepMind for Alpha model #20! [https://lifearchitect.ai/gemini-report/#alpha](https://lifearchitect.ai/gemini-report/#alpha)",
                "author": "adt"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "I made a webgame with AI where you open doors and die in random ways",
        "score": 127,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I tried it out. A girl holding a bowl of salad walked out of the door, laughed, and then stared into my soul. It literally triggered my fight flight or freeze response, good job OP",
                "author": "Sextus_Rex"
            },
            {
                "raw_content": "is the number of doors before death random? Could be a good drinking game.",
                "author": "SynestheoryStudios"
            },
            {
                "raw_content": "This has SOOOO much potential to be a horror game. The unsettling atmosphere is crazy and it gives early internet flash game vibes. Reminds me of what could be a surreal version of Lomando. Great concept.",
                "author": "gdubsthirteen"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Cryptic post from the ChatGPT Twitter account… GPT-5 tomorrow?",
        "score": 271,
        "text_content": "Tomorrow is a Thursday…",
        "comments": [
            {
                "raw_content": "For those of you who are curious, the text is katakana which is commonly used for foreign words that need to be written in Japanese. Yes, they have a specific script for that. All it says is chat GPT. The red symbol is kanji meaning fortune or good luck or blessing.",
                "author": "Arbrand"
            },
            {
                "raw_content": "I'm taking the copium and believing gpt5 is tomorrow",
                "author": "f00gers"
            },
            {
                "raw_content": "Skipping GPT -5 and going for GPT -6",
                "author": "mrdsensei1"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI's new stealth model on Open Router",
        "score": 147,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/pgmajpmcs3gf1.png?width=927&format=png&auto=webp&s=f46cb3178e33a38a35883c7521c388a38efd9cdd AGI?💀",
                "author": "Funkahontas"
            },
            {
                "raw_content": "It's unfortunately not very good at math. It gets even fairly easy problems wrong, which is pretty bad considering models are getting IMO gold.",
                "author": "Consistent_Bit_3295"
            },
            {
                "raw_content": "This is the best model so far on my go to coding problems. That said Claude 4 sonnet did worse on my test problems than claude 3.7, but in real work has been considerably better for me. So doing well on a few limited scoped questions != real world performance. Edit: To clarify it did the best in catching and handling edge cases. The code quality is very meh.",
                "author": "EngStudTA"
            }
        ],
        "subreddit": "singularity"
    }
]