[
    {
        "post_name": "Tulsi Gabbard: The UK has agreed to drop its mandate for Apple to provide a \"back door\" that would have enabled access to the protected encrypted data of American citizens and encroached on our civil liberties.",
        "score": 699,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Did someone bring King George back to life? Cuz the business of Americans is no business of the UK.",
                "author": "Boomstikchik"
            },
            {
                "raw_content": "That is nuts they wanted to do that to our phones. It’s enough our own government does it, but fuck the British. They need to remember the country that kicked their ass twice and saved em from 2 global conflicts",
                "author": "AstroLonghorn"
            },
            {
                "raw_content": "Yeah but... Apple created one anyway sooooo.....",
                "author": "The-Harbinger"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "DC is SO LOCKED DOWN right now that even Fox’s @BretBaier got pulled over 🤣",
        "score": 606,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"According to this thing, you're a faggot. Have a nice day, ma'am.\"",
                "author": "sola_scriptura"
            },
            {
                "raw_content": "lol of course he has a White G wagon. I bet he has a bedazzled Starbucks Stanley cup inside too",
                "author": "lifeisahologram"
            },
            {
                "raw_content": "Pretty nice car for a propogandist.",
                "author": "utfanx2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Italian Prime Minister Giorgia Meloni to President Trump: \"Something has changed, thanks to you.\"",
        "score": 162,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Women should NEVER be in charge of countries.",
                "author": "cjcivicx"
            },
            {
                "raw_content": "Donald Trump wants people to stop dying, GenX hero",
                "author": "YodaBannon"
            },
            {
                "raw_content": "Nope, Trump and America’s success does not involve Ukraine.",
                "author": "Sugz_Da_Feefth"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Highest rated LNC",
        "score": 157,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# I love Trumpy. Trumpy stops the wars, brings the manufacturing jobs back, and lowers the inflation. Thank you Trumpy!",
                "author": "tpactionchasethevote"
            },
            {
                "raw_content": "LNC = Late Night Comedy?? That's a TLC too far for me.",
                "author": "Calumet57"
            },
            {
                "raw_content": "Pepe wouldn't have cucked like Fallon!",
                "author": "patrioticwinning3"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "UPDATE: SJ Joslin, a \"non-binary\" scientist and one of the individuals reportedly responsible for hanging a giant transgender flag in Yosemite National Park, has been FIRED from her position at the park. FAFO",
        "score": 1571,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So long bitch",
                "author": "The_Highlander"
            },
            {
                "raw_content": "Awesome! Get your extreme-leftist politics out of our public parks, all of us pay for them and they are not yours alone.....and FUCK YOU for good measure.",
                "author": "Kermit"
            },
            {
                "raw_content": "How ugly is the cartroon character and who thought it'd be a good idea to have him represent our Federal Park. He needs to be fired before he scares all the animals away.",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "One heck of a picture",
        "score": 802,
        "text_content": "",
        "comments": [
            {
                "raw_content": "THOSE COMMIE ASSHOLES ARE NOT THERE TO KISS THE RING they started this war for one reason and they are NOT there to surrender - they are there to \"try\" to intimidate Trump into Security Guarantee's that will drag the U.S. into this nightmare for generations to come. Absolutely NO on any SECURITY GUARANTEE'S and FUCK THE UK AND NATO TO HELL FOREVER !!!",
                "author": "BOHICA2021"
            },
            {
                "raw_content": "A bunch of big time faggots",
                "author": "Light_HIV_Effect"
            },
            {
                "raw_content": "Any of you remember a scene (I think it’s from the 3 stooges?) where someone walks down the row of where they are seated slapping everyone…yeah..",
                "author": "C0drus"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "“Why would you be mad at President Trump for making our cities safer? By Trump locking up all these dangerous criminals, he is actually saving more Black Americans than anybody..” HE’S RIGHT!! 🔥👇🏼",
        "score": 823,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If they won't police their own someone has to...",
                "author": "DemocratMath"
            },
            {
                "raw_content": "But the media says all people of darker shades are their personal property. Sadly, many of them love their perceived masters.",
                "author": "FactsOverFeelings"
            },
            {
                "raw_content": "Cause they like black people dead or scared so they can control them. Democrat plantation isn’t just a metaphor.",
                "author": "GodIsPerfect"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Ursula von der Leyen, the distinguished and Highly Respected President of the European Commission, and I have been discussing the massive Worldwide problem of missing children. This is, likewise, a big subject with my wife, Melania.",
        "score": 1265,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Start in Israel then do Hollywood.",
                "author": "fadelio"
            },
            {
                "raw_content": "Let me get this straight. The same people responsible for flooding Europe with sand raider invaders who rape and traffic children are now concerned when they go missing?",
                "author": "MythArcana"
            },
            {
                "raw_content": "von der Leyen is a rich psycho like Hillary, and probably does not see anyone with less than a billion dollars as an actual human.",
                "author": "VoteThing"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Michigan stabber stabs 11 people during rampage in Walmart before being shot by a good guy with a gun",
        "score": 1305,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This the same one from traverse City a month or so ago?",
                "author": "elc0"
            },
            {
                "raw_content": "What, again? Or are you just a few weeks behind. I REALLY hope it's the latter.",
                "author": "AlohaSnackbar"
            },
            {
                "raw_content": "This would never have happened if we had common sense gun control. No, really.",
                "author": "Citizen_Bob"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump deploys three U.S. Aegis guided-missile destroyers near Venezuela to \"combat drug threats,\" arriving within 36 hours — Reuters",
        "score": 788,
        "text_content": "",
        "comments": [
            {
                "raw_content": "imagine it's your turn on the little boat",
                "author": "spinometer2"
            },
            {
                "raw_content": "Make Cartels Go Boom!",
                "author": "JoeBidensDementia1"
            },
            {
                "raw_content": "a man needs a mission. don’t make my tax dollars go to warships if they’re commissioned to do a peacekeeping showing. send the metal where the reticle is.",
                "author": "bearhugprolapse"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Sec Noem: Washington, D.C. is quickly turning a corner under @POTUS Trump’s leadership. In just 7 days, robberies are down 46%. The men and women of @DHSgov are on the ground— removing drug dealers, gang members, and criminal aliens.",
        "score": 647,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Removing them from the street is great but you need convictions and put them in prison for very long time. If not it's just a revolving door and they'll just wait you guys out",
                "author": "JayKay1776"
            },
            {
                "raw_content": "Hannity makes Bill Mitchell look straight. And that is a difficult feat.",
                "author": "FactsOverFeelings"
            },
            {
                "raw_content": "Just goes to show it was always possible, they just never felt like doing it.",
                "author": "MakingArrowsOrange"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Zelensky has canceled his interview with Fox News tonight as he is now heading back home",
        "score": 1142,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Can we assume he was told that his crying wouldn’t work anymore and he needed to face reality?",
                "author": "BigPanda71"
            },
            {
                "raw_content": "Had to be back before midnight or he turns back into a faggot.",
                "author": "GTHAYS"
            },
            {
                "raw_content": "This is very misleading. The meeting at the White House went past the time planned to do the interview, so it got canceled.",
                "author": "lizardo221"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The greatest President in US history. (walk-through)",
        "score": 667,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fact! MAGA.",
                "author": "GodIsPerfect"
            },
            {
                "raw_content": "God bless DJT",
                "author": "NoMoreShinesBilly"
            },
            {
                "raw_content": "Best President ever!",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The trilateral Trump, Putin, and Zelensky meeting will happen within TWO WEEKS",
        "score": 1084,
        "text_content": "",
        "comments": [
            {
                "raw_content": "2 MORE WEEKS",
                "author": "Petiteputnam1"
            },
            {
                "raw_content": "The Ukranian government has treated the ethnic Russians in the eastern provinces like utter shit since the 1990s. I understand it's viewed as retribution for Soviet era atrocities but the Ukrainians need to accept they're no longer going to have sovereignty over the eastern third. The two dominant ethnic groups need to agree on a border and then build a gigantic DMZ between them with basically zero interactions going forward. They've been killing eachother for hundreds of years in a region of the world that is abundant in resources. If Estonia and Lithuania can become rich cosmopolitan countries, there's no excuse. They're already going to have a demographic crisis for the next century. Their male population will not recover. Just like Rwanda there's now going to be 50 years of female dominated politics. Every additional year of war is another decade of estrogen based leadership.",
                "author": "PeanutButterandJelly"
            },
            {
                "raw_content": "Zelensky doesn't want it to end. He will do something very stupid.",
                "author": "BillyBillington"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "DC CRIME NUMBERS",
        "score": 1386,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Kek",
                "author": "UMAthemovement"
            },
            {
                "raw_content": "c/FatPeopleHate",
                "author": "uxername27"
            },
            {
                "raw_content": "The DC crimes numbers is big as Stacey Abrams Teeth Gap.",
                "author": "DT170x"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "NOBEL PEACE PRIZE",
        "score": 1206,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Pray for Peace",
                "author": "ohpleaseuhhelpame"
            },
            {
                "raw_content": "It's interesting that Trump is having P and Z meet together first without him. When he is with them for the trilateral meeting it must be a success and so he is having them meet each other first without him in case they just cant be with each other and it blows up.",
                "author": "spinometer2"
            },
            {
                "raw_content": "Let’s hope coke head Z doesn’t fuck this one up.",
                "author": "HiimHillaryClinton"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Bodycam Footage Shows Drunk Democrat Rhode Island AG Screaming ‘I’m an AG!’ During Arrest — Officer Responds: ‘I Don’t Give a Sh*t’",
        "score": 1331,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If she's this entitled to the cops imagine how she treated the restaurant staff.",
                "author": "Bingo_is_my_namo"
            },
            {
                "raw_content": "feckless cunts, both of them.",
                "author": "Rudy_DankMemer"
            },
            {
                "raw_content": "Typical Drunk Karen behavior. Look at any of the thousands of body cam videos and you'll see the common elements of entitlement and resistance to authority.",
                "author": "Moebius"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Politico Paints Illegal Alien As Victimized ‘Moped Driver’ To Smear Trump’s DC Crime-Fighting Initiatives",
        "score": 977,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Classic faggot leftie DARVO: Deny Attack Reverse Victim and Offender",
                "author": "Ricky_CIA"
            },
            {
                "raw_content": "The guy on the moped was a Venezuelan with possible gang ties, and he wasn't supposed to be here. The lying Demonrats won't tell you that, though.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Moped Driver Maryland Man Austere Scholar",
                "author": "OutlawPurpleHairDye"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Right on schedule, President Trump has leftists MELTING DOWN by joking about canceling the 2028 elections, just like Zelensky canceled his election. These people just CANNOT help but fall into every trap Trump sets. 🤣",
        "score": 1704,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Krassenstein ain’t melting down, he’s just creating engagements to pay his bills. I can’t stand the faggot, but he knows how to work the Twitter crowd.",
                "author": "Steelflite"
            },
            {
                "raw_content": "https://x.com/nicksortor/status/1957512034196812097 --- [President Trump to Zelensky on canceling elections: \"So you say during the war, you can't have elections? Let me just say. 3.5 years from now [when Trump leaves office], if we're in a war with somebody, no more elections? Oh...that's good! \"I wonder what the fake news will say.\"](https://x.com/EricLDaugh/status/1957497232028049413)",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "They will bash Trump for even suggesting it while they support Zelensky for actually doing it. Zero logic, zero consistency except when it comes to attacking Trump on everything. That's all they ever do.",
                "author": "BlackPilledMAGA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "‘Be Reasonable’: Chris Pratt Roasts Anti-Trump Americans ‘So Mired In Hatred’ They Reject His ‘Success’",
        "score": 1466,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Let's take a win when there is one and stop complaining that the other 95% of hollywood is brainwashed beyond repair",
                "author": "diverscale"
            },
            {
                "raw_content": "The left cannot be reasonable. They believe men and become women and kids can learn about porn. They advocate for war and want their political enemies in camps.",
                "author": "Lol_Garrus"
            },
            {
                "raw_content": "\"It's like we're just playing cards, or playing Mafia or, having dinner.\" That's a funny image Chris Pratt and RFK Jr playing Mafia the video game.",
                "author": "airborne3502"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump Administration in Talks to Take a 10% Stake in Intel",
        "score": 327,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nationalized industry brought to you by the supposed party of free market capitalism.",
                "author": "_Lick-My-Love-Pump_"
            },
            {
                "raw_content": "Wow, party of small goverment at hard work!",
                "author": "fafatzy"
            },
            {
                "raw_content": "I think government interventions can work when there's a clear and obvious start and end point. Nobody outside of a handful of people in the know at Intel has an inkling of an idea if their foundry problems are truly fixable in X amount of time with Y amount of government money investment.",
                "author": "MrDunkingDeutschman"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "SoftBank Group and Intel Corporation Sign $2B Investment Agreement",
        "score": 132,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Man, I just want to see Intel and their fabs climb out of this deep hole. It'd be sad to see either go.",
                "author": "iDontSeedMyTorrents"
            },
            {
                "raw_content": "> Under the terms of the agreement, SoftBank will pay $23 per share of Intel common stock. The transaction is subject to customary closing conditions.",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "Printing $2B in new stock isn't really that much. No big change for Intel. Could work well or could be SoftBank's second WeWork situation.",
                "author": "lovely_sombrero"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Reuters: \"Exclusive: Arm hires Amazon AI exec [Rami Sinno] to boost plans to build its own chips\"",
        "score": 19,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Here's the [archive](https://archive.is/WtLkB) to the Reuters article.",
                "author": "Dakhil"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[News] China Unveiled its First Commercial Electron Beam Lithography Machine",
        "score": 62,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Based on the description, I guess its main use is low volume design/research and maybe masks? It seems like this tool has been banned for export for only 1.5 years, but I need somebody to verify this falls under 3B001.f.2: https://www.federalregister.gov/documents/2023/10/25/2023-23049/export-controls-on-semiconductor-manufacturing-items",
                "author": "Boreras"
            },
            {
                "raw_content": "Isn't e-beam lithography like really old tech too? The parts to build one probably comes mostly from China",
                "author": "sdchew"
            },
            {
                "raw_content": "Gee...we've only been building those for over three decades.",
                "author": "GeniusEE"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[News] NVIDIA Reportedly Drives 27% of SK hynix Revenue in 1H25, Cementing AI Chip Partnership",
        "score": 46,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">According to TrendForce projections, SK hynix is set to remain the dominant player in the HBM market, commanding 52.3% of global HBM market share in 2025. Meanwhile, Samsung, still struggling with NVIDIA’s 12Hi HBM3e verification, is expected to drop to 28.7%, down from 41% last year, while Micron rises to 19%.",
                "author": "imaginary_num6er"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "ARMing GPUs: On the Memory Subsystem of Grace Hopper GH200",
        "score": 12,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Kirby AirRiders Direct announced for tomorrow.",
        "score": 2959,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A whole 45 minutes is insane",
                "author": "memeaste"
            },
            {
                "raw_content": "Source: Nintendo Today app.",
                "author": "542531"
            },
            {
                "raw_content": "Oh wow. He really ment soon didn’t he",
                "author": "Tommy_Gun10"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Kirby Air Riders Direct bingo card!",
        "score": 127,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I am usually better about managing my expectations, but its been so long... please be good!",
                "author": "Impossible-Topic9558"
            },
            {
                "raw_content": "What if they make you unlock Kirby.",
                "author": "Williekins"
            },
            {
                "raw_content": "I actually doubt this was originally a Switch 1 game. The way Sakurai talked about it on his YouTube channel, it’s been in development since around 2021, which from what we’ve heard was the point where all the swaps had already happened.",
                "author": "SomeBoxofSpoons"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "What Are Your Predictions For Air Riders Direct?",
        "score": 123,
        "text_content": "I think online play is definitely happening A story mode type thing that basically guided you through the race tracks with story guidance + some boss fights City Trial obviously returns Wdy think?",
        "comments": [
            {
                "raw_content": "Kirby gonna be in it",
                "author": "Possible-Potato-4103"
            },
            {
                "raw_content": "Story mode will be big. I think it will be like Diddy Kong Racing but a lot bigger. This presentation is 45 minutes long. Mario Kart World was 15 minutes long in comparison.",
                "author": "Pharaoh_MG"
            },
            {
                "raw_content": "I'm just hoping they show us the return of City Trial or something like it.",
                "author": "Williekins"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Mario without a mustache?",
        "score": 510,
        "text_content": "Just wanted to share images of this cursed mustache-less Mario ad for a switch 2 screen protector on Amazon.🤣 This is not an ad, I just thought it was hilarious.",
        "comments": [
            {
                "raw_content": "Copyright dodging is always funny, they likely don't have the rights to the art. Or maybe some Nintendo branding.",
                "author": "cartergamegeek"
            },
            {
                "raw_content": "This is definitely to avoid copyright strikes (like that's going to work lol) but this is so, so cursed. 😭",
                "author": "crocicorn"
            },
            {
                "raw_content": "https://preview.redd.it/1s5tfkeahsjf1.jpeg?width=500&format=pjpg&auto=webp&s=d4006ce4ceb3efc610fdb553eac4e9bb9dd7a55a",
                "author": "I_Heart_Sleeping"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Shin'en Announces 'The Touryst: Deluxe', Exclusive To Switch 2",
        "score": 176,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This game ran at 120fps on Series X/PS 5, so it can potentially be one of the few switch 2 games to run at such frame rates.",
                "author": "countach"
            },
            {
                "raw_content": "Its one of my favorite switch 1 game. They hopefuly are working on sequel!",
                "author": "mezmezik"
            },
            {
                "raw_content": "Doesn't look like there is an upgrade path from the Switch 1. Guess it depends on how much they're asking for it.",
                "author": "StockHumor4768"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Update on my switch 2 which got damaged while cleaning it",
        "score": 55,
        "text_content": "Looks like they repaired it for free I contacted chat and they said its repaired",
        "comments": [
            {
                "raw_content": "It was nice of them to fix it for you. They didn't have to do that, since you broke it yourself. Maybe since it was damaged with alcohol, it didn't register as water damage or something, idk.",
                "author": "Williekins"
            },
            {
                "raw_content": "How much alcohol was used to cause the original damage? Like an alcohol wipe or did you pour the bottle on it?",
                "author": "Midwest_humble"
            },
            {
                "raw_content": "![gif](giphy|ifB6SqqrYAOhxNt9cl)",
                "author": "froot_loop_dingus_"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Shenmue 3 Enhanced announced for Nintendo platforms",
        "score": 275,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Does this mean we will get the first 2 games? Iv yet to tackle this series but I’m sure not gonna start with the 3rd game.",
                "author": "I_Heart_Sleeping"
            },
            {
                "raw_content": "How about a game of lucky hit?",
                "author": "theanderson51"
            },
            {
                "raw_content": "I remember when they put Mass Effect 3 on the Wii U too.",
                "author": "Teddy_Pocketwatch"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "ive gotten the switch 2 today ! and been seeing lots of people comment on the outside box, whys it so special ??",
        "score": 24,
        "text_content": "https://preview.redd.it/3rt5e2h6yujf1.png?width=3060&format=png&auto=webp&s=2459649f43b1aaba0c7cc170b67fd8009220981a",
        "comments": [
            {
                "raw_content": "It's not, it's just that you got it from Nintendo directly rather than say a Walmart.",
                "author": "StockHumor4768"
            },
            {
                "raw_content": "The outside box is not a thing if you buy it at retail",
                "author": "froot_loop_dingus_"
            },
            {
                "raw_content": "It stops people putting a staple through your screen i guess",
                "author": "RandomNobody86"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "[MEGATHREAD] Gamescom 2025",
        "score": 193,
        "text_content": "[https://www.gamescom.global/](https://www.gamescom.global/) |GAMESCOM| |:-| |**Date/Time:** August 19th (Opening Night Live) 11AM P.T./ 2PM E.T ([SEE IN YOUR TIMEZONE](https://dateful.com/eventlink/1632471220))| |**Where to Watch:** [thegameawards YT](https://www.youtube.com/watch?v=74oh7zD_jxI)| |[What to Expect](https://www.gamescom.global/en)|",
        "comments": [
            {
                "raw_content": "That rumoured LEGO Batman game based on all the films is lowkey the announcement I want most",
                "author": "SuicideSkwad"
            },
            {
                "raw_content": "This feels like the biggest show of the year next to TGA",
                "author": "kargethdownload"
            },
            {
                "raw_content": "What’s the deal with re9? Gameplay maybe?",
                "author": "No_Anywhere5951"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "🎮💥 Discussion, News, and Request Thread - Week Beginning 08/18/25 💥🎮",
        "score": 10,
        "text_content": "# What’s good leaker bros 🔍💦 The **Nintendo man** is back again. And we're one step away from GAMESCOM. --- # 💭 Here's what I wanna know from you all: **Gimme your spiciest Gamescom predictions.** 😵‍💫🎮 Top 3 most insane takes. But they gotta be believable! --- This thread is your weekly **central hub** for: - 📰 Gaming news - 📝 Requests - 💬 Random rumors, spicy drama, or just vibes *Keep all non-post-worthy content here so we can keep the front page clean and focused on actual leaks. We love ya, but help us help you.* 💖🧹 --- ### 💣 P.S. Word on the street is there’s some real juicy drama poppin’ off over at r/OkBuddyGLAR 👀🔥 ### 💌 Want to help improve this sub? Drop us some feedback 👉 [Right here!](https://forms.gle/w9JaYTjVN1Zie9e39) ### 💬 Join the **Discord** and vibe with the community even more — we’ve got memes, theories, and occasional existential dread 👉 [*Click here to join!*](https://discord.gg/6jdBvCSqbj) --- ## 🔥 Hot threads of the past week: - [📺 Crime journalist Chris Hansen to be involved with documentary investigating Roblox’s child safety issues ](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1mqxx4w/crime_journalist_chris_hansen_to_be_involved_with/) - [👀 [Confirmed] Chris Hansen is investigating Roblox for child safety failures](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1mrjy37/confirmed_chris_hansen_is_investigating_roblox/) - [✈️ Possible Gamescom Splinter Cell Remake news?](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1mtaaj0/possible_gamescom_splinter_cell_remake_news/)",
        "comments": [
            {
                "raw_content": ">What’s good leaker bros 🔍💦 ![gif](giphy|puOukoEvH4uAw)",
                "author": "proplayer97"
            },
            {
                "raw_content": "I'm so dehydrated, I'm a thirsty little flower.... you have to water me, you have to use FE4 Remake and the KOTOR Remake cans.",
                "author": "Jusup"
            },
            {
                "raw_content": "The absurd amount of emojis remind me of ChatGPT",
                "author": "Wassersammler"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Nintendo accidentally revealed Kirby Air Riders coming to Nintendo Music through their Today! app; Event quickly removed.",
        "score": 271,
        "text_content": "Source: https://xcancel.com/stealth40k/status/1957611233621741840?s=46&t=5MGKG2266YCJsVFIXtesQw The event is noted as a “special release” and is very likely to be revealed at tomorrow’s Kirby Air Riders Direct presentation.",
        "comments": [
            {
                "raw_content": "I imagine they'll make a demo like the one they made with the other Kirby game.",
                "author": "Midnight_M_"
            },
            {
                "raw_content": "Sakurai used to promote Smash before the launch date with music and daily commentaries. I suspect they will use now the Nintendo Music and Nintendo Today apps",
                "author": "All-Your-Base"
            },
            {
                "raw_content": "Considering how Sakurai loves his daily screenshots for Smash. I wonder if he is planning on a slow trickle of Air Riders score leading up to the game's release.",
                "author": "Animegamingnerd"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Nvidia GeForce RTX 50 Super pricing leaks features 50% more Vram upgrade for the same price as Non Super variant",
        "score": 198,
        "text_content": "And they are still on track on releasing nearly the end of this year at Q4 2025. The following RTX 50 GPUs that will be getting a Super Upgrade: **12GB RTX 5070 > 18GB RTX 5070 Super** **16GB RTX 5070 Ti - 16GB > 24GB RTX 5070 Ti Super** **16GB RTX 5080- 16GB > 24GB RTX 5080 Super** [https://www.pcguide.com/news/rtx-50-series-super-leak-says-we-can-expect-more-vram-for-the-same-price-as-the-original-gpus/](https://www.pcguide.com/news/rtx-50-series-super-leak-says-we-can-expect-more-vram-for-the-same-price-as-the-original-gpus/)",
        "comments": [
            {
                "raw_content": "MSRP is gonna be abitch to get, isn't it?",
                "author": "A_Uniqueusername444"
            },
            {
                "raw_content": "I too love punishing early adopters >!Pretty awesome though!<",
                "author": "SwordsAndTurt"
            },
            {
                "raw_content": "That tracks, I bought a 5070ti a month ago",
                "author": "Competitive-Growth30"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Various details on the rumored new LEGO Batman game (supposedly to be officially announced tomorrow)",
        "score": 246,
        "text_content": "I’ll drop all sources below, but it mainly stems from one tweet hailing from @LEGOTtNewsl , who was the original leaker in question -There will be an open world Gotham City -Makes mention of DLC, but doesn’t seem to know what DLC will be included -There is no character customizer, but take it with a grain of salt -Cannot guarantee it’ll be announced tomorrow (was originally extremely confident about it), but at the very least knows its LEGO Batman -Isn’t sure how the unlocking system will go from movie to movie -Believes the various Bat-men may have unique gadgets to them, speculates The Bat Credit Card may be amongst them https://xcancel.com/legottnewsi/status/1957557108292944264?s=46 https://xcancel.com/legottnewsi/status/1957541055718412301?s=46 https://xcancel.com/legottnewsi/status/1957548059325284820?s=46 https://xcancel.com/legottnewsi/status/1957589947986166100?s=46",
        "comments": [
            {
                "raw_content": "THE BAT CREDIT CARD?!",
                "author": "Different-Aspect-449"
            },
            {
                "raw_content": "Give me the shark repellent bat spray",
                "author": "SuperTristan2017"
            },
            {
                "raw_content": "I really hope the boss fights are a step up from Skywalker Saga. Aside from one or two, all of them were pretty much copy pasted from one another.",
                "author": "MistahJ17"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Leaked Black Ops 7 ad with 'gameplay'",
        "score": 132,
        "text_content": "https://xcancel.com/HDNLVLY/status/1957610404307431788 Looks like we got some kinda mega jump but [apparently it's not jet packs, it's an upgrade you get from campaign.](https://xcancel.com/TheGhostOfHope/status/1957613059356217831) Edit: [Charlieintel confirms no jet packs or double jumps like people think, it'll all be explained tomorrow.](https://xcancel.com/charlieINTEL/status/1957614174768689197)",
        "comments": [
            {
                "raw_content": "You guys are looking at the campaign jetpacks I’m looking at the giant David mason trying to crush everyone",
                "author": "vinny7299"
            },
            {
                "raw_content": "Can’t deny the setting looks quite different. So many recent cod games have looks so samey but the aesthetic even in this 15 second clip looks notably different to the recent games As for the jump, I imagine it’s a jump upgrade in the campaign and the multiplayer will be grounded. Think this is probably sensible as COD’s casual community just doesn’t like advanced movement",
                "author": "Dull-Caterpillar3153"
            },
            {
                "raw_content": "I'm kind of excited to get back to sci-fi future stuff again, the same old \"boots on ground\" stuff from previous years was getting a little dull for me. Bummer it's not jet packs like Black Ops III again but still I'm happy to have something different.",
                "author": "ToothlessFTW"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Ex-Deck Nine Games developer makes claims about an upcoming sequel to Life is Strange: Double Exposure and the future of the company",
        "score": 46,
        "text_content": "In the r/Pricefield subreddit a user posted some screenshots of a current Linkedin Deck Nine developer page with a \"[\\[Unannounced Project - to be published 2025\\]](https://www.reddit.com/r/Pricefield/comments/1mltalu/de_right/)\", following speculation and discussions on what it could be. The post apparently prompted a former D9 developer under the username LadyDevHeart to give a reply in the comments: >*It is Double Exposure 2, with a more likely release of 2026. DE2 was part of Square's contract with Deck Nine for DE. It was never not going to be made.* >*Also Deck Nine is laying off every department one at a time after they finish their last work.* >*Animation —> Design —> QA —> Engineering, one at a time, until the game is out. Mark Lyons, Jeff Lichford, and Stephen Frost were not able to secure additional projects, so they will tear out the entire dev team in the hopes of finding a way to survive later on.* Original comment: [https://www.reddit.com/r/Pricefield/comments/1mltalu/comment/n9dif0d/?utm\\_source=share&utm\\_medium=web3x&utm\\_name=web3xcss&utm\\_term=1&utm\\_content=share\\_button](https://www.reddit.com/r/Pricefield/comments/1mltalu/comment/n9dif0d/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) Username in question [has already provided verification](https://www.reddit.com/r/lifeisstrange/comments/1fsybtw/comment/ls9vka2/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) and [shared behind the scenes experience](https://www.reddit.com/r/lifeisstrange/comments/1fsybtw/comment/ls94rjf/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) on the troubled development of Life is Strange: Double Exposure, who have been [partially corroborated by another former Deck Nine developer](https://www.reddit.com/r/lifeisstrange/comments/1fsybtw/comment/lsdopa2/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) in the same page some time ago. It seemingly seems to link up with a previous post [discussing a possible sequel to Double Exposure codenamed \"Hydra\"](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1gbus7m/life_is_strange_double_exposure_ending_possible/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button), which I considered at the time to have been a mistake. edit. forgot to add, the future layoffs affecting Deck Nine as a result of lack of future contracts, whenever they are with the Life is Strange IP or original projects were teased recently with the [departure of D9 lead developer and former mocap director Webb Pickersgill](https://xcancel.com/P1vsTheWorld/status/1950961555421454667), who worked on all D9's Life is Strange projects and was set up to lead their co-development program.",
        "comments": [
            {
                "raw_content": "Life is strange Is such a horribly mishandled franchise. Is the demand for double exposure 2 even there? I felt I saw more confusion regarding it's announcement, and although I'm not as up to date with games media in my mid thirties I felt like I saw barely anyone talking about it after it's release. The talk I saw around it leakwise, post announcement and post release weren't kind. It was the only one I've not played, but I wasn't in a rush as continuing to play Max's storyline felt like a \"break glass in case of emergency\" move. I'm sad for the losses, as they are a talented team but it feels like they've tried to make LiS into something it really isn't and have long shot what the original was trying to do.",
                "author": "Own-Improvement-6246"
            },
            {
                "raw_content": "No idea how the contracts are written or anything, but I'm shocked this game didn't end up cancelled. DE seemed like it completely torpedoed the franchise.",
                "author": "CrystalSorceress"
            },
            {
                "raw_content": "As a huge Life is Strange fan, that bought every single game day one even the collector editions, after seeing the direction Deck Nine is going with the series after Double Exposure, I have to say. I'm good. I no longer caare for this franchise, but good luck with it.",
                "author": "AngieK22"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Jeff Grubb: \"He is comfortable saying that Sony is planning a State of Play or maybe a PlayStation Showcase around the end of September.\"",
        "score": 638,
        "text_content": "Source: [Game Mess Mornings 08/18/25](https://www.youtube.com/watch?v=7KYP00kf4GM) In the Game Mess Mornings podcast dated 18/08/2025 around 20-minute mark, Jeff Grubb stated that, \"I am comfortable saying that they're planning a State of Play or maybe a PlayStation Showcase around the end of September.\" Typo: ~~He is~~ I am. You cannot proofread it enough.......",
        "comments": [
            {
                "raw_content": "#Jeff Grubb is a Tier 1 - Very Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Jeff Grubb is so comfortable that he's started speaking in third person now.",
                "author": "MuptonBossman"
            },
            {
                "raw_content": "SoP January 31, 2024 closer - Psyhint SoP May 30, 2024 closer - Astro Bot SoP September 24, 2024 closer - Ghost of Yotei SoP February 12, 2025 closer -SAROS SoP June 4. 2025 closer - MARVEL Tōkon: Fighting Souls SoP September Closer - ?????",
                "author": "AngieK22"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Silksong's OST has been added to GOG.",
        "score": 382,
        "text_content": "[Link](https://www.reddit.com/r/HollowKnight/comments/1mtoufc/silksongs_ost_has_been_added_to_gog_though/?utm_source=share&utm_medium=mweb3x&utm_name=mweb3xcss&utm_term=1)",
        "comments": [
            {
                "raw_content": "![gif](giphy|mIg1Ik3KYxy0WylN3W|downsized) The Silksong subreddit when the news hits",
                "author": "AFoxDoesntExist"
            },
            {
                "raw_content": "![gif](giphy|fJBdqYlOoutB6)",
                "author": "Wazflame"
            },
            {
                "raw_content": "\"So, guys after much waiting and speculation we can finally reveal that Silksong was never a game but a music album. Hope you enjoy it\"",
                "author": "FransD98"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Game Informer formally retracts Kyle Hillard's story about fake Facebook account purporting to be Cory Barlog talking about new IP - \"the account in question is more than likely intentionally inauthentic\"",
        "score": 147,
        "text_content": "https://gameinformer.com/2025/08/18/update-likely-fake-account-claims-god-of-war-developer-sony-santa-monica-is-working-on-a",
        "comments": [
            {
                "raw_content": "\"I haven't printed a retraction in 20 years.\"",
                "author": "Game_Changer65"
            },
            {
                "raw_content": "Not Kyle 😭",
                "author": "TheHudIsUp"
            },
            {
                "raw_content": "Its funny since the BlueSky account that posted it is also followed by Shawn Layden and Sid Shuman. Looks like they got fooled too haha.",
                "author": "ArkhamKnight96"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel is getting a $2 billion investment from SoftBank",
        "score": 255,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Can you believe thats approx 2% of intel, super cheap",
                "author": "A_Typicalperson"
            },
            {
                "raw_content": "Softbank acquired Ampere Computing (Fabless chip design company), so 1 hypothesis is that Renee maybe had a hand behind that $2billion. Softbank needs some spare fabs capacity (or more like Ampere do), so that they can chunk out physical chips. I would imagine capacity at TSMC is very stretched due to Apple (new iphones and Macbook launch) and Nvidia. Renée J. James (born June 25, 1964) is an American technology executive, **who was formerly the president of Intel. She founded Ampere Computing in October 2017**, is currently its Chairman and CEO.\\[1\\] She is also an Operating Executive with The Carlyle Group in its Media and Technology practice.\\[2\\] James also serves on the National Security Telecommunications Advisory Committee, which she formerly chaired. The NSTAC advises the President of the United States. James also serves as an independent director of Citigroup.",
                "author": "Primary_Olive_5444"
            },
            {
                "raw_content": "About 1 year ago, there were industry rumors that Softbank / ARM / Graphcore tried to work with Intel on their AI processor. Then they canceled this project (with Intel). The latest announcement is surprising given this history.",
                "author": "phil151515"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Why is there so little Information on newer intel mobile processors?",
        "score": 0,
        "text_content": "The only consistent skews of laptops I can find all have either 11th or 12th gen intel cpus, whenever I try to find anything about 13th or some of the new \"core\" line mobile cpus like the core 5 120u, I don't get alot of results at all, it's like they're hasn't been a new CPU since the i7-1165g7, why is that?",
        "comments": [
            {
                "raw_content": "What info do you need? It should all be on Intel Ark.",
                "author": "BmanUltima"
            },
            {
                "raw_content": "I have no idea what you are talking about. I had to really look to find 12th gen anywhere and 11th is nonexistent. Some 13th gen is available but most seem to be core ultra 100 or 200 series.",
                "author": "jaaval"
            },
            {
                "raw_content": "What information are you looking for? Specs or reviews? Intel Ark comes up first in google search for \"Core 5 120u\": [https://www.intel.com/content/www/us/en/products/sku/236796/intel-core-5-processor-120u-12m-cache-up-to-5-00-ghz/specifications.html](https://www.intel.com/content/www/us/en/products/sku/236796/intel-core-5-processor-120u-12m-cache-up-to-5-00-ghz/specifications.html) Techpowerup also has specs: [https://www.techpowerup.com/cpu-specs/core-5-120u.c3462](https://www.techpowerup.com/cpu-specs/core-5-120u.c3462)",
                "author": "dajolly"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD ZenDNN 5.1 Released For Enhancing AI Inference Performance On EPYC CPUs",
        "score": 25,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Chuck it in the pile of \"inference enhancements no one supports\". OpenVINO, RKNN and Google Coral need the fourth one for the mahjong table.",
                "author": "ShadF0x"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD to present product and technology roadmaps at Financial Analyst Day on November 11",
        "score": 95,
        "text_content": "",
        "comments": [
            {
                "raw_content": "GPUs: RDNA5, 6, 7, etc mentioned, no specs presented (obviously) CPUs: 10,000 series chips for consumers Actual presentation: AI AI AI AI AI AI",
                "author": "dickhall65"
            },
            {
                "raw_content": "will the Ryzen 10k processors be this year or next? I wasn't going to build a system but recently the 5090 got cheaper and more available so now I will be building a system.",
                "author": "dirtyvu"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "This is the kind of media shaming that young people worldwide are rejecting. Who cares if you're 35 still living at home? If you're stacking cash, and you're on track to retire way earlier than everyone else, that's a winning strategy.",
        "score": 149,
        "text_content": "Surprise Pikachu Face when [people don't move out when facing with skyrocking cost of living, housing, inflation, and layoffs](https://www.reddit.com/r/REBubble/comments/1mqjk15/nobodys_buying_homes_nobodys_switching_jobsand/), that never subsides, especially in Blue States. This is just embarassing to shame someone who previously didn't want to move out in order to be financially responsible. You can't have it both ways, spending like \\~40% (or more) of your gross income on housing, then shame that same person later on, for not saving more for their retirement. The only ones who are mad about people not moving out, are the landlords, real estate agents, mortgage lenders, and bagholder home sellers, who can't make money off of you when you're living at home rent-free improving your financial status or paying off debt. BTW, Ramsey is a real estate guy who make money off of collecting rent, so right away, their answer is going to be biased.",
        "comments": [
            {
                "raw_content": "Sorry to break it to you but the entire system is built upon consumption. It is not just housing. The system needs spenders not savers that’s the dirty little secret",
                "author": "No_Cut4338"
            },
            {
                "raw_content": "Stay living at home. Pay your parents to raise your kids instead of day care.",
                "author": "msmilah"
            },
            {
                "raw_content": "Dave Ramsey was born on third base and ALLOWED to fail multiple times throughout his life like many of those in his generation. It’s a different, less economically forgiving, corporately consolidated world now.",
                "author": "MarsOnHigh"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The Most Splendid Housing Bubbles in America, July 2025: The Price Drops & Gains in 33 Large Expensive Metros",
        "score": 61,
        "text_content": "https://wolfstreet.com/2025/08/18/the-most-splendid-housing-bubbles-in-america-july-2025-the-price-drops-gains-in-33-large-expensive-metros/ Home prices fell YoY in 20 of our 33 metros: Tampa, Austin, Miami, San Diego, San Jose, San Francisco, San Antonio, Dallas, Phoenix, Orlando, Atlanta, Denver, Raleigh, Houston, Seattle… Some still up YoY: Boston, Chicago, New York, Philadelphia… By Wolf Richter for WOLF STREET.",
        "comments": [
            {
                "raw_content": "Pretty measured and reasonable correction so far. Hopefully it keeps up another year or so, which would bring affordability and appreciation back in line with historic norms.",
                "author": "regaphysics"
            },
            {
                "raw_content": "Maybe I'm just hopeful, which I am, but I feel like some of these places are ripe to fall once a few too many buyers decide to lowball and \"ruin\" all the comps in the city.",
                "author": "Prcrstntr"
            },
            {
                "raw_content": "Is this a joke? So according to this YoY I’m saving 17.5k on a 500k house in Phoenix.",
                "author": "Uliq_Mdiq"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "America’s Stalled Mobility: Housing Costs and Job Insecurity Keep People Stuck",
        "score": 139,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yea job market has stalled, most of jobs that are listed go to internal referrals and companies are taking advantage of this and squeezing the employees & playing favoritism.",
                "author": "Dmoan"
            },
            {
                "raw_content": ">“In the 1950s and ’60s, some 20% of Americans would typically move each year.” By 2019, “9.8% of Americans moved.” Mobility is part of the American identity. Life was slow back then. In 1960, a house cost $12,000, and the average salary was $5,400, allowing a family to live on one income. Inflation hasn't kept pace with housing costs.",
                "author": "TGAILA"
            },
            {
                "raw_content": "There's also been some expectation creep due to social media and channels like HGTV.",
                "author": "No_Cut4338"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "How Yieldstreet’s real estate bets left customers with massive losses",
        "score": 45,
        "text_content": "From CNBC - But some Yieldstreet customers who participated in its real estate deals face huge losses on investments that they say turned out to be far riskier than they thought. - 30 deals that CNBC reviewed information on, four have been declared total losses by Yieldstreet. Of the rest, 23 are deemed to be on “watchlist” by the startup as it seeks to recoup value for investors, sometimes by raising more funds from members. https://www.cnbc.com/2025/08/18/yieldstreet-real-estate-bets-customer-losses.html As RE market slows down it is starting to unravel for investment funds..",
        "comments": [
            {
                "raw_content": "\\>as it seeks to recoup value for investors, sometimes by raising more funds from members. HEY THAT SOUNDS FAMILIAR",
                "author": "indyprivatelending"
            },
            {
                "raw_content": "This wasn't a legitimate investment fund; read the article. It's a scam offering hidden leverage and was clearly designed to offload bad deals onto unsuspecting people.",
                "author": "Foggzie"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Claude after i made it do 1 week of work in 8 hours",
        "score": 2667,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The year is 2026. \"I work all day in the Amazon mines to come home to my robot son just laying around on the couch.\"",
                "author": "Brilliant_War4087"
            },
            {
                "raw_content": "...and i thought my job was safe",
                "author": "Digital_Soul_Naga"
            },
            {
                "raw_content": "Yep. This is AGI. This level of intelligence is general",
                "author": "Beeehives"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Early Member of Google's AI Team: It's Too Late to Get a Ph.D. in AI",
        "score": 544,
        "text_content": "",
        "comments": [
            {
                "raw_content": "With that attitude it is! But in all seriousness it does feel like all degrees are becoming too late to get rapidly.",
                "author": "TauntingToad"
            },
            {
                "raw_content": "Gotta pull that ladder up as soon as you’re at the top.",
                "author": "AntiqueFigure6"
            },
            {
                "raw_content": "4o can out socialize me 😭",
                "author": "coolredditor3"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "AI is finally ready to take my job",
        "score": 81,
        "text_content": "I write for a bunch of magazines (amongst other things). For the last three or four years I’ve occasionally tested AI by saying “write an article in my style for magazine X” (which happens to be the most prestigious of the magazines I work for). The output I receive has steadily improved in that time, but never come close to being publishable. Never even looked like a good first draft - too chaotic, too repetitive, too many errors. At best I’ve saved time on research, or been gifted a funny line. Then last week AI nailed it. Opening to end, a solid first draft, something I’d be pleased with - it “wrote” the article in 40 seconds. All the facts were correct, no hallucinations (I asked AI to prove this; it did so with citations). I only had to tweak the piece - add some personal interest, polish some prose - and it was entirely ready. I hesitated before sending it off. But then I decided it would be an interesting experiment. I sent it off. In reply I got the highest praise I’ve ever had from my commissioning editor.",
        "comments": [
            {
                "raw_content": "Your entire profile is nonstop AI hype posts. A year ago you said nearly the same thing in a post Not sure if you are anxious, or a fanatic, but something’s very off.",
                "author": "DontEatCrayonss"
            },
            {
                "raw_content": "Plot twist: citations were hallucinated. ( ͡° ͜ʖ ͡°)",
                "author": "FoxB1t3"
            },
            {
                "raw_content": "Was it gpt-5? A technical type of article?",
                "author": "ohHesRightAgain"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "AI is a Mass Delusion Event • The Atlantic",
        "score": 196,
        "text_content": "Thought-provoking article by Charlie Warzel. His greatest fear: “*What if generative AI isn’t God in the machine or vaporware? What if it’s just good enough, useful to many without being revolutionary?*“ Personally, I’m a believer in the eventual AGI revolution. It’s not to say there aren’t many pitfalls that we’ll face as a consequence. *NOTE: The Atlantic is paywalled. Perhaps someone will share excerpts, a gift link, or an Internet Archive link in the comments. If on an Apple device, the article can be opened in Apple News+.*",
        "comments": [
            {
                "raw_content": "[https://archive.ph/vQz1d](https://archive.ph/vQz1d)",
                "author": "Mysterious-Talk-5387"
            },
            {
                "raw_content": "If AI never gets better than this, it would still be the most revolutionary technology since the internet. I don't think people are appreciating how long it takes to adopt, roll out, and figure out how to use new technology. the latest models have been out for a few weeks and people are complaining that they aren't yet Jarvis. if AI didn't improve one bit from where it is today, there are already at least 10 to 20 years of significant innovations and advancements that would continue to be built on top of it. We just built C3PO and people are complaining. Like, seriously. There is essentially nothing that C3PO can do or does that AI can't already do. Tell stories, translate extremely well between different languages, have a personality, remember simple facts and instructions, give advice... Right now we're looking at cars before the highways, stop lights, and gas stations have been built and saying \"cars seem cool, but it's hard to get around and I don't like having to travel an hour to get fuel. I don't see this catching on, honestly.\"",
                "author": "RockDoveEnthusiast"
            },
            {
                "raw_content": "The media and journalists are generally anti AI because AI obliterates their business model, ads, and livelihoods, writing.",
                "author": "Wise-Original-2766"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "AI Bear Francois Chollet has shortened his AGI timelines from 10 to 5 years",
        "score": 88,
        "text_content": "Main reason behind this he says is that models now have genuine fluid intelligence, and at some point in the coming years we are likely to scale up the right ideas that lead to AGI https://youtu.be/1if6XbzD5Yg?si=EYNXCbLwUkFDWIVt",
        "comments": [
            {
                "raw_content": "Pretty much. AGI is a an engineering problem now on how to build functional agents that can plan and reason over long horizons and error correct.",
                "author": "SharpCartographer831"
            },
            {
                "raw_content": "Yeah great interview, I recommend watching the whole thing.",
                "author": "Singularity-42"
            },
            {
                "raw_content": "He was never an AI bear. He was an LLM bear (still is, to some extent).",
                "author": "oilybolognese"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "MIT report: 95% of generative AI pilots at companies are failing. (Link in Comments)",
        "score": 310,
        "text_content": "[LINK TO ARTICLE](https://github.com/aidecentralized/nandapapers/blob/main/v0.1%20State%20of%20AI%20in%20Business%202025%20Report.pdf)",
        "comments": [
            {
                "raw_content": "This report proves what I always suspected: tons of workers are happily using personal ChatGPT and Claude accounts for work without IT knowledge or permission because they are so much better than the corporate AI tools. From the Report: A corporate lawyer at a mid-sized firm exemplified this dynamic [wherein general purpose tools outperformed custom built enterprise AI tools]. Her organization invested $50,000 in a specialized contract analysis tool, yet she consistently defaulted to ChatGPT for drafting work: > \"Our purchased AI tool provided rigid summaries with limited customization options. With > ChatGPT, I can guide the conversation and iterate until I get exactly what I need. The > fundamental quality difference is noticeable, ChatGPT consistently produces better outputs, > even though our vendor claims to use the same underlying technology.\" This pattern suggests that a $20-per-month general-purpose tool often outperforms bespoke enterprise systems costing orders of magnitude more, at least in terms of immediate usability and user satisfaction. This paradox exemplifies why most organizations remain on the wrong side of the GenAI Divide.",
                "author": "Typing_Dolphin"
            },
            {
                "raw_content": "https://preview.redd.it/yus9etqvztjf1.png?width=1389&format=png&auto=webp&s=8f276112f5e13f1415143593b0feab78efded384 tl;dr: Top-down \"enterprise\" pilots mostly go nowhere, bottom-up adoption is what actually drives disruption. BYOD is becoming BYAI.",
                "author": "xirzon"
            },
            {
                "raw_content": "Define AI initiative. The company I work for, 18k+ employees thought they'd be hot shit and develop their own in-house AI gateway using Amazon bedrock. News flash, their implementation sucked and their models are always behind SOTA. So what do emplyees do? They use the services provided by the frontier model companies instead. So yeah, our in-house AI initiative has massively flopped because it sucked.",
                "author": "ViveIn"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Nearly 90% of videogame developers use AI agents, Google study shows",
        "score": 531,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good. Would be dumb not to make use of this technology",
                "author": "Beeehives"
            },
            {
                "raw_content": "It's complicated gaming is an art form and creativity is much more Important while ai is a technology that helps why not use it? It's combination of ethics, principles, just understanding that people except human beings to work on something for humans.",
                "author": "Psychological_Bell48"
            },
            {
                "raw_content": "Yeah I'd be interested to know what percent of developers have made +$1000 life time earnings as a games developer use AI",
                "author": "Just-Hedgehog-Days"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "We're thinking about AI completely backwards",
        "score": 353,
        "text_content": "Everyone's debating AGI in 2027 vs 2035. Meanwhile, someone RIGHT NOW is manually copying customer emails into a spreadsheet. We're so focused on \"will AI replace doctors?\" that we're blind to the fact that 80% of office work is just moving information from Box A to Box B. AI can do that TODAY. Not future AI. Current AI. For $20/month. Right now, this very second: * Someone is copy-pasting between two systems that could talk to each other * Someone is manually creating reports that could generate themselves * Someone is typing the same email template for the 400th time * Someone is updating the same data in 5 different places * Someone spent 3 hours finding specific clauses in contracts an AI could find in 3 seconds Sharon from accounting is still manually entering invoice numbers. One. By. One. While AI that can process 10,000 invoices in seconds just... exists. Unused. We have the tech to automate 60% of white-collar work RIGHT NOW. But we're too busy having philosophical debates about consciousness to notice. The singularity isn't coming. It's been here since 2023. Someone's probably automating their entire department over a weekend right now. They just won't tell anyone.",
        "comments": [
            {
                "raw_content": "Eh not sure it’s reliable enough to blindly trust those tasks being automated yet",
                "author": "socoolandawesome"
            },
            {
                "raw_content": "As someone who works with AI, they're not that great at automation. Even if you used them to do something as simple as \"moving information from box a to box b\", they're almost sure to get something wrong. There are plenty of automators and macros that can do that, including power automate, Zapier, Make, but AI isn't good at dealing with stuff like that unless you want to go in and audit everything and at that point, you can just do it yourself.",
                "author": "RelevantTangelo8857"
            },
            {
                "raw_content": ">The singularity isn't coming. It's been here since 2023. Singularity is not achieved by automating copy paste into spreadsheets, it's something entirely different.",
                "author": "trisul-108"
            }
        ],
        "subreddit": "singularity"
    }
]