[
    {
        "post_name": "Bathhouse Barry",
        "score": 463,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Who's balls?",
                "author": "saltyviewer123"
            },
            {
                "raw_content": "DNA test the girls",
                "author": "MeMargie"
            },
            {
                "raw_content": "I bet.",
                "author": "RealTXPatriot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Happy New Year!",
        "score": 278,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's a nice pepe... it would be a shame if someone stole it",
                "author": "mrgreencard"
            },
            {
                "raw_content": "Happy New Year Frens, and welcome to the Golden Age!! ✨😎✨",
                "author": "ItsFunToSay-M-A-G-A"
            },
            {
                "raw_content": "🤩",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Historic Vondelkerk Church in Amsterdam just burned to the ground on New Year’s Eve",
        "score": 299,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The Muslims were just cold and needed to get warm 🙄",
                "author": "C0drus"
            },
            {
                "raw_content": "Start burning down mosques",
                "author": "BoomShtick"
            },
            {
                "raw_content": "Fucking pedo worshippers.",
                "author": "RedPillosopher1776"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "It’s a big club and you’re not indian",
        "score": 325,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Every group, except for Whites, is allowed to aggressively favor their own race over everyone else.",
                "author": "fskfsk"
            },
            {
                "raw_content": "Any idiots still think we're not in a civil war yet?",
                "author": "DebunkTheLeft"
            },
            {
                "raw_content": "Abbott won't stand for this.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "IT’S OFFICIAL: Assistant AG Harmeet Dhillon files legal action to FORCE Gov. Tim Walz and Minnesota officials to RELEASE the state’s voter rolls!",
        "score": 1162,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lol",
                "author": "Spawnlingman"
            },
            {
                "raw_content": "No judge anywhere is going to make a Democrat do anything",
                "author": "Pats5x"
            },
            {
                "raw_content": "Feel free to arrest that retarded shithead while you're at it.",
                "author": "2Clutch"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "We used to be a more tolerant nation -",
        "score": 761,
        "text_content": "",
        "comments": [
            {
                "raw_content": "After what happened during Blackhawk down there shouldn't be a Somali touching foot on American soil fuck those low IQ inbred goat fuckers.",
                "author": "JayKay1776"
            },
            {
                "raw_content": "Smolia is a good place for Smolians.",
                "author": "barwhack"
            },
            {
                "raw_content": "There is no reason to stereotype them just because of the way they all are",
                "author": "Oodles"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A new scam has just been uncovered in Minnesota Regular homes are being registered as assisted living facilities - In Minnesota assisted living facilities have seen 2x the growth of other programs - They are receiving 15x the payments of other programs",
        "score": 561,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A new scam has just been uncovered in Minnesota Regular homes are being registered as assisted living facilities - In Minnesota assisted living facilities have seen 2x the growth of other programs - They are receiving 15x the payments of other programs - Shell companies used to create some of the facilities - The amount of new locations have exploded in Minnesota cities - Many owned by known money laundering scammers “This may look like your typical single family home but it bills itself as an assisted living facility and it receives a lot of taxpayer money. Here in Minnesota the number of people getting help in assisted living facilities is up double the growth of other programs. But here's the kicker, the rate of payment in this assisted living space is 10 to 15 times the growth in other programs. We pulled the data on assisted living facilities in the Minneapolis area. Minneapolis, as you might expect, has a lot. 169. - St. Paul, with a population of 307,000, has 83 - Brooklyn Center, 30,000 population, has 106 - Brooklyn Park, population of 84,000, has 181, more than Minneapolis a city five times its size. But this assisted living facility puts this all in perspective. It's owned by a man indicted for laundering a million dollars in the Feeding Our Future scam.” “These assisted living facilities received over $2.3 million in state money last year alone. A Minnesota Reformer article says he has been paid a whopping $49 million since 2016.”",
                "author": "PiratePatriotParrot"
            },
            {
                "raw_content": "They came to a country that is so accepting of them that many still feel sympathetic to them after a $9B scam robbery. The true problem is racism.",
                "author": "OnceADroplet"
            },
            {
                "raw_content": "Can you imagine the pirates sitting around hijacked portable firepits cooking stolen meats chewing khat, opening duffle bags full of stolen Minnesotans tax money... LAUGHING THEIR ASSES OFF AT THE FUCKING STUPID AMERICAN GOVERNMENT",
                "author": "IHaveEvidence"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Good News! George and Amal Clooney, two of the worst political prognosticators of all time, have officially become citizens of France",
        "score": 1071,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yet you continue to enable it here. Fire Pam tonight and fucking DO SOMETHING. Let our 250th anniversary mean something. Arrest the criminals and restore the Republic!!",
                "author": "HelluvaEngineer"
            },
            {
                "raw_content": "Can you have dual citizenship or does this mean he’s no longer a US citizen?",
                "author": "Marianasoctober"
            },
            {
                "raw_content": "I will always love Trump for his mean and supremely hilarious tweets/truths.",
                "author": "BadBrainsBuzzcocks"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Tragedy strikes as burglars steal all the student attendance records from Somalian Learing Center.",
        "score": 978,
        "text_content": "",
        "comments": [
            {
                "raw_content": ". . . and those robbers are so tricky too. They were able to break through the sheetrock to gain access -- except that the sheetrock break pattern could only have been achieved by breaking it from inside the office. Man oh man, those robbers are so talented.",
                "author": "16BeatsAOne"
            },
            {
                "raw_content": "Because hell yeah. If I'm going to pull a B&E, my first choice would be an empty daycare center....",
                "author": "cd3dog"
            },
            {
                "raw_content": "Wait this really happened? I thought it was like a Babylon bee thing or something..",
                "author": "YouHadMeAtGaming"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Happy New Year you mad bastards",
        "score": 491,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Here’s to 2026. Cheers!!🥂",
                "author": "Whodat34"
            },
            {
                "raw_content": "This is going to be 2026.",
                "author": "CleanUpPhillyTrump24"
            },
            {
                "raw_content": "It's a new year, a new dawn, a new life for me. And I'm feelin' good.",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Happy New Years to all you Patriots",
        "score": 633,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No disrespect to our Commander in Chief, but dang…Melania is curvy in all the right places.",
                "author": "ConservativeAF"
            },
            {
                "raw_content": "Love ya President Trump and Flotus! God bless and keep you and bring abundance to you and your whole family! Happy New Years and we can actually say that now we have you as the Captain of this ship....",
                "author": "grannylovestrump"
            },
            {
                "raw_content": "is that from tonight?",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Washington Monument",
        "score": 425,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Don’t forget January 6. https://youtube.com/shorts/8lYao5OM-9Y?si=8JMEAanIR4wtVwJD Maybe project the video of Nancy claiming responsibility for it onto the Monument.",
                "author": "Rock9Head"
            },
            {
                "raw_content": ">every hour on the hour from 7pm-11:30pm. >on the hour >-11:30 lolwut",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Looks about sharp enough to shove up a commie's ass.",
                "author": "seeling0"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I SEE A GOLDEN FUTURE!!! HAPPY NEW YEAR!!!",
        "score": 754,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> Justice served and yet not one single arrest",
                "author": "Thermopylae_MMXX"
            },
            {
                "raw_content": ">Justice served Is Ben Garrison is mocking us?",
                "author": "kristal"
            },
            {
                "raw_content": "I would have agreed with it all last November. Where are we today?",
                "author": "Spawnlingman"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "About sums it up",
        "score": 371,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Still annoys me that the greasy goombah fuck hasn’t been beaten to a pulp yet for being part of the fraud.",
                "author": "DJTXLV"
            },
            {
                "raw_content": "masks are so gay",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "To be fair: wife had it on CBS this morning to see what the left was reporting and they had a decent segment on the fraud. It’s getting too big to ignore.",
                "author": "RuprechtThaMonkeyBoy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "CNN has solved the Somali fraud issue",
        "score": 987,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We don't hate those lazy cunts enough.",
                "author": "ChyNahAzzWhole1"
            },
            {
                "raw_content": "Well, then, there you are. They said they weren't scamming, so we must believe them.",
                "author": "LegendFang"
            },
            {
                "raw_content": "60 minutes type deep investigation. Wonder how much money the CIA launders through these?",
                "author": "Grindelwald"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "HAPPY NEW YEAR'S EVE PEDES!!!",
        "score": 752,
        "text_content": "",
        "comments": [
            {
                "raw_content": "lulz i didn't see ur post.. u beat me by a minute lol",
                "author": "Brownwaterboys"
            },
            {
                "raw_content": "Cheers, pedes",
                "author": "Skogin"
            },
            {
                "raw_content": "2026 is the year President Trump defeats the globalist cabal. From my keyboard to God's inbox. Amen.",
                "author": "Wexit-Delecto"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump calls for ‘peace on Earth’ at glittering Mar-a-Lago New Year’s Eve bash",
        "score": 416,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If he would fire Bondi and Kash and just hire two random Patriots off the site we'd all be better off in about 6 weeks...",
                "author": "cjcivicx"
            },
            {
                "raw_content": "Peace on earth isn't possible until Jesus brings it. Until then, fight evil.",
                "author": "Bubbahax"
            },
            {
                "raw_content": "Buckle up. It's going to get so much worse before it gets better.",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Notice what you HAVE NOT seen? PARENTS saying “I take my family to this daycare all the time”",
        "score": 871,
        "text_content": "",
        "comments": [
            {
                "raw_content": "and who the fuck takes their kids to daycare at 3 in the afternoon? These low IQ retards couldn't come up with a believable story if their lives depended on it.",
                "author": "PeaceMakerDJT"
            },
            {
                "raw_content": "Someone BIPOC needs to go. Otherwise its always \"im afraid of whitey\" bullshit.",
                "author": "here2red"
            },
            {
                "raw_content": "Any of the daycare stuff can be checked with google traffic trending for the location They should have busy times in the morning and afternoon. I imagine none of them do.",
                "author": "PapaPepe"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Donald Trump on New Year’s Eve in 1999 was asked if he was going to run for president",
        "score": 447,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Still a massive fan in 2026 but hes gotta go biblical",
                "author": "America_No_1"
            },
            {
                "raw_content": "26 years ago, who would’ve thought that it was even possible?",
                "author": "Trump454748"
            },
            {
                "raw_content": "Because of this man (and Jesus), we truly know how out of control the world is. I knew long beforehand, but no matter which side you're on, this man single-handedly enabled billions of people to show their true colors. Now let's keep fighting the good fight, 'pedes, be the light you want to see in the world and don't ever stop.",
                "author": "ERIC_CIARAMELLA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "$9,000,000,000 is a pretty hefty price to pay for silly memes. Just sayin'.",
        "score": 817,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Walz for prison 2025-forever",
                "author": "guywholikesDjtof2024"
            },
            {
                "raw_content": "Somali's put the \"n\" in learing.",
                "author": "SkullLeader117"
            },
            {
                "raw_content": "We've paid more and gotten less 🤷‍♂️",
                "author": "Zskills"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Intel’s $400 Million Machine: The Last Stand for Moore’s Law",
        "score": 64,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Go figure, just watched a Veritaserum (sp?) video on ASML and this very machine a little while ago. Even with them dumbing it down chip-making still sounds like magic to me.",
                "author": "blackbalt89"
            },
            {
                "raw_content": "Awesome video! Did a good job explaining what went wrong and where Intel is headed. The idea of the US getting way more fab market share would be great and I really hope the gamble pays off.",
                "author": "atzero"
            },
            {
                "raw_content": "The reality is that even if 14A somehow manages to have an advantage in theory there won't be enough production capacity to really move the needle much. Also, reports are TSMC is already mass producing N2 moving A16 forward due to good results so it's not like they're just standing around waiting.",
                "author": "Previous_Evening5661"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "PCIe card housing AMD chipset unlocks more connectivity on any motherboard, including Intel models — or you can give any B650 motherboard the top-tier connectivity of X670",
        "score": 343,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> According to the author, you can replicate the AMD B650 Southbridge Expansion Card for approximately 300 yuan (about $42.88). Although the expansion card is not commercially available, OSHWHub has integrated manufacturing services through its sister company, JLCPCB. It allows you to order custom hardware directly using the design files shared on OSHWHub, and JLCPCB will manufacture it. The important bit, for anyone who'd want to buy one.",
                "author": "forgottenendeavours"
            },
            {
                "raw_content": "[The guy also made a video talking about it on bilibili, only in Chinese, but some screenshots might be interesting.](https://b23.tv/BV1AXv4BvE4T)",
                "author": "antifocus"
            },
            {
                "raw_content": "Gotta love chinese folks and their freinkenstein stuff. From old HEDT platforms with hacked up consumer chipsets and cheap motherboards as a result (X99/2011-3 being the most famous one) to laptop cpus hacked together to fit into a desktop motherboard and now this. Maybe next they can start producing cheaper DDR5 sticks from harvested dram ics. That's be cool.",
                "author": "hojnikb"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Veritasium] Video on EUV lithography and ASML",
        "score": 134,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Love Veritasium addition on the history of the engineering behind this after the technical-focus video from Branch Education. Also highlight the crazy of Zeiss’ role in the machine too.",
                "author": "bazhvn"
            },
            {
                "raw_content": "The history behind the machines was pretty interesting. Nice footage as well and some short interviews.",
                "author": "kuddlesworth9419"
            },
            {
                "raw_content": "\"If I had 350 Million dollars I could buy it?\" \"Yes\" Well, only if the USA allows it...",
                "author": "surf_greatriver_v4"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "ASUS officially announces price hikes from January 5, right before CES 2026",
        "score": 186,
        "text_content": "",
        "comments": [
            {
                "raw_content": "AI data center were not affecting DRAM price much for years until that OpenAI taking up massive contract. 40% of global supply, do they even have the energy to use all of them? Do they even have motherboard to plug all of them right now? or they are just buying it at low price and putting it in warehouse? \\*note locking-in a contract and paying a huge premium back in Aug/Sept is still cheaper than consumer price now. So many industries billions of profit are negatively affected by OpenAI. This is insane.",
                "author": "hackenclaw"
            },
            {
                "raw_content": "I noticed this on newegg 2 days ago, saved a 5070 ti in cart for next week when my paycheck came in after all my expenses/Christmas gift stuff recovered a bit and a $750 5070ti is now $809",
                "author": "Seastorm14"
            },
            {
                "raw_content": "Dang. This makes me upset the 5070ti Prime sold out on me last night at Best Buy.",
                "author": "brightspaghetti"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Where are LTPO screens for laptops (and external monitors)?",
        "score": 53,
        "text_content": "for context, [LTPO (low temperature polycrystalline oxide) is a type of OLED screen, that can change its refresh rate from its maximum all the way down to 1Hz](https://web.archive.org/web/20180830093659/https://ihsmarkit.com/research-analysis/apple-may-introduce-ltpo-tft-backplanes-for-iphones-to-prolong.html), and it has been a mainstay in phones since the Samsung Galaxy Note20 Ultra made it mainstream in 2020. --- # But why haven't there been a single laptop that has an LTPO screen? --- If anything, laptops (and monitors) displays tend to have way more than 120Hz refresh rate, and they absolutely use more power than phone displays so they'd appreciate the true variable refresh rate (down to 1 Hz!) even more than phones to conserve power, and as a side-effect also help deal with screen tearing in games [And the latest LTPO screens can even adjust the refresh rate of specific parts of the screen](https://www.androidauthority.com/oneplus-13-screen-local-refresh-rate-3490589/), so on a PC static components like the taskbar can permanently stay at 1Hz while the rest of the screen moves along",
        "comments": [
            {
                "raw_content": "because ltpo needs finer manufacturing which makes it really expensive to use laptops(laptops need wider display). Some news leaked that apple will use oled display on the new version of macbook in 2026, so you'll find it soon.",
                "author": "Original-Peach-6590"
            },
            {
                "raw_content": "> If anything, laptops (and monitors) displays tend to have way more than 120Hz refresh rate You live in a total bubble. If you exclude macbooks (i don't know about those) (edit it seems the non-pro models are also only 60Hz) , 95% of laptops are 60Hz. And i doubt even 1% of screen solds are \"way more than 120Hz refresh rate\".",
                "author": "1731799517"
            },
            {
                "raw_content": "ltpo != true vrr All phones currently switch between a few fixed refresh rate modes very fast. they can't space frames by arbitrary amounts (within a limit) like monitors and TVs You can see what refresh rate modes ios support for e.g. here: https://developer.apple.com/documentation/quartzcore/optimizing-iphone-and-ipad-apps-to-support-promotion-displays",
                "author": "MMyRRedditAAccount"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Inside Nvidia GB10’s Memory Subsystem, from the CPU Side",
        "score": 35,
        "text_content": "",
        "comments": [
            {
                "raw_content": "While chips and cheese did not test performance of this product in this article, other people such as [David Huang](https://blog.hjc.im/spec-cpu-2017) have, using specint2017. The X925 in the 16MB L3 cluster scored \\~13% higher than a Zen 5 core in Strix Halo, while the one in the 8MB L3 cluster only scores \\~5% higher. While David Huang was not able to get his Xiaomi Xring O1's X925 to hit its rated 3.9GHz in his testing due to thermal constraints (3.4GHz was hit), there's a nearly 25% difference between the scores in those 2 CPUs. Looking at a PPC difference, you get the GB10 scoring \\~7% higher (16MB cluster), but realistically the difference iso clock would be higher due to PPC usually decreasing the higher you clock.",
                "author": "Geddagod"
            },
            {
                "raw_content": "> CPU cores on GB10 are split into two clusters. Each cluster has five A725 cores and five X925 cores. Core numbering starts with the A725 cores within each cluster, and the two clusters come after each other. All of the A725 cores run at 2.8 GHz. X925 cores clock up to 3.9 GHz on the first cluster, and up to 4 GHz on the second. Strange. Who thought this was a good idea?",
                "author": "Forsaken_Arm5698"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Exclusive: Lenovo has Snapdragon X2 Elite (X2-E88-100) and X2 Plus PCs up its sleeve for CES 2026",
        "score": 40,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Has anyone actually bought these devices so far? I have never even considered them due to my lack of information, perceived High price and concerns about software support",
                "author": "ps5cfw"
            },
            {
                "raw_content": "Lackluster Linux support stops me from getting something like this and intels chips look fairly OK from a battery perspective I'm going to upgrade in 2026 but honestly I may just go m2 mac and asahi linux",
                "author": "Unusual_Pride_6480"
            },
            {
                "raw_content": "Great. I guess there will be a good flood with this devices. Wonder what price range the X2 Elite Extreme will be.",
                "author": "RealisticMost"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Europe drives to dominate photonics",
        "score": 56,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It makes sense they're going this way since all you need for photonics are older, mature nodes, and Europe has plenty of mature node fabs. It'd be cool to see a breakthrough in integrated optical circuits and memory coming from there.",
                "author": "Fun_Secretary8842"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Monster Hunter Wilds on Switch 2 is really happening.",
        "score": 140,
        "text_content": "Chinese dataminers found the Nintendo Switch 2 menu/UI for Monster Hunter Wilds.",
        "comments": [
            {
                "raw_content": "I understand people want a new Monster Hunter built from the ground up for the Switch 2. But, porting Wilds is cheaper and it makes more sense at the moment. Monster Hunter Wilds has lost momentum and Capcom is trying to get Switch 2 owners to help it because Monster Hunter Rise did extremely well on the Switch 1 and Monster Hunter is massive in Japan which seems like a match made in heaven with the Switch 2.",
                "author": "Theman457"
            },
            {
                "raw_content": "Doesn’t this just barely run good on decent PCs? Or is it better now?",
                "author": "Cuti3Slay3rUwU"
            },
            {
                "raw_content": "https://preview.redd.it/cxcyq504qoag1.png?width=72&format=png&auto=webp&s=59b655a1225999c56a822850ee886fcb76249cd4",
                "author": "StockHumor4768"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Brought my Switch 2 on my plane trip! :D",
        "score": 87,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If only the switch had more battery life.",
                "author": "kr4ckhe4d"
            },
            {
                "raw_content": "Bringing my Switch 2 when I go to Japan next June, will help with the 14hr flight.",
                "author": "GeekyPanda404"
            },
            {
                "raw_content": "Incredible! Using a portable system like it was intended.",
                "author": "HellP1g"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The Switch 2 sold over 300K units in Spain, 3 months faster than the original Switch.",
        "score": 247,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It took 10 months for the OG switch to reach 300K units, Switch 2 reached 312K units in 7 months. Mario Kart World has a 81.7% attach rate, with 255K units sold. Bananza has 61K. This is a very similar performance from yesterday's UK milestones, where the Switch 2 surpassed 700K units sold roughly 3 months faster than the OG Switch.",
                "author": "maronic03"
            },
            {
                "raw_content": "I wonder how the grifters are going to pose this as a negative.",
                "author": "An1nterestingName"
            },
            {
                "raw_content": "Yet people will continue to insist Switch 2 sales are \"soft\" while it outsells Switch 1 and Wii",
                "author": "ConstantAd1"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo Today animation for today. Happy New Year y'all!",
        "score": 41,
        "text_content": "Hope 2026 will be a good year",
        "comments": [
            {
                "raw_content": "I know not all of you are in 2026, but I still wish you a happy new year btw",
                "author": "Awesome_R011"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "These visuals are impressive (ignore Juan, he likes to float sometimes)",
        "score": 206,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Obligatory: What game?",
                "author": "PipFizzlebang"
            },
            {
                "raw_content": "Game looks beautiful on the switch 2. Plus a floating horse is a feature not a glitch. Haven't you played Skyrim.",
                "author": "Chrono-Syth"
            },
            {
                "raw_content": "Ubisoft did a good job this time too.",
                "author": "Tealcjaffaoriginal"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Switch Games Releasing January 2026",
        "score": 75,
        "text_content": "Link if you want it: https://docs.google.com/spreadsheets/d/1EbGHsJjxt4VrpD8_0jPZn2JMB7WNz945S1hFgfXWddg/edit?usp=drivesdk",
        "comments": [
            {
                "raw_content": "Don't know what happened to borderlands 4 to",
                "author": "gokhujee"
            },
            {
                "raw_content": "Man I’m so hyped for Lego Batman. I hope it comes out early 2026",
                "author": "idontplaypolo"
            },
            {
                "raw_content": "Looking forward to MIO",
                "author": "SyenceLabb"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Pro Controller 2 battery level always showing full",
        "score": 7,
        "text_content": "New to the Switch 2. Noticed right away that the battery level for the pro controller 2 is always showing 100%. The only beginning of a fix I see online basically is to boot into recovery and reboot after. Didn't work but I haven't did it multiple times yet. The other, which I am about to test, is to completely charge everything, drain them completely and repeat the process multiple times. Is there any other known way to fix this situation?",
        "comments": [
            {
                "raw_content": "I just got a pro controller a few days ago and noticed that, I was just thinking that it maybe had REALLY good battery life :(",
                "author": "timeflylikearrow"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Gamestop Pro Members Get $20 Off Metroid Prime 4 or Legends ZA",
        "score": 46,
        "text_content": "GameStop Pro members get $20 off in-store if you buy Metroid Prime 4 or Legends ZA. This is the largest discount offered on these 2 games.",
        "comments": [
            {
                "raw_content": "It is a targeted coupon so it doesn't show up for every member",
                "author": "swordmaster13"
            },
            {
                "raw_content": "Similar deal, Costco sells $100 e shop gift cards for $80, then buy the 2 game vouchers and upgrade both to Switch 2 edition. Came out to $50 each.",
                "author": "alritewall"
            },
            {
                "raw_content": "All I see is a coupon for mindseye. I don’t want that.",
                "author": "nick_martin"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Persona 5 Fitness Boxing teased",
        "score": 158,
        "text_content": "https://www.gematsu.com/2025/12/fitness-boxing-persona-5-announcement-teased",
        "comments": [
            {
                "raw_content": "![gif](giphy|s239QJIh56sRW|downsized)",
                "author": "LollipopChainsawZz"
            },
            {
                "raw_content": "Everything but 6, lol",
                "author": "RaisinBran21"
            },
            {
                "raw_content": "Damn, a Persona fan's worst nightmare, fitness.",
                "author": "OwnAHole"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Newsis: Nvidia and AMD to significantly increase GPU prices starting next month. Describes RTX 5090 increasing from $2000 to $5000",
        "score": 2330,
        "text_content": "Key Quotes \"According to industry sources on the 30th, AMD is expected to raise the prices of some GPUs starting in January next year, and Nvidia starting in February next year.\" \"... RTX 5090, was released at the beginning of this year at $1,999 (KRW 2.86 million), but it is expected to soar to $5,000 (KRW 7.15 million) next year.\" \"Both companies are reportedly planning to continue raising GPU prices every month going forward. It's highly likely that the price increases will extend across their entire product lineup, encompassing not only consumer GPUs but also GPUs for AI data centers and servers.\" \"An industry insider explained, \"The average proportion of memory in the overall GPU manufacturing cost has recently exceeded 80%.\" Source: https://mobile.newsis.com/view/NISX20251229_0003458273#_endPass",
        "comments": [
            {
                "raw_content": "Why even bother putting them in stores at that point.",
                "author": "ImJustHereToSearch"
            },
            {
                "raw_content": "$2000 to $5000 are they fking crazy ?",
                "author": "siberif735"
            },
            {
                "raw_content": "I wonder if this is a strategic leak. The idea is that you anchor people to an obscene price so that the actual new price doesn’t seem so bad. “Rumors said this card would be $5000, but it has only gone up to $3499. What a deal!”",
                "author": "heyyoudvd2"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Bloober Team is teasing a mystery project with a new site \"Remosd Neul Serorehso Ovam Ceyerd\", countdown ends February 15th",
        "score": 64,
        "text_content": "Bloober Team has launched a new teaser website named \"RemoSdNeulSerorehsoOvamCeyerd\", possibly a anagram or cipher ARG? \"Dare to peek into the darkness...\" source: https://xcancel.com/BlooberTeam/status/2006515753176953244 https://www.gematsu.com/2025/12/bloober-team-launches-remosd-neul-serorehso-ovam-ceyerd-countdown-website",
        "comments": [
            {
                "raw_content": "Maybe soemthing for Cronos? I doubt Nintendo would let them tease soemthing like this if theyre publishing the Switch 2 game",
                "author": "notewise"
            },
            {
                "raw_content": "The thin letters are Cronos",
                "author": "Richoniano"
            },
            {
                "raw_content": "This is Project M, the Switch 2 exclusive",
                "author": "Sea-Country8245"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Chinese Dataminers for Monster Hunter found the menu for local multiplayer mode for the Switch 2 version",
        "score": 147,
        "text_content": "https://famiboards.com/threads/data-miners-finds-info-regarding-a-possible-mh-wilds-ns2-port-seems-to-also-have-local-multiplayer-included.16117/page-3#post-2118187 This isn't just some text fire, but an actual UI and menu that was found viva datamining the PC version. Safe to say, this port is likely happening. EDIT to include the images [Image 1](https://i.ibb.co/0ppb0900/c2f121381f30e9243cc42d2b0a086e061c95f746.jpg) [Image 2](https://i.ibb.co/jF6JvHS/b7f705f3d7ca7bcba1707635f8096b63f724a89f.jpg)",
        "comments": [
            {
                "raw_content": "If Capcom actually pulls an impressive port of this game on a device that uses 19watts it might be a development miracle",
                "author": "Loose_Society9485"
            },
            {
                "raw_content": "Monster Hunter Wild on the Switch 2 would be such a hit in Japan and even a system seller. Leaving Nintendo having Monster Hunter 4 as exclusivity on the 3DS was one of the worst error from Playstation.",
                "author": "Tryst_boysx"
            },
            {
                "raw_content": "Wish they ported World first",
                "author": "RunawayGuineaPig66"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "More Datamined Info Regarding the Switch 2 Version of Monster Hunter Wilds",
        "score": 24,
        "text_content": "So, there is a Chinese group specializing in datamining Monster Hunter Wilds data. You have likely already seen the Switch 2 local multiplayer popup window; I did some more digging and found additional information. ​First, look at [Image 1,](https://ibb.co/GvCZSThk) which is the source of the image that went viral today. The original poster added: \"The datamining group even pulled up the graphics presets for the Switch 2—it runs at 30 FPS in DLSS mode.\" ​Next is [Image 2](https://ibb.co/8npDCgzn), which shows datamined text strings. Searching for \"Switch\" yielded the following text: ​\"Bring Nintendo Switch 2 consoles together to create or join a lobby using local wireless communication.\" ​\"Search for lobbies using local wireless communication. Bring Nintendo Switch 2 consoles together to allow up to four players to participate.\" Furthermore, they discovered 'Tempered Gogmazios' in the text strings, suggesting that this monster might be included in the upcoming high-difficulty quest updates. ​Finally, [Image 3](https://ibb.co/F4tyfLRT) shows the Switch 2 presets they loaded on a PC (note: this does not represent the final performance). They stated: \"The shadow quality preset for the Switch 2's docked 'Graphics Mode' is higher than the PC's 'Very Low' preset. In docked mode, 'Graphics Mode' outputs at 1080p.\" They ran the game on a PC using these specific settings and took a screenshot.",
        "comments": [
            {
                "raw_content": "Hopefully soon we know the resolution targets on handheld mode",
                "author": "OwnSimple4788"
            },
            {
                "raw_content": "I find it hard to believe wilds will run well on switch 2 if real online hub is 100 players I'd expect it to blow up or something",
                "author": "zakare232"
            },
            {
                "raw_content": ">Tempered Gogmazios There’s not enough stars in the game for that!",
                "author": "cid_highwind02"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "ESRB rates unannounced Konami game Enchanted Wonderland for Switch",
        "score": 154,
        "text_content": "https://www.gematsu.com/2025/12/esrb-rates-unannounced-konami-game-enchanted-wonderland-for-switch",
        "comments": [
            {
                "raw_content": "Castlevania any day now… any….. day….. nowwwww",
                "author": "GoldenTriforceLink"
            },
            {
                "raw_content": "Balan bros we're so back",
                "author": "Khan_Harrison"
            },
            {
                "raw_content": "probably unrelated, but the title has me thinking of a game Konami published for the DS called Magician's Quest: Mysterious Times, which was localized in Europe as Enchanted Folk and the School of Wizardy. iirc it was kinda an Animal Crossing/Fantasy Life-like, which definitely seems like there's more of a market for these days than there's ever been",
                "author": "blackthorn_orion"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Splatoon 3 rated for Switch 2 in Europe",
        "score": 194,
        "text_content": "This one I find odd As Splatoon 3 already got a Switch 2 Upgrade earlier in the year with 60 FPS when they announced splatoon Raiders, and it seems like they rated it on the 31st of December too, not in july. Were they just Delayed in rating it? Source: https://gematsu.com/2025/12/splatoon-3-rated-for-switch-2-in-europe",
        "comments": [
            {
                "raw_content": "I presume this Is a rerelease with the DLC included on cart",
                "author": "GiulianoGame19"
            },
            {
                "raw_content": "iirc every Nintendo game that got a free update got a Switch 2 rating this happening on the 31st feels like it's probably just some kind of clerical error related to the one Splat 3 got back in June where it ended up defaulting to the last day of the year",
                "author": "blackthorn_orion"
            },
            {
                "raw_content": "Maybe a physical S2 cart release is planned?",
                "author": "OrangeGlub"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Story Of Seasons Grand Bazaar Rated For PS5 & Xbox Series X/S In Taiwan",
        "score": 121,
        "text_content": "Story of Seasons: Grand Bazaar first launched for Switch 2, Switch, and PC via Steam on August 27 Source: https://www.gematsu.com/2025/12/story-of-seasons-grand-bazaar-rated-for-ps5-xbox-series-in-taiwan#",
        "comments": [
            {
                "raw_content": "I really need to get back into it. Was really enjoying what I played of it but kind of got diverted from it and not really made the time to return to it.",
                "author": "Lizuka"
            },
            {
                "raw_content": "Game's genuinely really great so yeah having it on more platforms would be great",
                "author": "J_Linebeck"
            },
            {
                "raw_content": "Here's hoping it's play anywhere on Xbox.",
                "author": "Soopy"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Internet Cafe owner reports 15 dead Ryzen 7 9800X3D CPUs out of 150",
        "score": 186,
        "text_content": "",
        "comments": [
            {
                "raw_content": "An article about a reddit post. Posted on reddit. Infinite recursion! https://www.reddit.com/r/ASUS/s/r7r4H74Ulu",
                "author": "djtodd242"
            },
            {
                "raw_content": "I love reading suspicious posts from a brand new account, with no proof and then reading the same post, linked from a website onto a different post to make it seem more legit.",
                "author": "Embarrassed_Adagio28"
            },
            {
                "raw_content": "What the heck is a huntkey PSU? Don't cheap out on the PSU LOL.",
                "author": "IGunClover"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "ASRock Taichi Radeon RX 9070 XT White with built-in LCD will launch at CES 2026",
        "score": 30,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Won't be long before the fan blades are LCD screens themselves.",
                "author": "fc_dean"
            },
            {
                "raw_content": "Another brick in the bin... This shitty fired power connector... Who want to have his gpu burned with this power connector? Never me. Only eight-pci-e-connectors for me.",
                "author": "Ok-Responsibility480"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Colorful claims Ryzen 7 9800X3D OC world record with 7335 MHz clock",
        "score": 27,
        "text_content": "",
        "comments": [
            {
                "raw_content": "*croaks* back in my day you couldn’t even overclock x3d chips!",
                "author": "Jad-Doggy"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "ACEMAGIC teases NES-inspired Retro X5 Mini-PC with Ryzen AI 9 HX 370 APU",
        "score": 10,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nintendo's lawyers are in position",
                "author": "themirrorcle"
            },
            {
                "raw_content": "So cute",
                "author": "GladMathematician9"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Chilling omen of house price crash as America's No 2 homebuilder forced to slash prices by 10%",
        "score": 198,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Happy new years!!!",
                "author": "Significant-Pen-6049"
            },
            {
                "raw_content": "> the typical American homeowner would see their biggest asset drop by in value by $36,000. Which would be the best thing that has ever happened to them because their property taxes, maintenance costs, and insurance costs are all aligned with home prices. Home values outpaced wage growth and it is the MAIN reason that the economy feels shit. So sad that people dont get it. Moron, when your house doubled in value, you became POORER.",
                "author": "ktaktb"
            },
            {
                "raw_content": "So are we going to ignore this was after their average transaction price doubled...*since last year* Their whole portfolio got out of line with the market not really indicative of general trends since everything else has been roughly flat.",
                "author": "Extension-Abroad187"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "U.S. Population Grows at Highest Rate Since 2001",
        "score": 143,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This was 2024 and the primary driver was immigration, which we all know is way way down in 2025 and will likely be even lower in the years to come",
                "author": "bribrah"
            },
            {
                "raw_content": "Hmmm. Maybe I should move to Vermont.",
                "author": "whiskeyandtea"
            },
            {
                "raw_content": "Misleading, that was 2024. At least put that in the post title. \"The US Population Could Shrink in 2025, For the First Time Ever\" https://www.derekthompson.org/p/the-us-population-could-shrink-in",
                "author": "WufBro"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage Rates at 2025 Low Give Homebuyers Momentum in New Year",
        "score": 3,
        "text_content": "",
        "comments": [
            {
                "raw_content": "non-paywall: https://archive.ph/6NMkx Mortgage rates have reached their lowest point for the year, potentially injecting fresh momentum into a US homebuying market that spent much of 2025 in the doldrums. The average for 30-year, fixed loans dropped to 6.15% this week, data from Freddie Mac showed Wednesday. That’s down from around 7% in January and “an encouraging sign for potential homebuyers heading into the new year,” said Sam Khater, Freddie Mac’s chief economist. Many industry watchers are upbeat. In general, homes are expected to get cheaper in real terms: Wage growth is poised to far outpace gains in prices. That would put purchases in closer reach of more Americans, even if mortgage rates don’t come down much further. Determined buyers may not need much more encouragement to act on pent-up demand. A measure of contracts to buy resale homes has climbed for four straight months and in November reached its highest point since early 2023, the National Association of Realtors reported this week. That has helped the market “to pick up steam through what is traditionally the slowest part of the year,” said Joel Berner, senior economist for Realtor.com. “If this momentum continues into the peak buying season of 2026, we could see much stronger sales figures than we saw for much of 2025.” There’s little argument that affordability kept many prospective buyers on the sidelines this year. And housing remains too expensive for many people. While prices have long since cooled from the pandemic-era frenzy, they are still rising, especially in places where listings remain in short supply. Many would-be sellers have been holding out as well, as still-elevated rates offer them little incentive to give up the cheap loans they landed a few years ago and move. In recent months, some have pulled their listings to wait for a more opportune time. If the market does turn around next year, it will be off a very low base. Completed purchases of previously owned homes have approached 30-year lows in 2023, 2024 and 2025. Even with a 6.3% increase in 2026, the median of the predictions collected by Bloomberg earlier this month, sales would still have a long way to go before they reach pre-pandemic levels. The most optimistic projections are based on the labor market holding up — always a wild card. A wave of layoffs sparked by artificial intelligence, for example, would especially hit younger workers and undermine the housing recovery, according to Mark Zandi, chief economist at Moody’s Analytics. As for mortgage rates, little movement is expected for the foreseeable future. And the Federal Reserve, which cut its benchmark rate three times in 2025, has hinted at just one or two cuts for 2026.",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Singularity Predictions 2026",
        "score": 95,
        "text_content": "# Welcome to the 10th annual Singularity Predictions at [r/Singularity](https://www.reddit.com/r/Singularity/). In this yearly thread, we have reflected for a decade now on our previously held estimates for AGI, ASI, and the Singularity, and updated them with new predictions for the year to come. \"As we step out of 2025 and into 2026, it’s worth pausing to notice how the conversation itself has changed. A few years ago, we argued about whether generative AI was “real” progress or just clever mimicry. This year, the debate shifted toward something more grounded: not*can it speak*, but *can it do*—plan, iterate, use tools, coordinate across tasks, and deliver outcomes that actually hold up outside a demo. In 2025, the standout theme was **integration**. AI models didn’t just get better in isolation; they got woven into workflows—research, coding, design, customer support, education, and operations. “Copilots” matured from novelty helpers into systems that can draft, analyze, refactor, test, and sometimes even execute. That practical shift matters, because real-world impact comes less from raw capability and more from how cheaply and reliably capability can be applied. We also saw the continued convergence of modalities: text, images, audio, video, and structured data blending into more fluid interfaces. The result is that AI feels less like a chatbot and more like a layer—something that sits between intention and execution. But this brought a familiar tension: capability is accelerating, while reliability remains uneven. The best systems feel startlingly competent; the average experience still includes brittle failures, confident errors, and the occasional “agent” that wanders off into the weeds. Outside the screen, the physical world kept inching toward autonomy. Robotics and self-driving didn’t suddenly “solve themselves,” but the trajectory is clear: more pilots, more deployments, more iteration loops, more public scrutiny. The arc looks less like a single breakthrough and more like relentless engineering—safety cases, regulation, incremental expansions, and the slow process of earning trust. Creativity continued to blur in 2025, too. We’re past the stage where AI-generated media is surprising; now the question is what it does to culture when *most* content can be generated cheaply, quickly, and convincingly. The line between human craft and machine-assisted production grows more porous each year—and with it comes the harder question: what do we value when abundance is no longer scarce? And then there’s governance. 2025 made it obvious that the constraints around AI won’t come only from what’s technically possible, but from what’s socially tolerated. Regulation, corporate policy, audits, watermarking debates, safety standards, and public backlash are becoming part of the innovation cycle. The Singularity conversation can’t just be about “what’s next,” but also “what’s allowed,” “what’s safe,” and “who benefits.” So, for 2026: do agents become genuinely dependable coworkers, or do they remain powerful-but-temperamental tools? Do we get meaningful leaps in reasoning and long-horizon planning, or mostly better packaging and broader deployment? Does open access keep pace with frontier development, or does capability concentrate further behind closed doors? And what is the first domain where society collectively says, “Okay—this changes the rules”? As always, make bold predictions, but define your terms. Point to evidence. Share what would change your mind. Because the Singularity isn’t just a future shock waiting for us—it’s a set of choices, incentives, and tradeoffs unfolding in real time.\" - ChatGPT 5.2 Thinking [Defined AGI levels 0 through 5, via LifeArchitect](https://preview.redd.it/m16j0p02ekag1.png?width=1920&format=png&auto=webp&s=795ef2efd72e48aecfcc9563c311bc538d12d557) \\-- It’s that time of year again to make our predictions for all to see… If you participated in the previous threads, update your views here on which year we'll develop **1) Proto-AGI/AGI, 2) ASI, and 3) ultimately, when the Singularity will take place. Use the various levels of AGI if you want to fine-tune your prediction.** Explain your reasons! Bonus points to those who do some research and dig into their reasoning. If you’re new here, welcome! Feel free to join in on the speculation. **Happy New Year and Buckle Up for 2026!** Previous threads: [2025](https://www.reddit.com/r/singularity/comments/1hqiwxc/singularity_predictions_2025/), [2024](https://www.reddit.com/r/singularity/comments/18vawje/singularity_predictions_2024/), [2023](https://www.reddit.com/r/singularity/comments/zzy3rs/singularity_predictions_2023/), [2022](https://www.reddit.com/r/singularity/comments/rsyikh/singularity_predictions_2022/), [2021](https://www.reddit.com/r/singularity/comments/ko09f4/singularity_predictions_2021/), [2020](https://www.reddit.com/r/singularity/comments/e8cwij/singularity_predictions_2020/), [2019](https://www.reddit.com/r/singularity/comments/a4x2z8/singularity_predictions_2019/), [2018](https://www.reddit.com/r/singularity/comments/7jvyym/singularity_predictions_2018/), [2017](https://www.reddit.com/r/singularity/comments/5pofxr/singularity_predictions_2017/) Mid-Year Predictions: [2025](https://www.reddit.com/r/singularity/comments/1lo6fyp/singularity_predictions_mid2025/)",
        "comments": [
            {
                "raw_content": "[<2024>](https://www.reddit.com/r/singularity/comments/18vawje/comment/kfq44cf/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) [<2025>](https://www.reddit.com/r/singularity/comments/1hqiwxc/comment/m4px3np/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) # TL;DR **2026:** Takeoff begins. AI starts contributing to its own research. Native multimodality matures, humanoid robots enter workforce (warehouses, early adopters). Expect GPT-5.5+, Gemini 3.5/4, Claude 5, etc. Key milestones: FrontierMath T4 60%, AGIDefinition 65%, half work day task horizons. **2027:** AI becomes national security priority; US-China race heats up across energy, chips, and research. Internally, automated coders emerge and automated research labs scale massively (1e28 FLOP training runs on 1+ GW data centers). OpenAI IPO \\~$2T. Bubble maybe pops but governments bail out to stay competitive. Public models hit AGIDefinition 85%, Remote Labor Index 50%, \\~1 work month task horizons. **Bottom line:** Recursive self-improvement accelerates behind closed doors while the public sees steady capability gains and the geopolitical stakes explode. You can also see some of my specific parameters with my [custom AI Futures Model](https://www.aifuturesmodel.com/?pdt=0.34078932091300607&acth=4.047519940820753&arts=1.5559656316050743&mttm=8.517580687364823) for more detail. Here's a visual for your convenience: https://preview.redd.it/4nhvwakmmkag1.png?width=2400&format=png&auto=webp&s=c830e25a323e2c8ed0a295633c4503bfc0a3a33a # Words from me >My third year of making predictions! I've gone a long way since my first predictions which look sloppy in retrospect. I've gotten a much clearer and in-depth understanding since then, with this work being influenced by that of Aschenbrenner's [Situational Awareness](https://situational-awareness.ai/) and Kokotajlo et al.'s [AI 2027](https://ai-2027.com/) minus some of the doomerism. I am no expert forecaster by any means and you shouldn't be relying on my specific predictions, but you can almost certainly rely on some of the sources I will attempt to cite (EpochAI my love) and the general direction of the narrative I will present. This is my personal spin on the upcoming events: it's a mix of grounded analysis and optimistic idealism, with emphasis on the latter. Just to quickly comment on my 2025 prediction, I believe that most of my broad commentary and intuition were right. Unfortunately, I found that I gave much more optimistic technical predictions that were mostly delayed and never came this year. But I think my biggest hit of that year is the IMO prediction, but given AlphaProof already having attained silver the previous year my prediction may be rightly seen as low-hanging fruit. I've also pushed back my AGI prediction and dropped DeepMind's definition given the tremendous difficulty to evaluate those exact standards. Over the course of the year, I've moved away from the nebulous *AGI* term towards more precise terms like Automated coders, Superhuman AI researchers etc. as defined in the AI futures model. However, I still retain a prediction on my flair that is subject to arbitrary definitions and proxies for measurement; My current definition for AGI places its public release by 2028, even if it won't be acknowledged as such. In short, I anchor more on the predicted timelines for AC than I do for AGI. I've split my prediction into the next two years which is further split into two parts each in this thread (blame Reddit comment limits). Should you wish to discuss further, I'd be happy to engage with whatever praise or pushback I'll be getting.",
                "author": "krplatz"
            },
            {
                "raw_content": "2026 will have 1-3 conceptual (algorithmic, not hardware/scale) breakthroughs that lead to: * True continuous learning / real long-term memory * Drastic reduction in hallucinations, over-confidence, and instruction-failing * Continued cost-per-token reductions And these things in turn will lead to or enable: * AI progress and utility being undeniable to even today's hardened skeptics, doubters, and haters * A global \"oh shit\" moment as people realize the millions of jobs that rely on cognitive labor being scarce are done for * Finally real uses for AI that justifies its massive cost -- genuine advancements in science and engineering",
                "author": "RipleyVanDalen"
            },
            {
                "raw_content": "**My 2026 prediction:** We still do not hit AGI, but we cross a clear threshold where agents become economically autonomous. Not smart in a philosophical sense, but good enough that companies stop asking “can AI do this?” and start asking “why is a human still doing this?” The bottleneck is no longer reasoning. It is memory, persistence and failure recovery. Until agents can fail, retry and self-correct across days without supervision, AGI timelines stay slippery. **2026 feels like the year coordination beats intelligence**",
                "author": "BuildwithVignesh"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Tesla FSD Achieves First Fully Autonomous U.S. Coast-to-Coast Drive",
        "score": 414,
        "text_content": "Tesla FSD 14.2 has successfully driven from Los Angeles to Myrtle Beach (2,732.4 miles) **fully autonomously**, with **zero disengagements**, including all Supercharger parking—a major milestone in long-distance autonomous driving. Source: [DavidMoss](https://x.com/DavidMoss/status/2006255297212358686?s=20) on X. Proof: [His account on the Whole Mars FSD database](https://fsddb.com/profile/DavidMoss).",
        "comments": [
            {
                "raw_content": "A milestone to be sure, if verified. GG",
                "author": "Echoeversky"
            },
            {
                "raw_content": "Unfortunately you would still need to be a total fool to not watch it continuously. But it is progress.",
                "author": "Mandoman61"
            },
            {
                "raw_content": "Congratulations! That’s a lot of Gatorade bottles🤣",
                "author": "Clear-Constant-7250"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "No, AI hasn't solved a number of Erdos problems in the last couple of weeks",
        "score": 329,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You could, you know, quote the full post: [https://mathstodon.xyz/@tao/115788262274999408](https://mathstodon.xyz/@tao/115788262274999408) >In recent weeks there have been a number of examples of Erdos problems that were solved more or less autonomously by an AI tool, only to find out that the problem had already been solved years ago in the literature: [https://www.erdosproblems.com/897](https://www.erdosproblems.com/897) [https://www.erdosproblems.com/333](https://www.erdosproblems.com/333) [https://www.erdosproblems.com/481](https://www.erdosproblems.com/481) . >One possible explanation for this is contamination: that the solutions to each of these problems were somehow picked up by the training data for the AI tools and encoded within its weights. However, other AI deep research tools failed to pick up these connections, so I am skeptical that this is the full explanation for the above events. >My theory is that the AI tools are now becoming capable enough to pick off the lowest hanging fruit amongst the problems listed as open in the Erdos problem database, where by \"lowest hanging\" I mean \"amenable to simple proofs using fairly standard techniques\". However, that category is also precisely the category of nominally open problems that are most likely to have been solved in the literature, perhaps without much fanfare due to the simple nature of the arguments. This may already explain much of the strong correlation above between AI-solvability and being already proven in some obscure portion of the literature. >This correlation is likely to continue in the near term, particularly for problems attacked purely by AI tools without significant expert supervision. Nevertheless, the amount of progress in capability of these tools is non-trivial, and bodes well for the ability of such tools to automatically scan through the \"long tail\" of underexamined problems in the mathematical literature.",
                "author": "xirzon"
            },
            {
                "raw_content": "Makes me wonder how important/significant these problems are if there are existing solutions but people just forget about them. Feels like any mathematician could have solved them if they spent some time doing so - at least the ones the LLMs are solving.",
                "author": "ClearlyCylindrical"
            },
            {
                "raw_content": "Didn’t Terence Tao at least credit AI with unearthing papers about the subject that basically solved the problem and properly combining their results?",
                "author": "magicmulder"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Agents self-learn with human data efficiency (from Deepmind Director of Research)",
        "score": 32,
        "text_content": "[Tweet](https://x.com/egrefen/status/2006342120827941361?s=20) Deepmind is cooking with Genie and SIMA",
        "comments": [
            {
                "raw_content": "2026 is going to be wild",
                "author": "Sockand2"
            },
            {
                "raw_content": "This is what I like to hear.",
                "author": "BagholderForLyfe"
            },
            {
                "raw_content": "Essentially RSI, 2026 could be the year this is solved, at least an early iteration of it,",
                "author": "ZealousidealBus9271"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Welcome 2026!",
        "score": 72,
        "text_content": "I am so hyped for the new year! Of all the new years this is the most exciting one for me so far! I expect so much great things from AI to Robotics to Space Travel to longevity to Autonomous Vehicles!!!",
        "comments": [
            {
                "raw_content": "It does feel like 2026 will be a particularly good year. Cheers!",
                "author": "Completely-Real-1"
            },
            {
                "raw_content": "I've got fingers crossed, because this one hasn't been for me. I could really use a good one. Happy New Years folks.",
                "author": "TemetN"
            },
            {
                "raw_content": "Happy New Year! I am hopeful for AI progress and benefits from it in 2026!",
                "author": "RipleyVanDalen"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The Ridiculous Engineering Of The World's Most Important Machine",
        "score": 217,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It *is* ridiculous. Firing off tin pellets, tracking them with computers, firing lasers to vaporize them, and using mirrors to collect some of the soft X-rays. That's a physics experiment, not a production machine. But that's what ASML builds. For ten years, the semiconductor industry tried to find a better approach to 4nm and down. Linear accelerators. Synchrotrons. Multi-beam E-beam. They all work experimentally, but didn't scale to production. The Stanford Linear Accelerator was used as an EUV source in a test. It worked, but that thing is a mile long. There was a proposal in China to build a full-sized synchrotron, maybe half a mile around. Too expensive. There was a startup making a \"desktop synchrotron\". They went bust. Unclear why. Direct-writing with electron beams works fine; that's how masks are made. But it's too slow for IC production. There's a project in China to build a variation on the ASML concept where the tin zapping is used to make a plasma which is then used to generate soft X-rays. Might work.",
                "author": "Animats"
            },
            {
                "raw_content": "Better than a 30 second Tiktok explanation.",
                "author": "Izento"
            },
            {
                "raw_content": "It’s amazing and sad how all credit for the work to create the EUV light source is given to ASML, Netherlands even though all work was done by Cymer, USA, which was purchased by ASML in mid-20-teens. All that hitting the droplet, all inventions about EUVs mirror inside the light source — all of this critical technology was NOT created in ASML. ASML did fund (partially) Cymer’s work, as did Intel and some others. In 2015, after the energy breakthrough was achieved by Cymer, ASML purchased Cymer, the technology and all rights to it paying off all parties that funded the development. Now they say “they” developed it. Ha.",
                "author": "Error_404_403"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Which Predictions are going to age like milk?",
        "score": 23,
        "text_content": "2026 is upon us, so I decided to compile a few predictions of significant AI milestones.",
        "comments": [
            {
                "raw_content": "All sorts of stupid predictions have been made by both the common and famous people in this field. Most of them are collecting checks.",
                "author": "Exotic_Freedom_9"
            },
            {
                "raw_content": "It's just vague crap. I really don't get why people pay attention to these morons. Here is what a real prediction looks like: We will hit 60% on Tier 4 Frontier Math before EOY. (just an example, I actually don't know enough to predict this)",
                "author": "kaggleqrdl"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Poland calls for EU action against AI-generated TikTok videos calling for “Polexit”",
        "score": 93,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ban global social networks!",
                "author": "gtek_engineer66"
            },
            {
                "raw_content": "Just ban TikTok already that Chinese government owned app that working together with Russia",
                "author": "advator"
            },
            {
                "raw_content": "Just ban TikTok. Its trash service used for propaganda and brain rot. Why bother? Maybe people will do something productive with ther lives other than „influencing”.",
                "author": "mintaka"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "It is easy to forget how the general public views LLMs sometimes..",
        "score": 434,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Redditors are not the general public, especially those who are first to comment on tech subreddits. They have an axe to grind and are being deliberately irrational. If you show a normie the capabilities of GPT 5 they will have an honest reaction and be blown away.",
                "author": "Maleficent_Care_7044"
            },
            {
                "raw_content": "i’d say it’s actually a loud minority. chatgpt and LLMs generally are the fastest adopted technology of all time. chatgpt is sitting at around 900m active users, around 1/8th of humanity in a couple of years a lot of people are just quietly getting on with it and using AI on a daily basis without taking sides. it’s just a useful technology that is also why the naysayers will eventually lose. not because of being actively converted or argued into submission by pro AI people. but because the vast majority out there just doesn’t care and are happy to adopt whatever comes their way as long as it’s cool and/or useful",
                "author": "Commercial_Slip_3903"
            },
            {
                "raw_content": "General public? More like Reddit.",
                "author": "Dreamerlax"
            }
        ],
        "subreddit": "singularity"
    }
]