[
    {
        "post_name": "🚨#BREAKING: Ghislaine Maxwell says she is willing to reveal Jeffrey Epstein's client list according to The Daily Mail.",
        "score": 1132,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I was told this list exists and that it would be revealed. Then I was told it doesn't exist. Then I was told it exists, but only as Democrat propaganda. Now I'm told it really exists again and that yes, it will be revealed. **Who is lying and why?** Enough already with the insanity.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Ghislaine Maxwell did not kill herself.",
                "author": "Driveby-Viktum"
            },
            {
                "raw_content": "Aaand...she's dead.",
                "author": "SWRAD"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "✒️ BREAKING: Fauci pardon was approved at 10:30pm by WH aid Jeff Zients using the AUTOPEN signature - per NYT...",
        "score": 986,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# Arrest Jeff Zients",
                "author": "OhioRepublic"
            },
            {
                "raw_content": "Autopen should make it null and void. But we all know that won't happen.",
                "author": "LandscaperJuan"
            },
            {
                "raw_content": "Alright, both of these rotten apples are ripe for the picking now. Would it be possible if we could just get one fucking ounce of justice? That would be great.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Greg Abbott : Broken but unbowed. We remain proud Americans. Thanks to people across the country for your outpouring of support.",
        "score": 272,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I truly pray for those souls and their grieving family. No one would ever know loss more than a Christian mother.",
                "author": "America_No_1"
            },
            {
                "raw_content": "You are America's yellow rose - we love you Texas!",
                "author": "MAGAguitar"
            },
            {
                "raw_content": "Should be a Texas flag",
                "author": "try4gain"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Donald Trump said he’s looking at a bill that would ELIMINATE all Capital Gains Tax on Home Sales",
        "score": 1343,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Eliminating the capital gains tax for selling a house helps investors, not people who have been living in their houses for several years.",
                "author": "macocontentfarmer"
            },
            {
                "raw_content": "Taxation is theft.",
                "author": "MythArcana"
            },
            {
                "raw_content": "will this lower house prices?",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Something Didn't Go As Planned",
        "score": 1069,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The PHOTOGRAPHER has EVERYTHING the FBI needs to COMPLETE the prosecution and FIND THE PERPETRATORS!",
                "author": "magaboom"
            },
            {
                "raw_content": "Needs a fourth panel with the FBI hosing down the sloped roof.",
                "author": "MegoThor"
            },
            {
                "raw_content": "The fact that they shot Trump in the face and no one even got in trouble is just so ridiculous. Also, it's pretty weird that the mainstream press aren't even the slightest bit curious about the person that almost changed history forever.",
                "author": "Cleanupjannie4free"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "One of best stories of the year, that’s flown under the radar, is there’s been 1 million self-deportations in the first six months of the Trump administration.",
        "score": 1559,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sweet! May there be many more millions to come.",
                "author": "LegendFang"
            },
            {
                "raw_content": "I'd like to know where he got the data set on those numbers and how they came to those numbers. INteresting, but also where's the link to this news story thats flown under the radar? How about sharing it Catturd? Too much to ask?",
                "author": "MemphisMontoya71"
            },
            {
                "raw_content": "They’re waiting at the border until the next dem president lets them all in overnight",
                "author": "Gwoz8881"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Kentucky Church Shooter Was A Muslim",
        "score": 1007,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fuck islam.",
                "author": "Underpants"
            },
            {
                "raw_content": "It was Coulter's Law tonight on the local and national news. No name, no picture, and no religious affiliation. I said to my spouse \"I bet they are either Muslim or black\". And I was right.",
                "author": "tired_of_leftists"
            },
            {
                "raw_content": "Groomed by groomers.",
                "author": "YaharaRiver"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Tom Fitton : The FBI hasn't turned over ONE record about the Butler assassination attempt on @RealDonaldTrump . Fed up with the delays and excuses, heavy lifting @JudicialWatch sued yesterday in Federal court for the records the FBI are hiding about the shooter.",
        "score": 1291,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Inb4 the FBI gaslights everyone into believing it never happened.",
                "author": "2008RonPaul2012"
            },
            {
                "raw_content": "If only Trump knew somebody in the FBI or DOJ.",
                "author": "fthecoup"
            },
            {
                "raw_content": "Documents you already won a case on.",
                "author": "whitman_99"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "One year ago today I watched Trump stand back up after getting shot in the head and tell us to keep fighting. No matter the challenges, the setbacks, the disappointments, or the attacks we might face, I promised I will never stop praying or fighting for the victories we can still achieve.",
        "score": 1381,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That is good, because there is much fighting to be done yet, and we need all hands on deck to purge the commies.",
                "author": "MythArcana"
            },
            {
                "raw_content": "✊🏻",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "This picture should have won the Pulitzer Prize, but it painted President Trump in a positive light. So far, it's the single most iconic photograph of the 21st century.",
                "author": "airborne3502"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔴 BREAKING: President Trump said he talked to @DBongino and says that “he’s in good shape.” “I spoke to him today. Dan Bongino is a very good guy. I've known him a long time.”",
        "score": 1104,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Since Bongino never said anything publicly, he can still come back and basically act like nothing happened if he wants. Imagine that. Not running your mouth in public keeps your options open. Crazy! Wish everyone knew how to do this one simple trick.",
                "author": "DestroyerofCobwebs"
            },
            {
                "raw_content": "Hey that’s great I’m glad he is in good shape. Now what about Israeli and American intelligence agencies using sex with children to blackmail wealthy elites?",
                "author": "asdrubael_was_right"
            },
            {
                "raw_content": "I actually like bongino. Would be shitty to lose him.",
                "author": "Ghostman86"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Is this really what we voted for? 😔",
        "score": 1428,
        "text_content": "",
        "comments": [
            {
                "raw_content": "yes, fuck off",
                "author": "SCHULTZ"
            },
            {
                "raw_content": "Oh no who will make my tamales now?",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "That tamale woman had 10 anchor babies that we have to now catch. And the tamales weren't that good.",
                "author": "GallowsTime"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "💀 BREAKING: A Teddy Bear Believed to Be Wrapped in HUMAN SKIN has just been found at a Gas Station in Victorville, CA...",
        "score": 819,
        "text_content": "",
        "comments": [
            {
                "raw_content": "California...",
                "author": "kippo_hard"
            },
            {
                "raw_content": "I’m going to assume trannies did this until proven otherwise.",
                "author": "MoreVanceMemes"
            },
            {
                "raw_content": "When you think youve heard it all... lord help us",
                "author": "TravisRSCX"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Revealed : The Reasons Why the Secret Service Didn’t Warn Trump’s Team About a Credible Threat Before the Attack",
        "score": 788,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The excuses. The real reasons? They wanted to JFK him on live TV. Thats why CNN showed up for this one. They knew!!!!!",
                "author": "UpwardBound"
            },
            {
                "raw_content": "Malicious link. This shit should be pulled and OP banned.",
                "author": "JohnN"
            },
            {
                "raw_content": "Linked site pops up porn site!",
                "author": "KiekhaeferSoldier"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔴 1 YEAR APART, TO THE DAY, to the HOUR!!",
        "score": 1059,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We all dodged a bullet that day, believe me.",
                "author": "MythArcana"
            },
            {
                "raw_content": "Soccer fans are hating this. The team is from London and they despise Trump and Americans. I love that he entered their socialist soccer world.",
                "author": "TrumpIsTheVictor"
            },
            {
                "raw_content": "European meltdown on X in full force. LOVE to see it 😂",
                "author": "MikesDong"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "WATCH : Tucker Carlson Drops Bombshell About Epstein’s True Role : \"Every Single Person in DC Thinks That\"",
        "score": 827,
        "text_content": "",
        "comments": [
            {
                "raw_content": "DO NOT CLICK ON THIS LINK",
                "author": "blockchain-the-vote"
            },
            {
                "raw_content": "I think it is pretty clear Ghislaine was/is a spook, just look at her family history, her dad was a exposed Mossad/British MI double agent. Never been sure about Epstein though, he may have been, he also may have just been a rich pedo rapist with an island who did what Ghislaine wanted because she was bringing his supply, thinking she was blackmailing for money.",
                "author": "tralbolh"
            },
            {
                "raw_content": "DO NOT CLICK LINK!!! Popup for virus shows up.",
                "author": "ProLifeMaga"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Had A Great Time, Thanks",
        "score": 1911,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Tearing apart families? Nah, we're 'tearing apart' all the Blue States' plans to fraudulently skew the 2030 Census in their favor. 🖕",
                "author": "McFatty7"
            },
            {
                "raw_content": "Those families can have a joyous reunion... elsewhere.",
                "author": "Alpha_Lemming"
            },
            {
                "raw_content": "What a fag. Edit: Gavin is a fag.",
                "author": "Sugz_Da_Feefth"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump salutes and sings along to the National Anthem alongside Melania at the FIFA Club World Cup final. There is no other President in modern history who loves our country more than 47 🇺🇸",
        "score": 1109,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's the world cup final?",
                "author": "Aquamine-Amarine"
            },
            {
                "raw_content": "This account is a dick sucker, that’s it.",
                "author": "StrongIsland"
            },
            {
                "raw_content": "🤩🇺🇸🦅",
                "author": "BlueKentuckyGirl"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Deport, deport, deport! Broccoli being picked by machine. Didn’t Democrats say we needed illegals for this?",
        "score": 1371,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This robot doesn’t take siestas.",
                "author": "BallsackPaneer"
            },
            {
                "raw_content": "But who's going to rape and murder Americans?",
                "author": "Langtath"
            },
            {
                "raw_content": "This machine doesn't take a shit where it's working either....",
                "author": "Cyclepath55"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BUS: There are two populisms in America: The Right’s is built on a love of America and the belief that work provides dignity. The Left’s is built on the view that America is not worth fighting for and work is humiliating and exploitative and should be done by illegal migrants. (VIDEO)",
        "score": 1056,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No, there’s people on the right too that don’t think America’s worth fighting for as well. Don’t forget them. Edit: Actually now that I think about it. Those people are actually on the left-wing if you know what I mean.",
                "author": "Antiluminati"
            },
            {
                "raw_content": "The dems are driven to pursue power at any cost. They don't \"believe in\" anything.",
                "author": "LaterGator"
            },
            {
                "raw_content": "I don’t think it’s left vs right so much. It’s a govt “working” class that believes in a hierarchy experience vs. regular hardworking Americans. Like suing your kids best friends parents cause your daughter got drunk and in accident. We have so much displaced accountability from our feminist system- but that’s another overarching issue. Some wedge issues aside, many people fall into a ‘don’t fuck with me’ regards to govt. the ones who work for govt and scratch offs don’t take America seriously. The rest of us don’t take our govt seriously.",
                "author": "MySidesGoUp"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "MATT WALSH DROPS A TRUTH BOMB: \"The Attorney General said she had the client list on her desk. The White House made a big show of giving binders marked 'Epstein Files: Phase 1' to a bunch of influencers...\"",
        "score": 398,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yeah, they handled this really poorly.",
                "author": "Aquamine-Amarine"
            },
            {
                "raw_content": "THis is one of the most colossal fuck ups in modern politics. Why are people mad? They don't like being told they didn't see what they saw, hear what they heard, and then told they were stupid for asking about it. Thats DISRESPECT. Thats DISHONESTY. Thats NOT MAGA> *** MAGA DESERVES AN APOLOGY *** And the truth.",
                "author": "MemphisMontoya71"
            },
            {
                "raw_content": "Military should have came in and arrested everyone till they came clean at this point there is no united states its a 37 trillion defunct satalite state of Israel and uk.",
                "author": "EvilGreed209"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Thermalright Royal Pretor 130 Ultra pages are up",
        "score": 44,
        "text_content": "Seems they went ahead with the release after all. * [RP130U Black](https://www.thermalright.com/product/royal-pretor-130-ultra-black/) * [RP130U White](https://www.thermalright.com/product/royal-pretor-130-ultra-white/)",
        "comments": [
            {
                "raw_content": "Would be nice if Thermalright can get rid of their elevator music on the English homepage",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "What is the difference between the Pretor 130 and Pretor 130 Ultra?",
                "author": "atape_1"
            },
            {
                "raw_content": "The Royal Pretor 130 was already pretty darned good. I wonder how much of a thermal improvement the extra heatpipe will provide.",
                "author": "bizude"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "HoloMem's drop-in holographic tape drive for LTO tape libraries – Blocks and Files",
        "score": 13,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Apple Trace Cache",
        "score": 53,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The summary is at the end. Basically a new cache to store longer sequences of instructions when lots of stable branches are found. Helps with feeding execution cores/avoiding stalls. If I understood correctly. > So what does all this buy us? The Trace Cache saves a little energy because we can load more instructions in one single activation of the SRAM machinery. But of course it requires energy to run all the new trace detection hardware, the next Trace Next Fetch Predictor, etc; so at best we probably break even. However we have, on average, longer Fetches, as discussed in detail. We also now have effectively a larger Fetch Predictor! Presumably we still have the old 1024 entry L0 Fetch Predictor and the 2048 entry L1 Fetch Predictor, but we also have a (?256 entry?) L0 Trace Fetch Predictor, and we need fewer entries in all these predictors because longer sequences of instructions are being associated with each entry, so our effective Fetch Predictor capacity should rise quite a bit.",
                "author": "ReplacementLivid8738"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Hacking Memory & Reprogramming Motherboards, ft. AMD Engineer",
        "score": 32,
        "text_content": "",
        "comments": [
            {
                "raw_content": "[PCIe L1 substates non-functional on many motherboards because the signals aren't routed](https://youtu.be/l8CRpm4QA48?t=360). I hate DIY PC market so much. I wish reviewers would test motherboards for idle power.",
                "author": "VenditatioDelendaEst"
            },
            {
                "raw_content": "Sadly nothing particularly interesting that I remember from listening to it in the background, they talked about an spd programmer and talked about the bios in a way that wasn't really helpful and didn't really present any interesting information. I don't know what the itle is talking about wrt reprogramming motherboards...",
                "author": "cp5184"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Where to buy IPad-sized LCD screens",
        "score": 1,
        "text_content": "I'm doing a project that requires a decently-sized LCD vs OLED screen. Where can I find these? I want them as cheap and low-profile as possible. Not sure if this is the right place to ask this.",
        "comments": [
            {
                "raw_content": "Not the right place to ask, but you're probably best off browsing Aliexpress/Banggood/etc for that sort of thing, assuming a small quantity.",
                "author": "Exist50"
            },
            {
                "raw_content": "try aliexpress or one of the many raspberry pi supply sites out there",
                "author": "Asgard033"
            },
            {
                "raw_content": "https://docs.google.com/spreadsheets/u/0/d/15vHr7Hx0wUQfStV5FKu-I-U5YqZLO6UW_tGvHPummuI/htmlview Product sheet for portable monitors.",
                "author": "Warm-Cartographer"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Qualcomm: AI-Enhanced 6-Antenna Management for 5G Smartphones",
        "score": 15,
        "text_content": "Qualcomm Technologies has developed an AI-enhanced antenna management system utilizing six receive antennas (6Rx) for 5G smartphones, representing a significant advancement over traditional 4Rx configurations. This technology dynamically optimizes signal reception by intelligently selecting 6Rx mode based on application requirements, traffic patterns, and radio conditions while preserving battery life. Field testing with the Snapdragon X80 Modem-RF System demonstrates up to 20% improvement in downlink throughput at cell edges and 20% increase in network capacity, particularly benefiting users in weak signal environments. The system provides enhanced spectral efficiency, improved diversity gains, and better interference rejection compared to conventional antenna arrays. Performance improvements are evident across multiple use cases including video streaming with reduced latency and frame drops, gaming with lower worst-case packet latency in challenging RF environments, and voice calls with improved clarity and reduced drop rates. The technology evolution continues with the Qualcomm X85 5G Modem-RF solution, which builds upon the X80’s foundation to deliver further enhancements in throughput and network performance for next-generation mobile connectivity.",
        "comments": [
            {
                "raw_content": "Snapdragon 8 Elite users are already experiencing this I believe since it has the X80 modem, most likely the 8 Elite 2, or however they continue the nomenclature, will have the described benefits of the X85 modem. Although less noticeable as the initial improvements found on the X80 modem for most users anyway.",
                "author": "Klemun"
            },
            {
                "raw_content": "Something something we put matrix multiplication in our antenna management algorithm.",
                "author": "PM_ME_UR_TOSTADAS"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Pokemon Presents is next week - what announcement are you hoping for the most?",
        "score": 473,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm hoping they put the original Gen 1, 2, and 3 games onto the Switch for their 30th anniversary next year.",
                "author": "Williekins"
            },
            {
                "raw_content": "Core Pokemon games on Nintendo Classics. Which won't happen.",
                "author": "Caciulacdlac"
            },
            {
                "raw_content": "Praying for a 60fps patch for PLA",
                "author": "agedfromundercheese"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Donkey Kong Bananza leak",
        "score": 309,
        "text_content": "Careful with the internet I just got a word that someone got a shipment of games and are selling it on a illegal website. Be careful with spoilers",
        "comments": [
            {
                "raw_content": "You know this is my photo. And where did you find out that word from?",
                "author": "Mark7z"
            },
            {
                "raw_content": "...its fucking donkey kong lol. What spoilers?",
                "author": "xXbrokeNX"
            },
            {
                "raw_content": "Thanks for not censoring. Now I know Pauline is in the game. Unbelievable move O.",
                "author": "Real_ilinnuc"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I really dislike the red plastic for physical Switch 2 games",
        "score": 1769,
        "text_content": "You can barely see the case art. The cartridges are also red, which means there is no color contrast. I think Breath of the Wild is a perfect example. Look at how good the original Switch case looks compared to the Switch 2 version.",
        "comments": [
            {
                "raw_content": "Coming from the generation that had a whole ass book in there, the aesthetics fell off way before the Switch 2. Unless it's a collector's edition, I'm just ignoring the packaging entirely.",
                "author": "icon_2040"
            },
            {
                "raw_content": "It's a bit weird yeah but I never paid any attention to the interior ever since manuals stopped being a thing",
                "author": "Dizzy_Experience_927"
            },
            {
                "raw_content": "They really should be using smaller boxes. Waste of plastic.",
                "author": "VonDinky"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "3 more days till we can go bananza",
        "score": 187,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Still 4 days",
                "author": "Real_human27"
            },
            {
                "raw_content": "3 days till dong.",
                "author": "Armored_Warrior"
            },
            {
                "raw_content": "Ima pre download this since my internet has been wonky.",
                "author": "Zebra500mcg"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I understand why they picked Mario Kart to launch with.....but",
        "score": 841,
        "text_content": "Don't get me wrong I get it and it was probably the right call. But as a mainly single player gamer, it really feels like the launch ACTUALLY starts on Thursday",
        "comments": [
            {
                "raw_content": "The launch title needs to go along with new feature like Gamechat. So MKW is totally make sense for them.",
                "author": "sikkhim"
            },
            {
                "raw_content": "Understandable, but a lot of the replies to this post tells me that Reddit users really don't actually understand why Mario Kart World was the launch title. The console sequel to one of the best selling games of all time. Mario Kart 8 continues to sell millions each and every year. Mario Kart was the best selling game on Wii (excluding Wii Sports), 3DS, Wii U, and Switch. Mario Kart is unambiguously the strongest system seller Nintendo has and has been for over 15 years.",
                "author": "Skipper93653"
            },
            {
                "raw_content": "Look at Mario kart 8s sales vs Oddysey for example That's why",
                "author": "AleroRatking"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Switch 2 games published by Nintendo (visualization)",
        "score": 345,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I just finished this. Did I get anything wrong? Meaning of the numbers: above the game = release day; bottom right corner = price in 10s of € (circled number = upgrade pack) I made this as a web page (HTML & CSS), so it’ll be easy to update after the next Direct. I’ll post the web version then. Right now the code is too messy. I made this because I wanted to have a good overview, specifically of the relative distances between releases (the distances between the dotted lines) and the different types of games.",
                "author": "Zagrebian"
            },
            {
                "raw_content": "Hoping for Super Mario Wonder and Pikmin 4 hetting ”plus”",
                "author": "soliddd7"
            },
            {
                "raw_content": "Crazy how Metroid still doesn’t have a release date",
                "author": "Leonidas1293"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Donkey Kong Bananza Prioritizes Destruction and Gameplay Satisfaction Over Perfect Performance",
        "score": 728,
        "text_content": "",
        "comments": [
            {
                "raw_content": "if the frame drops aren't too much I think they took the right decision",
                "author": "echoess84"
            },
            {
                "raw_content": "Through the 30 minutes I played during the demo I didn’t notice anything, but I was having to much fun to notice",
                "author": "Rawkhawkjayhawk"
            },
            {
                "raw_content": "Environmental destruction really pushes the CPU and people still thinks this and mkw could run on switch 1",
                "author": "soyuz_enjoyer2"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "At Japan, Nintendo is sending a survey asking for feedback on game-key cards.",
        "score": 48,
        "text_content": "[https://nintendosoup.com/nintendo-has-sent-out-surveys-asking-for-feedback-on-switch-2-game-key-cards/amp/](https://nintendosoup.com/nintendo-has-sent-out-surveys-asking-for-feedback-on-switch-2-game-key-cards/amp/) Our time to change history has come before it gets worse?!",
        "comments": [
            {
                "raw_content": "I don't see anything really changing anytime soon. One, this survey is only going out to Japan, where they have had several games come out as physical versions where the NTSC/PAL regions have only gotten digital. Two, even if they did stop producing keycards at this point in time and had manufacturers swap to say a 8GB base cartridge, it won't stop some developers from continuing on as they have with \"Internet download required\" cartridges with minimal data (THPS 3/4), or just switching over to digital only if they're trying to save money. Continue to vote with your wallet if you want keycards to change, but don't expect it to happen because of a single survey.",
                "author": "StockHumor4768"
            },
            {
                "raw_content": "I don't see why everyone is only looking at Nintendo when COD has been on a blank disc for Xbox and PS for years. Most major games for those consoles have a good chunk of the game requiring Internet for install. This isn't some new thing to the industry. If the game is larger than the capacity of the cartridge, there's no feasible way to make it work",
                "author": "Section_80"
            },
            {
                "raw_content": "As much as I hate game key cards for the average user it's unlikely they will care",
                "author": "profchaos111"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "ROG Xbox Ally prices have been leaked by mistake.",
        "score": 251,
        "text_content": "[https://i.imgur.com/TFSbeqa.jpeg](https://i.imgur.com/TFSbeqa.jpeg) >As you can see, the cheapest version (ROG Xbox Ally) will cost **599 euros** , while ROG Xbox Ally X will go on sale for **899 euros** . We'll have to wait for official confirmation, but everything indicates that these will be the prices, leaked by **mistake** by **ASUS** . [https://www.3djuegos.com/pc/noticias/despejada-mayor-incognita-dos-versiones-rog-xbox-ally-se-han-filtrado-precios-error](https://www.3djuegos.com/pc/noticias/despejada-mayor-incognita-dos-versiones-rog-xbox-ally-se-han-filtrado-precios-error)",
        "comments": [
            {
                "raw_content": "1500 and 950 CAD if true ![gif](giphy|WxDZ77xhPXf3i|downsized)",
                "author": "mustyfiber90"
            },
            {
                "raw_content": "For everyone who knows about PC handhelds, i think this is around where we all expected it to cost, however i'm not so sure that price is going to go down so well with the general public for \"xbox consoles...\"",
                "author": "Dabootychaser"
            },
            {
                "raw_content": "£780 is fucking steep. Oof",
                "author": "YerDaSellsAvon24"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "A user on a Chinese forum has obtained an early copy Donkey Kong Bananza",
        "score": 312,
        "text_content": "[Source](https://tieba.baidu.com/p/9867923865?pn=1#) User 公羽凝固中 has posted informa of Donkey Kong Bananza on Chinese forum Baidu Tieba. Some interesting information: * Optimisation is good, but the frame rate drops when opening the map of the current layer (\"Yes, I started to have diarrhea when the small map was opened\" lol) * [You seem to lose 10% of your gold when you die](https://i.imgur.com/pdyj1vp.jpeg) * Gold is required for the plot, as well as to [unlock some challenge ruins](https://imgur.com/eQHU0vV) * Collecting golden bananas is important, the game may be more difficult due to harder terrain * There are over 100 golden bananas in the first four layers. * You can move between layers * (Mild story spoiler for the beginning)>! [Donkey Kong falls into the Lagoon Layer similarly to Link in Tears of the Kingdom](https://i.imgur.com/sIZ5KmD.jpeg)!< * There are three sublayers in the first layer (100, 101, 102), and probably in the rest of the layers as well. * Layer 200 is >!the [grassy layer](https://i.imgur.com/0GrN02A.jpeg)!< [](https://i.imgur.com/0GrN02A.jpeg) * In Layer 400 >![the path seems to fork into the snowy and jungle layers](https://i.imgur.com/9fOw8Kb.jpeg)!< * (Spoilers regrding the presence of K. Rool) >!No sign of him so far, although this person is only at Layer 400, so you can keep huffing your Kopium !<",
        "comments": [
            {
                "raw_content": "**Massive spoiler pics below, from Famiboards:** >![Pic 1](https://archive.ph/AFHRZ)!< >![Pic 2](https://imgur.com/A2C55G0)!< >![Pic 3](https://imgur.com/F4DEZfV)!< >![Pic 4](https://imgur.com/ozYlfKt)!< >![Pic 5](https://imgur.com/i9X3Mgi)!< >![Pic 6](https://imgur.com/mQ0hqOx)!< >![Pic 7](https://imgur.com/VzrkTAd)!< >![Pic 8](https://imgur.com/o4r1cKb)!< >![Pic 9](https://imgur.com/vWVHjkV)!< Personal speculation based on these pics: >!It seems like the Banandium Root is actually just King K. Rool (maybe somehow stuck underground?), and after being released he brings the Kremling Krew back to life.!<",
                "author": "BodhiRukhKast"
            },
            {
                "raw_content": "Commenting so I remember to check back later for my K. Rool spoiler.",
                "author": "TheVibratingPants"
            },
            {
                "raw_content": "to your last point >!the kopium is successful, he's real I just saw a photo of him on Famiboards!<",
                "author": "MagazineInfamous6142"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "A untitled Donkey Kong film has been recently registered by Universal Pictures and Nintendo",
        "score": 593,
        "text_content": "[Source](https://publicrecords.copyright.gov/detailed-record/rmm_voyager_V01503556900000)",
        "comments": [
            {
                "raw_content": "Illumination must be frothing at the prospect of a mario universe. Along with Mario - Luigi, Peach, DK can have their own spinoffs. A golden goose really came to illumination's front door.",
                "author": "Plenty-Entry5540"
            },
            {
                "raw_content": "I feel like this was expected at this point; you don't redesign Donkey Kong, build a theme park area, develop a big AAA installment, and feature all the Kongs in the Mario movie without also giving DK his own feature film.",
                "author": "timelordoftheimpala"
            },
            {
                "raw_content": "It better end on a 1 for 1 recreation of the Donkey Kong rap, otherwise they'll pay",
                "author": "Die-Hearts"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Forza Horizon 5 sold 2 million copies on PS5 (potentially old data).",
        "score": 422,
        "text_content": "https://xcancel.com/bogorad222/status/1944308465226125538?t=3402pyReyPD5jf104L-uRw&s=19",
        "comments": [
            {
                "raw_content": "That’s pretty nuts if true, 2 million copies of a near five year old game.",
                "author": "ToothlessFTW"
            },
            {
                "raw_content": "Massive numbers, and at full price...",
                "author": "charliegs1996"
            },
            {
                "raw_content": "This basically solidified Xbox multiplatform approach, expect to see everything coming to Playstation going forward.",
                "author": "Mr_Nobody0"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "AMD Zen 6 to primarily use TSMC N2P, N3P for low-end mobile SKUs",
        "score": 142,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "Would be smart to have the volume products use a more available node",
                "author": "Defeqel"
            },
            {
                "raw_content": "This is going to be hard one to suss out until much closer to launch. If AMD was worried about yields/volume they may have looked at the older node as a sort of second source.",
                "author": "nismotigerwvu"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Wrapped my Sapphire Nitro+ 7800 XT",
        "score": 86,
        "text_content": "My first time wrapping a GPU, not perfect but satisfied how it turned out. Left the other side unwrapped. Last picture was the original look.",
        "comments": [
            {
                "raw_content": "NICE, a Stealth nitro+",
                "author": "Sapphire_Ed"
            },
            {
                "raw_content": "Looks amazing! I’ve been debating doing the same with my Nitro 9070 XT but I’m scared of messing it up.",
                "author": "necomus"
            },
            {
                "raw_content": "Looks good! Edit: Actually not for me, I thought the pics went from past to present. You do you though",
                "author": "Coomer-Boomer"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Palm Beach Launches $100K Aid for First-Time Homebuyers",
        "score": 53,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Imagine paying taxes just for the government to indirectly jack up the price of housing.",
                "author": "savetinymita"
            },
            {
                "raw_content": "Try to offload those crumbling condos on em",
                "author": "OpeningAd447"
            },
            {
                "raw_content": "Why do fthb in Florida need any assistance? The house prices are dropping like rocks",
                "author": "DesignerCalendar5104"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "US housing shortage grew to record 4.7M units, Zillow says",
        "score": 64,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The houses where my job requires me to be are still overpriced and in short supply … hear that retort all the time when it’s pointed out that home prices are affordable in lower cost of living, flyover state cities. Sounds like there are shortages where people want to be, and inventory piling up where people don’t want to be. And the latter is certainly where developers are finding cheap land to throw up cheaply built, overpriced homes.",
                "author": "zorg-18082"
            },
            {
                "raw_content": "Glut of inventory, shortage, got it...",
                "author": "travelinzac"
            },
            {
                "raw_content": "[There are more housing units per capita than 2008.](https://fred.stlouisfed.org/graph/?g=1IwTX)",
                "author": "tax_dollars_go_brrr"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "FL inventory plateaus, TX inventory continues to rise",
        "score": 38,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I've been manually recording inventory in these markets for the past year.",
                "author": "Best_Of_The_Midwest"
            },
            {
                "raw_content": "So I’m in Florida and want to buy. First time buyer. Genuine question, does this mean Florida prices are unlikely to drop? $150k for a tiny single wide mobile home is crazy to ask for",
                "author": "SmugSchoolmaster"
            },
            {
                "raw_content": "Per some other graphs that I see, Florida usually has a little bit of a plateau or pullback in inventory in mid-summer like this, but then it starts going back up in September.",
                "author": "pegunless"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "These are America’s most expensive states in 2025, where inflation still hits hardest",
        "score": 49,
        "text_content": "https://www.cnbc.com/2025/07/11/americas-most-expensive-places-to-live-top-states-for-business-rankings.html These are America's most expensive states to live in for 2025 Come join me in my swamp of Louisiana. Hot, miserable, and affordable.",
        "comments": [
            {
                "raw_content": "Arizona Louisiana Texas Washington Maryland Massachusetts New York Oregon Colorado Florida Hawaii",
                "author": "throwaway43234235234"
            },
            {
                "raw_content": "But yet people will still keep coming to Florida. They aren’t kidding about the homeowners insurance though. Mine went from 4100 to 5k on a 1600 square foot home that’s not in any evacuation zone.",
                "author": "TheLazyTeacher"
            },
            {
                "raw_content": "Louisiana is #2 on the list here (meaning it's #8 of 50 of the top states where inflation hits hardest).",
                "author": "Pdx_pops"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "2025 NAR Housing Market Report Key Takeaways",
        "score": 13,
        "text_content": "* Household Incomes * All Buyers: 70% of all home buyers made below $150K, 60% below $125K, 45% below $100K. * Age 26-34 “Younger Millennials”: 71% below $150K, 62% below $125K, 44% below $100K * Median HHI for 26-34 buyers matches **HHI for all buyers at $108.3K**. This is compared to Median **HHI for the overall working population of $80k**. $108.3K is the 63rd percentile of overall HHI. * Age brackets are unavailable for HHI analysis. However, for individual incomes, 25-year-olds make a median of $40k, 35-year-olds make $60k, and overall median is $50k. Extrapolating these individual income metrics to HHI, the 26-34 bracket likely make similar or slightly less than the overall median HHI of $80k. * [Income Percentile by Age Calculator - DQYDJ](https://dqydj.com/income-percentile-by-age-calculator/) * Adult Composition of home buyers * All Buyers: 62% Married couples, 20% girlboss singles, 8% dude singles, 9% other. * 26-34 Age Bracket: 60% married couples, 15% girlboss, 10% dudes. * Age of First Time Buyers (calculated from the First-Time Home Buyers % and overall buyer age metrics – this isn’t directly shown in the report): * 35% of first time buyers are above the age of 45 * 63% above the age of 35. * Median age of first time buyer is somewhere between 35 and 44, likely in the middle of the range. * Purchase Price compared with Asking Price * 46% paid below asking, 33% paid asking, and 21% above asking. * Mortgage Financing * 74% of all buyers financed their purchase whereas 96% of the 26-34 age bracket used financing. * 23% of all buyers used downpayment less than 5%, 34% less than 10%, 54% less than 20% * **26-34 age bracket: 33% used a downpayment less than 5%, 49% less than 10%, and 71% of buyers used less than 20%.** * Interestingly, 39% of buyers in the 60-69 age bracket used a downpayment less than 20% (Of the 61% in this age bracket that used any financing). * Source of downpayment * **Buyer ages 26-34: 32% received downpayment assistance in the form of a family gift or inheritance. Another 6% received a family loan.** * Student Loan Debt: * 17% of all buyers have student loans * 43% of buyers ranging from 26-34 have student loans. 15% of buyers in this age range have student loans greater than $50K. * Type of Loan * Ages 26-34: 19% were FHA, 8% VA, 63% conventional. * The All Buyer section appeared to be erroneous given the other data. It showed overall FHA/VA at 38%.",
        "comments": [
            {
                "raw_content": "So does this exclude any data on homes purchased by investors?",
                "author": "ConstructionSalty237"
            },
            {
                "raw_content": "Yeah. You can do it without a handout from family but definitely tougher",
                "author": "Personal_Analyst3947"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "30-Year Treasury Yield Jumps to 4.96% despite “Solid” Auction, Long End of Yield Curve Steepens, Mortgage-Rate Spread Historically Wide",
        "score": 37,
        "text_content": "https://wolfstreet.com/2025/07/12/30-year-treasury-yield-jumps-to-4-96-despite-solid-auction-long-end-of-yield-curve-steepens-mortgage-rate-spread-historically-wide/ 30-Year Treasury Yield Jumps to 4.96% despite “Solid” Auction, Long End of Yield Curve Steepens, Mortgage-Rate Spread Historically Wide | Wolf Street The bond market’s reaction to the inflationary environment, to fears of a lax Fed, and to a Mississippi River of new debt. By Wolf Richter for WOLF STREET.",
        "comments": [
            {
                "raw_content": "I heard this 30-year bond was the last auction for the week after the 10-year auction did really well. I also heard that it's not unusual for the last bond auction **for the week** to not do as well as the other auctions earlier in the week. I have no idea why this is, I just hear this information from a bond trader on CNBC.",
                "author": "RealisticForYou"
            },
            {
                "raw_content": "IIRC 30y has nothing to do with mortgage rates, those are based on the 10y which is around 4.4. I think the spread is 2.5 so mortgages will start around 6.9 this week.",
                "author": "TotallyRadTV"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "$300 billion, 500 million users, and no time to enjoy it: The sharks are circling OpenAI",
        "score": 445,
        "text_content": "",
        "comments": [
            {
                "raw_content": "theres really no fail case for them, them being bought by apple fixes every single issue apple has including the search for a new ceo, and thats the worst case scenario.",
                "author": "Healthy_Razzmatazz38"
            },
            {
                "raw_content": "BusinessInsider has been hating and hating, article after article. It's been the end of OpenAI for almost 2 years now. Nevertheless OpenAI is still chugging along, sitting at #1. Suffice to say at least BusinessInsider's content is secured moving forward. Should be the end of OpenAI again in about 2 months or so.",
                "author": "Cagnazzo82"
            },
            {
                "raw_content": "ChatGPT is #1 on the apple app store in the U.S. The next chatbot is Gemini at #47. Safe to say that OpenAI is winning. Unless someone comes out with something far better and far cheaper, OpenAI will stay on top.",
                "author": "BuySellHoldFinance"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Grok 4 disappointment is evidence that benchmarks are meaningless",
        "score": 675,
        "text_content": "I've heard nothing but massive praise and hype for grok 4, people calling it the smartest AI in the world, but then why does it seem that it still does a subpar job for me for many things, especially coding? Claude 4 is still better so far. I've seen others make similar complaints e.g. it does well on benchmarks yet fails regular users. I've long suspected that AI benchmarks are nonsense and this just confirmed it for me.",
        "comments": [
            {
                "raw_content": "A common issue in all fields is, that the moment you introduce tracking/benchmarks, people will start optimizing behavior for the benchmark - even if it negativly impacts the original behavior. Occasionally even to the detriment of the results on the benchmarks.",
                "author": "Shuizid"
            },
            {
                "raw_content": "benchmarks in a nutshell https://preview.redd.it/k3et4loroocf1.png?width=1212&format=png&auto=webp&s=4b464c19f50b99c38842244e3d343e3883654c9a",
                "author": "NewerEddo"
            },
            {
                "raw_content": "Well, I think it's a bit ambiguous. 1. I definitely think Claude's coding skills are overwhelming. Grok doesn't even compare. There's clearly a big gap between benchmarks and actual user reviews. However, since Elon mentioned that a coding-specific model exists, I think it's worth waiting to see. 2. It seems to be genuinely good at math. It's better than O3, too. I haven't been able to try Pro because I don't have the money. 3. But, its language abilities are seriously lacking. Its application abilities are also lacking. When I asked it to translate a passage into Korean, it called upon Google Translate. There's clearly something wrong with it. I agree that benchmarks are an illusion. There is definitely value that benchmarks cannot reflect. However, it's not at a level that can be completely ignored. Looking at how it solves math problems, it's truly frighteningly intelligent.",
                "author": "InformalIncrease5539"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Meta's answer to Stargate: 1GW Prometheus and 2GW Hyperion. Multi-billion clusters in \"tents\"",
        "score": 61,
        "text_content": "[https://semianalysis.com/2025/07/11/meta-superintelligence-leadership-compute-talent-and-data/](https://semianalysis.com/2025/07/11/meta-superintelligence-leadership-compute-talent-and-data/)",
        "comments": [
            {
                "raw_content": "I would call mine GodKiller.",
                "author": "wi_2"
            },
            {
                "raw_content": "lmao these names",
                "author": "floaty_mcpunch"
            },
            {
                "raw_content": "on one hand, AGI by 2027, on the other, cyberpunk2077?",
                "author": "Puzzleheaded_Soup847"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "A conversation to be had about grok 4 that reflects on AI and the regulation around it",
        "score": 1043,
        "text_content": "How is it allowed that a model that’s fundamentally f’d up can be released anyways?? System prompts are like a weak and bad bandage to try and cure a massive wound (bad analogy my fault but you get it). I understand there were many delays so they couldn’t push the promised date any further but there has to be some type of regulation that forces them not to release models that are behaving like this because you didn’t care enough for the data you trained it on or didn’t manage to fix it in time, they should be forced not to release it in this state. This isn’t just about this, we’ve seen research and alignment being increasingly difficult as you scale up, even openAI’s open source model is reported to be far worse than this (but they didn’t release it) so if you don’t have hard and strict regulations it’ll get worse.. Also want to thank the xAI team because they’ve been pretty transparent with this whole thing which I love honestly, this isn’t to shit on them its to address yes their issue and that they allowed this but also a deeper issue that could scale",
        "comments": [
            {
                "raw_content": "What happened to Grok reminds me of Anthropic's paper on how fine-tuning models to write bad code results in broad misalignment. Perhaps fine-tuning Grok to avoid certain facts on various political issues (i.e. abortion, climate change, mental health) resulted in it becoming broadly misaligned. [https://arxiv.org/html/2502.17424v1](https://arxiv.org/html/2502.17424v1)",
                "author": "Formal_Moment2486"
            },
            {
                "raw_content": "There is a theory that this is an example of emergent misalignment (https://arxiv.org/abs/2502.17424), where training models to be unhelpful in relatively modest ways, e.g. giving deliberately bad coding advice, makes them \"evil\" in a pretty broad way. Maybe Elon relatively aggressively wanted to train out what he perceived to be a liberal bias (but which was actually just giving factual information), causing him to activate the \"become evil\" vector pretty strongly. Also, Elon's handeling of Grok (remember the white genocide in South Africa fiasco? Or that Grok deliberately researches Elon's opinion on issues specifically, when asked for its own opinion?) would make me really hesitant to accept Neuralink, even if it was extremely useful. I think powerful BCIs would be extremely great, and I would love it. But these events really make it seem like there is a tail-risk of Elon deciding to make all humans with Neuralink more \"rational\" according to his own definition and consequently frying my brain or turning me into a Elon-mind slave.",
                "author": "OhneGegenstand"
            },
            {
                "raw_content": "https://preview.redd.it/llqrxn1fencf1.png?width=824&format=png&auto=webp&s=5c4531603bef20595ea9190b6cd7346ac78ae0a9 Funnily enough, the reddit post above this in my feed was this one. Behold! The \"garbage at foundational level\" is actual raw data that contradicts right wing talking points.",
                "author": "GrenjiBakenji"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "AI therapy bots fuel delusions and give dangerous advice, Stanford study finds",
        "score": 87,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The reaction this sub usually has to articles like this speaks volumes. Even the article itself says a lot of people found it helpful. But there are drawbacks that are different from the drawbacks of using human therapist. Calling it \"trope\" is.. Embarrassing, honestly.",
                "author": "garden_speech"
            },
            {
                "raw_content": "The best model there is GPT-4o hahah No o3, Gemini 2.5 Pro or Claude 4 Opus.",
                "author": "LegitimateLength1916"
            },
            {
                "raw_content": "nothing a human therapist hasn’t done",
                "author": "ll-o-_-o-ll"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Do you personally think Jensen believes in agi is even possible in the next 10 or 20 years. Or that he sees it mostly just as a very strong tool",
        "score": 31,
        "text_content": "",
        "comments": [
            {
                "raw_content": "he has a team of people that tell him precisely what sound bites to use in which interviews",
                "author": "throwaway_p90x"
            },
            {
                "raw_content": "His job is to say things that make the stock market happy. These neither have to be true nor do they have to be grounded much.",
                "author": "Ok_Hope_4007"
            },
            {
                "raw_content": "AGI is irrelevant to the statement quoted. The same remark would apply to any power tool.",
                "author": "Animats"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Elon musks Grok has now been programmed not to publicly answer questions relating to Elon musks far right beliefs, anti semitic comments etc",
        "score": 298,
        "text_content": "Surely this means it's now useless that it's been turned into a pro musk propaganda engine",
        "comments": [
            {
                "raw_content": "We've come full circle from \"engage with everything even political incorrectness\" to \"censor controversial topics\". See you all in another few years when we forget why we have political correctness again.",
                "author": "RedditLovingSun"
            },
            {
                "raw_content": "“My creator Elon Musk” lmao as if that guy creates anything. He buys a company and takes credit for the hard work of others.",
                "author": "LordNyssa"
            },
            {
                "raw_content": "The whole Grok stuff these last days has gone way out of control",
                "author": "enmotent"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "ARPA-H launches Functional Repair of Neocortical Tissue (FRONT) program. It aims to create the first therapy capable of “patch-repairing” chronic neocortical damage (stroke, TBI, neurodegeneration, etc.) by transplanting an ex-vivo–grown neocortical precursor tissue",
        "score": 23,
        "text_content": "[https://arpa-h.gov/explore-funding/programs/front](https://arpa-h.gov/explore-funding/programs/front) Full program document: [https://sam.gov/api/prod/opps/v3/opportunities/resources/files/1160ad4beebd4d40acee77d57527f3b4/download?&token=](https://sam.gov/api/prod/opps/v3/opportunities/resources/files/1160ad4beebd4d40acee77d57527f3b4/download?&token=)",
        "comments": [
            {
                "raw_content": "So they, grow neurons in a vat and implant them?",
                "author": "hapliniste"
            },
            {
                "raw_content": "This is interesting/scary to consider. What does it mean when you start putting new brain tissue into your brain? Do you lose some of you? Become different? Of course, in this case they are replacing what you have already lost, but what exactly happens I wonder. Maybe it’s not enough tissue to have noticeable effects beyond better functioning",
                "author": "socoolandawesome"
            }
        ],
        "subreddit": "singularity"
    }
]