[
    {
        "post_name": "‘Undercover’ Spy At Center Of WSJ Sob Story Is Actually A Public CIA Russia Hoaxer",
        "score": 617,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Abolish the CIA and all other Intel agencies. Fucking worthless traitors.These tyrants need to be jailed and or executed for the misery and death they have knowingly caused. MAGA AF",
                "author": "Mulletgunning"
            },
            {
                "raw_content": "gurgANUS",
                "author": "NamendaBiden"
            },
            {
                "raw_content": "Just like cdc horse face, this one looks just like you'd expect.",
                "author": "ToxicAvengerOhio"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ICE agents guarding the facility in Portland have been trolling Antifa. This ICE agent posted up on the roof below proudly carried around one of the guitars the feds seized from a protester earlier in the evening all night long, infuriating the group who want their guitar back.",
        "score": 512,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Kek. Based.",
                "author": "Eyepatch_McCain"
            },
            {
                "raw_content": "Play free bird!",
                "author": "RustySheckelford"
            },
            {
                "raw_content": "Now go away before I taunt you a second time.",
                "author": "Neonentity"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 STEPHEN MILLER: \"The Democrat Party at every level exists to serve the illegal alien, the criminal, the terrorist, the gangbanger and all of the organizations that shelter and coddle them.\" \"They are society-destroyers, they are city-destroyers, they are family-destroyers.",
        "score": 1090,
        "text_content": "",
        "comments": [
            {
                "raw_content": "says it like it is.",
                "author": "NoMoreShinesBilly"
            },
            {
                "raw_content": "Stephen Miller 2028",
                "author": "Kael"
            },
            {
                "raw_content": "JD Vance needs to match this level of rhetoric regardless of what his Indian wife says or how much he pisses off his in-laws or Gen Z will not turn out for him in 2028. He is no longer an inspiring figure. If Stephen Miller ran for POTUS tomorrow if Trump fell sick, he'd win. Even the hardest of the groypers would vote for him. JD Vance needs to be saying these things. It shouldn't fall to a deputy chief of staff to do external PR comms for this admin.",
                "author": "bleeje"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Pray for Sophia...",
        "score": 1721,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Let's all pray for her.",
                "author": "Zacktopia33"
            },
            {
                "raw_content": "Sophia's mother is a pediatric critical care nurse who went to work to help before discovering the shooting happened at her children's school and that her daughter was among the injured. Prayers for Sophia and her family. May she recover and heal quickly. https://www.fox9.com/news/mpls-icu-nurse-working-when-daughter-arrived-critically-injured-school-shooting-august-28",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "And may her shooter rot in hell.",
                "author": "KuzoKevin"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Demond Taylor, the man arrested for SH00TING AND KlLLING a St. Louis area police officer, has been released after posting a $5,000 bond Blue cities are OUT OF CONTROL.",
        "score": 765,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fed control of all our cities sounds like an America I want no part of, not even if Trump is controlling it, because once Democrats get a hold of the same plan, it will be a nightmare. I wish some of you would use your brain cells to contemplate what you wish for.",
                "author": "MemphisMontoya71"
            },
            {
                "raw_content": "[Demond Taylor was the police officer killed.](https://www.firstalert4.com/2025/08/23/arrest-made-2008-killing-off-duty-officer-demond-taylor/)",
                "author": "XlDEN"
            },
            {
                "raw_content": "for what it's worth; 1. This is a 2008 case they got new info on 2. The cop was off duty, apparently \"Brandon M. Levy\" the shooter, thought the Cop \"Taylor\" was a rival gang member 3. If they don't care about black on black violence, should we get up in arms about it?",
                "author": "MakinBacon"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "pRedditors calling for more violence against Christians",
        "score": 1521,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We're still relying on law and order. These miscreants say they want conflict... they really dont.",
                "author": "ChyNahAzzWhole1"
            },
            {
                "raw_content": "Of course they buy into mass shootings as a way to usher in gun control.",
                "author": "shadypollster"
            },
            {
                "raw_content": "'We're going to use guns to kill so we can get guns away from people' ? Make it make sense.",
                "author": "ImYourHuckleberry24"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"DEVELOPING: Mother of Transgender Minneapolis Mass Shooter Robin Westman Appears to Have Fled and Is Not Cooperating with Police… and Retained a Criminal Defense Attorney\"",
        "score": 830,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Probably steered him towards hormones, bought him the gun. Mother of the Year.",
                "author": "Bongos"
            },
            {
                "raw_content": "Munchausen by Tranny",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "If true, that's odd behavior, almost like what someone would do if the knew their son was nutso and also knew he had firearms, or was seeking them, but said nothing.",
                "author": "4886Battery"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Cracker Barrel's 93-year-old founder has some strong words for the CEO trying to rebrand and modernize…",
        "score": 1012,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The cunt dont give a fuck what we think... Treat CB like budlight.",
                "author": "ChyNahAzzWhole1"
            },
            {
                "raw_content": "The business world is trending toward just this unified shades of grey interchangeable slop option 1 slop option 2 3 all packaged in a slightly different shade of grey building that all looks the same. Meanwhile look at chik fila. Custom. Focuses on quality. Identifiable. I hate this corporatized world so much and we need a return to soulful mom and pop.",
                "author": "Viewer01"
            },
            {
                "raw_content": "Busted",
                "author": "V4Baretta"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"How many innocents must I murder before I get my way?\"",
        "score": 1366,
        "text_content": "",
        "comments": [
            {
                "raw_content": "now give me ur gun so i can make sure this never happens again",
                "author": "rumplestiltzkin2"
            },
            {
                "raw_content": "INNOCNENT You had one job OP",
                "author": "nakedjay"
            },
            {
                "raw_content": "Children die in a free society, and it sucks. But in disarmed societies the slaughter is hundreds or thousands of times worse",
                "author": "Formerlurker92"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Homeland Security : Avoid costly fines by returning home today! By using the CBP Home App, you will receive a complimentary one-way plane ticket home, a $1,000 exit bonus, and forgiveness of any fines previously assessed for failure to depart.",
        "score": 770,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">illegal migrants Using the lefts words again. You can do better New York Post. &#65038; # Try ILLEGAL ALIENS / INVADERS &#65038;",
                "author": "BallotsOnRubysUSB"
            },
            {
                "raw_content": "David Nino Rodriguez was on TimcastIRL the other day and explained how the people he talks to in El Paso say the illegals are just hunkering down and hoping to wait out the Trump term by laying low. I know Nino, and have been a guest on his show. He lacks discernment in some areas and has some questionable people on his show, but he’s a patriot and he knows El Paso. This is a problem that can only be solved by punishing people who hire and rent to illegals.",
                "author": "War_Hamster"
            },
            {
                "raw_content": "Fuck that, these illegal fucks been taking enough, if youre handing out our money hand it back to the people it actually belongs to. They dont deserve a reward.",
                "author": "AssPhixEAtion627"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Cincinnati police union votes no confidence in Mayor Aftab Pureval after viral mob attack that left woman knocked out",
        "score": 525,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A person named Aftab Pureval should never be allowed anywhere near political power in America",
                "author": "Sea_Still"
            },
            {
                "raw_content": "it's name is pureval.... what do you expect? they're telling you who they are",
                "author": "Raetchel"
            },
            {
                "raw_content": "Aftab? Sounds like a sinus medicine, but with extra street shitting.",
                "author": "HillarysBeaverMunch"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Beauty and grace",
        "score": 949,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Beautiful woman",
                "author": "Maximus77"
            },
            {
                "raw_content": "I read that that half of the staff would quit if they put her on the cover. If this is real, then I guess a bunch of Leftists are out of work today.",
                "author": "Decepticons-superior"
            },
            {
                "raw_content": "She has more grace in her left pinky toe, than Jill “visiting angel” Biden, or big Mike could ever dream of having.",
                "author": "elmerecido"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Seattle leftist: “I’m from Seattle, MAGA won’t step foot in my city without a police armed escort.”",
        "score": 709,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I won’t set foot in Seattle WITH a police armed escort",
                "author": "TakingAction"
            },
            {
                "raw_content": "That faggot would be pissing himself and crying for mommy the second they tackled him.",
                "author": "cjcivicx"
            },
            {
                "raw_content": "Because you def need one or a homeless drug addict will try to rob you.",
                "author": "CleanUpPhillyTrump24"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Judge who will weigh Trump's move against Fed has tangled with his policies before",
        "score": 576,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Haha, they said… weigh.",
                "author": "olliec420"
            },
            {
                "raw_content": "She weighs a lot more than just Trump's move.",
                "author": "TheGreenDutchman"
            },
            {
                "raw_content": "So we know she will rule against Trump. It's a rule that a black DEI hire female will always favor another black DEI hire woman, regardless of evidence and law. This is what makes a strong independent black woman.",
                "author": "Tag1456"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Distrust in the CDC is not because of Secretary Kennedy or President Trump. It is because the CDC allowed teacher unions to write public health guidance to close schools - unleashing developmental delays and mental health problems that will take a generation to rectify.",
        "score": 1358,
        "text_content": "",
        "comments": [
            {
                "raw_content": "One could push this whole distrust the CDC thing soo much further.",
                "author": "Thelongarm"
            },
            {
                "raw_content": "I am distrustful of the CDC specifically because of employees like the Bug Chasing Leather Daddy that just submitted his public letter of resignation (He/Him)",
                "author": "GodKingHarambe"
            },
            {
                "raw_content": "All so teachers could teach their classes from a beach somewhere",
                "author": "PapaPepe"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ICE Preparing To Target Chicago For Immigration Crackdown",
        "score": 1185,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why announce this ahead of time?",
                "author": "AVeryNakedMan"
            },
            {
                "raw_content": "North America cartel headquarters Chicago!",
                "author": "Trooph-Hurts"
            },
            {
                "raw_content": "They need to travel South in the state to a place called Beardstown Illinois. They are a huge population.",
                "author": "Atomstein"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Vice President JD Vance just led the whole room in a prayer for the 2 children who lost their lives",
        "score": 1289,
        "text_content": "",
        "comments": [
            {
                "raw_content": "this.is.the.way. ®",
                "author": "notsuicidalatall"
            },
            {
                "raw_content": "\"Blessed are they that mourn: for they shall be comforted.\" 🙏 https://www.biblegateway.com/passage/?search=Mathew%205&version=KJV https://www.youtube.com/watch?v=o5OnF3sg0cY",
                "author": "TrancePhreak"
            },
            {
                "raw_content": "Hawaiian judge overrules prayer, orders more punitive killings",
                "author": "jsphere256"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "IF - IF - IF 💃 Okie Doke 🕺",
        "score": 801,
        "text_content": "",
        "comments": [
            {
                "raw_content": "HAHAAHAAHAAAHAHAAAAA... SAD.",
                "author": "Steven4385"
            },
            {
                "raw_content": "Don't post ostentatious shit like that. You'll open yourself to relentless ridicule. For example, someone might say your blood type is Pace salsa.",
                "author": "BaldwinsSilverBullet"
            },
            {
                "raw_content": "Bish... youre both real women.. you're just a fat ugly one.",
                "author": "ChyNahAzzWhole1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Parents of 11-year-old Minneapolis shooting survivor put her on CNN: \"It will create a lot of hate if I say, 'ban guns.'\"",
        "score": 435,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Murder is already banned",
                "author": "MakeAmericaRichAgain"
            },
            {
                "raw_content": "It will save a lot of lives if I say: Ban Trannies!",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Fucking parents are idiots. I would never put my kid in front of these commies cameras. Demonic MSM patrons soaking up the psyop slop. All to push anti gun and anti White . Not the mutilation ,indoctrination ,psychological and physical damage the lizards are responsible for.",
                "author": "Mulletgunning"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "VOTED FOR IT ----> Liberals are LOSING their minds, because the State of Florida keeps washing away their rainbow chalk crosswalks every night.. LOVE THIS!! 👏👏",
        "score": 1611,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If they could only wash away the leftists that easily...",
                "author": "Wizard_Glick"
            },
            {
                "raw_content": "So why aren't they arresting people for creating a road hazard every day?",
                "author": "PapaPepe"
            },
            {
                "raw_content": "Wash the gay away",
                "author": "-f-b-i-"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Intel gets $5.7 billion from Trump deal as White House says details are 'being ironed out'",
        "score": 86,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">The government’s equity stake will be funded by the remaining $5.7 billion in grants previously awarded, but not yet paid, to Intel under the U.S. CHIPS and Science Act and $3.2 billion awarded to the company as part of the Secure Enclave program Wow so they aren't getting more money, just what was promised before. And shareholders just took a 10% haircut on their assets because government said so? Truly one of the deal of all time.",
                "author": "SERIVUBSEV"
            },
            {
                "raw_content": "Wonder how illegal this “deal” would really be in a functioning Democracy.",
                "author": "AcademicF"
            },
            {
                "raw_content": ">\"The T's are still being crossed, the I's are still being dotted,\" Leavitt said. \"It's very much still under discussion.\" I wonder what the catch would be. Say bye-bye to the foundry?",
                "author": "GenZia"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "TSMC Accelerates 1.4 nm Plans, Targets 2027 Pilot Runs",
        "score": 283,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> Customers can also expect substantially higher wafer costs compared to the 2 nm node, given the node's complexity and higher operational costs. As a consumer it’s hard to get excited about new nodes anymore, but I do still enjoy seeing folks continue to push chip fabrication to its limits. (And yes I realize these cutting edge nodes are going to more and more being targeting data centers and such early on, not consumer end products.)",
                "author": "reallynotnick"
            },
            {
                "raw_content": "It's interrsting that A14 will have a separate BSPDN version that will be released a year later and won't be part of the main features of the node, like with A16, or Intel's process nodes.",
                "author": "Wyvz"
            },
            {
                "raw_content": "I wonder if they expect competition to be more serious with them accelerating their plans. Like it doesn’t come without serious risks to do something like this.",
                "author": "I_Am_A_Door_Knob"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "PSP Media Engine (CPU2) - Custom Core",
        "score": 13,
        "text_content": "Hello! The PSP may be an old device, but it's far from forgotten and still has plenty of potential with its SoC. So I'd like to share the following open-source project with the aim of taking better advantage of its hardware. [PSP Media Engine Custom Core Library](https://github.com/mcidclan/psp-media-engine-custom-core) It's a library (wip) for both older and newer PSP homebrew developers to ease the use and integration of the Media Engine into our projects. This should make the PSP's second MIPS CPU, and the code running on it, more appealing to devs who want to, for example, port or write emulators for the console. We know that the Media Engine gives us extra CPU resources and additional memory at the same time. But there is still more to discover about it, and this is also part of the project's goals. The main idea is simply to map the Media Engine Core functions, which are available in a specific kernel area, making them available for our use. The challenge is that we don't know much about those functions, which are actually, for most of them, related to an embedded and unknown DSP. More information is available in the README. Feel free to share, fork, or open PRs if you think you have something valuable to add. In case you'd be interested, you can join us on discord [PSP Homebrew Community](https://discord.gg/utrbhjyp) to discute about it. Thanks for reading!",
        "comments": [
            {
                "raw_content": "How powerful is the CPU and how much more memory does it unlock?",
                "author": "BlueGoliath"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Condor Computing's Cuzco, a High-Perf RISC-V Design at Hot Chips 2025",
        "score": 19,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Cuzco is claimed to have a SPECInt2006/GHz of 17.5. Zen+ is at 16.0, Zen2 at ~18.7, thus placing this microarchitecture somewhere between the two. I am hyped to see how the many RVA23 compliant chips coming next year perform in the real world.",
                "author": "3G6A5W338E"
            },
            {
                "raw_content": "Why do people care about RISC-V?",
                "author": "BlueGoliath"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "CRYORIG C5 cu Review",
        "score": 21,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I miss when you could get a C7 for like $20-30…",
                "author": "rowdy_1c"
            },
            {
                "raw_content": "What is the budget SFF heatsink right now, anyways?",
                "author": "aj_thenoob2"
            },
            {
                "raw_content": "The writer of this article completely missed the point of low profile coolers > Exactly, looking at the cases available to buy from regular e-tailers, etc. The selection available works out to 99% support AIO or larger air coolers, mostly because GPUs are massive now, so to support them means more space. More niche offerings require specific knowledge of the company or case. It is a tiny market comparetively.",
                "author": "SunnyCloudyRainy"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "CRYORIG C5 & C5CU REVIEW [Caselabs]",
        "score": 8,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How can you bring this to the market when you compete with the axp90, at half the price, thinner and performs better. Am I missing something? Is there any scenario where a vapor chamber may bring benefits that traditional heat pipes wont?",
                "author": "viladrau"
            },
            {
                "raw_content": "I kind of thought cryorig they went out of business. They pretty much disappeared for a long time",
                "author": "Dr_Ben"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Creating a qubit fit for a quantum future",
        "score": 8,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "2:00 AM: Furukawa is currently looking at this meme",
        "score": 283,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I miss the water buffalo era 😔",
                "author": "Constant-Middle6666"
            },
            {
                "raw_content": "Yeah, I also remember a fish button that when pressed does nothing.",
                "author": "InformationMuted3454"
            },
            {
                "raw_content": "What the hell is this about?",
                "author": "owensoundgamedev"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Over 75% of Cyberpunk 2077’s sales on Switch 2 were physical.",
        "score": 568,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It’s a pretty awesome physical too, a huge game loaded on the cart and it came with some dope stickers. I miss when it was normal for games to come with a guide or artwork",
                "author": "Euphoric_Juggernaut6"
            },
            {
                "raw_content": "Id love to the actual numbers. It's such a good port.",
                "author": "sportspadawan13"
            },
            {
                "raw_content": "Yakuza is the game I wanted at launch but got Cyberpunk solely because it was fully on-cartridge. No regrets in that decision, I'm loving Cyberpunk.",
                "author": "cloudlocke_OG"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "High On Life: Nintendo Switch™ 2 Edition - Out now, free update",
        "score": 406,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ain't no way devs should be having trouble getting dev kits if goddamn Squanch Games got one lol",
                "author": "IrishSpectreN7"
            },
            {
                "raw_content": "'Higher frame rate', and 'up to 30fps' ? Did it run under 30fps before? Lmao",
                "author": "LucasLoci"
            },
            {
                "raw_content": "I wish switch 2 could get an easy 1080p 60 fps with games. I was hoping third party would be more viable this generation. Guess I’m sticking to Nintendo and indie games again",
                "author": "TylerThrowAway99"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "In Donkey Kong Banaza, do you try and collect everything before going down the next stage or simply try and get there the fastest",
        "score": 388,
        "text_content": "I think I'm losing steam with this game because I'm too focused at trying to collect 95% of everything before going to the next lower level. Anyone here just try and zoom below? It might be more fun this way ha?",
        "comments": [
            {
                "raw_content": "I treat it like BotW- follow my curiosity and when I feel fatigued, ask myself \"what am I doing again?\" And move forward towards the objective.",
                "author": "kevtron5000"
            },
            {
                "raw_content": "A middle ground. I collect the bananas that are easy or medium hard to get, then move on to the objective. I don't get the ones that are too difficult.",
                "author": "Aiseadai"
            },
            {
                "raw_content": "I’ve collected everything in each layer so far before moving on",
                "author": "ForChrom"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Shinobi’s live! Are you going to be playing through on S2?",
        "score": 27,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I really wanted this on Switch 2 as it would be a perfect handheld title but, having tried the demo on it and PC, I can't bring myself to buy the Switch 1 version, so Steam it is. I bought my S2 because the S1 has been underpowered for years, so I'm not buying new titles that aren't native on Switch 2, especially when they look worse handheld than on Switch. Thanks Nintendo. I know Sega is releasing Switch 2 titles, but they obviously don't have enough dev kits to go around all their teams and Lizardcube clearly don't have one.",
                "author": "DisagreeableRunt"
            },
            {
                "raw_content": "I waited for that game so much, but it was such a disappointment they didn’t release switch 2 version. Won’t buy until they do.",
                "author": "PunicArz"
            },
            {
                "raw_content": "I just thumbed thru the digital art book I’m gonna start tomorrow I gotta get some sleep. I’m stoked on it",
                "author": "OneMillionZants"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Looks like MGS Delta is playable on Steam Deck. How long before we see this port come to Switch 2.",
        "score": 83,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I heard it runs like shit on everything right now so I would rather them take time to fix that than try and get it to run on this.",
                "author": "Raphael0055"
            },
            {
                "raw_content": "It looks worse than MGS 5 running on a PS4 though to even get to 30 fps. It looks like pixel soup with FSR on Steam deck. UE5 does not scale well with lower power hardware.",
                "author": "Lagviper"
            },
            {
                "raw_content": "Playable is being generous. This game chugs it can't hit a stable 30 FPS at all it drops to the sub 10's in some parts.",
                "author": "E_M_1-"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The ultimate time waster (I mean that in a good way)",
        "score": 16,
        "text_content": "Finally bought it after seeing it get another new update. Coincidentally, it's also on sale. Bought it around 1am and I have now logged in around 7 hours since buying it.😅 you'll lose track of time easily when playing No Man's Sky. It's the perfect game to play when you just want to take a break from your main game.",
        "comments": [
            {
                "raw_content": "It’s a brilliant game and was a day 1, S2 buy for me (3rd time I’ve bought the game). Limitless opportunities to explore, become a trading merchant, a pirate, base builder, ship builder, a cook, animal hunter, farmer, etc. I’ve got 500 hours across 3 platforms (cross save ftw). Hello Games has made this into a masterpiece, and free updates for 9 years is amazing. I’ll be checking out Light My Fire when that comes out from them too.",
                "author": "Raging_Pwnr"
            },
            {
                "raw_content": "Good looks I'm buying.",
                "author": "OBYourThirst"
            },
            {
                "raw_content": "Im thinking about getting it too, does it require to be online most of the times? Or is it just neccessary for stuff like multiplayer?",
                "author": "Low-Comment-5093"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "First Kirby game I ever picked up, I do have fond memories of Kirby Right Back At Ya! Saturday mornings on 4Kids, wasn't expecting to get to six games this fast most I've picked up for switch since probably 2020",
        "score": 67,
        "text_content": "Mario Kart World is on the system",
        "comments": [
            {
                "raw_content": "I love this game. It’s not super hard, but I played it on the Switch and just bought the Switch 2 upgrade this morning. Enjoy it!",
                "author": "Historical-Story4944"
            },
            {
                "raw_content": "Mine too. I have never played a Kirby game before. Its pretty good so far. Just beat the first world",
                "author": "Super_Try_4814"
            },
            {
                "raw_content": "It such a wonderful 3D platformer and I'm glad it's getting more of an audience now.",
                "author": "ScrantonDangler"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Yooka Replaylee can now be fully pre-installed (size: 26.1gb) on Xbox via the Xbox mobile app.",
        "score": 218,
        "text_content": "Shadow drop coming?",
        "comments": [
            {
                "raw_content": "Not sure why this game and the Mortal Kombat collection just don't say when they're going to be released. They're even selling physical pre orders for both games afaik, but with no release date. What's the point of that lol",
                "author": "demondrivers"
            },
            {
                "raw_content": "I’m absolutely getting this, I truly hope this game is to Yooka Laylee what New Super Lucky’s Tale was to Super Lucky’s Tale-much more fully realized, better playing/controlling, extra areas and enhanced/better music. We’ll see!",
                "author": "Bh1278"
            },
            {
                "raw_content": "Kinda excited for this tbh. The OG was a high 6/10 imo",
                "author": "Mako__Junkie"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Kingdom Hearts IV: Possible Worlds List Leak",
        "score": 415,
        "text_content": ">There is an online server where an internal “reliable” insider within the SE team has shared some information about ML, prior to the cancellation of this game. Recently, this SE source has shared this screenshot of an internal SE document showing the list of possible worlds. The insider clarifies that it is this list of worlds was the “initial” one during the early stages of Quattro development. >Because the current development differs a lot from this list, he stresses that Disney has “demanded” that the IPs of those worlds have to pass WDC's quality values. In early SE and WDC meetings, the SE team provides a list of films they “would like” to include in the next KH project and Disney gives their “preliminary” go-ahead. In the following meetings, it is decided whether that world will be confirmed if the “scenario” design is suitable for Disney. So, there are quite a few worlds with the (仮). Also, in those meetings WDC “guides” SE to choose some movie that is not listed, even gives him access to unseen footage of those movies to “facilitate” the development. >There are other listings with quite a few worlds that were discussed by Disney for inclusion in Quattro but were discarded in subsequent internal SE and WDC meetings. >ML was going to have several unreleased worlds from those discard lists but ML was “temporarily” cancelled. >The SE insider says that the team is “working” to recover all the resources and materials that were made in ML for the future of the saga. As a curiosity, he says that Quattro will have some keyblade or heartless from ML. And Disney has already been able to see some of the new worlds and they have been “pleasantly” surprised, even expressing that it looks much better than the original movie. [List of Worlds](https://i.imgur.com/6Kb3qgF.jpeg) [Source](https://boards.4chan.org/v/thread/719236616)",
        "comments": [
            {
                "raw_content": "I’m still waiting for an Emperor’s New Groove world. Make it happen!",
                "author": "mudpiechicken"
            },
            {
                "raw_content": "OK I believe you.",
                "author": "marko910"
            },
            {
                "raw_content": "1. The Final World 2. Quadratum 3. The Mysterious Tower 4. Underworld 5. Moana 6. Not in English, can’t read sorry 7. Game Central Station 8. Niceland 9. Cybug Sector 10. Candy Kingdom 11. Zootopia 12. Metroville 13. Not in English, can’t read sorry 14. Inside World 15. Land of the Dead 16. Not in English, can’t read sorry 17. Galaxy World 18. Scala Ad Caelum 19. Radiant Garden 20. Destiny Island 21. WF",
                "author": "burritoman88"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Nova Lake-S CPU with 28 cores listed in shipping manifest",
        "score": 82,
        "text_content": "",
        "comments": [
            {
                "raw_content": "28 cores? Golly. I am a mere mortal however and would be more than happy with a 12P core only Bartlett Lake. Please Intel?",
                "author": "D4m4geInc"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD Wraith Prism and Spire CPU coolers discontinued for select Ryzen CPUs",
        "score": 289,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I have not seen a full Wraith with a CPU for a while now, nor can I see I see Spires very often, seems all I see are the Stealth which was always a poor cooler. With the price of decent coolers now being so low, I would rather see the chips solid without a cooler a small price reduction.",
                "author": "Mopar_63"
            },
            {
                "raw_content": "It's a shame they're discontinuing the Spire and not the Stealth, that's a slightly better cooler for the current crop of lower end AMD stuff. But I understand the stealth is much cheaper to build and ship out, it's just that it was always borderline e-waste :-/",
                "author": "Dextro_PT"
            },
            {
                "raw_content": "Without competition, amd is doing the exact same shit Intel did with their stock coolers. Remember, amd is not your friend.",
                "author": "stuff7"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "GMP may cause damage to desktop Zen 5 CPUs",
        "score": 166,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What is GMP?",
                "author": "Immediate-Concern-91"
            },
            {
                "raw_content": "> These are supposedly top-quality motherboard (We've had about 50 ASUS motherboard over the years, and only had one failure). They have absolutely terrible VRM Still shouldn't damage the CPU, just kill the motherboard.",
                "author": "SagittaryX"
            },
            {
                "raw_content": "“We don't overclock or overvolt or play other teen games with our hardware.” Bit condescending.",
                "author": "ArrogantAnalyst"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Sapphire teases AMD B850 NITRO motherboard launch to global market",
        "score": 62,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It seems a bit pricey for a B850M motherboard. Not the most expensive, but up there. Have had great luck with their video cards. It will be interesting to see how these sell.",
                "author": "0riginal-Syn"
            },
            {
                "raw_content": "Would look nice with my Nitro 9070xt but that already looks nice with my BTF MSI board 🥀",
                "author": "killercamel1"
            },
            {
                "raw_content": "Damn this would pair really nice with my 9070 Nitro. Wish this was available before I did my build.",
                "author": "Feudal_Poop"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "ASRock releases 3.40 BIOS for AMD 800 series motherboards, addressing \"CPU operating stability\"",
        "score": 54,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Theyve been working on this for a long time and Gamers Nexus has proven that even people with PBO off suffered from it, while asrock said that they blaimed PBO anyway. They did not seem to be looking in the right direction. Im just not sure i trust them at their word.",
                "author": "IamJustDavid"
            },
            {
                "raw_content": "Don't care wanted to buy a b850 from ASRock but I went to MSI b850 maybe next time ASRock (or never) And I know that is just 9800x3d (I think) and don't wanted to risk anything before it's my first Ryzen 9 in using in my life. A 500 € CPU for the first time in my life gets a Mainboard that I can trust for 100 %. MSI b550 worked (still working) for 5 years whit no issues so I go again whit MSI",
                "author": "Swifty404"
            },
            {
                "raw_content": "After one burnt CPU AsRock has lost all credibility to me, I will never buy or recommend their products",
                "author": "tether231"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "30yr Fixed Rates Officially Back to 6.50%",
        "score": 231,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Oh! Yay! Now houses are affordable again. 🙄",
                "author": "TX_AG11"
            },
            {
                "raw_content": "And home sales still at multidecade lows.",
                "author": "jhtyjjgTYyh7u"
            },
            {
                "raw_content": "Price versus income problem, not interest rate problem.",
                "author": "Fuckaliscious12"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The majority of Canadians that own property in the U.S. plan to sell, survey finds",
        "score": 374,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I hope the Chinese do too",
                "author": "survivalnecessities"
            },
            {
                "raw_content": "Stop planning, start selling.",
                "author": "zyqzy"
            },
            {
                "raw_content": "That’s actually great news",
                "author": "Mr-cacahead"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "In a frozen luxury housing market, buyers are asking to 'try before you buy' and having sleepovers in multimillion-dollar mansions",
        "score": 98,
        "text_content": "",
        "comments": [
            {
                "raw_content": "When the real estate agent fails her OF career, she hosts “sleepovers” as an incentive for the millionaire DILF",
                "author": "GTHero90"
            },
            {
                "raw_content": "When you’re thinking about buying an RV they tell you to rent one for a week in the same make/model to get a feel for it. See if the dimensions and layout work for you, if you can even drive it, etc. Why don’t we do the same for housing?",
                "author": "octoberthug"
            },
            {
                "raw_content": "Honestly makes sense to me. You’re about to make the biggest financial decision of your life, you should have all the data you can gather to support. I was looking at a condo with an upstairs neighbor and being able to stay there for a day could have been really useful",
                "author": "Baconknobs"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Surely it'll be fine.",
        "score": 64,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Here's the problem... this is the most optimal situation the average person could ever hope to be in right now. 500k lines up with about the lowest possible amount you can get on a SFH in a popular metro area and ok schools. It doesn't get better than this unless you have a very good deal on rent or somehow get an inside deal on an off-market flipper home (which is risky in itself). You can blame them for taking 40% of income on housing but let's be honest... if they did any less, it's likely for a very distant house or one in a very suboptimal area. People don't have much of a choice nowadays. If there's any advice I'd give them, it's that you don't need to buy the house and the extra living space until you actually have a kid, and even then, you have a few years until you need the space and comfort of a bigger house.",
                "author": "Pumpkin-Main"
            },
            {
                "raw_content": "Am I missing how this is 40%? Is it because it’s multiple homes?",
                "author": "Disgusting_x"
            },
            {
                "raw_content": "At higher incomes this is less of a problem. I’m in a HCOL area and this is pretty common and doable for high earners (200k+).",
                "author": "Crunchthemoles"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "New Zealand’s house prices are finally falling. Could this happen elsewhere?",
        "score": 3,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "U.S. economy expanded 3.3% in Q2, with growth even stronger than initially thought",
        "score": 45,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Expanded 3.3% because of huge drop in imports",
                "author": "ejoalex93"
            },
            {
                "raw_content": "Lmao they just keep lying",
                "author": "VendettaKarma"
            },
            {
                "raw_content": "[removed]",
                "author": "None"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "S&P 500 Hits All-Time Highs (6,501) on Economic Surprise: Markets Wrap",
        "score": 14,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Funny part is US actually has underperformed rest of world (exception of India ) and PE ratio are at record levels for S&P500, shows how big of equity bubble we have right now",
                "author": "Dmoan"
            },
            {
                "raw_content": "non-paywall: https://archive.ph/O1ry4 A solid economic reading drove stocks to fresh all-time highs, but traders refrained from making big bets before inflation data that could bring more clues on the pace of Federal Reserve rate cuts. Short-dated Treasury yields rose. The dollar fell. Just 24 hours ahead of the release of the Fed’s favored price gauge, data showed the US economy expanded faster than initially estimated, underscoring the resilience of America’s primary growth engine — consumer spending. While that helps soothe recession jitters, it raises doubts about the outlook for inflation. A report Friday is forecast to show the personal consumption expenditures price index excluding food and energy rose 2.9% in July from a year ago. That would be fastest pace in five months. “In-line or lower results will likely cement investors’ confidence in a September rate cut,” said Bret Kenwell at eToro. “While a higher-than-expected print may not take a rate cut off the table next month, it could sour Wall Street’s mood as inflation concerns grow.” The S&P 500 hovered near 6,500, and a gauge of volatility hit the lowest since mid-December. Nvidia Corp. pared losses as several analysts raised their price targets despite an uninspiring forecast. The policy-sensitive two-year yield rose three basis points to 3.64%. Swap contracts linked to future Fed rate decisions continue to fully price in one rate cut in October and a second one by year-end. About 20 basis points of easing are priced in for September. Inflation-adjusted gross domestic product, which measures the value of goods and services produced in the US, increased at a 3.3% annualized pace, the second estimate from the Bureau of Economic Analysis showed Thursday. That compared with an initially reported 3% increase. “The economy appears to be on all cylinders, and it should be a boost of confidence to markets that most of the tariff-angst was misplaced earlier this year,” said Chris Zaccarelli at Northlight Asset Management. “However, markets have already priced in a September rate cut and it is important that the inflation data remains restrained between now and then.” As long as the upcoming inflation reports don’t surprise to the upside, the markets should continue their grind higher, he noted. “Although we are concerned about elevated valuations, it hasn’t been prudent to take preemptive action ahead of a downturn,” Zaccarelli said. “The bull market is alive and well and it will take a meaningful catalyst – such as a recession – to derail it.” To Jeff Roach at LPL Financial, the upward revisions to second quarter economic growth raises the bar for the third quarter. “Slowing job growth indicates the economy will not keep up with the above-trend growth from the previous quarter,” Roach said. “Economic growth will likely flatline in the third quarter. Softer growth in the third quarter will add fuel to those calling for rate cuts.” While the latest GDP report provides a bit more clarity, the focus remains on the delicate balance between elevated inflation and a softening labor market, according to Jim Baird at Plante Moran Financial Advisors. Baird noted that Fed Chair Jerome Powell threw an additional lifeline of hope to investors looking for a September rate cut at his Jackson Hole speech last week. Whether policymakers will deliver additional easing in the months that follow is less certain. “Powell’s acknowledgment of the growing risk to the job market appears to open the door to additional rate cuts even though most measures of inflation remain above the central bank’s comfort zone,” Baird said. US initial jobless claims edged down to 229,000 last week, suggesting employers are holding onto current workers amid economic uncertainty. Businesses so far have been reluctant to cut staff on a large scale, but they have pulled back on hiring. At the same time, the elevated number of recurring applications indicates that it is taking longer for out-of-work people to find a job. Meantime, the GDP report also showed the PCE excluding food and energy rose at a 2.5% rate in the second quarter — the same as initially estimated. Given that we are seeing modest attempts of a stock advance in the run-up to the July inflation data, anything other than an unexpectedly high core PCE means that the short-term risks are to the upside, not the downside for the rest of the week, said Steve Sosnick at Interactive Brokers. “Yesterday we wrote about how Nvidia earnings had the potential to either trash or turbocharge major stock indices. So far, it’s done neither,” Sosnick says. “In theory, tomorrow’s Core PCE report can do the same, but traders are assuming that it too will have little impact. That’s probably prudent.” In fact, as for Nvidia analysts are staying bullish on the shares, boosting their price targets even as the world’s most valuable company offered a forecast that underwhelmed investors. Citing the chip giant’s longer-term prospects, at least 10 firms hiked their 12-month price targets after its results Wednesday, raising the average by 3% to $202.60, according to data compiled by Bloomberg. That implies a gain of about 12% from Wednesday’s close. While calm prevailed on Wall Street on Thursday, Adam Turnquist at LPL Financial noted financial markets often shift gears in September, entering a period historically associated with seasonal weakness and increased market instability. Over the last 75 years, the S&P 500 has posted an average drop of 0.7% in September, making it the worst performing month for stocks, Turnquist noted. When September finished in the red, the average loss was 3.8%. This compares to the average gain of 3.2% when September was higher. “Seasonal data represents the typical climate for stocks but not the weather. And currently, the weather for the S&P 500 is filled with blue skies and record highs. When accounting for momentum and trend, September doesn’t look so bad,” he said. When the S&P 500 is above its 200-day moving average going into September, he said the average price return for the month jumps to 1.3%, with 60% of occurrences producing positive results. “We remain confident in the equity outlook and forecast the S&P 500 at 6,800 by June 2026,” said Ulrike Hoffmann-Burchardi at UBS Global Wealth Management. “We think broad, diversified exposure to equity markets should enable investors to participate in AI-driven growth, though we see greater opportunities at a single-security and thematic level.” Her firm recommends investors seek a more balanced exposure across the AI value chain, with a preference now for laggards that offer a more attractive risk-reward tradeoff. Alongside the tech sector, we favor the health care, utilities, and financials sectors within US equities.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "SPY hits daily ATH for the past 3 years. Ain't nobody buying that shit right now.",
                "author": "HUNIMA1"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Pending home sales tick lower in July as canceled contracts spike",
        "score": 29,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"Just 16% of Realtors expect buyer traffic to improve over the next three months, according to the National Association of Realtors.\" And I bet these same 16% are listing houses at the delusional price too",
                "author": "DevilsAdvocateFun"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Photoshop is cooked, Nano Bananas manipulation is insane.",
        "score": 3055,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wow. I was just having a chat with a friend yesterday about the old Stable Diffusion horror photos of people with extra limbs and missing fingers, and I was trying to explain to them how far things have come in such a short time. I'm going to send them this, as it's a really great example.",
                "author": "Calaeno-16"
            },
            {
                "raw_content": "It's pretty good at this, but try to edit small facial details and it's hell.",
                "author": "Mind_Of_Shieda"
            },
            {
                "raw_content": "Considering how much Photoshop costs and all the bullshit subscription models Adobe uses these days, I welcome anything that would cut into their market share or undermine their overpriced products.",
                "author": "JackFisherBooks"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "With respect to the production of pornography, we have split the atom",
        "score": 632,
        "text_content": "Playing around with Gemini 2.5 Flash Image (sorry, not calling it that other name) just now, I felt like Oppenheimer staring at the fireball. Such an enormity of new power, so suddenly. The masturbators of tomorrow will marvel that people were once limited to non-customized pornography. Seriously, I think this changes everything.",
        "comments": [
            {
                "raw_content": "“The masturbators of tomorrow will marvel that people were once limited to non-customized pornography” 😭",
                "author": "A_Public_Pixel"
            },
            {
                "raw_content": "Our grandchildren will never understand how good they have it. Not growing up with customized pornography will be our “walking 1,000 miles in the snow to school”.",
                "author": "RealMelonBread"
            },
            {
                "raw_content": "I am becum death. Destroyer of productivity. ![gif](giphy|6oMhPwjvQc6LAEpEuq)",
                "author": "RoyalCities"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Nano banana outfit for my dog",
        "score": 386,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nano did a great job removing his clothes",
                "author": "i_give_you_gum"
            },
            {
                "raw_content": "Forgot what sub I was and thought it was real smh 🤦",
                "author": "luiskingz"
            },
            {
                "raw_content": "He is a handsome boy.",
                "author": "roofitor"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Being able to edit things with such precision in less than a few seconds by simply typing text would have been unimaginable just a few years ago. Nano Banana is insane.",
        "score": 561,
        "text_content": "It got all of these right in the first prompt. Knowing it will only get better and better from now on is scary.",
        "comments": [
            {
                "raw_content": "We are officially in reality as we know it is breaking down territory",
                "author": "West_Competition_871"
            },
            {
                "raw_content": "Not perfect but MASSIVE progress. Google really cooked. Very cool product.",
                "author": "floodgater"
            },
            {
                "raw_content": "How many layers of clothing can it actually remove? Asking for banana.",
                "author": "RetiredApostle"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The consistency of nano banana is supreme. It's a new era.",
        "score": 203,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's cool, but it's scarier than cool, we have reached a point for some months now or maybe a year where many times it's basically impossible to tell if something is AI generated or not, the implications this will have on the world are crazy",
                "author": "Firm_Intern_2894"
            },
            {
                "raw_content": "\"me\"",
                "author": "Funkahontas"
            },
            {
                "raw_content": "Cool but its airbrushed her too much, no skin texture detail",
                "author": "suiyyy"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Unitree G1 rallies over 100 shots in table tennis against a human",
        "score": 85,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Damn okay, this is one of the first autonomous demos I can remember from unitree and it’s extremely impressive",
                "author": "socoolandawesome"
            },
            {
                "raw_content": "Impressive, I remember a YouTuber making an AI to do this in a simulation of a rag doll body wonder if united had a similar approach to him.",
                "author": "dejamintwo"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "If this is Genie 3, imagine how insane Genie 4 will be",
        "score": 1499,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You'll get paw prints in the sand with Genie 4",
                "author": "fightyourdad"
            },
            {
                "raw_content": "My guess would be real-time VR exploration of spaces",
                "author": "ethotopia"
            },
            {
                "raw_content": "It's kind of crazy that they released Genie 2 just 8-9 months ago and it has this much of an improvement with Genie 3. If we're really in the exponentially improving phase of AI related progress, then we'll see Genie 4 in the not too distant future.",
                "author": "MonoMcFlury"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "People thinking AI will end all jobs are hallucinating- Yann LeCun reposted",
        "score": 666,
        "text_content": "",
        "comments": [
            {
                "raw_content": "People think in absolutes. Including the people who criticize others of thinking in absolutes.",
                "author": "magus-21"
            },
            {
                "raw_content": "Too many people make future predictions with current state like we are done improving. So base on today's 10X slowdown in verification you're saying that it won't replace job in the future. Like it will never get better regardless of the crazy improvements we all saw for the last 3 years. That's very shortsighted imo.",
                "author": "RayHell666"
            },
            {
                "raw_content": "His post reads \"AI won't end all jobs because it can't do that currently\" That's the whole post spread out across 5 paragraphs.",
                "author": "FatPsychopathicWives"
            }
        ],
        "subreddit": "singularity"
    }
]