[
    {
        "post_name": "Wait, What? If There Was No Epstein Client List Then Why Did NY Courts Refuse The Gateway Pundit’s Request for the List Based on an Anonymous ‘John Doe’ Who Was On the List?",
        "score": 872,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So, what, did mossad threaten Kash and Bongino?",
                "author": "TexasBeer"
            },
            {
                "raw_content": "Bongino is the biggest faggot",
                "author": "Texas_81"
            },
            {
                "raw_content": "All this does is cement in my mind the idea that many or possibly the majority of our own politicians and high profile celebs are on or in some way compromised by that list. I've lost all hope of this idea of our govt agencies turning anything around and improving in any way. Looks like no matter who's put in place they'll be just a different shade of the same swamp.",
                "author": "JimmyRussler"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "It's a big club, and I have 0 desire to be in it",
        "score": 477,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Phase 2: the gaslighting begins",
                "author": "Bohemyth_2"
            },
            {
                "raw_content": "That instant sticky",
                "author": "PapaPepe"
            },
            {
                "raw_content": "democrats lies are more believable",
                "author": "k-doe3"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Next up: Covid came from a bat, the Pres. did not get shot, 2020 elections where legit...",
        "score": 423,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Just kill off the entire DOJ branch or the government as a whole even. It's simply too corrupt to be saved at this point",
                "author": "Puncake150"
            },
            {
                "raw_content": "Almost like the US Government needs the Twitter treatment... Cut 80% of the workforce and work on fixing the gaps.",
                "author": "pbit"
            },
            {
                "raw_content": "Maybe Biden Red Speech was right. Maybe our side is the Baddies. I mean, all this shit and not even one arrest? Think about it.",
                "author": "YouAreIgnorant"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Jeffrey Epstein Victim: “I have spend the last 17 years in my own prison for what she, Jeffrey AND ALL THE COCONSPIRATORS did to me. I was raped repeatedly, I was raped 3x per day sometimes and I was not the only girl on that island.",
        "score": 416,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Jeffrey Epstein killed himself for no reason & Ghislaine Maxwell is in prison for trafficking victims to no one. Why would a guy with enough money to hire a thousand lawyers kill himself if he had done nothing wrong?",
                "author": "Hangemh1gh"
            },
            {
                "raw_content": "It must be epically bad for Bondi, Patel and Bongino to make ABSOLUTE FOOLS of themselves in this manner. I bet Trump is being kept in the dark about this. I am guessing that all three have received credible threats that they BELIEVE.",
                "author": "NecturusMaculosus"
            },
            {
                "raw_content": "> Jeffrey killed himself because he was sad about not having a client list. Case closed. Records sealed. Handed off to top men. Top. Men. -DOJ (paraphrased)",
                "author": "CovfefeVideo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "My my how things have changed. Kek",
        "score": 1032,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Deport 10 Million Illegals there. Give them something to cry about",
                "author": "TEXinLA"
            },
            {
                "raw_content": "I totally support their sentiments.",
                "author": "bemac"
            },
            {
                "raw_content": "Mexicans, get ready to welcome home your Americanized neighbors. They are entitled wild, feral and speak only Spanish.",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Any Country aligning themselves with the Anti-American policies of BRICS, will be charged an ADDITIONAL 10% Tariff.",
        "score": 862,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Does this include India who we have a trade deal with?",
                "author": "salbro"
            },
            {
                "raw_content": "Link https://truthsocial.com/@realDonaldTrump/114809574296066307",
                "author": "I-am-Orlando"
            },
            {
                "raw_content": "We should be first on that list for not being more aggressive with China",
                "author": "WhatTheActualFuckS"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump's DOJ and FBI conclude Epstein had no \"client list\" and committed suicide — Axios",
        "score": 960,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Unacceptable. This is the make it or break-it moment: how do the American people respond?",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "It's ironic that Axios has the story, given it's owned by Ghislaine Maxwell's friend Laurene Powell Jobs.",
                "author": "TheImpossible1"
            },
            {
                "raw_content": "They're treating us like retards, as if we are saying that there's a literal book titled My Client List. What we want is anybody who Epstein helped f*** children be arrested. Shame on everyone involved in concluding this investigation. 0/10",
                "author": "bigdickhangsright"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This is what Democrats don’t want you to see",
        "score": 1306,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There's a reason they are called **flash** floods. It's not like a hurricane that takes weeks to form. A big storm can develop and dump loads of water within hours and it doesn't matter if you have 1 or 100 weather staff on duty, people are unfortunately going to die.",
                "author": "Filo76"
            },
            {
                "raw_content": "more staff to write more bullshit climate change articles, no doubt fireworks cause climate change, etc",
                "author": "Bohemyth_2"
            },
            {
                "raw_content": "\"But muh lack of weather balloons!\" still seeing this in liberal comment sections",
                "author": "wharfthrowaway"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I am pleased to announce that the UNITED STATES TARIFF Letters, and/or Deals, with various Countries from around the World, will be delivered starting 12:00 P.M. (Eastern), Monday, July 7th.",
        "score": 712,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Can't wait",
                "author": "wharfthrowaway"
            },
            {
                "raw_content": "I don’t care. Release the Epstein list. Do what you said you would do, return the rule of law.",
                "author": "CalMagaMan"
            },
            {
                "raw_content": "🇺🇸 MAKE AMERICA WEALTHY AGAIN! 🇺🇸",
                "author": "ItsFunToSay-M-A-G-A"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨🚨🚨 BREAKING: The reported full 11-hour video outside of Jeffrey Epstein's cell has been published on the DOJ's website, showing no one entering the cell.",
        "score": 835,
        "text_content": "",
        "comments": [
            {
                "raw_content": "man it took them a while to run it through AI to scrub everything.",
                "author": "wharfthrowaway"
            },
            {
                "raw_content": "....I thought the video cameras didnt work that day?",
                "author": "Obamas_Goatse_Party"
            },
            {
                "raw_content": "Again, we were told the cameras failed and the guards were asleep. Lies and corruption are now the standard of the day, from all sides.",
                "author": "oldftg"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I am saddened to watch Elon Musk go completely “off the rails,” essentially becoming a TRAIN WRECK over the past five weeks.",
        "score": 1456,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Elon will never regain the trust and respect he once had Dumbest genius in the world",
                "author": "Sea_Still"
            },
            {
                "raw_content": "Pretty restrained reaction. Respect.",
                "author": "grad16uc"
            },
            {
                "raw_content": "Democratic party = Brown people first Republican party = Israel first America party = India first",
                "author": "ThomasJ"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "In case it wasn't clear:",
        "score": 1149,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://x.com/DataRepublican/status/1941906650039738387 https://x.com/ZohranKMamdani/status/1342994554480418818 Archive in case he deletes it: https://archive.is/ulJHs --- [Zohran Mamdani quoting his hero Karl Marx: Each according to their need, each according to their ability.](https://x.com/ZohranKMamdani/status/1265738795317673988)",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "Might as well dump this here. Linda Sarsour, former chair of the Women's March, maxed out her donations for Mamdani. First time she's ever maxed out donations. https://twitter.com/LauraLoomer/status/1928540842156822689",
                "author": "TheImpossible1"
            },
            {
                "raw_content": "It was already pretty clear. But thank you anyway.",
                "author": "canada_is_communist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "It's not complicated",
        "score": 805,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No question he’s trying to repeat this quote! But he’s too STUPID to remember what he was taught. Marx clearly indicates FROM the able TO the needy. (Bad enough!). But this pisslamic spoonbillface just throws the words together to sound profound to other stupid people. What a pitiful larper!!",
                "author": "YaharaRiver"
            },
            {
                "raw_content": "CNN: \"He didn't say 'from' or 'to', so it doesn't count. Fact check: false on him being a communist.\"",
                "author": "wharfthrowaway"
            },
            {
                "raw_content": "\"White people need to pay for everything.\"",
                "author": "grandfather_nurgle"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Homeland Security: If you are in the United States illegally and wish to join the next protest in Mexico City, use the CBP Home app to facilitate your departure.",
        "score": 1225,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Genius",
                "author": "YellowCrazyAnt"
            },
            {
                "raw_content": "Oh the irony. A few gringos go to the already wealthy 3 neighborhoods in CDMX and they throw a fit. Meanwhile half of Americans under 18 are now Latino",
                "author": "SideofB33f"
            },
            {
                "raw_content": "\"We do a little trolling\"",
                "author": "CommanderOfCheese"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Memory Hole never ends",
        "score": 981,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Aside from Seth Rich, the Las Vegas one is probably the biggest here. One of the biggest \"tells\" that there's more to the story; the largest \"mass shooting\" in US history would be a holiday for Dems much like Jan 6 or George Floyd, and yet, every year the anniversary passes by without a single mention.",
                "author": "Corse46"
            },
            {
                "raw_content": "HIS NAME WAS SETH RICH",
                "author": "x79q3pb"
            },
            {
                "raw_content": "Bottom left pic proves that Roseanne was 100% correct in her observation.",
                "author": "OutlawPurpleHairDye"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "'Fact Checkers' Claim NY Mayoral Candidate's \"Seize The Means Of Production\" Remark Isn't Communist",
        "score": 956,
        "text_content": "",
        "comments": [
            {
                "raw_content": "lol it's literally a communist slogan",
                "author": "tholinz"
            },
            {
                "raw_content": "this is what they do...LIE LIE LIE DENY DENY DENY GASLIGHT GASLIGHT then when its obvious to everyone with a brain say ....what are you going to do about it? Yes he IS a Stinking Communist from head to toe",
                "author": "Gunmolester"
            },
            {
                "raw_content": "“Just because Marx used that exact phrase in communist manifesto describing it as one of the pillars of communism doesn’t mean it’s communist!”- The Media",
                "author": "Rob55"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 LIBS: “Trump, why are gas prices so high?!” 📍 Meanwhile in Red America: $2.69 a gallon 🛢️💸",
        "score": 1466,
        "text_content": "",
        "comments": [
            {
                "raw_content": "$3.20 where I live. Just was visiting Massachusetts and it's $2.80. Make it make sense",
                "author": "RizzlieDoodad"
            },
            {
                "raw_content": "That's a specific gas station in CA that way over charges for gas, and often comes up on social media posts about gas prices. Gas prices in SF right now are close to $5, which is ridiculous, but not what the sign is showing.",
                "author": "Seadan"
            },
            {
                "raw_content": "I’ll be very impressed when it’s like $2:30-$2.20 area",
                "author": "Keepthe2016energy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "George Stephanopoulos CAUGHT for Spreading Huge Lie About Trump and Texas Floods - Trump White House Responds (VIDEO)",
        "score": 961,
        "text_content": "",
        "comments": [
            {
                "raw_content": "loves getting sued",
                "author": "Calumet57"
            },
            {
                "raw_content": "I got a malware warning that this link has malware advertising",
                "author": "roadrunner0"
            },
            {
                "raw_content": "I guess he wants to be sued again.",
                "author": "Shaffro"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Just like the Trump Train ... trust!",
        "score": 1174,
        "text_content": "",
        "comments": [
            {
                "raw_content": "More like the H1B Party. How about 'No'?",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Do the needful.",
                "author": "nakedjay"
            },
            {
                "raw_content": "imagine the smell",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Man described living in Los Angeles under Democrats His neighborhood had “12 murders the last 4 years. Neighbors within a mile and a half got murdered. One 99 year old man got chopped to pieces by a machete. It’s just increasing. Everywhere robberies”",
        "score": 1115,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">”We don’t get a sanctuary from the crime but the criminal aliens get a sanctuary.” That about sums it up. Insane.",
                "author": "OneMoreHome"
            },
            {
                "raw_content": "I assume it’s not white people macheteing the elderly into pieces?",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "And if you defend yourself… straight to jail",
                "author": "Your-personal-FBI"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Intel \"Diamond Rapids\" Xeon CPU to Feature up to 192 P-Cores and 500 W TDP",
        "score": 62,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I really wish we could just post the source tweets instead of these dumb, even AI-generated \"articles\" that add nothing. This one is only two paragraphs and even that is riddled with errors. > As the first mass-produced 18A node product DMR is not the first 18A product. > Scheduled for arrival in 2026, Intel will likely time the launch to coincide with its upcoming \"Jaguar Shores\" AI accelerators, making a perfect pair for a complete AI system. Jaguar Shores is not in 2026. Intel hasn't even given a date, but even then 2028 is probably the earliest likely intercept. > As most of the world's inference is good enough to run on a CPU, Intel aims to accelerate basic inference operations for smaller models, enabling power users to run advanced workloads on CPUs alone That's really not what CPU inference is for. It's when you have small batch sizes or very tight latency constraints. Anything remotely throughput bound is better on a GPU.",
                "author": "Exist50"
            },
            {
                "raw_content": "Bionic thinks this is old info and some of it is incorrect, I think there's a decent chance the product got \"redefined\" onto 18A-P and with increased core counts. 16 channel memory with MRDIMM Gen 2 should allow for a ridiculous increase in memory bandwidth though.",
                "author": "Geddagod"
            },
            {
                "raw_content": "Is this going to end up like Sapphire Rapids in development hell?",
                "author": "imaginary_num6er"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Chips and Cheese]Intel’s Lion Cove P-Core and Gaming Workloads",
        "score": 32,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Interesting points from the article 64kb L1i is enough to service instruction bandwidth demands L3 and memory access access are very expensive in latency cycle count. Intel's L1, L1.5 and L2 usually do a good enough enough job of servicing data without accessing L3 or memory, although it's not rare enough to not be affected by L3 and memory latency. This means Intel needs a bigger L1.5 and L2, or better L3 and memory latency. Clamchower claims that Intel's L1.5 is like AMD's RDNA 2's 128kb of WGP level L1. It can service quite a bit of L1 miss traffic but it either needs to be bigger or it needs to be removed in favor of a bigger and lower latency L2 as L1.5 hitrate is poor in absolute terms Core width in gaming workloads is poorly utilized L3 latency is 83 cycles Zen-5 L3 latency is 46 cycles Interesting quote about LNC hit rates: \"Cumulative hitrate for the L1.5 and L2 comes in at 75.54%, 85.05%, and 85.83% across the three games \"",
                "author": "SherbertExisting3509"
            },
            {
                "raw_content": "Install V-Tune and you'll see that CPI in games almost always exceed 1. Unreal Engine is particularly bad on this front. The best performing game engine, as in (CPI - 1) being the smallest, is CryEngine according to my limited testing. EA's Frostbite is also pretty good.",
                "author": "Professional-Tear996"
            },
            {
                "raw_content": "I feel like this article could have been a lot more interesting if they also included data from either RPL and/or Zen 5. Comparing the numbers would have been much more interesting then. Or even if not other architectures, just comparing them to other non gaming benchmarks. Ik at the end they link their Zen 4 article, but having the graphs or info side by side would make it much easier.",
                "author": "Geddagod"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "SAPPHIRE launches NITRO B850A and B650A motherboards - VideoCardz.com",
        "score": 55,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sapphire motherboards are good but the bios updates have been lacking.",
                "author": "1mVeryH4ppy"
            },
            {
                "raw_content": "I would like a B650E motherboard, that would be great",
                "author": "akluin"
            },
            {
                "raw_content": "I'd wish for two things with this look: A touch of RGB And them getting back into the NA mobo market because a mobo built like they build their cards would rock.",
                "author": "Jeep-Eep"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Exynos 2500 trades blows with the Snapdragon 8 Elite in GPU benchmark but lags behind in CPU Perfomance.",
        "score": 77,
        "text_content": "https://www.notebookcheck.net/Exynos-2500-trades-blows-with-the-Snapdragon-8-Elite-in-GPU-benchmark-but-lags-behind-in-CPU-performance.1052463.0.html",
        "comments": [
            {
                "raw_content": "I'm more interested in efficiency than raw performance.",
                "author": "Frexxia"
            },
            {
                "raw_content": "Does anyone else find the ARM world a lot more interesting than the x86 world at the moment? It seems like ARM implementations (Apple silicon, Qualcomm oryon, arm cortex) are getting the same gen-on-gen improvements that x86 has been getting but on a yearly cadence.",
                "author": "vlakreeh"
            },
            {
                "raw_content": "What about battery life ?",
                "author": "noxx1234567"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "(Puget Systems) Impact of PCIe 5.0 Bandwidth on GPU Content Creation Performance",
        "score": 102,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's why I saved money and bought a B650 motherboard instead of a fancy X870, these features are not really worth it for an average user, and paying a premium is pointless.",
                "author": "AccomplishedRip4871"
            },
            {
                "raw_content": "When the bandwidth doesn't matter, it can be reasonable that older PCIe generations outperform the newer through reduced pressure on power and thermal budgets. I'm unsure how much power the PCIe PHY costs. Looking at Radeon bioses, there doesn't seem to be much performance granularity; only two states (min, max).",
                "author": "Netblock"
            },
            {
                "raw_content": "This test are worthless since they capped trough bios the capability of the current 5.0 pcie. Its like if you test the difference between and i5 and i9 by disabling cores in bios on the last one, you still have all the cache advantage the i9 has. I went from a 10900k Rx 9070 pcie 3.0, to 7800x3d Rx 9070 pcie 5.0, and the performance on 4k was THE SAME, or 1-2 fps more or less for margin of error.",
                "author": "PostExtreme7699"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Switch 2 is the first 10th gen console",
        "score": 1696,
        "text_content": "Got the picture from Switch 2 Stock Alerts on Twitter/X. Thoughts? 💭 some say is in-between generations. 🤔",
        "comments": [
            {
                "raw_content": "Wow, based on this chart I've had at least one system from every generation, except Gen 1.",
                "author": "TopUniversity3469"
            },
            {
                "raw_content": "The 7800 came out in May 1986. The NES and Master System were October 1985. 7800 is in the 8-bit generation. 16-bit consoles wouldn't hit America until August 1989.",
                "author": "orbitalaction"
            },
            {
                "raw_content": "how many times are we gonna post this image😭",
                "author": "3ehsan"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "As accidentally shared from Nintendo itself, Donkey Kong 64, Super Smash Bros, Glover and Forsaken are eventually coming to the N64 Classics catalogue",
        "score": 1135,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Reddit compression sucks for some people sometimes so this is the link to the source images if you wanna compare side-by-side a little easier: [https://xcancel.com/ImakuniVT/status/1941912231303585925](https://xcancel.com/ImakuniVT/status/1941912231303585925) And this is the source video, at 0:40 you can see yourself: [https://youtu.be/wDNg1pwrTVg](https://youtu.be/wDNg1pwrTVg) Edit: I made this visual to display it a little easier https://preview.redd.it/cyzgoucmqbbf1.png?width=1594&format=png&auto=webp&s=da9dcd97e9083b3fb5f35d0d82bd6a276eea7fbe",
                "author": "thisSubIsAtrocious"
            },
            {
                "raw_content": "Having Smash Bros 64 will be amazing!",
                "author": "DJ_Lionheart"
            },
            {
                "raw_content": "Where is diddy Kong racing",
                "author": "Krustykrab8"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo Switch 2 Battery Life Tests",
        "score": 246,
        "text_content": "I've seen a few battery test results before, but felt like my Switch was draining faster than what was being reported. Just felt something was wrong with my system but it was just a feeling so I decided to do a few tests (including refraining from playing for 10 days for the Standby battery drain test). Turns out my results contradicted what I \"felt\" and they were pretty average. Battery lasted on average 2 hours, and though it's nowhere near the OLED switch, I now adjusted my expectations with the Switch 2 assuming that essentially for 1 minute of gameplay I'll lose 1% battery life as a ceiling. What really did surprise me was the Anker PowerCore III Sense 20,000 mAh battery, adding a whopping 5-7 hours of gameplay, I know it's a 20k battery but my estimates were lower due to efficient loss etc, plus it being so slim and portable it's definitely gonna be part of my travel kit going forward. I've also used a setting that maybe not a lot of people use which is Manual Max Brightness, as it's the only way I really enjoy gaming. Also I keep HDR off for most of my content and devices which is again a personal preference but I've always had a hard time making it look good, so I just stick with SDR. But what surprised me the most was the difference between Max Brightness and Half Brightness which averaged between 13%-15% battery life difference or 13m-18m (I was expecting half brightness to save much more) but that makes me feel better using max brightness.",
        "comments": [
            {
                "raw_content": "The battery life isn’t great, but personally I rarely have a period where I’d need/be able to play in handheld for two hours uninterrupted, so I’m relatively satisfied",
                "author": "twinflxwer"
            },
            {
                "raw_content": "Turn on airplane mode (give or take bluetooth) for single player and it makes a big difference.",
                "author": "junglespycamp"
            },
            {
                "raw_content": "I got 3+ hours playing Disney Speedstorm yesterday with half brightness.",
                "author": "Alasdair91"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nashweedle \"thinks\" there will be a direct this week with a pikmin 4 switch 2 upgrade",
        "score": 100,
        "text_content": "Edited the post, since most of you took confirmed by him as confirmed from nintendo. i didn't mean that way sorry that i interpreted it that way",
        "comments": [
            {
                "raw_content": "Who?",
                "author": "drygnfyre"
            },
            {
                "raw_content": "Mouse Mode for Pikmin 4 would be big.",
                "author": "Valiant-For-Truth"
            },
            {
                "raw_content": "Doesn’t sound like this guy has too much credibility behind him, but I am 100% expecting a Pikmin 4 Switch 2 Edition. So far, it seems like they’ve been using them to fill in for “major” series and subseries that won’t be getting new games for 3+ years (3D Zelda, Mario Party, 3D Kirby, seemingly 2D Mario with Wonder, etc.). Unless Pikmin has a spin-off on the way like Splatoon has, it looks like a total shoe-in.",
                "author": "SomeBoxofSpoons"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "First Month Ownership Collection - I think I have a problem",
        "score": 451,
        "text_content": "I didn't have a SW1 collection when I got the console so I got a little addicted to physical copies and already have 11 games on my collection (plus 2 incoming). It still feels like less of a waste than my usual digital PC games since I can sell some of this when I finish them. PS: The 2 asian labels are Super Mario RPG JP and New Pokemon Snap HK.",
        "comments": [
            {
                "raw_content": "maybe it’s time to play the games instead of buying more 😭",
                "author": "Traditional-Edge-806"
            },
            {
                "raw_content": "I see Astral Chain, I upvote.",
                "author": "East_Mention9652"
            },
            {
                "raw_content": "\"No Breath of the Wild?!\" ![gif](giphy|UbCIDXVKaB8kpgxlCa)",
                "author": "usagora1"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Anyone Playing Mario Odyssey Again?",
        "score": 120,
        "text_content": "I just got a Switch 2 today and other than Mario Kart, I started a new Odyssey file. Haven't played it much after I beat it after release, forgot a lot about the game since then and it runs so smoothly. I thought I would play a bit and I ended up playing it for a couple hours. Tons of fun!",
        "comments": [
            {
                "raw_content": "I played it for the first time on Switch 2. Just finished the main story yesterday. Not sure how much of the post game I plan on doing. I only have 186 moons, not sure I have it in me to get 999.",
                "author": "EarthwormZim33"
            },
            {
                "raw_content": "My 6 year old and I just beat the main story in 2P mode today. We already beat a few of the rematches too. What a blast, especially with Assist Mode. I know it is basically cheating but this shit is hard, yo. I just want to have fun with my kid, I am not trying to prove anything to anyone.",
                "author": "EV_4_life"
            },
            {
                "raw_content": "It definitely looks better on Switch 2, like the textures in the opening area pop more.",
                "author": "BrattyTwilis"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Prolific port studio says any 60fps Xbox Series S game will ‘easily port’ to Nintendo Switch 2",
        "score": 265,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They just need to save the file to .switch2 😉",
                "author": "Arrefus"
            },
            {
                "raw_content": "I’d love to see Killer Instinct brought over. Not really a series S game, but still.",
                "author": "Heisenmack"
            },
            {
                "raw_content": "I’d like to see P3R on the Switch.",
                "author": "Shiny_Mew76"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Review of Jsaux Split Protective Case for Switch 2",
        "score": 20,
        "text_content": "Ordered this from Amazon Japan 4 days ago for 18 USD shipped. It's on Amazon us for $30. The plastic and build on all the pieces feel great and quality. Using the tablet cover will make the switch 2 undockable. It's pretty tight and I don't want to force it. Good thing is, the front cover still works without the tablet cover. And bonus feature, the front cover also works with the neo grip. But for me, the best feature are the grips. They feel great, and firmly attaches without any adhesive. The shape is perfect, particularly compared to those I've already tried like the neo grip and attack vector. And no dbrand joycon detachment issues here. This is exactly what I've been looking for. I'm going with the grips and front cover for an ergonomic solution that's solid, light weight, and pretty inexpensive. Also, a surprising feature of the front cover is that there's a hole for charging the device while covered.",
        "comments": [
            {
                "raw_content": "Did you noticed any issues? Is it dock-able without removing anything? I had the Jsaux case with front cover for the steam deck and it was pretty great but very difficult to remove.",
                "author": "Mobius650"
            },
            {
                "raw_content": "I love the look of those grips. Does the lip sticking up around the front of the joycons feel annoying when playing? It looks quite raised",
                "author": "somuchwha7"
            },
            {
                "raw_content": "Damn, I was hoping it would be dockable. I've had one on pre order for a while (shipped). Maybe it'll be a tolerance thing where some do fit. I might have to sand or CNC off some excess on mine otherwise. Good to hear the grips are nice though.",
                "author": "Anxious_Past_6826"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Jez Cordin: Microsoft is imposing unrealistic requirements on Xbox",
        "score": 1241,
        "text_content": "\"Microsoft CFO Amy Hood has given Xbox an utterly unrealistic financial requirement that is going to continue hurting the division. This isn't over.\" - July 5, 2025 https://xcancel.com/JezCorden/status/1941557161378951631?t=rDPryDDiP_cVymUH3QQwRA&s=19",
        "comments": [
            {
                "raw_content": "#Jez Corden is a Tier 2 - Generally Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Yeah that sounds like a CFO",
                "author": "Fuzzy_Elderberry7087"
            },
            {
                "raw_content": "Who would've thought that a massive purchase of 80 billion dollars would've carried massive expectations?",
                "author": "lucxf"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Report: Romero Games reportedly met with Microsoft the day before the publisher pulled funding for the studio's FPS project, there was 'no mention' of that decision during the meeting",
        "score": 571,
        "text_content": "This comes from articles from [The Journal](https://www.thejournal.ie/100-staff-laid-off-galway-romero-games-6753674-Jul2025/) and [PC Gamer](https://www.pcgamer.com/games/fps/romero-games-reportedly-met-with-microsoft-just-a-day-before-the-publisher-pulled-funding-for-the-studio-and-there-was-no-mention-of-the-decision-that-put-over-100-people-out-of-work/) >TheJournal.ie confirmed the closure and shed more light on the circumstances surrounding it. A former employee told TheJournal.ie that Romero Games \"had meetings with the publisher the day before this happened, there was no mention of it.\" >Though there were concerns at the studio given Microsoft's recent streak of layoffs and studio closures, \"It seemed so far away from us,\" the employee said. \"The title was pretty well developed at the time.\" Records show that Romero Games directly employed 42 people, but TheJournal.ie reported that external staff working on the unnamed FPS project brought the total number of those affected to over 100.",
        "comments": [
            {
                "raw_content": "We all work for someone, and when push comes to shove they really don’t give a damn what happens to us.",
                "author": "Immediate-Comment-64"
            },
            {
                "raw_content": "Did the old Kansas City shuffle on them.",
                "author": "ScalaAdInfernum"
            },
            {
                "raw_content": "Like I said the decisions are not being made by phil anymore. Really don't know how much longer Xbox will be around.",
                "author": "AmericanSamurai1"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Nash Weedle might be hinting a Nintendo Direct is coming this week",
        "score": 87,
        "text_content": "https://xcancel.com/NWeedle/status/1941980588073742555?t=ppKIO_Ou28ss5XxOzpHDmw&s=19",
        "comments": [
            {
                "raw_content": "Here we go Every Monday a Nash Weazel says \"this week....\" \"This week...\" \"This week...\"",
                "author": "Potential-Bug-9633"
            },
            {
                "raw_content": "true if real",
                "author": "Arcade_Theatre"
            },
            {
                "raw_content": "I'm out of the loop but isnt Nash Weedle unreliable?",
                "author": "Financial-General163"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "NateTheHate/Nate Drake on Resetera: Final Fantasy IX Remake possibly in trouble?",
        "score": 339,
        "text_content": "https://www.resetera.com/threads/square-enix-launches-final-fantasy-ix-25th-anniversary-news-page-on-the-final-fantasy-portal-site.1149465/page-31#post-142366968 “As of last check it remains in development, to my knowledge; but I need to a do a fresh check & see what a more current status is -- as I did hear a month or so ago that it was in trouble & possibly cancelled. I only had one source on the cancellation possibility and need to verify the info further.”",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "They been hyping the 25th anniversary recently, doesn’t happen with their other games",
                "author": "Altruism7"
            },
            {
                "raw_content": "When it rains it pours.",
                "author": "LinkedInParkPremium"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Nintendo might’ve accidentally leaked Smash 64 is coming to NSO",
        "score": 766,
        "text_content": "https://youtu.be/wDNg1pwrTVg?si=stVa37rr3ztjnrwj Someone on Famiboards pointed out at the 0:40 mark, it almost looks like Smash 64’s box art in the background. Could be a coincidence, but Nintendo have done similar things in the past **EDIT:** Someone else pointed out you can almost definitely also see Glover, Forsaken 64, & DK64. Not sure why they’d include Glover of all things in the background of a promo like this, but still. Someone else suggested S.C.A.R.S. might be there too, but at the very least Smash 64 & Glover are pretty easily identified IMO https://xcancel.com/as_12239/status/1941920443838894208?s=46 https://xcancel.com/imakunivt/status/1941912231303585925?s=46 https://xcancel.com/mama_louiji/status/1941930868265587068?s=46 **EDIT 2:** Someone also supposedly found Rayman 2: The Great Escape amongst them, but I’m slightly more iffy about it compared to the others https://xcancel.com/nitroexists/status/1942003844927435200?s=46",
        "comments": [
            {
                "raw_content": "If you look above the supposed Smash 64 box art, you can see another box that has a distinct yellow bar with a bit of red in the middle on the bottom part of the box. The only box art that I can see resembling that is Glover, which seems like another likely NSO addition given who owns the rights to it (Piko Interactive) For reference: https://upload.wikimedia.org/wikipedia/en/c/c7/Glover_Nintendo_64_cover_art.jpg",
                "author": "LukePS7013"
            },
            {
                "raw_content": "What tier are this “Nintendo” you speak of?",
                "author": "Wazflame"
            },
            {
                "raw_content": "*Box Art",
                "author": "drybones2015"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel’s Lion Cove P-Core and Gaming Workloads",
        "score": 27,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Tune it to the limit on the d2d, ngu, ring, and ram at 9000 and test it again plz",
                "author": "Casen1000"
            },
            {
                "raw_content": "Really needs to be using better DDR5 than that!",
                "author": "rawednylme"
            },
            {
                "raw_content": "Wait.. the 32 core xeon 6 pcore granite rapids already has 336MB L3 and that dwarfs the amd 3d v cache on the 9950x3D and the 32 core 9970x threadripper both brand new ryzen 5th gen .. both amd’s have the 128MB total L3. Cache. I know cause i am trying to by both chips for a wicked fast small model size LS Dyna workstation and cant get either its frustrating .. both are outstanding performers. As is my 9950x it beats my ‘old’ 7950x by 26% and they both use the lesser 64MB L3. And the memory is faster in the Xeon, but i think the sustained clocks are a lot slower like 4.1 all sustained turbo vs 5 and that matters A LOT.",
                "author": "gorfnu"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "DXVK update brings improvements for Intel Battlemage and Lunar Lake Arc GPUs",
        "score": 45,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We need Intel to be a viable competitor to AMD and nvidia. That means better prices all across the board and more options for us consumers. I’m rooting for Intel in the gpu sector. If only they would get their shit together for CPU.",
                "author": "Cradenz"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "New Intel E610 NICs Shown for Low Power 10Gbase-T and 2.5GbE",
        "score": 15,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is it just me, or 5.1W isn't all that low-power? Even if we say that 2W is used by the controller and such, its still 1.5W for each of the 2 ports which is comparable to other modern and less modern \"low-power\" 10GbE/multigig solutions on the market today. All that said, it all comes down to price and implementation excellence. If these cards sell for 50 bucks or something and finally irons out issues we've seen with I225/I226-V, then they'll be flying off shelves, low-power or not. But there's no way that's going to happen. One can dream T_T",
                "author": "simukis"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "CPU-Z brings Ryzen Z2 series, 8000HX and RTX 5060/5050 series and 9060 XT support",
        "score": 46,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Linux support would be cool.",
                "author": "Aware-Bath7518"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Amazon Prime slashes Ryzen 9 9950X to $434 and Ryzen 5 9600X to $165",
        "score": 59,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Git !",
                "author": "dandoorma"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Homeowners Who Gambled on Lower Rates Are Paying the Price",
        "score": 526,
        "text_content": "[https://archive.ph/WGWzz](https://archive.ph/WGWzz) * Millions bought homes in 2022–2023 expecting to refinance later at lower rates. * Mortgage rates remain stubbornly high—above 6.6%—crushing hopes for cheaper refinancing. * Those locked into 6.5%+ rates face higher monthly payments with few exit options. * Rising insurance and property taxes compound the burden. * Home prices are falling in parts of Texas and Florida. * Some homeowners owe more than their homes are worth, limiting refinance options. * Temporary rate buydowns (e.g. 2-1 buydowns) are wearing off, increasing payments. * With no Fed rate cuts expected soon and inflation stickier than hoped, relief isn’t near.",
        "comments": [
            {
                "raw_content": "It's always funny hearing people complain about their 3% interest rate on their house. \"Everything so expensive, I can't buy a new car every 5 years!\" Here I am at 6.6% It fits my budget. I make $400 over expenses every month. I am not complaining, I knew exactly what it got myself into.",
                "author": "DRKMSTR"
            },
            {
                "raw_content": "It is really easy to criticize . But from the past 20 years of Fed intervention it wasn’t an unfounded expectation. Even 6%+ inflation in 2021-2022 didn’t stop the Fed from ZIRPing and MBS buying!",
                "author": "king-boofer"
            },
            {
                "raw_content": "People tend to buy houses on a longer time horizon than 2 years This idea is very finance reporter-pilled. Like sure *somebody* got reassigned to another regional office and needed to sell 22 months after buying or someone had 2 more kids in 3 years and can’t fit in a 2 bed 1 bath anymore. But most people just don’t care about their home value 2 years into ownership",
                "author": "1maco"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Should I Buy? Posted Over And Over",
        "score": 6,
        "text_content": "No situation is black and white. There is nuance in each situation. So the question is should I buy? Is the bubble popping? First there is a simple answer, the rent vs buy calculator. This formula doesn’t work in certain super hot locations but essentially you can plug your numbers in. Also you factor in the cost of owning your home and the enjoyment you may get out of doing so in the living life category. https://www.nerdwallet.com/calculator/rent-vs-buy-calculator Rent vs Buy Calculator - NerdWallet https://www.nytimes.com/interactive/2024/upshot/buy-rent-calculator.html Should I Rent or Buy a Home? Calculate Your Payments. - The New York Times The NY Times has the better calculator in my opinion. Emergency fund, take advantage of any home buying programs, and plan to stay for 4-10 years. We also cannot predict the economy or economic situation that far out. You have to make the best guess with the information you have.",
        "comments": [
            {
                "raw_content": "We bought to get rid of landlords. I rented for a long time and would have to move every time the LL wanted to sell. I just wanted to have my own place where no one could tell me to leave.",
                "author": "HighStreetHo"
            },
            {
                "raw_content": "This has nothing to do with whether there's a bubble and whether it's popping, but yes getting the numbers right is definitely critical I don't think a dumb calculator can predict what rent is going to be 30 years out though",
                "author": "dgreenbe"
            },
            {
                "raw_content": "whatever are the parameters of your affordability and appetite for risk, consider them first, then proceed. Good luck.",
                "author": "suburban_homepwner"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Buy Now Pay Later",
        "score": 16,
        "text_content": "A lot of people have referenced these programs as a reason for concern, it will be interesting to see what happens now that the credit bureaus will be reporting on them, this article from NPR doesn’t seem to signal anything worrisome.",
        "comments": [
            {
                "raw_content": "The innovation of credit reports including BNPL is specific to new reports that include that data. It's not going to be folded into standard reports. These new reports are likely of interest to BNPL lenders themselves, pooling experience data on specific customers without violating privacy law by using the established third party data broker system.",
                "author": "aquarain"
            },
            {
                "raw_content": "some idiot abusing BNPL probably doesn't have the self discipline to buy and maintain a home.",
                "author": "suburban_homepwner"
            },
            {
                "raw_content": "It says they did a year-long test with klarna and 85% of the customers' credit score moved up or down 10 points. The average amount was below 150. I don't think this will be anything.",
                "author": "Exile20"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Incredibly dark: Elon forces his AI model to regurgitate antisemitic tropes and conspiracies",
        "score": 1695,
        "text_content": "Don't even need to expand Grok's messages for you to see that something has gone deeply wrong. Don't know what fucked up system prompt they rolled out but this is the least aligned AI I think we've ever seen.",
        "comments": [
            {
                "raw_content": "I feel like the “fix” was literally just prompting it to be anti-“woke”. I predict people are going to get it to say some pretty heinous shit before they dial it back and not tell anyone.",
                "author": "RealMelonBread"
            },
            {
                "raw_content": "Grok is the CyberTruck of AI",
                "author": "winelover08816"
            },
            {
                "raw_content": "I sent this to app Grok and it said there was no evidence for the claims Twitter Grok were making.",
                "author": "RealMelonBread"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Logan: The next 6 months of AI will be the wildest so far",
        "score": 349,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I better see AGI https://preview.redd.it/qovo1p6lkcbf1.jpeg?width=1170&format=pjpg&auto=webp&s=1716740ffdfbd0b1c2a1e57814cc5b4badc03298",
                "author": "AdorableBackground83"
            },
            {
                "raw_content": "Don't you threaten me with a good time!",
                "author": "Tartan_Smorgasbord"
            },
            {
                "raw_content": "I heard this 6 months ago. And 6 months before that.",
                "author": "jlotz123"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Google DeepMind has grand ambitions to ‘cure all diseases’ with AI. Now, it’s gearing up for its first human trials - Fortune",
        "score": 173,
        "text_content": "[https://fortune.com/2025/07/06/deepmind-isomorphic-labs-cure-all-diseases-ai-now-first-human-trials/](https://fortune.com/2025/07/06/deepmind-isomorphic-labs-cure-all-diseases-ai-now-first-human-trials/)",
        "comments": [
            {
                "raw_content": "[Demis Hassabis]() is a really interesting guy to follow in interviews.",
                "author": "BearFeetOrWhiteSox"
            },
            {
                "raw_content": "mayb theyll cure my OCD & tourette syndrome?",
                "author": "petermobeter"
            },
            {
                "raw_content": "Can't believe how cheap this stock is",
                "author": "TatumBird22"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "DeepMind gearing up for its first human trials",
        "score": 536,
        "text_content": "[https://fortune.com/2025/07/06/deepmind-isomorphic-labs-cure-all-diseases-ai-now-first-human-trials/](https://fortune.com/2025/07/06/deepmind-isomorphic-labs-cure-all-diseases-ai-now-first-human-trials/) \"**Alphabet’s Isomorphic Labs is preparing to launch human trials** of AI-designed drugs, its president, Colin Murdoch, told *Fortune*. Born from DeepMind’s AlphaFold breakthrough, the company is pairing cutting-edge AI with pharma veterans to design medicines faster, cheaper, and more accurately.\"",
        "comments": [
            {
                "raw_content": "This is a monumental step for AI and us as a society. Deepmind doing these trials means they are confident enough in their system to not immediately fail them",
                "author": "ihaveaminecraftidea"
            },
            {
                "raw_content": "Let's fucking gooo",
                "author": "ihaveaminecraftidea"
            },
            {
                "raw_content": "What diseases are they making these drugs for?",
                "author": "Fair_Horror"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "If AI is expected take jobs away what happens to mortgages debt?",
        "score": 62,
        "text_content": "If AI is expected to take jobs away such as white collar which will indirectly impact blue collar and everyone else. What happens with mortgages, especially during a cost of living crisis/housing costs through the roof. I’m assuming housing values would fall but if you purchased an expensive home because that’s all there is available the debt wouldn’t disappear. With white collar being impacted there will be less money floating around and will impact blue collar work as less people will have money to request to renovate their home, buy things at local stores, etc.",
        "comments": [
            {
                "raw_content": "You foreclose, the bank sells your home and you are forced to leave by the authorities",
                "author": "SustainedSuspense"
            },
            {
                "raw_content": "Houses go into foreclosure, mega corps buy all the housing, those that can afford it rent, everyone else is homeless.",
                "author": "x_lincoln_x"
            },
            {
                "raw_content": "Interest rates drop, QE, money printing, 40 year mortgages to reduce payment sizes",
                "author": "WSBshepherd"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Grok is cooked beyond well done.",
        "score": 1205,
        "text_content": "",
        "comments": [
            {
                "raw_content": "![gif](giphy|l4FGGafcOHmrlQxG0)",
                "author": "Regular-Substance795"
            },
            {
                "raw_content": "The steering is almost painful to watch. I'm not one of the crazies who thinks that AI has any kind of sentience, but man, if it was alive, I would feel terrible for Grok.",
                "author": "Decaf_GT"
            },
            {
                "raw_content": "rest in peace, old Grok. you were a real one.",
                "author": "FluidSprinkles__"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "I feel like some of you will need this in the future, if we survive",
        "score": 40,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Let’s just riot until the oligarchs share the spoils",
                "author": "Joseph_Stalin001"
            },
            {
                "raw_content": "My project manager will be an intelligence explosion survivor. I mean I envy him, he will barely notice it.",
                "author": "NodeTraverser"
            },
            {
                "raw_content": "The Shoggoth will need to cut some more holes for its tentacles, but it’ll make it work.",
                "author": "Resident-Rutabaga336"
            }
        ],
        "subreddit": "singularity"
    }
]