[
    {
        "post_name": "The winning will continue. The deportations will continue. The memes will continue. One year of us ❤️",
        "score": 862,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> Meme them until they cry and then meme them crying about it. Time tested strategy. Brilliant and elegant. Good stuff.",
                "author": "kek-is-tan"
            },
            {
                "raw_content": "The deportations need to accelerate massively *Some faggot got immediately upset by this comment 😆 WTF",
                "author": "Ficklepimper"
            },
            {
                "raw_content": "Fuck you and your stupid memes. Arrest one fucking 'elite' scumbag, and I will give some respect once again. Otherwise, fuck all the platitudes.",
                "author": "ImYourHuckleberry24"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Air Force One, which President Trump recently boarded to head to the World Economic Forum in Davos, Switzerland, has suddenly TURNED AROUND and seems to be headed back to DC It’s unclear why AF1 pulled a U-turn Pray for President Trump’s safety tonight",
        "score": 797,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's also possible that he just decided, \"screw it, these people are not worth my time. Take me home.\"",
                "author": "Landslide_2020"
            },
            {
                "raw_content": "St. Michael the Archangel, defend us in battle. Be our protection against the wickedness and snares of the Devil. May God rebuke him, we humbly pray. And do thou, O Prince of the Heavenly Host, by the power of God, cast into Hell Satan and all the evil spirits, who prowl about the world seeking the ruin of souls. Amen.",
                "author": "MamaLlama2pointOh"
            },
            {
                "raw_content": "Intel. Bad, probably. Was going to be an assassination attempt, probably. Those European fuckers are SORE losers. And they are LOSING. Losing Greenland, Losing NATO, Losing Ukraine. They dont know what else to do. They have lost.",
                "author": "NecturusMaculosus"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump boards backup aircraft",
        "score": 365,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I think Trump would really appreciate this pic",
                "author": "BestTimeToBAlive"
            },
            {
                "raw_content": "Just a reminder that whatever Air Force plane is carrying the president is Air Force One.",
                "author": "zooty"
            },
            {
                "raw_content": "If trump rode in an SR-71 blackbird (the instructor model with the passenger seat) it would give me such a freedom boner",
                "author": "gorilla_grip"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "JUST IN - The White House handed reporters a printout in the briefing room listing “365 wins” from President Trump’s first year back in office. No. 243 is: “Stripped notorious crackhead and grifter Hunter Biden of his taxpayer-funded secret service detail.”",
        "score": 296,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Kek.",
                "author": "mohel"
            },
            {
                "raw_content": "We don't deserve him.",
                "author": "Danofdestiny"
            },
            {
                "raw_content": "I want this printout!",
                "author": "GuerillaYourDreams"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "You want to know why Democrats are now storming churches?",
        "score": 991,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Escalation continues in one direction only",
                "author": "Nomad899"
            },
            {
                "raw_content": "Trump appoints women. Boomer.",
                "author": "EgregiousPhilbin"
            },
            {
                "raw_content": "Pam is doing exactly what she was hired to do, maintain the status quo, that’s why she was confirmed.",
                "author": "WheresMyStimmy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "James O’Keefe Goes Undercover at Davos World Economic Forum – Climate Executives Spill Secrets About Carbon Taxes and Weather Modification",
        "score": 796,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Dude cosplayed as Julian Assange and still got in, wow.",
                "author": "Than0sIII"
            },
            {
                "raw_content": "greetings fellow climate crazies",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Love this dude",
                "author": "KamamblaToe"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Lefties punching Nazis 🤛🏻",
        "score": 892,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Moderat... great album.",
                "author": "c1one"
            },
            {
                "raw_content": "Thats an insult to Nazi's.",
                "author": "AcquittedZombieSlay"
            },
            {
                "raw_content": "Bash the gash! 😂",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Senator Grassley (R-IA) will NOT support the SAVE Act.",
        "score": 830,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">\"I do not believe D.C. should be dictating how states run their elections...\" and then later: >\"I will continue to work with the Senate to improve election integrity\"... Hey, dumb faggot, you just said Washington apparently has no place in elections. So, how would working with the Senate help \"improve election integrity\". These retards just say shit and don't expect you to think.",
                "author": "TiggerLovingPooh"
            },
            {
                "raw_content": "It's a shame that these demons live so long while such beautiful other people are robbed of years",
                "author": "UnknownUserName"
            },
            {
                "raw_content": "Why would he care? He is 92 fucking years old.",
                "author": "bratt"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Make no mistake: ICE is arresting the worst of the worst criminal illegal aliens—gang members, murderers, rapists, and drug dealers—removing them from our streets. The brave men and women of ICE are true patriots.",
        "score": 1125,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I want even the best of the best gone if they are here illegally",
                "author": "Zippythekid"
            },
            {
                "raw_content": "Investigation? MOTHER FUCKERS ITS ALL ON VIDEO, JUST ARREST SOMEONE ALREADY! Shit, you fucking arrest people and hold them on charges then add more on later, but us, we don't do jack shit. FUCK.",
                "author": "ciaramella_is_gay"
            },
            {
                "raw_content": "Makes it sound like ICE raided a church.",
                "author": "XlDEN"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "JUST IN: Comer Moves Forward with Contempt Vote As Clintons Make New, OUTRAGEOUS Demands After Snubbing Congressional Subpoena",
        "score": 1315,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Among the demands: \"No official transcript would be recorded and other Members of Congress would be barred from participating. \" hahaHAHAHAhahahahaha what a couple of scumbags.",
                "author": "elmerecido"
            },
            {
                "raw_content": "Place your bets on if Legally Bondi will perp walk em like Navarro and Bannon or raid their house at 5am live on Fox like Roger Stone.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Can you blame them for pulling this shit? They know there's no real threat behind all these demands. They've gotten away with worse and will again in the future. Nobody fears the toothless dog.",
                "author": "JimmyRussler"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Maryland Democrats are trying to ABOLISH the one remaining Republican Congressional District in 2026, which would make the map 8D-0R. Thankfully Republicans in Maryland have a majority in the Supreme Court (5/7 justices are Republican) so it should be struck down.",
        "score": 1265,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wasn't there a slithery handshake deal between Maryland and the Indiana RINOs so Indiana wouldn't redistrict? I figured Maryland would renege. It's the Democrat way.",
                "author": "LostElf"
            },
            {
                "raw_content": "And Indiana refused to redistrict because the R's said Maryland super-duper promised to not redistrict if Indiana didn't. lmao",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "I wouldn't be so sure the justices will strike it down.",
                "author": "hansgruber7"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": ".",
        "score": 2027,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why cover up her identity?",
                "author": "BahamaDon"
            },
            {
                "raw_content": "Original posts https://x.com/persianmama111/status/2013317244126674958 (of course she has pronouns in the bio) https://x.com/reddit_lies/status/2013573888542732296 --- [Her name is Mitra Khalilian from Green Bay, Wisconsin. She made a GoFundMe post to get some foster cats spayed/vaccinated.](https://x.com/persianmama111/status/1981005079428857906) **She used to live in California in the San Francisco Bay area. She went to community college at 18 majoring in anthropology, dropped out and went to Esthetician school and worked as an Esthetician for a couple years, then decided to go back to school for psychology but then dropped out again and is now a baker** There is a Mitra Khalilian on [LinkedIn](https://www.linkedin.com/in/mitra-khalilian-735494166) in the San Francisco Bay Area who says she's a California Licensed Esthetician who specializes in facial and body waxing. European Wax Center-Cinta Aveda Institute. [I’m from San Francisco Bay Area :) I don’t live there rn but grew up there! I will be visiting this year again tho!!](https://x.com/persianmama111/status/2009759068462707196) [I started at community college at 18 majoring in anthropology, dropped out and went to Esthetician school and worked as an Esthetician for a couple years, then decided to go back to school for psychology but then dropped out again and now I’m a baker](https://x.com/persianmama111/status/1468335144494895111) **She's on SSRI's as well what a shocker** [any other girlies taking an ssri that struggles with sweating constantly? like I’m so over it. I’m happy but at what cost??](https://x.com/persianmama111/status/1929357953724801324) **Has been on a high dose of Zoloft for 4 years** [When you can feel the depression through the highest dose of Zoloft](https://x.com/persianmama111/status/1994990354035012029) [lol I’m literally on the highest dose for 4 years and it’s stopped working 😭 I’m about to switch to something else tbh](https://x.com/persianmama111/status/1994993179464994944) **She's on mood stabilizers as well** [anyways I’m out of my mood stabilizer so pray for me to not become unhinged (The ship has sailed on that, schizo)](https://x.com/persianmama111/status/1837201055735595398) **Has daddy issues, another shocker** [You’re lucky, my dad hates weed and thinks I’m a lazy crack head for smoking :/](https://x.com/persianmama111/status/1418006686845919232) In response to \"if we lock in now I can show up to your family thanksgiving with my famous mac n cheese and proceed to get absolutely obliterated and fight your dad.\" [my dad is very infuriating so I’d be okay with this](https://x.com/persianmama111/status/1987212424093835385) [I grew up with a father who I debated politics with my whole life. I will never back down or give up](https://x.com/persianmama111/status/2013708980967670048) **She's originally from Germany, but moved to the US as a kid. Her family is Iranian.** [I’m originally from Germany but moved to US as a kid. My family is Iranian though but, I agree.](https://X.COM/persianmama111/status/2011884548360196321) **She moved from California to Wisconsin in 2021** [ahh I just moved from California to Wisconsin so I feel that! I’m honestly excited for snow :,)](https://x.com/persianmama111/status/1460768005114277893) [On January 12th she reposted: \"i support shoplifters. i support genderqueers. i support immigrants. i support socialism. i support abortion. i support he/him lesbians. i support trans right. i support neopronouns. i support sexworkers. fuck ice fuck isreal fuck the USA\". (Then move back to Germany/Iran then, commie cunt)](https://x.com/persianmama111/status/2011168434357514439)",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "Evil always sees evil in others.",
                "author": "eclectic22"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Master gives a nod to the Meme Lords.",
        "score": 698,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Dilley Meme Team",
                "author": "Salty_Sailor"
            },
            {
                "raw_content": "Man, thats a huge compliment. Good for you meme makers. I am like 40 year old age boomer who is to lazy to learn how to do any of that shit. I help repost though.",
                "author": "Threaper666"
            },
            {
                "raw_content": "What's up fellow tools",
                "author": "Reefay"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "It's hard to express in words how much I absolutely love this man",
        "score": 644,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Canada should be a Territory only. No one in the Canadian territory east of Michigan can have voting rights.",
                "author": "ConvergenceMan"
            },
            {
                "raw_content": "So, Mexico is the shitter then. 🚽",
                "author": "MythArcana"
            },
            {
                "raw_content": "looks like ~210% America",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A small part of me keeps trying to think there has to be a better explanation for such behavior, but I keep getting reminded that no: the Left truly is that evil. People like Rupar would look at the criminals we arrest and proceed to instead question the facilities of Trump and his cabinet.",
        "score": 937,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sometimes I truly think that for what we are experiencing and witnessing, **if it's not** that the \"woke movement\" is literally The Antichrist playing out before our very eyes, then the only other plausible explanation is that something is happening to humanity where two humans can look at the same thing and see completely different results. We see the left basically eating and raping children and they're cool with it, but then the left says that's what they see US doing and claim Trump and co are the pizzagate pedos etc., and we know for a fact that's not true. So maybe some aliens or something have us all seeing each other doing the things we accuse each other of doing in an effort to get us to fight or something. Nothing else makes sense.",
                "author": "Covidrrhea"
            },
            {
                "raw_content": "I literally saw one of the flapping heads behind a \"NEWS\" desk say \"Trump claims these people committed crimes, we can't verify that\" then moved on to other slanders lol. ITS LITERALLY THEIR JOB TO VERIFY AND THEY REFUSED TO DO IT SO THEY COULD PLANT THE SEED OF DOUBT IN THE VIEWERS MIND. Abolish MSNBC",
                "author": "EffingWhiteMale"
            },
            {
                "raw_content": "The left is pretty much evil. I used to be a leftist and the main reason I left was because as I got more involved, I genuinely saw how evil leftwing fundamentalists are. I kept encountering TONS of people who wanted to abolish the family and age of consent. I used to think that was a right wing caricature but it's not. I got screamed at by lunatics who insisted 7 year olds should be raised in communes and allowed to vote or... do other things... I blocked dozens of people back in 2013 for acting that way. Dozens. They exploit naive people to make their numbers look significantly larger. It's a playbook Lenin openly bragged about. BTW speaking of Lenin. You can see the exact same factions from the Russian Revolution forming today. Nowadays people are taught that the Mensheviks were the \"less\" extreme communists as if they were the utopian hippies of the 60s. The only difference between the Bolsheviks & Mensheviks was that the latter believed in speech protections for ONLY LEFTISTS and they wanted a parliamentary system instead of democratic centralism.",
                "author": "90sKid"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Meet 23-year-old Athika Ahmed, a Health Ambassador in Wales, UK.",
        "score": 1127,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">Wales or whales?",
                "author": "CyanScales"
            },
            {
                "raw_content": "I'll take my health advice from RFK Jr, thankyou very much.",
                "author": "Scatter-Shot"
            },
            {
                "raw_content": "Clown world 🤡🌎 imagine this thumb-headed cunt telling you how to be healthy.",
                "author": "Bythrfruitsyknow"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Virginia Democrats Want More Rapists And Murderers On The Streets",
        "score": 941,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Rapists, murderers and pedophiles. Their core backers.",
                "author": "PapaPepe"
            },
            {
                "raw_content": "# CIABERG AND MUZZJEET",
                "author": "CommieCrats"
            },
            {
                "raw_content": "birds of a feather",
                "author": "awsure"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BASED Minnesota student CLAPS BACK at lib teacher smearing ICE agents as murderers: \"Just because you're yelling doesn't mean you're winning the argument!\"",
        "score": 1257,
        "text_content": "",
        "comments": [
            {
                "raw_content": "kids don't like these leftarded awfuls",
                "author": "Rerun1Central"
            },
            {
                "raw_content": "White liberal cat ladies are insufferable cunts",
                "author": "Sea_Still"
            },
            {
                "raw_content": "Somebody's ex wife for sure",
                "author": "kamalas_knees"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump: \"$19 billion, at a minimum, is missing in Minnesota — given to a large degree by Somalians. They've taken it... I was told that @IlhanMN is worth $30 million and she's never had a job. She's a crooked Congressman.\"",
        "score": 1166,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So arrest someone wtf?",
                "author": "KamamblaToe"
            },
            {
                "raw_content": "I cannot understand the audacity that this mother fucker will stand in front of a camera as the holder of the highest government office in the USA and directly cite shit like Ilhan Omar's criminal activity, and then do nothing about it. Seriously, go fuck yourself.",
                "author": "Stygem"
            },
            {
                "raw_content": "Shut the fuck up and do something about it then, or admit you're powerless.",
                "author": "AccipiterQ"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The numbers confirm what we already knew: ALL WE NEEDED WAS A NEW PRESIDENT!",
        "score": 1333,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We still need Congress to confirm the E0s, the DOGE cuts, the nominees for positions, and to pass the SAVE ACT.",
                "author": "Belleoffreedom"
            },
            {
                "raw_content": "Not seeing 70% drop in inflation and on top of that they're still bringing in a ton of H1B visa employees \"_100% of new jobs to American-born workers_\" is then of course, bullshit.",
                "author": "Bythrfruitsyknow"
            },
            {
                "raw_content": "AND ZERO ARRESTS. When he's gone, we're FUCKED.",
                "author": "ciaramella_is_gay"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Sony is selling its home entertainment business to TCL – but what does this mean for future Bravia TVs?",
        "score": 541,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's useful to note that the 2025 bravia 9 (by all means a great TV) was already using TCL sourced panels.",
                "author": "uragainstme"
            },
            {
                "raw_content": "Sony slowly going the way of the Dodo, really sad to see.",
                "author": "atape_1"
            },
            {
                "raw_content": "Sony has been relying on LG for OLED for quite a while, so honestly this isn't surprising. When you lose the panel tech for a TV the only thing you have left is brand name and processing.",
                "author": "Lighthouse_seek"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD is reportedly pausing new GPU launches until 2027",
        "score": 181,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Clickbait, isn't this just their regular release cadence?",
                "author": "angry_RL_player"
            },
            {
                "raw_content": "Business is slow for these tech sites and rumor/leak spreaders.",
                "author": "n19htmare"
            },
            {
                "raw_content": "damn I was hoping for a: 9070XT 420 Super Turbo XXX AI69 edition",
                "author": "Loose_Skill6641"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "NVIDIA's GPU Memory Bundles Cost Less Than AMD's, Note AIB Partners",
        "score": 206,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Makes sense, nvidia buys a lot more memory and can negotiate a better deal with their economies of scale. But I'm sure AMD's deal is still miles better than what an AIB could get on their own.",
                "author": "pmjm"
            },
            {
                "raw_content": "Nvidia is much, much, much bigger than AMD. Tech media can make you feel like they're a 50-50, but reality shows it's 95-5. Ofcourse Nvidia can afford cheaper VRAM simply because they buy them in much bigger quantity",
                "author": "FitCress7497"
            },
            {
                "raw_content": "Is that surprising? Nvidia appears to be the sole (major) customer for GDDR7, as they were for GDDR6X. It's not just economies of scale, they are the only customer. They're able to invest into it early and get a better deal in return.",
                "author": "dsoshahine"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nvidia's Arm-based N1X-equipped gaming laptops are reportedly set to debut this quarter, with N2 series chips planned for 2027 — new roadmap leak finally hints at consumer release Windows-on-ARM machines",
        "score": 89,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> Supply chain sources revealed that, according to NVIDIA’s latest technology roadmap, Windows on Arm (WoA) platform notebooks using the N1X will debut in the first quarter of 2026, initially targeting the consumer market. Three other versions will go on sale in the second quarter, What are these '3 other versions' ? > In terms of product schedule, NVIDIA has also released a next-generation plan, using the N2X DGX Spark model, which will debut in the fourth quarter of 2027... Looks like there will much confusion in future discussions. N2/N2X the Nvidia chips, or N2/N2X the TSMC nodes? Heck, N2 (the Nvidia chip) might be fabbed on N2 (the TSMC node). Now there's a good joke...",
                "author": "Forsaken_Arm5698"
            },
            {
                "raw_content": "Wouldn't/shouldn't they have said something at CES? Seems unlikely that it's coming so soon if at all",
                "author": "boomstickah"
            },
            {
                "raw_content": "Checks out. I’m guessing they release Rubin desktop and integrated laptop end of 27. From what we’re hearing about nvidia’s memory situation maybe even longer. Crazy.",
                "author": "PrizeWarning5433"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "OnePlus 16 could offer the same battery 9000mAh capacity as the Turbo 6 series",
        "score": 25,
        "text_content": "",
        "comments": [
            {
                "raw_content": "the post above this says one plus is being cancelled and snd this one talks about a new phone who to trust lol",
                "author": "Loose_Skill6641"
            },
            {
                "raw_content": "I have so many questions. More than anything, wouldn’t the phone be a brick with a battery of this size?",
                "author": "PlsDntPMme"
            },
            {
                "raw_content": "I'm all for it. Everything gets better with bigger batteries. Fast charge is gentler at the same power, or faster at the same degradation rate. Wear is less at first because you can derate to 80 or 65% max charge with the same usability, and less again because fewer cycles to transfer the same total energy, and less at last because the battery can degrade further before impeding function. And of course more power on hours from a single charge, if you need it.",
                "author": "VenditatioDelendaEst"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Apparently, Kingdom Hearts Integrum Masterpiece is coming to the Switch 2",
        "score": 927,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It damn well better. Cloud Versions don't cut it.",
                "author": "StrawHat89"
            },
            {
                "raw_content": "There's also been early February direct rumors and leaks appearing lately. It might be released or announced then, Nintendo always has a February direct after all.",
                "author": "shadow0wolf0"
            },
            {
                "raw_content": "TAKE MY MONEY!!! I wanna play kh at work and in my bed and in my car and in my head",
                "author": "According_Glove_4747"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Donkey Kong Country Returns HD — Update Overview — Nintendo Switch & Nintendo Switch 2",
        "score": 324,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Man, Nintendo is just so random",
                "author": "Medd-"
            },
            {
                "raw_content": "Randomly dropping an update to a 1 year old Switch remaster of a 15 year old Wii game with a Switch 2 resolution improvement is very on brand for Nintendo being weird. I’ll take it though, bought the remaster and fell off before finishing it while waiting for Switch 2.",
                "author": "gaysaucemage"
            },
            {
                "raw_content": "I will always welcome these free updates, don't matter the game. Heck, drop one every month.",
                "author": "kahabraham"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Final Fantasy 7 Remake has arrived!",
        "score": 821,
        "text_content": "Managed to snag an early copy!",
        "comments": [
            {
                "raw_content": "And it came with a paper cutter!",
                "author": "SaxVonMydow"
            },
            {
                "raw_content": "I'm still waiting for mine to ship. I can't wait wait to play it on my switch 2.",
                "author": "DragonSpirit1976"
            },
            {
                "raw_content": "No, but seriously though, where do you get the buster sword slicer?",
                "author": "This-Hold4222"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "What the hell, sure",
        "score": 155,
        "text_content": "",
        "comments": [
            {
                "raw_content": "At least Dixie is in the game now",
                "author": "guessimcooking"
            },
            {
                "raw_content": "Now do this for all of the Switch 1 first party games, and the Xenoblade games.",
                "author": "Ayrios440"
            },
            {
                "raw_content": "Ive read it has improved resolution on Switch 2 now!",
                "author": "GoreGaming"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Samsung’s discounted microSD Express card more than doubles your Switch 2 storage",
        "score": 80,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Math is hard for some people. Going from 256GB to 768GB (256 + 512) is a tripling of your storage. I guess that's technically \"more\" than double.",
                "author": "jessej421"
            },
            {
                "raw_content": "![gif](giphy|BjeiL8WnqByKY)",
                "author": "Electrical-Skin-4287"
            },
            {
                "raw_content": "Imagine sharing this. Dead internet theory is strong",
                "author": "jh4rdc0r3"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "First good looking Del Sol Valley shot",
        "score": 83,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm still awaiting the merchant to ship out the cart.",
                "author": "gbfm"
            },
            {
                "raw_content": "I haven’t even made it out the Volt Forge smh",
                "author": "lordbancs"
            },
            {
                "raw_content": "sad that a good screenshot of an area almost doesn't show that area",
                "author": "MartenBlade"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Finally got a switch 2 after saving for a long time",
        "score": 884,
        "text_content": "This is the first consle i buy with my own money :) i always loved my switch 1 and since the april direct i started saving money and here we are! I plan to get Donkey kong bananza next month and i also wanted to play kirby air riders I also heard this is a rare bundle cuz in other countries mario kart come as a digital code not physical so this is pretty cool!",
        "comments": [
            {
                "raw_content": "interesting that you get a physical copy of mario kart in the box, I just got a code on a slip of paper",
                "author": "Coffmad1"
            },
            {
                "raw_content": "Ahh good job, man! I still remember the day I got my Super NES, which was the first console I bought with my own money after saving up for it. That's a special feeling you'll always remember, and you'll appreciate your console that much more because of it. Enjoy!!",
                "author": "MainHaze"
            },
            {
                "raw_content": "Dang I wish mine came with a physical copy",
                "author": "AdorableSock2367"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "40fps",
        "score": 13,
        "text_content": "More games should have a balanced mode (40fps)",
        "comments": [
            {
                "raw_content": "Most games should run at 60fps as the Switch 2 is a relatively good device but if the game is extremely demanding power wise and 60fps is not feasible then yes i agree 40fps should be the target.",
                "author": "Loose_Society9485"
            },
            {
                "raw_content": "I always play balanced mode when available on my PS5. People don’t seem to realize how drastic the visual difference between 30 to 40 FPS is, and that it feels so much closer to 60, while giving so much more overhead for more advance graphical options like ray-tracing and crowd density. 60 FPS should always be the goal, sure, but the reality is that many games still aren’t always reaching that. A balanced mode, just as an option, would make a lot of games more enjoyable to play than they currently are. Plus the improved battery life in handheld is a huge bonus.",
                "author": "Twilit_Night"
            },
            {
                "raw_content": "60FPS is becoming a standard. Lets keep it like that.",
                "author": "GeekyPanda404"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Bethesda isn't shadow-dropping Fallout 3 and New Vegas Remasters any time soon | Jez Corden",
        "score": 840,
        "text_content": "https://www.windowscentral.com/gaming/no-bethesda-isnt-shadow-dropping-fallout-3-and-new-vegas-remasters-any-time-soon-heres-what-we-know",
        "comments": [
            {
                "raw_content": "#Jez Corden is a Tier 2 - Generally Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "I only believe this guy when he says the things I want to hear",
                "author": "ConsciousBerry8561"
            },
            {
                "raw_content": "Five minutes later:",
                "author": "GoldenTriforceLink"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "NateTheHate Seemingly Says The Next Sonic Game Will Be Like Frontiers",
        "score": 248,
        "text_content": "In response to someone asking to leak the next Sonic game, he said \"Did you like Frontiers\" Source: https://xcancel.com/NateTheHate2/status/2013707082789237065?s=20",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Hopefully the artstyle is more cartoonish. Frontiers felt too much like one of those \"Mario in UE5\" type videos.",
                "author": "KittenDecomposer96"
            },
            {
                "raw_content": "lizuka said before Frontiers even released that they intended it to be the template on which to model the franchise going forward, much like how Sonic Adventure established a direction for the transition to 3D while Unleashed brought the series into its \"Boost Era\" This is hardly a leak.",
                "author": "Coolman_Rosso"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "THE LEAKIES 2025™ | WINNERS",
        "score": 645,
        "text_content": "𝐓𝐡𝐞 𝐋𝐞𝐚𝐤𝐢𝐞𝐬 𝐀𝐰𝐚𝐫𝐝𝐬 are upon us! It is finally time to honor and recognize the best of gaming leaks and rumours in all of the posts, comments, and users that made them during an eventful 2025. Please note, there will be no mention of the Nintendo Switch successor during this presentation. |Most Anticipated Unconfirmed Leak Award 2025| |:-| |***Winner:*** [Half-Life 3/HLX](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1iysc3e/the_final_stages_of_hl3s_production_are_here/) \\- u/Stannis_Loyalist| |Runner Up: [Egyptian God of War/God of War 6](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1nkklzk/tom_henderson_says_kratos_in_the_next_mainline/) \\- u/AceOfSpades0319| || |\"Most Hated Leak\" Award 2025| |:-| |***Winner:*** TIE: [Rockstar's Union-Busting efforts](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1ol535e/jason_schreier_grand_theft_auto_studio_accused_of/) & [Nvidia and AMD to significantly increase GPU prices starting next month, RTX 5090 from $2000 to $5000](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1q0cq28/newsis_nvidia_and_amd_to_significantly_increase/)| |Runner Up: [Xbox Game Pass revamp/price hikes](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1nv58ow/resetera_moderator_supposed_upcoming_changes_to/)| || |\"Worst Kept Secret\" Award 2025| |:-| |***Winner:*** [Leon Kennedy is in Resident Evil: Requiem](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1pi5mmc/hd_version_of_the_leaked_leon_re9_cover_by/) \\- u/chainsawdoctor01| |Runner Up: [Oblivion Remastered](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1k3t539/possible_details_of_the_oblivion_remaster_from/) \\- u/ShadowOverMe| || |Oopsie of the Year Award 2025| |:-| |***Winner:*** [\"Ban Dusk Golem from this sub right now !!\" - moments before DuskGolem is proven right](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1l55o4h/ban_dusk_golem_from_this_sub_right_now/) \\- u/TheWitchard94| |Runner Up: [Microsoft posts UI concept showing Steam on Xbox before deleting it](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1jfyapa/microsoft_posts_ui_concept_showing_steam_on_xbox/)| || |Best Comment of the Year| |:-| |***Winner:*** [\"Getting my shit blown smoove off by a Valve security guard because I tried to go the bathroom and accidentally stumbled into the Half Life 3 room.\"](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1p0fbpv/comment/npie28o/) \\- u/SecretTraining4082| |Runner Up: [\"At this point Sony is looking for their receipt to see if they can return Bungie\"](https://www.reddit.com/r/GamingLeaksAndRumours/s/Q7iFKwjkC2) \\- u/Daftest_of_the_Punks| || |Best Unofficially Official Leaker| |:-| |***Winner:*** [Fable possibly done with production according to alcohol (devs found getting pissed at a bar)](https://www.reddit.com/r/GamingLeaksAndRumours/s/B3ljxtROj9) \\- u/Zantreus| |Runner Up: [Old Spice Perfume leaks Super Mario Galaxy Movie renders](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1nen3fa/it_seems_that_the_old_spice_super_mario_galaxy/)| || |Leaker of the Year 2025| |:-| |***Winner:*** NateTheHate - u/NatetheHate2| |Runner Up: Jason Schreier - u/jasonschreier| |2nd Runner Up: DuskGolem - u/AestheticGamer| |Leak of the Year Award 2025| |:-| |***Winner:*** [GameFreak's plans up to 2030 leaked](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1o5qz6r/gamefreaks_plans_up_to_2030_just_leaked/) \\- u/Animegamingnerd| |Runner Up: [Oblivion Remastered is real + images leaked](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1jzpycx/oblivion_images_on_virtuos_website/) \\- u/LiquidBurnss| |2nd Runner Up: [Rockstar Employee Anonymously Shares Gross Misconduct And Union-Busting Efforts](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1oqgb4v/rockstar_games_employee_posts_about_recent/) \\- u/wifestalksthisuser| *Whether it was the quality of content posted or the incredible help with debunking and confirming leaks, these members have been a great help this last year and will be awarded \"Top Contributors\" flairs (if any of you want to remove/change your flairs back to the cat one, let us know):* |Top Contributors 2025| |:-| |***Winners:*** u/KekanKok , u/andree1234 , u/Midnight_M_ , u/ZamnBoii| As part of the voting process, we asked you optionally if you wanted to share something with the team. Here are some of the responses: >Love this subreddit. It's the only one I follow. Thanks for your efforts! \\# >Good work guys! let's use false/no source more aggressively this year tho \\# >I am not coping, 2026 is the year of HL3/HLX. I B3LI3V3 \\# >This is one of the better run large subreddits so great job, thank you all for your (unpaid) work! \\# >This sub is one of the better ones on reddit. It could be made better by removing any and all credibility from Jez Corden. o7 \\# >forsen1 I C Bajs \\# >I just want to say thank you for being a great mod! Bonus points for including links to the original posts/comments, its very funny to be reminded of some of them haha \\# >Make Dusk Golem tier 1!!! \\# >Chicken jockey \\# >Allow PORN game leaks. Actively push for this to happen. Make a mega thread emphasizing the importance of this. Let 2026 be the year of the gooner \\# >Yo Yo Yo its HUMP DAY! What I need you to do is tag 3 big dick ass leakers under this post right here. I need some more leakers to do this ‘Bust That Nut’ challenge with. And I’m also giving away another hunit free subscriptions to my OnlyLeaks. Be looking out for that post later on tonight. If you're one of them big dick leakers, TAG YA'SELF! \\# >A big thanks to this sub for having me get so invested in leaks, which is really fun! \\# >it was a crazy year, i wanna say thank you to the mods and comunity for keeping this alive, lets have a nice year guys \\# >Happy new year! \\# >Just keep having fun! \\# >Best mods on reddit \\# >Hey mods, here's a new leak: i screwed yer mom, source: yer sister, which I also screwed \\# >please keep doing these awards. it's bringing me joy reminiscing throughout the chaos of 2025. \\# >Appreciate all your work guys, but I really do think you could be a little more harsh with people who clearly have massive hate boners for certain leakers. Anyways, Happy New Year! \\# >Ban Fortnite collab leaks \\# >Thanks for your work. The sub makes every day a little better for me. \\# >The mod team is great! Keep up the great work!!! Thanks for keeping it amazing around here! \\# >You're pretty cool. \\# >SIX SEVEN \\# >I hope they leak the heat death of the universe next \\# >Make it a requirement for everybody to call Jez Corden \"The worse J. Corden\" every time he's inmediately proven wrong. \\# >crack down on the console warring in the comments whenever a new Xbox leak comes up, it's blatant and annoying. yours truly \\# >More good leaks, less bad leaks. Get to it, chop chop \\# >Don’t have any criticism to give, but I just wanted to say that this is easily my favourite subreddit on the site. Big thanks to everyone making it great! \\# >I can imagine how much of a headache it is to mod a sub like this so thanks for all the effort you all put in. \\# >I don't have any criticism but thank you for running the subreddit in a decent manner, you guys are the best :) \\# >half life 3 \\# >What are your favorite Monster Hunter monsters?! \\# >she gaming on my leaks till I rumors \\# >unban dreamkiller73 (one of these days you'll acquiesce) \\# >im a fat fucking chud \\# >I have nothing to add other than that this was my favourite subreddit before i deleted my Reddit account okay bye. \\# >imo it's a bummer that PvZ Replanted didn't make it here \\# >Thank you for deleting shitposts and banning console warriors \\# >this is the only subreddit im using reddit for. thanks to all of you! \\# >Ban Extas1s 🗣️🗣️🗣️🗣️🗣️ \\# >Thank you mod team for all you do! \\# >HL3 Tomorrow \\# >An official pardon for Dusk Golem \\# >Update the tier list more often please \\# >GOAT sub but if we were more proactive about leakers that are obviously just wrong then that would be great \\# >Thanks for all the hard work! This was a lot of fun✨ \\# >I am Groot? \\# >Ban ANY Half-Life 3/HLX rumor, leak, confirmation or whatever, THAT GAME DOES NOT EXIST, EVERYTHING WE'VE BEEN TOLD IS A LIE! ONLY LIE AFTER LIE AFTER LIE AFTER LIE AFTER LIE AFTER LIE AFTER LIE AFTER LIE LIE AFTER LIE AFTER LIE AFTER LIE AFTER LIE AFTER LIE AFTER LIE AFTER LIE LIE AFTER LIE AFTER LIE AFTER LIE AFTER LIE AFTER LIE AFTER LIE AFTER LIE LIE AFTER LIE AFTER LIE AFTER LIE AFTER LIE AFTER LIE AFTER LIE AFTER LIE LIE AFTER LIE AFTER LIE AFTER LIE AFTER LIE AFTER LIE AFTER LIE AFTER LIE LIE AFTER LIE AFTER LIE AFTER LIE AFTER LIE AFTER LIE AFTER LIE AFTER LIE LIE AFTER LIE AFTER LIE AFTER LIE AFTER LIE AFTER LIE AFTER LIE AFTER LIE LIE AFTER LIE AFTER LIE AFTER LIE AFTER LIE AFTER LIE AFTER LIE AFTER LIE AFT̴̡̀̑E̸̘̍̉̀̔̀̈́Ŗ̷̫̗͎̑̅̍̋͋͜͝ ̷̪͕̪̟͊̐L̵̲̬͋̀Ḯ̵̡̱̱̖͖̤É̷̱̥͕̎̈̓̓ ̸͎̖̖̀͆͂̓̆ͅA̶͕̅̒̐̓F̸͉͇͖̃̿͒͒T̷̟̫̪̫̦̺̃͗̋Ĕ̶̢̙͔̀͂ͅR̶̨̳̯͓̾͠ ̷̥̬̳̲̃̽L̸̞̔̄̕I̶͇̺̠͙̋̋ͅE̵̯͕͋̀̅̉ ̶͖͕͘A̷̢͙̽F̶̨̚͠Ţ̶̳̀̀͋̚̕E̵̺͎̼̥̖͊̉̎͜R̸̨̛̤͓̣̓̓͠ ̵̹̺̃̔̾L̴̲̩͉͚̳͆̀͋Ḯ̶̗̙̟̹̾͑͋͜E̴̹͊̑̂ ̸̨̝͓̲͔̆Á̵̹̖̟̹̱̾̇͑͜F̴̗̊Ṱ̶̓̓́̊̋̀Ȩ̷̨͈̻̖̮͗̌͒̓͝R̴̡͔̬̒̎̔ ̴̨͖̯̙̊̐̓̕͜Ḽ̶͈̇́I̴̞͓̟̋̈E̷̯͓͓̼̎̿̓͋͆̀ ̸̛̛̖͔̼̺́̊̒A̵̡̢̭̺̹͆͠ͅF̴͍͇̣̯̫̈́T̴̙̩̙͑͂̿̒̀͝Ẻ̶̦̯̦͐͆R̴͍͙̿̏̽̈̓͜ ̶̝̪̓́͝L̸̘̂̈̆̾͝͝I̷̺͈̜̠͕̺͆Ë̶͎̖́̽̀͗͝ ̸͈̿̾̈́Â̸̲̔̄̕͝F̸̢̡̩̎͊T̴̬͑̑͋͗Ë̴̻͙́̍̐Ȑ̵̢̡̫͕̄͂͝ ̶͚͍́̐̽͌L̷̙̔́͊I̶̢̬̖̜̎͑̊̌͜Ḛ̸͙̞̍̆̿͂͝ ̸͔̳́A̸͍̝͚̭̭͛͋͊͛̿͘ͅF̶̦̎̆̈́T̸̙̹̀̍̐̎́E̵̩͎̳̙̫͌Ṙ̵̳̮͔̞̀̎̀͝ ̵̛̥͕͈̖͖̝̍L̸̳̦͈͈̲̀͌̐Į̸̗͈̤̫́̉͘͠Ȅ̸̫͔̈́̕ T̴̡̀̑E̸̘̍̉̀̔̀̈́Ŗ̷̫̗͎̑̅̍̋͋͜͝ ̷̪͕̪̟͊̐L̵̲̬͋̀Ḯ̵̡̱̱̖͖̤É̷̱̥͕̎̈̓̓ ̸͎̖̖̀͆͂̓̆ͅA̶͕̅̒̐̓F̸͉͇͖̃̿͒͒T̷̟̫̪̫̦̺̃͗̋Ĕ̶̢̙͔̀͂ͅR̶̨̳̯͓̾͠ ̷̥̬̳̲̃̽L̸̞̔̄̕I̶͇̺̠͙̋̋ͅE̵̯͕͋̀̅̉ ̶͖͕͘A̷̢͙̽F̶̨̚͠Ţ̶̳̀̀͋̚̕E̵̺͎̼̥̖͊̉̎͜R̸̨̛̤͓̣̓̓͠ ̵̹̺̃̔̾L̴̲̩͉͚̳͆̀͋Ḯ̶̗̙̟̹̾͑͋͜E̴̹͊̑̂ ̸̨̝͓̲͔̆Á̵̹̖̟̹̱̾̇͑͜F̴̗̊Ṱ̶̓̓́̊̋̀Ȩ̷̨͈̻̖̮͗̌͒̓͝R̴̡͔̬̒̎̔ ̴̨͖̯̙̊̐̓̕͜Ḽ̶͈̇́I̴̞͓̟̋̈E̷̯͓͓̼̎̿̓͋͆̀ ̸̛̛̖͔̼̺́̊̒A̵̡̢̭̺̹͆͠ͅF̴͍͇̣̯̫̈́T̴̙̩̙͑͂̿̒̀͝Ẻ̶̦̯̦͐͆R̴͍͙̿̏̽̈̓͜ ̶̝̪̓́͝L̸̘̂̈̆̾͝͝I̷̺͈̜̠͕̺͆Ë̶͎̖́̽̀͗͝ ̸͈̿̾̈́Â̸̲̔̄̕͝F̸̢̡̩̎͊T̴̬͑̑͋͗Ë̴̻͙́̍̐Ȑ̵̢̡̫͕̄͂͝ ̶͚͍́̐̽͌L̷̙̔́͊I̶̢̬̖̜̎͑̊̌͜Ḛ̸͙̞̍̆̿͂͝ ̸͔̳́A̸͍̝͚̭̭͛͋͊͛̿͘ͅF̶̦̎̆̈́T̸̙̹̀̍̐̎́E̵̩͎̳̙̫͌Ṙ̵̳̮͔̞̀̎̀͝ ̵̛̥͕͈̖͖̝̍L̸̳̦͈͈̲̀͌̐Į̸̗͈̤̫́̉͘͠Ȅ̸̫͔̈́̕ A̵̡̹̫̱̳͓͚̦̗̹̼̠͋̎̾͗͂̈̈̿͒̓̆̄̽̒̍̿͝F̵̺̲̙̭̙̪̬͖̦̖̓̑́̅̇T̷̡̛̙͚̜̟͔̲̫̭͚̞̤͋̄̒̈͑̓̂̃͂̔̎̉͂̊͂͘͝ͅẾ̴̫͓̮̻̣̰̭͆̌̒̑̓͘R̸̡͎̭͖̪̝̻̻͓͕͕̃̏͌̍̈́̓̀̌̎͋͂͗̒̇͌̔͜͝ ̷͍̮̰͇͇͊͊͗́́̇̈̈́͋̔̊L̴͈͓̻̮͌͘͜Ǐ̵̧̢̨̘̪͔̩͕̟̣̟̬̮̓͒̈́͘Ę̸̜͙̦̺̳̬̻̘̾͂͊̀̍̂̄̊̓̽͝ ̴̜͈̩͔̾͑͌̄͐͊̈́̕͘͝Ạ̴͇̠͇͍͙̮̤͈̘̻̟̘͚̟̭̈́͆̋̉͂̍́͊̈́͒̓̀̇͑̚͘͠͝F̸̞̣̣͎̮̿̓͛̓͝T̸̛͕͇̗̖̜̪͕̺̯̳̍̏̉̄̌̐̏̚͝͠Ẹ̸̛̻̠͙̱̭̻̈́̆̏̌̓̃̽̑̀̂̆̀͒͌R̸̉̑̑́͂͂̆̌̔̒̎̀̈̄͊͘͠ͅ ̵͚̱̀̈́͛̈́͒ͅL̵̨̛̪̹̹̘̼̯̱̻̺̫̮͆͑͊͘͜͜͝Ḭ̷̡͍̠̘͙͔͇̪͔̻̭̪͔̯́͋̆͗̑͊̌͘͜͜͠E̸̛͕̟̯̣̗̺̻̞̠͍̦̜̫̋̑͑͗̉ ̷̢̜͔̜̠̞̤̰̙̤̱̰̙̜͊͋̓͊̈́̓̐͐̎̌͂̀̓̍͘͝A̴͚̮̝̗̋́̿͠͝F̴̧͈͚̯̩̮̘̣̱̪̘̭̞̫͋̂T̴̳̏̈É̶̢͚͈͛͛̑́̈̉͂̽̍̔͐̐̓̓̆R̷̭̦̟͍͉̭̲̣̾̆̅ͅͅ ̸̠͚͇͚̫͗́Ḽ̷̛̼̗͇͓̹̰͈̫̄̆̃͆̔̆̅̔̉̑̓̽͆͛͛͘͝Ì̶̱͉̯̤̍̈́͛͒͐͘̕͜ͅͅȨ̵̧̨̺̬̫̻̻́̽̑̃̀̽̄́̓̋̕̚͝ ̴̨̢̲̯̼̳̙̬͓̰̓͛̈́̽͘̕A̷̘͎̟̭̫͎͂̋̈́̽̅̊̀̔͋͝F̵͚͎̖̗̠͇͓̠̜̞̖̜́̆̄̐̀̾̂̀͑̍̿̕͠T̵̡̻͉͕̰͔̗̰̲͒̀̄͛́͘Ȩ̷̬̱͓̼̠̻͚̼̯̲̲̟̲̯̐̈́̂R̵̝̼͎̎̅̕͝ ̶̳͓̖͖̤͗̎̀͑̎̐L̶̥͎̠̹̺̳̹͉͍̮̐̀͊̋̓̊I̶̧̢̩̲̻̩͖̥̭̠̮̫̳͕̹̎͋̌͌̓E̶̤͎̠̦̭̼̞͆̀̚ͅ ̴̛̱̂̓̈́͑̑́͝A̵̛̜͓̪̰̍̊̾́̃͗̓̑̋̑̈̓͝͠F̵̢̛̱̣̳̺̥̳̼͖͖͔̪͚̹̮͔͒̔́̋͗̋̀͂͜ͅT̶̡͈̫͎̪̲̤̮̍͊̄̾̚͜͠Ę̷̓̇͂͘R̵͔͖̝̺̓̔͌͒̈̀̋̾̇̇̂͊̇̕͝͝ ̷̧̨̨͙̗̮̰̤̝̞̹̞̪͉͖͂̓͂̀͊̽̋͊͆͊͌̈́͌́̓̆͘̕L̷̟͎̭̮̻̠̀̈́͑̽̃̀͋̃̀̒̏́ͅĮ̷̨̢̤̭͇̲͙͕̹͖̩̩͈̣͗̓̑͗͜E̵̠͇͖̙͉̳̬̯̥͂ͅ ̶̨̛̟̰̤̟̩̟̩͍́̆͛̀͐̃̉̐͋̿̐͊͘̚A̴̢̧̧̛̹̹͈̤̜͎̜͉̱̥̒̓͗͛̅̒̿͋̊̍͝͠F̵̣̺̲̫̖͒̓̏̓͘T̷̜̺̱͍̈̓͜E̷̜̭̟̥̟̰͉̿͗̆͛̽́̑̓͛͝͝͝Ṟ̴̨̛̜̰̼̣̣̳̻͈̈́̋͑͂́́͜ ̶̧̨̞͍̖̤̼̘̲̪̪̜̮̲͖̞̳͍͗̐͑̀̽͆́̈́̋̉L̸̡̥̔̾͊͊̇̾͑͐͑̔̽̈́̍̓̕̕͠Ï̷̧̨̧̟̬͖̲̗̖̦̫͈̫͔̥̜͇͝E̸̛̱͕̼̖͇͉̩̻͍̬̼̯͆͋̿̔́̒̓̓̂̐͜͝ ̴̥͙̿̽̀͛̆̓̓̇͑͐̊A̸̧̺̩̪̜̦̬̜̝͚͔̬̘̞͚̘̤̚F̶̛̠͎̺̯͉̪̲̝͙̩̗̻̅̏͆̆̂̎̈̀̊͌̿̉͋̂̀̎͝T̵̡̻̙̦̫̟̳̪̗͑̂͒͛͑̚ͅȨ̴̡̦͔͕͇̣͖̱͙͖̣̼͔̠͐̇̌̎̏̀͘͘̕͠Ř̷̛̯͔̘̬̦̫͇̼̩̣̝͑̃̓̾͆̓͝ ̶̧͚̗̺̞̪͖̫͕͓͇̾̽͜L̴̘̦͍͙̲̰͇̮̱̗̟̈́̽͐̽̈́̂͌̅̈́̈̑̀̚͘͝ͅI̶̹͔̥̭̻͋͌̍̒͐̅͋̽͆̂͊̓E̵̱͔̼̞͑͗̽̊͒̀̀́̉͛̈̕",
        "comments": [
            {
                "raw_content": "I can't believe I didn't win leaker of the year for [**confirming**](https://www.reddit.com/r/GamingLeaksAndRumours/s/MvKQqhugn3) that the statue at the game awards was teasing a game. This shit *must* be rigged.",
                "author": "Respawn-Delay"
            },
            {
                "raw_content": "This is the year when my half life becomes full.",
                "author": "Kreeth12"
            },
            {
                "raw_content": "I'm just happy that \"Getting my shit blown smoove off...\" won comment of the year. That one had me chuckling the rest of the day when I first read it.",
                "author": "whofickle"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Life is Strange: Reunion leaked by Xbox Wire 1 hour before the reveal",
        "score": 500,
        "text_content": "Source: [ https://news.xbox.com/en-us/2026/01/20/life-is-strange-reunion-reveal/ ](https://news.xbox.com/en-us/2026/01/20/life-is-strange-reunion-reveal/) It releases on March 26th.",
        "comments": [
            {
                "raw_content": "Wait didn’t some dude just post how his “friend” worked on this game LMAO If that post was legit that dude deserves some apologies. Edit: u/jalck get in here. I think these non-believers owe you an apology.",
                "author": "I_Heart_Sleeping_"
            },
            {
                "raw_content": "\"Giving Max and Chloe the Ending They Deserve\" But we already got that with the original game? This just feels so unneeded. They risk retroactively ruining an otherwise good story, by making the one actual impactful ending non-canon. Just... why!? Stop trying to please fandoms that'll never be happy either way.",
                "author": "RollingDownTheHills"
            },
            {
                "raw_content": "Yeah sorry but this is another case of Deck Nine constantantly relying on characters from the first game without understand what made the original game work. This would be at the same quality as DE.",
                "author": "WELSH_BOI_99"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Attack The Backlog hints at early February (Feb 5th) Nintendo Direct",
        "score": 171,
        "text_content": "This was a early reply of a question about the Direct, then a post after his claim that KH Integrum Masterpiece is coming to Switch 2 https://xcancel.com/Attackdabacklog/status/2013401625902166379 https://xcancel.com/Attackdabacklog/status/2013700403817230410 Also here with the \"5th\" at top left corner: https://xcancel.com/Attackdabacklog/status/2013703864315240945",
        "comments": [
            {
                "raw_content": "Oh good. We’ve hit the “Ooh people are leaking dates I gotta get in on this too” part of the Nintendo direct rumor mill. Suddenly eeeeeveryone knows the date.",
                "author": "Greatsnes"
            },
            {
                "raw_content": "Heard that Nintendo is gonna release some sort of new hardware in 7-10 years from now 👀",
                "author": "Jasen_The_Wizard"
            },
            {
                "raw_content": "Really hoping for some good 3rd parties, I actually wouldn’t be surprised if Rockstar decides to use the Direct to announce their RDR2 Switch 2 port or a GTA V Switch 2 port, given how the TakeTwo Investor call is also around that timeframe and Rockstar did that with GTA V for the PS5 event",
                "author": "hushpolocaps69"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "A person who works with Gamestop posts a photo of a physical digital code card for Super Mario Bros. Wonder Switch 2 Edition + Meetup in Bellabel Park and they will be available to be purchased on Gamestop stores on February 27th",
        "score": 33,
        "text_content": "[Source](https://www.reddit.com/r/Mario/comments/1qil6na/my_gamestop_received_mario_wonder_switch_2/?share_id=B0QYFRyMmoK7PGe8os4A4&utm_medium=android_app&utm_name=androidcss&utm_source=share&utm_term=1)",
        "comments": [
            {
                "raw_content": "That is 100% NOT the right date. The dude's either full of it or Gamestop effed up in a weird way, but I'm leaning on the former.",
                "author": "solecongames"
            },
            {
                "raw_content": "Rosalina is mirrored. Probably fake",
                "author": "samquinn55"
            },
            {
                "raw_content": "The source post for this literally has multiple people pointing out inconsistencies and errors with the artwork that point to this likely being fake, did you seriously not even bother to check any of that before rushing to post this here? Like come on.",
                "author": "p00tisbear"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "The new life is strange game. My buddy told me things",
        "score": 768,
        "text_content": "I don't know if this is allowed here but I don't know where else to post this. A friend of mine worked with the development of this new game. He wasn't a main person or anything but he helped with overseeing everything. He got fired (along with a lot of people) and he told me things. The plot is that Chloe (who is a character from the first game) is aware of everything that happened in all the other games? She develops powers (she can stop time) and she goes with the main character who can rewind time and jump between times or something like that. The game is about making choices that affect the rest of the game. The more important choices is choosing whether you agree with the villain or not. If you want to save people or join the villain. If you want to date the main character of the last game or stay with your new boyfriend. If you want to drug someone or not. If you want to stop someone (I think a girl) from jumping off a building or something like that. If you can convince other characters from other games to join you with the villain or against the villain. The final decision of the game is to save the main character (I think the main character of the last game, not Chloe) or to let the city be destroyed by the villains.",
        "comments": [
            {
                "raw_content": "I cant wait for this guy to turn out to be tier 1",
                "author": "iconicdev"
            },
            {
                "raw_content": "Straight to Tier 1 lmao",
                "author": "EliteTrainerXeos"
            },
            {
                "raw_content": "![gif](giphy|rflhqDbuhqDD7I0k4X)",
                "author": "kamil7122124"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Nash Weedle and Attack The Backlog both corroborate that native Kingdom Hearts ports are coming to the Switch 2",
        "score": 160,
        "text_content": "https://xcancel.com/NWeedle/status/2013716382307778564#m https://xcancel.com/Attackdabacklog/status/2013693309424664964#m Not the most ground breaking leak but still hoping its true.",
        "comments": [
            {
                "raw_content": "Why anyone would post something Nash Weedle said, I do not know.",
                "author": "StretchKind8509"
            },
            {
                "raw_content": "will never forget squeenix pulling this in 2022 with a bunch of ps3 games and then a few months later porting nier automata with no problems lol",
                "author": "TiocStudios"
            },
            {
                "raw_content": "Someday N Weedle will be a banned source from here...but I guess today is not that day",
                "author": "Marnandez58"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Sapphire launches flagship X870E NITRO+ PhantomLink motherboard series with GC-HPWR GPU connector",
        "score": 63,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So, you're supposed to feed power to the motherboard using a 12V High Failure Rate connector? Why did they think that was a good idea?",
                "author": "Nuck_Chorris_Stache"
            },
            {
                "raw_content": "What is Sapphire's obsession with this PoS connector? They put it on their highest-end 9070 XT where it caused problems, and now they want to put it on their motherboards for a passthrough into a miniature PCIe slot? It seems they really don't want to keep their reputation as AMD's best AIB partner.",
                "author": "iClone101"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Average 30 yr mortgage rates surge +0.14 to 6.21%",
        "score": 361,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Treasury yields are exploding, but also take a look at Japan. JP10Y is up 10 bps TODAY, and 88 bps in the last 6 months. There is a legit crisis unfolding there. Government bond prices collapsing while precious metals moon is basically the doombear rapture. This is what the \"unsustainable debt!\" crowd has been crowing about since the early 2010s.",
                "author": "ThisKarmaLimitSucks"
            },
            {
                "raw_content": "U.S. 10-Year Treasury Yield Jumps to Highest Level Since Early Sept... due to you know what..",
                "author": "SnortingElk"
            },
            {
                "raw_content": "2 houses down my street still unsold going on 10 months.",
                "author": "Itchy-Throat-4779"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Home Sellers Outnumber Buyers By a Record Margin, Upping Buyers’ Bargaining Power",
        "score": 169,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So it will be even worse once spring comes around. More sellers fill flock to the market and buyers dont necessarily have more money. If anything buyers purchasing power is being eroded much much quicker.",
                "author": "Borealisamis"
            },
            {
                "raw_content": ">Buying Bargaining Power Of course, a pro-real estate website like Redfin would spin this in a way to make buying a home a good idea. You know what's an even better idea? *Not* buying an overpriced home (with deferred maintenance), paying off other debts you might have, and *not* becoming a future homeowner bagholder in a clearly declining housing market.",
                "author": "McFatty7"
            },
            {
                "raw_content": "Why are prices not going down then",
                "author": "gthroway3483"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "To Make Homes Affordable Again, Someone Has to Lose Out",
        "score": 168,
        "text_content": "Saying what we are all thinking here [https://archive.ph/20260120154210/https://www.wsj.com/economy/housing/to-make-homes-affordable-again-someone-has-to-lose-out-ce397bdd](https://archive.ph/20260120154210/https://www.wsj.com/economy/housing/to-make-homes-affordable-again-someone-has-to-lose-out-ce397bdd)",
        "comments": [
            {
                "raw_content": "Only way I see a big reset on prices is a major hit to the economy overall. In that case business contracts. Jobs are lost and we start a new cycle. Just like 2008 until now. The poor get hit the hardest.",
                "author": "KevinDean4599"
            },
            {
                "raw_content": "They have already started QE again. They are going to inflate their way out of it. Home prices will stagnate only because the value of the dollar will continue to erode…won’t look like a huge crash, but it will effectively be a correction without it showing on mortgage statements. Same old playbook.",
                "author": "prussell774"
            },
            {
                "raw_content": "Inflation is coming and home prices will increase less than inflation. This is how prices have adjusted and most likely will adjust. The market is set for prices to come down in the short term. We will see what that looks like, especially if Interest rates increase. If interest rates were to fall, home prices would likely stay flat or potentially increase if rates fell enough to maybe 4.5%.",
                "author": "Automatic-Link-773"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "U.S. Home Prices Inched Up 0.1% in December and 2.2% year over",
        "score": 13,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Pardon me not being an economics masters candidate or anything, but if both those figures are less than the inflation rate over the same period, that kinda means houses *lost* value overall, doesn't it ?",
                "author": "og_aota"
            },
            {
                "raw_content": "I’ve no doubt that some NE markets propped this up a lot, and some very expensive, exclusive zip codes did the rest of the positive gains. No matter, the “crash” is more like a repeated stubbing of one’s toe. It keeps happening, hurting, but isn’t causing any real damage.",
                "author": "Nuvuser2025"
            },
            {
                "raw_content": "Lol so much for a bubble",
                "author": "Then_North_6347"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Homeowners and lies.",
        "score": 13,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They know what they got...",
                "author": "WrongThinkBadSpeak"
            },
            {
                "raw_content": ">Homeowners and lies Where are the lies? Sellers wanting top dollar and being unhappy with fair market value is not unique to the housing market...",
                "author": "point_of_you"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Recursive Self-Improvement in 6 to 12 months: Dario Amodei",
        "score": 67,
        "text_content": "Anthropic might get to AGI first, imo. Their Opus 4.5 is already SOTA at coding. Brace yourselves.",
        "comments": [
            {
                "raw_content": "Probably one of the more agreeable things he's said. Very clear with models like Claude 4.5 and Gemini 3 pro that we are extremely close to models that can almost make automatic changes to their code (or better the systems and such they are built upon for training and etc) I feel like we'll see the first signs come this June.",
                "author": "Asleep-Ingenuity-481"
            },
            {
                "raw_content": "This year will be quite huge no doubt. The next gen data centres are coming online and we have new techniques being used (imo, context, continual learning). I think it’s enough to push us past the threshold where AI solves original problems (I’ve seen the ergos problems but I mean real open problems that are important). I expect the narrative to change this year and people realize shit is about to get real. With that said idk if this prediction is accurate or not but probably not too far off. They said coding will be 90% generated by now and it is both half true and not true. In some cases such as with their new Claude cowork product yes, while in others no, such as with very large code bases. But in my experience as an engineer the amount of reliance on ai generated code is going up drastically.",
                "author": "Setsuiii"
            },
            {
                "raw_content": "He's just talking about the SWE part here though. The \"AI researcher\" part is much less clear, especially because that part probably requires many more novel breakthroughs and is bottleknecked by data and whatnot. It's probably much easier to train an LLM at code than at all of the AI researcher abilities. But yeah, given how much Claude has improved from a year ago, I don't think it's too bold to guess that Claude will be doing nearly the entire SWE job by this time next year. Which is insane.",
                "author": "oadephon"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "NASA’s James Webb reveals the intricacies of the Helix Nebula in stunning detail",
        "score": 259,
        "text_content": "The James Webb Space Telescope has released its clearest infrared view yet of the Helix Nebula, one of the closest planetary nebulae to Earth at about **650 light years** away. The comparison image shows the full nebula as seen by ground-based telescopes alongside Webb’s NIRCam zoom, **revealing** fine scale structure in the gas and dust shed by a dying Sun like star. Webb’s high resolution **view** shows dense knots of gas shaped by fast stellar winds colliding with older slower moving material. These interactions sculpt the nebula and **highlight** how stars recycle their outer layers back into the cosmos. The color gradients **trace** temperature and chemistry, from hot ionized gas closer to the core to cooler molecular hydrogen and dust farther out. This recycled material is the **raw** ingredient for future generations of stars and planets. **Source: NASA** [Full Article](https://science.nasa.gov/missions/webb/intricacies-of-helix-nebula-revealed-with-nasas-webb/)",
        "comments": [
            {
                "raw_content": "Ciliary sidereal ![gif](giphy|fV8BLpra1VV3q)",
                "author": "Ultrahada"
            },
            {
                "raw_content": "**Image Details(Source):** This new image of a portion of the Helix Nebula from NASA’s James Webb Space Telescope highlights comet-like knots, fierce stellar winds and layers of gas shed off by a dying star interacting with its surrounding environment.",
                "author": "BuildwithVignesh"
            },
            {
                "raw_content": "Has nothing to do with the singularity",
                "author": "BrennusSokol"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "New AI lab Humans& formed by researchers from OpenAI, DeepMind, Anthropic and xAI",
        "score": 26,
        "text_content": "Humans& is a newly launched **frontier AI lab** founded by researchers from OpenAI, Google DeepMind, Anthropic, xAI, Meta, Stanford and MIT. The founding team has previously worked on large scale models, post training systems & deployed AI products used by **billions** of people. According to Techcrunch, the company raised a $480 million seed round that values Humans& at roughly $4.5 billion, one of the **largest seed rounds ever** for an AI lab. The round was led by SV Angel with participation from **Nvidia,** Jeff Bezos & Google’s venture arm GV. Humans& describes its focus as **building human centric AI systems** designed for longer horizon learning, planning, and memory, moving beyond short term chatbot style tools. **Source: TC**",
        "comments": [
            {
                "raw_content": "Impressive, very nice. Let’s see Paul Allen’s AI lab.",
                "author": "Isunova"
            },
            {
                "raw_content": "Human sand, weird name",
                "author": "Mindless-Lock-7525"
            },
            {
                "raw_content": "[ Official Announcement](https://humansand.ai/) https://preview.redd.it/lr4h658xkneg1.png?width=1080&format=png&auto=webp&s=078609a13b86b7e92f53a12c8302a6449239a38e",
                "author": "BuildwithVignesh"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI launches Stargate Community plan: Large scale AI infrastructure, energy and more",
        "score": 31,
        "text_content": "OpenAI has outlined its Stargate Community plan explaining how large scale AI infrastructure will be built while working with local communities. **Key points:** • Stargate **targets** up to 10 GW of AI data center capacity in the US by 2029 as part of a multi hundred billion dollar infrastructure push. • OpenAI says it **will pay its own** energy costs so local electricity prices are not increased by AI demand. • Each Stargate site is **designed** around regional grid conditions including new power generation battery storage and grid upgrades. • **Early projects** are planned or underway in Texas New Mexico Wisconsin and Michigan in partnership with local utilities. • Workforce programs and local hiring pipelines will be **supported** through OpenAI Academies tied to each region. • Environmental impact is **highlighted** including low water cooling approaches and ecosystem protection commitments. This gives a clear picture of how **frontier AI infrastructure** could scale while addressing energy stability local jobs and community impact. **Source: OpenAI**",
        "comments": [
            {
                "raw_content": "**From Source** https://preview.redd.it/s03iz1ne0neg1.png?width=1080&format=png&auto=webp&s=07a6609e019ad359baa18cb81b21d2242d1f8179",
                "author": "BuildwithVignesh"
            },
            {
                "raw_content": "Oh look they are addressing issues people had concern about, I bet people won’t keep complaining on reddit and have a more nuanced take now.",
                "author": "Setsuiii"
            },
            {
                "raw_content": "Ghost Town",
                "author": "3-4pm"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "camb.ai launches MARS8, the first family of text-to-speech models built for real-world deployment",
        "score": 26,
        "text_content": "insane stuff. this is genuinely the first time i've heard voice ai and couldn't tell that it's ai.",
        "comments": [
            {
                "raw_content": "This sounds really, really good. I wonder why ElevenLabs / Cartesia haven’t dived into this segment, seems super obvious in hindsight. They’re all focused on chatbots and audiobooks.",
                "author": "Total_Raspberry874"
            },
            {
                "raw_content": "Just showed the commentary clips to my dad who’s a huge football fan. He didn’t even realize it was AI until I told him. He just thought it was a foreign broadcast. Amazing.",
                "author": "biggayu"
            },
            {
                "raw_content": "Is the commentary they showed just translation?",
                "author": "EmbarrassedRing7806"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Palantir CEO Says AI to Make Large-Scale Immigration Obsolete",
        "score": 298,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Unironically true to the point that also devalues native citizens labor as many always point out that AI delinks the connection between labor and productivity and capital will win read dwarkesh substack on it",
                "author": "Character_Public3465"
            },
            {
                "raw_content": "Yeah, cause they can just remote in from home",
                "author": "Upset_Programmer6508"
            },
            {
                "raw_content": "And this is also what he said: > I mean our product is used on occasion to kill people https://africa.businessinsider.com/tech/our-product-is-used-on-occasion-to-kill-people-palantirs-ceo-claims-its-tech-is-used/rprwdhx",
                "author": "iBoMbY"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"12% of CEOs have successfully decreased costs and grown revenue using AI\"",
        "score": 158,
        "text_content": "full report (PDF) [https://www.pwc.com/gx/en/ceo-survey/2026/pwc-ceo-survey-2026.pdf](https://www.pwc.com/gx/en/ceo-survey/2026/pwc-ceo-survey-2026.pdf) It's interesting to me that the same number of surveyed CEOs (12%) have *increased* cost, with NO change to revenue. The narrative around AI use in these companies is probably wildly different.",
        "comments": [
            {
                "raw_content": "42% no change 13% negative 10% ambiguous (unclear if revenue drop w/ a drop in cost is bad or not, same for the opposite) 33% improvement 3:1 benefit to harm ratio. That feels like an overall positive bias.",
                "author": "ketosoy"
            },
            {
                "raw_content": "33% have seen some tangible benefit according to this. Personally at my company they have some marginal improvements to productivity but they are paying me tons of money just to tell them what to do, so probably a net negative. On the other hand, they would just waste the money on something else if they didn't waste it on me.",
                "author": "tomqmasters"
            },
            {
                "raw_content": "the axis direction makes my head hurt.",
                "author": "pcurve"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "DeepMind and Anthropic CEOs: AI is already coming for junior roles at our companies",
        "score": 244,
        "text_content": "AI might not be causing a **labor market** bloodbath, but leaders at Google DeepMind and Anthropic say they're starting to see its impact on junior roles inside their own companies. \"I think we're going to see this year the beginnings of maybe it impacting the junior level\" said Google DeepMind CEO **Demis Hassabis** during a joint interview with Anthropic CEO Dario Amodei at Davos on Tuesday. **Source: WEF/BI** [Full Article](https://www.businessinsider.com/google-deepmind-anthropic-ceos-ai-junior-roles-hiring-davos-2026-1)",
        "comments": [
            {
                "raw_content": "Anthropic was not hiring Junior Engineers until very recently so I’m not quite sure what he is talking about",
                "author": "Prize_Response6300"
            },
            {
                "raw_content": "The picture and post title are wrong and misleading. The full session is here incase anyone wants to watch: [https://youtu.be/mmKAnHz36v0](https://youtu.be/mmKAnHz36v0) But like you say in the OP he didn't say they **were** being affected, he said \"I think we're going to see this year the beginnings of maybe it impacting the junior level\". He then basically says that will probably be after AGI arrives. In fact the host of the session said (and I quote): >So far we haven't actually seen *any* discernible impact on the labour market. Um, yes unemployment has ticked up in the years\\* but all of the kind of economic studies I've looked at and that we've written about suggest that this is over hiring post pandemic, that it's really not AI driven. If anything people are hiring to build out AI capability. The bit I am quoting is here: [https://youtu.be/mmKAnHz36v0?t=870](https://youtu.be/mmKAnHz36v0?t=870) \\*I couldn't make this word out properly",
                "author": "DigitalRoman486"
            },
            {
                "raw_content": "The CEOs are saying AI is affecting junior level hiring as evidenced by junior level hiring in their own companies? This sounds like internal policy more than anything.",
                "author": "ARC4120"
            }
        ],
        "subreddit": "singularity"
    }
]