[
    {
        "post_name": "Coming soon to a communist run hellhole near you.",
        "score": 468,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We already know this won't work in India.",
                "author": "Crucible"
            },
            {
                "raw_content": "Thanks to communism, Chinese take everything that isn’t nailed down. Doesn’t matter what it is. They as a society have been programmed to just…take everything, like swarms of locusts. If it’s a “free” to the public, they’ll take it all.",
                "author": "lifeisahologram"
            },
            {
                "raw_content": "\"You want TP!? You get new Covid booster! Covid booster or NO TP!!!\" :p",
                "author": "patrioticwinning3"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Section 212 of the Immigration and Nationality Act: Every Second an Illegal immigrant is Unlawfully Present in the US is a Crime - Federal Officers Do Not Need a Warrant to Arrest Anyone In the Process of Committing a Crime",
        "score": 520,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Dear Democrat faggots: Try it. Seriously I want Trump to Insurrection Act your ass.",
                "author": "AVeryNakedMan"
            },
            {
                "raw_content": "Man were almost at rhe ultimate FAFO. The judge is directly interfering with federal law enforcement actions.",
                "author": "SaltyAv8er"
            },
            {
                "raw_content": "Arrest the judge and move on.",
                "author": "berserkerbarrage"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Deport! Seems like a daily occurrence in NC. Another citizen lost due to illegal committing a DUI.",
        "score": 411,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If he's been issued a license to drive, arrest the people who approved and certified it.",
                "author": "mass55th"
            },
            {
                "raw_content": "Adios, Mujados!",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "This is biological warfare",
                "author": "Taqiyya_Mockingbird"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A lot of FAKE OUTRAGE over construction of the big, beautiful (and privately funded) White House Ballroom. FACT: Presidents have been renovating and expanding the White House for more than 100 years.",
        "score": 417,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Big Beautiful Ball Room, to hold Big Beautiful MAGA Balls!",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "I bet Trump is using his own money to build this legacy for future presidents... well, Trump 2028, 2032, 2036....LOL",
                "author": "CatalystForChange"
            },
            {
                "raw_content": "East Wing is where the First Lady resides, since Biden literally staged a panty raid on her using the actual FBI, they also most likely bugged the shit out of her quarters. So yeah, Trump made up an excuse to blow the shit up -- just like in his first term after Barry bugged the White House, Trump said it was \"renovations\" and tore the place up",
                "author": "wethedownvoted"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "James Woods: Concubine.",
        "score": 982,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Drunkunt",
                "author": "Disinformation_Mnstr"
            },
            {
                "raw_content": "It’s honestly kind of frightening the state of our society where a literal actual whore can fuck her way into the vice presidency.",
                "author": "lifeisahologram"
            },
            {
                "raw_content": "Unburdened",
                "author": "ThreeTimeTrumper"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Illinois State University teaching assistant Derek Lopez, who was ARRESTED for flipping over a TPUSA table, has been FIRED from the University",
        "score": 1376,
        "text_content": "",
        "comments": [
            {
                "raw_content": "fag with a man bun couldn't even get the table to flip",
                "author": "Retard_Strength"
            },
            {
                "raw_content": "He is not compatible with Western society and should be deported regardless of his citizenship status.",
                "author": "f_bastiat"
            },
            {
                "raw_content": "It is incredibly hard to find a job in academia. Always has been but it's been getting worse and worse, and deservedly so. This moron is probably in his first job after being awarded his PhD, the pay is probably dog shit but he took it because he was desperate. Then he went and fucked it up. Clearly you don't have to be _that_ bright to get a higher degree",
                "author": "gillonba"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: After an activist judge in DC REFUSED to jail Big Balls’ attackers, US Attorney Pirro announced she’ll be bringing FEDERAL CHARGES against them “Today… Lawrence Powell, 19, along with Anthony Taylor, 18, are now charged with assault” 🔥",
        "score": 2050,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Throw that judge in there too!",
                "author": "austford"
            },
            {
                "raw_content": "More of this please, I voted for this.",
                "author": "MikesDong"
            },
            {
                "raw_content": "DC is a Federal district...Trump should appoint new DC Federal judges to man up the courts.",
                "author": "Tbaron"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔴\"JACK CIATTARELLI IS A WINNER FOR NEW JERSEY! Mikie Sherrill is the exact opposite, a stone cold loser, who will drive your Energy costs through the roof, just like the Democrats are doing all over the Country but, even more so, because she has no understanding of what she is doing.\"",
        "score": 1298,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# MIKIE SHERRILL IS A CUNT",
                "author": "DingleBalls"
            },
            {
                "raw_content": "Hope he pulls it out for New Jersey 🍻",
                "author": "BlueKentuckyGirl"
            },
            {
                "raw_content": "NJ here. Going to vote straight republican as always. Gotta get Jack in or we are screwed.",
                "author": "MikeAlphaBravo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔴\"The FBI, under my Administration, is doing an incredible job. more than 28,000 Violent Criminals have been arrested (RECORD BREAKING!), with over 6,000 illegal weapons seized, more than 1,700 child predators and 300 human traffickers taken off the streets, 5,000 innocent children rescued.\"",
        "score": 1295,
        "text_content": "",
        "comments": [
            {
                "raw_content": "25+ years of police work accomplished in 10 months.",
                "author": "YaharaRiver"
            },
            {
                "raw_content": "Congratulations... Can we do something so the FBI doesn't turn back against the citizens again when DNC becomes president?",
                "author": "USDMaga"
            },
            {
                "raw_content": "In this house: - Christ is King - No weapon is illegal - They all must go back ...",
                "author": "kek-is-tan"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "CNN and MSDNC are TRIGGERED over the judges ruling that allows Trump to DEPLOY the National Guard to Portland! EPIC MELTDOWNS.",
        "score": 1199,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If it wasn't for people laughing at CNN and MSNBC they wouldn't have an audience.",
                "author": "blackswans"
            },
            {
                "raw_content": "I appreciate the energy but constantly saying people are ‘triggered’ really devalues the word. All it does is lead me to discount your opinion. It’s the same with words like ‘breaking’ and ‘bombshell’ etc; if everything is a bombshell nothing is. We deserve better then some clickbait faggotry",
                "author": "Goodgoodygoodgood"
            },
            {
                "raw_content": "The CNN reporter's vocal fry is insufferable. May God have mercy on any man having to endure her.",
                "author": "Calumet57"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "JUST IN: Comey Goes to War with Trump DOJ: Asks Judge to Dismiss Federal Criminal Case, Challenges Appointment of US Attorney Lindsey Halligan",
        "score": 1035,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Paybacks are a bitch.",
                "author": "BlueKentuckyGirl"
            },
            {
                "raw_content": "He'll probably get his way.",
                "author": "SmokeDopeDank"
            },
            {
                "raw_content": "This psychopath thinks he’s above everything and everybody",
                "author": "TheRPatriot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "2 days later and Harry is still crying",
        "score": 1649,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm starting to wonder if we're the ones paying him now.",
                "author": "Citizen_Bob"
            },
            {
                "raw_content": "Get rekt faggot",
                "author": "MikesDong"
            },
            {
                "raw_content": "The left does far worse. I don't want to hear their bitching.",
                "author": "Aquamine-Amarine"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Shovels hit the dirt TODAY on Trump’s self-funded White House ballroom, a glittering $200M legacy gem that’ll make state dinners sparkle like Mar-a-Lago on steroids. No taxpayer dime will be used.",
        "score": 1505,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Guarantee you the next deomonrat that “wins” the White House will use tax payer funds to demolish it.",
                "author": "WhicketFahts"
            },
            {
                "raw_content": "And lefties are STILL shitting themselves because they believe its taxpayer funded.",
                "author": "LawyersPlayDota"
            },
            {
                "raw_content": "I dunno , how historic was this section he tore down? If it was an addition from 1970 or whatever who cares. Also, i really disagreed with paving over the rose garden. One of the very few things I disagree with him on. Green space is nicer than a patio.",
                "author": "Quiznos585"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "US Appeals Court gives Trump the GREEN LIGHT to send the National Guard into Portland, Oregon to quell anti-ICE riots outside the federal facility LET’S GO! SEND IN THE TROOPS, 47! 🇺🇸",
        "score": 1894,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Get in there! Come back with Kool-Aid colored scalps!",
                "author": "kek-is-tan"
            },
            {
                "raw_content": "Circle off the area, give them 5 minutes to leave, if not arrest everyone within the zone. Charge them federally as Antifa terrorists, that way they aren’t out a few hours later and won’t fall under the jurisdiction of local judges.",
                "author": "Quiznos585"
            },
            {
                "raw_content": "Yeah but there won't be any weapons. Maybe, MAYBE they'll get to use tasers or something but mostly it will be pepperballs flashbangs and tear gas. Maybe they'll get to arrest people who will just be let go. You cant send the guard in to just be more bodies standing there and \"advance\" on the rioters to temporarily push them back, only to have them come back tomorrow or when they think you've eased up. Gotta take them out of the game so they cant come back. If that's \"disappearing them\" so be it. Take them to a federal prison the police or mayor if Portland cant do shit about. Its a federal building theyre attacking",
                "author": "DingleBalls"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: President Trump signs HUGE $8.5 billion critical minerals deal with Australia.",
        "score": 1610,
        "text_content": "",
        "comments": [
            {
                "raw_content": "In other words - go fuck yourself Ukraine. You had your chance.",
                "author": "IsrorOrca"
            },
            {
                "raw_content": "Australia will renege on the deal because their leaders are a bunch of leftie faggots.",
                "author": "Ricky_CIA"
            },
            {
                "raw_content": "Hank Schrader from Breaking Bad is pleased that the title correctly reads \"Mineral\"",
                "author": "KekistanPM"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Assimilation Is A Fucking Myth",
        "score": 684,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Muzzie, muzzie, muzzie, muzzie, oh look, a white liberal Karen right in the middle of the picture! Who could've possibly guessed??",
                "author": "bidensmissingbrain"
            },
            {
                "raw_content": "GROUNDHOG DAY. THEY ALL LEFT THEIR COMMUNIST COUNTRIES TO COME TO AMERICA AND VOTE FOR COMMUNISM AGAIN.",
                "author": "FreedomFighters"
            },
            {
                "raw_content": "Not a myth, but not all groups are willing or even able to assimilate. Those who won’t for whatever reason need to be expelled.",
                "author": "YT45"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "New poll reveals that Trump’s approval rating has INCREASED as Democrats refuse to vote to end the government shutdown.",
        "score": 1753,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm still amazed that CNN hasn't shut down this poll guy yet, he always is enthusiastically boasting about some poll Trump/Republicans are leading in",
                "author": "VirTW"
            },
            {
                "raw_content": "The most amazing thing to me about the left is how they are completely blind as to why they lost and why they are losing voters in droves. They think it is because they are not left enough. It is fucking hilarious.",
                "author": "devilspawn"
            },
            {
                "raw_content": "FAFO",
                "author": "PeaceMakerDJT"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Lmaooo someone put up a billboard saying “still your president” with a photo of Trump over the no kings protest location in Toledo, Ohio",
        "score": 1586,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He is my president! He is America's President! Trump 2028. Or BUST!",
                "author": "Oldman6541E5"
            },
            {
                "raw_content": "Lol what a legend",
                "author": "VeryFinePerson84"
            },
            {
                "raw_content": "Well done Toledoans for Trump.",
                "author": "Hammond"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🫡 ALL HAIL KEKISTAN!",
        "score": 1256,
        "text_content": "",
        "comments": [
            {
                "raw_content": "2015 The_Donald squad",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "haven't seen the kekistan flag in a frog's age",
                "author": "Rerun1Central"
            },
            {
                "raw_content": "Shadilay my brothers",
                "author": "Sonnet"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Portugal: \"Do you want to wear a burka? It's very easy, go back to your country of origin....Take a flight to Saudi Arabia or Afghanistan. Not here!\"",
        "score": 527,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Couldn’t understand a fucking word but the hand gestures were gold !!!",
                "author": "suckmycorona"
            },
            {
                "raw_content": "In the spirit of the conquistadors",
                "author": "EvensoAmen"
            },
            {
                "raw_content": "They have to be removed.",
                "author": "ColonelKlink"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Microsoft confirms next-gen Xbox hardware is in the works, teases first-party handhelds",
        "score": 39,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"teaser\" is being generous. From the article: >and revealed that Microsoft is seriously considering producing its own gaming handhelds in the future. This is such a non-committal \"maybe\" that I'm surprised it's even in the headline.",
                "author": "MrZoraman"
            },
            {
                "raw_content": "PS6 rumors made them react.",
                "author": "MrUsernamme"
            },
            {
                "raw_content": "I do hope they will make a reasonable naming for this generation too, I do hope for something simple like XboX neXt X series eXtra eXperience - X6 in short, so they can do all of the mind gymnastic to compare their naming scheme with PS6",
                "author": "BunkerFrog"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Cooler Master Hyper 212 3DHP Review: Engineering better heatpipes, improving thermal efficiency",
        "score": 57,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I still rock a Hyper 212 Evo in my media server.",
                "author": "exomachina"
            },
            {
                "raw_content": "Should be interesting to see what Thermalright will do with that tech.",
                "author": "AnechoidalChamber"
            },
            {
                "raw_content": "If it can keep a dual-die under control for reasonable noise, that's a pretty good endorsement of this tech.",
                "author": "Jeep-Eep"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Windows 11 on Arm is finally ready for gaming with AVX/AVX2 support, now rolling out",
        "score": 46,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I thought AVX support got announced months ago?",
                "author": "Raikaru"
            },
            {
                "raw_content": "Curious title; Windows 11 still isn't ready for x86.",
                "author": "Whirblewind"
            },
            {
                "raw_content": "Damn, pretty nice actually! I do hope Arm arrives to the consumer space (maybe not as big as current x86 stuff but enough there you could decide to walk into a store or hop on Amazon and purchase an Arm-based motherboard, CPU, etc.) within a few years time. It'd be neat to run an arm and linux-based machine.",
                "author": "Snibberwhirl"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung foundry boosts 4nm logic die yield to over 90% to support HBM4 production",
        "score": 74,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "New 32\" Fast IPS UHD (UHD/FHD dual mode) MiniLED contender with 2304-zone FALD backlight: AOC AG327UXM",
        "score": 2,
        "text_content": "AOC revealed a new monitor for those looking for a high end IPS solution for both work and play. I am after one of these. Looks like another China-only model possibly. I don't get why these aren't getting worldwide releases. https://www.notebookcheck.net/Agon-Pro-AG327UXM-AOC-reveals-new-2304-zone-Mini-LED-gaming-monitor-before-global-release.1142733.0.html",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Zotac Boards Powerful Mini PC Hype Train With NVIDIA RTX 5060 Ti-Powered ZBOX MAGNUS",
        "score": 1,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "How high can GPU wattage potentially go?",
        "score": 0,
        "text_content": "Much of GPU performance today is coming from power draw and size. What are the theoretical limits? What are the realistic limits?",
        "comments": [
            {
                "raw_content": "Probably whatever a US 15a circuit will take. While 15a at 120v is 1800 watts. Code says that you shouldn't exceed 80%. So 1440 watts. Figure that you're going to run a baller CPU at like 200-300w. Realistically, \\~800-1000w could be done, but that's pushing it.",
                "author": "jmhalder"
            },
            {
                "raw_content": "The theoreticall limit is whatever they can keep cool. We're already seeing x090 class cards with mammoth heatsinks. I won't buy anything with more than 300W TDP. I live in a hot climate, and having 500W+ of heat blasting out of a box next to where you're sitting in summer is just not the vibe.",
                "author": "m1llie"
            },
            {
                "raw_content": "1000w per reticle sized die give or take. So feynman should be 4k watts or so?",
                "author": "captain_awesomesauce"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Dont know if anyone posted this yet but cyberpunk its already at 40$ in the eshop",
        "score": 547,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Dang! Guess I’ll be picking this up for Black Friday this year after all. I want physical version so I’ll be waiting for that but I’m happy to see this price tag",
                "author": "Slow_Ad_8932"
            },
            {
                "raw_content": "yep. downloading",
                "author": "jpassc"
            },
            {
                "raw_content": "Still find it worth it when I got physical day one because it takes a lot less of my storage",
                "author": "jrpbateman"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I GOT IT",
        "score": 444,
        "text_content": "",
        "comments": [
            {
                "raw_content": "noice! have fun bro!",
                "author": "Late_Delivery_1394"
            },
            {
                "raw_content": "Enjoy",
                "author": "Rawkhawkjayhawk"
            },
            {
                "raw_content": "Nice! Have fun!",
                "author": "Williekins"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Really enjoying the Switch 2 so far, thank so much to my family for such en amazing 18th birthday!",
        "score": 415,
        "text_content": "",
        "comments": [
            {
                "raw_content": "hbd to you op ,have fun .",
                "author": "Hell_Hat_5056"
            },
            {
                "raw_content": "Happy birthday",
                "author": "krstphr"
            },
            {
                "raw_content": "Happy birthday!!",
                "author": "Crafty_Theme7968"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo is gaslighting us",
        "score": 421,
        "text_content": "Lets hope reddit actually works this time",
        "comments": [
            {
                "raw_content": "coral",
                "author": "sirms"
            },
            {
                "raw_content": "Spider man suit on ps4 🤝 right sw2 joycon",
                "author": "GameplayTeam12"
            },
            {
                "raw_content": "https://preview.redd.it/y7ppi4hqscwf1.jpeg?width=256&format=pjpg&auto=webp&s=dd2d549edfa993d4fa9c9b4fa861dd45c7d24922",
                "author": "Used-Rabbit-8517"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo and Pokémon will have an in-store event at Best Buy on the 25th.",
        "score": 38,
        "text_content": "",
        "comments": [
            {
                "raw_content": "im just chilling with my 3 mats they sent me!",
                "author": "poodle_moodle"
            },
            {
                "raw_content": "GameStop gave me a tote bag",
                "author": "Silver_Song3692"
            },
            {
                "raw_content": "For only $50-180 per year you can get $10 and some stickers!",
                "author": "Proper_Use6846"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "People with a pro controller, do you use GL/GR? If so, what do you map them to?",
        "score": 12,
        "text_content": "Personally, I pretty consistently remap the stick clicks to GL and GR because I hate pressing the sticks in.",
        "comments": [
            {
                "raw_content": "Stick clicks on most games ; recently found a great use in Silksong by mapping the down button to GL, making platforming sections much easier as I can just hold it to pogo everywhere and use the stick for direction only",
                "author": "GenS-LXIX"
            },
            {
                "raw_content": "I kinda forget they’re there half the time to be honest. I did use it for TOTK when I was replaying it for jumping and calling for the horse when I first got my switch 2",
                "author": "lollipopwaraxe"
            },
            {
                "raw_content": "Gas for Vehicles",
                "author": "Greeklighting"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The motion blur issue really didn't bother me until I started playing Hades II",
        "score": 98,
        "text_content": "As soon as I start moving, all that gorgeous 2D art turns into a smeary mess that genuinely gives me a headache. Now I'm really hoping that the people who've speculated that a firmware update could add overdrive and resolve it are correct, and that Nintendo actually does it. Not getting my hopes up, though... EDIT: For all the people who say they don't see it, I hope it stays that way! On day 1 I booted up Hollow Knight side by side with my OLED and still it didn't really register. But if you're genuinely interested and want to seek it out in H2, try focusing on the background and edges of the screen rather than on Mel while moving. All the detail smears away. On screens with a good response time like the OLED, that doesn't happen. The Library in Snowdin in Undertale is another good spot if you look at the sign outside. You straight up can't read it while moving. There's a theory that this should be fixable in the firmware, and that Nintendo optimized instead for battery life. But this theoretical firmware fix should only take 1-2% off a charge, which at this point is a price I'd gladly pay.",
        "comments": [
            {
                "raw_content": "Ahhh man. That sucks. I haven’t noticed anything since I tried looking for it back when everyone was making it a big deal. All that bs ruined some hype but then silksong came out and I loved every second of it. Didn’t notice a thing. And then hades 2 is incredible and still haven’t noticed anything.",
                "author": "Luigi_loves_Mario"
            },
            {
                "raw_content": "I sometimes notice it, but I’m not too sensitive to it thankfully. Still baffles me Nintendo would even risk this happening on their premier device.",
                "author": "RafeCakes"
            },
            {
                "raw_content": "Really bugs me too, especially coming off a snappy display like an OLED tv. I decided to try it hand-held and got a headache within 5 minutes. It just turns into a blurry mess the second you start moving. It’s incredibly frustrating as someone who bought the console primarily for handheld 2d games and those are the most impacted by this crap display.",
                "author": "paractib"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Cyberpunk",
        "score": 70,
        "text_content": "Cyberpunk is $40 on Nintendo eshop That’s a good price",
        "comments": [
            {
                "raw_content": "Wow great price. Already bought the physical, but this is an insane deal for anyone that hasn’t bought it yet",
                "author": "SleepsInAlkaline"
            },
            {
                "raw_content": "https://preview.redd.it/vi084cp4cbwf1.png?width=486&format=png&auto=webp&s=89c25d0e0a08f122a24775134d030b5fde195ae5 Not a rumor [https://www.nintendo.com/us/store/products/cyberpunk-2077-ultimate-edition-switch-2](https://www.nintendo.com/us/store/products/cyberpunk-2077-ultimate-edition-switch-2)",
                "author": "CAPTJTK"
            },
            {
                "raw_content": "I’m still waiting for star wars outlaws to get the famous 90% off ubisoft discounts 😔",
                "author": "Thick_Tone_4158"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "NateTheHate: Starfield not coming to PS5 this year, scheduled for 2026",
        "score": 227,
        "text_content": ">NateTheHate was recently asked on X (formerly Twitter), whether he had any new information to share about Starfield’s PS5 launch. The insider replied stating “believe the announcement will be in 2026 unless plans change.” [Thanks to Insider Gaming](https://insider-gaming.com/starfields-ps5-port-will-not-be-announced-this-year-its-claimed/)",
        "comments": [
            {
                "raw_content": "I assume DLC 2 will release around the same time",
                "author": "NazRubio"
            },
            {
                "raw_content": "Isn't that [old news](https://mp1st.com/news/starfield-ps5-release-planned-for-2026)? Spring 2026 specifically",
                "author": "Sea-Country8245"
            },
            {
                "raw_content": "Starfield came out in September 23, they are still working on DLC for this game?",
                "author": "obigbrubs"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Jeffrey Nordling (Walter Langkowski / Sasquatch) posts new mocap photo, likely at Insomniac’s capture studio",
        "score": 68,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don't get it, how is this a leak or anything similar? A pic from August... Or maybe I'm just too dumb,sorry.",
                "author": "DizzyV1"
            },
            {
                "raw_content": "Alpha Flight! Go Canada!",
                "author": "mannythevericking"
            },
            {
                "raw_content": "If Alpha Flight is actually in the game I'm going to cry. Give me Puck, Snowbird, the Beaubiers and Vindicator in a game",
                "author": "MyMouthisCancerous"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Rebs Gaming: Halo Studios AI Engineer job listing confirms generative AI is used to create in-game experiences.",
        "score": 371,
        "text_content": "Rebs post which contains an image of the job listing description which was removed after the position was filled: https://xcancel.com/Mr_Rebs_/status/1980082448923815985#m News article about the job listing: https://www.gamesradar.com/games/halo/halo-dev-343-industries-is-hiring-a-generative-ai-lead-to-help-build-innovative-gaming-experiences-powered-by-ai/ Halo Studios AI engineer job listing from August 2024 states: “Design and implement scalable and efficient solutions that leverage GENERATIVE Al and ML to augment in-game experiences and to improve how we make games.” This means it’s used for more than what Jez Corden reported, and, as mentioned in the comment section of Rebs post, a senior AI engineer at Halo Studios was found on LinkedIn which confirms this position was filled.",
        "comments": [
            {
                "raw_content": "I’m so confused. I’m just going to wait until I see Master Chief with 8 fingers to confirm if it’s true.",
                "author": "Ornery-Tonight1694"
            },
            {
                "raw_content": "Streamlining processes to improve efficiency, document making, emails, kanban creation etc linked to in engine data would all fall under that job listing.",
                "author": "swains6"
            },
            {
                "raw_content": "What a nothingburger. I legit dont know how people can read that job description and somehow equate that to the whole game being made with Gen AI. That Twitter account linked comes across like an ignorant person if he is pushing this thinking it means that. I'm a database developer and use LLMs fairly often for certain things. Its not some boogeyman. Its just a tool.",
                "author": "bigeyez"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[Need4Games] Netease is working on a Brand new Singleplayer AAA IP",
        "score": 116,
        "text_content": "Here are the more important details: \\- **Developed by 24 Entertainment Highdive (Montreal Studio)** \\- **has 20+ hours of Story** \\- **complex character arcs, original factions, and a living, breathing world.** More in the original link: [https://need4games.ro/en/exclusive-netease-is-working-on-a-new-aaa-singleplayer-experience](https://need4games.ro/en/exclusive-netease-is-working-on-a-new-aaa-singleplayer-experience)",
        "comments": [
            {
                "raw_content": "this could mean literally anything",
                "author": "UltimateGamingTechie"
            },
            {
                "raw_content": "\"- **has 20+ hours of Story** \\- **complex character arcs, original factions, and a living, breathing world.\"** VIDEO GAME CONFIRMED",
                "author": "mattattack88"
            },
            {
                "raw_content": "Ahh yes, their new, original, non-legally actionable game \"Deity of Conflict\", about an angry ~~Greek~~ Chinese demi-god, who must escort his ~~son~~ daughter across a dangerous, mythical land",
                "author": "LeonSigmaKennedy"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Dusk Golem: This new Resident Evil Zero Remake leak/rumor is true",
        "score": 153,
        "text_content": "[https://xcancel.com/AestheticGamer1/status/1980233514579845448](https://xcancel.com/AestheticGamer1/status/1980233514579845448)",
        "comments": [
            {
                "raw_content": "#DuskGolem is a Tier 3 - 50/50 as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "\"I confirm, that the reliable source is reliable.\"",
                "author": "Cs0vesbanat"
            },
            {
                "raw_content": "Still waiting for the Silent hill 2 DLC he stated is in the verge of being announced a couple months ago already",
                "author": "jowfornari"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Halo CE Remake concept art",
        "score": 73,
        "text_content": "[https://xcancel.com/leaks\\_infinite/status/1980004944628322483](https://xcancel.com/leaks_infinite/status/1980004944628322483)",
        "comments": [
            {
                "raw_content": "This isn't a leak of the game or concept art. This is literally just wall art for their playtesting room.",
                "author": "spiral6"
            },
            {
                "raw_content": "It's not a leak. The picture was shared by Halo Studio's employee responsible for playtests. That's an image of their playtesting room.",
                "author": "IlyasBT"
            },
            {
                "raw_content": "Got a mirror? Unless Xcancel relies on AWS which seems to be affecting everything right about now",
                "author": "PM_ME_YOUR_DANKNESS"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "MSI MPG X870I EDGE TI EVO Mini-ITX motherboard for AM5 CPUs supports DDR5-10000 OC memory",
        "score": 39,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wonder if Zen6 will like faster memory speeds given its (rumored) new fabric design and upgraded IMC",
                "author": "Jayram2000"
            },
            {
                "raw_content": "The inflation in Motherboard names is getting out of control",
                "author": "rstune"
            },
            {
                "raw_content": "That is quite the motherboard name",
                "author": "BerkGats"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "If people cant afford houses now, do we really expect houses to go up in value?",
        "score": 83,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Are we talking value, or are we talking price in dollars? (and wages paid in dollars).",
                "author": "ThisKarmaLimitSucks"
            },
            {
                "raw_content": "Many people buy crap that they cant afford including a house. This is America we are talking about lol. I know several people that put down like 2% downpayment on a $1M house. Can they afford it? No. But they buy it anyways with $1M mortgage debt.",
                "author": "cucci_mane1"
            },
            {
                "raw_content": "I expect a revolution in the form of a big party, basically.",
                "author": "DistillateMedia"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Florida’s housing market was skewed wildly by the pandemic. It’s finally coming to grips with a ‘realistic middle ground’",
        "score": 40,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm pretty sure it's impossible for Floridians to come to grips with any sort of reality.",
                "author": "debauchasaurus"
            },
            {
                "raw_content": "It's not even close to a middle ground",
                "author": "TrickySalamander589"
            },
            {
                "raw_content": "Good for fucking Florida…",
                "author": "Mountbakerkid"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Southern California home sales slump to another record low | Local sales were down 5% in a year and 33% below the average August.",
        "score": 86,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> \"Those rates – assuming a 20% down payment – gave Southern California’s > August buyers an estimated $4,196 monthly house payment.\" Add taxes and insurance, and that's one heck of a monthly nut.",
                "author": "mrktcrash"
            },
            {
                "raw_content": "But sellers aren't meaningfully dropping their prices. Something's got to give.",
                "author": "MarketCrache"
            },
            {
                "raw_content": "It seems the SoCal market has softened and prices have stabilized. I’ll be curious to see what 2026 brings",
                "author": "NewHope13"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Shape shifting drone",
        "score": 114,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Like a floating colonoscopy",
                "author": "Mysterious-Bad-3966"
            },
            {
                "raw_content": "That’s wild.",
                "author": "TekRabbit"
            },
            {
                "raw_content": "This gave me the fear",
                "author": "-mrhyde_"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Robot delivering a package",
        "score": 424,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I like how it pukes your package onto the ground.",
                "author": "-0-O-O-O-0-"
            },
            {
                "raw_content": "Lol the guy is training his replacement",
                "author": "JoeSchmoeToo"
            },
            {
                "raw_content": "He’s been training on those videos of delivery drivers that throw shit",
                "author": "Slowhill369"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "I wonder what will come from this",
        "score": 90,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I think it'll be a UX departure from coding assistant vibe coding and instead present the user flow without needing to interact directly with the code if you don't want to. My guess is that they're connecting some backend services in Vertex, Firebase, and Jules into a package that lets you build and deploy apps from start to actual GA production status. I expect that it'll be a bit underwhelming at first and once it's polished some and Gemini 3 Pro comes out it'll become a really compelling new alternative to Cursor for non-devs.",
                "author": "avilacjf"
            },
            {
                "raw_content": "Just make Gemini CLI better, no BS please.",
                "author": "kaleosaurusrex"
            },
            {
                "raw_content": "https://preview.redd.it/bbiygkt8kdwf1.jpeg?width=1179&format=pjpg&auto=webp&s=f2c2064d742150e1fad42ecf56f4011723ef2a84",
                "author": "Tman13073"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "VISTA: A Test-Time Self-Improving Video Generation Agent (Google)",
        "score": 49,
        "text_content": "https://arxiv.org/pdf/2510.15831",
        "comments": [
            {
                "raw_content": "Self-improvement is gonna go hard in 2026 for multiple mediums in AI. Semi-automatic RL came in clutch in 2025. Just as RLHF was key in 2024. All of those combined with bigger models with more training time… ughhh yes",
                "author": "FarrisAT"
            },
            {
                "raw_content": "https://arxiv.org/html/2510.15831v1 Link to the paper. A much needed change in video generation. The current gen with direct prompting, as impressive as they are, lack the quality to be anything more than AI slop for social media likes. What this does new is combining video, audio and context improvements through the use of an agent framework. https://g-vista.github.io/ Video examples on that site. WR for both single- and multi-scenes VISTA vs DP: https://arxiv.org/html/2510.15831v1/x1.png When Veo 3 released with audio, it was a huge moment but the novelty of it wore off. This seems to scale with compute, people probably wouldn't mind paying a decent sum for a decent result over spending it on DP iterations in hopes of something good. Off topics, but it's still funny reading the prompts glazing and instructing the models that they are experts and such.",
                "author": "CheekyBastard55"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Sebastien Bubeck of OAI, who made the controversial GPT-5 “found solutions” tweet, gives an impressive example of how GPT-5 found a solution via literature review",
        "score": 249,
        "text_content": "Link to tweet: https://x.com/SebastienBubeck/status/1980311866770653632 Link to post that recaps earlier controversy: https://www.reddit.com/r/OpenAI/s/e6KdkN1j2G",
        "comments": [
            {
                "raw_content": "This has been exactly my hope for years. There is too much information. We, as humans, cannot parse through all of it. Especially any one individual. I am convinced that there are great scientific discoveries just lying in wait in some obscure paper, or the solution lies in linking two or more obscure papers, just like has happened here. LLMs pose a potential solution to this.",
                "author": "_interloper_"
            },
            {
                "raw_content": "https://mathstodon.xyz/@tao/115385028019354838 Terence Tao talked about this being a good use of current AI",
                "author": "FateOfMuffins"
            },
            {
                "raw_content": "I saw a screenshot showing that the initial version of the tweet said \"solved\" and not \"found\". Is it true or a fake?",
                "author": "FeathersOfTheArrow"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini 2.5 Pro From June Still #1 On Simple Bench",
        "score": 24,
        "text_content": "https://simple-bench.com/index.html Any thoughts for why this is? We have had several models released after Gemini (Grok 4, GPT5, Sonnet 4.5), not a single one has been able to overtake Gemini 2.5.",
        "comments": [
            {
                "raw_content": "Probably the labs aren't optimizing for it. For that to happen, I guess it would have to either measure performance in the types of tasks they care about, or else be one of the handful of influential benchmarks that will make people think you have the best model if you're at the top of the chart.",
                "author": "Klutzy-Snow8016"
            },
            {
                "raw_content": "Gemini is strong in spatial/vision understanding.",
                "author": "LegitimateLength1916"
            },
            {
                "raw_content": "June is also only 4 months ago",
                "author": "PhysicalAd9507"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Free Google AI pro 1-year for students is finally available for almost every country.",
        "score": 47,
        "text_content": "It used to be only for 3 countries, then to 7 and now to almost every country. Just sharing it here with fellow students.",
        "comments": [
            {
                "raw_content": "Damn my .edu mail just keeps giving lol , of course you can't get a valid email you can use here from some website...",
                "author": "Funkahontas"
            },
            {
                "raw_content": "The 1 year plan is still going? I’m only getting a month free.",
                "author": "_PM_ME_RANDOM_SHIT"
            },
            {
                "raw_content": "\\*Cries in Russian\\*",
                "author": "Naughty_Neutron"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Movies are staring to include \"No AI was used in the making of...\" ect in the end credits",
        "score": 576,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I remember when they instantly replaced every pyrotechnic artist scum with CGI in 2000's because it was easier and cheaper to make worse explosions. It's not as if they'll keep paying artists top dollar just because their output was considered hard to do in 2022, they'll squeeze em and ask them to lie about any tangential AI use before that happens.",
                "author": "zappads"
            },
            {
                "raw_content": "Do you guys still remember the era of the \"soulless\" digital camera vs shooting movies on FILM?",
                "author": "PosThor"
            },
            {
                "raw_content": "No binary counting system was used producing this film. Only true analogue rolls.",
                "author": "amarao_san"
            }
        ],
        "subreddit": "singularity"
    }
]