[
    {
        "post_name": "This is Bad Bunny. He was just announced as the 2026 Super Bowl halftime show. - Massive Trump hater - Anti-ICE activist - No songs in English",
        "score": 885,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Bedazzled face means he wants to virtue signal his cock sucking prowess. Fuck the NFL.",
                "author": "MemphisMontoya71"
            },
            {
                "raw_content": "Looks like a faggot to me 🤷🏻‍♂️",
                "author": "Hangemh1gh"
            },
            {
                "raw_content": "Massive faggot sporting a pearl necklace from his tranny lover.",
                "author": "peterthegreen"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Antifa mob surrounds journalist Katie Daviscourt’s security guard outside Portland’s ICE facility, tries to rob him. No police present as crowd advances. National Guard needed to protect press rights where local police refuse.",
        "score": 764,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What a bunch of freaks. Gotta wonder how many diseases they have between all of them.",
                "author": "MAGA-Fett"
            },
            {
                "raw_content": "These are the people calling you an extremist.",
                "author": "deplorablebot"
            },
            {
                "raw_content": "WHAT THE FUCK IS THIS SHIT?",
                "author": "DebunkTheLeft"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Portland Police retreating from Antifa extremists after an officer was beat to a pulp.",
        "score": 735,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So the Portland PD surrendered to a domestic terror organization without a shot fired…..so sad",
                "author": "Magma_Biscuit"
            },
            {
                "raw_content": "Worthless fucks deserve it. Just pisses me off these deranged faggots keep getting away with shit.",
                "author": "genericamerican69"
            },
            {
                "raw_content": "Why is it not illegal to block a public road?",
                "author": "11GenAm"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Is anyone NOT on their list?",
        "score": 1248,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Faggots",
                "author": "doug2"
            },
            {
                "raw_content": "Wear this with a badge of honor. Fuck those retarded faggots.",
                "author": "MAGA_VANGUARD"
            },
            {
                "raw_content": "The ADL is a hate group, the irony.",
                "author": "RichardCranium88"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The ADL has just labeled Christians and Charlie Kirk’s TPUSA as organizations that promote hate and extremism.",
        "score": 1653,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The ADL is a hateful extremist organization.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Isn't that Defamatory for the Anti-Defamation League to do that?",
                "author": "McFatty7"
            },
            {
                "raw_content": "So the ADL hates Christians... Glad we cleared that up.",
                "author": "Foxbat"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🪭 The Schiff is about to hit the fan...",
        "score": 1588,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I do! I do! 🖐️",
                "author": "airborne3502"
            },
            {
                "raw_content": "I AM. I FUCKING AM. I VOTED FOR THIS. THIS IS PRECISELY WHAT I VOTED FOR.",
                "author": "Rydanovich"
            },
            {
                "raw_content": "I'll believe it when I see it",
                "author": "Sea_Still"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Missouri Governor Kehoe has officially signed the state’s new U.S. Congress maps into law, reducing Democrats to only ONE SEAT. Another Republican gain in Congress.",
        "score": 1634,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Win here, win there, win-win everywhere",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "About time Republicans found their balls. Offense is the best defense.",
                "author": "MrBelugaBiscuit"
            },
            {
                "raw_content": "Reddit is already whining that this is cheating.",
                "author": "Rydanovich"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Unbelievable. Go on then, interbreed, cut off your genitals, cancelling yourself right out of existence.",
        "score": 1074,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Clearly aimed at the muslim community. Suddenly we allow a known problem with genetics. Brilliant.",
                "author": "SweetSpot2020"
            },
            {
                "raw_content": "lmao thats why most muslims are double digit iqs",
                "author": "Merica4EVER"
            },
            {
                "raw_content": "Horseshit. History says otherwise. Fire the leftist incels on the NHS staff.",
                "author": "Shitsbrokeyo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 JUST IN: President Trump indicates he is still exploring legislation to ELIMINATE the capital gains tax on home sales. \"We're looking at that. It could be a very big positive...it would be a great incentive for a lot of people who really need money.\"",
        "score": 1276,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Eliminate property taxes instead",
                "author": "buildthatwall45"
            },
            {
                "raw_content": "Capital gains taxes only apply on earnings above $250,000/$500,000 for single/married people if they own the house 2 years and lived in it recently. And all of it is excluded if it is rolled into the purchase of another primary residence. At most, upping the limits might be a decent idea to keep up with the times, but removal of all capital gains taxes on homes would invite speculators to buy more houses instead of people who want to buy a home to live in. That additional demand would make the housing market even more insane than it is currently.",
                "author": "GuidedDisinfo"
            },
            {
                "raw_content": "Boomer Bailouts",
                "author": "Throwingway22"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Acting on orders from President Trump, Secretary of War Pete Hegseth has officially ordered the deployment of National Guard troops to Portland for 60 days",
        "score": 1710,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hopefully they dont just play defender.",
                "author": "DingleBalls"
            },
            {
                "raw_content": "Is he going to have to declare Martial Law? We are under attack by communists.",
                "author": "OlivaireBandaloo"
            },
            {
                "raw_content": "Antifa is a highly organized and well-funded far left militia group. They are NOT a protest group, they are NOT a political organization group, they are a paramilitary force that uses physical force to intimidate ideological rivals. Not just private citizens, but also local and federal government agencies and groups. They are not just some crazy kids with mask who riot, they include former military veterans who train them in the use of firearms and even IED's. They have waged a guerilla campaign against ICE since Trumps first administration, all with the help of the local Democratic party which controlled the politics of the city. Great documentary on that: https://www.youtube.com/watch?v=DjzdV0EA_Gs&t=88s While antifa does have actively friendly politicians and lawyers on their side, I think most of this help or turning a blind eye by local politicians is born more out of fear for their well being. Antifa is the modern day Ku Klux Klan.",
                "author": "Cyber1776"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ANTIFA targeting live streamers with copyright infringements",
        "score": 845,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There is nothing clever about DMCA trolling. This has been abused for years. # It is time to NULLIFY the DMCA.",
                "author": "USMC1234O10"
            },
            {
                "raw_content": "Fair use. Commentary on current news item.",
                "author": "cross_bearer_02"
            },
            {
                "raw_content": "They’ll just stream without audio now. Check.",
                "author": "madeaprofilejustforu"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Who is paying this scumbag?",
        "score": 829,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Alex Soros.",
                "author": "DeusVult1096"
            },
            {
                "raw_content": "Yeah clearly this is a big-budget operation 😂",
                "author": "Prandogolio"
            },
            {
                "raw_content": "Til they start beating the holy fuck out of these people, arrest and charge federally, or just opening fire, nothing changes.",
                "author": "cjcivicx"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "LMFAO! Give the Trump DHS social media staffer a raise, already! Anti-ICE protestor forgets to put her car in park, so it drifts into the lake and sinks. DHS: \"You can't park there!\" 😂",
        "score": 1011,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This was like a month ago but still funny",
                "author": "Sea_Still"
            },
            {
                "raw_content": "Nice parking spot, Rita!",
                "author": "Magasaurus_Rex_1"
            },
            {
                "raw_content": "It got tired of carrying her fat ass around and committed suicide.",
                "author": "IncredibleMrE1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "VIDEO - \"These are not revolutionaries. These are all regular leftists you see every day, outright advocating for murder.\"",
        "score": 1480,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hey hate all of us and want us killed. We should never give them a fucking inch.",
                "author": "Thrilly"
            },
            {
                "raw_content": "They're just like Muslims.. Fanatics Take a minute to listen to them, and they'll tell you exactly what they're about.",
                "author": "airborne3502"
            },
            {
                "raw_content": "There is a reason the founders didn't let women vote",
                "author": "South_Florida_Guy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "EXCLUSIVE: Sources close to the law firm representing Des Moines Public Schools internally believes Superintendent Ian Roberts is in serious trouble.",
        "score": 1361,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Uh, no question. Deport! And make him repay every cent to America.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Big Mike's former chief of staff should also be in serious trouble for hiring this creep",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Deport whoever made that guy a superintendent.",
                "author": "Siteless_Vagrant"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "💥 NOW: Antifa thugs are SCREAMING as Border Patrol shoots them with pepper balls at ICE Broadview...",
        "score": 1194,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They should just use real bullets as they are classified as terrorists.",
                "author": "Somebody157"
            },
            {
                "raw_content": "I'm not hearing screaming. I was told there would be screaming.",
                "author": "Pederella"
            },
            {
                "raw_content": "Less screaming, more cuffs. Arrest and hold these idiots without bail, AKA, the J6 treatment, and I think we'd see this nonsense stop.",
                "author": "bill_in_texas"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: U.S. Department of Energy will return $13 billion intended for Joe Biden's climate agenda to American taxpayers",
        "score": 1841,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So is that about... $3.50?",
                "author": "PUNCHSPLOSION"
            },
            {
                "raw_content": "Its about time we started getting all our stolen tax dollars back!",
                "author": "CatalystForChange"
            },
            {
                "raw_content": "How? Do we each get a check? Do the scum who don't pay taxes get a check too? Inquiring minds want to know...",
                "author": "Shayhawk"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "WTF? NBC is now making out ICE agents to be defenders of r*pe. They just won’t stop, no matter how many people are hurt, will they?",
        "score": 1444,
        "text_content": "",
        "comments": [
            {
                "raw_content": "NBC: \"RIPPED from the HEADLINES!!! (*which we also lie about*)\"",
                "author": "crashdaddy"
            },
            {
                "raw_content": "Yank their license once Smith-Mundt is reinstated.",
                "author": "glow-operator-2-0"
            },
            {
                "raw_content": "I stopped watching their crap 25 years ago. Leftist indoctrination.",
                "author": "Koikatrose"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Leftists dig in: Socialist Rifle Association Forums have been taken offline.",
        "score": 1282,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Translation: we need to move this somewhere that can't be scraped",
                "author": "ParticleCannon"
            },
            {
                "raw_content": "Communists must be identified and systematically removed from our society at every level.",
                "author": "SadFugeeFace"
            },
            {
                "raw_content": "A lot of people are underestimating the Lefty Fags, I'm not saying they have a chance at winning, not by a long shot, butvtheyll do some sorta damage and a significant amount of it until the Federal Government truly crushes them.",
                "author": "LokiHelmsdeep"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "☪️ “Hamdullah, Hamdullah, all praise is due to Allah”—Dearborn MI police chief. | Dearborn Michigan has been conquered! Islam is not compatible with western values.",
        "score": 1582,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The big issue we (Westerners) face is how do we get rid of them",
                "author": "IAmRetard"
            },
            {
                "raw_content": "Muslims are not compatible with any civilized society",
                "author": "Sea_Still"
            },
            {
                "raw_content": "Just remember. Any peaceful Muslims will happily watch the violent ones take over.",
                "author": "Filo76"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Asus releases major updates to ROG gaming laptops with stuttering and performance interruption fixes",
        "score": 270,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Context for those who didn't know about the Asus laptop stuttering problem; it was a poorly written BIOS that would do things such as attempt to power off the only GPU in the laptop every 30-60 seconds and the OS fights back (because otherwise the GPU crashes and the laptop needs to be hard reset to recover), causing latency spikes. It also put 100ms sleep calls in interrupt context (aka the CPU is **forced** to pause and can't do anything else for 100ms), and other broken logic that repeatedly trigger those sleep calls for even more latency spikes. It took someone decompiling the BIOS code to determine the root causes: https://www.reddit.com/r/hardware/comments/1niwi6e/asus_gaming_laptops_have_been_broken_since_2021_a/ -------------------------------------------------------------- > As the embedded tweet below emphasises, Asus has only released fixes for the ROG Strix Scar 15 (G533ZW) and Zephyrus M16 (GU604VI) that the company launched in 2023. > Even then, Asus stresses that these BIOS updates are still in beta. Presumably, fixes for more laptop models will follow in due course. Unfortunately, Asus has not provided a timeline for any of these additional laptops. Anyone want to take bet if the affected 2021-2022 laptops are patched or abandoned by Asus?",
                "author": "Blueberryburntpie"
            },
            {
                "raw_content": "I'm surprised this is coming out so quick after the Reddit post. Didn't even require a tech-tuber video, apparently.",
                "author": "Zarmazarma"
            },
            {
                "raw_content": "They would have never done it if it wasn't for the public shaming. Fuck Asus.",
                "author": "Sosowski"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Researchers achieve simpler, compact, and potentially cheaper hologram tech using OLEDs and Holographic Metasurfaces, potentially bringing holograms to smart phone and closer to everyday use",
        "score": 22,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not sure what OLEDs have to do with this more than any other light source. Anyway, they claim that > OLED displays normally need thousands of pixels to create a simple picture. This new approach allows a complete image to be projected from a single OLED pixel! but if these metasurfaces > create a **pre-designed** image on the other side, exploiting the principle of light interference would it not mean requiring thousands of custom ~~film slides~~ metasurface masks to display more than a single static image?",
                "author": "VastTension6022"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Does XeSS SDK 2.1.0 work on RX 6800 GPU for image quality upscaling only and how do I get it to work on Path of Exile 2?",
        "score": 0,
        "text_content": "Do I copy and paste the DLL from github like I did for xess 1.3? also this new one does it have better image quality than 1.3? And does frame gen work?",
        "comments": [
            {
                "raw_content": "Please read the sub rules before posting. That goes for *any* sub.",
                "author": "Prince_Uncharming"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Gamers Nexus] GPU Surgery: MSI Toy Story Pre-Built PC Review, Benchmarks, and Thermals",
        "score": 0,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's sad that such collaborations rarely see the day in western countries.",
                "author": "SJGucky"
            },
            {
                "raw_content": "I thought MSI was on GN’s blacklist?",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "Other than the damage I thought that was a really cool build. The Gundam one from ASUS was also really cool even if I'm not a fan of ASUS.",
                "author": "kuddlesworth9419"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nintendo's own Zurich Pop Con display reveals five Lego games are getting Switch 2 ports",
        "score": 99,
        "text_content": "Really hope this ends up happening.",
        "comments": [
            {
                "raw_content": "That’s pretty dope, I have 3 of the mentioned titles but skywalker saga could definitely use a bump in performance. I’d love to see marvel superheroes get that treatment too!",
                "author": "RegurgitatedMincer"
            },
            {
                "raw_content": "I've been playing Lego Star Wars on my PS4 Pro because it's much better than the Switch version. I would imagine the S2 version would be similar. I have the other ones on Switch, I would certainly pay an upgrade fee to boost them.",
                "author": "Mysticwaterfall2"
            },
            {
                "raw_content": "I hope we don't have to pay for the switch 2 upgrades for these.",
                "author": "zane1345"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Got Switch 2 working fully on Xreal Air 2",
        "score": 114,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wait what is this insane piece of hardware? AR glasses that can work as a display for many different devices? This legitimately seems like a huge game changer, why don’t people talk about it more?",
                "author": "lilmitchell545"
            },
            {
                "raw_content": "I bought the same thing for my RayNeo 3. Fucking game changer. I 3d printed a bracket so this hub mounts behind the switch. Switch 2 + display glasses are the best match.",
                "author": "minion866"
            },
            {
                "raw_content": "I've been curious. How is the image quality? And are there opacity issues? Input lag? Frame rates on the image?",
                "author": "BeaveItToLeever"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The Sunday Setup! What's everyone playing today?",
        "score": 122,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hades. The first one. Having a blast!",
                "author": "-powke-"
            },
            {
                "raw_content": "Hogwarts Legacy, used the recent disount for the Switch 1 version and updated to the Switch 2 version.",
                "author": "lastemperorjubei"
            },
            {
                "raw_content": "Hades 2 for me. Been a really fun ride so far.",
                "author": "GrimSlayer"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "It’s Sunday morning, and I’m 12 again fighting the depths of hell. What’s your favorite nostalgia game on Switch2?",
        "score": 107,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That would be Skyrim for me, wish they updated it to 60 fps on S2",
                "author": "spruilleach"
            },
            {
                "raw_content": "Diablo 2 for me too, I just wish they did a 60 fps patch for Switch 2.",
                "author": "alexanderluko"
            },
            {
                "raw_content": "I remember I was so excited for this and after a few hours it just didn’t hold up for me like when I was a kid.",
                "author": "gamerdudeNYC"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Maiden Voyage",
        "score": 116,
        "text_content": "Trip to Germany from the US and it didn't disappoint (made better by a power bank). Cyberpunk and TOTK the whole time!",
        "comments": [
            {
                "raw_content": "Looks like my homescreen exactly, just downloaded MK8D.",
                "author": "Exact-Tie-9082"
            },
            {
                "raw_content": "It also gets enough charge plugging into the seat usb plugs on most airplanes FYI",
                "author": "mksm0k3"
            },
            {
                "raw_content": "What power bank do you have? I'm looking to take one with me on a trip to Japan next year.",
                "author": "Sorry-Bluebird"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Resident Evil Requiem: Switch 2 Gameplay (Off-Screen) | TGS 2025",
        "score": 59,
        "text_content": "looks amazing",
        "comments": [
            {
                "raw_content": "It does look great Not really an re guy but I might try it",
                "author": "zaadiqoJoseph"
            },
            {
                "raw_content": "Somebody posted this same video on this sub today.",
                "author": "Rawkhawkjayhawk"
            },
            {
                "raw_content": "I like how she still checked the pulse of that very clearly very dead man haha",
                "author": "BeaveItToLeever"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Resident Evil Requiem: Switch 2 Gameplay (Off-Screen) | TGS 2025",
        "score": 156,
        "text_content": "Gameplay looks pretty good. A few stutters here and there but nothing that can't be fixed with a bit more optimization.",
        "comments": [
            {
                "raw_content": "For a demo build this is amazing, let Capcom cook.",
                "author": "Rawkhawkjayhawk"
            },
            {
                "raw_content": "I’m very impressed with the effort Capcom is putting into this and I want this to succeed on switch 2, BUT I’m torn cause I still will probably buy it for my ps5",
                "author": "NewDamage31"
            },
            {
                "raw_content": "Amazing 60fps. Cant wait for it to release tbh",
                "author": "HeatThen9482"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Resident Evil Requiem Director Koshi Nakanishi Confirms The Hooded Figure Is Indeed A Brand New Character",
        "score": 380,
        "text_content": "TheGamer Interview: [https://www.thegamer.com/resident-evil-requiem-director-reveals-who-mysterious-hooded-character-is/?taid=68d842735954ca0001859399&utm\\_campaign=TrueAnthem-TG&utm\\_medium=Social-Distribution&utm\\_source=Twitter](https://www.thegamer.com/resident-evil-requiem-director-reveals-who-mysterious-hooded-character-is/?taid=68d842735954ca0001859399&utm_campaign=TrueAnthem-TG&utm_medium=Social-Distribution&utm_source=Twitter) Dusk Golem Post From A Month Ago: https://www.reddit.com/r/GamingLeaksAndRumours/comments/1mqq001/two_more_resident_evil_requiem_spoilers_from_dusk/",
        "comments": [
            {
                "raw_content": "Just as a reminder, Arkham Knight was also indeed a brand new character.",
                "author": "NikothePom"
            },
            {
                "raw_content": "My theory is it’s Brandon Bailey, one of the founders of Umbrella and the leader of Connections. Would be a nice way to tie the events of 7/Village into the rest of the series while also ending the whole Connections plot line.",
                "author": "Noahrules99"
            },
            {
                "raw_content": "Begging his backstory is unrelentingly stupid. Like he's Jills cousin who got shitty for losing his house during the Raccoon City bombing. His name is Dave and he worked as a plumber. He was so close to paying his mortgage off and just like that his whole fuckin house exploded. He never got over it coz that was a nice house and it took a lot of hard work to get.",
                "author": "Afrodite_33"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Hotel Samsara - Codes and Puzzles with Frictional Games New Project",
        "score": 30,
        "text_content": "With the release of the Soma Anniversary, Frictional Games included a secret link that led to a website called Hotel Samsara. This seems to be a teaser for their next project ip. The website itself however seems to be full of secrets as well. If you sign up to receive emails from them, you will receive strange messages, some of which use glitchy text, one that was upside down, and another speaking of people disappearing and the importance of checking back regularly for updates. In the most recent email however, and the reason I'm typing this all out, there seems to be some clues to a code of sorts which I am unable to crack on my own. I was wondering if anybody wanted to help? The message reads: \"Password Reminder [USERNAME] Thank you for requesting a reminder for your password. XXXXXX Your memorable hint: For the five, seek the paths. For the sixth, shrouD empty siren, contra totem; omni whispers.\" I did not request for a password reminder, nor was I ever prompted to enter a password when signing up. Looking closely at the message, I figured the x's could be a clue as to how many letters go into this password, and that maybe other people receiving these emails got a different clue. Mine says for the five and the sixth, so maybe one of you know what the clues for the first, second, third, etc. could be? Also, the D is capitalised in shrouD. Checking the website closely again there appear to be certain letters that are bold in contrast to the others. I wrote down all I could find here: SteganogRapH And then the D might be added to the end. I have no clue as to what this could mean, whether it be an anagram or what. Perhaps I am missing more clues. Is there anyone out there following along with this project to see where it leads? Frictional is one of my favorite developers, and it's real exciting to see them slowly unveiling a new cryptic project. Also to note, the link in the email to confirm my address had the name Kepler Interactive to it. Maybe this confirms they are working with Frictional on this new game? Let me know your thoughts!",
        "comments": [
            {
                "raw_content": "I find it odd that Kepler is publishing their next game considering they have always published their own games but I guess there is a first for everything..",
                "author": "Glass-Dog-2786"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Santa Monica Studio Community Manager referencing the reaction to the Wolverine trailer: \"I can't wait until it's my turn.\"",
        "score": 5,
        "text_content": "They might be revealing something soon: [https://xcancel.com/BlueOwlzMedic/status/1972414385881837997](https://xcancel.com/BlueOwlzMedic/status/1972414385881837997) .",
        "comments": [
            {
                "raw_content": "Probably the 2.5d god of war metroidvania unless...",
                "author": "Leaks4EVR"
            },
            {
                "raw_content": "Meh, doesn’t really hint at much. Every game dev is working on something they can’t wait to be revealed.",
                "author": "1vortex_"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "New Intel Panther Lake B0_3 stepping spotted, announcement may be near",
        "score": 52,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wonder what MSI will cook up for a Pantherlake CPU",
                "author": "WolfishDJ"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Over a decade later, AMD Radeon HD 7000 GPUs still receive Linux updates from one Valve developer",
        "score": 716,
        "text_content": "",
        "comments": [
            {
                "raw_content": "this is why linux rocks the llamas ass",
                "author": "Brorim"
            },
            {
                "raw_content": "8th gen console GPUs, 8 GB shared RAM for 2013 PS4/Xbox one. While average midrange PC gpu in 2013-2015 were running in 2 GB VRAM Best midrange value for that console generation: 2017 RX 500 series. With 4 GB minimum VRAM. 8 GB VRAM for 10 year usage.",
                "author": "JgdPz_plojack"
            },
            {
                "raw_content": "pitcairn is the unsung greatest of all time tbh",
                "author": "G-Tinois"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "How AMD is re-thinking Chiplet Design",
        "score": 217,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Great video. It now explains exactly why AMD chiplet processors up until now have had much higher idle power (20-40 watts) compared to intel processors and even AMD's APUs. The lower idle power (6-12 watts) is confirmed by [this recent review of Strix Halo](https://youtu.be/BTIUL-yaY4s?feature=shared&t=425).",
                "author": "thunk_stuff"
            },
            {
                "raw_content": "Another quality High Yield video! Really amazing tech, but my question is how much will the cost of the organic RDL impact Zen 6 prices.",
                "author": "Gachnarsw"
            },
            {
                "raw_content": "It's such a shame the single CCD chips couldn't use both SERDES, 9800X3D would be even better. I suspect it's because they didn't want to have two different substrates for the consumer platform.",
                "author": "ILikeRyzen"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Awesome Case From 2009",
        "score": 399,
        "text_content": "Got this Thermaltake V3 Black AMD Edition from ShopGoodwill for a pretty reasonable price. It was filthy inside and the fans were ancient and junk, but some cleaning and 3 red led fans later it's ready for a build. It would work well for a sleeper - plenty of airflow, psu on the bottom, etc, but I think I'm going to do a authentic 2010 all-AMD build because I already have the parts, unless I happen to come upon a money tree.",
        "comments": [
            {
                "raw_content": "I've never seen anything like this before, I quite like it. Those years had some wild cases for sure.",
                "author": "Symphonic7"
            },
            {
                "raw_content": "the old Cases for PCs had so much more flare that you could truly design your own theme. Now we just get fish tank designs.",
                "author": "urlond"
            },
            {
                "raw_content": "The green AMD logo is definitely a blast from the past.",
                "author": "Username134730"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "MSI confirms MAX and EVO refresh motherboards feature 64MB BIOS",
        "score": 82,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why does this matter? Please someone inform me",
                "author": "why_is_this_username"
            },
            {
                "raw_content": "i don't think this is going to be that much relevant, most AM5 boards have a 32MB bios chip iirc. The bios on my b650e-e was around 9MB when released, and just before ryzen 9000 it was around 11MB and went to 13 with Zen 5, so yea, cpu's shouldn't really be an issue ihmo, worst case they can drop some useless stuff. They also stated it is to preload some stuff like networks drivers so yea, marketing since you can always download a driver on the phone or use the phone network on the pc even without drivers. I could be wrong obvsly but who knows, i wouldn't buy a board just for that.",
                "author": "FeelThe_Thunder"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Colorful X870E iGame Vulcan spotted with two memory slots, built for AM5 overclocking",
        "score": 16,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Colorful has some really cool designs on their motherboards",
                "author": "Symphonic7"
            },
            {
                "raw_content": "Good design, probably China only. Comes with actually finned heatsinks for vrm and nvme, that thing next to the dimms is an lcd/oled screen.",
                "author": "Obvious_Drive_1506"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "30 Issues in 30 Days: Rent Regulation | The Brian Lehrer Show | WNYC",
        "score": 6,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A deep dive into rent control and its history on apartments in NYC.",
                "author": "20_mile"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "OAI researcher tweets out blog from quantum physics researcher acknowledging that for the first time he used AI (GPT-5 Thinking) in “a key technical step” to prove main result of a paper",
        "score": 399,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is the stage AI is at the moment, it can help you a great deal sometimes IF you are subject matter expert yourself. It cannot yet replace much or anyone, but it can accelerate research or work of people. This was not the case year ago and with GPT-4, no matter who may say otherwise or that ''we hit the wall''... Now how big is the value of that , who knows, we will see in next OpenAI revenue reports",
                "author": "avatarname"
            },
            {
                "raw_content": "Cant wait for this subreddit to tell us how this expert in the field is wrong and they are right because they read a thread on reddit that said chatgpt 5 is bad.",
                "author": "ArialBear"
            },
            {
                "raw_content": "“I guess I should be grateful that I have tenure” lmao 🤪",
                "author": "Educational_Teach537"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "AI is Replacing Human Jobs and Not Creating New Ones",
        "score": 30,
        "text_content": "Boomers and Gen X leaders spent decades prioritizing greed. They didn’t retrain their own peers for this new technology. In the industrial revolution displaced workers eventually found work in new sectors. But with AI we are talking about algorithms that don’t need breaks, benefits, or replacements. The work just vanishes. So no new jobs. If workers have no income then how does the capitalist sell products? And the AI tool replacing us uses our clean drinking water… Also people in their 40s, 50s, and 60s are right now being automated out of work, often without pensions and younger generations are stuck with high college debt. What happens if everyone has no job? So no real winners in the end. Can we choose something else?",
        "comments": [
            {
                "raw_content": "I'm shifting my perspective on this, especially after seeing China deploy 2 million robots in autonomous factories. It seems highly probable that humans will face displacement without viable alternatives. The real questions is how fast.",
                "author": "Ok_Green_1869"
            },
            {
                "raw_content": ">If workers have no income then how does the capitalist sell products? That is why Varoufakis, Harari and others are saying this is a transition from democratic capitalism to techno neo-feudalism. There is no employment in feudalism, there are lords and those who survive off the land.",
                "author": "trisul-108"
            },
            {
                "raw_content": "UBI, start of a new human era. Besides, we'll be second place to the new ai soon. No, really.",
                "author": "Creative-Resident-34"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "2026 will be a pivotal year for the widespread integration of AI into the economy",
        "score": 202,
        "text_content": "Julian Schrittwieser (AI researcher at Anthropic) blog https://www.julian.ac/blog/2025/09/27/failing-to-understand-the-exponential-again/ 2026 will be a pivotal year for the widespread integration of AI into the economy: Models will be able to autonomously work for full days (8 working hours) by mid-2026. At least one model will match the performance of human experts across many industries before the end of 2026. By the end of 2027, models will frequently outperform experts on many tasks.",
        "comments": [
            {
                "raw_content": "Every year AI capabilities double and our expectations quadruple. We'll get there eventually. It will be beyond our current expectations. And we'll be disappointed the whole time.",
                "author": "ToasterThatPoops"
            },
            {
                "raw_content": "Soon ™",
                "author": "JuniorDeveloper73"
            },
            {
                "raw_content": "I wonder what the last months of 2028 will look like. That 'Situational Awareness' forecast could possibly have been too conservative. Things could also go kaput by then, but there's good reason to expect ASI before 2030..",
                "author": "AngleAccomplished865"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"HSBC demonstrates world’s first-known quantum-enabled algorithmic trading with IBM \"",
        "score": 41,
        "text_content": "I wonder what, if anything, this implies for market dynamics: [https://www.hsbc.com/news-and-views/news/media-releases/2025/hsbc-demonstrates-worlds-first-known-quantum-enabled-algorithmic-trading-with-ibm](https://www.hsbc.com/news-and-views/news/media-releases/2025/hsbc-demonstrates-worlds-first-known-quantum-enabled-algorithmic-trading-with-ibm) \"Algorithmic trading in the corporate bond market uses computer models to quickly and automatically price customer inquiries in a competitive bidding process. Algorithmic strategies incorporate real-time market conditions and risk estimates to automate this process, which allows traders to focus their attention on larger and more difficult trades. However, the highly complex nature of these factors is where the trial results showed an improvement using quantum computing techniques when compared to classical computers working alone using standard approaches. HSBC and IBM’s trial explored how today’s quantum computers could optimise requests for quote in over-the-counter markets, where financial assets such as bonds are traded between two parties without a centralised exchange or broker. In this process, algorithmic strategies and statistical models estimate how likely a trade is to be filled at a quoted price. The teams validated real and production-scale trading data on multiple IBM quantum computers to predict the probability of winning customer inquiries in the European corporate bond market.\"",
        "comments": [
            {
                "raw_content": "Why?",
                "author": "K1mbler"
            },
            {
                "raw_content": "> I wonder what, if anything, this implies for market dynamics Why don't you ask chatgpt (or gemini on google) to tell you.",
                "author": "Spare-Dingo-531"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Yeah",
        "score": 182,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I feel like it depends a lot on the framework/language, they're just surprisingly good at some but total asses in others (they even sometimes have to be reminded constantly to not make a specific error). And ironically AIs making errors are the perfect opportunity for me to actually learn the framework/module/language I'm messing with. But across the board, the AI saves a lot of time nonetheless.",
                "author": "TarkanV"
            },
            {
                "raw_content": "The emojis lmao",
                "author": "GraceToSentience"
            },
            {
                "raw_content": "To people who swear that these tools can code better than humans, how do you do it? I describe even simple spreadsheet set-ups with intermediate formulas and ChatGPT / Copilot fuck it up more often than get it right. If you tell me it takes better prompting, how is that useful? It takes lots of time to choose each word? It takes special skill in \"prompt engineering\"? Why do I have to learn how to talk to a machine in a way I would neither talk to normal software that needs precise instructions or a person who needs different precise instructions, but can meet me halfway on so many things? You just replaced one specialized skill with another and if AI does it, you can't fix it easily. You consume time in a different way. I fail to see the value behind the hype. Likely someday these problems will be removed but the idea that companies are getting rid of their personnel this soon just seems batshit to me.",
                "author": "anjowoq"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"Transforming histologic assessment: artificial intelligence in cancer diagnosis and personalized treatment\"",
        "score": 20,
        "text_content": "[https://www.nature.com/articles/s41416-025-03206-y](https://www.nature.com/articles/s41416-025-03206-y) \"Artificial intelligence (AI) is transforming histologic assessment, evolving from a diagnostic adjunct to an integral component of clinical decision-making. Over the past decade, AI applications have significantly advanced histopathology, facilitating tasks from tissue classification to predicting cancer prognosis, gene alterations, and therapy responses. These developments are supported by the availability of high-quality whole-slide images (WSIs) and publicly accessible databases like The Cancer Genome Atlas (TCGA), which integrate histologic, genomic, and clinical data. Deep learning techniques replicate and enhance pathologists’ decisions, addressing challenges such as inter-observer variability and diagnostic reproducibility. Moreover, AI enables robust predictions of patient prognosis, actionable gene statuses, and therapy responses, offering rapid, cost-effective alternatives to conventional methods. Innovations such as histomorphologic phenotype clusters and spatial transcriptomics have further refined cancer stratification and treatment personalization. In addition, multimodal approaches integrating histologic images with clinical and molecular data have achieved superior predictive accuracy and explainability. Nevertheless, challenges remain in verifying AI predictions, particularly for prognostic applications and ensuring accessibility in resource-limited settings. Addressing these challenges will require standardized datasets, ethical frameworks, and scalable infrastructure. While AI is revolutionizing histologic assessment for cancer diagnosis and treatment, optimizing digital infrastructure and long-term strategies is essential for its widespread adoption in clinical practice.\"",
        "comments": [],
        "subreddit": "singularity"
    },
    {
        "post_name": "AGI and the future of work: Restrepo (2025) + 7-month time-horizon trend",
        "score": 31,
        "text_content": "Prof. Pascual Restrepo (Yale) wrote a paper arguing that once AGI arrives, *bottleneck* tasks will be automated, output will become additive in computation, wages will decouple from GDP, and the labor share will tend to zero. This is scary because the current capability trends, see a recent analysis of METR’s “time-horizon” data (\\~7-month doubling). * Paper (NBER chapter): [https://www.nber.org/books-and-chapters/economics-transformative-ai/we-wont-be-missed-work-and-growth-era-agi](https://www.nber.org/books-and-chapters/economics-transformative-ai/we-wont-be-missed-work-and-growth-era-agi) * Medium analysis (METR time-horizons): [https://medium.com/@AIchats/are-ai-time-horizon-doubling-every-seven-months-e337162eec83](https://medium.com/@AIchats/are-ai-time-horizon-doubling-every-seven-months-e337162eec83) I did a back-of-the-envelope calculation * Assuming the capability of AI increases by 10% and that of Humans decreases by 10% (this is conservative relative to METR) every 7 months. * Ignoring accessory (non-bottleneck) work because it doesn’t pin growth. Result (every 7 months): * 0 mo: AI 10%, Human 90% * 7 mo: AI 20%, Human 80% * 14 mo: AI 30%, Human 70% * ... * 56 mo: AI 90%, Human 10% * 63 mo: **AI 100%, Human 0%** (all bottlenecks automated) There are many assumptions and uncertainties in all of this. In particular we take N=10 sequential, equally weighted bottleneck stages with geometric compute thresholds, a capability that grows deterministically with a 7-month doubling, adoption that is instantaneous (I think it will be fast generally but not very fast in europe), results are read at 7-month increments as a step function, accessory work is ignored, and no shocks, costs, constraints, feedbacks, or task heterogeneity. But there is merit in this back-of-the-envelope calculation. In that the message is that we are likely completely screwed.",
        "comments": [
            {
                "raw_content": "oh come on... u mean in 5 years time we are supposed to have Ai farming and gardening, milking cows and slaughtering livestock, process and package the meat, deliver to supermarkets, transfer, sort and update inventory then display on shelves for sale. umm ok.... and that's just one scenario for one industry (agriculture and food) seriously.... that's not gonna happen in 5 years.",
                "author": "IntroductionSouth513"
            },
            {
                "raw_content": "This is the METR paper quoted there: https://arxiv.org/pdf/2503.14499 That post is just the perfect example of taking a few data points and extrapolating into the future without doing a basic sanity check. The METR paper talks about coding and engineering tasks. NOT ALL HUMAN TASKS. Unless everyone is doing a heavily quantitative job that requires nothing but just processing code (and still you would still need humans to act as architects and gatekeepers), this doesn't make any sense.",
                "author": "livingbyvow2"
            },
            {
                "raw_content": "Wages started to be decoupled from productivity since 1975 for non-managerial positions. Think the paper is accurate but I don't think we need full blown agi to see the effects of AI and automation. Already there is a 50/50 split between capital and labor so it will drift more towards capital.",
                "author": "Correct_Mistake2640"
            }
        ],
        "subreddit": "singularity"
    }
]