[
    {
        "post_name": "John Solomon summarizes his new bombshell that James Comey was leaking classified information to the New York Times",
        "score": 922,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I remember Comey saying he gave info to a friend who gave it to the NYTimes. He was pretty smug about it.",
                "author": "Mamapedia"
            },
            {
                "raw_content": "Put Comey in the same cell as Adam Schiff.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "How is this bombshell when we've known about this since last term. Crazy pills.",
                "author": "Awakened"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Secretary of State Marco Rubio is actively moving towards designating the MUSLIM BROTHERHOOD as a terrorist organization.",
        "score": 1025,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">\"The Muslim Brotherhood must understand that their work in America is a kind of grand jihad in eliminating and destroying the Western civilization from within and sabotaging its miserable house by their hands and the hands of the believers.\" That is from the Muslim Brotherhood's 1991 document, \"General Strategic Goal for North America.\" You can read the entire document [here.](http://archive.is/L12VI) English begins on page 15. It's not long. Pay close attention to the sections on \"settling\" North America. ----------- The death cult of Islam relies on a foundation of Western ignorance. Read, understand, refute, educate others. Fight ignorance. **FIGHT BACK!**",
                "author": "DiamondsOnTheFloor"
            },
            {
                "raw_content": "Trying to figure out why this wasn't done years ago.",
                "author": "LostElf"
            },
            {
                "raw_content": "Good",
                "author": "Pederella"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Democrat Harris County Texas Judge Natalia \"Nata\" Cornelio BREAKS THE LAW and grants bond to a Violent Felon, Jared Wilson, who was charged with “Aggravated Assault”. Senate Bill 6 passed in Texas PROHIBITS bond for individuals charged with violent crimes including, Aggravated Assault.",
        "score": 804,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What's the fucking penalty then?",
                "author": "AngeredKabar"
            },
            {
                "raw_content": "# I am CoOrNeLio I need TeePee for my BunGhoLiO **Like seriously, folks. Time to DEPORT this faggot fake judge!**",
                "author": "MAGAGIRL69"
            },
            {
                "raw_content": "Re-arrest him and put her in the same cell...",
                "author": "Moebius"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ASTROTURF: Company That Provides Paid Protesters Reports 400 Percent Increase as Trump Cracks Down on DC Crime",
        "score": 495,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lol. Imagine getting paid to go to jail and maybe even to prison. Nah. Stupid is as stupid does.",
                "author": "Boomstikchik"
            },
            {
                "raw_content": "why are paid protestors legal. we should be able to arrest them. if you're a real protestor fine, i hate you and you're dumb, but fine.",
                "author": "thelastlast"
            },
            {
                "raw_content": "If your paid, your not a protester. You're are an activist.",
                "author": "throttlejohnson"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "While we’re on the topic of crime in DC…",
        "score": 1213,
        "text_content": "",
        "comments": [
            {
                "raw_content": "HIS NAME WAS SETH RICH! Murdered in cold blood by the DNC. Original supplier of the Wikileaks",
                "author": "meanwhileinamerica"
            },
            {
                "raw_content": "A man was just murdered in a robbery gone gone with no motive and nothing taken from him, QUICK let’s go to his home over 1 mile away and confiscate his laptop to investigate this crime we’ve already “solved”",
                "author": "lifeisahologram"
            },
            {
                "raw_content": "Seth Rich!!",
                "author": "Kael"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "American Eagle Jeans Are Only Available Up To Size 18",
        "score": 1029,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Even 2 18's aren't big enough for half of one of those creatures.",
                "author": "conservativefrank"
            },
            {
                "raw_content": "Sistas from another mista.",
                "author": "lovemylibs"
            },
            {
                "raw_content": "It used to be up to size 12 for brands like AE and A&F. Size 10 and 12 jeans were often placed up high on the shelves to shame fat people by making them reach, stretch, or ask for help to get their size. They did stuff like that back in the day. They didn’t want fat people wearing their clothes. And they’d burn what they didn’t sell because they also didn’t want poor people wearing their clothes.",
                "author": "2000mules2000arrests"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "MAGA men only think about one thing, and it's awesome!",
        "score": 936,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A real man can think about more than one thing at a tit... I mean time!",
                "author": "SBOJ_JOBS"
            },
            {
                "raw_content": "option B: where the fuck are the epstein ARRESTS!?",
                "author": "Deplorable556"
            },
            {
                "raw_content": "Sydney is still attractive without makeup, but very different lol. I'm honestly not trying to shit on her but it's false advertising",
                "author": "TayzinBros"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "List of Leaders and Governments Nominating President Trump for the Nobel Peace Prize",
        "score": 1109,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The Nobel Peace Prize is meaningless. Take a look at who the past winners were: Obama. Al Gore and the IPCC. The fucking EU, as a whole. It doesn't really matter whether Trump wins it or not.",
                "author": "canadianhere"
            },
            {
                "raw_content": "Zelenskyy should nominate President Trump if he knows what’s good for him",
                "author": "TakingAction"
            },
            {
                "raw_content": "Tell NOBEL to kick rocks and decline their commie bullshit offer.",
                "author": "OldZilla"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "⚠️ JUST IN: Howard Saal, a doctor at @CincyChildrens, has been federally charged with multiple crimes, including transportation and possession of child p*rnography, with some victims being as young as NEWBORNS...",
        "score": 1089,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Every single time...",
                "author": "NukeTheNarrative"
            },
            {
                "raw_content": "That guy just oozes \"Early Life\"",
                "author": "UncleDonsBand"
            },
            {
                "raw_content": "Fucking kill him.",
                "author": "JoeMcCarthyWasRight"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Didn't Earn It",
        "score": 1055,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Diversity trifecta: 1) black 2) woman 3) probably lesbian",
                "author": "Jack_NC"
            },
            {
                "raw_content": "Reward for J6 complicity. Tiresome.",
                "author": "ElectionDenier2020"
            },
            {
                "raw_content": "She was asked what the chain of command was at the press conference. Her answer was: “What is that?” I wish I had a clip.",
                "author": "CantStumpIWin"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "MIRGA - Make Ice Raids Great Again: More than 100,000 Americans have applied to join Immigration and Customs Enforcement (ICE).",
        "score": 865,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And I’m one of them",
                "author": "TheSonOfGadsden"
            },
            {
                "raw_content": "Man, if we could get all those 100k people to arrest 100 people a year we could be on to something!!",
                "author": "BMCKid"
            },
            {
                "raw_content": "Thank You for your attention to this matter!",
                "author": "Herc130"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🪖 Beautiful! The National Guard is now patrolling the streets of DC!",
        "score": 975,
        "text_content": "",
        "comments": [
            {
                "raw_content": "unless this is permanent the joggers will just come back when they leave lol",
                "author": "magaspif"
            },
            {
                "raw_content": "Look at the way people can walk down the street in peace. Such fascism.",
                "author": "TrumpShadow"
            },
            {
                "raw_content": "Haven’t seen that since the election was stolen.",
                "author": "CovfefeVideo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Texas Senate Officially PASSES New Congressional Map — Democrats STORM OUT in Protest (VIDEO)",
        "score": 1696,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Symbolic but neccessary.",
                "author": "DrJosephWarren"
            },
            {
                "raw_content": "Hilarious, as the biggest difference from the map is the un-mandering of TX district 35. It no longer snakes from San Antonio to Austin. The district map actually looks normal now.",
                "author": "AllahFubar"
            },
            {
                "raw_content": "I thought all the democrats fled to Illinois where there is absolutely no gerrymandering whatsoever?",
                "author": "Filo76"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I hope this tweet makes lefties seethe with rage 🚙😂",
        "score": 882,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This was posted like 4 days ago come on guys",
                "author": "djentropyhardcore"
            },
            {
                "raw_content": "2nd time this was a sticky haha",
                "author": "PiratePatriotParrot"
            },
            {
                "raw_content": "Do they have any $150k/year positions? And can I still do at least a week of deportations per month between technical work?",
                "author": "BigIgloo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Weez Bee Nahtwahl Beeuteez N Sheeiiit!",
        "score": 684,
        "text_content": "",
        "comments": [
            {
                "raw_content": "**\"I'll take the one from the right half of the menu, please.\"**",
                "author": "wonderfulusa"
            },
            {
                "raw_content": "What a retarded name lmao",
                "author": "Bullet_Tooth_Tony"
            },
            {
                "raw_content": "I thought that was illhan omar",
                "author": "TurdBurglarGrimace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Adam Schiff abused his power by demanding that Twitter ban journalist Paul Sperry",
        "score": 1515,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There is more than enough evidence to arrest that fucker yesterday",
                "author": "Sea_Still"
            },
            {
                "raw_content": "ARREST HIM ALREADY, FFS!",
                "author": "MythArcana"
            },
            {
                "raw_content": "Schiff subpoenaed phone records of congressmen on his own committee.",
                "author": "Induceddrag"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "NEW - UK government urges citizens to delete emails to save water.",
        "score": 1391,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why not simply deport the Muslim filth and everyone will have enough water in ENGLAND again. Holy shit with this retardation.",
                "author": "MythArcana"
            },
            {
                "raw_content": "Data sitting on a drive, whether SSD or HDD doesn't use any energy unless it is recalled and put into RAM",
                "author": "Zskills"
            },
            {
                "raw_content": "Translation : Our shitty AI spying on your email is wasting a lot of energy so please make it easier for us to spy on you by deleting the ones that don't matter.",
                "author": "Raos044"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "California Dreamin'! Leftist Drools All Over 'Fighter' Gavin Newsom Who 'Terrifies' Trump (NOT!)",
        "score": 600,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Mandatory response to anything Newsom. How do you feel about Weinstein?",
                "author": "lovemylibs"
            },
            {
                "raw_content": "Faggots",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "didn't this faggot ass fuck california raw, they still like this guy? I could of sworn even the most demented leftist hated him",
                "author": "Twitter"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Foreign-born population has dropped 2.2 million since January | Just The News",
        "score": 1661,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They have to go back",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Get them all out. I don't care if they've been here for 30 years. SEND THEM PACKING!",
                "author": "TrumpShadow"
            },
            {
                "raw_content": "Good. Less people = less housing demand = lower house prices = more homeowner bagholders forced to sell at lower prices",
                "author": "McFatty7"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "WEIRD.",
        "score": 957,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They keep telling us that we have no culture. We have stupid jokes like \"what's the difference between white people and bacteria? If you leave them both alone for a hundred years, the bacteria will grow a culture.\" Stupid. We *have* a culture. Several cultures, actually. We've got several unique takes on Christianity. We've got absolute dominance in entertainment including movies and music.",
                "author": "CommanderOfCheese"
            },
            {
                "raw_content": "Modern progressive social anthropologists will go African villages and be amazed at the cow dung and plant fibers used in their mud huts, and wonder why we can't be as environmentally advanced as them.",
                "author": "spez_this"
            },
            {
                "raw_content": "Because Jews run everything and they hate white Christians with every ounce of their being.",
                "author": "Priopism"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "CT scan peels back the layers of time to reveal the engineering within Intel’s iconic 386 CPU — exposing intricate pin mapping, hidden power planes, and more",
        "score": 128,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If you want to experiment with Lumafield's 3-D scan of the 386, it's here: [https://voyager.lumafield.com/project/11b55bba-910c-4c78-8e73-467157c64032](https://voyager.lumafield.com/project/11b55bba-910c-4c78-8e73-467157c64032) Also, my original article is here: [https://www.righto.com/2025/08/intel-386-package-ct-scan.html](https://www.righto.com/2025/08/intel-386-package-ct-scan.html)",
                "author": "kenshirriff"
            },
            {
                "raw_content": "The article states it's even made 3D! > The scan produced hundreds of razor-thin X-ray slices, which were stitched into a 3D model you can spin, zoom, and digitally “peel” layer by layer. The first reveal is a halo of gold bond wires, each just 35 µm thick, far thinner than a human hair, radiating from the silicon die. These act as microscopic suspension bridges between the die’s pads and the package’s internal routing. Some carry simple data or control signals, others gang together—up to five on a pad—to handle the heavier demands of power and ground.",
                "author": "Helpdesk_Guy"
            },
            {
                "raw_content": "Ken Shirriff (the writer of the post this story is based on) has some other *really* cool posts reverse engineering on old silicon, great if you're interested in that sort of thing generally https://www.righto.com/p/index.html",
                "author": "Jonny_H"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[News] TSMC Reportedly Phases Out Legacy Production, Closing 6-Inch Fab 2 and 8-Inch Fab 5 by 2027",
        "score": 35,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The machinery will probably be sold to a trailing edge foundry somewhere.",
                "author": "cambeiu"
            },
            {
                "raw_content": "Intel goes bankrupt TSMC is the future TSMC is an obligation, monopoly by TSMC is justice",
                "author": "Illustrious_Bank2005"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Undervolted Zotac RTX 5090 reportedly catches fire during Battlefield 6 session",
        "score": 441,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This could be a good feature if they implement it into the game, grenade gets thrown at your players feet and explodes, also blows up your laptop for added immersion.",
                "author": "Cant_Think_Of_UserID"
            },
            {
                "raw_content": "[removed]",
                "author": "None"
            },
            {
                "raw_content": "thats an impressive amount of damage, though i guess it should be expected as the 5090 power delivery seems to be almost designed to maximize the carnage when something goes wrong. older cards had multiple 12V planes with \\~20A fuses, if a power stage shorted the fuse would blow before too much damage could be done, often leaving the card repairable. now that we have a single 12VHPWR connector connected to a single 12V plane the fuse would have to be so big (\\~60A) as to offer little protection in case of power stage failure. by the time it blows the failed component has already burnt a crater in the PCB leaving the card very difficult to repair.",
                "author": "UnfairMeasurement997"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Japan's state-backed Rapidus needs plan B in pursuit of 2-nm chips",
        "score": 85,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Reading the article it seems they want a \"Plan B\" in terms of being a Privately held company as there are fears that Rapidus will end up being a state own business which may hamper its future. It doesn't say anything about technical issues or other challenges preventing them from being able to produce 2nm chips.",
                "author": "ML7777777"
            },
            {
                "raw_content": "Don't worry about them, they're getting essentially free money, and will continue to have it well into the future, even after reaching mass production. Doing all of this work to reach parity with your competition only to then not would be just catastrophic. But as the article itself notes, a pure-play fab needs a fabless designer...",
                "author": "blueredscreen"
            },
            {
                "raw_content": "It's interesting that Japan recognizes that this is a unique market with enormous future demand that relies on one fragile company (TSMC) at this cutting edge, to the point of starting relatively almost from scratch because they think it would be amazing to have a player in that race. While the US sees its homegrown huge fab that has been on and off track but \\*almost there\\* more as a liability, even though it needs way fewer nudges to get there, with helping hands (most of world's biggest designers) available within reach within the nation itself. From the Japanese perspective, what happens with Intel in the US must seem like such a huge waste.",
                "author": "PastaPandaSimon"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD Ryzen AI Max+ 395 With Framework Desktop vs. Intel Core Ultra 9 285K Linux Performance",
        "score": 22,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The power efficiency is outstanding, but that makes sense using a laptop chip in a desktop. However, for those who don't need the 128GB soldered ram nor a large iGPU, there are a number other \"mini-PC\" designs already using powerful laptop CPUs, like the 7945HX or 9955HX. Such systems can be assembled for much lower prices but offer very good power efficiency. I would anticipate those to show similar power efficiency as this framework while having thermal solutions better than a laptop. But for $1300 (using 128GB of SODIMM DDR5) or less. I personally think the appeal of this desktop will be for those looking for productivity with a moderate amount of gaming on the side, and the AI use case won't be as big as hyped. 128GB will enable some decent models but the quality of the results won't be as good as the really big AI models. For everyone else, they are better off buying one of the \"mini-PC\" ITX boards built around a 9955HX or 7945HX and saving a huge amount of money. Which covers pretty much anyone not using the iGPU in a meaningful way",
                "author": "fastheadcrab"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung launches world's first Micro RGB TV, bringing unrivaled color accuracy to screens",
        "score": 108,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’m looking forward to Vincent of HDTVtest getting ahold of one of these screens to give his opinion of it.. the Samsung press release is rather light (heh!) on the details. Is this just effectively MiniLED but better, or is it much closer to MicroLED in practice? idk.",
                "author": "greggm2000"
            },
            {
                "raw_content": "Do I understand correctly that this is just miniLED, but where each dimming zone can be backlit by a specific color and not just white? I swear TV panel tech has the worst naming schemes. At least call it miniRGB and not microRGB....",
                "author": "Frexxia"
            },
            {
                "raw_content": "100% BT 2020 claimed coverage, compared to ~90% for the S95F, and ~80% for the G5 Curious to see how colour volume in HDR will compare to the oleds",
                "author": "suni08"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nvidia might have finally approved Samsung's 12-layer HBM3E chips",
        "score": 23,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Level1Techs's Wendell loves the Threadripper 9995WX Build -- The Most Overkill PC We’ve Ever Touched. Stupid Fast, Stupid Fun!",
        "score": 32,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Even Wendell doesnt know what he can use 96 cores for lol",
                "author": "jedimindtriks"
            },
            {
                "raw_content": "I had no idea Falcon Northwest was still around.",
                "author": "Ploddit"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Chibi-Robo! - GameCube – Nintendo Classics",
        "score": 338,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This game gets way darker then you would think. If you are on the fence about playing this please play it.",
                "author": "TimmiT401K"
            },
            {
                "raw_content": "Literally the only game announced so far for GC Online I never owned nor played. Actually kinda hyped to be honest ahahah",
                "author": "Tribal_Cult"
            },
            {
                "raw_content": "Been so excited for them to add this! This is dope!",
                "author": "RichardDick69"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Small PSA about third party controllers",
        "score": 759,
        "text_content": "Hello, Reddit. I will try to keep this simple. So, I'm a huge fan of the Nintendo Switch (obviously), and I'm also a big fan of 8BitDo accessories. I have some of their Ultimate gamepads, I have some of their Pro gamedaps, mechanical keyboards, a fighting stick, and some more. The quality of their gamepads is pretty great, specially for the price, and come packaged with tons of features like Hall Effect joysticks, TMR joysticks, compatibility with tons of platforms, and so on. They even support gyro on the Switch. No complains about the features. But there is a feature that absolutely sucks in third party gamepad, and it something that will make you hate using 8BitDo gamepads on your Switch 2: rumble. On the Switch 2, the HD rumble is not just a marketing fancy name. It uses a linear actuator and it allows for a wider range of vibration intensities and frequencies. The 8BitDo controllers use a traditional rumble motor with a simple on/off or a few intensity levels. A couple of weeks, me and my daughter were playing Kirby and the Forgotten Land on the Switch 2 with an 8BitDo Ultimate gamepad (before getting the official Pro Controller), and there are some instances when bosses appear on screen, the controller was shaking intensely for seconds and seconds. Even the more subtle rumble you could get on the Pro Controller, you will get it at full intensity on the 8BitDo one. I'm not advising against getting 8BitDo controllers (or any other third party controllers). Just be aware of their limitations.",
        "comments": [
            {
                "raw_content": "The biggest limitation for me is not being able to turn on the console remotely with the 8bit controller. I love them, don't get me wrong, but since I never actually owned an official pro controller, I was unaware of this other limitation. Well, you just added something else to my list lol",
                "author": "simple-heretic"
            },
            {
                "raw_content": "That’s the main reason I don’t use third party controllers with my Switch. Trying to play Skyrim without HD Rumble for lockpicking is a sad experience.",
                "author": "twili-midna"
            },
            {
                "raw_content": "8bitdo controllers have actual working d pads. That's all i need",
                "author": "stalememeskehan"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Time to give it another chance",
        "score": 456,
        "text_content": "I bought the Nintendo Switch when it was released back in March 2017, because of Breath of The Wild. I didn’t enjoyed it as much as I expected, my last save is from the 22th April 2017 after 12 hours of gameplay. Now, I finished DK Bananza, and I’m ready to try it once again, on Switch 2 this time. I didn’t like God of War 2018, I tried it once again in 2022, on PS5 and before Ragnork, and I loved it. I hope it’s gonna be the same thing with BOTW. Any advice for this new playthrough ?",
        "comments": [
            {
                "raw_content": "Explore. It’s an adventure, you’re meant to take your time going over nooks and crannies and talking to people. Don’t rush, the world isn’t going anywhere.",
                "author": "twili-midna"
            },
            {
                "raw_content": "I eventually realized that once you start getting stressed or overwhelmed by something, you literally can just bail and find something better or more fun to do. I'd go back to any random area and fight some low level bokoblins for a while, maybe forage some ingredients, or just find somewhere to cook a bunch of dishes. Literally anything. Sometimes when i needed a change of pace i'd just go wander somewhere beautiful. The game was soooo much more fun and addicting after i told myself \"wait why am i stressed. Go do something else, this mission will be here later\"",
                "author": "gotu_kola26"
            },
            {
                "raw_content": "I tried the same on switch 2 and it just doesn’t click with me. I got back to the part where you’re searching for the areas in the photos and just lost the motivation. I do honestly enjoy the gameplay when it peaks but the systems like the weapons breaking frequently or the stamina for example just got tiresome to manage. Plus some of the enemies having sniper like precision launching stuff at link… rage. Think I also expected more story than what’s there but I get it.",
                "author": "Sparkysparks101"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Looks like the official sign up for the SW2 are still going",
        "score": 131,
        "text_content": "When I signed up it was with a brand new account no game time didn't even have a Sw1. Just wanted to let people know in case they were still trying to get one.",
        "comments": [
            {
                "raw_content": "Yeah, I got that email yesterday. https://preview.redd.it/ou4xbm1d7oif1.png?width=1242&format=png&auto=webp&s=8ef17d47dc31be3b1879d74856e07faad9d38304",
                "author": "Sulfito"
            },
            {
                "raw_content": "That’s hilarious! They’ve been widely available in store and online for weeks. Even Costco, Wal-Mart, Target, etc.",
                "author": "ABCDEFScottFitz"
            },
            {
                "raw_content": "Got my email today too! But I’ve had mine for weeks now.",
                "author": "Infinite_Lizard"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "How do you think the rest of 2025 looks for Switch 2 releases?",
        "score": 142,
        "text_content": "Seen folks speculate about delays and still unannounced big games. At this point, I assume we won’t get more news on much until a September direct, and unless Metroid is a shadow drop there, I’d think it’s coming November. We know Pokémon Legends ZA is coming October, and I think that is likely to be a bigger deal than a lot of people have anticipated, especially if they pull off something close to a living, breathing city/Yakuza with Pokémon. If Kirby Air Riders doesn’t get delayed I’d guess it ends up being December? I would think it would be likely to get delayed given we haven’t seen anything but it’s also hard for me to imagine Sakurai missing a deadline. I also expect that to have some really cool hooks that we haven’t seen given how enthusiastic Sakurai seemed to be about the concept in his last YouTube video before naming the game he’s been working on. I also thought Hyrule Warriors was supposed to come out this year but I now see they said this Winter which could technically mean January, February, or even early March. And then we haven’t seen anything about Elden Ring or FFVII which I could totally imagine getting delayed given that still depends on outside teams learning the hardware. I feel I have plenty to play, but it would be nice to have one more big tentpole surprise, or even something smaller but novel. Honestly just a couple more Switch 2 editions would totally satisfy me… 3 Houses? Pikmin 4? Mario Wonder? What do you hope for? What do you expect? What do you dread??? (For the future of Switch 2 releases don’t need all your fears)",
        "comments": [
            {
                "raw_content": "In terms of Switch 2 upgrades, I’d say Mario Wonder and Metroid Prime are quite likely. I can see a Pokémon Arceus update happen as well",
                "author": "Pinkernessians"
            },
            {
                "raw_content": "Supposedly we got: Pokemon Z-A Hyrule Warriors Age of Imprisonment Metroid Prime 4 Kirby Air Riders Splatoon Raiders If those start releasing in September, then that's over 1 big release per month. And who knows there may even be another big game or 2 that they've yet to reveal for the year. Not to mention that I'm sure many already released games will see enhanced Switch 2 upgrades, perhaps Mario Wonder, Metroid Dead, etc. Looks like a strong 2025 no matter what more gets confirmed at this point. Assuming everything comes this year as planned.",
                "author": "MikeDubbz"
            },
            {
                "raw_content": "Have my doubts on Kirby Air Riders and Age of Imprisonment landing in the 2025 calendar. I can see both being pushed into the start of 2026.",
                "author": "NoirSon"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Display banding with HDR disabled?",
        "score": 34,
        "text_content": "I’m running into an issue with my 4K TV and Nintendo Switch 2 and am hoping someone can help. The TV is a budget ROKU TV that is definitely not super premium but does barely support HDR. I’ve heard that because my TV only has a peak brightness of 400 nits I should consider HDR off. When I do this the banding gets really bad on the switch 2 version of Zelda Tears of the kingdom. In the depths the banding is terrible and with hdr enabled I can see so much more details. Anyone else experiencing this? First part of video is with hdr and second with with hdr off.",
        "comments": [
            {
                "raw_content": "Color banding is one of the many things that HDR \"fixes\" - colors are 10-bit in HDR VS 8-bit in SDR, meaning more color variation, meaning less visible banding. Just turn on HDR if HDR looks better for you VS SDR - max brightness be damned.",
                "author": "XDvinSL51"
            },
            {
                "raw_content": "While it is expected to have less banding in hdr. I'm not sure if the banding you are seeing is normal.",
                "author": "IUseKeyboardOnXbox"
            },
            {
                "raw_content": "The banding is very bad . Some might says HDR fixes this but the original switch version did not have this issue with out hdr. There was SOME banding but not like this. From what I can tell if you turn off HDR the games don’t recognize this and still try to display in an hdr color space. I’ve only noticed this with botw and totk. I do recommend hdr if you can get it calibrated properly.",
                "author": "maddogx2x"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "PSA: UFO 50 upscales improperly in handheld mode on the Switch 2",
        "score": 295,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They need to add an original resolution option for backwards compatibility like they did for the DS",
                "author": "BortGreen"
            },
            {
                "raw_content": "Give them a switch2 devkit Nintendo!!",
                "author": "gizmo998"
            },
            {
                "raw_content": "tldr: The original game resolution of the fake console of the games cannot be properly integer-upscaled to 720p so on the NS1 there are artifacts. On the NS2 the problem is the same, just also upscaled to 1080p by the compatibility layer. If the game targeted 1080p on the NS2 then it would scale perfectly. Just another case where Switch 2 owners get shafted* because it's early in the NS2 lifetime and almost all developers have been targetting the original Switch because Nintendo didn't provide them with NS2 dev kits. When I say shafted, I mean we have to pay full price for subpar Switch 1 ports of games that have been released a long time ago. And when I say subpar, I mean resolution and framerate.",
                "author": "IncendiaryIdea"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "dbrand retro color matched skin!",
        "score": 84,
        "text_content": "I think they turned out pretty well! Excited to get the joylock replacements even though I fortunately wasn’t affected with faulty ones the first go round.",
        "comments": [
            {
                "raw_content": "I am irrationally triggered by the original Switch's joycon colours being described as \"retro\"",
                "author": "Dratini_"
            },
            {
                "raw_content": "I always liked the red and blue design and never went any other colours on my OG switch and I was disappointed at first that they didn't continue it but as soon as I got my hands on the 2 i realised that it looks more grown up and less toy like. It's not for me but don't listen to people who don't like it, because it only matters that you like it.",
                "author": "FullHeadOfHair42069"
            },
            {
                "raw_content": "That looks great! Is it only available to those getting replacements?",
                "author": "mobileguy2"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Dusk Golem: The next RE remakes are Resident Evil: Code Veronica & Resident Evil Zero. They should be releasing in 2027/2028, it's unclear which one is releasing first",
        "score": 327,
        "text_content": "[Source](https://xcancel.com/AestheticGamer1/status/1955335602913919472?t=X0WzxxYCy_J9Acr2358Wdg&s=19)",
        "comments": [
            {
                "raw_content": "Absolutely love CV. Zero on the train was quite the experience.",
                "author": "LinkedInParkPremium"
            },
            {
                "raw_content": "Please let Code Veronica be next.",
                "author": "Ultimatecake128"
            },
            {
                "raw_content": "You can’t do a RE5 remake without showing the Chris / Wesker rivalry in CV Also doing Zero before the a RE1 remake means they can bridge the two games together more.",
                "author": "Robsonmonkey"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "TheGhostOfHope: Tac-Sprint is not in Black Ops 7 and the game will also not have doors.",
        "score": 52,
        "text_content": "[https://xcancel.com/TheGhostOfHope/status/1955447661156618272](https://xcancel.com/TheGhostOfHope/status/1955447661156618272) [https://xcancel.com/TheGhostOfHope/status/1955443873439985691](https://xcancel.com/TheGhostOfHope/status/1955443873439985691)",
        "comments": [
            {
                "raw_content": "I call BS. Im reverse coping",
                "author": "Game_Bread"
            },
            {
                "raw_content": "No more Stakeout left lane door abuse? :'(",
                "author": "CrystalClearCrazy"
            },
            {
                "raw_content": "Nice. Both suck. But COD still needs a lot of work before they get my time and money. I’ll continue playing the campaigns with Game Pass.",
                "author": "Zombienerd300"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Dusk Golem: Resident Evil Requiem is Leon's last major role in the timeline; Media Embargo lifts on August 20th; The game will be shown at Tokyo Game Show; Both Leon & Grace play big roles",
        "score": 371,
        "text_content": ">As far as I know, part of RE9's whole \"Long Awaited Endings & New Beginnings\" stuff is supposed be Leon's last major role in the timeline (sure he'll still pop up in CG movies & earlier timeline stuff), so you got that to look forward to with Resident Evil Requiem then. [https://xcancel.com/AestheticGamer1/status/1955309595418890576](https://xcancel.com/AestheticGamer1/status/1955309595418890576) >Leon & Grace are the main protagonists of Resident Evil Requiem, yes. I am repeating myself a bit there, but will end up being the case. Both play big roles, but I think when all is said & done, this in many ways will come off more as Leon's send-off game. [https://xcancel.com/AestheticGamer1/status/1955311729673670704](https://xcancel.com/AestheticGamer1/status/1955311729673670704) >Resident Evil Requiem has a new showing at Gamescom Opening Night on the 19th, then a media embargo for press lifting on the 20th, then it'll be at Tokyo Game Show next month too. [https://xcancel.com/AestheticGamer1/status/1955312103188992041](https://xcancel.com/AestheticGamer1/status/1955312103188992041)",
        "comments": [
            {
                "raw_content": "I personally don’t think capcom has the balls to kill Leon",
                "author": "Ok_Canary5591"
            },
            {
                "raw_content": "They could kill off Leon and still find a way to bring him back in Resident Evil 11 or 12 based on how convoluted the Resident Evil storyline is.",
                "author": "MuptonBossman"
            },
            {
                "raw_content": "What they should actually do is have Leon about to be killed off and at the last second Jill appears out of nowhere and takes the hit because Jill fans don't deserve happiness.",
                "author": "Kironusu"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "@MitchTwitrKD is teasing something Banjo-Kazooie related, potentially a PC Port or something to do with PlayStation…?",
        "score": 175,
        "text_content": "https://xcancel.com/mitchtwitrkd/status/1955027131718832381?s=46 https://xcancel.com/mitchtwitrkd/status/1955098214266294613?s=46 Not sure who this person is, I just happened upon their profile on Twitter. I can’t really gage what they’re alluding to. Their second tweet states, *”I have been told I shouldn’t speak on it tonight. Initially today was my green light to do so, but that has been moved to tomorrow morning. This is an official PR move, not a small one at that. Please stay tuned”* Well, we’re 18 hours later, and nothing has come of it. Their responses are especially interesting, as despite saying this is an OFFICIAL PR Move, they say the following through various responses: -Not a new game -Not a partnership with Nintendo/Microsoft -This is NOT a fan game -Gives a very coy response to someone asking about a PS5 announcement, which I’ll link [here](https://xcancel.com/mitchtwitrkd/status/1955266211337416800?s=46) -Also gives another strange response when someone mentions a PC Port, which I’ll link [here](https://xcancel.com/mitchtwitrkd/status/1955263494929940850?s=46) https://xcancel.com/mitchtwitrkd/status/1955345784448156116?s=46 **EDIT:** Definitely think they’re alluding to a Banjo PC Port. They made [this](https://xcancel.com/mitchtwitrkd/status/1953829390745321613?s=46) tweet a few days ago in regards to Banjo being 100% decompiled nearly a year ago, with nothing coming of it.",
        "comments": [
            {
                "raw_content": "Being a Banjo-Kazooie fan (or even a fan of Rare and its legacy IPs at this point) is depressing. Endlessly hoping for a long dead franchise to be brought back when no developer has any financial incentive or desire to do so. I stopped hoping for a new Banjo game years ago. I firmly believe the franchise is dead. I would love to be proven wrong but I won’t believe a revival is coming until I see it with my own eyes.",
                "author": "Hot_Garbage_8578"
            },
            {
                "raw_content": "I mean I’d be happy to see the 360 versions ported to more platforms but that’s not really the grand return people have been wanting for over two decades.",
                "author": "Lazzyman64"
            },
            {
                "raw_content": "In the nicest way possible… Who the fuck is this?",
                "author": "Dull-Caterpillar3153"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Dusk Golem: Requiem story details with spoilers; Open-level areas in Resident Evil Requiem will have a vehicle to travel around with (possibly a motorbike); Huge innovations were made to Leon's combat; Zero Remake got some sort of dev reboot last year; New mainline big-budget RE game in 2029/2030",
        "score": 29,
        "text_content": "**Requiem** >There's few other innovations, some I know, but also sure I don't know all of them. A small handful I don't mind sharing is they've been working hard to achieve having good performance on open-level designed areas like Raccoon City, along w/a vehicle to travel around it. The combat with Leon has seen huge innovations, honestly some Last of Us Part 2-isms, but also its own innovations. [https://xcancel.com/AestheticGamer1/status/1955489759536771403](https://xcancel.com/AestheticGamer1/status/1955489759536771403) He later posted four pictures saying, \"Resident Evil Requiem out of context.\" One of the pictures shows Alice from Resident Evil Extinction on a motorbike. [https://xcancel.com/AestheticGamer1/status/1955429349039149162](https://xcancel.com/AestheticGamer1/status/1955429349039149162) **Zero Remake** >RE:0 got some form of reboot in dev late last year as far as I know. Not unusual for RE games, right now don't know the scale of the reboot (big or small). [https://xcancel.com/AestheticGamer1/status/1955405185750282299](https://xcancel.com/AestheticGamer1/status/1955405185750282299) **Next big-budget game** >...2029/2030 should be another new Resident Evil game releasing, not a remake & not a spin-off but a big budget affair. [https://xcancel.com/AestheticGamer1/status/1955395184885371191](https://xcancel.com/AestheticGamer1/status/1955395184885371191) **SUMMARY OF STORY SPOILERS:** \\-The stalker monster is Grace's mother, Alyssa. This is revealed early in the game. \\-Grace's blood is important in the story. \\-There is a big connection to Umbrella. \\-Requiem is the final numbered title and a definitive end for Umbrella and Raccoon City. \\-Requiem serves as a conclusion for everything that began with RE 0. This will allow Capcom to explore new stories and characters in the future. For future titles it will no longer be a requirement to tie everything in with the series' history. \\-Capcom wants to move away from games being set in the year they come out since development takes too long now. Future games could be set anywhere on the timeline. [https://xcancel.com/AestheticGamer1/status/1955484464915812717](https://xcancel.com/AestheticGamer1/status/1955484464915812717) [https://xcancel.com/AestheticGamer1/status/1955477990068064380](https://xcancel.com/AestheticGamer1/status/1955477990068064380) [https://xcancel.com/AestheticGamer1/status/1955389794416201746](https://xcancel.com/AestheticGamer1/status/1955389794416201746) [https://xcancel.com/AestheticGamer1/status/1955326106342658249](https://xcancel.com/AestheticGamer1/status/1955326106342658249) [https://xcancel.com/AestheticGamer1/status/1930617368587518116](https://xcancel.com/AestheticGamer1/status/1930617368587518116)",
        "comments": [
            {
                "raw_content": "After Dragons Dogma 2 and Wilds the inclusion of open world zones makes me nervous about performance. Hopefully it runs like RE4 Remake did but I doubt it.",
                "author": "Decimator1227"
            },
            {
                "raw_content": "Interesting story details, many people predicted them. This seems like an interesting step for the franchise, don't know if it's good tho",
                "author": "Anstark0"
            },
            {
                "raw_content": "The evil within 2 had some good open areas I hope re9 would be same",
                "author": "Esnacor-sama"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Dusk Golem: Resident Evil 3 Remake & Village cliffhangers were supposed to be set ups for the scrapped version of Resident Evil 9; Rumored Umbrella Chronicles movie was scrapped and evolved into the Zach Cregger project",
        "score": 229,
        "text_content": ">I think Resident Evil cliffhanger teaser endings are super funny. The weird after credits scene of RE:3 with Jill picking up the vial & the BSAA soldier thing at the end of Village were both set-ups to be paid off in the now scrapped multiplayer Singapore version of RE9. Then you got people thinking RE5 is the next RE Remake due to how RE:4 ended, & then we have other cliffhangers not delivered on to date like Jake's stinger at the end of RE6 or the Natalia Alex Wesker stinger at the end of Revelations 2. I just think it's kinda' funny how many Resident Evil cliffhanger or teases at the end of their games either get little to no pay-off, or things in dev changed so now have to write around them, or tackle YEARS later. Just something I think is a bit funny how consistent it is with the series at this point. [https://xcancel.com/AestheticGamer1/status/1955271351326867661](https://xcancel.com/AestheticGamer1/status/1955271351326867661) >The Zero \"Umbrella Chronicles\" film is the old scrapped version, it was leaked from Hollywood insiders a few years ago. Project has morphed into what Zach Cregger wants to do with it, which is fine by me. [https://xcancel.com/AestheticGamer1/status/1955327247201468566](https://xcancel.com/AestheticGamer1/status/1955327247201468566)",
        "comments": [
            {
                "raw_content": "RE3 ends on a cliffhanger? EDIT: I forgot about the post credit scene lol",
                "author": "Fluffy_Moose_73"
            },
            {
                "raw_content": "It’s like end credit scenes from Marvel movies phase 4 and onward. Dropping hints at things that will never be followed up on.",
                "author": "luscious_doge"
            },
            {
                "raw_content": "After seeing weapons and barbarian, I'm looking forward to the new re movie. Plus PlayStation productions is part of it and they've been doing some great work.",
                "author": "AmericanSamurai1"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "SwitchForce says there will be an update on an upcoming general Nintendo Direct \"before the end of the month\"",
        "score": 88,
        "text_content": "https://xcancel.com/TheSwitchForce/status/1955304274646405580",
        "comments": [
            {
                "raw_content": "Because Nintendo usually has a September Direct",
                "author": "Granum22"
            },
            {
                "raw_content": "i can confirm that the day after tommorow will happen after tommorow",
                "author": "TiocStudios"
            },
            {
                "raw_content": "Can’t believe this guy actually has credibility now lmao",
                "author": "rhythmau"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "A strange \"@supermario40th\" Twitter account with a strange name has been found. This happened back in 2020 with a \"@supermario35th\" account; the account ended up being official.",
        "score": 390,
        "text_content": "40th account: [https://xcancel.com/supermario40th](https://xcancel.com/supermario40th) 35th account: [https://xcancel.com/supermario35th](https://xcancel.com/supermario35th) Report on the 35th account proving it originally looked exactly like how the 40th account currently does: [https://www.shacknews.com/article/119211/uncovered-super-mario-35th-anniversary-twitter-may-further-support-remaster-rumors](https://www.shacknews.com/article/119211/uncovered-super-mario-35th-anniversary-twitter-may-further-support-remaster-rumors) **UPDATE - VERY LIKELY DEBUNKED:** This account: [https://xcancel.com/supermario45th](https://xcancel.com/supermario45th) was created **mere minutes** after the 40th account; It admits to being a fake, with the motive being to steal from Nintendo/annoy them. Proof: [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1moawh7/comment/n8aylem/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1moawh7/comment/n8aylem/)",
        "comments": [
            {
                "raw_content": "My only concern here is someone made it a couple months after the original, so anyone could’ve seen the first one and made a direct copy of it",
                "author": "LSDrush"
            },
            {
                "raw_content": "yeah nah, it's a 5 year old account. i don't believe it",
                "author": "iamsonixx"
            },
            {
                "raw_content": "Somebody go register @supermario45th",
                "author": "roosell1986"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Apple and NVIDIA Eye Intel's 14A Node for Trial Production",
        "score": 175,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Gonna be an interesting next few weeks. I’m optimistic.",
                "author": "Bl_ues"
            },
            {
                "raw_content": "Apple only ever goes with the most advanced node on the planet. 14A must be pretty good.",
                "author": "PsyOmega"
            },
            {
                "raw_content": "This article is a couple weeks old, and has not been substantiated in any way. If you'll recall, there were the same kind of articles for 18A, even as late as a couple months ago. They never amounted to anything. Even if Apple or Nvidia are evaluating the PDK, that's a long, *long* way off from actually using the node.",
                "author": "Exist50"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "CT scan peels back the layers of time to reveal the engineering within Intel’s iconic 386 CPU — exposing intricate pin mapping, hidden power planes, and more",
        "score": 54,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Interesting",
                "author": "Illustrious_Bank2005"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD Radeon RX 9060 non-XT Smokes GeForce RTX 5050",
        "score": 29,
        "text_content": "",
        "comments": [
            {
                "raw_content": "My 1080ti smokes (just) a 5050, not a high bar.",
                "author": "Spooplevel-Rattled"
            },
            {
                "raw_content": "Logique car la rx9060 est concurrente de la rtx5060, la rtx5050 devrait être en face d’une rx9050 (si elle sort un jour)",
                "author": "Moi952"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD GPU Profile Manager allows users to whitelist FSR4 games - VideoCardz.com",
        "score": 28,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "Beelink releases GTR9 Pro mini-PC with AMD Ryzen AI Max+ 395 and up to 128 GB RAM",
        "score": 18,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's pretty ridiculous how there are 8 million mini PCs announced with this, still 1 laptop.",
                "author": "Agentfish36"
            },
            {
                "raw_content": "Definitely the cleanest looking one of these Halo mini PCs we've seen, can't go wrong with copying Mac for a clean professional look.",
                "author": "WuWaCamellya"
            },
            {
                "raw_content": "Looks… inspired.",
                "author": "sbstndalton"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "US hits highest layoffs since COVID",
        "score": 483,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Der. The economy is totally in the shitter. I don't care what the \"statistics\" show. Everyone knows inflation is way higher than is being reported, and it will not surprise me to find out that the unemployment statistics are cooked as well.",
                "author": "Enigmabulous"
            },
            {
                "raw_content": "I'm in tech, i could've told you this three years ago! After the covid boom, tech was one of the first sectors to slowdown and begin layoffs starting second half of 2022, the market has got progressively worse since and has now spread to all areas of corporate. The only industries still hiring are healthcare (provider and not corporate), retail and trades. I still see \"help wanted\" signs outside restaurants, autoshops, hvac businesses etc but for the whitecollared between offshoring, AI and now the economic uncertainity, its been completely dead.",
                "author": "liverpoolFCnut"
            },
            {
                "raw_content": "*The majority of layoffs this year have been from the federal government—a total of 292,294 since the year started.*",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "More Than Half of Homes Are Selling Below Asking Price",
        "score": 213,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Get ready to be blown away but this use to be the norm.",
                "author": "Lootefisk_"
            },
            {
                "raw_content": "The fact that sellers are pulling their listings increasingly is an important part of the picture. To have a full crash, you need prices to drop and sellers to eat the drop. The fact that homes are selling below asking price just means that most sellers are pricing based on recent comps, which will overvalue prices in a falling market. For context, in a general healthy market more than a third of homes require a price reduction to sell.",
                "author": "Will_Not_Comment_"
            },
            {
                "raw_content": "I see homes selling at asking price, but then credits are handed out to fix things the buyer finds upon inspection.",
                "author": "cohortq"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The price premium on new-construction homes is dissolving. New-home prices dropped in 30% of large U.S. cities last quarter",
        "score": 108,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So they stayed the same or grew in 70% of large U.S. cities. #Crash Thanks for the update.",
                "author": "Acceptable-Peace-69"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Even if it's a buyer's market, don't be a stupid buyer.",
        "score": 58,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Tbf, I like that buyers are putting sellers through the wringer. If we all did similar then the culture would shift.",
                "author": "Appropriate_Cut_3536"
            },
            {
                "raw_content": "lol delicious. these stories will soon be the norm",
                "author": "HormoneDemon"
            },
            {
                "raw_content": "It's not a buyer's market yet. Give it another year and a half.",
                "author": "SvenTropics"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "S&P 500 jumps to record high as inflation report gives Fed green light to cut rates",
        "score": 185,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why in the hell would they even be considering cutting rates right now? Total clown world.",
                "author": "i860"
            },
            {
                "raw_content": "lol they aren't cutting rates.... inflation was HIGHER than expected, and only going to get higher next month.",
                "author": "avowed"
            },
            {
                "raw_content": "rates need to stay high, there is still too much funny money in the system distorting every single market",
                "author": "Urshilikai"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "10-year Treasury yield climbs after July inflation data",
        "score": 153,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Honestly no matter what CPI is, the hope for sub 4% mortgages = sub 2% 10Y is completely disconnected from reality",
                "author": "virtual_adam"
            },
            {
                "raw_content": "Does this mean mortgage rates are going to go up?",
                "author": "EstateGate"
            },
            {
                "raw_content": "I've said it before, I'll say it again. The 10 year is not going below 4% before 2030. The only caveat is that this assumes the Fed does not start yield curve control. With inflation optimistically at 2.7%, and the folks in power actively working to push inflation upwards, why the hell would you lock up your money for 10 years at 3.x%. Hell, I don't even understand why the 10 year is as low as it is. Right now it's trading at a 50bp spread over the 2 year, which is way too complacent. The risk of runaway inflation and/or the money printer blowing out fixed income holders sometime in the 2027-2035 window is way higher than a 0.5% premium is pricing in, IMO. I wouldn't touch a 10 year below mid-5s yield.",
                "author": "ThisKarmaLimitSucks"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "halp! i got hoomed",
        "score": 4,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> I bought a fixer upper 3 weeks ago and it's been an incredible amount of work. Ripping up floors so thick I needed a car jack to lift them off the subfloor, drywall everywhere, etc. I dislocated my thumb on day three and have been working one handed. I'm running out of time to get the bathroom and kitchen put back together, but there really isn't an opportunity to do this kind of renovation once I'm moved in. The reality of it all is hitting me hard right now. I'm overwhelmed and tired and my body hurts. I'm in a hot midwestern market so I saw a house I could afford and jumped on it before I could get priced out in another year, and now it all seems like way too much. I'm nervous about moving my cats and my stuff into a new house that I'm working so hard to get ready. I don't know if this is a good idea, and I'm doing it by myself so there's no one to really support me through all of it. I like my rental house, I liked having a fair amount of cash. I liked not being tired. I liked feeling that things were manageable. All of that seems gone forever now. Its a cute little ranch in.a nice neighborhood.that holds value. The neighbors so far have been friendky. Outside if the renovation, things seem ok. Why do I feel like I messed up? I feel.lonekynabd heartbroken somehow. I'm embarrassed by my reluctance and feel like I can't tell anyone.",
                "author": "acqua_di_hoomertears"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Apartment Construction Hits Decade Low in the US",
        "score": 28,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Apartment construction in the US has dropped to its lowest level since 2015 after peaking just over two years ago. KEY TAKEAWAYS * US apartment construction volumes have fallen to just over 542,800 units. That’s the smallest figure since Q3 2015, down from a record high of 1.1M units in Q1 2023. * The past year alone saw a 37% year-over-year decline, with nearly 320,000 fewer units underway. * Markets with the sharpest declines include Austin, Phoenix, Atlanta, Dallas, and New York. A few markets—Cincinnati, Richmond, and West Palm Beach—are seeing growth. Apartment construction in the US has slowed to its weakest level in almost a decade. At the end of Q2 2025, there were just over 542,800 units under construction, according to RealPage Market Analytics. That is less than half the volume seen at the Q1 2023 peak of more than 1.1M units. From Boom to Slowdown After hitting record levels in early 2023, construction has fallen every quarter. Developers finished existing projects, while fewer new permits were issued. Over the past year, the number of units underway dropped by nearly 320,000. Of the remaining projects, about 354,000 units are expected to complete in the next year. Market Breakdown Austin saw the sharpest drop. The city had about 18,000 units under construction at the end of Q2—less than half its volume from a year earlier. Phoenix, Atlanta, Dallas, and New York also saw big slowdowns. Each market had between 14,000 and 17,000 fewer units underway compared to last year. Biggest Percentage Declines Some cities saw construction plunge by more than 60%. That includes San Jose, Oakland, and Portland on the West Coast, as well as Indianapolis. Denver came close to that mark, with activity down 58% year-over-year. Largest Markets Still Building As of Q2 2025, the biggest apartment construction markets were New York, Dallas, Phoenix, Newark, and Los Angeles. All have seen activity decline, but the steepest drop was in Phoenix, where volumes are down 35.4% from last year. A Few Exceptions Cincinnati, Richmond, and West Palm Beach went against the national trend. These markets posted small increases in construction activity over the past year. Why It Matters The slowdown reflects tighter financing, slower rent growth, and reduced developer confidence. If fewer projects start in the coming months, the supply of new apartments will drop. That could shift market power toward landlords in the years ahead.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "Looks like higher rents are on the menu boys!",
                "author": "Capital-Giraffe-4122"
            },
            {
                "raw_content": "I live in an area called Miami World Center(a new area in downtown Miami). There are 21 Condos/Apartments being built at Various stages right now. Those 21 do not include other new Apartments/condos being built in other areas of Miami.",
                "author": "Available_Goal_5207"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Sam outlines changes to ChatGPT",
        "score": 590,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wow. I’m pleasantly surprised. I hope we continue to get more of this type of Altman and OpenAI.",
                "author": "RipleyVanDalen"
            },
            {
                "raw_content": "Honestly, I love it. Never expected this, but I love it. Let your power users decide best what they need. I get the update is geared at making it less confusing for most people, but that's why you have a simple toggle in the settings for these things. The old way is like slowing down the smartest kid in class for the people that take 3 days to learn one topic. It's not fair, and they should both be accommodated in a way that suits them. One size fits all is not the way, and I respect Sam for changing it back. Also super nostalgic seeing o3 and o4 in the picker.",
                "author": "Glittering-Neck-2505"
            },
            {
                "raw_content": "Anyone that works with product management knows that people hate change. With that being said, IMO they’re just bringing it back during this transition period and once the unified model is good enough, they will just remove the old ones and move on. Not necessarily a failure.",
                "author": "wxnyc"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Skill issue btw",
        "score": 2649,
        "text_content": "https://x.com/sama/status/1955283085857034599?s=46&t=6B2S2N-aHEDsHmVPMl47Yw",
        "comments": [
            {
                "raw_content": "These kids are building ASI",
                "author": "KIFF_82"
            },
            {
                "raw_content": "After reading this I think I'm ready for ASI to take over now. Yes, it could be worse, but at least it can't possibly be more cringe.",
                "author": "Redditing-Dutchman"
            },
            {
                "raw_content": "You know that Sam lives rent free in elons head",
                "author": "Orangeshoeman"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Figure 02- Today we unveiled the first humanoid robot that can fold laundry autonomously",
        "score": 1643,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Mf is going to off himself when he sees 5 loads on my bed",
                "author": "ID-10T_Error"
            },
            {
                "raw_content": "AGI when it can fold fitted sheets.",
                "author": "FirstEvolutionist"
            },
            {
                "raw_content": "I like how it takes a default stance before starting the task like a video game playable character transitioning out of a cutscene lol",
                "author": "TarkanV"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Good bot Grok",
        "score": 735,
        "text_content": "",
        "comments": [
            {
                "raw_content": "u/AskGrok is this real",
                "author": "NIU_NIU"
            },
            {
                "raw_content": "Google Deepmind, save us from this war of dummies.",
                "author": "RedLock0"
            },
            {
                "raw_content": "Wait, ChatGPT’s tweets here are written in all lowercase letters, like Sam’s personal account tweets. This is a tinfoil hat take, but wouldn’t it be funny if it was Sam logged in on the ChatGPT account lmfao",
                "author": "Special-Slide1077"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Perplexity offers to buy Google's Chrome browser for $34.5 billion",
        "score": 479,
        "text_content": "",
        "comments": [
            {
                "raw_content": "where tf they get that kinda cash?",
                "author": "Slowhill369"
            },
            {
                "raw_content": "![gif](giphy|Qe5oD5aXjEbKw) How??",
                "author": "NoSignificance152"
            },
            {
                "raw_content": "Why is perplexity worth anything?",
                "author": "bill_gates_lover"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI is preparing to back a brain-computer interface company that will compete with Neuralink, with Sam Altman as a co-founder",
        "score": 604,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nah let Google handle that so they can implement Genie into it!",
                "author": "Vappasaurus"
            },
            {
                "raw_content": "![gif](giphy|YJjvTqoRFgZaM)",
                "author": "Ok_Raise1481"
            },
            {
                "raw_content": "FDVR is loading...",
                "author": "DiverAggressive6747"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Quite funny!",
        "score": 2007,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Quite funny that the richest people in the world are bitching like teenage girls at dinner table. What a time to be alive.",
                "author": "Trouble-Few"
            },
            {
                "raw_content": "Reminds me of [this story](https://www.businessinsider.com/twitter-boosted-elon-musk-tweets-over-biden-super-bowl-report-2023-2) about the time Elon got so angry that Joe Biden got more likes on a tweet about some football game than his tweet did that he flew to San Francisco, told the Twitter engineers to fix this “issue”, and threatened to fire them if they didn’t. Shortly after, everyone’s timelines were basically taken over by Musk tweets. Insane that the richest man in the world is *this* obsessed with attention. You already have everything you could ever want like cmon",
                "author": "MassiveWasabi"
            },
            {
                "raw_content": "\"despite having 50 times your follower count\" He really is cut from the same immature narcissistic mold as Trump",
                "author": "ziplock9000"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Claude Sonnet 4 now has 1 Million context in API - 5x Increase",
        "score": 890,
        "text_content": "",
        "comments": [
            {
                "raw_content": "this little manuver is gonna cost us 51 dollars",
                "author": "o5mfiHTNsH748KVq"
            },
            {
                "raw_content": "pricing here: [https://www.anthropic.com/news/1m-context](https://www.anthropic.com/news/1m-context)",
                "author": "nuno5645"
            },
            {
                "raw_content": "https://preview.redd.it/exbfswtt7mif1.png?width=622&format=png&auto=webp&s=1c49d918561f509d8753368f828cdf6df385b144 new pricing",
                "author": "ThunderBeanage"
            }
        ],
        "subreddit": "singularity"
    }
]