[
    {
        "post_name": "The purpose of the system is what it does",
        "score": 612,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A good chunk of those people ended up in Congress, I believe.",
                "author": "MythArcana"
            },
            {
                "raw_content": "It would be interesting to know which method leads to worse recidivism.",
                "author": "RINO_fatigue"
            },
            {
                "raw_content": "The national mental health money was repurposed to create Medicaid.",
                "author": "LaptopDied"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump arriving back at White House. He is a machine!",
        "score": 402,
        "text_content": "",
        "comments": [
            {
                "raw_content": "One of the single most hardworking Presidents we've had in our lifetime. Most people would have folded after the 2020 steal and tried to avoid the spotlight for the safety of themselves and their families. Trump has been a rare gift",
                "author": "UCantStumpTheTrump"
            },
            {
                "raw_content": "It’s unbelievable that he is as old as Biden. We need to see Trump’s birth certificate.",
                "author": "ModsAreCucked"
            },
            {
                "raw_content": "He did the 60 Minutes interview on Friday: https://www.cbsnews.com/news/president-trump-sits-down-with-60-minutes/ The version CBS aired was edited down to 27 minutes from 73 minutes. Full version is viewable on Trump's @RapidResponse47 X account: https://xcancel.com/RapidResponse47/status/1985162774041804844",
                "author": "Deplora"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "TRUMP: “I’m not a fan of Cuomo one way or the other, but if it’s going to be between a bad Democrat and a communist, I’m going to pick the bad Democrat all the time to be honest with you.” Woah.",
        "score": 231,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Great choices we have here. A known mass murder and one potentially capable of even worse.",
                "author": "StayoutOfit"
            },
            {
                "raw_content": "NYC faces a choice between a shit sandwich and a turd sandwich.",
                "author": "Tookens"
            },
            {
                "raw_content": "Or NYC could have had a MAGA candidate step up and rally the non-voters to save the city against the commie mudslime. NYC has YUGE numbers of non-voters who don't see any hope in the current system.",
                "author": "HeavyMetalPatriot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "tiny little balls",
        "score": 80,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Forgive me, but I had to, mods!! 😂",
                "author": "GuerillaYourDreams"
            },
            {
                "raw_content": "🤏⚽&🤏🍆 You need 🔍 to see it.",
                "author": "DT170x"
            },
            {
                "raw_content": "Tiny Little Balls - This is how Trump should start to call him from now on.",
                "author": "NSFW_PORN_ONLY"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The judicial branch is out of control",
        "score": 1264,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There should be a new law that if a judge issues an injunction and it’s overturned, they basically begin getting strikes that count against them, and at the 3rd strike they are barred from serving as a judge ever again.",
                "author": "lifeisahologram"
            },
            {
                "raw_content": "I don't see anyone doing anything about it, so the idiocy will continue. Nobody has attempted to impeach these judges. Nobody has attempted to remove them for bad behavior. Nothing will change.",
                "author": "LineInTheSand"
            },
            {
                "raw_content": "This will only be solved if the RINOs support Trump. So never….",
                "author": "journalist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Reminder that the Red Cross supports criminal migration, drug cartel funding, drug trafficking and human trafficking.",
        "score": 826,
        "text_content": "",
        "comments": [
            {
                "raw_content": "My wife had four trees come down on buildings 5 months ago. She had 23 outplaced families. She had them in her leasing office at 2am finding them hotels. Red Cross showed up and they asked her first if she had any \"illegal\" outplayed families that may be fearful of coming to the leasing office. My wife was already done with the day and told them they coukd go hunt in the dark for them. They found two families. Red Cross put them in their own bus and took them to hotels. Red Cross took no citizens.",
                "author": "Spawnlingman"
            },
            {
                "raw_content": "The Red Cross is assho",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Never give your dollars to big charities. Stick to little ones that do only local operations.",
                "author": "CommanderOfCheese"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Data shows Harvard is no longer an elite institution but a degree mill where everybody earns an A.",
        "score": 991,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Go to a trade school.",
                "author": "JtBlaze"
            },
            {
                "raw_content": "So before the mid 60s elite institutions used to be so tough that even half of the best students failed. This is what got us to the moon in 10 years.",
                "author": "mykillk"
            },
            {
                "raw_content": "Talking to any recent Harvard grad would tell you that.",
                "author": "AbrahamLincoln"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Digital IDs - What could possibly go wrong? India’s digital ID system has become a warning to the world. Over a billion people were forced into a biometric program that linked food, healthcare, and pensions to one ID, with devastating results.",
        "score": 784,
        "text_content": "",
        "comments": [
            {
                "raw_content": "India Digital IDs = Digital Caste System. A street-sweeper is going to be a street-sweeper for the rest of his/her generation and their future generations.",
                "author": "DT170x"
            },
            {
                "raw_content": "My bank hits me with the biometric sign in bullshit now and then. Look fuckwits, I won't even check the \"remember me\" box! Like I'm going to start dropping my digital fingerprint everywhere I go. Fuck off!",
                "author": "Pelosi_Halitosis"
            },
            {
                "raw_content": "Real ID in the US is the camel's nose under the tent for digital ID. Remember no Proof of Vaccination Card will never be used as a restriction of freedoms?",
                "author": "RobinNet"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🌵 BREAKING: Mexicans are now STORMING the Moreno government palace in Morelia, chanting “Out with Moreno, out with Moreno,” protesting what they believe is the government’s direct role in the Assassination of Mayor Carlos Manzo, a vocal critic of cartel influence...",
        "score": 742,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's time to bomb the Hell out of the cartels",
                "author": "Shimmy_Shanahan"
            },
            {
                "raw_content": "> The 47-year-old mayor, a fierce critic of President Sheinbaum’s inaction on organized crime, was assassinated during Day of the Dead events. † > With over 30,000 cartel-related murders each year, anger is boiling over. † † *https://x.com/MarioNawfal/status/1985175095665377375*",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "The city of Morelia is in the far south central part of Mexico and is something like a seven-hour flight from San Diego. it's an historic town that dates back to the 16th century and has a lot of beautiful Spanish buildings.",
                "author": "Cuetardian"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "SNAP was not intended to support someone for 30+ years. Get a fucking job.",
        "score": 1473,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Food stamps were created so that if for example the plant you were working at closed down, that your wife and children wouldn't fucking starve to death in the time that it takes you to find another job. It's not a lifestyle, never was, never will be. As for \"detrimental to your life\", you say that as if I give a single shit about your life. Go ahead, die. Just one fewer deadbeat stealing my tax dollars",
                "author": "magapatriot_pa"
            },
            {
                "raw_content": "\"I have depended on those benefits since the 1990s\". Well, there's your problem bitch. You've had three decades to get your shit together. Go fucking starve.",
                "author": "CAPTAIN_TENDY_PLATE2"
            },
            {
                "raw_content": "Its also not meant to support illegals, either.",
                "author": "Comanche_Moon"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Democrat Party approval rating has now fallen to 16%.",
        "score": 1186,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Approval ratings for both parties have been in the gutter for decades. Nothing matters but who counts the votes at this point. Secure the vote and shit will correct itself.",
                "author": "SquiggyMcPepe"
            },
            {
                "raw_content": "16% steals 48% of their votes.",
                "author": "Melodicgrog"
            },
            {
                "raw_content": "Root Canals are now more popular....",
                "author": "TEXinLA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 PRESIDENT TRUMP ON ZOHRAN MAMDANI: I'm a much better looking person than him! But it's gonna be hard to give a lot of money to New York - because if you have a communist running NYC, you're WASTING the money.",
        "score": 871,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hasn't it been already proven that he lied on his immigration documents? Why is he still here?",
                "author": "POTUS_DonnieJ"
            },
            {
                "raw_content": "ZERO Federal Funds.",
                "author": "BlackPilledMAGA"
            },
            {
                "raw_content": "Honestly it’s a gift unto MAGA. This is going to push so many union dems to center right it’s going to be hilarious. Might even get white women on board once they find out all their gibs are going to Muslims. That and the rapes and general banning of partying and whoring. The big problem will be the Zionists and secular Jews who pour in expecting us to go to war on their behalf despite them being directly responsible for letting this bastards in. Overall I say let him destroy nyc as an institution and scatter the wealth to the winds.",
                "author": "Viewer01"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Democrats: Don’t ever verify citizenship.",
        "score": 1323,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The Democrat platform Lie cheat and steal",
                "author": "Sea_Still"
            },
            {
                "raw_content": "21 states are in active rebellion. Insurrection Act. Mobilize the military now. Appoint the military as their temporary governments. It's been done before.",
                "author": "MasterChief08"
            },
            {
                "raw_content": "I hope the government stays shut down forever.",
                "author": "SadFugeeFace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔴Trump : \"Next week’s Case on Tariffs is one of the most important in the History of the Country. If a President is not allowed to use Tariffs, we will be at a major disadvantage against all other Countries throughout the World, especially the “Majors.” In a true sense, we would be defenseless\"",
        "score": 891,
        "text_content": "",
        "comments": [
            {
                "raw_content": "why would SCOTUS not allow tariffs?",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "I didn't realize the left planned their insurrection day for the same Tariff court date, Wednesday, November 5th.",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "The problem is that we are even involving courts in this at all. Its not up to a court to decide this. Its purely a Presidential power",
                "author": "DingleBalls"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "mysafespace- a place for dems (Courtesy of The White House)",
        "score": 452,
        "text_content": "",
        "comments": [
            {
                "raw_content": "OMG 🤣",
                "author": "MEME-SUPREME"
            },
            {
                "raw_content": "I just added them as a friend",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Tampon Tim 😂",
                "author": "SurfandTurf"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Virginia and New Jersey, VOTE REPUBLICAN IF YOU WANT MASSIVE ENERGY COST AND CRIME REDUCTIONS. The Democrats will double and even triple your Energy Costs, and CRIME will be rampant. A vote for the Democrats is a DEATH WISH! VOTE REPUBLICAN!!!",
        "score": 741,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Still waiting on cheaper gas. I threw in the towel on groceries.",
                "author": "Here_we_go"
            },
            {
                "raw_content": "do people who do crimes tend to vote D in hopes of getting a lenient judge if they’re ever caught?",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "\"energy cost reductions\" Show of hands, has anyone actually had a reduction in your energy costs ever in the history of ever Politics is so fucking tiresome",
                "author": "assblast"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "TERMINATE THE FILIBUSTER, NOT JUST FOR THE SHUTDOWN, BUT FOR EVERYTHING ELSE.",
        "score": 494,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nuke the filibuster. Pass federal voter ID laws and proof of citizenship to vote. Similarly restrict mail in ballots. That will make it a lot harder for the Dems to cheat in 2028. Another thing too is that codifying stuff into law makes it a lot harder for district judges to overturn things",
                "author": "henri_derelicte"
            },
            {
                "raw_content": "The dems were going to this last term but they were stopped by Manchin and Sinema , Trump has a point",
                "author": "Albo22"
            },
            {
                "raw_content": "Only remove the guiderails if you are ready to win. Half measures will have us all dead in ditches next time they have power",
                "author": "Formerlurker92"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Watch the corners 🤙🏼",
        "score": 409,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hits differently with the music. That's cool though. Rock doesn't get enough credit these days.",
                "author": "cereal_killer"
            },
            {
                "raw_content": "shadilay.",
                "author": "stargunner"
            },
            {
                "raw_content": "To think that this was made before AI too, I remember this video, love it everytime it pops up! Nice work adding the cool song!",
                "author": "Retardloserimsogay"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "UK Train Mass Stabbing: Authorities Insist No Indication Of Terrorism (Translation, the World thinks we are all Stupid.)",
        "score": 613,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The same 'authorities' who covered up mass child rape...",
                "author": "austford"
            },
            {
                "raw_content": "what are the perps’ names?",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "\"motives unclear\" Even if the terrorist said during the stabbing \"I'm a terrorist and I'm killing you infidels because you reject Islam\" the response would still be \"motives unclear.\"",
                "author": "hillaryforprison"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This gentleman explains perfectly what’s going to happen if Mamdani gets Elected in New York. I hope all those that vote for him are prepared. You’ll need to be! Smh",
        "score": 959,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not elected. Appointed.",
                "author": "TwoArizonaPedes"
            },
            {
                "raw_content": "The left incited an atmosphere leading to Charles' killing and they celebrated that. Why do people actually believe the Party Of Wishing Death On Kirk is worthy of their vote???? Seems everyone forgot about him and will vote Blue despite Charlie getting slaughtered.",
                "author": "guywholikesDjtof2024"
            },
            {
                "raw_content": "Well, I learned that not all New Yorkers are hopelessly lost.",
                "author": "Here_I_Be"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "[Gamers Nexus] AMD Says We're \"Confused\"",
        "score": 116,
        "text_content": "",
        "comments": [
            {
                "raw_content": "AMD here truly living up with their \"Advanced Marketing Disaster\" reputation...",
                "author": "ShadowRomeo"
            },
            {
                "raw_content": "This is bad timing. After it has been proven that 6000 series cards can run FSR 4, cutting off customers from future updates and the newest software comes across as pure greed. This is a serious violation of trust. Why should we buy Radeon ever again? They need to make this right and the sooner the better.",
                "author": "HatchetHand"
            },
            {
                "raw_content": "cpu amd vs intel gpu amd vs amd + nvidia",
                "author": "NeroClaudius199907"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD releases statement confirming RDNA1 and RDNA2 will continue to receive game optimizations - VideoCardz.com",
        "score": 123,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nothing has changed, this is just a re clarification of their original statement they made because of the backlash. RDNA1 & 2 are still on some form of a legacy branch, and still looks like they not receive the same level of support as RDNA3 & 4 going forward.",
                "author": "kneepel"
            },
            {
                "raw_content": "This has everything to do with Redstone. I think this might actually be confirmation that RDNA3 will be getting some version of Redstone but RDNA2 won’t.",
                "author": "Earthborn92"
            },
            {
                "raw_content": "Yes, we know. And maintenance mode isn't going suddenly become a good thing because people need to believe in AMD again. RDNA2 is simply not old enough to be relegated to a security branch driver.",
                "author": "ClerkProfessional803"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "TSMC Reportedly Flags 3–5% Price Hikes for Sub-5nm in 2026, Ripple Effects on Mature Nodes Expected",
        "score": 39,
        "text_content": "",
        "comments": [
            {
                "raw_content": "3-5% per year compounding is pretty.....steep.",
                "author": "logosuwu"
            },
            {
                "raw_content": "Well they have the pricing power as there is no other alternative.",
                "author": "shawman123"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD Reverses Their Blunder - Game Support Returns to RDNA 1/2",
        "score": 21,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Will people actually praise AMD for the u-turn? Now I am more sure they will silently turn off features instead of publicly",
                "author": "Ecstatic_Secretary21"
            },
            {
                "raw_content": "At least they are scared of public opinions lol. Keep an eye out for anything they might do to drop old cards.",
                "author": "tired_fella"
            },
            {
                "raw_content": "AMD's marketing, colorised https://www.youtube.com/watch?v=2WZLJpMOxS4",
                "author": "INITMalcanis"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Asianometry] TSMC’s incredible 2nm curvy masks",
        "score": 24,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung delays DDR5 contract pricing to mid-November as spot prices triple",
        "score": 10,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "SK hynix to become biggest supercycle winner and overtake TSMC in chip profit by 2027: Nomura",
        "score": 6,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What does this mean for the consumer? Better prices? Or do they set the tone now?",
                "author": "no6969el"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "The Weirdest Case So Far: HYTE X50 & X50 Air Case Review & Benchmarks",
        "score": 15,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Aesthetic doesn't do it for me, but good to see some innovation beyond square edges.",
                "author": "RHINO_Mk_II"
            },
            {
                "raw_content": "New case design meta just dropped. Look forward to 2 years of case manufacturers creating spinoffs.",
                "author": "BlueGoliath"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Persona 3 Reload On Switch 2 had poor sales in Japan",
        "score": 175,
        "text_content": "Hit the 5:00 mark to start hearing numbers, only close to 7k one of the lowest sales debut for the series overall",
        "comments": [
            {
                "raw_content": "not surprising, very late port and full priced. everyone who wanted to play it already did",
                "author": "skynovaaa"
            },
            {
                "raw_content": "* Poorly made port * Very late port * Fully priced $60, doesn’t even include DLC like cyberpunk did * Game key-card This has all the variables for a terrible release",
                "author": "calicoknux1"
            },
            {
                "raw_content": "Well it launched with everyone including the devs saying it was a lazy port. Now it’s a wait for 90% off and patches kind of game.",
                "author": "Bootychomper23"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "If you have a pro controller do you use the back buttons?",
        "score": 638,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I do in Mario Kart World, so that I can accelerate and use the camera at the same time. In TotK to switch weapons and shields. In Animal Crossing to switch tools. And in DK Bananza to do the clap and sing.",
                "author": "Snoo-34159"
            },
            {
                "raw_content": "INCREDIBLY helpful in Luigi’s Mansion 3. I never played it until after I bought a Switch 2, and I have no idea how anybody played that game with the face buttons and the right stick at the same time.",
                "author": "XephyXeph"
            },
            {
                "raw_content": "I use them in Pokemon ZA so I can play one handed",
                "author": "Foppyjay"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Starting this Thursday, these 3 games will release every other Thursday over the space of just 28 days",
        "score": 822,
        "text_content": "Exciting times! Hyrule Warriors is probably the one I was least hyped for initially, but having spent the majority of my time with the Switch 2 so far playing two massive and immersive but less dense/intense (in terms of gameplay) games in the form of Cyberpunk and Star Wars Outlaws, I'm actually really in the mood for the mindless catharsis of some fast-paced, non-stop, button-bashy hacking and slashing, so this is arriving with perfect timing. Prime 4, though, absolutely remains as 'the big one' as far as I'm concerned, and while I do have a little bit of trepidation due to it having so much to live up to, I'm still not 'waiting for reviews' on this one. 8 *years* since it was announced, 18 since its predecessor? Yeah, I'll be playing it the second it releases. As for AirRiders, it just looks so charming and especially after seeing Sakurai explain everything in the Directs, I think it's going to be pretty awesome, but honestly, I'm just not sure how I'd be able to fit it in. May have to go on the wishlist and get picked up early next year. Although maybe it would be a good pick up and play game to have in reserve for quick bursts while also playing Prime 4. Either way, it feels like this is the period where the Switch 2 is going to really start coming into its own. Roll on Thursday!",
        "comments": [
            {
                "raw_content": "We eating like Kirby",
                "author": "GregoryPokemon"
            },
            {
                "raw_content": "I want all 3. My wallet already hurts",
                "author": "Sydnaster"
            },
            {
                "raw_content": "I just have to shake my head at people thinking MP4 isn't gonna get crazy marketing in November.",
                "author": "ChiTownDog"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "My first physical copy of a Switch 2 game",
        "score": 122,
        "text_content": "My other Switch 2 games are Mario Kart World and Donkey Kong Bananza, but I have them digitally. I bought the Switch 2 Mario Kart bundle and I wanted to play Bananza right away so I bought it digitally lol.",
        "comments": [
            {
                "raw_content": "The switch 2 edition was my first time playing this game too. I completed the story but still need to clear a lot. It’s such a joy. And my little son love to watch.",
                "author": "Fawlock"
            },
            {
                "raw_content": "I was just researching on this game yesterday! Quite pricey though",
                "author": "zarif2003"
            },
            {
                "raw_content": "Have you ever played Forgotten Land? It's such a joy to play. It's somehow both cozy and epic. I'm jealous if you get to experience for the first time in 60fps.",
                "author": "peter-man-hello"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I love these posters",
        "score": 91,
        "text_content": "I freaking love those metal posters. They look great, and I only hope that Nintendo will do similar merchandise in the future.",
        "comments": [
            {
                "raw_content": "These look great! Where did you get them from?",
                "author": "SwashNBuckle"
            },
            {
                "raw_content": "Where did you get this?",
                "author": "MacksNotCool"
            },
            {
                "raw_content": "Hello! Welcome to r/NintendoSwitch2! Your post has been sent to the moderators for review. To help manage spam, trolling, and repetitive posts, we restrict new posts from accounts that do not have much comment karma earned in this subreddit. Please contribute through comments on other posts in the meantime. If you are trying to ask about an issue with your Switch console or otherwise seeking help, you may want to check out the peer support community at r/NintendoSwitchHelp. You can find our rules here: https://www.reddit.com/r/NintendoSwitch2/wiki/rules *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NintendoSwitch2) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Split Controllers or Single/Pro Controller?",
        "score": 2,
        "text_content": "I always see people talking about controllers and ergonomics, and I can't help but feel like the odd man out. Everyone online loves playing with pro controllers for some reason(valid ones undoubtedly) to the point it's as if it's impossible for most people to buy a console without also buying a pro controller. I really love using the Joy Cons in either hand, and when I've tried pro/\"regular\" controllers, they feel unnatural to me. I just grew up used to using the wiimote and nunchuck, and that's most comfortable to me. Though, the same thing would be said to me, when someone who's only used \"regular\" controllers use Joy Cons. Still, is it that universal? Also, I'm curious who uses handheld even when you can use a TV or the kickstand. It's not the most ergonomic, but having grown up with a 3DS too, I get that playstyle. I mean my Switch was a used Switch Lite, and I liked how it felt. Reminded me of using my 3DS. However, with the Switch 2 and the Joy Cons, any chance I get, I play with Joy Cons in either hand. So I'm curious about those who insist of playing in handheld [View Poll](https://www.reddit.com/poll/1on670h)",
        "comments": [
            {
                "raw_content": "Split is fine for gimmicky games, but if you require precision probably a single device feels more stable.",
                "author": "DrKrFfXx"
            },
            {
                "raw_content": "Pro Controller I use as a default but it depends on the game, like if its Mario Party/Kart I do not mind using the a single Joycon tbh.",
                "author": "GeekyPanda404"
            },
            {
                "raw_content": "Can't I just pick all of the above? I mean I still have a Switch and a Switch Lite and I alternate between each of them depending on the game and whether or not I feel like playing with the Pro Controller or with the Joy-Cons. Plus I have to when I wait for either one to finish charging.",
                "author": "Pessimistic_Gemini"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Best “Mario” game to get",
        "score": 13,
        "text_content": "I’ve owned a switch 2 for a while but have avoided traditional Mario platformers. I did however finish DKB and loved it. Also (and this is embarrassing) I’m literally at Epic Studios right now and just visited the SM universe and got this sudden need to play a Mario game. Which is the best one to get that has great platforming, story, and maximizes switch 2 hardware? Thanks in advance!",
        "comments": [
            {
                "raw_content": "Tough. It’s either going to be Odyssey or Galaxy 1+2. Get both.",
                "author": "Medd-"
            },
            {
                "raw_content": "Odyssey is the most modern 3D Mario yet and it plays very similarly to Bananza. Plus it runs at a smooth 60fps and 4k on switch. It's a no brainer.",
                "author": "TyleNightwisp"
            },
            {
                "raw_content": "If you want a more traditional experience, SMB Wonder is an amazing game. Otherwise, for 3d platformer, Odyssey.",
                "author": "Raging_Pwnr"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "mp1st: Exclusive Screenshots of Avalanche’s Cancelled “Contraband” Unearthed, Reveals UI and More",
        "score": 283,
        "text_content": "[https://mp1st.com/news/avalanche-cancelled-contraband-screenshots-unearthed](https://mp1st.com/news/avalanche-cancelled-contraband-screenshots-unearthed)",
        "comments": [
            {
                "raw_content": "The character classes were apparently Stan Lee, Burt Reynolds and James Brown",
                "author": "MyMouthisCancerous"
            },
            {
                "raw_content": "Is that Stan Lee?!??",
                "author": "Midnight_M_"
            },
            {
                "raw_content": "The game is not cancelled yet, microsoft just stopped funding the game. They're currently looking for another publisher [An Update on Contraband - Avalanche Studios Group](https://avalanchestudios.com/stories/contraband-update)",
                "author": "al_194"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Doom designer (and formerly at Ensemble in the 2000s) Sandy Petersen alleges former Xbox boss Don Mattrick killed Ensemble Studios and its Halo MMO to protect his personal stock bonus",
        "score": 955,
        "text_content": "https://xcancel.com/SandyofCthulhu/status/1982965186781954468?t=_qgp6NQohadWbrbckRgwtg&s=19 >In 2008, Ensemble Studios started planning a gigantic MMO set in the Halo universe. We code-named it Titan. It was to take place tens of thousands of years ago, before the Halos were set off & destroyed all sentient life in the Galaxy. I was in charge of the universe-building - planet histories, alien species, etc. You could play either as Forerunners or their enemies, the Covenant. The Flood, of course, was in the game, but not playable. We had quest lines all worked out, homeworlds for all the species, etc. etc. The lowest estimate we & MicroSoft had for the game’s totaly income was $1.1 billion. >It was all brought to naught when Don Mattrick realized that his stock bonus was based on the income MS had from games in 3 years. >You see, we estimated 3.5 years to finish Titan if we did it right. And that’s beyond Mattrick’s drop dead date. So by firing ALL of Ensemble, he didn’t have to pay for our expensive studio for 3 years and he didn’t care about Titan. All he lost was a game studio who never sold less than 3 million copies of everything we made. I don’t believe he did justice to MicroSoft stockholders but hey - Don started as an EA hatchet man so what would you expect?",
        "comments": [
            {
                "raw_content": "Has any other individual done as much damage to the industry as Mattrick?",
                "author": "Markitron1684"
            },
            {
                "raw_content": "I think people should stop code-naming their projects Titan.",
                "author": "Lugonn"
            },
            {
                "raw_content": "Not to defend Don freaking Mattrick but take anything said by Sandy Petersen with a grain of salt. Guy is notorious for taking credit for things he didn't do at id, there's a long history of John Romero calling him out on this behavior. He is simply not a reliable witness.",
                "author": "Field_Of_View"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Call of Duty: Black Ops 7 may be getting a 72-hour early access period for Vault owners, according to a recent Forbes article.",
        "score": 174,
        "text_content": "amidst whispers of a potential early release for BO7, a recent Forbes article may have spilled the beans on a possible Early Access period for owners of the Vault Edition. this information could potentially be misleading, as it may or may not be the product of AI. spotted by WhosImmortal - https://xcancel.com/WhosImmortal/status/1985045085885751745#m original article: https://www.forbes.com/sites/brianmazique/2025/11/01/call-of-duty-black-ops-7release-date-pre-order-info-and-details/",
        "comments": [
            {
                "raw_content": "Not surprising. Seems like most AAA games are going this route to try to get people to pay the premium.",
                "author": "Zombienerd300"
            },
            {
                "raw_content": "I wonder if part of the article was AI generated because some stuff is just flat out wrong. They say Standard Edition gets the $30 Blackcell Battlepass for free, and the Mastercraft and Operator collections which are part of the Vault Edition.",
                "author": "EnvironmentalLog2"
            },
            {
                "raw_content": "The article also has extremely outdated information. The zombies section is exclusively information from leaks and rumors instead of what has been announced. The article also isn’t written by the normal Forbes BO7 author. It’s written by someone who primarily covers sports. If I had to guess, he needed a reason to make a new article and decided to ask ChatGPT about BO7 info",
                "author": "InformationFun8865"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "MSI B760MPOWER overclocking motherboard for Intel LGA-1700 CPUs leaked",
        "score": 16,
        "text_content": "",
        "comments": [
            {
                "raw_content": "why though isn't B760 locked for OC anyway?",
                "author": "Zeraora807"
            },
            {
                "raw_content": "Too late for the B760 unless Intel wanna do something like the old Pentium Anniversary Edition.",
                "author": "skylinestar1986"
            },
            {
                "raw_content": "MPOWER for AM5 way better and i would like to get one for LGA 1851",
                "author": "evofromk0"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD Official Post - Continued Support for Every Radeon Gamer",
        "score": 315,
        "text_content": "",
        "comments": [
            {
                "raw_content": "this announcement has more words but says exactly the same thing as the previous announcement",
                "author": "Loose_Skill6641"
            },
            {
                "raw_content": "AMD one of the only companies whose marketing dept work for the oppostions",
                "author": "Huntakillaz"
            },
            {
                "raw_content": "Most likely because Redstone will only officially come to RDNA3 and RDNA4. official int8 fsr4 support is likely only coming to rdna3 as well.",
                "author": "Mercennarius"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD releases statement confirming RDNA1 and RDNA2 will continue to receive game optimizations",
        "score": 129,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So... All this drama not to give RDNA 2 Int8 FSR4? Was it worth the bad publicity?",
                "author": "bombaygypsy"
            },
            {
                "raw_content": "And as usual when the shit hits the fan, the loser at the head of the GPU business backpedals.",
                "author": "WorstRyzeNA"
            },
            {
                "raw_content": "Good \\-Signed my 6750xt",
                "author": "AFoxGuy"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Radeon RX 9070 XT finally reaches $599 MSRP in the US, eight months after launch",
        "score": 551,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Getting one of those at MSRP is a deal. I'm very happy with my Sapphire Pure that I got at UK MSRP.",
                "author": "TheCatLamp"
            },
            {
                "raw_content": "Finally but now look at RAM",
                "author": "Big-Conflict-4218"
            },
            {
                "raw_content": "Surprised they got to MSRP at all actually. One of the few products anywhere that has dropped in price. Can't even get that with eggs. A for effort.",
                "author": "Baggynuts"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Morefine H1 first compact PC with \"Strix Halo\" MAX+ PRO 395 variant costs $2199, includes 128GB RAM",
        "score": 12,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "It's hard to be an AMD fanboy after all of this... RIP the best lossless scaling rig...",
        "score": 0,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A smidgen of context fine sir?",
                "author": "Personal-Acadia"
            },
            {
                "raw_content": "The Radeon VII. These things are still inflated in price thanks to crypto miners. I'm seeing them for $225-$250 on eBay while the competing RTX 2080 is below $200. For the uninitiated: crypto mining relies heavily on a video card's memory bandwidth. The Radeon VII's 16GB of VRAM is HBM2 (High Bandwidth Memory).",
                "author": "TheyCallMeMrMaybe"
            },
            {
                "raw_content": "It will be great on Linux! Go 🐧",
                "author": "zappor"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "New Construction price drop over $2 million",
        "score": 24,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Holy insanity. $2.2 million for 3,700 sq/ft on a one acre lot? And honestly the design and look of the exterior makes me want to puke. Un freaking real. Also, it comes with a permanent parting gift. Yeah, in addition to overpaying for the house you get to spend $350/month for your Karen HOA president to complain about anything and everything.",
                "author": "ColorMonochrome"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "First time renting out a home… tenant turned out to be a professional scammer :(",
        "score": 26,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Isn't writing fraudulent checks a felony? Something about this story doesn't add up.",
                "author": "FuckIPLaw"
            },
            {
                "raw_content": "We have had one of greatest RE markets in history which made every RE investor (STR or LTR) into investing geniuses. Lot of new investors who mainly started past few years have no idea what a down turn is. And as as rental and RE market starts getting worse not many of these investors are prepared for double digit vacancy rates, rents no long rising to keep up with taxes and main costs and increasing delinquencies.. We are starting to see more and more investors trying to cash out in my area.",
                "author": "Dmoan"
            },
            {
                "raw_content": "Lol",
                "author": "Dry-Interaction-1246"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The first linear attention mechanism O(n) that outperforms modern attention O(n^2). 6× Faster 1M-Token Decoding and Superior Accuracy",
        "score": 509,
        "text_content": "https://arxiv.org/pdf/2510.26692",
        "comments": [
            {
                "raw_content": "I think this is huge. Mamba tried and failed for multiple reasons. This not only matches but outperforms standard mla performance (token-token interaction, long context scaling, Expressivity, benchmarks). It’s so efficient that it performs at 1 million tokens how a model today would perform at 128k",
                "author": "gbomb13"
            },
            {
                "raw_content": "Truly amazing work",
                "author": "QuantityGullible4092"
            },
            {
                "raw_content": "This seems like a big deal.",
                "author": "Warm_Iron_273"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "How should corporations, platforms, or governments protect people from AI-enabled reality-warping and social engineering?",
        "score": 156,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is the problem in a nutshell. Once a person is fooled they refuse to accept it and instead construct a reality to form a truth out of a lie.",
                "author": "Vonplinkplonk"
            },
            {
                "raw_content": "Of course he'd say that, do you honestly think that kind of person would ever admit they were wrong / tricked?",
                "author": "Kquinn87"
            },
            {
                "raw_content": "\"How should corporations, platforms, or governments protect people from AI-enabled reality-warping and social engineering?\" Why would they do that? Reality warping and social engineering is exactly how the masses are controlled. Why do you think religions were invented? Reality warping -> miracles and all the super power shit like walking on water. Social engineering -> you have to go to sunday sermon to be indoctrinated. In addition, even if they want to, I doubt they can. People are gullible. If there are those who deny covid even when they are on their dead beds being killed by it, without AI, we have no hope in front of AI. Half of the population will believe anything. Half of the population will believe nothing.",
                "author": "NyriasNeo"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Google pulls Gemma from AI Studio after Senator Blackburn accuses model of defamation",
        "score": 16,
        "text_content": "",
        "comments": [],
        "subreddit": "singularity"
    },
    {
        "post_name": "Kuavo-5 is currently used for high-voltage remote inspections over the 1,200 km Shanghai–Beijing route, increasing inspection efficiency by 84%",
        "score": 247,
        "text_content": "Powered by 5G-A, enabling ultra-low latency remote control and real-time 20Mbps HD vision streaming. »Achieved a 1,200 km ultra-distance test from Beijing to Shanghai with seamless operation. »Boosted inspection efficiency by 84%, enabling fully unmanned patrols in 10kV–110kV areas. This marks a milestone for 5G-A + embodied intelligence in power and industrial sectors,paving the way for applications in emergency rescue, chemical, and energy operations.",
        "comments": [
            {
                "raw_content": "would be perfect if the controller is wearing a light weight exoskeleton for his/her arm and fingers that provide resistance.",
                "author": "pcurve"
            },
            {
                "raw_content": "bUt cAN iT dO anYtHinG uSefUl?",
                "author": "xcewq"
            },
            {
                "raw_content": "If this works it could save a lot of lives.",
                "author": "Baphaddon"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Qwen3-Max Thinking now available in Qwen chat",
        "score": 98,
        "text_content": "",
        "comments": [
            {
                "raw_content": "But no benchmarks yet, strange",
                "author": "PassionIll6170"
            },
            {
                "raw_content": "Having to select manually whether to use the search tool feels so last year...",
                "author": "QuantumPenguin89"
            },
            {
                "raw_content": "That’s cool but I tried using it and well I use search and it’s giving me info from 2024",
                "author": "popmanbrad"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The revolution of AI ear buds",
        "score": 49,
        "text_content": "AI right now is pretty wild west online, but with ear buds, it can start going offline. The ability to be in a conversation and to get advice and guidance from a powerful intelligence may become too compelling not to do. Once that happens, AI will start to seep into everything we do. Imagine, for example, talking with a realtor. You ask them a question and they can provide insights which are very deep and very impressive. Or a teacher, if you ask them a question. I believe it will happen, eventually, and more likely in cultures which embrace AI. And it will be dramatic. I also believe this is what Sam Altman is so enamored by. **The critical feature will be always on, listening, so if a question comes up you can just tap your watch or phone to get guidance to the last few seconds / minutes of conversation.** Even better would be AI that would know when to insert itself. (Everyone gets to be Serac / WestWorld now, and we don't even have to wait until 2053)",
        "comments": [
            {
                "raw_content": "Sounds horrible tbh. Though I am wondering how it'll work. For me, I struggle to hear what someone is saying if someone else is speaking to me st the same time. I cant imagine trying to hear someone while ai is speaking to me describing it.",
                "author": "Same_West4940"
            },
            {
                "raw_content": "This but also with glasses/camera to see what we see.",
                "author": "74123669"
            },
            {
                "raw_content": "J A R V I S",
                "author": "athousandtimesbefore"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Can AI know what it's thinking?",
        "score": 311,
        "text_content": "OK, this one is crazy. This isn't just pattern matching anymore. New Anthropic research shows Claude can sometimes detect its own thoughts. The experiment: they inject a concept (like \"dust\" or \"bread\") into the model's neural activity, then ask if it notices anything unusual. 20% of the time, Claude correctly identifies what was injected, before that concept affects what it writes. Research shows that the model checks its own prior \"intentions\" (its internal neural patterns) to decide whether an output was deliberate. We're building systems that are starting to observe themselves. Unreliable and limited, but it's happening. Full Paper: https://transformer-circuits.pub/2025/introspection/index.html What are your thoughts on this?",
        "comments": [
            {
                "raw_content": "Activation-steering research on itself is not new, but this is fascinating to me for the reason - that since model clearly is able to introspect - we now know where and at what strength we can pull the lever to essentially modulate the reasoning process. I would love to reproduce it on an open model. But I would not say they're \"starting to observe themselves\". These are still linear activations, not really a self-monologue.",
                "author": "Agreeable-Chef4882"
            },
            {
                "raw_content": "I wonder if you could train a net to have better metacognition using this concept. Like, you build a training set using sections of input text, for each, select another random section of text to inject, then have an LLM respond as if it was an LLM who was guessing what was injected. During training you edit some intermediate outputs with random (but correlated) tensors which are unique to the text injected for each input-output pair, and train on the net like normal",
                "author": "true-fuckass"
            },
            {
                "raw_content": "Its response when injected with \"poetry\" read so eloquently and flowed so well. I wonder if it also increased its writing abilities.",
                "author": "meatspin6969"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Vercel trained an AI agent on its best salesperson. Then it cut the 10-person team down to 1.",
        "score": 145,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The headline is misleading. The company retained the employees and moved them to more interesting work now that an AI was handling rote drudgery.",
                "author": "mambotomato"
            },
            {
                "raw_content": "This is what it’s for. Don’t people get this yet?",
                "author": "Sufficient-Flatworm7"
            },
            {
                "raw_content": "There's no way a company like Vercel has only 10 sales people right?",
                "author": "YodelingVeterinarian"
            }
        ],
        "subreddit": "singularity"
    }
]