[
    {
        "post_name": "Federal police deploy endless rounds of tear gas and crowd control munitions to disperse unlawful crowd outside the ICE facility. War-like scenes as protesters launch munitions back at federal agents, starting fires.",
        "score": 607,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Have we found the money men yet? Can we start making conspiracy arrests?",
                "author": "Formerlurker92"
            },
            {
                "raw_content": "This shit has to be stopped, gettin real fuckin tired of the half ass softshoe limp wristed response to everything, SEND IN THE FUCKING TROOPS AND CRACK THEIR GODDAMNED SKULLS.",
                "author": "RedPillosopher1776"
            },
            {
                "raw_content": "This is fucking retarded, install the damn permanent water cannons already.",
                "author": "yummy_yumm_yumms"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Drunk Kamala Harris just had a total meltdown on stage",
        "score": 575,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I cheer too when I'm reminded she's not president",
                "author": "Whartooth"
            },
            {
                "raw_content": ">You know what, I am not President of the United States! And America is thankful you're not. And that you never will be.",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "Ooooooof. She’s drunk and pissed off. Shes spiraling in anger.",
                "author": "Quiznos585"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "No Kings!",
        "score": 448,
        "text_content": "",
        "comments": [
            {
                "raw_content": "they should stick to saving Their Democracy",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Words can’t express how bitter I am for being forced to take that shot…",
                "author": "stillbringingitback"
            },
            {
                "raw_content": "God Emporer > King",
                "author": "makersmarx"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Breaking: Gavin Newsom has shown up to the riot!",
        "score": 415,
        "text_content": "",
        "comments": [
            {
                "raw_content": "penis erect, very disrespectful",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Lol did they actually post this?",
                "author": "Patrick_Bateman"
            },
            {
                "raw_content": "\"You're an embarrassment.\" Says the guy who turned California into a third-world shithole and made it one of the most infamous states in the country. Honestly I'd say Newsom is *particularly* atrocious amongst Democrats, *and that's saying a lot.*",
                "author": "TheJakeFroggy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The White House has been trolling Democrats all day",
        "score": 467,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Link https://x.com/WhiteHouse/status/1979729073497936319",
                "author": "I-am-Orlando"
            },
            {
                "raw_content": "lmao!",
                "author": "Roadpower"
            },
            {
                "raw_content": "very nice Mexican crowns",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The left would just have you forget about this",
        "score": 363,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# well its just fine if he (D)oes it",
                "author": "Justlooking250"
            },
            {
                "raw_content": "I’ll just leave this here https://www.amazon.com/Queen-Ambition-Hillary-Coming-Clinton/dp/1455562513",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Daddy Issues. Theyve got daddy issues.",
                "author": "SpellingContable"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Steak 'n Shake: We are proud to announce the full, 100% elimination of seed oils from Steak n Shake's fries. Fries with even a trace of seed oil will no longer be served at our restaurants. Steak n Shake continues to work with its suppliers every day to improve food quality. MAHA",
        "score": 884,
        "text_content": "",
        "comments": [
            {
                "raw_content": "FUCK YEAH. Now tell me it's 100% PURE AMERICAN BEEF TALLOW and I'll try their food again.",
                "author": "USMC1234O10"
            },
            {
                "raw_content": "I grew up in the 60s and 70s eating at Steak ‘n Shake all the time. I would really love to see the rebirth of this chain into something great.",
                "author": "GuerillaYourDreams"
            },
            {
                "raw_content": "I've been eating Steak n Shake for dinner for that past two months or so, ever since my location switched to tallow. Have I gained weight? Probably. But feels good to support a MAHA company!",
                "author": "AyChiXuaxua"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "DC_Draino : Nothing to see here. Just a major New Jersey county refusing to allow cameras in ballot storage areas and a sign-in/out log. If there’s no election fraud, then why would they prohibit common sense security like this?",
        "score": 1252,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Crime...Crime...Crime...Crime...Crime...Crime...Crime...Crime...",
                "author": "MAGAguitar"
            },
            {
                "raw_content": "Ya think? Corruption in the US is quite honestly deep beyond comprehension.",
                "author": "RiolindasReturn"
            },
            {
                "raw_content": "cameras at every traffic light, on every building, on every phone, in everyone's face everywhere EXCEPT where the vote counting occurs. Right.",
                "author": "NoMoreShinesBilly"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I don’t care to coexist with these fucking people in a country they “love” when it’s optically advantageous to do so",
        "score": 1145,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How the fuck do you live in Arkansas without being \"racist\"? I am not talking about hating black people in general, but not acknowledging inner city criminals as a fucking problem. I did a internship in Southern Arkansas at the Lockheed-Martin plant. Beautiful country but the crime rates in the black parts of Arkansas are so absurdly high that it makes large parts of the state unlivable, and the rest doesn't have people - with that no jobs. You either have absurd crime, absurd poverty, or some pretty racist towns.",
                "author": "RedStoneDeepState"
            },
            {
                "raw_content": "Everything they don't like is racist.",
                "author": "NoFats"
            },
            {
                "raw_content": "Unhinged pill fueled mentally ill fucking losers. You can't talk to these people, they're just trash.",
                "author": "USNVET71"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Illinois State Police declare an UNLAWFUL ASSEMBLY outside ICE Broadview after leftist rioters violently THREW things at police",
        "score": 1040,
        "text_content": "",
        "comments": [
            {
                "raw_content": "JUST IN and JUST NOW have replaced BREAKING",
                "author": "PatriotSkorzeny"
            },
            {
                "raw_content": "They WON'T arrest lefties. In blue states, the police SIDE with the liberal mindfreaks.",
                "author": "airmaildolphin"
            },
            {
                "raw_content": "Fascists go home!!! - Well, dumb fucks, go home.",
                "author": "RentFree2020"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Best president of all time",
        "score": 632,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Leftist: NO MORE KINGS! Trump: 😎🖕",
                "author": "TrumpWonByALandslide"
            },
            {
                "raw_content": "Why did Trump steal a plane from India?",
                "author": "TPMJB"
            },
            {
                "raw_content": "I can't wait to see these at the Donald J. Trump Presidential Library in Miami!",
                "author": "SummTingWong"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ICE Arrests Illegal Alien Chicago Gang Leader That Offered Bounties For Killing Federal Agents",
        "score": 584,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Old turd looking 3rd world-er",
                "author": "yummy_yumm_yumms"
            },
            {
                "raw_content": "make an example of him cartel style",
                "author": "negative_entropy"
            },
            {
                "raw_content": "How is he the boss, obviously not the brains of the operation.",
                "author": "RedPillosopher1776"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Long live the King!",
        "score": 1486,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Jesus is the King. Maybe that’s the “No King” these protesters 👹ultimately mean",
                "author": "MAGAguitar"
            },
            {
                "raw_content": "I love when far-left publications think they're dissing Trump with those kind of covers, but they're actually making him look epic.",
                "author": "KekistanPM"
            },
            {
                "raw_content": "I would buy Trump Magazine!",
                "author": "TDAF"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "our \"NO KINGS\" protest last November was bigger",
        "score": 547,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Kamala’s campaign wasn’t too short. It was too long. Her numbers were never higher than the week Shit Stain handed it over to her. Then afterwards, the more people saw of her the more they hated her. If she had more time, she would have done even worse, not better. Fucking ugly butch can eat shit.",
                "author": "least_counties_ever"
            },
            {
                "raw_content": "The media is trying too hard to make this a thing.",
                "author": "Greenhills"
            },
            {
                "raw_content": "No King Pedo and No black queenz either.",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "It's not enough to troll them, we need to shove our ideology down their throats and penalize them when they gag or ask us to stop, just like they taught us.",
        "score": 1395,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Cry harder, you weak faggots. NOTHING can stop what's coming.",
                "author": "AwShitHereWeGoAgain"
            },
            {
                "raw_content": "64 thousand ? That's our \"opposition\"? What happened to the Democrats 81 million??? Pretty laughable.",
                "author": "Koikatrose"
            },
            {
                "raw_content": "Hit em with the alts JD you know the game.",
                "author": "FuckReddit4545"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "REAL BLACKS LOVE TRUMP!!!! 👫🏿👫🏿👫🏿👫🏿👫🏿👫🏿👫🏿👫🏿❤️🍊",
        "score": 1189,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Virtually all blacks vote for bigger government. Ask any black. This post is just copium. Why do you think Chicago hasn't had a Republican mayor in almost a century? It's quite obvious most of you never lived in the hood.",
                "author": "MickHigan2"
            },
            {
                "raw_content": "BLACKS FOR TRUMP 2028",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Anyone with a working brain can tell you this Dems need CHAOS to vote PROGRESSIVE",
                "author": "here2red"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Why do Leftist HATE FREE SPEECH?",
        "score": 1034,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They hate your free speech not their own.",
                "author": "donteatthat"
            },
            {
                "raw_content": "They hate it because they can't win any argument or debate. They know their side is irrational and illogical. They know if people hear opposing views and beliefs they would lose a shit ton of support. It is why they have been shutting down conservative speakers across colleges for years. They know they can't win in the arena of ideas. It is also why you NEVER see conservatives shut down leftist speakers. We want people to hear them.",
                "author": "Username_here"
            },
            {
                "raw_content": "Because they hate America!",
                "author": "TrumpsAmericaForMe"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Me wondering why a North African who moves to the UK is considered \"British\" but I'm on \"stolen land\" 400 years later",
        "score": 551,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Because communists want all whites dead.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "White people take control of land, that's colonialism. Other races take control of land (especially Muslims): They conquered it fair and square and now they get exclusive use of it forever.",
                "author": "fskfsk"
            },
            {
                "raw_content": "Trump’s buddy Larry Ellison is funding Tony Blairs Institute which is a major NGO behind all this. I can’t help but wonder if we’re being played for a fool ?",
                "author": "SpeekFreely"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Democrats are opposed to any kind of political violence, so I look forward to them universally condemning Zohran Mamdani for campaigning with an unindicted co-conspirator in a terrorist plot that killed 6 New Yorkers.",
        "score": 1216,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Remove kebab.",
                "author": "DeusVult1096"
            },
            {
                "raw_content": "Muslims need extermination, not negotiation.",
                "author": "IroWide"
            },
            {
                "raw_content": "[Mamdani appears smiling, arm-in-arm with unindicted ‘93 WTC bombing co-conspirator and terrorist apologist](https://nypost.com/2025/10/18/us-news/mamdani-appears-smiling-arm-in-arm-with-imam-siraj-wahhaj-93-wtc-bombing-co-conspirator/) Mayoral frontrunner Zohran Mamdani happily campaigned with a popular Brooklyn Imam who is an unindicted co-conspirator in the 1993 World Trade Center bombing — and whose son once ran a terrorist camp for kids. The Democratic nominee appears in a photo posted to X laughing and grinning, standing arm-in-arm with Imam Siraj Wahhaj and City Councilmember Yusef Salaam at Wahhaj’s Bed-Stuy mosque to celebrate the weekly muslim prayer. Wahhaj, 75, Imam of the mosque and leader of the muslim alliance in North America, has a checkered past. The religious figure was fingered by prosecutors as an “unindicted co-conspirator” in the 1993 World Trade Center bombing, which left six people dead — and had publicly defended the plotters of the attack against the FBI and CIA, which he at the time dubbed the “real terrorists.” During subsequent trials, Wahhaj testified in support of Sheik Omar Abdel Rahman — the infamous “blind sheikh” and leader of a terrorist sect out of Egypt — calling the man a “respected scholar.” Wahhaj, who was born Jeffrey Kearse, made headlines yet again in 2018 when three of his children were arrested for keeping 11 kids living in “Third World” conditions in a compound made of garbage in the New Mexico desert. One of the victims told prosecutors that Wahhaj’s namesake son was training the 13-year-old and his teen brother to fight against non-believers through techniques including rapid reloads and hand-to-hand combat. Wahhaj claimed he was the one who called the police on his sick children, leading to their arrest.",
                "author": "Mr_Rightside"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Terrifying",
        "score": 1510,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Any decent recommendations for not-woke Sci-Fi? I just finished the Dune series - great books.",
                "author": "RedStoneDeepState"
            },
            {
                "raw_content": "Please tell me this is satire! Please...",
                "author": "TheColonelsDaughter"
            },
            {
                "raw_content": "Reeeeeeeeeeeeeeeeeeeeeeeeading",
                "author": "TEXinLA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Power bricks and wall warts for EU market must include detachable USB-C cables by 2028 — New legislation also adds power rating labels for cables",
        "score": 532,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We will be getting better labeled USB chargers and cables out of this : >The legislation also forces manufacturers to display power ratings on the EPS itself, the charging port, and even the cables themselves. The rated wattage must be for continuous charging without voltage drops, presumably to prevent inflated, unrealistic figures. A new \"Common Charger\" logo should make it easy for users to identify compliant chargers.",
                "author": "narwi"
            },
            {
                "raw_content": "This is great. The convergence on USB C for power is really one of the best general usability improvements in consumer electronics over the past decade or so. When traveling for work, I used to carry at least 3 different power supplies with their own cables each for various doodads, and then usually also a multi-outlet adapter to be able to plug them all in at a convenient location. Now, I can just use one powerful (but pretty small, thanks GAN) high-quality USB PSU, and plug one or more of the devices into it. I can even save on cables because they generally don't all need to be plugged in at the same time. And on the latest trains here I don't even need the PSU and can just plug the USB in directly. The future really is now :P",
                "author": "DuranteA"
            },
            {
                "raw_content": "What an improvement. I have a drawer full of power supplies with barrel plugs i collected over the years. All with different voltages, plug sizes and even different polarities, so you could even fry a device if you use the wrong one.",
                "author": "psi-storm"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "NVIDIA and TSMC Celebrate First NVIDIA Blackwell Wafer Produced in the US",
        "score": 34,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Article written by one \"GFreeman\" (as in \"Gordon Freeman\") and reads like typical A.I slop. That's a new low for TechPowerUp. >Onstage at the celebration, Huang joined Y.L. Wang, vice president of operations at TSMC, to sign the Blackwell wafer, commemorating a milestone that showcases how the engines of the world's AI infrastructure are now being constructed domestically. Petition to rename U.S made Blackwell chips to BaldEagle...",
                "author": "GenZia"
            },
            {
                "raw_content": "Congratulations capitalism I guess.",
                "author": "TheCh0rt"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "ASRock RX 9070 XT \"Monster Hunter Wilds\" Edition listed for $699, launching November 21",
        "score": 5,
        "text_content": "",
        "comments": [
            {
                "raw_content": "not even enough to run the game from what ive heard",
                "author": "TophxSmash"
            },
            {
                "raw_content": "Hello wickedplayer494! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "HardwareUnboxed - RTX 5070 vs RX 9070 - DLSS 4 vs FSR 4 Performance Compared",
        "score": 108,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TLDW: * RX 9070 is 13% on average faster at 1440P (with and without upscaling enabled) * Both GPUs are currently available at $550 MSRP price, i.e. RX 9070 is 11% cheaper on cost/frame * With quality upscaling enabled: i) RX 9070 hit 60 FPS on average on all 23 games tested. Achieved 80 FPS on 20 out of 23 games. Achieved 120 FPS in 11 out of 23 games ii) RTX 5070 hit 60 FPS on average on 21 out 23 games tested. Achieved 80 FPS on 16 out of 23 games. Achieved 120 FPS in 6 out of 23 games * RX 9070 offers 16GB of VRAM vs RTX 5070 12GB * DLSS 4 is supported in many more games than FSR 4",
                "author": "Antonis_32"
            },
            {
                "raw_content": "The RX 9070 being 13% faster than the 5070 would mean it's now as fast as the 9070XT was on their original review of the 9070XT at 1440p (9070XT ended up 13% faster than the RTX 5070 back then), quite the improvement.",
                "author": "RainyDay111"
            },
            {
                "raw_content": "Amd needs to step up their fsr game support. When you compare the number of games which has dlss(and can be upgraded to dlss 4) to the games with fsr 4 support(I believe fsr 3.1 games can be upgraded), its a huuge difference.",
                "author": "Castielstablet"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nvidia unveils first Blackwell chip wafer made with TSMC in US",
        "score": 52,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> TSMC's Arizona facility will produce advanced technologies including two-, three- and four-nanometer chips, as well as A16 chips, that are essential for applications like AI, telecommunications and high-performance computing, Nvidia said.",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "I wonder where it will be assembled.",
                "author": "DjiRo"
            },
            {
                "raw_content": "Well I'll be damned, Arizona even with all the water shortages, let's wait for official mass scale yield numbers compared to Taiwanese manufacturing. Children yearn for a 16GB 5060 Ti Super OC",
                "author": "K33P4D"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "First Phison-E28-based SSD officially announced: TeamGroup Z54E",
        "score": 16,
        "text_content": "[https://www.tomshardware.com/pc-components/ssds/second-gen-phison-ssd-controllers-hit-the-market-with-14-9-gb-s-speeds-teamgroup-z54e-spearheads-a-new-army-of-pcie-5-0-drives](https://www.tomshardware.com/pc-components/ssds/second-gen-phison-ssd-controllers-hit-the-market-with-14-9-gb-s-speeds-teamgroup-z54e-spearheads-a-new-army-of-pcie-5-0-drives) Looks like we have the first E28-based drive on the market, with much improved efficiency in the PCIe5 SSD space. For a first look, Toms Hardware already looked at an E28 pre-production / reference design. [https://www.tomshardware.com/pc-components/ssds/phison-e28-2tb-ssd-review](https://www.tomshardware.com/pc-components/ssds/phison-e28-2tb-ssd-review)",
        "comments": [
            {
                "raw_content": ">Considering that the E28 draws a maximum of approximately 7W, the Z54E is likely adequately cooled without the need for a chunky active cooling solution. Finally, a PCIe5 SSD that doesn't actively require cooling.",
                "author": "battler624"
            },
            {
                "raw_content": "Who cares random read and writes have no improvement",
                "author": "halotechnology"
            },
            {
                "raw_content": "There was a comment somewhere on Reddit by a Phison rep stating that they had several firmware revisions since the review I linked and performance has been further improved. Looking forward to a review of the release version.",
                "author": "sbpnt"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "A total GameFREAK game",
        "score": 2564,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Everyone in Lumiose City acted normal before they were quarantined for a year due to an outbreak of Pokérus.",
                "author": "BakaDoug"
            },
            {
                "raw_content": "https://preview.redd.it/5wshby4tzvvf1.jpeg?width=420&format=pjpg&auto=webp&s=01721ff52301d5aa81983593001f98ec7ccb7d42",
                "author": "Working_Equal_2897"
            },
            {
                "raw_content": "I love these npcs",
                "author": "zaadiqoJoseph"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "When are they updating the GameCube NSO?",
        "score": 38,
        "text_content": "Are we really not getting another game in October ? Come onnn",
        "comments": [
            {
                "raw_content": "I'm still expecting Luigi's Mansion by the end of the month. Pokemon came out this week so no need for NSO.",
                "author": "The-student-"
            },
            {
                "raw_content": "It does stink how slow they are with NSO updates, but I do wanna state for the record--Chibi-Robo is absolutely worth digging into to help pass that time. I've been having a blast with it and feel like it would've blown my little mind if I'd played it when it came out",
                "author": "Splash-Damage-25"
            },
            {
                "raw_content": "Never",
                "author": "Silent_Anxiety4828"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "What are you playing this weekend? I’m having so much fun with Pokemon Z-A!",
        "score": 300,
        "text_content": "The gameplay loop is addictive. Hard to put it down.",
        "comments": [
            {
                "raw_content": "DK Bananza + Hades 2!",
                "author": "dellowitz"
            },
            {
                "raw_content": "Restarted BotW and it’s such a great handheld experience on the Switch 2.",
                "author": "PM_me_your_omoplatas"
            },
            {
                "raw_content": "Metroid dread! First time playing, getting ready for some MP4",
                "author": "No-Discussion-3073"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Poland: Mario Kart World Bundles still everywhere",
        "score": 297,
        "text_content": "2.399 PLN = 565 EUR incl. 23% VAT. Pokemon Bundle also start showing up for same price. Switch 1 OLED here is 1.529 PLN = 360 EUR without game. Thats Media Expert, one of the biggest branches.",
        "comments": [
            {
                "raw_content": "Some people think that this kind of stock on shelves is launch day stuff that did not sell, it's actually all the restocks because this time around nintendo are making so many devices.",
                "author": "DiabUK"
            },
            {
                "raw_content": "When you produce a lot of stock it makes sense that you will keep seeing it in store. I think people are still hung up on the covid supply issues of the PS5 and assume that you won't be able to find stock in store.",
                "author": "xanas263"
            },
            {
                "raw_content": "Yeah, they have the best launch year stock availability of any console ever. It’s why it’s selling better than any console ever so far.",
                "author": "The_Pepper_Oni"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Visual and Auditory Bliss.",
        "score": 47,
        "text_content": "I’ve found the perfect set of cans for my Switch 2 mobile gaming experience.",
        "comments": [
            {
                "raw_content": "Omg I'm such a moron. I was trying to figure out what the circles were on your switch and its reflection of the lights 🤣",
                "author": "Crafty_Theme7968"
            },
            {
                "raw_content": "What brand?",
                "author": "TiidaMan"
            },
            {
                "raw_content": "Is there a delay on them?",
                "author": "ShotAcanthocephala8"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Final Fantasy Comparison",
        "score": 129,
        "text_content": "This comparison of the Final Fantasy Remake blows my mind. This is running on a handheld. Its a stunner and has me bumping up my order for the Switch 2. I'm sure there are differences that are deal breakers for them, but for me, growing up with the original Gameboy, this is amazing.",
        "comments": [
            {
                "raw_content": "You could have just copy and pasted the same video 4 times and I wouldn't know the difference.",
                "author": "AgentSkidMarks"
            },
            {
                "raw_content": "Can't tell the difference honestly",
                "author": "Youri1980"
            },
            {
                "raw_content": "very nice.... now, show me the gameplay footage",
                "author": "anti-kit"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Two versions",
        "score": 4,
        "text_content": "Does anyone know why I have two versions of; “Plants Vs Zombies replanted” preloaded on my switch 2?",
        "comments": [
            {
                "raw_content": "One version for switch 1 and one for switch 2",
                "author": "Meanuz"
            },
            {
                "raw_content": "probably switch 1 and switch 2 version",
                "author": "Miniyi_Reddit"
            },
            {
                "raw_content": "I haven’t seen it mentioned anywhere, but maybe the purchase includes the switch 1 & 2 versions?",
                "author": "PandaStudio1413"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "BBC report on the disastrous development of Mindseye",
        "score": 244,
        "text_content": "https://www.bbc.com/news/articles/c4gzn34gwvwo",
        "comments": [
            {
                "raw_content": "Leslie Benzies is the same dude who defended no GTA V story DLC because the game was \"three games in one\". Dudes full of it.",
                "author": "Particular_Hand2877"
            },
            {
                "raw_content": "Imagine screwing up so badly one of the biggest news outlets in the world ends up researching you",
                "author": "Resident_Bluebird_77"
            },
            {
                "raw_content": "The fact that this is coming from BBC instead of Bloomberg or Kotaku of all things is mind-blowing to say the least. Was hoping for Jason Schreier being the one reporting this.",
                "author": "Bumblebee2455"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "God of War TV Series Casting Call",
        "score": 383,
        "text_content": ">Zion (Kratos) – A male in his 40s to 60s, any ethnicity. A war-hardened, muscular figure haunted by loss and a violent past. After his wife’s death, he’s forced to raise his 10-year-old son, though he struggles to connect emotionally. The role demands comfort with intense physicality, hand-to-hand combat, and possible nudity. (Series Regular) >Joshua (Atreus) – A boy aged 9 to 12, any ethnicity. Intelligent, curious, and emotionally neglected, Joshua seeks his father’s approval in a cold, unforgiving world. The role includes physical combat and weapons training. (One-Year Series Regular) >Alexander (Odin) – A white male in his 60s to 70s. Despite his unassuming appearance, Alexander is described as a manipulative and god-like patriarch obsessed with prophecy and control. He’s powerful, cruel, and willing to sacrifice his own family for survival. (Series Regular) >Glen (Baldur?)– A white male in his 30s to 40s. Handsome, sharp, and calculating, Glen feels overshadowed by his brothers and carries his father’s manipulative streak. The character requires comfort with combat, simulated sex, and nudity. (Series Regular) >Phoebe (Sif) – Female, any ethnicity, Age 30s – 40s. A beautiful woman from modest roots, Phoebe’s life changed for the better after marrying a powerful man, granting her access to resources she never had. Despite her upbringing, she often feels like an outsider and must constantly prove herself to a family who doesn’t fully accept her. She has three children she loves dearly, but her husband’s descent into self-hatred and alcoholism led to their emotional drift. Phoebe’s quiet intelligence and diplomatic skills help her navigate the cruel world of gods, though she remains deeply suspicious of her father-in-law’s motives, especially concerning her daughter. Must be comfortable with simulated sex and nudity. (Series Regular) [source](https://knightedgemedia.com/2025/10/god-of-war-live-action-tv-series-casting-call-confirms-2018-video-game-storyline)",
        "comments": [
            {
                "raw_content": "Nude Kratos?",
                "author": "Ok_Canary5591"
            },
            {
                "raw_content": "Is Richard Schiff not available to play Odin again in live-action? \"One year series regular\" is interesting to see.",
                "author": "CommonMasterpiece866"
            },
            {
                "raw_content": "Possible nudity?! Kratos dong reveal confirmed",
                "author": "Individual-Land6203"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[NateTheHate] says Final Fantasy IX Remake’s development is likely paused",
        "score": 367,
        "text_content": "Nate is just assuming, he is also not sure if Square will return to develop it. [Source](https://mynintendonews.com/2025/10/18/natethehate-says-final-fantasy-ix-remakes-development-is-likely-paused/)",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "So just an assumption",
                "author": "czarchasm4532"
            },
            {
                "raw_content": "Just fell to my knees in 7-eleven",
                "author": "Ornery-Tonight1694"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Reb updated saying people are misinterpreting what he reported",
        "score": 163,
        "text_content": ">Many people are misinterpreting what I reported as if it directly confirms AI is being used in all the wrong ways and Halo is doomed. I did NOT report that. I have begun reaching out to sources to figure out specifics about how Halo Studios is using generative AI. Also using AI in game development isn’t new, but using it in negative ways is becoming an industry wide issue. I’ll talk about this in my next video. [source](https://xcancel.com/Mr_Rebs_/status/1979666123747463470)",
        "comments": [
            {
                "raw_content": "![gif](giphy|wkfUSeBl7f18hnicZw)",
                "author": "scorchedneurotic"
            },
            {
                "raw_content": "Nah he knows what he’s doing. He knew saying it that way would grab headlines. Otherwise why even mention it at all if AI in game dev isn’t new? Which it’s not, but it kind of defeats his own point.",
                "author": "Greatsnes"
            },
            {
                "raw_content": "so I don't get it. did AI build master halo's space ship or not? what are the lore implications to this if any?",
                "author": "skpom"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Rfbs Gaming: Halo Studios has generative AI \"woven into every aspect\" of game dev, from core workflows to world building and enemy AI",
        "score": 567,
        "text_content": "[Source](https://thegamepost.com/insider-halo-studios-generative-ai-game-development/)",
        "comments": [
            {
                "raw_content": "The art director’s recent departure, and the quote that accompanied it makes full sense now",
                "author": "kargethdownload"
            },
            {
                "raw_content": "I’d expect every studio under Microsoft will be using AI. This really shouldn’t be a surprise from the insane amount they’ve invested into it and the pipe dream of being able to fire more devs in favour of AI. Hopefully it doesn’t affect anyone’s job in the near future or the quality of games, but I’m not holding my breath.",
                "author": "South_Buy_3175"
            },
            {
                "raw_content": "The only AI I want to see in halo is cortana.",
                "author": "sonicboom9000"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "PlayStation’s new Dark Outlaw Games listed a job “requiring hands-on experience with AI art tools like Midjourney, Stable Diffusion and ChatGPT”",
        "score": 234,
        "text_content": "“To refine and polish 2D artwork created by both humans artists and generative AI tools” Looks like AI will be a staple in the gaming industry now. Source: https://thegamepost.com/insider-halo-studios-generative-ai-game-development/",
        "comments": [
            {
                "raw_content": "Everything is shitty now and forever, I suppose (Or until the AI bubble bursts and half the tech industry collapses)",
                "author": "Taymatosama"
            },
            {
                "raw_content": "This was reported in May 20th btw > The job description says the ideal candidate should **“refine and polish 2D artwork created by both human artists and generative AI tools,”** and have “advanced expertise in using generative AI tools such as Stable Diffusion, Midjourney, ChatGPT, or similar platforms.” Dark Outlaw Games is clearly looking for someone who can bridge the gap between classic art skills and the new wave of AI-powered creation. [Source](https://thegamepost.com/playstation-dark-outlaw-games-artists-generative-ai-tools-midjourney-chatgpt-stable-diffusion/)",
                "author": "MrYK_"
            },
            {
                "raw_content": "![gif](giphy|w9T9mjKQIoFKmix4l0)",
                "author": "RoleRemarkable9241"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "18 October 2025 - Weekly /r/REBubble Discussion",
        "score": 3,
        "text_content": "What's the word on the street? Share your questions, comments, and concerns below.",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Lower rates were supposed to bring homebuyers back this fall. Here’s why it hasn’t happened.",
        "score": 295,
        "text_content": "",
        "comments": [
            {
                "raw_content": "* Rates aren't actually down * Prices aren't down * Prices of everything else up, preventing/eating into savings * Economic uncertainty way up",
                "author": "travelinzac"
            },
            {
                "raw_content": "Hm I wonder if homes were more affordable when they were $185k at 10% interest or at $750k at 6%",
                "author": "Chief_Mischief"
            },
            {
                "raw_content": "I don’t need to read more bullshit to know why it hasn’t happened",
                "author": "DEADHOTTUB"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Has any seller tried Free Listings?",
        "score": 3,
        "text_content": "Has anyone tried freelistings dot com? The company has not come to my area yet, so I have no idea what their \"free\" actually means?",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Reactions to Open AI employees' wrongful claims that gpt-5 solved Erdos problems. Demis Hassabis: \"this is embarrassing\" Yann LeCun: \"Hoisted by their own GPTards\" (yann lecooked with this one).",
        "score": 94,
        "text_content": "Are competitors sick of Open AI hyping things up too much? I've never seen Demis say something like that in public before. I wouldn't be surprised if he felt slighted by the Open AI employee's start of the (now deleted) tweet where he said something like \"AI accelerating science has officially begun,\" as wtf is AlphaFold and all the real science Google Deepmind has done so far? Does that not count? For context, an Open AI employee (who was a VP of AI something at Microsoft before joining last year) put out a tweet that said gpt-5 solved several Erdos problems. Then he edited it to say \"found solutions\" as it was proven wrong. It's since been deleted. This is the guy behind the Sparks of AGI paper when he was at Microsoft, with regards to gpt-4 if anyone remembers that. Yann just doing a bit of high-tier trolling. I hope Open AI does start to make scientific progress now with AI as they've been hyping up lately. Their tweets are just often a bit feeding into the hype before things are ready, which sets unrealistic expectations for where the tech is currently. Demis always provides some caution about the hype on AI right now. He says that it's overhyped in the short term, but in medium to long term (still quite soon), it's underhyped. Google Deepmind has been cooking with AI for science for years - they're the gold standard.",
        "comments": [
            {
                "raw_content": "The constant hype is exhausting.",
                "author": "FarrisAT"
            },
            {
                "raw_content": "\"it's like the Manhattan Project\" \"Feels like AGI to me\" \"PhD level intelligence\" I can go in...but it's a pattern with OAI. Their leader is a hypeman so everyone takes after him. It's quite pathetic.",
                "author": "GamingDisruptor"
            },
            {
                "raw_content": "Ok but don’t put someone else on the pedestal as if Demis Hassabis hasn’t said something worse. Let me remind you he has said that we may cure all diseases in 10 years. That’s way worse and not happening. Edit: also the tribalism in this sub is beyond cringe. Insufferable.",
                "author": "oilybolognese"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Political commentator labels AI Tech Bros 'emotionally maladapted psychopaths' over OpenAI's adult mode",
        "score": 388,
        "text_content": "https://youtu.be/WsapUfGUkTc?si=YioczwqphP_eroj- A new study of 2000 pupils by the Oxford University Press suggests the vast majority of teenagers use AI with schoolwork, but over half couldn’t easily spot misinformation. On BBC Question Time, political commentator Ash Sarkar and columnist & author Matthew Syed discuss the audience question: “Will Artificial Intelligence harm our ability to think?”",
        "comments": [
            {
                "raw_content": "This 'story' about OpenAI somehow adding a sex mode to the chatbot when literally all they are talking about is slightly relaxing the moderation of what the bot was obviously always capable of producing when an adult is logged in is so dishearteningly stupid.",
                "author": "Simonindelicate"
            },
            {
                "raw_content": "It's so wack how they never bothered to pay attention to actual LLM progress toward scientific innovation, and instead hyperfixated on one comment on following through on a promise to lower the guardrails made A YEAR AGO. It just goes to show how hostile the atmosphere is towards AI right now. Things happening in the AI space get radically misconstrued by people with a strong bias and they just get to keep confirming it by picking and choosing what updates deserve their attention (do we think this lady knew what o1 was?)",
                "author": "Glittering-Neck-2505"
            },
            {
                "raw_content": "![gif](giphy|7k2LoEykY5i1hfeWQB)",
                "author": "ReturnMeToHell"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Recent demo by Skild AI",
        "score": 42,
        "text_content": "",
        "comments": [
            {
                "raw_content": "it ignored human instructions at the end and solid-snaked that hurdle. Terrifying",
                "author": "TinySmolCat"
            },
            {
                "raw_content": "humans better get their kung fu on.",
                "author": "Illustrious_Image967"
            },
            {
                "raw_content": "I thought it can tie shoelaces.",
                "author": "giatai466"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Optimus robot heading for mass production, Tesla orders $685 million in parts ! Enough to build 180,000 robots",
        "score": 679,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I feel like we are couple of gens before it is actually useful, so idk",
                "author": "whyisitsooohard"
            },
            {
                "raw_content": "What are the chances it gets released with barely any practical uses with the promise of ‘game changing’ updates 6-12 months down the line which never happen????",
                "author": "WestleyMc"
            },
            {
                "raw_content": "> $685 million in parts ! Enough to build 180,000 robots So just under $4,000 per unit in parts. Potentially these could end up reasonably priced if those numbers are correct. Now, as to capabilities... we'll see. The demos thus far have been underwhelming.",
                "author": "NYPizzaNoChar"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Within 25 min codex-cli with GPT-5 codex made fully working NES emulator in pure c!",
        "score": 211,
        "text_content": "link to the code [https://github.com/Healthy-Nebula-3603/Owner-avatar-gpt5-codex-medium-proof-of-concept-nes-emulator](https://github.com/Healthy-Nebula-3603/Owner-avatar-gpt5-codex-medium-proof-of-concept-nes-emulator) **Currently using codex-cli with GPT 5 codex medium - one shot - 25 min** **I have a plus account to build this codex used 25% of my 5 hours limit.** **The first attempt was using codex-cli with GPT-5 thinking high - one shot - 45 min** Results: Emulator was only showing title screen of some nes games but no playable link [https://www.reddit.com/r/singularity/comments/1nfibtq/within\\_40\\_min\\_codexcli\\_with\\_gpt5\\_high\\_made\\_fully/?utm\\_source=share&utm\\_medium=web3x&utm\\_name=web3xcss&utm\\_term=1&utm\\_content=share\\_button](https://www.reddit.com/r/singularity/comments/1nfibtq/within_40_min_codexcli_with_gpt5_high_made_fully/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) **NOW the results are far better - games are playable but with some graphic glitches. I suspect the second prompt describing what is wrong would fix it.** Firstly I asked GPT5 chat for a prompt to build fully working a NES emulator in clean C. I got a PROMPT: \" You are to implement a \\*\\*Nintendo NES emulator\\*\\* in \\*\\*clean, portable C (C11)\\*\\* that runs on Linux/macOS/Windows and loads standard \\*\\*.nes (iNES 1.0) ROM images\\*\\*. The project must build with a single \\`Makefile\\` using \\`cc\\` and depend only on \\*\\*SDL2\\*\\* for video, audio, and input. Favor clarity, strict correctness, and good structure over cleverness. \\## GOAL & SCOPE \\- Implement a playable NES emulator with: 1. CPU: Ricoh 2A03 (MOS 6502 derivative, \\*\\*no BCD\\*\\*). Cycle-accurate instruction timing. 2. PPU: NES PPU with scanline-accurate rendering (not necessarily pixel-perfect), supporting: \\- Background + sprites \\- Name/attribute tables, palettes, scrolling (fine/coarse), sprite evaluation, sprite 0 hit, sprite overflow flag per NES behavior \\- Vertical/horizontal mirroring per cartridge 3) APU: Basic, accurate-enough audio (pulse 1/2, triangle, noise, DMC). Use SDL2 audio callback. 4) Controllers: Standard 2 gamepads (strobe/shift register protocol). 5) Mappers: At minimum \\*\\*NROM (0/180)\\*\\*, \\*\\*MMC1 (1)\\*\\*, \\*\\*UxROM (2)\\*\\*, \\*\\*CNROM (3)\\*\\*, and \\*\\*MMC3 (4)\\*\\* good enough to run many classics. 6) File format: \\*\\*iNES 1.0\\*\\* header parse; refuse NES 2.0 unless clearly supported. 7) Timing: NTSC (60.098 Hz) as primary; PAL optional. Maintain CPU:PPU:APU relationship (PPU \\~3× CPU). 8) Save states (optional but nice): single file dump of CPU/PPU/APU/cartridge/mapper. 9) Battery-backed PRG-RAM persistence for mappers that support it (write a \\`.sav\\` next to the ROM). \\## NON-GOALS \\- FDS, exotic mappers, run-ahead, netplay, shaders, rewind. Keep it classic and clean first. \" \\------------------------------------------------------------------------------------------------- **THAT CODE IS NOT A COPY OF OTHER WORK ...I CHECKED ALREADY.** **I know many will be telling that.**",
        "comments": [
            {
                "raw_content": "I wonder how similar it is to existing emulators in it's data set.",
                "author": "tomqmasters"
            },
            {
                "raw_content": "Next step write it in assembly!",
                "author": "freexe"
            },
            {
                "raw_content": "The haters are hilarious. Midwits can't leverage AI because they have no creativity to see that if AI can reproduce software, it can also produce new software with similarities. For instance in this case, an emulator for some hypothetical lesser known console. I swear they move the goalposts every time.",
                "author": "WeddingDisastrous422"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Karpathy's clarification regarding his AGI timelines",
        "score": 22,
        "text_content": ">My comments on AGI timelines looks to be the most trending part of the early response. This is the \"decade of agents\" is a reference to this earlier tweet [https://x.com/karpathy/status/1882544526033924438](https://x.com/karpathy/status/1882544526033924438) Basically my AI timelines are about 5-10X pessimistic w.r.t. what you'll find in your neighborhood SF AI house party or on your twitter timeline, but still quite optimistic w.r.t. a rising tide of AI deniers and skeptics. The apparent conflict is not: imo we simultaneously 1) saw a huge amount of progress in recent years with LLMs while 2) there is still a lot of work remaining (grunt work, integration work, sensors and actuators to the physical world, societal work, safety and security work (jailbreaks, poisoning, etc.)) and also research to get done before we have an entity that you'd prefer to hire over a person for an arbitrary job in the world. I think that overall, 10 years should otherwise be a very bullish timeline for AGI, it's only in contrast to present hype that it doesn't feel that way. Full post: [https://x.com/karpathy/status/1979644538185752935](https://x.com/karpathy/status/1979644538185752935)",
        "comments": [
            {
                "raw_content": "Man Andrej is an AI fandom favorite.",
                "author": "mightythunderman"
            },
            {
                "raw_content": "AGI timelines difference are often all about the definition. For Karpathy it seems to include advanced robotics that can do physical trade jobs and even solving alignment. Well 10 years is optimistic with such a definition lol Meanwhile people with shorter timelines have far less restrictive definitions. There is no \"right\" or \"wrong\" definitions but that's why i think it's more useful to put a timeline on specific capability. Then when you say \"Robot plumbers are a decade away\", people will probably agree with you. And then when you say \"an AI that can answer the majority of prompts better than the majority of humans\" well that's already there.",
                "author": "Silver-Chipmunk7744"
            },
            {
                "raw_content": "I need help with the “the apparent conflict is not:…” How do you all read this? What conflict is it not? What?",
                "author": "oilybolognese"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Robot ninjas are real now",
        "score": 174,
        "text_content": "",
        "comments": [
            {
                "raw_content": "With every new Unitree update the warning text at the end of the video gets longer and longer",
                "author": "10b0t0mized"
            },
            {
                "raw_content": "I remember someone on Dwarkesh Patel's podcast saying robot members of the army are a few decades away. I seriously doubt that after seeing this",
                "author": "Snoo-82132"
            },
            {
                "raw_content": "This is not ninjutsu. It is chinese Kung Fu.",
                "author": "Sherman140824"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Robotic warfare is gonna be for the 21st century what Nuclear Bombs were for the 20th.",
        "score": 54,
        "text_content": "Not to get Sci Fi terminator on you all, but when I see headlines of China and the United States producing robots en masse, Tesla aiming to produce 1/5th of China's army worth of robots, I don't see how they will be able to resist using them for military applications. After all, they're the perfect peace-keeping/invading forces. Much more impervious to bullets than humans, the technology is getting slowly better and soon they could be more cost efficient, and have better physical endurance and prowess than humans (Try to find the nearest human that can do a backflip like Unitree G1 does), better strategic coordination and awareness of other units, etc.. And unlike nuclear bombs, no mass destruction, and a much of specific target killing capability. A robot army couldn't even have to wipe out cities to take over a country, they would just have to storm the government's whereabouts and take captive or kill head of states. There is zero risk of a robot dying since they are nigh infinitely replaceable. If a unit gets destroyed, they can just instantly produce and ship in another robot and still completely swarm any opposing army with sheer numbers. No need to draft, or worry about training your army, or losing too much soldiers. I think nation states will probably make great use of it to subjgate other countries for heir resources. Suddenly, the great economic powers will have inexhaustible numbers of extremely capable robotic supersoldiers, and other countries will either have the possibility of fighting to their death, or capitulation and being subjgated by the invading army. Suddenly, there will be much more resources wars, and alot of the major superpowers' rivals to their geopolitical influence could be taken out. The only way for nations to be able to survive will be nuclear armament, like UK, France, North Korea, Pakistan etc... or their own robot army, like China or the United States. Sure, the technology might not be here yet, but nuclear bombs were only theorized for the first half of the 20th century, until they became a very real treat to all of human existence for the latter of it. Compared to where we were in the beginning of the 21st century, which was basically no general embodied intelligence robotics at all, to fledgling general embodied intelligence robotics, i think it's safe to say that this could very well become the new dominating scenario of post-2045 warfare.",
        "comments": [
            {
                "raw_content": "We'll probably get slimed by some $7 temu drone instead.",
                "author": "cloudonia"
            },
            {
                "raw_content": "Robotic warfare is already happening with USVs of various sizes, mostly tracked. I think for humanoid robots to be viable they need to be way more rugged and have better battery life. The Unitree g1 can only operate for around 30 minutes of walking.",
                "author": "Character-Engine-813"
            },
            {
                "raw_content": "A robot laserbot can blind anyone that sees it instantly. That's terrifying to me.",
                "author": "GrowFreeFood"
            }
        ],
        "subreddit": "singularity"
    }
]