[
    {
        "post_name": "President Trump confirms LAND STRIKES are starting soon against narco-terrorists",
        "score": 582,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The cartels have had free reign long enough. Prob need to go into Mexico. They helped facilitate an attack on the US by smuggling in millions the last 5 years. A narco state on ur border is a threat. Honestly getting security threat vibes from Canada as well.",
                "author": "DaayTerkErJerbs"
            },
            {
                "raw_content": "The president of Mexico is going to have a big mad about this because their buddies is going to get bombed.",
                "author": "DT170x"
            },
            {
                "raw_content": "I remember when, during the tariff dispute with Canada, it was revealed that the majority of fent was being manufactured in Canada. down the memory hole I guess. we have always been at war with...",
                "author": "newestofnew"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This is treasonous… 60% of rental demand in America during the Biden Administration was foreign born. 50% of FHA loans with US government tax credits were given to foreigners.",
        "score": 461,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Just when I think I could not want deportations and public executions more ... EDIT: And FFS, STOP using the word 'treason' to describe every government action you do not like. It's not treason, it's (disgustingly) probably not even illegal, it's just slimy as fuck.",
                "author": "2016TrumpMAGA"
            },
            {
                "raw_content": "Mortgages were successfully sold as an asset instead of a debt. 2008 highlighted this to a precision, and it resonated for a bit when we kicked out a lot of bad actors for 7 years when they finally declared bankruptcy out of desperation. Those people trickled back in and came back to the poker table. I made a bad bet selling my house in 2020 thinking that COVID would crash the economy, but not as bad as a bet as a lot of the people buying decayed new homes worth half of what they paid. Maybe we will get the government writing new laws for lemon homes to buffer their decisions.",
                "author": "OnceADroplet"
            },
            {
                "raw_content": "i'm sure somebody will arrest someone or something. yawn.",
                "author": "mty_green_go"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "It has been revealed that Indiana Republicans secretly went behind President Trump’s back and struck a deal with Maryland Democrats and Gov. Wes Moore to freeze both states’ redistricting, saving two Indiana Dem seats in exchange for Maryland keeping it’s one GOP seat.",
        "score": 216,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Idiotic deal",
                "author": "BigIgloo"
            },
            {
                "raw_content": "At minimum the redistricting has been a good test to find the traitors. Now we need to capitalize on this an clean house!",
                "author": "becomelions"
            },
            {
                "raw_content": "Who cares about the 1 seat in Maryland",
                "author": "jdemarco2014"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Franklin refuses to pay taxes until 50 million foreigners are removed",
        "score": 238,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Franklin is going to get raided and shot by the feds. The government will kill you if you dont pay them their extortion fee so they can give it to illegal shit-people and other countries.",
                "author": "Buff_cousin_Elroy"
            },
            {
                "raw_content": "franklin goin to prison",
                "author": "YodaBannon"
            },
            {
                "raw_content": "1. Stop paying taxes. 2. If you're called to jury duty and a White person is accused of tax evasion, vote Not Guilty no matter what. 3. The system will collapse without White tax dollars.",
                "author": "AVeryNakedMan"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: President Trump officially pardons Tina Peters.",
        "score": 1115,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How does that apply to the state level? I thought that wouldn't work.",
                "author": "saltyviewer123"
            },
            {
                "raw_content": "A Presidential Election is Federal but voting is handled by States. Interesting move by President Trump. Maybe he knows something we do not know.",
                "author": "GA_Logic"
            },
            {
                "raw_content": "He's trying to shame the state of Colorado for allowing violent criminals out on the street to murder and maim more people, while forcing a woman whose only crime was questioning the results of an election, to rot in prison.",
                "author": "mass55th"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "So not only is Christmas cancelled in Paris, now New Year's Eve. Both for \"safety issues\". France is no longer in control of it's public spaces. All because of islam. Yet it's you and me, who are the problem, we have \"Islamophobia\".",
        "score": 904,
        "text_content": "",
        "comments": [
            {
                "raw_content": "France is public spaces?",
                "author": "BeauHD"
            },
            {
                "raw_content": "Kill them. That's the solution. Ram sticks up their asses until dead. To harsh? End times call for harsh measures, sorry not sorry.",
                "author": "Websitesdown"
            },
            {
                "raw_content": "France should announce Muslim holiday cancelation's for next year ahead of time, otherwise they have fallen. Equal opportunity and all that diversity.",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Dan Crenshaw sends Sean Ryan a cease and desist letter and threatens to sue him. Sean Ryan tells him to get fucked! His response on X.",
        "score": 1156,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Eye patch McCain is a fuckin retard",
                "author": "The_garynator"
            },
            {
                "raw_content": "Dan Crenshaw is a faggot. Sue me.",
                "author": "Underpants"
            },
            {
                "raw_content": "Dan Crenshaw is on the take. Fake patriot, sellout.",
                "author": "EvilGreed209"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "New COURT FILINGS show a SOMALI SCAMMER STOLE $50 MILLION of TAXPAYER MONEY",
        "score": 857,
        "text_content": "",
        "comments": [
            {
                "raw_content": "For low IQ fucktards they are sure adapt at stealing money.",
                "author": "saltyviewer123"
            },
            {
                "raw_content": "Do not vote next year for a single Republican that opposes denaturalization of Somalis. There are 150 thousand of them near Minneapolis. White erasure was intentional. Obama dumped half a million Muslims in Minnesota to rig the state. It is unacceptable what has been done to erase the White majority in the West. It is fucking pure evil and it will stop. The Irish men who recorded a warning to Dublin politicians are heroes. We are no longer putting up with this. Even if you count White Hispanics, the White population went from 80% to 64% in only 2 generations. That was intentional and every single politician needs to be told by our base we demand it be reversed. Every year millions of people in the West are victims of these type of immigrants. Millions. And it isn't just Whites who are victimized. The Stop Asian Hate astroturf collapsed because Japanese & Korean people were pointing out exactly who targets them. Remember: It is not just violence, but also fraud and identity theft.",
                "author": "KuonFan"
            },
            {
                "raw_content": "no need to look. no arrests were made.",
                "author": "newestofnew"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Liberals imported millions of Muslims and then cry about the results",
        "score": 859,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Baby murder = \"serving women\" \"healthcare access\" and \"female equality/empowerment\" Never forget the ONLY thing women fight for politically is permission to murder the unborn.",
                "author": "Ch3f4554551n"
            },
            {
                "raw_content": "Literally none of these liberals are crying about Muslims in this country. They know full well that these animals were imported here solely to vote Democrat forever because that is the party of unlimited welfare and third world apes.",
                "author": "Trumpwon306"
            },
            {
                "raw_content": "META is a current mess. They ban legit accounts but let bot account to stay.",
                "author": "GA_Logic"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Reddits pedophiles REALLY want the children on their site",
        "score": 839,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Social media bans are gay and retarded",
                "author": "Thatunknownguy"
            },
            {
                "raw_content": "To be fair, the ban is retarded...",
                "author": "berserkerbarrage"
            },
            {
                "raw_content": "Reddit: is gay. Australia: hold my beer",
                "author": "Bohemyth_2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"Tax the Rich\", indeed...",
        "score": 838,
        "text_content": "",
        "comments": [
            {
                "raw_content": "AOC is gaining, wait",
                "author": "Bohemyth_2"
            },
            {
                "raw_content": "Funny how a $50k vacation is affordable to someone making $174k/yr.",
                "author": "POTUS_DonnieJ"
            },
            {
                "raw_content": "Is anyone shocked? This is what all commies do this is what all leftists do they feast on your work and money while telling you to eat bugs and stop driving cars. Fools will always support this even as the first shovel of dirt is thrown on their corpse",
                "author": "Bigly2020"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "RINOs in the Indiana State Senate have just REJECTED the redistricting maps, which would’ve eliminated ALL Democrat US House districts in the state",
        "score": 1376,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Classic republican move",
                "author": "Ficklepimper"
            },
            {
                "raw_content": "Republicans are doing to MAGA what they did to the Tea Party.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "This clearly has to be intentional sabotaging. The Republican party is clearly not on our side. They clearly don't give a shit about the country. If they were actually on our side, you'd think they would've eventually gotten the hint by their voters constantly calling them out as spineless do-nothing cowards, and you'd think they would've gotten it by now if they saw how things have been going. Even Trump calls them out and wants them to remove the filibuster and the blue-slip bullshit, but they still refuse to do it. If they were actually on our side, then how the fuck can they possibly be so delusional and incompetent as to think we can somehow still work things out with the left when it's been proven countless times by now that we cannot? Do they listen to their voters at all? No. They don't. Because they're really not on our side. They're corrupt compromised asshole politicians just like the Democrats are. I remember some Republicans in DC openly insulting Trump before, which just further proves their loyalties don't align with ours. The swamp is deep. It's not only Democrats. If the swamp *was* only Democrats, then it'd be much easier to drain, but it's also Republicans who only pretend to be on our side and constantly betray us when we need them. They hate Trump just as much as the Democrats do.",
                "author": "TheJakeFroggy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "MMMM.. BACON..",
        "score": 435,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I have tried shopping at several different piggly wigglys in my lifetime and in different states, most smelled like bad meat others smelled like bad meat and cleaning products …..so I don’t shop there",
                "author": "C0drus"
            },
            {
                "raw_content": "I shouldn't say this but I like it ane wish it were a chain. Now I'll get 10 donwvotes for this comment.",
                "author": "USMC6541E5"
            },
            {
                "raw_content": "lol I needed that laugh.",
                "author": "TravisRSCX"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "How is Lindell going to overcome the fraud??!? 🇺🇸",
        "score": 349,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He had the bravado to at least do something about the 2020 steal but didn't have the resources or the people to successfully fight off the deep state sabotage. If he is going to run I'd vote for him if I lived in Minnesota.",
                "author": "saltyviewer123"
            },
            {
                "raw_content": "Minnesota is pretty solidly blue. He has zero chance, it's just to get more exposure for his message.",
                "author": "mykillk"
            },
            {
                "raw_content": "I've only donated to President Trump all 3 times *he won,* and Ron Paul in 2008, I will *definitely* be donating to *Mike Lindell for Governor of Minnesota.* MAGA 💯",
                "author": "LokiHelmsdeep"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Gonna be the best crash-out since Liz Cheney kek",
        "score": 348,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There is only one N in Senit yo.",
                "author": "TrumpPatriot84"
            },
            {
                "raw_content": "I wouldn’t be surprised if she wins. Austin, DFW and Houston almost ensures it 👎",
                "author": "Tabascocat12"
            },
            {
                "raw_content": "Right up until she “wins”.",
                "author": "bidensmissingbrain"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Regina Romero, the Democrat Mayor of Tucson, Arizona, made a public post DOXXING ICE’s live location to help illegals evade arrest and called for people to protest and surveil ICE activity.",
        "score": 1279,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I was told obstructing mayors would get arrested for illegally impeding federal workers…",
                "author": "KarenLukasik"
            },
            {
                "raw_content": "The moment the left is in power and anybody on the right does anything like this they will get life in jail. Trump and his admin needs to put boots on necks.",
                "author": "Wrexxis780"
            },
            {
                "raw_content": "Why shouldn't she? Nobody else has faced consequences for doing so.",
                "author": "BrianOfNazareth"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Nolte: Mamdani Admits He Has No Idea How to Fund Free Buses. (Or anything else)",
        "score": 1106,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Does the free bus ride include a free stabbing?",
                "author": "OutlawPurpleHairDye"
            },
            {
                "raw_content": "You mean the guy who ran on the middle-school-class-president-election campaign of *AND FREE SODA MACHINES IN EVERY CLASSROOM AND THREE HOUR RECESS!* can't deliver on any of that? Huh.",
                "author": "TheMostUselessFeeder"
            },
            {
                "raw_content": "I'm sure he can ask the City Council to help figure that out.",
                "author": "PeregrineFalcon"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "JD Vance on CNN: If CNN wants to be a real news network it should feature important voices from our administration.",
        "score": 1142,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why? Let cnn die. Most of the boomers are on life support anyways. Just go do Joe Rogan or any other of a slew of other influencers.",
                "author": "Viewer01"
            },
            {
                "raw_content": "CNN = toddler Stephen Miller = plate of vegetables",
                "author": "Zskills"
            },
            {
                "raw_content": "They have no interest in being anything other than a dnc mouth peice",
                "author": "Formerlurker92"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "JAMES WOODS: Who. Is. Going. To. JAIL?",
        "score": 1696,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Spoiler: No one.",
                "author": "Bruno"
            },
            {
                "raw_content": "Basically. We are all losing faith in the systems ability to punish high profile people",
                "author": "Formerlurker92"
            },
            {
                "raw_content": "Just waiting for the Indians to come in here and call James Woods a shill or a doomer.",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "U.S. House REJECTS impeachment of President Trump in a 237-140 vote.",
        "score": 1214,
        "text_content": "",
        "comments": [
            {
                "raw_content": "oh we're doing the peachmints again? LOL",
                "author": "HellNoKameltoe"
            },
            {
                "raw_content": "I didn't even know they were trying this shit again.",
                "author": "Shellingas"
            },
            {
                "raw_content": "This is going to be every single day after 2026",
                "author": "ScoobyDum"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Congress Quietly Kills Military “Right to Repair” Its Own Equipment",
        "score": 437,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Intro to the article: > The idea of a “right to repair” — a requirement that companies facilitate consumers’ repairs, maintenance, and modification of products — is extremely popular, even winning broad, bipartisan support in Congress. That could not, however, save it from the military–industrial complex. > Lobbyists succeeded in killing part of the National Defense Authorization Act that would have given service members the right to fix their equipment in the field without having to worry about military suppliers’ intellectual property. ... > The idea was that no service member would ever be left waiting on a contractor to fly in from Norway to repair a simple part — which once happened — or, in another real-life scenario, told by the manufacturer to buy a new CT scanner in a combat zone because one malfunctioned. > Instead of worrying about voiding a warranty, military personnel in the field could use a 3D printer or elbow grease to fix a part.",
                "author": "Blueberryburntpie"
            },
            {
                "raw_content": "with a fully for-profit defence industry were fiduciary duty is sacred and a deathgrip around congress dangly bits? I'm more shocked it was ever a thing. Yeah there's a lot you don't want cowboy suppliers doling for cheap, but know this is mostly because they are afraid of the procurement getting mundane parts shared with the public sector cheaper.",
                "author": "WhoTheHeckKnowsWhy"
            },
            {
                "raw_content": "I wonder who paid these crooks",
                "author": "AcademicF"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nvidia Says It's Not Abandoning 64-Bit Computing - HPCwire",
        "score": 74,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Huh, so they're probably abandoning 64-bit computing then...",
                "author": "MiloIsTheBest"
            },
            {
                "raw_content": "> When Nvidia unveiled the Blackwell architecture in 2024, 64-bit computing was lower, with just 30 teraflops of FP64 and FP64 Tensor Core performance in the B100. Nvidia never shipped the B100, preferring instead to deliver the B200 and the GB200 Grace Blackwell “Super Chip.” While there was a slight increase in FP64 and FP64 Tensor Core performance over the B100 with the B200, the B200 still didn’t match the H200 in overall FP64 Tensor Core performance, making the older (and cheaper) H100s and H200s a superior choice for traditional HPC workloads. > While Harris couldn’t provide specifics, he suggested that Nvidia would be looking to improve the “core underlying performance” of its future GPUs when it comes to 64-bit computing, Harris said. What exactly that means, we’ll have to wait until GTC 2026 in March to see",
                "author": "WarEagleGo"
            },
            {
                "raw_content": "1.2 TFLOPS FP64? That's lower than a lot of consumer GPUs.",
                "author": "EmergencyCucumber905"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "SK Hynix reaps largest benefits from H200 export approval",
        "score": 10,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "SK Hynix Slows Down HBM4 Ramp, Prepares 300+ Layer NAND Flash",
        "score": 25,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "RAM Prices Surge as Soaring Demand From AI Giants Like OpenAI Pushes Costs Higher",
        "score": 64,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">...in October, nearly 40% of global DRAM output was diverted to a single AI initiative: OpenAI's massive 'Stargate' supercomputing project This is the most important part of the whole DRAM shortage and it hardly gets brought up these forums / comment sections. It was Sam Altman cornering the market's supply.",
                "author": "soggybiscuit93"
            },
            {
                "raw_content": "ibtimes there with the breaking news, reporting a story that started in September.",
                "author": "jenny_905"
            },
            {
                "raw_content": "Have prices settled yet or are they expected to keep going up? I'm seeing at least 3x the cost for low end DDR5 and maybe 4x for higher end kits.",
                "author": "vegetable__lasagne"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Hardware Canucks] The ultimate retro PC case is here (Silverstone FLP02 review)",
        "score": 26,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I like it but wish there were a practical way to make those \"floppy drives\" less fake.",
                "author": "TerriersAreAdorable"
            },
            {
                "raw_content": "Silverstone makes the most overrated overpriced shit. $240 before tax for that.",
                "author": "ww_crimson"
            },
            {
                "raw_content": "I like that Silverstone is making a \"retro\" case that symbolizes actually nothing of their brand or case history. Literally nothing they've ever released in the entire history of the company looks close to this. Silverstone has always positioned themselves as a premium brand in the enthusiast space, which means beige plastic bits that yellow out were never their MO. Their first case was all brushed aluminum in 2003, lol. Back when every single case was crappy snap on plastic bits on stamped steel that sliced the shit out of your hand. If Silverstone wants an ultimate retro PC case, refresh the TJ07. It is probably the most legendary modding case of the 2000's.",
                "author": "ThermL"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung moves up Pyeongtaek Phase 4 timeline in aggressive HBM4 push",
        "score": 13,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Tiny Chips Could Lead to Giant Power Savings | Startup PowerLattice’s chiplets could decrease power use by half",
        "score": 24,
        "text_content": "",
        "comments": [
            {
                "raw_content": "For my taste, a few too many unsourced claims with less representation of realistic scenarios. * That \"700W GPU may actually need 1700W\" statement should probably be sourced. Sounds like an extreme edge case for very limited durations, an average number on power losses through each stage would be more useful. * As always, don't uncritically repeat the 'up to 50%' claims from the guy who wants to sell a product. The theory sounds like a sound idea, but these are reportedly at least 2 years out and bound to face engineering challenges. Putting ultra-thin high current VRMs directly below the processor substrate is bound to come with complexities, which is the the interesting part IMO.",
                "author": "JuanElMinero"
            },
            {
                "raw_content": ">Right now, PowerLattice is in the midst of reliability and validation testing before it releases its first product to customers, in about two years. But bringing the chiplets to market won’t be straightforward because PowerLattice has some big-name competition. Intel, for example, **is developing** a [Fully Integrated Voltage Regulator](https://edc.intel.com/content/www/us/en/design/ipla/software-development-platforms/servers/platforms/intel-pentium-silver-and-intel-celeron-processors-datasheet-volume-1-of-2/fully-integrated-voltage-regulator-fivr/), a device partially devoted to solving the same problem. i thought FIVR was first introduced 12 years ago on haswell and later dropped? and the link goes to a pretty random intel datasheet which also happens to be the first result if you google \"intel FIVR,\" while the next result directly below is from 2014. where did \"is developing\" come from? getting some LLM vibes here",
                "author": "pewciders0r"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Mario Kart World has won best Sports Racing Game at The Game Awards",
        "score": 842,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Crosswords is fun but World is the game I’ll keep coming back to",
                "author": "Jpgamerguy90"
            },
            {
                "raw_content": "Knockout Tour Online with a friend is mad fun. It’s the only mode we play.",
                "author": "WizSkinsNatsCaps"
            },
            {
                "raw_content": "Sonic fans in shambles.",
                "author": "InternationalCream30"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "First Award of The Game Awards goes to Donkey Kong",
        "score": 796,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ooo bananaa",
                "author": "ProfPyg"
            },
            {
                "raw_content": "Well deserved, but likely the only award for Nintendo.",
                "author": "Popple06"
            },
            {
                "raw_content": "Absolute Bananza.",
                "author": "kahabraham"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Orbitals Coming Exclusively To Switch 2 2026",
        "score": 410,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Art style is fantastic",
                "author": "vladscrutin"
            },
            {
                "raw_content": "Split fiction with an 80s anime style? Count me interested",
                "author": "JL990"
            },
            {
                "raw_content": "This game looks so cool I wish I had friends",
                "author": "Heyoayyo"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Im still wishing 🥲",
        "score": 174,
        "text_content": "Yeah we got p3r but the biggest ones i wanted like baldurs gate 3 and expedition 33 are still no where to be seen even after the game awards tonight which i was sure would reveal something",
        "comments": [
            {
                "raw_content": "\"buy a steam deck\" comments are coming",
                "author": "Possible_Aardvark856"
            },
            {
                "raw_content": "Metaphor on switch 2 would make me stay up all night 🙏",
                "author": "PhaseSlow1913"
            },
            {
                "raw_content": "I’m surprised Oblivion remake hasn’t come to the Switch yet. You’d think the updated engine would be pretty scaleable.",
                "author": "Jay-metal"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Pragmata is coming to Switch 2",
        "score": 345,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Capcom going all in with support. SF6 RE and now this. Love to see it.",
                "author": "crusf2"
            },
            {
                "raw_content": "Really excited, Capcom is knocking it out of the park with the support. Hopefully the hardware can keep up for 3/4 years",
                "author": "Vintage_Creep"
            },
            {
                "raw_content": "FUCK YEAH",
                "author": "kahabraham"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "MegaMan Duel Override Announced For Switch 1 & 2, Coming 2027",
        "score": 161,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I saw gonna say something about it still coming to Switch, but PS4 is gonna be nearly 14 years old by the time the game comes out. This last gen of consoles is taking forever to die off. Excited to get a new Mega Man game though.",
                "author": "gaysaucemage"
            },
            {
                "raw_content": "it was so funny watching the live YouTube chat collectively lose their shit about the slim possibility of HL3 then Megaman just stands there",
                "author": "CrispyMcNuggNuggz"
            },
            {
                "raw_content": "Over a year 😭",
                "author": "Pokeguy211"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Pragmata is Getting An Amiibo",
        "score": 242,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So the port had been planned for a while",
                "author": "Phos-Lux"
            },
            {
                "raw_content": "Capcom fucking loves Nintendo They're going all in on S2 in a way that no other 3rd party is",
                "author": "KMoosetoe"
            },
            {
                "raw_content": "Wait, so this is coming to Switch 2? They haven’t officially announced it. I’d been checking. Great!",
                "author": "Jay-metal"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Leon In RE9",
        "score": 157,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Can’t wait",
                "author": "105bydesign"
            },
            {
                "raw_content": "I saw an AI image being passed around prior to this official reveal. They had made Leon look like a clone of Joel from TLoU2.",
                "author": "Garamenon"
            },
            {
                "raw_content": "Lol people fell for the ai \"leaks\" whwre he looks 50",
                "author": "Perfect_Exercise_232"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "[Live Watchalong Thread] The Game Awards 2025",
        "score": 257,
        "text_content": "By popular demand, I've made this live thread as a live chat/discussion for people to specifically discuss the event as it unfolds. The previous megathread can act as a \"pre-game\" thread like a lot of you were asking for, specifically for predictions/wishlist. You can access that thread [here](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1pgyjj5/megathread_the_game_awards_121125/) |The Game Awards| |:-| |**Date/Time:** December 11, 2025 [7:30PM EST](https://dateful.com/eventlink/3026395181) (Click for your Timezone)| |**Where to Watch:** [TGA's Youtube](https://www.youtube.com/@thegameawards), [IGN's Youtube](https://www.youtube.com/c/IGN)| |[**What to expect**](https://thegameawards.com/faq)|",
        "comments": [
            {
                "raw_content": "Things have gotten so bad on the Half Life subreddit that they are tracking a pizza store near Valve as there have been a highly unusual amount of orders placed right now lmao. Never change.",
                "author": "PettyTeen253"
            },
            {
                "raw_content": "I demand Geoff to livestream himself playing this game as proof that he enjoys it lmao",
                "author": "Mohacas"
            },
            {
                "raw_content": "All the insiders teasing GoW and Square Enix at this thing are on fraud watch.",
                "author": "Weekly_Protection_57"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Leon Kennedy confirmed as a second playable character in RE9",
        "score": 1260,
        "text_content": "[https://www.youtube.com/watch?v=w0oAeG3Ly0A](https://www.youtube.com/watch?v=w0oAeG3Ly0A) Previous: [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1pi43sa/leon\\_has\\_been\\_leaked\\_in\\_re9\\_via\\_playstation\\_store/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1pi43sa/leon_has_been_leaked_in_re9_via_playstation_store/)",
        "comments": [
            {
                "raw_content": "Not just a cameo segment like Chris in 8 either, he's the other half of the campaign.",
                "author": "AllCity_King"
            },
            {
                "raw_content": "Quick! act surprised!",
                "author": "RedoLane"
            },
            {
                "raw_content": "Even tho we already knew but the trailer was so hype damn",
                "author": "Loose_Society9485"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "The Game Awards statue confirmed as...Divinity",
        "score": 904,
        "text_content": "[https://www.youtube.com/watch?v=lLdPSg1Cn-Y](https://www.youtube.com/watch?v=lLdPSg1Cn-Y) Previous Rumor: [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1pifp1u/mp1st\\_tga\\_statue\\_mystery\\_solved\\_new\\_divinity/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1pifp1u/mp1st_tga_statue_mystery_solved_new_divinity/)",
        "comments": [
            {
                "raw_content": "Thank you, Larian!",
                "author": "RedoLane"
            },
            {
                "raw_content": "If that's not \"One more thing\"... what could possibly be",
                "author": "Ardis160"
            },
            {
                "raw_content": "That trailer was a lot. Bet they had a fun meeting describing that.",
                "author": "ResponsibleTrain1059"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Star Wars: Fate of The Old Republic Announced",
        "score": 699,
        "text_content": "Announced at TGA: [https://www.youtube.com/watch?v=lAmkl1jL0fo](https://www.youtube.com/watch?v=lAmkl1jL0fo) Previous rumors: [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1pkbd83/kurakasis\\_the\\_old\\_republic\\_game\\_announcement/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1pkbd83/kurakasis_the_old_republic_game_announcement/)",
        "comments": [
            {
                "raw_content": "Lmao the leaker who said there was a game which wasnt KOTOR but ended with Old Republic wasnt trolling after all",
                "author": "Soufiane040"
            },
            {
                "raw_content": "Now if only the remake of kotor would come out",
                "author": "Embarrassed-Part-890"
            },
            {
                "raw_content": "my unborn grandchildren are gonna love this game",
                "author": "DiaperFluid"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Control Resonant announced",
        "score": 352,
        "text_content": "Announced on TGA -- [https://www.youtube.com/watch?v=WhQm-ExRz60](https://www.youtube.com/watch?v=WhQm-ExRz60) Previous rumors: [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1p8e4m5/mp1st\\_new\\_trademark\\_for\\_control\\_resonant\\_unearthed/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1p8e4m5/mp1st_new_trademark_for_control_resonant_unearthed/) [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1pj9ahu/shinobi\\_hints\\_at\\_control\\_2\\_showing\\_up\\_at\\_tga/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1pj9ahu/shinobi_hints_at_control_2_showing_up_at_tga/) Edit: changed the link to the trailer to one on the Remedy channel.",
        "comments": [
            {
                "raw_content": "![gif](giphy|tnA3zNZoGHQKd8X0F1)",
                "author": "Mindless_Stuff9179"
            },
            {
                "raw_content": "The reveal was fucking awesome. I'm a fan of Remedy, so I'm throwing my bias out there, but that reveal rocked. Taking things in a melee direction with Dylan wasn't what I expected, but I'm excited to see Remedy expand their gameplay systems.",
                "author": "ErikWithNoC"
            },
            {
                "raw_content": "Looks like a big shift to melee. If so, THEN IM SO EXCITED FOR OMG",
                "author": "Carlosless-World"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Sir, a second Tomb Raider game has hit the leak cycle",
        "score": 773,
        "text_content": "Following up the all but confirmed leak of the reimagined first game Tomb Raider: Legacy of Atlantis slated to be coming in 2026, a second game called Tomb Raider: Catalyst seems to have also been unearthed and dated for 2027. It seems to be the long rumored TR12, the official next mainline entry into the series. Also adds up with Shinobi stating that there is more than 1 thing in store for Tomb Raider fans. https://www.reddit.com/r/TombRaider/s/sT82RzWxLz",
        "comments": [
            {
                "raw_content": "Its tomb raider season now!",
                "author": "Objective_Love_6843"
            },
            {
                "raw_content": "New York's hottest club is Tomb Raider, this club has everything - season 2 of a Netflix series, a remaster of the 2013 game, a remake of the 1996 game, Sigourney Weaver, a brand new game.",
                "author": "The_Iceman2288"
            },
            {
                "raw_content": "What in the fuck lmfao",
                "author": "Possible-Potato-4103"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Protodude says \"there's more coming sooner than you think\" after Mega Man Dual Override",
        "score": 180,
        "text_content": "[Protodude (Rockman Corner) on X:](https://xcancel.com/Protodude/status/1999328089353125996) \"This is something a few of us have known about for a LONG time, and it has been a very hard secret to keep… …but there’s more coming sooner than you think.\"",
        "comments": [
            {
                "raw_content": "I wonder if it's a modern sequel to the x series in the same vein as MM9/10",
                "author": "Vallmor"
            },
            {
                "raw_content": "My hope and wish is Legends 3. It's always Legends 3. It's always going to be Legends 3. Get our boy off the moon!",
                "author": "XthecreatordayX"
            },
            {
                "raw_content": "We need X9",
                "author": "ImNotSkankHunt42"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Kurakasis: The Old Republic game announcement title is NOT \"KNIGHTS of the Old Republic\"",
        "score": 451,
        "text_content": "[https://xcancel.com/Kurakasis/status/1999242529053770174](https://xcancel.com/Kurakasis/status/1999242529053770174) >The title is NOT \"KNIGHTS of the Old Republic\"",
        "comments": [
            {
                "raw_content": "Lego Podracers of the Old Republic",
                "author": "Sirca_Curvive"
            },
            {
                "raw_content": "Teasing that it ends with “old republic” to then say it’s not “knights of the old republic” an hour before the show starts. I don’t know what tier this guy is but he comfortably goes into the S tier of COMPLETE ASSHOLES",
                "author": "Dull-Caterpillar3153"
            },
            {
                "raw_content": "Total War: The Old Republic",
                "author": "KekanKok"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Protodude: Dual Override is not the only project for Mega Man's 40th anniversary",
        "score": 89,
        "text_content": "[https://xcancel.com/Protodude/status/1999331580423119055](https://xcancel.com/Protodude/status/1999331580423119055) >So, what I can say: > >This project has been in development on and off for a couple of years. It is not Taisen. It is, and at one point was titled, Mega Man 12. It was originally planned to be announced earlier this year, as far back as spring. > >It is a keystone project for the 40th anniversary. Not the only one, but a big one. Personal note that this does not have to be a game project",
        "comments": [
            {
                "raw_content": "People always talk about Legends 3 or a new X game, but I’m surprised there hasn’t been any attempt at a Battle Network revival. You’d think the internet becoming ubiquitous would have made it easier to sell to kids, they wouldn’t really need to change all that much.",
                "author": "Realshow"
            },
            {
                "raw_content": "Not just being limited to game projects makes me think we might finally be getting that Netflix movie as well in the near future from Mattson Tomlin (The Batman co-writer) I really fucking hope X9 is in the cards though",
                "author": "MyMouthisCancerous"
            },
            {
                "raw_content": "What even was Taisen anyway?",
                "author": "XenonBug"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Overclocked my Xeon x3470 2.93Ghz to 4.11Ghz... It's crazy",
        "score": 58,
        "text_content": "PC Specs : \\- Xeon x3470 2.93Ghz (Overclocked to 4.11Ghz) \\- Amd Sapphire HD 7870Ghz (It's show has a R9 370X because of NimeZ drivers) \\- 8 GB of single channel ram (DDR3 & From Corsair, i can't find more information about this ram idk why) \\- x2 256GB SSD sata / x1 500GB HDD (5600RPM \\- 650w Corsair PowerSupply \\- ROG Maximus Formula III (Motherboard) It's crazy to think that a cpu from 2009 can be easily overclocked.. 2.9Ghz to 4.1Ghz is crazy !",
        "comments": [
            {
                "raw_content": "\"It's crazy to think that a cpu from 2009 can be easily overclocked.. 2.9Ghz to 4.1Ghz is crazy !\" You could overclock huge amounts on earlier generations - I used to run Pentium 4 1.6GHz chips at 3.2GHz on air-cooling, more on phase-change cooling.",
                "author": "ThorburnJ"
            },
            {
                "raw_content": "Back in the day you could overclock a 2600k from 3.4Ghz to 4.5Ghz on a $25 Hyper212 cooler. The performance gains were incredible as Sandy Bridge scaled very well at higher clocks. Now days CPUs come overclocked already.",
                "author": "virtualmnemonic"
            },
            {
                "raw_content": "I ran my i5 750 2.67Ghz for years at 4Ghz without any issues. I benched it some at 4.2Ghz even, but it was not fully stable. The X58 CPU are even better tho. And even if you had insane OC potential back in the days it was not as good as it sounds, since the turboboost was higher than the stock frequency that is listed.",
                "author": "Dirtey"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel Arc Pro B60 Battlematrix Preview: 192GB of VRAM for On-Premise AI",
        "score": 27,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> With up to 192GB of VRAM across eight GPUs in a single system, Battlematrix positions itself as a relatively cost-effective alternative to other professional GPU ecosystems for AI inference workloads.",
                "author": "WarEagleGo"
            },
            {
                "raw_content": "Wish they’d give prompt processing speeds. AI coding generates very few tokens compared to input. Nvidia seem to dominate here.",
                "author": "alexp702"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Another \"Xeon 696X\" Sample Gets Benched, PassMark Incorrectly Identifies 32-core Config",
        "score": 21,
        "text_content": "",
        "comments": [],
        "subreddit": "intel"
    },
    {
        "post_name": "HWiNFO adds improved Core Ultra 400 \"Nova Lake-HX/H\", Ultra 300 and Ultra 200K Plus CPU support",
        "score": 44,
        "text_content": "",
        "comments": [
            {
                "raw_content": "As 265k is 20% faster than 9700x, nova lake expected to be 20% faster than zen 6 x3d. Here is my own test for that. https://youtu.be/PuB0Dg-Jvyk?si=bm2i9f6yRsM4RlcQ",
                "author": "SelfSilly9478"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD launches FSR SDK 2.1.0 to speed up adoption of FSR Redstone",
        "score": 112,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Checked docs in GitHub and > Vulkan is currently not supported in SDK 2.1",
                "author": "LordAlfredo"
            },
            {
                "raw_content": "When vulkan support It is a really big downside",
                "author": "JamesDoesGaming902"
            },
            {
                "raw_content": "Just release vulkan so optiscaler can make it for them",
                "author": "Polosauce23"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "MSI X870E MAX & EVO motherboard launched, 64MB BIOS for future AMD AM5 Ryzen generations",
        "score": 31,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What are the odds I'll need to upgrade my brand new AM5 board just to get the final AM5 chip",
                "author": "VeganShitposting"
            },
            {
                "raw_content": "Why does 64mb matter? Some X870E boards have 256mb flash for the bios.",
                "author": "Smallp0x_"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD launches Radeon AI PRO R9700S and R9600D GPUs: Navi 48, 32GB memory and passive cooling",
        "score": 19,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "The Fed thinks the U.S. economy is actually losing jobs",
        "score": 446,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I mean, that's what Wall Street has been bragging about all year...",
                "author": "ChadsworthRothschild"
            },
            {
                "raw_content": "\"Thinks\"? It is...",
                "author": "Alexandratta"
            },
            {
                "raw_content": "The gig economy (Uber, Doordash, YouTube creators) is the largest employer in the world. It's propping up the economy.",
                "author": "Likely_a_bot"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Home prices go negative for the first time in over 2 years — and may stay that way for a while",
        "score": 237,
        "text_content": "Prices need to fall even further due to the outsized 40%+ gains over the past 5 years. The national boycott of bagholders trying to sell their overpriced boxes with triangular roofs is working. Very soon, if not already, the carrying costs will be greater than the price appreciation. Remember, *the home is only worth what the next buyer is willing to pay for it, regardless of renovations/carrying costs.* Finally, the housing market lives and dies on FOMO, because very soon after this negative headline, there will be another headline to ‘counter’ it, saying: * \"mortgage applications are up\" * \"pending home sales are up from \\_\\_\\_\" * \"refinancing activity is up after interest rates drop \\_\\_%\" etc. * **National trend**: U.S. home prices fell 1.4% in the last three months, turning negative year‑over‑year for the first time since mid‑2023. * **Inventory shift**: Active listings in November increased by 13% from the same period last year, although new listings rose by only 1.7%. Many sellers are also pulling homes off the market. * **Mortgage rates**: The 30‑year fixed has hovered around 7% since 2023. Rates have been stable for the past three months, with little reaction to the Fed’s latest cut. * **Market dynamics**: Analysts cite an “affordability shock” from higher rates, weaker demand, and more inventory as drivers of the decline. * **Regional differences**: * **Drops**: Austin (‑10%), Denver (‑5%), Tampa & Houston (‑4%), Atlanta & Phoenix (‑3%). * **Gains**: Cleveland (+6%), Chicago & NYC (+5%), Philadelphia (+3%), Pittsburgh & Boston (+2%). * **Builders’ outlook**: Homebuilder sentiment remains negative. Demand is weak, incentives are needed, and single‑family starts declined in 2025. A slight rebound is forecast for 2026. * **Forecast**: Experts expect prices to hover near zero growth, small positive or negative changes, rather than the double‑digit surges seen during the pandemic boom.",
        "comments": [
            {
                "raw_content": "AirBnBs in Austin got way cheaper than when I stayed earlier this year. They're finally starving. Booked a hotel anyway. Not rewarding the Instagram hustlers and their \"passive income.\"",
                "author": "RuleSubverter"
            },
            {
                "raw_content": "Atlanta is so overpriced it hurts",
                "author": "fwiga"
            },
            {
                "raw_content": "Ah just my luck. I always buy at the top.",
                "author": "EverGreenPastures"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Why Jerome Powell’s latest rate cut still won’t help you get a lower mortgage rate | Fortune",
        "score": 46,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TL;DR The Fed’s December interest-rate cut won’t move mortgage rates “because markets have already priced it in.”",
                "author": "SnortingElk"
            },
            {
                "raw_content": "Realtwhores dont understand rate cut vs yield curve control",
                "author": "Dry-Interaction-1246"
            },
            {
                "raw_content": "A bit misleading, considering a lot of buyers over the last couple years have 7% or higher rates. You can get a 5.8% 30 year or a 5.5% 20 year refi rate right now. With no points paid. If someone has a newer vintage loan over 7%, it’s a no brainer to refinance to sub 6% with low fees.",
                "author": "zorg-18082"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Are we closer to 5% 30 year fixed mortgage rates?",
        "score": 43,
        "text_content": "The 30-year fixed mortgage rate rose about a quarter-percent going into yesterday's Fed meeting and that is not what buyers want. However, Powell's comments in the press conference were good for bonds and mortgage rates. He admitted that employment numbers might be overstated. He blamed a lot of goods inflation on the tariffs, reiterating his expectation the tariff impact on inflation is likely to be a \"one-time price increase.\" Then he unveiled a new bond buying program. Taken together, if inflation continues to improve and the jobs market remains sluggish, the 10 year yield, which started declining yesterday, will continue to head lower and the 30 year fixed mortgage rate will slowly inch towards 5%.",
        "comments": [
            {
                "raw_content": "Not happening in 2026. Expect stagflation.",
                "author": "SlideIll3915"
            },
            {
                "raw_content": "You can get 5.8% today if you shop around. I think we’ll get to 5.6% or so in the near future. I don’t think we’ll get to 5% flat for a while though. Maybe like 5.2-5.4%.",
                "author": "regaphysics"
            },
            {
                "raw_content": "Just getting to 5.0% would be a miracle for this economy. but even then, affordability does not improve much if prices stay elevated. I want interest rates to go higher, personally. More downward pressure on prices.",
                "author": "HormoneDemon"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Columbus’s Reputation as an Affordable City Is Making Its Homes More Expensive",
        "score": 11,
        "text_content": "",
        "comments": [
            {
                "raw_content": "non-paywall: https://archive.ph/hTBJ2 COLUMBUS, Ohio—For years, Ohio’s largest city was just right. It grew steadily, but never explosively. It was large enough to draw some major employers and two professional sports teams, yet residents praised its small-town feel. Above all, it was affordable. City leaders point to today’s economic growth as a source of pride: Military drone-manufacturer Anduril plans to add more than 4,000 new jobs near the city, while the pharmaceutical company Amgen announced a $900 million investment. JPMorgan Chase has one of the bank’s largest hubs outside of New York City. But for the city’s housing market, it is starting to look like too much of a good thing. Because companies can create jobs much faster than home builders and developers can create more homes, Columbus’s longtime Goldilocks status as a successful city with still-affordable housing is now on shaky ground. The same dilemma faces many other cities seeking to jog their economies without making housing into a hardship. “We are affordable. If we lose that, I don’t know what we become,” said Carlie Boos, executive director of the Affordable Housing Alliance of Central Ohio. “That’s an identity crisis, not just a housing crisis.” **Home values across the metro are up 51% since the start of 2020 through August of this year, according to Zillow, one of the highest rates in the mostly slower-growing Midwest.** **Many in Columbus’s middle class who were born and raised here are delaying plans to buy a home, but they are still getting squeezed by rents. The average asking rent for an apartment was $1,405 in June, a nearly 7% increase from January of last year, according to property data firm Yardi Matrix.** Columbus had some of the fastest rising rents in the country during that time period, though the pace has slowed this fall. Rachel Rinella, a 33-year-old JPMorgan Chase employee, and her husband, Matt, 36, are hoping to start a family. They didn’t see that happening in their cramped two-bedroom apartment. But the couple’s effort to buy a home crashed into the new reality of Columbus’s rising housing market. They were budgeting for a mortgage payment that would be nearly double their current rent. To get there, they cut back on spending, such as meals out and streaming subscriptions. The couple also sold off personal items, such as clothes. Their house hunt covered some of the same suburban Columbus neighborhoods where they were born and raised, and where their middle-income parents still own homes. But Rinella spent much of this year scrolling in vain through the ballooning price history on home listings. “It’s been a struggle,” she said. While Columbus’s population growth isn’t as dramatic as the hottest Southern cities, it might be the closest thing the Midwest has to a Sunbelt-style boomtown. The metro population grew 17% from 2010 to 2024 to reach more than 2.2 million people, surpassing Cleveland. “If housing is not affordable, it’s going to be really hard to continue to attract the best and the brightest here,” said Columbus Mayor Andrew Ginther. More companies view the city as an attractive place to expand. State income taxes are lower than many coastal states, and for wage earners over $100,000 a year, those taxes are set to get lower in 2026, when the state introduces a flat tax. That could draw even more high-earning newcomers. Columbus’s mostly modern downtown quickly gives way to stately, late-19th century residential neighborhoods, like the cobble-stoned German Village, and Olde Towne East, a handsome archive of Queen Anne and other turn-of-the-century homes that has followed the long arc of white flight to more recent gentrification. Unlike many nearby Rust Belt cities, Columbus was never as reliant on heavy industry, helping it to better transition to a knowledge economy, said Kevin Cox, an emeritus professor at Ohio State University who wrote “Boomtown Columbus,” chronicling the city’s rapid growth. “It was fairly well positioned for a white collar future,” Cox said. Growth in technology, high-tech manufacturing and construction have powered new employment. Chip maker Intel is building a new plant in the suburb of New Albany (though construction progress there has been slow). Graduates of Ohio State often choose to stay in Columbus after school, attracted by employment opportunities and housing affordability. New development is seen especially in up and coming areas like Franklinton, a once industrial neighborhood that is lately a haven for artists, and which is filling in with new apartments. The suburbs, especially on the northern side of town, are prized for their public schools. But even as apartment building construction has ratcheted up recently, home-building has remained comparatively flat over the last five years, according to construction data analyzed by commercial property firm Marcus & Millichap. Builders and consultants point to inadequate infrastructure (Columbus has just one interstate loop), community opposition to development in surrounding townships, and most recently, higher mortgage rates that have shrunk the pool of eligible buyers nationally. “We’re not keeping up,” said Bob Yoakam, chief executive of local home builder Rockford Homes. Mayor Ginther and the city council are trying to encourage more new housing construction. Officials this year unveiled a plan to rezone nearly half the city to allow more building activity. The city is also cutting property taxes for developers who include units in their projects that are affordable to lower incomes. Voters last month approved $500 million in new bonds to finance more affordable housing. New for-sale housing is less likely to get a boost from these measures. “There are so many people here that want to own something, but there just isn’t enough to own,” said Justin Ryan, manager of Sweeney’s Walnut Street Tavern in Franklinton. Upstairs at Sweeney’s, real-estate agent Fawn Christy gives a seminar four times a year for service industry workers who are trying to buy their first house. If they don’t buy soon, Christy tells them, prices are only going to drift further out of reach. “Home prices here have grown 5% a year,” Christy said. “What I try to tell my clients is, are you getting paid that increase in your wage each year?” Christy pointed to rental investors as a growing source of competition. Companies and individuals who buy single-family homes for rent have slowed down their purchases in the Sunbelt, but they have more recently discovered Columbus. In March of last year investors of all types owned 13.7% of Columbus’ single-family homes, according to Parcl Labs. That share rose to 15.3% this June. Remington Lyman, a real-estate agent who sells homes to rental landlords, said many buyers from out of state are attracted to Columbus’s lower-income neighborhoods where homes can be bought for $200,000 or less and where renters are often subsidized by government vouchers. In the more rapidly appreciating areas, like in and around Olde Towne East or Southern Orchards, flippers are fixing up cheaper homes and putting them back up for sale at prices of $350,000 or more. “The middle income people that are looking for $200,000 to $300,000 homes in decent areas, I think it’s very, very difficult,” Lyman said. New construction homes are also much more expensive than that, said Kelsey Jones, a real-estate agent who works with first-time home buyers. “They’re building $500,000-plus houses, but that’s not what the average person can afford here.” As for Rachel and Matt Rinella, they found that Columbus can still reward the persistent. After a more than 12-month search, they found a home, a three-bedroom split level with a two-car garage, for $309,000 in the suburb of Westerville. It is cheaper and less in need of work than what they saw before. “This one is in great shape,” Rachel said.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "I heard commentary on CNBC last week, that low priced housing in cities, such as Cleveland Ohio, are being snagged up by investors. This is what people on Reddit do not understand.... If you cannot afford a home, someone else will. Investors are already purchasing those cheaper homes to turn into rentals.",
                "author": "RealisticForYou"
            },
            {
                "raw_content": "I’d be eating caviar every night with a 1400 house payment",
                "author": "mps2000"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "New Listings Post Sharpest Drop in 2 Years, Tightening Housing Supply",
        "score": 23,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sucks for anyone who bought recently and have been affected by these layoffs or other unfortunate life situations that inevitably happen. Dancing on the graves of investors and flippers that bought recently just to make a quick buck though. And this is coming from someone who just bought last January lol",
                "author": "Responsible_Knee7632"
            },
            {
                "raw_content": "New listings of U.S. homes for sale fell 1.7% year over year during the four weeks ending December 7, the biggest decline in over two years. Would-be home sellers are pulling back partly because it’s the end of the year, typically a slow season for the housing market, and partly because they’re reacting to lackluster homebuying demand. Pending home sales are down 4.1% from a year ago, the biggest decline in 10 months. The homes that are selling are taking a long time to do so: The typical home that goes under contract is doing so in 51 days, roughly a week longer than last year. Prospective homebuyers have been hesitant for many months, spooked by widespread economic uncertainty and high housing costs. The median home-sale price is up 2%, with prices rising despite slow demand partly because of tightening inventory. The weekly average mortgage rate has fallen to its lowest level in over a year, but it’s still well above 6%. “Some would-be sellers are sitting tight because the market is flat,” said Josh Felder, a Redfin Premier agent in San Francisco. “That’s partly because we’re heading into the normal seasonal slowdown, and partly because prospective sellers and house hunters are watching and waiting to see what’s going to happen next year with rates, the stock market, and tariffs. Some homeowners will put their home on the market in 2026 when they have a better idea of how the economy will shape up.”",
                "author": "SnortingElk"
            },
            {
                "raw_content": "[https://www.redfin.com/news/data-center/](https://www.redfin.com/news/data-center/) <- Blue line vs orange line. The reason its a whopping 1.7% drop is because in 2024, the yoy increase was 8.5%, so a net positive of 6.8% over the last 2 years. None story, spring will be telling.",
                "author": "mlody11"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Rental vacancy rate increased to 7.1% in Q3 from 7.0% in Q2.",
        "score": 11,
        "text_content": "",
        "comments": [
            {
                "raw_content": "National vacancy rates in the third quarter 2025 were 7.1 percent for rental housing and 1.2 percent for homeowner housing. The rental vacancy rate was not statistically different from the rate in the third quarter 2024 (6.9 percent) and not statistically different from the rate in the second quarter 2025 (7.0 percent). Rental Vacancy Rates by Region: https://www.census.gov/housing/hvs/files/qtr325/rvr325.jpg In the third quarter 2025, the median asking rent for vacant for rent units was $1,534. The rental vacancy rates in principal cities (7.3 percent), in suburbs (6.9 percent), and outside MSAs (6.6 percent) were not statistically different from each other. The rates in principal cities, in suburbs, and outside MSAs were not statistically different from the third quarter 2024. The rental vacancy rate was highest in the South (9.1 percent), followed by the Midwest (6.4 percent) and West (6.0 percent), and the rate was lowest in the Northeast (5.0 percent). The rates in the Midwest and West were not statistically different from each other. The rental vacancy rate in the South was higher than the third quarter 2024 rate, while the rates in the Northeast, Midwest, and West were not statistically different from the third quarter 2024. December 11, 2025, Press Release: https://www.census.gov/housing/hvs/files/currenthvspress.pdf",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "It’s over",
        "score": 5611,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Technically correct. The best kind of correct.",
                "author": "Mindrust"
            },
            {
                "raw_content": "you should ask gpt-pro-5.2-xhigh-super-reasoning-max",
                "author": "FlamaVadim"
            },
            {
                "raw_content": "Yep. Gahhlic",
                "author": "RAG23"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Reminder that screenshot can very easily be editted",
        "score": 354,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This you? https://preview.redd.it/xa2pphbouo6g1.jpeg?width=1179&format=pjpg&auto=webp&s=efcef386cbec81763d74e2dcb312821b921d8684",
                "author": "LucidOndine"
            },
            {
                "raw_content": "\"As many as there are in moron.\"",
                "author": "AnonThrowaway998877"
            },
            {
                "raw_content": "You get really bad responses with 5.69 you should’ve used 5.67",
                "author": "mazdarx2001"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "GPT-5.2 Thinking evals",
        "score": 1267,
        "text_content": "",
        "comments": [
            {
                "raw_content": "ARC-AGI2 sheesh!!",
                "author": "socoolandawesome"
            },
            {
                "raw_content": "Code red apparently meant \"we better ship fast\" and not \"we're losing.\"",
                "author": "ObiWanCanownme"
            },
            {
                "raw_content": "They just quietly dropped the state of the art on the 2nd note of a twitter thread, what lmao",
                "author": "Gianny0924"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Normies are so behind on AI, man, it’s crazy. I talked to a coworker and she didn’t even know the difference between GPT 5.2-mini-pro-turbo with search and GPT o1-enhanced-4o operator 5.2",
        "score": 325,
        "text_content": "I’m in the Aviation industry",
        "comments": [
            {
                "raw_content": "Lol, what a loser! My favourite model is gpt5.2-high-mini-quantum-potato",
                "author": "ExoTauri"
            },
            {
                "raw_content": "They’re busy getting laid. They don’t know about the upcoming rapture like me and you.",
                "author": "Key-Statistician4522"
            },
            {
                "raw_content": "Is this a shitpost",
                "author": "leveragedtothetits_"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "ARC 3 Coming Q1 2026. Confirmed.",
        "score": 336,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wonder how ARC 4 will look like once we inevitably beat ARC 3 in the next 2 years.",
                "author": "Xerryx"
            },
            {
                "raw_content": "This is exciting, thanks for posting. I'd really like to see a test that doesn't just check depth of knowledge, but how well it can handle all the other tasks associated with that deep domain knowledge. For example, just creating a P&L is helpful, but can it explain the P&L to a small business owner, can it take call / text inquiries, can it fluidly run scenarios, and then complete the associated taxes. This ability to domain switch between the deep knowledge, and all the side knowledge, is what's really going to unlock these models for a lot of businesses.",
                "author": "RobleyTheron"
            },
            {
                "raw_content": "Oh wow here we go. I wonder how world models will tie into all this as well.",
                "author": "MC897"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Like it or not, believe it or not, things are still moving very fast.",
        "score": 624,
        "text_content": "",
        "comments": [
            {
                "raw_content": "keep it shmovin. I want AGI out here YESTERDAY. The sooner we invent the necessary technology, the sooner we'll be able to start working on the pinnacle of gaming!!!!!!!!!!!!!!!!!!!!!",
                "author": "Certificus"
            },
            {
                "raw_content": "And regular 5.2-xhigh nearly there at less than $1 :)",
                "author": "Dear-Ad-9194"
            },
            {
                "raw_content": "https://preview.redd.it/w02pyscnhm6g1.png?width=1368&format=png&auto=webp&s=1c08f363760d0f0925bc8fab2d4e376dda495a71 GPT-5.2 smokes Gemini on ARC-AGI-2 as well. Insane!",
                "author": "ethotopia"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Is anyone else noticing that GPT-5.2 is a lot worse lately?",
        "score": 544,
        "text_content": "It was good when it first came out, but it's become a lot worse recently.",
        "comments": [
            {
                "raw_content": "It was good from 8:30am to when I finished my coffee then it went to shit. I miss the good old days of 9am",
                "author": "SafeUnderstanding403"
            },
            {
                "raw_content": "agi is cancelled i'm afraid",
                "author": "w_Ad7631"
            },
            {
                "raw_content": "Its performance when porting the Linux kernel to Malbolge is highly dissatisfactory.",
                "author": "Practical-Hand203"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "More to come from OpenAI next week",
        "score": 381,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm guessing gpt image 2",
                "author": "Hereitisguys9888"
            },
            {
                "raw_content": "image gen model? 🙏🏻",
                "author": "Popular_Lab5573"
            },
            {
                "raw_content": "GPT5.3",
                "author": "Chr1sUK"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Disney making $1 billion investment in OpenAI, will allow characters on Sora AI video generator",
        "score": 850,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is big, more for the implications than the news itself. It means they want to use it professionally. Will be interesting to see where this road goes.",
                "author": "KalElReturns89"
            },
            {
                "raw_content": "Damn, so including Star Wars..?",
                "author": "Humble_Rat_101"
            },
            {
                "raw_content": "and there it is.. Disney sends cease and desist letter to google: [https://www.reuters.com/business/disney-sends-cease-and-desist-letter-google-cnbc-reports-2025-12-11/](https://www.reuters.com/business/disney-sends-cease-and-desist-letter-google-cnbc-reports-2025-12-11/) This is so hilarious",
                "author": "dkakkar"
            }
        ],
        "subreddit": "singularity"
    }
]