[
    {
        "post_name": "Homeland Security : Arrested for throwing ice blocks at law enforcement in Minneapolis. Federal crime. Felony. You will be arrested.",
        "score": 756,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Look - Im not going to lie...I dont care if they shoot people who throw shit at them. The agents have no idea what it could be - it could be acid for all they know.",
                "author": "RedditStillSucks"
            },
            {
                "raw_content": "Looks like r/politics is going to need a new mod.",
                "author": "dunkeaters"
            },
            {
                "raw_content": "Wearing a NASA hoodie. A regular rocket surgeon that one.",
                "author": "SWRAD"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Rioters are now DESTROYING the hotel they believe ICE agents are staying at in Minnesota. No evidence suggest there are ACTUALLY agents staying there. Local PD ONCE AGAIN allowing it to happen. You’re a DISGRACE, @Tim_Walz",
        "score": 750,
        "text_content": "",
        "comments": [
            {
                "raw_content": "YES! MORE OF THIS! BURN IT ALL DOWN YOU DUMB FUCKS!",
                "author": "ciaramella_is_gay"
            },
            {
                "raw_content": "If the hotel didn't have anything to hide, it would just allow the mob to search room by room. It gets what it deserves. /s",
                "author": "SWRAD"
            },
            {
                "raw_content": "The right really needs to tone it down",
                "author": "nodeadcats"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This is Democrat Texas Rep James Talarico “Our southern border should be like our front porch. There should be a giant welcome mat out front” Democrats want open borders. If they ever take power again America is over. They’ll import so many illegals we’ll never recover",
        "score": 635,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is what happens when someone who was born after 9/11 gains power. We said we'd never forget. This faggot never even knew what our country was like before. It's like he wants another massive terrorist attack to happen",
                "author": "magapatriot_pa"
            },
            {
                "raw_content": "We may never recover from the illegals they already imported...",
                "author": "airborne3502"
            },
            {
                "raw_content": "They don't care if it's illegal or not. THEY WANT TO REPLACE YOU.",
                "author": "PapaPepe"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "How to steal a country:",
        "score": 681,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Except next time, we won't be able to vote them out because the number of illegals voting will be far too great",
                "author": "magapatriot_pa"
            },
            {
                "raw_content": "The Democrats are Marxists working for foreign interests like Mexico. Stop being a coward Trump. Declare Martial Law, and arrest our enemies. Both domestic, and foreign.",
                "author": "Roadcruiser2"
            },
            {
                "raw_content": "1.5 Vote for guy who promised retribution and deportations. Nominates blonde who runs out the clock while he fiddles",
                "author": "MotherCoconuts"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "“REPORTER”: “Is there a number of deportations until you leave Minnesota?” BOVINO: “There is a number... it's called: ALL OF THEM!”",
        "score": 1331,
        "text_content": "",
        "comments": [
            {
                "raw_content": "including the ones without a criminal record, right?",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "THIS is what I voted for. Deport the illegals. fuck it, deport the dirty commies obstructing the deportation. They vwant to be with them soooooo badly. Send them to the shit holes too.",
                "author": "Cop-Morty"
            },
            {
                "raw_content": "The ALL have to go back.",
                "author": "Undying"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Clawdbot is incredible. I just made Brice, an agent that scans irl live streams in Minneapolis then immediately calls ICE agents to the exact coordinates it hears a foreign language being spoken",
        "score": 993,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Based as fuck.",
                "author": "EDDIT_IS_CUCKED"
            },
            {
                "raw_content": "Please add a link to the stream so the officers can evaluate if it's worth it. And don't put lat/lon, put links to Google Maps or something.",
                "author": "VoteThing"
            },
            {
                "raw_content": "This shit is fucking hilarious if it works.",
                "author": "Final212"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The ICE raid interference protests are part of a tactic the left is deploying called Dilemma Demonstrations. They’re designed to put the President and ICE into a dilemma.",
        "score": 1179,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Are the Republicans who criticized ICE and Trump part of this? There seemed to be a coordinated effort from the same old RINOs. Why are they canonizing this guy and not the woman in the van?",
                "author": "Populistdeplorable"
            },
            {
                "raw_content": "Why can't we just kill the people behind all of this commie bullshit time after time, year after year, trying to destroy and tear the country apart? We know exactly who the players all are.",
                "author": "South_Florida_Guy"
            },
            {
                "raw_content": "There's no dilemma. They have to go back. No means NO. Their extended all expense paid for vacation to America is over. It's not hard to understand. They are here illegally. The left could help them to go home by setting up a pen pail with them, sending them money, teaching them new skills, like a home away from home foster a family across the world. These lefties need help being more productive then just blowing whistles and screaming. Maybe we need a TV special on deportation education and make the Senators give the course nationally. They are so misinformed from their own Party of lies.",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Court filings just revealed that the anti-ICE agitators who stormed that Minnesota church BLOCKED THE STAIRS so parents couldn't get to their children... ...and even YELLED at the kids' faces, \"Do you know your parents are NAZIS?!\"",
        "score": 1442,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I saw this scene in The Patriot. Just before they locked the doors and burned the church down with the parishioners inside.",
                "author": "Grindelwald"
            },
            {
                "raw_content": "That's false imprisonment. Of minors. If the evidence is accurate and Bondi does her job, they are possibly screwed. Additionally, can likely prove conspiracy because of the Signal chats and coordination. https://www.law.cornell.edu/wex/false_imprisonment",
                "author": "TLDC"
            },
            {
                "raw_content": "Fuck it, hang the scum. I'm done with these evil demons.",
                "author": "TheGamerToTheRight"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "You mean The Psyop State™?",
        "score": 805,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Minnesota is the Dems’ power center",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "We need to know how Minnesota is paying back all the money the Somali outlaws stole. The State needs to answer for that and stop distracting. President Trump should ask Walz and the State how they plan on paying it back and they need to answer for it. Stop putting money into paying for protesters and riot gear when you owe 100 billion bucks.",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "Democrats Are Your Criminals And Really Evil",
                "author": "knnbccb"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "They’re running scared.",
        "score": 1017,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Remember what was done to Canadian truckers? Or the J6 people. Trump needs to do THAT to these leftist fuckers.",
                "author": "IAmDisappoint"
            },
            {
                "raw_content": "One might even say the walls are closing in. They'd be wrong but one might say it.",
                "author": "ragnarokrobo"
            },
            {
                "raw_content": "Not quite but close",
                "author": "Trooph-Hurts"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Another insurrection call by Bill Clintons X account. Plus they turned off replies. We know Bill does not know how to do that.",
        "score": 742,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Didn't his administration have that famous picture of the guy with an mp5 and a cuban kid?",
                "author": "Couchbeer69"
            },
            {
                "raw_content": "Bill Clinton has no skin in this game, its all a distraction from his child raping on the Island. HELL AWAITS YOU CLINTONS. BURN.",
                "author": "MemphisMontoya71"
            },
            {
                "raw_content": "What freedoms are they losing? It's always been illegal to point firearms at federal agents and try to run them over with your car. It's also always been illegal to enter the country illegally. That's the exact reason why \"undocumented\" \"immigrants\" are called illegal aliens or simply illegals",
                "author": "magapatriot_pa"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "O rly?",
        "score": 1019,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yes lol there's no secure communications anywhere on earth.",
                "author": "Wexit-Delecto"
            },
            {
                "raw_content": "\"Flan\" is Lt. Gov. Flanagan",
                "author": "rootGoose"
            },
            {
                "raw_content": "PROTIP: The right has hackers too and we are better than the left's",
                "author": "DingleBalls"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Staying home saves lives",
        "score": 1255,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Dumb fucker died for inbred fuckstain scammers who never even knew he existed Leftists will never cease to amaze me.",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "I think people have an inherent desire, deep within to be a part of something bigger than themselves. I’m imaging that these Minnesotans have become Godless and are, therefore, filling that void with being part of this ICE out insurrection. If people had God in their lives and were part of a church community, I really don’t think they’d be so sucked into what they’re doing. I find myself deeply disturbed by what I’m seeing.",
                "author": "TNgirl4Trump"
            },
            {
                "raw_content": "remember when the experts said it was illegal and unsafe to have social gatherings, but it was perfectly safe to attend BLM protest riots? Pepe farms members.",
                "author": "leakmouth"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨BREAKING: The Lt. Governor of Minnesota, Peggy Flanagan, is one of the administrators of the Signal chat for the Minnesota violent protests. This means the Governor's office is in charge of the insurrection against the federal government. This is so ILLEGAL. LOCK HER UP.",
        "score": 1342,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Start hanging them on the white house lawn for treason at this point send a real message.",
                "author": "EvilGreed209"
            },
            {
                "raw_content": "Peggy Flanagan is the top contender for the US Senate race and her husband works for MPR (NPR affiliate) which is funded by the Lumina Foundation which is partnered with the Gates Foundation. She married him after divorcing her ex-husband ahead of her run for Lt Gov. And she is a totally deranged commie dingbat. This is an open/close slam dunk RICO case, if Bondi wasn't worse than useless.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "When are we going to stop playing around with these subversive commie faggots?",
                "author": "South_Florida_Guy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump: I am hereby calling upon TimPon Walz, Mayor Frey to formally cooperate with the Trump Administration to enforce our Nation's Laws",
        "score": 1218,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This seems like a required step in enacting the Insurrection Act or taking other federal action. It just reads like a legal team wrote it.",
                "author": "Nellie_the_Beaut"
            },
            {
                "raw_content": "The fact that this has to be said by a President to any political leader is pure madness.",
                "author": "L74ge9wr"
            },
            {
                "raw_content": "Laying groundwork for insurrection act But if Bondi did her fucking job none of this would be necessary… insurrection act is a red herring",
                "author": "HunterBidensPC"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: Arizona Democrat AG Kris Mayes' top police liaison RESIGNS after she appeared to justify shooting ICE agents He resigned just days after she said this on whether you can shoot: \"Well...if you're being attacked by [someone] wearing a mask!\"",
        "score": 866,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Mayes should RESIGN immediately—along with all the other radical Dems who hate ICE, secure borders, and America First priorities. No more officials encouraging violence against federal agents while letting illegals run free! This is why we back President Trump and ICE 100%—enforce the law, protect our communities, and stop the sabotage. Senate RINOs: Nuke the Filibuster to pass strong DHS/ICE funding and border bills—no more Dem games! https://x.com/EricLDaugh/status/2015571009873580044?s=20",
                "author": "Capoditutticapi1"
            },
            {
                "raw_content": "She escalated the situation and put the brave men and women who are ICE agents in danger. They wear ICE, or Border Patrol on their vests with badges. She should issue a public statement warning to obey ICE agents, and then resign or be terminated.",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "They hate masks all of a sudden, weird!",
                "author": "lifeisahologram"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Minnesota is a Criminal COVER UP of the massive Financial Fraud that has gone on!",
        "score": 1633,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Please Mr. President supporters of MN that you won three times want you to invoke the insurrection act ASAP.",
                "author": "RealityIsAPsyOp"
            },
            {
                "raw_content": "Yes we know. Maybe give Pam a call and demand she do the job she was hired to do?",
                "author": "Prebellico"
            },
            {
                "raw_content": "Do something.",
                "author": "Ghostphaez"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "VP JD VANCE: \"The solution is staring everyone in the face.\" 🔥Insurrection Act incoming?🔥",
        "score": 1326,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How many more people have to die before the solution is enacted? Does it have to be an ICE agent instead of some scumbag?",
                "author": "PapaPepe"
            },
            {
                "raw_content": "If President Trump is going to invoke the Insurrection Act, they need to stop talking about it, or hinting about it, and just do it. The time for Playing games with these Peaceful Terrorists is over. I honestly don't want it to happen, but we may be past that at this point. One of these ICE Agents are going to get killed, and then what? It needs to be stopped now before that happens.",
                "author": "Landslide_2020"
            },
            {
                "raw_content": "Just do it. Get it over with But when the FEDs go in, they need to go after State officials before they go after the protesters.",
                "author": "CJ74U2NV"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Gov. Walz: \"We grew up reading the story of Anne Frank. Somebody is gonna write one regarding Minnesota.\" Comparing billions in Muslim fraud, that you enabled, to a little girl murdered by Nazis in a death camp is beyond sick! You can't sink any lower.",
        "score": 904,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ann Frank is fake",
                "author": "cbonez416"
            },
            {
                "raw_content": "I think Anne Frank would have LOVED if the Germans just deported her to someplace they weren't in control of, dude.",
                "author": "VanDeKoik"
            },
            {
                "raw_content": "It will be interesting to see how long politicians can use the Holocaust as an emotional cudgel. It's been 80 years, the postwar order won't last forever.",
                "author": "OrthodoxTemplar"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "WATCH: New York Gov. Kathy Hochul Calls for Noem to Be Fired, Vows to Hold Trump Admin Officials ‘Accountable’ Once They Leave Office",
        "score": 763,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Literally saying they are going to use lawfare against Trump and ICE and Board Patrol officers. But you're all just going to try and vote the country out of this...",
                "author": "ImprerialWalker"
            },
            {
                "raw_content": "Believe them when they tell you what they intend to do. We can either deal with them now, or they will deal with us later.",
                "author": "Slugbert"
            },
            {
                "raw_content": "What a despicable, awful human being.",
                "author": "Haiti_kid"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "AMD to use RDNA5 for premium iGPU solutions, but RDNA3.5 to remain the core of AMD portfolio until 2029",
        "score": 510,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A bit early for April Fool’s…",
                "author": "ThePresident44"
            },
            {
                "raw_content": "So no non-\"premium\" laptops with AMD APUs or handhelds with AMD APUs will support FSR 4 until 2029? That seems quite pointless. If there's any laptops that would need upscaling the most, it'd be the lower-end ones with *less* iGPU performance. The ones doing 60 are fine as is. Does Intel support all of their new Panther Lake mobile CPUs/iGPUs with XeSS 2? Edit: Meant XeSS 3. Thought I was forgetting something.",
                "author": "DiatomicCanadian"
            },
            {
                "raw_content": "Rdna3.5 until 2029… big wow there. This is why intel saying amd uses ancient gpu tech in the mobile space is true. You would figure they would want to innovate and include their newest architecture as it’s ready but nope, theyd rather give you lowly 3.5. Meanwhile, nvidia is gearing up their own arm chip for laptops, intel has panther lake and amd has… 3.5 or maybe even… 3.6!!! Boooooo",
                "author": "EnigmaSpore"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "DAWN supercomputer to get sixfold processing increase with AMD MI355X chips",
        "score": 19,
        "text_content": "The UK commits $49M to upgrade the University of Cambridge DAWN supercomputer with AMD MI355X chips and Dell hardware for advanced AI research.",
        "comments": [
            {
                "raw_content": "What reddit ain't understanding about national or sovereign computing is that they don't always put perf or market leadership as the #1 selection criterion. Derisking through supply diversification, open software stack and hardware standards for future upgrades, access and maintenance are also key factors. This is why nobody will go 100% nvidia because millions in investment would become worthless if they decide to cut you off or force vendor locked rack designs. This is also a traditional hpc system The other guy's claim that this deal was made by sacrificing client designs is also bs. This system is barely a thousand units of mi355x and it's getting delivered soon, it ain't competing with any client wafer supplies. Amd's zen6 mobile designs and rdna5 gpus also ain't ready for at least another year (rdna5 just taped out) The idea that mi355x sales is achieved through sacrificing all client designs is kinda dishonest and rage baiting.",
                "author": "SirActionhaHAA"
            },
            {
                "raw_content": "AMD’s stride in the data centre has been impressive, such a shame it has to sacrifice the entire Client segment outside of one DIY desktop cpu to achieve it.",
                "author": "996forever"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Asianometry] Why Diamond Transistors Are So Hard",
        "score": 16,
        "text_content": "",
        "comments": [
            {
                "raw_content": "[Quick Summary] Pros of diamond as a semiconductor vs. silicon: - 5x the bandgap - up to 33x breakdown field - higher carrier mobility (3x for electrons, 9x for holes) - 15x thermal conductivity - radiation hardened - well suited for punishing environments and extreme heat densities So far, no existing tech to grow pure crystals at any commercially viable scale and/or size. Latter half of the video is about all the attempts to create them.",
                "author": "JuanElMinero"
            },
            {
                "raw_content": "Because diamond is hard.",
                "author": "empty_branch437"
            },
            {
                "raw_content": "Diamonds are super hard, I'm nearly as hard but diamonds are harder",
                "author": "Loose_Skill6641"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Sapphire RX 9070 XT NITRO+ adds two more burned blue-tipped 12V-2×6 adapter reports, and issues with RMA",
        "score": 115,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I like and have used Sapphire along with PowerColor for most of my cards. I have a 9070XT Nitro+ and I really wish I had not purchased it. Not because it does not work great, but because of its power connector, I always have to be concerned. Planning on selling it and getting one with out this adapter. There is no reason that I should have to worry about something that is really not needed.",
                "author": "0riginal-Syn"
            },
            {
                "raw_content": "Technology journalism except it comes from Reddit posts. Crazy how we are still giving this link clicks when the original posts on reddit aren't even half a month old. Anyway, fellas - the connector sucks yes. Is it here to stay until the next iteration? Yes. Might as well save yourself alot of hassle and just upgrade your psu to one that comes with a native 12v high power cable. Ditch the adapter.",
                "author": "Ryz3nGaming"
            },
            {
                "raw_content": "There has been this many cases yet people still haven't learned to stay away from that adapter? Even worse when in one of them the owner already has a native ATX3.1 PSU and cable yet he still chose the adapter.",
                "author": "jerryfrz"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Snapdragon 8 Elite Gen 6 Pro could hit 5GHz, possibly even 6GHz",
        "score": 5,
        "text_content": "",
        "comments": [
            {
                "raw_content": "For a single clock cycle maybe",
                "author": "Kinexity"
            },
            {
                "raw_content": "Naming is confusing already and now they adding \"Pro\" moniker?",
                "author": "Wrong_Disk_8608"
            },
            {
                "raw_content": "All that to play some of the shittiest games you’ve ever seen.",
                "author": "SecretTraining4082"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel \"Nova Lake\" Xe3P iGPUs Could be 25% More Powerful Than Xe3 Models",
        "score": 144,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\\+25% is great for a followup one year after PTL. If PTL 12Xe is on par with RTX 4050, 25% on top of that nets the NVL 12Xe on par with RTX 5050.",
                "author": "Forsaken_Arm5698"
            },
            {
                "raw_content": "Glad intel is offering iGPU competition while AMD is stuck on RDNA 3.5",
                "author": "WarEagleGo"
            },
            {
                "raw_content": "Could be interesting market with nvidia N1 and N1X, and even N2 an N2X, along side Nova Lake. AMD getting left behind releasing recycled products year after year.",
                "author": "airtraq"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "What happens to old computer hardware as it ages? Does it ever become truly useless?",
        "score": 35,
        "text_content": "I’ve been thinking about old computer hardware as a whole, not just consumer PC parts. As technology keeps advancing, what actually happens to older hardware over time? Does it ever become truly useless, or does it always retain some kind of value for learning, basic tasks, niche systems, research, or recycling? At what point does hardware stop being useful to humans in any meaningful way? Curious how people think about aging technology in general and what usually becomes of it.",
        "comments": [
            {
                "raw_content": "At some point, assuming performance per dollar and watt keep increasing, anything sufficiently old will cost more to operate for a year than to replace. That's not useless, strictly speaking, but it's probably not worth using.",
                "author": "account312"
            },
            {
                "raw_content": "I mean, it depends. I have a few old Pentium 4 laptops, they run Windows XP. Can I do any meaninful work on them? Not really, but they are very useful if I want to play some old school game in real hardware. A lot of people collect old hardware for those reasons, they want to experience old software as intended instead of emulation, but as a working machine doing real work, they are pretty much useless. You can see it pretty clearly on server hardware, you can buy old Xeon CPU for very cheap (Not even that old, some of those CPU uses DDR4 RAM), but they are not worth if you want, for example, have a home server because they are pretty power hungry, you can get the same (or better performance) with some consume grade CPU at a fraction of power consumption",
                "author": "FlakyBicycle9381"
            },
            {
                "raw_content": "This is very subjective For example you could cluster up a couple 4th gen i3 PCs as some sort of home server. A modern i5 would probably match, if not beat the cluster though. In my opinion it's practicality and convenience, if it's inconvenient and impractical for me then its useless to me Someone else though could really want a retro gaming rig and one of those i3 PCs could be just what they want Wether it truly becomes useless, probably not. There will always be a use for tye majority of components, as i said its more so about wether you should You could for example control some lights with a core 2 duo computer, or use it as a calculator. That's some uses it can have. Majority of people would prefer to buy smart lights and control from their phone if they do that though, and they'd prefer to use an actual dedicated calculator over an ancient computer",
                "author": "ishtuwihtc"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "An experiment with a pulsating heat pipe based air cooler in a simulated CPU workload.",
        "score": 6,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The most interesting factor is that there seems to be sour spots at certain areas of the fan curve, but that may be a product of an immature design in some ways, so I can't draw conclusions yet. edit:Probably resolvable by just making any fan(s) shipped with one of these have a speed floor in the PWM electronics above any sour spots at the very least if nothing else...",
                "author": "Jeep-Eep"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Final Fantasy 7 Remake for Switch 2 selling well!",
        "score": 1302,
        "text_content": "Congratulations on a 3rd party game doing so well on Switch 2. An older 3rd party game at that making it even more impressive. Will be curious to see how RE9 does.",
        "comments": [
            {
                "raw_content": "Now do real Kingdom Heart ports and watch the same thing happen, Square pls.",
                "author": "dekgear"
            },
            {
                "raw_content": "Crystal clean port and they didn’t take the piss with the pricing. Other devs need to take note, if you don’t rip us off, then we buy your games tenfold.",
                "author": "Masam10"
            },
            {
                "raw_content": "I’m glad this is a fantastic port at a good price point",
                "author": "lingering-will-6"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "These are the third-party games I want to see the most on the Nintendo Switch 2.",
        "score": 278,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Don't hold out hope for BG3. Hasbro owns the IP and their contract with Larian has ended. Larian can not publish on any other platforms without having permission and as Hasbro are dicks I don't see them giving them permission.",
                "author": "StormtrooperMJS"
            },
            {
                "raw_content": "So far, one of those (Fallout 4) is coming this year! I'd love to see Clair Obscur and Digimon at some point this year too.",
                "author": "Quake006"
            },
            {
                "raw_content": "Fallout 4 has already been confirmed to be coming to switch 2 later this year.",
                "author": "Avelion2"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Do you think Nintendo will have any major \"system sellers\" this year, aside from Pokemon Gen 10?",
        "score": 91,
        "text_content": "As of now, Nintendo already have about 8 different games scheduled to release at some point in 2026. I am looking forward to some of these games (especially Fire Emblem: Fortune's Weabe) but the problem is that I don't think any of them look like major \"system sellers\". I think Tomodachi Life would actually have the most potential as a system seller, but that is a Switch 1 game and doesn't even have a Switch 2 Edition. So, I don't think millions of people will be buying a Switch 2 for that game. Splatoon Raiders may be a system seller in Japan (despite being a spin-off) but probably won't be a big hit in the rest of the world. Of course, there is one major first-party game that is basically guaranteed to come out this holiday: Pokemon Gen 10. However, will that be the ONLY big game Nintendo have for the second half of this year? Do you think this year will have more BIG titles, or will Nintendo only have smaller games aside from Pokemon?",
        "comments": [
            {
                "raw_content": "There is almost certainly 1 or 2 major titles that have not been revealed yet. It's quite common for Nintendo to announce even blockbusters within 6 months to a year of release.",
                "author": "Triforce742"
            },
            {
                "raw_content": "They just need 2-4 AAA games and fill the rest of the yr w their B line up. - unannounced game (Aug) - Duskblood (Sept) - unannounced game (Oct) - Pokémon (Nov) 2026 announced - Mario Tennis (Feb) - Pokémon Pokopia, Mario Wonder DLC (Mar) - Tomodachi, Yoshi Book (spring)",
                "author": "brandont04"
            },
            {
                "raw_content": "If Pokopia taps into the Animal Crossing audience, that could be a surprise system seller this spring",
                "author": "Dreams180"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Pokémon Legends Z-A NSO icons are now available!",
        "score": 119,
        "text_content": "",
        "comments": [
            {
                "raw_content": "FINALLLYYYY GOD DAMNNNNN",
                "author": "Busy_Medium4418"
            },
            {
                "raw_content": "It’s about time!",
                "author": "Excaliburn3d"
            },
            {
                "raw_content": "Finally bruh why did this take so long??",
                "author": "VampireInTheDorms"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The most amazing thing about FFVII Remake is simply that it's actually good",
        "score": 28,
        "text_content": "Easy to forget this was in no way the guaranteed outcome. SquareEnix took one of *the* most legendary games of all time and made the decision not just to remake it, but to remake it and in the process massively change it - visually, mechanically, story-wise - and spread out what was one game into three separate and massively expanded releases. And - amazingly - it actually worked and (for the most part) people are really happy with the result. I feel like it's hard to overstate how unlikely this outcome was. I mean, imagine if they announced this project today rather than 10 years ago - how much faith would any of us have that a AAA company would handle such a project successfully? But respect where it's due, they took on a challenge hugely filled with risk and the possibility of tarnishing a legend, and they absolutely triumphed - to the extent that if the final part manages to keep the quality up (or even escalate it), they may have created one of the all-time great trilogies in gaming in its own right.",
        "comments": [
            {
                "raw_content": "I loved how they actually fleshed out Jessie, Biggs and Wedge. Made the events of the games much more emotional for me.",
                "author": "lefix"
            },
            {
                "raw_content": "It wasn't simple this is something they've been dangling in front of fans for twenty years. With the PS3 reveal they actually showed off a ffvii tech demo to showcase the then new PS3 and it's capability that took fans on a huge sprawling tease filled with false starts cancelled games and more It's a crazy story",
                "author": "profchaos111"
            },
            {
                "raw_content": "I love how they made the entire world come alive. You literally bump into people in crowded areas. You overhear their conversations. You get to see more of the side characters. You feel how shitty life is in the slums. They went hard remaking the game into something great. I don't mind them not telling the entire story of ff7. They made an awesome game, respecting the original and expanding on it. Made me want to see the rest of the world. Then rebirth did exactly that and I'm nowhere close to done after 60 hours. They just made everything grander.",
                "author": "AdditionInteresting2"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Final Fantasy VI Remake on Switch 2",
        "score": 92,
        "text_content": "Wow!!! I'm so amazed at how well this game runs on Switch 2! Yes, it's at 30 frames per second and not 60, but the drop off in quality compared to PlayStation is not that noticeable. There really is no excuse anymore for every single high quality third party game not to be coming to the Switch 2. If Cyberpunk 2077 and Final Fantasy VI Remake can both come on the console and give you very solid gameplay, almost any game can and should.",
        "comments": [
            {
                "raw_content": "I know it was a typo, but a modern FFVI remake would be so amazing",
                "author": "darksnes"
            },
            {
                "raw_content": "Can you send me your copy of FFVI remake when you finish please",
                "author": "Suspicious-Screen-43"
            },
            {
                "raw_content": "damn. you're living in the future.",
                "author": "Critic97"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Has moving from Switch 1 to Switch 2 affected your gaming habits at all?",
        "score": 148,
        "text_content": "I very much thought Switch 2 was going to just feel like a continuation of Switch 1 but with better visuals and performance, but actually my gaming habits have changed pretty significantly since getting the system. I'm playing far fewer games but playing each game for significantly longer. On Switch 1, I was playing a lot of arcade games, shmups, indies - as well as, of course, first party games - and I'd sometimes go through long periods of playing a new game almost every week. On Switch 2, however, I'm playing closer to a single game a month, but despite that reduction, the amount of time I'm playing the system has nearly doubled. Don't know if it's just coincidence or because the Switch 2 is offering better access to longer, meatier games (probably a bit of both), but it's been a nice change. I feel like each game I've played so far (with the exception of Hyrule Warriors) has been extremely memorable. I've also been taking more time within the games to just explore and look at stuff for no reason, as well as engaging with post-game content, whereas on Switch 1 I'd tend to move on immediately after hitting the credits. Anyone else found the Switch 2 has changed their habits at all?",
        "comments": [
            {
                "raw_content": "I'm playing much more and have pretty much made the switch 2 my exclusive console.",
                "author": "CartoonistStrange656"
            },
            {
                "raw_content": "I read your entire post. Nice. Have my routines changed? Nah. Still adding onto the backlog and only playing New Horizons.",
                "author": "LawfulnessPractical"
            },
            {
                "raw_content": "As a Playstation gamer I bought the Switch OLED for the Nintendo exclusives. Although I really love the Mario games (Odyssey and Wonder are my favourites) and Zelda ToTK, my Switch was collecting dust. Now with the Switch 2 I experience that I am far more playing on my Switch 2. The games I played on my Switch OLED are more fun to play on the Switch 2. I think due to the better performance (30 vs 60fps but also overall system performance is better) I just play more on my Switch 2. At the moment I love playing Dave The Diver.",
                "author": "rmgbenschop"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Starfield 2.0",
        "score": 172,
        "text_content": "I was watching Defining Duke and Matty the host casually mentions he saw Starfield 2.0 behind closed doors a few months ago. I know this has been a rumor for a while but I have seen nothing concrete yet. This is the first confirmation I have seen that it is real. Link with time stamp: [ https://youtu.be/cXqlxb0a6xk?t=8136 ](https://youtu.be/cXqlxb0a6xk?t=8136)",
        "comments": [
            {
                "raw_content": "[https://youtu.be/cXqlxb0a6xk?t=8136](https://youtu.be/cXqlxb0a6xk?t=8136) for a quicker link",
                "author": "PrikroyMan"
            },
            {
                "raw_content": "What exactly is Starfield 2.0? Never heard of this. Did they actually design some nice worlds to explore and fix the game up?",
                "author": "empathetical"
            },
            {
                "raw_content": "Guessing it’s to coincide with the PS5 release then if true? Makes sense considering the lukewarm response on initial release, but I’m curious to know what the differences would be.",
                "author": "South_Buy_3175"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "According to KiwiTalkz, Red Dead Redemption 2 next-gen is happening, believes the GTA 6 development timeline may have changed the release dates for other projects",
        "score": 822,
        "text_content": "https://xcancel.com/kiwitalkz/status/2015523023701659724?s=46",
        "comments": [
            {
                "raw_content": "Can they hurry up",
                "author": "sirferrell"
            },
            {
                "raw_content": "Every year \"it's happening\", but now it's 2 years when i first heard about it. Maybe 2026 is the one hopium.",
                "author": "Zygmuntek"
            },
            {
                "raw_content": "Next consoles will be out by the time they release it",
                "author": "Blayzeman"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Billbil-Kun: Undisputed is the main game for PS Plus Essential February 2026",
        "score": 190,
        "text_content": "https://www.dealabs.com/magazine/ps-plus-essential-voici-le-titre-phare-de-la-selection-de-fevrier-2026-60911",
        "comments": [
            {
                "raw_content": "4.8 on Metacritic and mixed reviews on Steam, this one is rough Maybe if you like boxing I suppose 🤷‍♂️",
                "author": "adamjamal2AD"
            },
            {
                "raw_content": "![gif](giphy|OQUQhxpxImEm2vBMOc)",
                "author": "SnoopyTheDog_"
            },
            {
                "raw_content": "I really hope the other two games are at least decent",
                "author": "LadyValtiel"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Machenike Core Ultra 200 Mini PC features flip-up display quad-fan cooling",
        "score": 5,
        "text_content": "",
        "comments": [],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD to use RDNA5 for premium iGPU solutions, but RDNA3.5 to remain the core of AMD portfolio until 2029",
        "score": 476,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "if thats the case i still dont get why they are so stubborn in not releasing fsr4 for rdna 3/3.5 even if the performance isn't as good as fsr3",
                "author": "adamosmaki"
            },
            {
                "raw_content": "Watch them move RDNA3.5 into maintenance mode while still releasing brand new products that use it",
                "author": "Reonu_"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Sapphire RX 9070 XT NITRO+ adds two more burned blue-tipped 12V-2×6 adapter reports, and issues with RMA",
        "score": 104,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Worst...Plug...Ever...",
                "author": "Swineservant"
            },
            {
                "raw_content": "Ill say this again, since ive already said it in the other sub: They claim to be technology journalism except it comes from Reddit posts. Crazy how we are still giving this link clicks when the original posts on reddit aren't even half a month old. Anyway, fellas - the connector sucks yes. Is it here to stay until the next iteration? Yes. Might as well save yourself alot of hassle and just upgrade your psu to one that comes with a native 12v high power cable. Ditch the adapter. The adapter is litteraly dog water. Notice how almost all the posts about the burned 12v connectors are about the adapters.",
                "author": "Ryz3nGaming"
            },
            {
                "raw_content": "I have one of these and they were trying to be cute with the design. I appreciate the handiwork but man it’s a pain in the ass to route the cables directly over USB3 and SATA connectors. It’s no wonder the 12vHPWR connector gets strained",
                "author": "mycheese"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Lenovo Legion gaming laptop with AMD Strix Halo shows up alongside NVIDIA N1X update",
        "score": 24,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How this wasn't an initial release lineup alongside Asus is beyond me. Legion 5-7 are one of the best gaming laptops out there. Such a solid and well rounded model. Too low production volume for Lenovo?..",
                "author": "Star_king12"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "MSI MPG X870E Edge Ti Wifi Review: Silver-white aesthetic meets budget X870E",
        "score": 20,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Cant say aesthetic, budget and x870e in the same sentence without a negative in between",
                "author": "Chitrr"
            },
            {
                "raw_content": "Not clicking the link cause toms and pcgamer and all those rags are pay to play trash. But I bought this board a couple months back and it really is awesome. 3 full m.2 slots without lane sharing and a 4th with USB4 lane sharing (where I use a 2 lane drive and get 2 lanes to USB4), a full x4 pcie slot, smart layout good functionality. I really like the value of this one. https://i.redd.it/gyal0iwboifg1.gif",
                "author": "jhenryscott"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "The math of \"no renters\" vs. \"record high prices.\" Something has to give.",
        "score": 69,
        "text_content": "I’ve been trying to map out the logical path for home prices in markets like Las Vegas and Miami, especially with the mass deportations happening lately. Thinking it through: the rental market should be the first to feel the hit from population loss. If you lose a significant chunk of the \"renter\" demographic, vacancy rates go up and rents have to come down. The real question is the ripple effect on home prices. If the \"mom and pop\" investors or the big funds can’t find renters—or if the rent no longer covers the mortgage/HOA/taxes—those properties become liabilities instead of assets. Logically, the next step is those investors \"throwing in the towel\" and listing those homes for sale, which would finally fix our inventory problem and pull prices down. I’m seeing a lot of news about people leaving these cities, but I’m not seeing the \"For Sale\" signs or the price cuts hitting the residential market yet. Sellers in Henderson are still holding out for 2022 prices. Is this just a massive lag time? How long does it usually take for a rental glut to actually force a sell-off in the housing market? And for those of you in Miami or Vegas, what’s the first real signal I should be looking for—is it just rising apartment vacancies, or is there something else that breaks first?",
        "comments": [
            {
                "raw_content": "There are a lot of housing \"buffers\" that you're not seeing at first glance. For example, as the cost of housing rose and rose, the lower income population started looking at shared housing, especially immigrants. If housing and rental prices ease up or lower, these folks who sacrificed comfort for affordability will be there to eat up supply.",
                "author": "HanniballRun"
            },
            {
                "raw_content": "First of all, there are no “mass deportations” happening. Secondly, show me evidence of population decline in Las Vegas. I live in Henderson and all I see around is growth. The metro area grew by 1.6% or 47,000 between 2024 and 2025 and I don’t see that changing. Miami grew by 0.8% or 55,000 in the same period. Your anecdotal observations of deportations and “news about people leaving” just isn’t factual.",
                "author": "Wounded_Hand"
            },
            {
                "raw_content": "The housing market reacts very slowly. After the GFC in 2008 prices didn't hit bottom till 2012. The market started turning around early 2024. I don't expect pricing to fully reflect reality till 2028. Tons of delusional sellers hold onto their wish prices and hopium. Millions of them will eat losses for years to avoid facing reality. Just like they did after 2008. Oh another 6 months and rates and prices will recover! Sales will pick up in the summer because of desperate buyers that sat out last fall! You're seeing a shit ton of that delusion on all the RE subs already.",
                "author": "Cold_Specialist_3656"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The \"2026 Rate Cut\" hopium is the only thing keeping Henderson/Vegas prices afloat right now.",
        "score": 99,
        "text_content": "I’ve been touring homes in the Henderson, NV golf course communities for the last few months, and the disconnect from reality is staggering. Almost every seller and listing agent I speak with is singing the same tune: *\"Prices are high because rates are dropping in 2026. If you don't buy now, you'll be priced out when the floodgates open.\"* But looking at the current macro landscape, all signs point to rates staying sticky or even ticking back up in 2026. The \"Golden Handcuffs\" are turning into a lead weight. **My question for the sub:** What happens to seller psychology when that 2026 \"savior\" never arrives? 1. **The Retreat:** Do they de-list, hunker down, and try to rent it out (adding to the \"accidental landlord\" pool)? 2. **The Capitulation:** Does the exhaustion of carrying a high-maintenance property finally break them? I’m seeing \"Days on Market\" creep up, but the price cuts are still measly. At what point does the \"hope\" phase of the cycle turn into \"panic\"?",
        "comments": [
            {
                "raw_content": "What is interesting about both cars and homes is days on market no longer means anything to a lot of people. Most of them are and lets be polite here, too young to know better and too old and stubborn to figure out that the lack of price drops is keeping things from being sold. So long as the dealer / homeowner is not in need of cash they just let it sit. What they either don't know because they are too young or just too stubborn is the fact that others are passing them by as they have sold their house and moved to what they wanted / where they wanted. Or in the case of car dealers yeah they lost $10k selling that car because they had to drop the price that much. But they are not longer paying the monthly interest on having it sit there and if / when they do sell it at the price they wanted they are loosing more since they didn't get to turn inventory and paid interest to have it sit on their lot that much longer. 2026 will see a drop in interest rates, but with inflation and the general cost of living going up it's not going to matter. As always IMO.",
                "author": "MiningDave"
            },
            {
                "raw_content": "Hopefully we get rate increases and a massive deflationary period in places like Vegas. Some of us literally only care about affordability. I, personally, am done climbing career ladders and can't handle that kind of stress anymore. A clock in, do the job, clock out job that could pay for reasonable basic expenses and low cost hobbies is all I need. Rental or not, I'm only trying to get by. Give me a stage crew or transportation gig that pays well enough, and I'll make it work on 3 12's or 4 10's.. maybe some ubering here or there.",
                "author": "thirstyaf97"
            },
            {
                "raw_content": "Huge problem with your post: \"Rate cuts will likely remain sticky/go up, macros show this\" What macros show this? Because right now the Fed is more worried about unemployment than inflation. Fed expressed they're okay with raising their 2% target short term, and CPI (even if cooked) shows to have kinda chilled (3.1% then 2.7%, so we'll have to see if next month is above ~3.2% before we start to think of raises). But IMO unemployment is a much bigger issue, and there is no way they raise rates if unemployment keeps ticking up the way it has. And with the recent job report numbers, and this current admin, I highly doubt we get anything other than higher unemployment. In that scenario the fed cuts 100%. But regardless, they still indicated ~2 rate cuts this year, maybe they reverse if the job market booms, but Id say no way we get a rate hike, and a very low chance of no rate cut at all this year.",
                "author": "AirFrierMachine"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Since people posted about Le Cun speaking out, here's François Chollet's take on Minneapolis",
        "score": 3557,
        "text_content": "Don't remove that, mod, there literally was the exact same post made for Le Cun here!",
        "comments": [
            {
                "raw_content": "![gif](giphy|Mrfga3Xsm5MKA)",
                "author": "guvbums"
            },
            {
                "raw_content": "Also Chollet speaking: https://preview.redd.it/1wpucnwjoifg1.png?width=754&format=png&auto=webp&s=7374707c1d13e2a874849603b27145010b874bc7",
                "author": "FomalhautCalliclea"
            },
            {
                "raw_content": "Now waiting for Greg Brockman",
                "author": "Primo2000"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "after claude now chatgpt is also uses Grokipedia as source",
        "score": 198,
        "text_content": "",
        "comments": [
            {
                "raw_content": "wait hold on does claude use grokipedia as a source?",
                "author": "petermobeter"
            },
            {
                "raw_content": "They're not using it as training data Do people not realize what happens when an LLM uses a search tool?",
                "author": "FateOfMuffins"
            },
            {
                "raw_content": "Oh ffs. I don't even know what else to say about this, but all models being fed right wing bullshit is the last thing we need.",
                "author": "DeterminedThrowaway"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "K-Shaped AI Adoption?",
        "score": 303,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If that is Kevin's reality, he's likely only hanging out with programmers that are very deep in the AI scene Not everyone in SF/Bay Area is like what he's describing",
                "author": "QforQ"
            },
            {
                "raw_content": "People in SF can *afford* to use $20 of API tokens every day. 99% of people cannot.",
                "author": "Gubzs"
            },
            {
                "raw_content": "It's always like this but even worse this time because the tech requires the user to know what they are doing to actually get good results, it's not completely braindead friendly yet. It also doesn't help that there is this entire moral campaign going on against AI which has probably made a lot of people not use it. If you are someone that wants to get ahead it is a good thing, you can literally make almost anything you want right now. But smart people have already caught onto this as well a while ago, so there is competition now.",
                "author": "Setsuiii"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Writing code alone is far from the problem when building a SaaS!",
        "score": 152,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Well, there are good alternatives to Docusign now, that are 4x cheaper. Many people I know switched recently to signwell, etc, that had used Docusign for decades.",
                "author": "Nickypp10"
            },
            {
                "raw_content": "Any wise tech business knows that “Not Built Here” mentality is a silent killer. SaaS will live forever because rolling your own everything puts 100% of the quality accountability on your team for literally every domain - domains that your company doesn’t specialize in, but another has made it their whole thing. I love that vibe coded SaaS companies are doing this. That leaves room for my company to outcompete by having features that actually work because we focused on building what we’re good at and not literally everything.",
                "author": "o5mfiHTNsH748KVq"
            },
            {
                "raw_content": "It takes 1 year to build a brand and indefinite time to operate that brand. You can buy raw materials at home depot doesn’t mean you can build Mariott/Hilton overnight.",
                "author": "Total-Confusion-9198"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Apple was very close to acquiring an AI lab last fall but the deal fell through late in the process",
        "score": 102,
        "text_content": "Who do we think it was? Confirmed NOT Prompt AI but a model developer. Bloomberg: https://www.bloomberg.com/news/newsletters/2026-01-25/inside-apple-s-ai-shake-up-ai-safari-and-plans-for-new-siri-in-ios-26-4-ios-27-mktqy7xb",
        "comments": [
            {
                "raw_content": "It was Mistral https://www.macrumors.com/2025/08/26/apple-discussed-buying-mistral-ai-and-perplexity/ but I think high level EU officials had some back room talks about this.",
                "author": "p3r3lin"
            },
            {
                "raw_content": "For Apple, I'm not sure it's worth buying a leading model provider if you own the distribution. Perhaps it's worth a second tier provider like Mistral, but why at all. Their magic will be in the flow and the experience. ed: sp",
                "author": "marlinspike"
            },
            {
                "raw_content": "xAi doesn’t make sense at all. Anthropic and OAi both make the most sense",
                "author": "allthatglittersis___"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Former Harvard CS Professor: AI is improving exponentially and will replace most human programmers within 4-15 years.",
        "score": 496,
        "text_content": "Matt Welsh was a Professor of Computer Science at Harvard and an Engineering Director at Google. https://youtu.be/7sHUZ66aSYI?si=uKjp-APMy530kSg8",
        "comments": [
            {
                "raw_content": "RemindMe! 15y",
                "author": "HedgepigMatt"
            },
            {
                "raw_content": "If an AI can replace all human programmers, then anyone with AI can replace any current products and services.",
                "author": "Nepalus"
            },
            {
                "raw_content": "Calling him a \"former Harvard professor\" was weird rather than his active title as \"Engineering Director at Google\".",
                "author": "aliassuck"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Engine.AI humanoid robots challenges American bots by doing air flips around an almost perfect rotation axis",
        "score": 53,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Can't wait to have my own household robot doing air flips around an almost perfect rotational axis. It'll fit right in next to my opera singing dishwasher.",
                "author": "xirzon"
            },
            {
                "raw_content": "I'll actually appreciate these videos when they're doing anything remotely useful. Boston dynamics did flips nearly a decade ago.",
                "author": "Alive_Werewolf_40"
            },
            {
                "raw_content": "Do: * My laundry. * Fold my laundry. * My dishes. * Vacuum the house. * Dust the house. * Clean up messy kitchen. * Clean the stove. * Clean the fridge. * Take the garbage out * Receive packages from delivery man * Do gardening * Mow grass Don't: * Backflips * Kicks * Spin kicks * Drop kicks * Superman punches * Breaking boards or doors down * Run somewhere really fucking fast * Sound like a fucking WW1 tank as you move * DOING OTHER DUMB SHIT NO ONE FUCKING WANTS TO PAY FOR YOU FUCKING IDIOT FUCKING ROBOTICS FUCKING MORONS /rant",
                "author": "AirGief"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Would the concept of nation-states, governments, and even human society in general die out post-singularity?",
        "score": 5,
        "text_content": "I find it hard to picture how nations, borders, citizenship, and shared cultural identities would still be a thing when your consciousness would be more like an account you log into and you could literally swap your physical form as easily as changing clothes. If that happens, what would the \"death\" process of those political entities (like countries) look like?",
        "comments": [
            {
                "raw_content": "It's hard to imagine the world not oriented around exploitation. Powerful modern nation states are oil companies with militaries. Thankfully cultures always been more about happiness and love. I suspect the old systems will simply lose relevance, what does it matter to you now that I wrote this from Australia? (the internet is also a force toward boundary breaking) Enjoy!",
                "author": "Revolutionalredstone"
            },
            {
                "raw_content": "People will find way to be united or disjoined. See \"Eclipse Phase\" TTRPG for an example, it's set in such era.",
                "author": "my_fav_audio_site"
            },
            {
                "raw_content": "ASI would like transition the concept of nations out fairly quickly, shared cultural identities would be harder but within a few decades if not sooner probably. As for the process? Simply having access and control of every electronic device makes it trivial. You can't run a government if you can't trust any emails or texts or calls, there's no one to arrest for treason, you can't stop it, you can't bargain with it (except maybe by holding humans hostage, which would be a weird freaking move by my gov at least, although I could see NK doing that).",
                "author": "JoelMahon"
            }
        ],
        "subreddit": "singularity"
    }
]