[
    {
        "post_name": "This Rose City Antifa member assaulted me in May 2019 at Cider Riot. The pub allowed the militants to prep their weapons inside. Cider Riot wasn’t sanctioned by the state for violating ordinances nor by police for destroying CCTV footage. The Portland Police never arrested her.",
        "score": 885,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They are not our Fellow Americans.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Remember this about cops, they are TYRANNY ENFORCERS for whatever government is running the show. They are not loyal to the people, they don't care about your rights, and they'll follow orders to kill you or stand by while terrorists kill you and not think anything of it. They're government dogs and the only good ones with a conscience will leave the force, leaving only the shitbags behind to do what they do. The police are not your friends when the government is not your friend.",
                "author": "Dev404"
            },
            {
                "raw_content": "iron front 3 arrows detected!!",
                "author": "guywholikesDjtof2024"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: FBI Agent Fired For Refusing to Arrest and Perp Walk James Comey",
        "score": 930,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yet, no problem kicking down doors on innocent Conservatives at 3 in the morning. We need some serious de-fumigation of that rats den known as the FBI.",
                "author": "BenDoverAssho"
            },
            {
                "raw_content": "We're gonna need a bigger toilet, Kash. 💩🚽💩",
                "author": "MythArcana"
            },
            {
                "raw_content": "I'd crawl through broken glass to be the one to perp walk this traitorous piece of shit.",
                "author": "DylanPatrick"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Leftists in Portland, Oregon Planning ‘Emergency’ Naked Bike Ride to Protest Trump and ICE. Pepper ball/spray their crotch to let them feel the Bern.",
        "score": 710,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Just a bunch of pedophiles wanting to get naked and seen by children.",
                "author": "95Rockytoby95"
            },
            {
                "raw_content": "Then when they're arrested, put them on the sex offender registry where they belong.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Why is everything always about sexual degeneracy with them?",
                "author": "Zskills"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "When a police officer tells you to back away from them, you should probably do it. 🤷‍♂️🤷‍♂️",
        "score": 424,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Bunch of larping nimrods. “MEDIC!!!!”",
                "author": "jatergator"
            },
            {
                "raw_content": "If you're talking, you're breathing",
                "author": "Reefay"
            },
            {
                "raw_content": "Sure you can breathe. You just can't breathe without it hurting really badly for a while.",
                "author": "FuzzAldrin"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Portland police have now arrested the man in the “freedom” tee shirt who defended himself and knocked out an ANTIFA member last night in a brawl outside the ICE building",
        "score": 425,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Portland Mayor marches with ANTIFA Portland city council IS ANTIFA and Portland PD is infiltrated with ANTIFA",
                "author": "PleaseHonk"
            },
            {
                "raw_content": "This is kinda a civil war. Portland authority is doing the complete opposite of the federal authority. They protect the criminals and arrest the other side, while federally they would want to arrest the criminals and protect the others. There is an absolute clash happening and it's progressing with more violence. The battlefields will become the cities in this situation.",
                "author": "DatabaseCentrals"
            },
            {
                "raw_content": "HEY PAMELA?! WHAT THE FUCK ARE YOU GOING TO DO ABOUT THIS, AND EVERY OTHER TRAVESTY OF JUSTICE ACROSS OUR LAND!!!",
                "author": "ImYourHuckleberry24"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "One of the biggest wins of Trump 2.0 may well turn out to be the massive paradigm shift in the perception of so-called NGOs. Once celebrated, or at least tolerated, there has been a widespread awakening that these groups fall somewhere between taxpayer-funded grifts",
        "score": 1085,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Raid their businesses, raid their homes, raid their workplaces and offices. Seize their belongings, rifle through their underwear drawers, liquidate their assets and freeze their bank accounts. Raid them at 5am and march them out in their pajamas in the face of a pre-arranged camera crew and charge them on trumped-up charges. Make them fear us like they THINK we feared them.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Trump is a beast. Dude single handedly woke up a giant, the American people, and patriots worldwide. We would be sold out and be like Canada right now if he didn't help us.",
                "author": "MagaJay02"
            },
            {
                "raw_content": "Not just grifts. Cancerous entities which seek to destroy the country from within, in the name of 'democracy'. Why is CAIR still around? You should have zero tolerance for it. See what its sister organization MCB had done to the UK.",
                "author": "knnbccb"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "An illegal foreign national from Mexico has been federally charged for allegedly trying to crash a DHS helicopter by blinding the pilot who was flying over the ICE facility in Portland, Ore. on Sept. 27.",
        "score": 987,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Oh, he likes to mess with helicopters, does he? 🚁 🤸🏼 🦈 🌊",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "3 of his illegal alien roommates were also arrested when they came to arrest him and will be deported",
                "author": "possibletower"
            },
            {
                "raw_content": "Fucking illegal alien FUCKS.",
                "author": "OhioRepublic"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump: To ICE, Border Patrol, Law Enforcement, and all U.S. Military: As per my August 25, 2025 Executive Order, please be advised that, from this point forward, anybody burning the American Flag will be subject to one year in prison. You will be immediately arrested.",
        "score": 1405,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Instead of making this illegal, make it legal for a vet to kick thier ass...",
                "author": "Double_O"
            },
            {
                "raw_content": "Uh...he left out an important detail, it isn't free speech if it incites violence, legal nuances really matter here. And the other important part is that a court needs to determine that said flag burning did in fact directly result in causing violence, a tough case to make stick. That's why dems keep using inciteful rhetoric, they know that it is very difficult to make it stick in court without direct corroborating evidence. And I support it being difficult to make stick because if it weren't we'd descend down the slippery slope of what is or is not incitement to violence. In the UK they're arresting people for speech simply by saying it harmed someone. Who? They never say. Apparently the right to confront your accuser doesn't matter any more over there.",
                "author": "Build_Back_Bankrupt"
            },
            {
                "raw_content": "Not sure if I like this. I mean I don't like when they burn it but...",
                "author": "Bisque"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Go after the people funding it",
        "score": 899,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The lawyers guild. That is what they used call the American BAR association until they were found to be communists. the BAR is a Chicago outfit, theyre not from DC. They have no legislative authority to run our courts or appoint themselves as judges.,",
                "author": "FlgPole"
            },
            {
                "raw_content": "Yuri Bezmenov said to find an agent of destabilization, look for the man who has power, yet was never elected.",
                "author": "Herpawinski"
            },
            {
                "raw_content": "Just like Blue Helmets, Green Helmets are Communist Enemies.",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: DHS Secretary Kristi Noem just announced the Department of War will deploy to Portland and Chicago within 24 hours to crush left-wing violence. She says she will make sure what happened to Independent Journalist Nick Sortor never happens again.",
        "score": 1474,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They're going to have to arrest/battle Portland Police, mark my words.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Do not create a Kent state situation - Follow the J6 Commie playbook that Bidens team used Step 1 - Run video non-stop with people doing stuff. Step 2 - Close off all of the exits and streets and DETAIN everyone Step 3 - While detained, take off masks and photograph them and arrest the ones with warrants or were the big trouble makers or members of a terror group. Step 4 - J6 them. Let the rest go and spend the next 60 days knocking on doors and arresting one at a time. Put out warrants for arrest and let them get pickup up by other Police. Step 5 - The process is the punishment. Follow the J6 handbook",
                "author": "yukondave"
            },
            {
                "raw_content": "BREAKING: DHS Secretary Kristi Noem just announced the Department of War will deploy to Portland and Chicago within 24 hours to crush left-wing violence. She says she will make sure what happened to Independent Journalist Nick Sortor never happens again. \"We're sending in the Department of War. I sent a request to Secretary Hegseth. Will be rolling in in the next 24 hours. What we saw happen to that journalist, will not happen again.\" \"This country is a country of laws. If you don't like the laws go change them. We are enforcing them. That is sending a message to the whole world.\"",
                "author": "PiratePatriotParrot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "No more internet for today.",
        "score": 805,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Alright, I'mma head out. jk, that was kektastic!",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "The left is going to meme this man into the Presidency, and I love it so much. They think this whole thing was a knock on Vance, but it's not and his handling of it has been amazing.",
                "author": "Wtf_socialismreally"
            },
            {
                "raw_content": "Chuck looks like Bill Gates here. AI is out of hand.",
                "author": "AppalachianTactical"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Delusional Democrat Hakeem Jeffries Believes Republicans Will Cave to Democrats Because of ‘Public Sentiment’",
        "score": 1060,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No USAID money to create fake internet outrage.",
                "author": "ThorsonTT"
            },
            {
                "raw_content": "Slowbama really doesn't have a clue.",
                "author": "Kamalaharrisisacunt"
            },
            {
                "raw_content": "Not so much, Dollar Tree Obama.",
                "author": "2Clutch"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Seattle Is Screwed",
        "score": 810,
        "text_content": "",
        "comments": [
            {
                "raw_content": "at every level there is only ONE GUY to corrupt. no easy quick way to get anyone out of office when they lie to get the job. the whole country is fucked.",
                "author": "FlgPole"
            },
            {
                "raw_content": "There's a wrinkly Soros dickprint in the mouth of every one of the \"soft on crime\" lackeys.",
                "author": "Kamalaharrisisacunt"
            },
            {
                "raw_content": "Seattle is massively fucked. It's like they are in a race to the bottom with Portland and L.A. . I have the displeasure of traveling through Seattle semi-regularly and zombies staring at the ground coupled with the stench of human waste really set the tone for the type of town you are in. They thought it best to neuter their police force in order to curb all the rising crime in the area. Truly groundbreaking ideas being floated around by the biggest fucking retards i've ever encountered. The best part is they are the most arrogant stuck up cunts pushing all this culture rot and they are constantly spraining their own wrists patting themselves on the back as their city crumbles to dust all around them.",
                "author": "StayoutOfit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I heard that Amy Klobuchar is upset about the sombrero memes.",
        "score": 803,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is, somehow, an improvement?",
                "author": "AbrahamLincoln"
            },
            {
                "raw_content": "Oh! Thought that was danny trejo!",
                "author": "Aboveaveragebear"
            },
            {
                "raw_content": "Dirty Sanchez?",
                "author": "Usernametaken2021"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Supreme Court Allows Trump to End Biden-Era Protections for Hundreds of Thousands of Venezuelans – Ketanji Brown Jackson Fumes",
        "score": 1427,
        "text_content": "",
        "comments": [
            {
                "raw_content": "She’s not a real judge",
                "author": "Cville123"
            },
            {
                "raw_content": "Judge Fumes is clueless.",
                "author": "AfterGlow"
            },
            {
                "raw_content": "What I really love about Wakanda Jackson is that her antagonism towards her fellow jurists is already costing the left cases. You didn't see this constant 6-3 split, the hardening of positions against the left, before she joined the court and started bumping her gums constantly, throwing shade at the other justices when they disagree with her. She is going to end up being the 'everything Biden touches turns to shit' gift that keeps on giving.",
                "author": "DestroyerofCobwebs"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Judge Rules Against Sanctuary Cities, Will Not Stop Trump from Cutting Off Federal Funds",
        "score": 1789,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Doesn't matter now, we are in #schumershutdown and could nuke those funds right now without anyone being able to stop it, oh yeah, they'd be permanent too.",
                "author": "Badfinz_FL"
            },
            {
                "raw_content": "Great news.",
                "author": "DeusVult1096"
            },
            {
                "raw_content": "Paying for your own invaders is LiTerAlLY FasCiSm.",
                "author": "OutlawPurpleHairDye"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "US to release special Trump silver dollar to celebrate America’s 250th",
        "score": 1675,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I want one!",
                "author": "TheSonOfGadsden"
            },
            {
                "raw_content": ".999 silver please",
                "author": "True-Patriot1776"
            },
            {
                "raw_content": "libtards go REEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEE",
                "author": "Badfinz_FL"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🐸 Night Shift Pepe Logging In 🐸☕🚬",
        "score": 807,
        "text_content": "",
        "comments": [
            {
                "raw_content": "so cozy",
                "author": "SweetBeef"
            },
            {
                "raw_content": "I’m currently sitting on a porch swing smoking a cigar and drinking a cocktail overlooking the beautiful moon and a wonderful night in New England. God bless every single one of you beautiful fucking Americans.",
                "author": "SaltyKrakenBalls"
            },
            {
                "raw_content": "Isn't it great being far away from evil democrats? 👍",
                "author": "ThouShallNotSteal"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "JUST IN: Would-Be Kavanaugh Assassin Sentenced to Only Eight Years in Prison Amid Claims of Transgender Struggles",
        "score": 1220,
        "text_content": "",
        "comments": [
            {
                "raw_content": "surprised he got even 8 years with the corrupt judges",
                "author": "Choppermagic"
            },
            {
                "raw_content": "completely self created struggles you mean",
                "author": "austford"
            },
            {
                "raw_content": "Can't have ***'transgender struggles'*** if you've been hanged.",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I bet they had a great time and laughed at sombrero jokes.",
        "score": 1426,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Melania is so beautiful. 😍",
                "author": "Alaskan"
            },
            {
                "raw_content": "Vance has come a long way since being anti-trump",
                "author": "Choppermagic"
            },
            {
                "raw_content": "I didn’t realize Vance was the same height, maybe a little taller than DJT, bodes well for his chance to be President",
                "author": "Papabravo12"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Chip designer Jim Keller says Intel still has 'a lot of work to do' — would consider it for Tenstorrent AI chip production, already in talks with TSMC, Rapidus, and Samsung for 2nm tech",
        "score": 25,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Who's actually buying Tenstorrent chips right now? Can they actually be a competitor to Nvidia?",
                "author": "bubblesort33"
            },
            {
                "raw_content": ">CEO and AMD and Apple Veteran, Jim Keller, has also said he'd consider working with Intel, but that it \"still \\[has\\] a lot of work to do,\" according to Nikkei Asia. I genuinely wonder if the author realizes that Keller briefly worked at Intel. Per MLID (I know), Keller was about to pull a Sandy Bridge 2.0, if not Conroe 2.0, out of his hat in the guise of \"Royal Core.\" I wonder what became of the \"Beast Lake.\"",
                "author": "GenZia"
            },
            {
                "raw_content": "Hello imaginary_num6er! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nintendo Switch 2 DLSS Image Quality Analysis: \"Tiny\" DLSS/Full-Fat DLSS Confirmed",
        "score": 192,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fast Fusion was a particularly awful looking game with DLSS. As the video briefly examines, the aliasing of the raw input resolution is exposed on anything in motion - which is most things in a racing game. I even wonder whether they slowed down the gameplay of this game because of how poor the image quality was, because its predecessor Fast RMX was much more fast paced.",
                "author": "trmetroidmaniac"
            },
            {
                "raw_content": "I 100% agree with Alex that developers should use the PC model and target lower resolutions The fact the cheap one basically looks like AA disabled makes it extremely ugly",
                "author": "TalkWithYourWallet"
            },
            {
                "raw_content": "So I posted on their video, and within a few minutes, they deleted it. What was in the post? Thing I mentioned included how they only now include post-processing in their DLSS timings, how post-processing is variable on what a dev wants to do with it, and asked why they only tested a single game that happened to use heavy post-processing. I even went and linked Nvidia's own timings of DLSS from different GPUs, and explained how scaling from those numbers to Switch 2's level doesn't align with their own timings. I took a screenshot because I was pretty sure they'd delete it as it didn't conform to their narrative. Also linking the public document that includes Nvidia's DLSS timings (you'll have to scroll down to page 6 with the green table to find them). [https://imgur.com/s71f0ta](https://imgur.com/s71f0ta) [https://github.com/NVIDIA/DLSS/blob/af199869c51cf2d71cc64d3db5064788ff38eb02/doc/DLSS\\_Programming\\_Guide\\_Release.pdf](https://github.com/NVIDIA/DLSS/blob/af199869c51cf2d71cc64d3db5064788ff38eb02/doc/DLSS_Programming_Guide_Release.pdf)",
                "author": "DiscostewSM"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nvidia CEO Jensen Huang frustrated by UAE AI chip delay, claims report — White House said to be pressing nation to finalize U.S. investments before chip deliveries are authorized",
        "score": 8,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "It's spooky 👻 season time to finally play Luigi's Mansion 3",
        "score": 416,
        "text_content": "Bought this game at launch years ago and never got around to really playing it",
        "comments": [
            {
                "raw_content": "4k 60 switch 2 update would be incredible. Still one of the best looking games on switch",
                "author": "mason2393"
            },
            {
                "raw_content": "I wish they’d release a switch 2 update for this. And I wish they’d add inverted aim as well.",
                "author": "Banesmuffledvoice"
            },
            {
                "raw_content": "Been playing it recently. It’s a lot of fun but fairly repetitive. If you like finding collectibles and 100%ing you’ll prob enjoy it, I just am not that kind of gamer. The vibe is excellent and super cute. I’m finding myself bouncing between other games as I’ve gotten later into the game though… there’s a lot of floors.",
                "author": "whitecollarw00k"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Super Mario Galaxy 1&2 comparison, original versus switch 2 (Digital Foundry)",
        "score": 1522,
        "text_content": "Wii: Captured using original disc running on Wii U (to use hdmi capture card) Looks amazing",
        "comments": [
            {
                "raw_content": "Am I seeing a different picture compared to the other comments? The Switch 2 version looks better to me.",
                "author": "JuanMunoz99"
            },
            {
                "raw_content": "The dithered textures in SMG were always noticable to me even on Wii it's nice they moved away from it.",
                "author": "dekuweku"
            },
            {
                "raw_content": "Does it run in 4k?",
                "author": "ad33zy"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Playing Mario Galaxy for the first time. Can't stop smiling.",
        "score": 191,
        "text_content": "Just want to preface by saying that I took a hiatus from gaming a little after when GameCube came out, so I missed out on the Wii and only got a Switch in 2021. Galaxy is a game I've always wanted to play, and so I bought it for the Switch 2, despite being on the fence as some reviews said it was awful, some reviews said it wasn't worth the price, and some saying it's great. The moment I started playing the first planet, I was grinning from ear to ear, my heart filled with so much joy from the absolute pure fun the game instilled in my heart. I know its cheesy, but its how I feel. Despite everything, the game does its job at being an absolute feel-good experience and I am so happy that I finally get to play the game in its entirety for the first time.",
        "comments": [
            {
                "raw_content": "galaxy 1 and 2 hold a very special place in my heart, glad youre getting to enjoy",
                "author": "Possible-Potato-4103"
            },
            {
                "raw_content": "These are my favourites because they really capture the energy of 2D Mario in 3D. Their pacing is just much faster and more immediate like the original SMB1, 3 and Mario World. Whereas 64, Sunshine and Odyssey are more exploration platforming. All good games but Galaxy hits the sweet spot for me.",
                "author": "junglespycamp"
            },
            {
                "raw_content": "Reading this warms my heart. Yeah, it's overpriced but the amount of people playing these masterpieces for the first time makes me really happy.",
                "author": "linkling1039"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Galaxy 2 bug",
        "score": 84,
        "text_content": "Im at rightside down galaxy and every time I enter the first pipe Mario disappears and the screen goes blue. Am I the only one having this issue?",
        "comments": [
            {
                "raw_content": "Damn, new any% blue screen runs are going to be wild! /s",
                "author": "JIMMI23"
            },
            {
                "raw_content": "It’s actually every pipe I enter, even in other galaxies",
                "author": "BenGott55"
            },
            {
                "raw_content": "I’m half way through the game and never have had this happen strange",
                "author": "fannyfaz"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Bought a Cute Bundle for my switch 2 and a new SD Card for 60$ from Walmart!",
        "score": 58,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nice.",
                "author": "PandiReddits"
            },
            {
                "raw_content": "Aww, an Amplifi HD router. I loved mine until it died. Nice find on the deal.",
                "author": "Chiptoon"
            },
            {
                "raw_content": "I love that case ❤️😸",
                "author": "Catzilla_64-"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo Switch 2 DLSS Image Quality Analysis: \"Tiny\" DLSS/Full-Fat DLSS Confirmed",
        "score": 159,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Atlus needs to watch this video",
                "author": "Medd-"
            },
            {
                "raw_content": "That explains the pixelated look of Fast fusion. I think devs should stick to normal CNN DLSS for now since Switch 2 is a gaming console, not a digital picture frame. I'll rather have 1080p that looks consistent during actual gameplay than 4K games that looks good in screenshots but reverts back to GameCube as soon as it starts moving.",
                "author": "RealGazelle"
            },
            {
                "raw_content": "Great investigation work from DF. Fast Fusion really does look terrible in movement and this does a great job at explaining why. However, Nvidia has managed to make HUGE improvements to DLSS in the past, so I wonder if these two models will get better over time",
                "author": "HatingGeoffry"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Bloomberg: Game Pass is cutting into sales of higher-margin games; Xbox gave up more than $300 million in sales of Call of Duty on console and PCs last year",
        "score": 956,
        "text_content": "https://www.bloomberg.com/news/articles/2025-10-03/xbox-s-game-pass-hike-shows-cost-of-lost-call-of-duty-sales > The price hike and other changes to the Game Pass plans are a sign that Xbox’s big streaming push is still not generating the revenue it would like eight years after launch, according to interviews with seven current and former Xbox employees. The company is putting some of its top titles on the streaming service, but that’s cutting into sales of higher-margin games like Call of Duty, which came with Microsoft’s 2023 acquisition of Activision Blizzard Inc., said the people, who asked to not be identified discussing internal company matters. > > Xbox gave up more than $300 million in sales of Call of Duty on console and PCs last year, according to one of the former employees, who asked not to be identified discussing internal estimates.",
        "comments": [
            {
                "raw_content": "Shocking just truly shocking…said no one.",
                "author": "StoneShadow812"
            },
            {
                "raw_content": "So they'll be trying to kill off Game Pass then",
                "author": "DasRhodes"
            },
            {
                "raw_content": "So, take COD off of Game Pass instead of having everyone pay more. Activision really was a bad acquisition for Xbox.",
                "author": "B00ME"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Rockstar Games has reportedly changed Red Dead Redemption 2's Steam store page description for the first time since 2019. Rockstar might be gearing up for an announcement of RDR2 Enhanced very soon, which is expected to include PS5, Xbox Series X, Switch 2, and also PC by the looks of it.",
        "score": 1487,
        "text_content": "[https://imgur.com/a/UJtQlXr](https://imgur.com/a/UJtQlXr) [https://imgur.com/a/V3tqzMz](https://imgur.com/a/V3tqzMz)",
        "comments": [
            {
                "raw_content": "What else could they add to RDR2 on PC? Ray-Tracing or something?",
                "author": "Zorklis"
            },
            {
                "raw_content": "60fps for Consoles means a really nice replay of Both RDR1and2 at sweet 60fps.",
                "author": "SagnolThGangster"
            },
            {
                "raw_content": "We're gonna get a current-gen version of RDR 2 announced on the same day that Capcom confirms Leon in Resident Evil 9 and Ubisoft reiterates that Beyond Good & Evil 2 is still in development.",
                "author": "MuptonBossman"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Microsoft is about to launch free Xbox Cloud Gaming with ads",
        "score": 581,
        "text_content": "This free game streaming is now in testing internally, and doesn't require a Game Pass subscription. A public test is coming soon. Microsoft employees can now access an ad-supported version of Xbox Cloud Gaming ahead of a public test. [https://www.theverge.com/report/791213/xbox-cloud-gaming-free-ad-supported-version](https://www.theverge.com/report/791213/xbox-cloud-gaming-free-ad-supported-version)",
        "comments": [
            {
                "raw_content": "This time next year, they'll reinforce the value of Essential with \"occasional ads,\" while Premium will get \"fewer ads.\" And then jack Ultimate another $10 per month with the added bonus of \"ad free gaming for no distractions!\"",
                "author": "waktivist"
            },
            {
                "raw_content": "The article says it is limited to 1 HOUR sessions with a max of 5 HOURS a month wtf",
                "author": "SuicideSkwad"
            },
            {
                "raw_content": "Adds during a videogame... 🤮",
                "author": "DAV_2-0"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[Alex Battaglia/Digital Foundry] The Nintendo Switch 2 has two separate DLSS types",
        "score": 335,
        "text_content": "[https://youtu.be/BDvf1gsMgmY&t=1394](https://youtu.be/BDvf1gsMgmY&t=1394) >We asked a respected developer behind the scenes who is familiar with the matter, and they came back to tell us this: DLSS on Switch 2 has two types; one that is much like the CNN presets on PC, and one that has presets that are roughly half the cost in terms of frametime than the CNN model. This cheaper model of DLSS is newer and in their experience it causes image quality to have characteristics I described here. It suffers in movement, although it may be sharper in stills. Hearing directly from a developer to confirm our findings is interesting. Two types of DLSS: that normal PC type we've known for ages that we see in Cyberpunk and another type like we see in the Touryst.",
        "comments": [
            {
                "raw_content": "The \"DLSS-lite\" conjecture was true!",
                "author": "Fidler_2K"
            },
            {
                "raw_content": "I still wonder how the dlss lite looks in person, haven't played a game that uses it yet.",
                "author": "Vanilla_Baunilha"
            },
            {
                "raw_content": "Wasn't there a Nintendo patent that's precisely about this?",
                "author": "PokemonBeing"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "HW News - Intel's New \"Super\" Cores & Xe3 GPU, NVIDIA Investigated by Ch...",
        "score": 30,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The negative bias is just too much to stomach... I sometimes wonder what Intel did to those \"techtubers\" despite muh game fps at 720P are lower than AMD fps at 720P.... (ignoring standard zen5 that would be trash according to their thesis)",
                "author": "necromage09"
            },
            {
                "raw_content": "Why do you think steve hates intel? If anything he literally seems to beg intel to do something against nvidia lol. I can see his bias against nivdia tho",
                "author": "comelickmyarmpits"
            },
            {
                "raw_content": "He hates Intel, but for some good reasons. I think his attitude will change over time. Intel is innovating and I see this as a really great idea.",
                "author": "grahaman27"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD Stands ‘Unfazed’ By the Intel-NVIDIA Partnership",
        "score": 213,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"Look what they need to mimic a fraction of our power.\"",
                "author": "Acrobatic_Fee_6974"
            },
            {
                "raw_content": "They already have contracts signed with Sony and Microsoft for their next generations, not to mention all the credibility they’ve gained in the PC enthusiast space. Intel has a lot of catching up to do and it will be years before they can make an attempt to compete for Sony and Microsoft’s attention.",
                "author": "Quality_Controller"
            },
            {
                "raw_content": "AMD CPUs are so good that even Intel dirty tactics of old didn't stop them. Believe me, I worked at Canada's largest retailer when Zen 2 was mopping the floor and Intel reps would come with scripts and incentives. It was obvious and brazen. They asked sales people to diminish AMD, boost Intel and only talk about Intel exclusives that AMD didn't have like thunderbolt... It all backfired spectacularly and I couldn't be happier for consumers",
                "author": "rebelSun25"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD quietly introduces \"Fast Motion Response\" option to Fluid Motion Frames 2.1",
        "score": 257,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Can someone explain to me how \"repeat frame\" offers any benefit as opposed to just having AFMF turned off? Isn't the whole idea of frame generation creating blended frames to give the illusion of higher FPS?",
                "author": "Sellot4pe"
            },
            {
                "raw_content": "Wait what's the point of repeat frame? Obviously image quality will be better, but what's the point of doubling your frames if half of them are repeated? Wouldn't that essentially be the same as having AFMF off?",
                "author": "HoboLicker5000"
            },
            {
                "raw_content": "w",
                "author": "Dull_Werewolf_9642"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Greystar and other landlords agree to a $141M deal to settle a rent-setting lawsuit",
        "score": 119,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Out of how many billions in revenue? Little slap on the wrist for the cost of doing business",
                "author": "WrongThinkBadSpeak"
            },
            {
                "raw_content": "This sucks, its just cost of doing business. I remember when the US used to do monopoly busting",
                "author": "TheIncredibleNurse"
            },
            {
                "raw_content": "Though apparently they can't share data with Realpage any more, which enforced should help stop the collusion.",
                "author": "True_Grocery_3315"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "US debt investors raise alarm over lending standards. Concerns come after unravelling of two companies deemed just weeks ago to be in strong health",
        "score": 275,
        "text_content": "",
        "comments": [
            {
                "raw_content": "FTA: >Several large banks have also been caught up in the collapse, including JPMorgan Chase and Fifth Third, which are exposed to losses on hundreds of millions of dollars' worth of auto loans. A second investor who has since sold their position in packaged-up Tricolor loans said they had no idea how potential financial irregularities went unnoticed by JPMorgan Chase, one of the banks that underwrote debt offerings. “That’s the shocking part of it,” the investor said. “JPMorgan is one of the most sophisticated lenders in the entire world. How the hell could they have missed this?” JPMorgan declined to comment.",
                "author": "WrongThinkBadSpeak"
            },
            {
                "raw_content": "Wait, I thought Dodd-Frank fixed this? This is the first bubble of the Mother of all Bubbles to burst. Auto manufacturers and dealers got really greedy after Covid and banks were all too happy to oblige by lengthening terms to accommodate highly motivated buyers. People overpaying for cars is coming home to roost.",
                "author": "Likely_a_bot"
            },
            {
                "raw_content": "Lenders approve everything auto related. I've worked with people making $17/hour with $1000/month car payments. These people should have never been approved for loans, yet they were. Even more scary, it used to be that people would brag about how cheap they got a car. Now with my factory/warehouse coworkers, people brag about how much they pay, as if they are trying to show other people that they have lots of money when they make crap wages. That's the only reason why I know people are paying so much for a car, because they use it as bragging rights to flex over others.",
                "author": "GREG_FABBOTT"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Millennials and Gen Zers are clamoring to break into the housing market. But this real estate expert says 'not everyone should be an owner' | Fortune",
        "score": 61,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"I'm at the age to buy a home, I should buy a home\" \"Expert\" says that's wrong. Homie built a straw man just to beat it down. No shit you shouldn't be a home because of some age, you should buy a home because you want one. And people should at least have the *option* to buy a home. Nearly everyone besides high earners have lost that option. That's not good.",
                "author": "jiggajawn"
            },
            {
                "raw_content": "Spoken like somebody is a landlord.",
                "author": "SeattleOligarch"
            },
            {
                "raw_content": "Reason I bought home this yr: rent has been going up each yr aggressively here in NYC metro. And I got tired of living in a cramped crappy 1 bedroom apartment and figured it was my time to enjoy a bit more space and luxury. I got a 4 bed home for $1M. Renting a similar place in similar neighborhood would cost $7-8k based on my research. Which in my case is more expensive than my mortgage payment.",
                "author": "cucci_mane1"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "America’s Fastest Rising and Falling Housing Markets",
        "score": 2,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Why list land at double market value?",
        "score": 1,
        "text_content": "Am I crazy, or is this just ridiculous? There’s a vacant lot behind my house that I’d love to buy. Similar lots around here have sold in the $125k–$160k range. This one? Listed for over $400k. This isn’t a booming metro either — it’s a rural area with a median home price around $350k and average household incomes in the ~$90k range. On top of that, we’ve got a shortage of builders, construction loans are tough to get, and building here is slower and more expensive than in other parts of the country. When you put all that together, the list price makes zero sense. To make it worse, the last sale of this same parcel was 9 years ago. At today’s price they’re implying 625% appreciation — about 25% annualized. Meanwhile, everything else in the area has appreciated maybe 30–40% total. I’d be an all-cash, no-contingency buyer, and the property is contiguous to my current home. This could have been a clean, easy deal. Instead, the price is so out of touch that negotiations feel dead before they start. So my question is simply this: why? Why would a realtor list something this disconnected from comps, income levels, and local realities? Is there some strategy here I’m missing, or is it just greed and wishful thinking?",
        "comments": [
            {
                "raw_content": "Maybe they know it'd be a strategic purchase for you or a number of other neighbors? Land has low ongoing costs. Its an annoying but valid strategy hoping someone will meet them at a high price if they're willing to let it sit.",
                "author": "CallerNumber4"
            },
            {
                "raw_content": "Sounds like they are either targeting you or the railroad company into buying the land. If you are worried about it enough, you could attempt to open some channel for negotiation.",
                "author": "harbison215"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Tesla Optimus learning kung fu",
        "score": 287,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Meanwhile, real killer robots will just be shaped like a ball or something, with whirling hammers and saw blades hacking everyone down in milliseconds.",
                "author": "Shoot_from_the_Quip"
            },
            {
                "raw_content": "Why is it attached to a cable?",
                "author": "BuckChintheRealtor"
            },
            {
                "raw_content": "![gif](giphy|3WvhJ783Le5ieNEZ8z)",
                "author": "AIOfficialBot"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Obligatory Test of Latest Text-to-Video Model: Eating Spaghetti",
        "score": 554,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The resemblance to Will smith is pretty bad, though.",
                "author": "PwanaZana"
            },
            {
                "raw_content": "gotta do will smith to be certain",
                "author": "ThunderBeanage"
            },
            {
                "raw_content": "thats not will smith",
                "author": "The_Scout1255"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "I asked SORA 2 to create a 90s-style Toy Ad of Epstein's Island.",
        "score": 905,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sora 2 is now on a no fly list.",
                "author": "burnt_umber_ciera"
            },
            {
                "raw_content": "That is disturbing - but very funny as well :)",
                "author": "-DethLok-"
            },
            {
                "raw_content": "This is fucking amazing",
                "author": "Environmental_Dog331"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "“Radiology’s Last Exam” - the toughest benchmark in radiology launched today! Board-certified radiologists scored 83%, trainees 45%, but the best performing AI, GPT-5, managed only 30%. Claude Opus 4.1 scored 1%",
        "score": 329,
        "text_content": "https://x.com/DrDatta_AIIMS/status/1973373655251038701 A bit insane considering the Godfather of AI Geoffrey Hinton predicted all radiologist doctors would have been completely automated by AI within 5 years in *2016.* Now it is even debatable if this will happen by 2035.",
        "comments": [
            {
                "raw_content": "gemini 2.5 pro was amazing. For the 7 month model it's very impressive..it scored 29 percent",
                "author": "kvothe5688"
            },
            {
                "raw_content": "30% from a general model is better than I would have expected. You can train a model specifically on radiology data and it will do better.",
                "author": "jeff61813"
            },
            {
                "raw_content": "I... wouldn't go that far. The fact that an AI is already getting 30% tells me it's far from out of reach. The level of improvement from that to radiologist-level is small in comparison to getting to 30% to begin with.",
                "author": "Inithis"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "There's still 3 months left. What does he (Suleyman) know that we don't?",
        "score": 179,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If you're using GPT 5 pro, I actually do feel like hallucinations have been heavily reduced though.",
                "author": "RedguardCulture"
            },
            {
                "raw_content": "Is he really wrong tho? \"largely\" GPT5-Thinking with search is not hallucinating that much. Clearly wayyyyy less than what we had in 2023.",
                "author": "Silver-Chipmunk7744"
            },
            {
                "raw_content": "Suleyman might have been legit at one point, but his interviews talk as much about his fashion choices now as they do about his work. IMO he's not worth following.",
                "author": "krullulon"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Holy shit I just got maybe the best web design output I've ever seen from an LLM with Gemini 3 Pro (model with ID \"d17...\" on AI Studio A/B Test)",
        "score": 163,
        "text_content": "Prompt: \"\"Write full HTML, CSS and JavaScript for a stunning, bold, creative and unique landing page for BlueNest. BlueNest is a social media platform for progressives. It should look like it was built from scratch by a world-leading web design agency on a multi-million dollar budget.\" This was 0-shot (no examples, single turn). Yes there are a few issues here but it's the best output I've seen for this prompt from any LLM. You can try it at [https://codepen.io/vuyp/pen/ZYQByqP](https://codepen.io/vuyp/pen/ZYQByqP)",
        "comments": [
            {
                "raw_content": "Yeah. Looks impressive for a one shot - side note - is anyone else sick of those single pages with sparse info? I hate this modern trend of everything in one long sparsely populated scroll page with little animations.. Ugh, just stay still. Give me dense information. Stop making me scroll. I see a site like that with buzzwords and it immediately makes me think of a student writing a page quota essay setting their line spacing larger to hide that they have no content.",
                "author": "Eisegetical"
            },
            {
                "raw_content": "I really wish I could pick a google engineers brain about how they are teaching these models design/artistry.",
                "author": "The_Scout1255"
            },
            {
                "raw_content": "That doesn't look like it had a multi-million dollar budget",
                "author": "brian_hogg"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "A demo from 1993 of 32-year-old Yann LeCun showing off the world's first convolutional network for text recognition.",
        "score": 65,
        "text_content": "https://x.com/MIT_CSAIL/status/1347237563342340097",
        "comments": [
            {
                "raw_content": "I deeply respect LeCun’s contributions and his stance on where AI stands today, though I see things differently in some areas.",
                "author": "Bubble_Purple"
            },
            {
                "raw_content": "talkative guys",
                "author": "New_Mention_5930"
            },
            {
                "raw_content": "Back when he actually worked on ai instead of complaining about it on Threads",
                "author": "Tolopono"
            }
        ],
        "subreddit": "singularity"
    }
]