[
    {
        "post_name": "Did you know that during the George Floyd riots in Portland, a black person was stabbed and nearly paralyzed by a white man who got a deal where he didn't have to do any prison time? Why the special treatment? The white man is a pedophile Antifa member.",
        "score": 839,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I've been trying to tell you guys that Portland is the center of this Antifa shit. Root it out and then follow the money trails all the way across the ocean to China, Russia, etc.",
                "author": "NoWarWithIran"
            },
            {
                "raw_content": "Is there any other type of ANTIFA than a pedo ANTIFA?",
                "author": "MAGAguitar"
            },
            {
                "raw_content": "Rose city antifa should have been dawn FBI raided months ago. Rose city as far as I can tell is one of the hubs, all electronics should be taken, foreign coms, money, etc tracked, and their phonebooks investigated to shutdown other antifa chapters. All of the antifa chapters are connected to antifa international, so taking them out as part of a foreign terrorist org is priority.",
                "author": "Tunk"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "NEW: I just spoke with Congresswoman @realannapaulina and she tells me that she has received evidence that China funded one of the groups under FBI investigation for ties to Tyler Robinson’s Discord activity where he may have discussed his plans to assassinate Charlie Kirk.",
        "score": 771,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Suuuuuuuuure",
                "author": "snakeoil"
            },
            {
                "raw_content": "What is the latest on the case? what happened to the shooter's tranny bf who ran away? The weird pedo Jew who started shouting he had done it? It seems like this is going to be yet another shooting where the public doesn't get to know any details...",
                "author": "MemeMagic777"
            },
            {
                "raw_content": "Should like the Jewish girl is trying to take the heat off of someone else.",
                "author": "Mungo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "North Carolina Democrat Candidate for the 9th Congressional District Richard Ojeda has threatened Stephen Miller: “I'd be willing to go to jail to kick the shit out of him.”",
        "score": 603,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Violent, Murderous Left.",
                "author": "Moebius"
            },
            {
                "raw_content": "Certainly sounds like a threat against a federal official to me, but what do I know?",
                "author": "Tookens"
            },
            {
                "raw_content": "because he's right, you have no answer, so your peanut head resorts to violence",
                "author": "Covidrrhea"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "UNBELIEVABLE FOOTAGE! I witnessed Portland PD giving advice to ANTIFA terrorists on how to avoid federal troops being allowed into the city after the temporary restraining order (TRO) against President",
        "score": 1182,
        "text_content": "",
        "comments": [
            {
                "raw_content": "arrest him.",
                "author": "ChyNahAzzWhole1"
            },
            {
                "raw_content": "Portland is Antifa. The only recourse is violence. Sorry not sorry.",
                "author": "AmeReaganPatriot"
            },
            {
                "raw_content": "Is the guy in the P hat, the same \"officer liason\" we saw yesterday telling the lady in the car he would arrest her if she tried to drive down the street? Edit: actually both of them... https://patriots.win/p/1AR0sIboqT/",
                "author": "CounterStrike"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "UPDATE: A high-ranking Chicago gang member has been charged with putting a MURDER-FOR-HIRE out on Border Commander Greg Bovino, who is involved in President Trump's Operation Midway Blitz. Right as Gov. JB Pritzker, Mayor Brandon Johnson and Democrats put targets on the back of federal agents.",
        "score": 1326,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Death penalty him instead. Turn the tables",
                "author": "Wrexxis780"
            },
            {
                "raw_content": "We are at war. So many cant just see it yet. EDIT: last time you saw this shit was 1988, Eddie Byrne. NYPD executed by a drug leader while sitting in his RMP protecting a family that had the balls to call out the crack dealer and get him locked up. It eventually led to an outright war on criminals and ushered in a new era of conservatism. Even the rapist Bill Clinton (infowars.com) had to slide to the center to get barely elected. Ross Perot unfortunately ruined that with his unmatched 3rd party vote split.",
                "author": "Haiti_kid"
            },
            {
                "raw_content": "Nancy Pelosi's statement, \"I just don't even know why there aren't uprisings all over the country, and maybe there will be,\" was made on June 14, 2018.",
                "author": "Bohemyth_2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Based Coffee Makers",
        "score": 919,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Stocking Mill Coffee > Black Rifle Coffee",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "These guys had the Kenosha Kid’s back the whole time in the not too long ago when other coffee companies acted like fags. Good dudes.",
                "author": "BoomShtick"
            },
            {
                "raw_content": "I have been buying coffee from these folks for years. It's not the most amazing stuff, but it's good enough and I love supporting companies that are America first!",
                "author": "lynxxyarly"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The White House : Tonight, Democrats voted again to keep the government shutdown. That's 5x prioritizing illegal aliens over Americans. Common sense? MISSING. Radical Left agenda? Full speed ahead.",
        "score": 911,
        "text_content": "",
        "comments": [
            {
                "raw_content": "*government shuts down *nothing in my life changes at all How bout yall?",
                "author": "AVeryNakedMan"
            },
            {
                "raw_content": "common sense dictates that we should keep the gov’t shut down until we’re no longer in debt",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Leave it shut down.",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Nick Sortor and his lawyer are about to bankrupt the corrupt city of Portland, Oregon. The lawsuit will be epic. \"I'll put it in the category of 99% certain we will be suing the Portland Police Department in federal court.\"",
        "score": 1317,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Spoiler: you can’t bankrupt a city, you can only bankrupt its citizens.",
                "author": "Restore_Sanity_alt"
            },
            {
                "raw_content": "Hyperbole much? Maybe he'll get some settlement (guaranteed he's going for settlement than taking the case all the way). But city is not going bankrupt lol.",
                "author": "maverick202"
            },
            {
                "raw_content": "Yeah federal judges have been so great for our side.",
                "author": "Patriot283"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "It's not a fluke. It's who they are.",
        "score": 1011,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Send that thing to GITMO and interrogate on who paid him for this agenda.",
                "author": "USMC1234O10"
            },
            {
                "raw_content": "seems like the opposite would be the case?",
                "author": "twentytwentyfourr"
            },
            {
                "raw_content": "Uhhh that's not how it works, they will shoot WAY MORE people.",
                "author": "RedditIs4Retards"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Antifa terrorists in Portland are now assaulting people with bottles filled with urine while police stand by and do nothing. Portland police are an absolute disgrace. They are controlled by Antifa",
        "score": 1628,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They ARE Antifa.",
                "author": "Ghostphaez"
            },
            {
                "raw_content": "At this point you have to suspect that, by only enforcing the law on one side, they're hoping to cause someone to use lethal force in defending themselves against Antifa.",
                "author": "orcwordlaugh"
            },
            {
                "raw_content": "> They are controlled by Antifa slight misnomer > the same people that control antifa control the portland pd. is more accurate IMO",
                "author": "kek-is-tan"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Hakeem Jeffreis is asked, \"What's the next move?\" since they won't negotiate with Republicans. They plan to WAIT for an UPRISING in America!",
        "score": 784,
        "text_content": "",
        "comments": [
            {
                "raw_content": "why isn't he wearing his hat?",
                "author": "-f-b-i-"
            },
            {
                "raw_content": "Obama care, subsidized by biden... not a Republican health care crises. Trump wanted to dismantle it 9 years ago.",
                "author": "SneakyPete"
            },
            {
                "raw_content": "Clearly dollar store Barry doesn’t know the sentiment of Americans. Spoiler alert: insurance premiums have been through the roof for over a decade. The ones that care already don’t go to the doctor regular enough to give a shit. The ones that’ll pretend to care don’t pay for their healthcare anyways",
                "author": "EggsBennydict"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I thought these guys looked familiar...",
        "score": 840,
        "text_content": "",
        "comments": [
            {
                "raw_content": "****Top Post:**** Portland PD giving advice to ANTIFA terrorists on how to avoid federal troops being allowed into the city after the temporary restraining order https://patriots.win/p/1AR0sHVtpc/unbelievable-footage-i-witnessed/c/ ****Bottom Post:**** Portland Police are now ACTIVELY DEFENDING Antifa militants, telling local residents they “will be ARRESTED” if they drive down Antifa-controlled streets https://patriots.win/p/1AR0nhcY3M/wtf-portland-police-are-now-acti/c/",
                "author": "CounterStrike"
            },
            {
                "raw_content": "Really well done here. Definitely the same 2 cucks.",
                "author": "Wahzuhbee"
            },
            {
                "raw_content": "Trump needs to send this asshole to solitary confinement",
                "author": "MedicallyReddit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Judge Won’t Immediately Block President Trump’s National Guard Troop Deployment to Illinois",
        "score": 1006,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How gracious of our judge overlords.",
                "author": "FiveStarMan"
            },
            {
                "raw_content": "Judges don't have the means to block anything. Ignore them when it comes to military action.",
                "author": "NoWarWithIran"
            },
            {
                "raw_content": "Judges think they’re God.",
                "author": "MedicallyReddit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "NOW: The Texas National Guard is being deployed NATIONWIDE to Chicago and Portland, assisting ICE officials and securing federal property against rebellion.",
        "score": 762,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wheels up! Let’s roll.",
                "author": "TravisRSCX"
            },
            {
                "raw_content": "# 𝐈𝐍𝐕𝐎𝐊𝐄 𝐓𝐇𝐄 𝐈𝐍𝐒𝐔𝐑𝐑𝐄𝐂𝐓𝐈𝐎𝐍 𝐀𝐂𝐓",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "We are at war",
                "author": "MedicallyReddit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Biden’s FBI, Jack Smith Tracked Private Phone Calls of Several Republican Senators During Investigation Into January 6",
        "score": 1630,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wake me up when anyone wants to do anything about it",
                "author": "trumptrain90"
            },
            {
                "raw_content": "Who authorized that?",
                "author": "BlackPilledMAGA"
            },
            {
                "raw_content": "If by \"several Senators\" they mean \"all the Republican Senators and their staff and all the Republican Congressmen and their staff, plus Trump and all his people\", then they're correct.",
                "author": "infinitysupreme"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I love Stephen Miller 😂",
        "score": 1710,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Even if he said yes I wouldn’t be offended",
                "author": "Porkchop-express"
            },
            {
                "raw_content": "What a fucking piece of shit. (CNN)",
                "author": "MidnightDriver"
            },
            {
                "raw_content": "Illegals are also taking up affordable housing and driving rents up. They also drive without a license or insurance driving up the cost of insurance.",
                "author": "MapleMAGA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Secretary Kristi Noem : Brandon Johnson and @JBPritzker are doing everything in their power to shelter and protect criminal illegal alien gangbangers, murderers, and violent anarchists. @ChicagosMayor just reaffirmed his allegiance to criminal illegal aliens",
        "score": 962,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Traitors need accountability or rose treasonous continue to be traitors.",
                "author": "SaltyKrakenBalls"
            },
            {
                "raw_content": "So fucking arrest both of them! By harboring criminals, they both are committing criminal acts themselves, and Noem's own tweet says they arrest criminals. I seem to remember Homan saying elected officials are not off limits months ago.....",
                "author": "POTUS_DonnieJ"
            },
            {
                "raw_content": "They’re going to keep doing it until you no knock the governors mansion and black bag their ass to locations unknown.",
                "author": "Viewer01"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "JUST IN: South Carolina Authorities Say There is “No Evidence” of Arson as Democrats Blame Trump, Stephen Miller and MAGA After Judge’s House Explodes, Burns Down",
        "score": 781,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They project themselves onto you. They know they are violent, so they assume you are, too. We are not the same.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "3 months from now we'll find out it's insurance fraud.",
                "author": "D__1"
            },
            {
                "raw_content": "Democrats gaslighting proves they are guilty!",
                "author": "MajorClark"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "What do you think about what President Trump has done to the Oval Office?",
        "score": 731,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not my style but it's Trump.",
                "author": "TooDeap"
            },
            {
                "raw_content": "It looks regal!",
                "author": "dontdrinksoy"
            },
            {
                "raw_content": "It looks like an office befitting the president of the United States of America.",
                "author": "GhostOfMyFormerSelf"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "NEW: Comey’s Arraignment Moved Up to Wednesday Morning For ‘Security Reasons’",
        "score": 1254,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I voted for pre dawn raids with info wars invited to film it",
                "author": "PapaPepe"
            },
            {
                "raw_content": "I just saw a bunch of seashells on the beach that spelled out \"Comey is an Assclown\".",
                "author": "OutlawPurpleHairDye"
            },
            {
                "raw_content": "“Because there are multiple previously-scheduled matters that are expected to draw large numbers of people to the courthouse at the same time as the arraignment, and because it is necessary to ensure the security of the Court, the parties, and the public, it is hereby ordered that Defendant is summoned to appear for arraignment before this Court on Wednesday, October 8, 2025, at 10 am.,” the judge said.\" So they can move around their schedule due to crowds of people but President Trump cannot protect our federal buildings for the same reason?",
                "author": "MJK1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "AMD stock skyrockets 25% as OpenAI looks to take stake in AI chipmaker",
        "score": 726,
        "text_content": "* OpenAI and AMD have reached a deal that could see Sam Altman’s company take a 10% stake in the chipmaker * OpenAI will deploy up to 6 gigawatts of AMD Instinct GPUs over multiple years, beginning with a 1-gigawatt rollout in 2026. * AMD issued OpenAI a warrant for up to 160 million shares, with vesting tied to deployment and share price milestones.",
        "comments": [
            {
                "raw_content": "Feels like Altman is just getting everyone on board with him, in order to keep the bubble afloat as much as possible or else…",
                "author": "Tradeoffer69"
            },
            {
                "raw_content": "So, Nvidia throws 100bn at OpenAI -> OpenAI goes ahead and invests that money in AMD? The art of the deal right there. Maybe it might be an unpopular opinion, but the whole thing with OpenAI investments starts to feel like some scheme to me, can't put my finger exactly what's happening there but it definitely feels fishy. I hope someone here can make sense of all this for me.",
                "author": "Wyvz"
            },
            {
                "raw_content": "So money is shifting from Nvidia -> OpenAI -> AMD. It's all a big circlejerk of money changing hands from one company to another and back again in order to inflate their stocks.",
                "author": "chamcha__slayer"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Gamers Nexus - Installing Linux on Hundreds of \"Obsolete\" Computers | Microsoft Windows 10 Support Ending",
        "score": 132,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Really nice to see GN diving into Linux.",
                "author": "itastesok"
            },
            {
                "raw_content": "There's always Win10 LTSC or IoT and bypassing the requirements of Win11 if you don't want to throw your perfectly fine Win10 PC in the trash. I am on Win 10 ESU for now, but next year, I'll probably go LTSC or IoT.",
                "author": "AnechoidalChamber"
            },
            {
                "raw_content": "Can we acknowledge that it’s cool that Linux will run on practically anything without having to pretend that there are millions of people yearning for a 10 year old Optiplex with half the functionality of their phones but with much worse performance??",
                "author": "ilevelconcrete"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[News] Texas Instruments’ U.S. Layoffs Reportedly to Hit 400 This December Amid Closure of 150mm Chip Facilities",
        "score": 10,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">**Texas Instruments Announces Layoffs in China** >Texas Instruments is not only cutting jobs in the U.S. As noted by SYcaijing, citing sources, the company also announced a new round of layoffs in its China division last month, affecting core technical and support roles such as field application engineers (FAEs). Unlike previous adjustments that primarily focused on R&D functions, this round of layoffs in China explicitly includes customer-facing technical service teams for the first time, as the report points out.",
                "author": "imaginary_num6er"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel layoffs leave many Debian and Ubuntu packages without updates",
        "score": 504,
        "text_content": "",
        "comments": [
            {
                "raw_content": "From the article: >In addition to [some Intel Linux kernel drivers being \"orphaned\"](https://www.phoronix.com/news/Intel-More-Orphans-Maintainers) following the corporate restructuring at Intel between developers being laid off and others deciding to pursue opportunities elsewhere, these changes have also led to a number of Intel-related software packages within Debian being orphaned. In turn these Intel packages are also relied on by Ubuntu and other downstream Debian Linux distributions. >Around one dozen Intel packages within the Debian archive were recently orphaned, a.k.a. now being unmaintained following developer departures from Intel with no one currently taking up the new responsibility, with also needing to be a Debian Developer or Debian Maintainer to contribute. Edit: Fix quote.",
                "author": "0xdeadbeef64"
            },
            {
                "raw_content": "its easy to think \"well that sucks for linux users\" but since linux is very dominant in the datacenter this is pretty serious",
                "author": "MysteriousBeef6395"
            },
            {
                "raw_content": "this also hits the rhel systems not just debian/ubuntu",
                "author": "Deshke"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel Xeon Clearwater Forest with 288 Cores on Intel 18A at Hot Chips 2025",
        "score": 84,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Damn, there is a LOT of silicon on that chip. Pretty cool to see Intel actually using their own fabs for everything with tiles of Intel 7, Intel 3 and Intel 18A all on the same packaging.",
                "author": "Visible-Advice-5109"
            },
            {
                "raw_content": "Dear Lord, they're offering two socket boards. 576 cores in a single chassis.",
                "author": "RazingsIsNotHomeNow"
            },
            {
                "raw_content": "That's one handsome chip.",
                "author": "UGMadness"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Phoronix] Ubuntu 25.10 Delivering Some Nice Performance Gains For Intel Core Ultra \"Lunar Lake\"",
        "score": 22,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Moving to a newer Linux kernel will do that. Honestly why I generally prefer distros that have more up to date kernels.",
                "author": "0riginal-Syn"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Thermalright Phantom Spirit 120 Vision EVO/SNOW product page is up",
        "score": 17,
        "text_content": "* [PS120 Vision EVO](https://thermalright.com/product/phantom-spirit-120-vision-evo/) * [PS120 Vision SNOW (white)](https://thermalright.com/product/phantom-spirit-120-vision-snow/) Feature check: * Same 7x 6mm heatpipe layout as before. * New TL-K12-X28-R9 (120x28 mm, 9 blades, 2150 rpm) fan. * 3.95\", 480x480 LCD display PSA: this is a straight-up upgrade from the Phantom Spirit 120 Digital. [Which launched last month.](https://www.techpowerup.com/340586/thermalright-launches-phantom-spirit-120-digital-cpu-cooler-series)",
        "comments": [
            {
                "raw_content": "Do they have one that clears ram better yet? Or just 1000 other models.",
                "author": "imKaku"
            },
            {
                "raw_content": "Looks pretty sick, I've got the original and it works well.",
                "author": "ej102"
            },
            {
                "raw_content": "Would be nice if Thermalright stops their elevator music on their english homepage",
                "author": "imaginary_num6er"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Which? vs Qualcomm: our collective action goes to Trial",
        "score": 0,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Just a fun throwback to a simpler time",
        "score": 874,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Now if only they added games",
                "author": "timo710"
            },
            {
                "raw_content": "Nintendo: \"Why not both? Both is good.\"",
                "author": "DSMidna"
            },
            {
                "raw_content": "Of course the top answer is wrong.",
                "author": "Caciulacdlac"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I don’t have a problem and can stop anytime…right?",
        "score": 199,
        "text_content": "Sighhhhh…. Maybe the SN 30?",
        "comments": [
            {
                "raw_content": "What’s the bottom right? Does it vibrate?",
                "author": "Cha_Boy_C"
            },
            {
                "raw_content": "I just ordered the 8BitDo Pro 3, coming on Thursday. I look forward to using it for platformers and fighting games.",
                "author": "TheArisenRoyals"
            },
            {
                "raw_content": "Do you have a lot of players in the house or friends that come by? I currently have the top 3... but only I play. But I have the others just in case. I'm considering a GameSir controller for my next one.",
                "author": "rigel-luminous"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Have you used your Switch OLED since the Switch 2 Launch?",
        "score": 356,
        "text_content": "Mine has basically become a visual novel machine since the Switch 2 came out given the gigantic performance boost even in backwards compatible titles. I also use it for the 2D Nintendo classics given the OLED Motion Clarity.",
        "comments": [
            {
                "raw_content": "Nope. It’s currently sitting in a box going unused",
                "author": "hockeyrabbit"
            },
            {
                "raw_content": "Been mainly using it as my YouTube machine for now. Really don’t understand why it’s taking so long to have an updated version for switch 2",
                "author": "ProjectPorygon"
            },
            {
                "raw_content": "Almost daily for Silksong. Trade 120fps for perfect blacks…and those corners/walls sure are dark in that game.",
                "author": "OkMixture5607"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Best MicroSD Express Cards for Nintendo Switch 2 in 2025 — the best cards on the market, benchmarked and ranked",
        "score": 58,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I actually recently upgraded to the 512GB Sandisk card and it’s been great! Surprised it’s not on the list.",
                "author": "Broken-Nero"
            },
            {
                "raw_content": "I wish they reviewed the ONN brand one, if I buy any new card in the next few months it would be that one due to the price and size.",
                "author": "NoirSon"
            },
            {
                "raw_content": "Is there a TLDR?",
                "author": "DarkExsphere"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Why does my Switch 2 automatically output 4K to my 1440p monitor?",
        "score": 15,
        "text_content": "I can manually switch it to 1440p but I am curious why this is an issue. I have the original M27Q monitor. Has anyone else had this happen?",
        "comments": [
            {
                "raw_content": "I guess some monitors will accept a 4k signal. I've actually been wondering if games running at 4k would get a slight supersampling effect from this",
                "author": "1112e"
            },
            {
                "raw_content": "I can't remember the exact name but there's this communication protocol that display and device do when they're connected via HDMI or DP. Basically when you connect Switch to monitor, monitor tells Switch which resolution and framerate it supports and Switch reads the list and choose the best one it can support. For some reason, monitor manufactorers don't put much care in to this process and the list can be jankey. I think samething is happening to yours. If it bothers you, there's softwares to modify codes in the monitor but I won't recommend it as if I remember correctly, it could break monitor's firmware. Just change it manually like everyone else says.",
                "author": "RealGazelle"
            },
            {
                "raw_content": "You can manually change the output to 1440p. But there's no issue on automatic 4K output.",
                "author": "Pristine-Brush-1052"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Silent Hill 2 Remake is seemingly jumping to Nintendo Switch 2 and Xbox as exclusivity ends",
        "score": 282,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Please please please This, f and the Resi remakes are the only games I want to play that are not on Switch right now",
                "author": "Tribal_Cult"
            },
            {
                "raw_content": "This would be welcome. Fatal Frame, Re9, and now SH2, some good horror games on the Xbox platform.",
                "author": "ollielite"
            },
            {
                "raw_content": "This and Doom The Dark Ages ive been holding off buying in hopes of a switch version. Got tons of games in my backlog to play anyway, I could wait.",
                "author": "uncultured_swine2099"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Power bank recommendation",
        "score": 12,
        "text_content": "Does anybody know of any good power banks that has a charge rate that can charge the Switch 2 battery while using it? All the power banks I have are slower charge rate and the console battery still depletes while playing though of course at a slower rate. I’m going to be flying to Japan next year and wanted to make sure I have a reliable power bank for the long flight",
        "comments": [
            {
                "raw_content": "Anker 737",
                "author": "Grindar1986"
            },
            {
                "raw_content": "INIU 65W 20000 mAh here, works a charm, charges faster than it discharges battery with 100% brightness",
                "author": "uchuskies08"
            },
            {
                "raw_content": "I got the “classic size” of this one right when the Switch 2 came out. Used it on a few flights and works great. https://a.co/d/dbYzk3c",
                "author": "phillypharm"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Battlefield 6 has been sent to people before the release date, OP confirms that the full game is on the disk.",
        "score": 739,
        "text_content": "[It is finally in my hands : r/Battlefield](https://www.reddit.com/r/Battlefield/comments/1nzhg5l/comment/ni2p0qh/) Also states that MP works fine. [https://www.reddit.com/r/Battlefield/comments/1nzhg5l/comment/ni2iofv/?utm\\_source=share&utm\\_medium=web3x&utm\\_name=web3xcss&utm\\_term=1&utm\\_content=share\\_button](https://www.reddit.com/r/Battlefield/comments/1nzhg5l/comment/ni2iofv/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)",
        "comments": [
            {
                "raw_content": "He can play campaign and he say MP servers are online too. GG",
                "author": "Faaw"
            },
            {
                "raw_content": "you know gaming is in a bad state when \"the full game is on the disk\" is now a leak",
                "author": "BadTakesJake"
            },
            {
                "raw_content": "Oh wow… that’s impressive now a days",
                "author": "Ornery-Tonight1694"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[Dusk Golem] Xbox version of Silent Hill 2 Remake, PS5 Pro Patch and Born from a Wish DLC are getting announced soon, Konami is tying it around the window of the upcoming Silent Hill 2 movie",
        "score": 500,
        "text_content": "[Source](https://xcancel.com/AestheticGamer1/status/1975058939093078093?t=ByZj0aX3t26wtSXLCiY9yg&s=19)",
        "comments": [
            {
                "raw_content": "#DuskGolem is a Tier 3 - 50/50 as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "The comeback for both RE and SH has to be studied.",
                "author": "Massive_Weiner"
            },
            {
                "raw_content": "Okay this is probably the last chance for born from a wish, gonna trust Dusk here and hope it IS actually real.",
                "author": "Ratchet2332"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Jez Corden on Xbox canceling their handheld: 'this isn't even slightly true btw'",
        "score": 390,
        "text_content": "[Source](https://xcancel.com/JezCorden/status/1975204402010145108#m)",
        "comments": [
            {
                "raw_content": "#Jez Corden is a Tier 2 - Generally Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Xbox running around the gaming industry like Howard from Uncut Gems",
                "author": "yahmad"
            },
            {
                "raw_content": "I like that Jez keeps running with the opposite of whatever is reported, right or wrong lol",
                "author": "theanderson51"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Powerwash Simulator 2 release date trailer leaked, releasing October 23rd",
        "score": 283,
        "text_content": "https://youtu.be/RrFexXPbVuM",
        "comments": [
            {
                "raw_content": "FINALLY, a release date for the only real GOTY contender (seriously, I played through the original like 3 times, and I sometimes boot it up just to clean the skatepark or subway)",
                "author": "RipMcStudly"
            },
            {
                "raw_content": "I really hope they do another Final Fantasy collab like the first game letting you clean up the Shinra building. I'd love a pack themed around the theater in Alexandria from FFIX or the Returners hideout from FFVI",
                "author": "MyMouthisCancerous"
            },
            {
                "raw_content": "October 23, 2025 is about to be one of the days that people look back on in history and realize just how terrible things were before then.",
                "author": "Str8UpJorking"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Aliens: Fireteam Elite 2 has been rated by the ESRB",
        "score": 245,
        "text_content": "https://www.esrb.org/ratings/40680/aliens-fireteam-elite-2/ This game hasn't been announced yet",
        "comments": [
            {
                "raw_content": "Loved the first game. Thought it had a lot of potential but they stopped a bit before they reached it.",
                "author": "kodan_arma"
            },
            {
                "raw_content": "I hope we get better bots for the solo in the sequel",
                "author": "Sweet-Ghost007"
            },
            {
                "raw_content": "It was leaked last year I believe. Bring it on. I love me some aliens!",
                "author": "joshua182"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel layoffs leave many Debian and Ubuntu packages without updates",
        "score": 56,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Damn no more clear Linux , I hope they still maintain the intel compiler",
                "author": "AggravatingGiraffe46"
            },
            {
                "raw_content": "I don't know if AMD will fare any better in the long haul but I sure am glad we just switched our poweredge server field over to epyc",
                "author": "PsyOmega"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "OpenAI's Blockbuster AMD Deal Is a Bet on Near-Limitless Demand for AI",
        "score": 323,
        "text_content": "",
        "comments": [
            {
                "raw_content": "companies betting on infinite growth. what's new?",
                "author": "LegitimateCopy7"
            },
            {
                "raw_content": "I mean i woke up today to see my AMD stock up 30% i was very happy.",
                "author": "cvsmith122"
            },
            {
                "raw_content": "They are all just buying each other's shares. This isn't going to end well.",
                "author": "Defeqel"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD signs AI chip-supply deal with OpenAI, gives it option to take a 10% stake",
        "score": 36,
        "text_content": "",
        "comments": [
            {
                "raw_content": "infinite money glitch, the bubble wont burst if they just keep buying from each other with the same money",
                "author": "Atretador"
            },
            {
                "raw_content": "Option to buy at 1¢ / share seems crazy to me. Do these kinds of deals normally discount the share price so far? The current price is $203. I just checked, AMD currently has 1.625 billion shares. 10% of that is 162.5 million, so OpenAI has the option to buy that for $1.625 million.",
                "author": "pythonwiz"
            },
            {
                "raw_content": "yay /s",
                "author": "Bagel_Bear"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD and OpenAI announce 6GW GPU deal, starting with MI450 rollout in 2026 - VideoCardz.com",
        "score": 22,
        "text_content": "",
        "comments": [
            {
                "raw_content": "AI is like a cancer, consuming all the resources; basically rip consumer market",
                "author": "BobsView"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "This more affordable AMD Ryzen 7 version is still a winner: HP EliteBook 8 G1a 14 laptop review",
        "score": 5,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "There Are 72% More Condo Sellers Than Buyers in the U.S.",
        "score": 602,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Florida condos are getting crushed. In some cases, 30% decline in price since 2022.",
                "author": "Brundleflyftw"
            },
            {
                "raw_content": "Perhaps one of the biggest turnoffs for condos is that, as a resident, you are *much* more beholden to the HOA and the risks of financial mismanagement.",
                "author": "kracklinoats"
            },
            {
                "raw_content": "We rent a condo right now and love it, so we considered buying one in the same complex. Right now we pay $2300/month in rent. If we bought the same unit with 20% down, monthly payments (mortgage+tax+HOA+insurance) would be around $3800/month- and prices seem to be falling, not rising. No thanks!",
                "author": "gremlincowgirl"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The Short-Term Rental Gold Rush Is Over",
        "score": 104,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Thank you, internet explorer, for this breaking news!",
                "author": "mattjouff"
            },
            {
                "raw_content": "Finally",
                "author": "WrongThinkBadSpeak"
            },
            {
                "raw_content": "#🍾🥂",
                "author": "Kaleidoscope_97"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Falling Rates Lead to Best Homebuying Affordability In 2.5 Years",
        "score": 51,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"in 2.5 years\" is funny because you can tell they pump out the exact same headline every single month. If rates went to the moon they'd still say \"Falling Rates Lead to Best Homebuying Affordability In 12 Hours\"",
                "author": "Shawn_NYC"
            },
            {
                "raw_content": "[removed]",
                "author": "None"
            },
            {
                "raw_content": "I just saw a 30y at 7%. What rates are they talking about?",
                "author": "Kitchen-Hat-5174"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "UCLA forecasts 'stagflation-lite' economy with higher inflation and unemployment",
        "score": 49,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Can we just have a fucking recession already? It fixes both of these problems, but there will be some short term pain. Recessions are a good thing. They shake out all of the imposters and allow new growth.",
                "author": "FarCommercial8434"
            },
            {
                "raw_content": "So forecasting something that is already happening",
                "author": "sifl1202"
            },
            {
                "raw_content": "Well, captain obvious is alive and well I see",
                "author": "VendettaKarma"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "A major market crash is imminent",
        "score": 0,
        "text_content": "A major market crash is imminent. Stock indices and real estate are closely correlated, and the global indices are encountering strong resistance around current levels. I believe this decline will be historic and extremely serious for the global economy. War will probably trigger the collapse.",
        "comments": [
            {
                "raw_content": "Spamming all the subs https://www.reddit.com/r/realestateinvesting/comments/1o06jpl/a_major_crash_is_imminent/",
                "author": "TheophrastBombast"
            },
            {
                "raw_content": "Forgot meds today?",
                "author": "CirclePlank"
            },
            {
                "raw_content": "is this resistance in the room with us? markets are at ATH show us your short positions",
                "author": "brothernature3r"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Introducing apps in ChatGPT and the new Apps SDK",
        "score": 164,
        "text_content": "The best announcement from today in my in my opinion.",
        "comments": [
            {
                "raw_content": "Reminds me of the ChatGPT plugins from the first dev day. Will be interesting to see if this sees more adoption",
                "author": "synap5e"
            },
            {
                "raw_content": "The pace that sota labs have been releasing things is crazy lately. I used to be able to keep up and try everything at least once, but not anymore. I feel like there are so many functionalities in ChatGPT, Gemini, etc., that I haven't even tried out yet despite being a Pro/Ultra subscriber.",
                "author": "ethotopia"
            },
            {
                "raw_content": "Can’t wait for the “THIS IS FUCKING HUGE THIS IS INSANE” comments in this sub for a few days then going back to “Has OpenAI lost their lead? These announcements are okay”",
                "author": "Prize_Response6300"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "ElevenLabs Community Contest!",
        "score": 7,
        "text_content": "$2,000 dollars in cash prizes total! Four days left to enter your submission.",
        "comments": [],
        "subreddit": "singularity"
    },
    {
        "post_name": "Neuralink participant controlling robotic arm using telepathy",
        "score": 228,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/tp7df3v5omtf1.png?width=250&format=png&auto=webp&s=0dcdf4f27d1d6f43e55a6b31e1450dfa0c4e51d1 soon",
                "author": "Intelligent_Tour826"
            },
            {
                "raw_content": "BCI interfaces like this open doors we can only begin to imagine. Right now they are read-only from the brain, but when we get the ability to write to it, that’s when things will get interesting. Incredibly immersive virtual reality will be possible",
                "author": "Jp_Junior05"
            },
            {
                "raw_content": "This is awesome! They're probably also getting closer to having controllable bionic arms/hands for amputees.",
                "author": "MonoMcFlury"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Figure CEO teasing something big this week: “This week, everything changes”",
        "score": 532,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Peak hypeposting Next week: announcing Shopify integration for robots",
                "author": "FakeTunaFromSubway"
            },
            {
                "raw_content": "\"Honestly everyone, the stuff I am seeing at the company I am CEO of, is like a Sci fi movie! If were some sort of invester I would just be throwing my money at me. Would you fuck me? I would fuck me.",
                "author": "DigitalRoman486"
            },
            {
                "raw_content": "expecting nothing",
                "author": "The_Scout1255"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Brett Adcock: \"This week, Figure has passed 5 months running on the BMW X3 body shop production line. We have been running 10 hours per day, every single day of production! It is believed that Figure and BMW are the first in the world to do this with humanoid robots.\"",
        "score": 1026,
        "text_content": "",
        "comments": [
            {
                "raw_content": "10 hours per day? For a robot? Those are rookie numbers, they gotta pump that up.",
                "author": "ElGuano"
            },
            {
                "raw_content": "Robot everywhere by 2035. I take the bet",
                "author": "Kathane37"
            },
            {
                "raw_content": "I prefer the artisanal quality of a real human placing a stamped metal component into a slot. Human suffering imbues products with an intangible goodness.",
                "author": "neggbird"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Figure seemingly teases new AI hardware behind frosted glass",
        "score": 143,
        "text_content": "Reminds me of the frosted glass teaser for F.03 seen in May: https://x.com/adcock_brett/status/1929207144823378336?s=46 Don't care what anyone says, I am hyped folks. Figure has so far been extremely promising also peep that human like gait in slow-mo.",
        "comments": [
            {
                "raw_content": "tbh....domestic humanoid robots would be far more disruptive as compared to GenAI cuz they won't be just confined to digital spaces....so even the blue collars would see the impact",
                "author": "gamingvortex01"
            },
            {
                "raw_content": "lol frosted glass is a reference to robocop teasing its appearance in the police station in the first movie",
                "author": "stuartullman"
            },
            {
                "raw_content": "The walk looks much much better compared to Figure 2. I think general public perception will really shift once these things stop walking like a 95 year old. Idk why everyone hates on figure, they make good stuff.",
                "author": "valewolf"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Sora just banned South Park videos because people were making full fake episodes",
        "score": 478,
        "text_content": "",
        "comments": [
            {
                "raw_content": "![gif](giphy|2GjgvS5vA6y08)",
                "author": "PixelMagier"
            },
            {
                "raw_content": "I’m surprised just how flagrant they’re being. Fun fact - celebrity and singer voices actually have stronger protection than regular copyright. They’re covered under “personality rights,” which safeguard a person’s voice, likeness, and identity. Those rights are much stricter than copy... if you use someone’s voice for a competing product, you’re almost guaranteed to lose in court. Really curious to see how this one plays out.",
                "author": "RoyalCities"
            },
            {
                "raw_content": "\"That sounds like a ponzi scheme\", \"no, its a trapezoid of opportunities\" Holy shit that was amazing ngl",
                "author": "fusionliberty796"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Lol",
        "score": 579,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lol. Lmao even",
                "author": "94746382926"
            },
            {
                "raw_content": "These accounting firms actually demand their auditors use AI for everything. Their year end goals actually measure how much AI they use, and the more the better.",
                "author": "BarrelStrawberry"
            },
            {
                "raw_content": "Lol, most of the big four works is done by overworked juniors who's work, in many cases, are not thoroughly verified. That's simply because of the sheer volume of work and continuous push to deliver more and faster. PWC, EY, Deloitte, KPMG - all the same. They don't care about quality, they care about pleasing the customer and renew the contracts",
                "author": "Blairephantom"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "need more GPUs to accelerate more...",
        "score": 362,
        "text_content": "",
        "comments": [
            {
                "raw_content": "When OpenAl says they're compute bottlenecked, you know the Al race is just getting started.",
                "author": "Shanbhag01"
            },
            {
                "raw_content": "1. Stop giving free access to your models at a loss 2. Stop spamming all social media with AI slop 3. Bottleneck gone, no more GPU demand Stochastic brute force problem solving is not intelligence.",
                "author": "Automatic-Pay-4095"
            },
            {
                "raw_content": "More GPUs or power grids?",
                "author": "RetiredApostle"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Google DeepMind introduces new AI agent for code security - Codemender, automatically finds and fixes code vulnerabilities, and has already submitted 72 high quality fixes in major open source projects (no public access yet, but it is coming)",
        "score": 425,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wonder if bots like this will be constantly ran in the future?",
                "author": "The_Scout1255"
            },
            {
                "raw_content": "Bot isn't going to prevent a data center employee from writing their admin password on a post it in full view of their webcam they use for Teams meetings.",
                "author": "DungeonsAndDradis"
            },
            {
                "raw_content": "Pffff another bot to delete my .env on github?",
                "author": "FoxB1t3"
            }
        ],
        "subreddit": "singularity"
    }
]