[
    {
        "post_name": "She'll need ICE for that.",
        "score": 826,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wots all this, then? Did a nutter get their piggies blown off?",
                "author": "Covidrrhea"
            },
            {
                "raw_content": "fingerbang",
                "author": "Stolen"
            },
            {
                "raw_content": "https://x.com/RealBrittHughes/status/2015823900328735041 Found it. slowed down she seems to have all her fingers, probably a nasty burn though.",
                "author": "MixedBlacknWhite"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Antifa be like",
        "score": 964,
        "text_content": "",
        "comments": [
            {
                "raw_content": "*golf clap* nice one",
                "author": "HappyFunBall"
            },
            {
                "raw_content": "The cop hating leftists who call everyone \"bootlicker\" are the same ones who praised the Capitol Police for J6 and called the cops on people and businesses who violated mask mandates and lockdowns during the Scamdemic.",
                "author": "TD_Covfefe_Crusader"
            },
            {
                "raw_content": "Its a human rights violation not to just allow communist insurgents attack federal officers",
                "author": "Cyber1776"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Use it.",
        "score": 924,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"Without probable cause...\" They are VIOLENT FUCKING RIOTERS. Nuff said. Crush them!",
                "author": "cjcivicx"
            },
            {
                "raw_content": "Long overdue!",
                "author": "realPhantomFuck"
            },
            {
                "raw_content": "Bring water cannons out!",
                "author": "ERIC_CIARAMELLA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Just 9 counties accounted for TWO-THIRDS of violent confrontations with ICE in America.",
        "score": 858,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://x.com/kevinnbass/status/2015716213603573854 The major cities in these top 9 counties are well-known: Chicago is at the top, with Brandon Johnson as mayor. Then, in order: Los Angeles (Karen Bass) Minneapolis (Jacob Frey) New York City (Zohran Mamdani) Portland (Karen Wilson) Then San Francisco, Seattle, Newark, and Denver",
                "author": "CounterStrike"
            },
            {
                "raw_content": "what are the per capita numbers?",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "A flaw in this analysis (and the 590x conclusion) is treating the 3,134 counties like ICE is in all of them. ICE is clearly in all of the 9 counties, but it is not in all of the 3,134.",
                "author": "WiseDonkey"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: SecWar Pete Hegseth just APPROVED a CBP request to use Fort Snelling in Minnesota as a forward operating base",
        "score": 1413,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The time for optics is over. Let's goooooo!",
                "author": "MythArcana"
            },
            {
                "raw_content": "So are we just trusting random nobodies on twitter again?",
                "author": "RedditStillSucks"
            },
            {
                "raw_content": "Kind of surprised they haven't been doing this already. ICE uses the base in my area. That doesn't stop people from harassing hotels.",
                "author": "billybaldwin2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The left is violent and unhinged.",
        "score": 1121,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's fine. He looks like the kinda guy who would give you a sore asshole after waking up from his anesthesia.",
                "author": "Herc130"
            },
            {
                "raw_content": "FAFO From Channel 12 News — Florida Attorney General James Uthmeier is ramping up his efforts to strip the licenses of Florida medical professionals over controversial social media posts, now setting his sights on a second nurse. Uthmeier announced Monday that he is targeting Miami nurse Erik Martindale for a permanent revocation of his nursing license. The move follows a since-deleted Facebook post allegedly written by Martindale, in which he stated he would refuse to provide anesthesia to MAGA members undergoing surgery, calling the decision both his right and an \"ethical\" choice.",
                "author": "TEXinLA"
            },
            {
                "raw_content": "He's an RN. I looked him up on NBCRNA and there's no record of him. So he's not a CRNA, and he can't 'perform' anesthesia. He's probably a circulator. The hospital should fire him, and he should probably be charged for impersonating a physician",
                "author": "itspancakees"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Rep. Anna Paulina Luna: I want to be crystal clear: if any individual, particularly elected officials or otherwise, helped plan, fund, coordinate, or cover up the violent insurrection happening now in Minneapolis, they should LAWYER UP NOW",
        "score": 1290,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Holy shit STOP ANNOUNCING IT. JUST DO IT.",
                "author": "NomadicKrow2"
            },
            {
                "raw_content": "They can’t. Airplane crash took out the lawyers.",
                "author": "Grindelwald"
            },
            {
                "raw_content": "FUCKING USELESS ANNOUNCEMENTS BECAUSE SHIT ISN'T HAPPENING. TITS OR GTFO",
                "author": "ciaramella_is_gay"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "They gonna be BIG MAD lol",
        "score": 1007,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Press Secretary said Bovino has the same job, but elsewhere. Now Tom Homan is in charge of MN. I see pundits saying Tom has a lighter touch. I feel like they both have the same strategy and one day Bovino will probably have Tom's job.",
                "author": "billybaldwin2"
            },
            {
                "raw_content": "The doomers were exceptionally fake and gay.",
                "author": "TrancePhreak"
            },
            {
                "raw_content": "If anyone in the Administration needs to be “reassigned” it’s Bondi.",
                "author": "BasedCostanza91"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "How did you know I was Somalian?",
        "score": 966,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lightbulb heads. So weird. Generations of inbreeding.",
                "author": "10MeV"
            },
            {
                "raw_content": "It was the 68 IQ.",
                "author": "MericaFukYeah"
            },
            {
                "raw_content": "That's the doordash. Someone ordered Bananas and Rice",
                "author": "DingleBalls"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "How did Ilhan Omar make millions from a 100% fake winery? This is insane. We investigated. Check this out…",
        "score": 1459,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Seriously? She's Muslim.",
                "author": "Tim_Berframer"
            },
            {
                "raw_content": "We have so many reasons to deport this bitch. Yet she’s still out there. Flaunting her fraud and abuse.",
                "author": "Filo76"
            },
            {
                "raw_content": "There is a joke in the wine industry, The fastest way to become a millionaire is to buy a winery as a billionaire.",
                "author": "Tunk"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I am pleased to report that Venezuela is releasing its Political Prisoners at a rapid rate, which rate will be increasing over the coming short period of time.",
        "score": 1292,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don't care about Venezuela, when will the commies in America be crushed?",
                "author": "Southboundanddown"
            },
            {
                "raw_content": "Nobody gives a shit. America first. I wish Trump would for once crack down on the domestic terrorists. Embarrassing.",
                "author": "Seeker_17"
            },
            {
                "raw_content": "*Tina Peters has entered the chat",
                "author": "sum1else"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "DEMOCRAT PARTY: GO AND FIGHT FEDERAL AGENTS",
        "score": 1396,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Staying home saves lives.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Soy Story in 3D.",
                "author": "MythArcana"
            },
            {
                "raw_content": "Same party that said to comply with Federal agents under Biden, Obama, Clinton, Johnson, Roosevelt etc.",
                "author": "starjello"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This train has no brakes",
        "score": 1506,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Shut it the fuck down. Keep hearing this dog and pony show every 6 months. Shut it down and keep it shut. These fuckers are useless anyways.",
                "author": "here2red"
            },
            {
                "raw_content": "As I said last time, at this point ICE is the only thing I actually want to fund.",
                "author": "ChrisSuperDude"
            },
            {
                "raw_content": "ICE operations *will continue.",
                "author": "Skogin"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🕌 NY Islamic Youth Center Director Vows: ‘Fight’ U.S. Gov., Military, ICE ‘To the Last Breath… Allah Will Replace You’ 👳🏽",
        "score": 1232,
        "text_content": "",
        "comments": [
            {
                "raw_content": "imagine any sane country tolerating this.",
                "author": "nolefthandshakes"
            },
            {
                "raw_content": "Deport kebab",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Another organization to add to the \"Domestic Terror\" list. Then shut them the fuck down with extreme prejudice.",
                "author": "Contra_Bombarde"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "100% get all of it",
        "score": 584,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The fact that billions are being stolen means there should be no taxation for any programs…… its worse than a bank with no security and the vault is open 24-7",
                "author": "Trooph-Hurts"
            },
            {
                "raw_content": "The entire diseased temple needs to be destroyed at local,state and federal . Replace with extremely vetted AF patriots to heal and fortify the Republic. It isn't going to be easy but must happen. MAGA AF ONLY",
                "author": "Mulletgunning"
            },
            {
                "raw_content": "I have said many times that fraud is in all 50 states.",
                "author": "Bots_Play_Here"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Kyle Rittenhouse has entered the chat...",
        "score": 681,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Rittenhouse brought a gun to protect himself from Left wing terrorists. The faggot in Minnesota brought a gun to BE a left wing terrorist. They are not the same.",
                "author": "RedditStillSucks"
            },
            {
                "raw_content": "The left thought they could use him to create a monster. They created a hero.",
                "author": "KuzoKevin"
            },
            {
                "raw_content": "Kyle didn't interfere with and assault police with a concealed weapon What a huge difference.",
                "author": "Wrexxis780"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Transtifa 'Kyle' Says He's \"On The Run\" After Urging Comrades To \"Get Your Fucking Guns.\" He says he needs a lawyer.",
        "score": 1274,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He looks like he sucks dicks for cab fare and then walks home",
                "author": "charliesean"
            },
            {
                "raw_content": "This is going to be the gayest civil war ever.",
                "author": "TheVanNuys"
            },
            {
                "raw_content": "FAFO…. again.",
                "author": "GaNative52"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Spring Cleaning at the Department of War is how we get more success.",
        "score": 1264,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We didn’t “win” because that wasn’t the goal.",
                "author": "ThisTrainHasNoBrakes"
            },
            {
                "raw_content": "The fake news and propaganda are completely off the charts with this one.",
                "author": "ConvergenceMan"
            },
            {
                "raw_content": "The headless ICE officer has a cat peeking through his jacket.",
                "author": "MrTexan"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Now Entering Minneapolis",
        "score": 1346,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# TOPCZECH!!!",
                "author": "CzechRepublic"
            },
            {
                "raw_content": "Minnesomalia has been a blue shithole for decades.",
                "author": "cjcivicx"
            },
            {
                "raw_content": "Minnadishu, Minnesomalia",
                "author": "MikeTruk"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Karoline Leavitt just confirmed that Commander Greg Bovino will CONTINUE storming across the country with Border agents in rounding up illegals, while Tom Homan becomes the point man in Minnesota. A hoax today was being spread around that Bovino was being fired.",
        "score": 661,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Some guy on YouTube posted a video and said Bovino was fired. And as usual, instead of waiting for the truth to come out, people blew a Gasket.",
                "author": "Landslide_2020"
            },
            {
                "raw_content": "OK guys and gals that posted the \"He's Fired\" and \"He's Removed\" messages, you can delete them now.. This shows how easy it is to get tricked by fifth column lies and reverse propaganda..",
                "author": "roadrunner0"
            },
            {
                "raw_content": "I heard another hoax today that Trump is making deals with Walz ... hoax ... right? 🙄",
                "author": "drmrboy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Micron plans $24-billion memory chipmaking plant in Singapore",
        "score": 114,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> Micron said the new investment to build an advanced wafer fabrication ⁠facility over the next ‌decade will help it meet growing market demand for NAND memory chips, fuelled by the rise of AI and ‍data-centric applications. > Wafer output is set to begin in the second half of 2028 > [...] The HBM chip packaging facility in Singapore is on track to contribute to supply in 2027, it added on Tuesday. > [...] Last week, Micron said it was in talks ‍to buy a ⁠fabrication site from Powerchip in Taiwan for $1.8 billion, that stands to boost its DRAM wafer output. The Taiwan story was in the [wsj](https://finance.yahoo.com/news/micron-buy-taiwan-plant-1-065800226.html).",
                "author": "Boreras"
            },
            {
                "raw_content": "Where are they going to put it? Under water?",
                "author": "Kinexity"
            },
            {
                "raw_content": "> Wafer output is set to begin ⁠in the second half of 2028 Honestly, that's awesome that they can get a new location going so fast.",
                "author": "J0hn-Stuart-Mill"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel Panther Lake Arc B390 performance and efficiency analysis: Intel's new iGPU trades blows with the Nvidia GeForce RTX 4050",
        "score": 28,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TLDR: \"The performance advantage over the previous Arc Graphics 140T/140V iGPUs is around 70%. The advantage over the smaller Radeon 800 series iGPUs of AMD Zen 5 is also considerably high (between 50-80% depending on the benchmark). Although the Strix Halo GPUs are even faster (but not more efficient), they operate at higher power limits. There are only a handful of corresponding devices on the market, which then are also quite expensive.\"",
                "author": "Antonis_32"
            },
            {
                "raw_content": ">and the two render slices each consist of six Xe cores. I assumed it was 3 slices, of 4 cores each. Is there a benefit to doing it this way, or does it not matter?",
                "author": "Forsaken_Arm5698"
            },
            {
                "raw_content": "Stop with these fake benchmarks. You will see when the benchmarks are not cherry picked, it will be no where near a 4050 lol. They had to gimp the poor 4050 all the way down to 30w, which I don’t even know how it even operates as such low wattages for the b390 to have a chance. The full wattage 4050 (100w+) is about as fast as a 3060 desktop, this tiny iGPU in real world gaming tests will be at most best case scenario as fast as a full powered 3050, which is still a massive 50-60% slower than a 4050 laptop.",
                "author": "Crap-_"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Tom Petersen: Intel has no plans for Strix Halo competitor, says AMD iGPU tech is “not that competitive”",
        "score": 259,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wasn't there a leak for Nova Lake AX a while back? [https://www.techpowerup.com/339014/intel-nova-lake-ax-specifications-surface-28-cpu-cores-48-xe3-gpu-cores-and-lpddr5x](https://www.techpowerup.com/339014/intel-nova-lake-ax-specifications-surface-28-cpu-cores-48-xe3-gpu-cores-and-lpddr5x)",
                "author": "Forsaken_Arm5698"
            },
            {
                "raw_content": "That's the right move, even if it's the safe/boring one. OEMs don't want Strix Halo. The adoption rate is abysmal, Panther Lake already has more laptops on launch than Strix Halo has a year later. The SoC is massive, massively expensive, and when consumers want higher end graphics performance they want Nvidia dGPUs or desktops. Strix Halo was a commercial flop, so why would Intel bother competing in a segment that has such low demand? It's not like Strix Halo was some miracle in engineering, with Intel's GPU and efficiency gains, they could one up it, but like Strix Halo it wouldn't sell well.",
                "author": "siazdghw"
            },
            {
                "raw_content": "And if they had, he wouldn’t be allowed to to confirm them.",
                "author": "sascharobi"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "RTX 5090 pricing spikes – 55% increase",
        "score": 371,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is it a spike if it never comes back down?",
                "author": "PJBuzz"
            },
            {
                "raw_content": "I'm switching hobbies to basketweaving",
                "author": "TehBeast"
            },
            {
                "raw_content": "2026 might even be worse for buying GPUs than the COVID mayhem 2020 and 2021",
                "author": "MrPayDay"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Dave2D] Windows is ruining new laptops",
        "score": 274,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The worst is the CoPilot key. You have to download Powertoys to remap it.",
                "author": "IdoCyber"
            },
            {
                "raw_content": "Microsoft's Copilot+ PC program really makes no sense. In order to qualify for the Copilot+ sticker, you need an NPU of sufficient power. You see, the copilot app itself is just ChatGPT - It even tells me that the current version is just GPT 5.1. None of this is actually run on your device. So what does the NPU actually do? Based on my understanding, it is only used at the moment for 3 things: Cocreator in Paint, Live Captions, and Webcam effects. Well, the thing is, all three features have been implemented before without the NPU, like, we were blurring our backgrounds on Zoom with our CPUs and GPUs. So why does Microsoft force CPU companies to dedicate a big chunk of their silicon space to this? It makes no sense, say, the Intel integrated GPU can do exactly what their NPU can do! Well, as it turns out, Microsoft's justification is that an NPU is more efficient, and consumes less power. But like, does it really make sense to dedicate chip area to marginally reducing power consumption in literally 1 of 3 things..... Edit: Look at this photograph [https://www.techpowerup.com/img/xASpu58JP7LpKqhb.jpg](https://www.techpowerup.com/img/xASpu58JP7LpKqhb.jpg) Lunar Lake's NPU is bigger than the E core cluster and almost as big as the P cores! The NPU does 48 TOPS, while the GPU does 67 TOPS. Why use the NPU when you can just use the GPU? You're giving up that much chip area for a little bit of power savings on 3 things?",
                "author": "Uptons_BJs"
            },
            {
                "raw_content": "I have been anti-Apple ever since I learned how to build my own PC, the Athlon 64 X2 days. Through iPhones and MacOS and iPads and various other releases, I have always scoffed and believed that DIY or the competition offered more performance and more freedom. It's now almost been a year since I bought a Macbook Air M4. I'm now seriously considering getting a Mac Mini or Studio to replace my Windows desktop for music production and other productivity. And I have been eyeing the iPhone 17 as a daily device alongside my Razr. All because of Microsoft and Google's utter incompetence and lack of respect for the user. My HP Envy with an 8640HS had issues that were probably HP's fault, like crackling audio no matter what I did (external DAC even), but Windows 11 on it and my music production and coding machine was fucking intolerable. AI this, AI that, please re-enable OneDrive, broken search, broken right-click menu, just constantly getting in the way. And Pixels are a straight ripoff for the prices they're asking. So here I am. A lifelong PC / Windows / Android enthusiast, now with more than half of my devices in the Apple ecosystem. Because of Windows 11 and Google.",
                "author": "wankthisway"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung reportedly plans to more than double 1Q26 NAND flash prices",
        "score": 420,
        "text_content": "",
        "comments": [
            {
                "raw_content": "For a second I read \"production\" instead of \"prices\". Silly me...",
                "author": "DeHub94"
            },
            {
                "raw_content": "What’s hilarious is that hundreds of billions in datacentres will never be able to find the memory or ssds to complete their build out. In essence sitting on hundreds of billions of NVIDIA AI cards that depreciate to nothing in 3 years. Oh boy what a miscalculation.",
                "author": "sentrypetal"
            },
            {
                "raw_content": "god please cheap ssds when this bubble finally pops 🙏",
                "author": "mujhe-sona-hai"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Wired] Intel Panther Lake Is the Answer to Apple Silicon We’ve All Been Waiting for",
        "score": 235,
        "text_content": "~~Woopsies. Will probably be taken down soon idk, but it's a Wired article so don't expect Geekerwan/Notebookcheck lvls of quality~~ [~~https://imgur.com/a/jynuew5~~](https://imgur.com/a/jynuew5) Embargo is today, Wired was just a tiny bit early",
        "comments": [
            {
                "raw_content": "Honestly, from the early benchmarks, this genuinely looks very impressive. Apple does seem to leave them in the dust in Single Core, but they seem to actually have closed the MT efficiency gap a good bit (not reached there yet, but it's closer than before). So yeah, good job Intel! Still kinda salty about Gelsinger being kicked out early, since Panther Lake's development and execution largely came under him.",
                "author": "SmashStrider"
            },
            {
                "raw_content": ">The Core Ultra X9 388H really has room to breathe in the newer reference version I tested; its gaming performance is really impressive. Cyberpunk 2077 can hit a comfortable 55 frames per second (fps) at native medium graphics settings—and that's without any upscaling and frame generation. That's solid for a laptop not marketed for gaming at all. Wow.",
                "author": "hardware2win"
            },
            {
                "raw_content": "Here's hoping. Getting Windows to play nice will be key to that, they need to ensure there is no issues with sleep etc that have plagued windows laptops for so long. On paper the performance looks excellent however, it's clearly a very good chip and if Intel can keep prices under control it should be popular. Unfortunately the RAM price silliness is going to make that difficult.",
                "author": "jenny_905"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Exclusive: Intel Arc Pro B65 and B70 both feature 32GB memory, with 20 to 32 Xe2 cores configurations",
        "score": 54,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">Both Arc Pro B70 and Pro B65 are based on the BMG-G31 GPU, which is now confirmed. The memory configuration is also the same. Both cards are said to feature 32GB of GDDR6 on a 256-bit bus. The main difference is GPU core configuration. [...] >Based on conversations we have had, it appears Intel has put the gaming variant on hold, possibly to see how the memory market develops. This does not look promising for anyone expecting a near-term launch. The longer the delay, the less sense a release makes.",
                "author": "PorchettaM"
            },
            {
                "raw_content": "Another day, another exclusive BMG-G31 leak…",
                "author": "sascharobi"
            },
            {
                "raw_content": "Hello PorchettaM! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel Panther Lake Core Ultra X9 388H performance analysis - Outpaces Arrow Lake and exceeds Zen 5 in efficiency",
        "score": 122,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Very good results. Intel said that Panther Lake would have the performance of Arrow Lake with the efficiency of Lunar Lake, and that's exactly what they delivered. Performance and efficiency in multicore is even better than both. Still the gap in single-core with Apple is so large, I doubt Intel and AMD ever can come close.",
                "author": "mmcnl"
            },
            {
                "raw_content": "Is there a U series of these chips planned? Would be neat to see that vs lunar lake if/when they ship.",
                "author": "KnownDairyAcolyte"
            },
            {
                "raw_content": "Oh bummer, I didn't realise that the core ultra X (with the fancy iGPU) only supported LPDDR. My sense then is that the non X series which support SODIMM would still have a weaker iGPU than equivalent AMD chips which support SODIMM?",
                "author": "DueAnalysis2"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Finally got a Switch 2!",
        "score": 95,
        "text_content": "Got everything pictured plus a screen protector and SD card, the pro controller is freaking insane.",
        "comments": [
            {
                "raw_content": "Congrats! You're in for a great ride",
                "author": "CartoonistBeginning6"
            },
            {
                "raw_content": "Congrats!",
                "author": "100YearsRicknMorty"
            },
            {
                "raw_content": "I’ve been waiting for you to finally get one!",
                "author": "dope415"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Thank you to the guy from FB Marketplace🙏",
        "score": 87,
        "text_content": "What a beaut! Now I have to decide if I want to sell my OG switch... I am very excitedly waiting the Tomodachi life announcement as well as NS2 update patches for FE Engage and 3H. Also, given that I like Zelda and Fire Emblem, is Final fantasy another good series to get into? That remake looks gorgeous and I think it may be time for me to get into FF🤩",
        "comments": [
            {
                "raw_content": "Cost?",
                "author": "Purple_Calendar3919"
            },
            {
                "raw_content": "It’s actually credit card fraud. Someone buys the system on credit, you pay cash, then reports card stolen. You see it with legos a bunch.",
                "author": "Motor-Committee4042"
            },
            {
                "raw_content": "Sure it wasn’t stolen?",
                "author": "VaughnFry"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Walmart Site Promotes Switch Online with Pikmin 2 and Metroid Prime 2 (Coming Soon?)",
        "score": 106,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wouldn’t surprise me. Metroid prime 2 would be a great addition",
                "author": "Pokeguy211"
            },
            {
                "raw_content": "metroid prime 2 might actually edge me to get the expansion pack",
                "author": "Either-Razzmatazz848"
            },
            {
                "raw_content": "Pikmin 2 is weird because they sell a switch port of it on the eshop...",
                "author": "Mullet2000"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Final Fantasy 7 Remake Part 3 won’t switch to Unreal Engine 5 - KitGuru",
        "score": 74,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's actually huge because it means its way more likely to be able to run on switch 2 if its still using UE4 which is switch friendly. FF7 remake which is a brilliant port btw uses UE4 same with rebirth.",
                "author": "Avelion2"
            },
            {
                "raw_content": "It's important to note that they use a heavily modified UE4. It has plenty of features they built for themselves and it still looks great. And more importantly doesn't have the many MANY known performance issues that still plague UE5. Square Enix aren't fools. They already knows what happens to your games if you use an unoptimized engine... It's why they abandoned their in-house luminesce engine.",
                "author": "SnooPets1826"
            },
            {
                "raw_content": "More UE4 forward is generally good news for Switch 2. I doubt we'll ever see anything UE5 running properly for a while.",
                "author": "Medd-"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Final Fantasy 7 & Express card",
        "score": 269,
        "text_content": "Because the game is so big, I needed the express card",
        "comments": [
            {
                "raw_content": "Don’t forget to move other stuff and put the game on the system, a couple of seconds faster loading times.",
                "author": "k4rst3n"
            },
            {
                "raw_content": "FYI for anyone looking and needs a card. I just got a Sandisk Express 512GB for $45 shipped on Mercari. They are all over there for $45-50.",
                "author": "ChesswiththeDevil"
            },
            {
                "raw_content": "how much it cost?",
                "author": "Bleachr_"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Direct Bingo - It's that time of the year again",
        "score": 231,
        "text_content": "As er NateTheHate, February Direct is just upon us and this sub is probably about to get water buffaloed real hard again. I just remembered a bingo done by my girlfriend. I think she's onto something!",
        "comments": [
            {
                "raw_content": "Please just give me switch 2 editions of Xenoblade Chronicles 1-3 🥺",
                "author": "Schnaki"
            },
            {
                "raw_content": "Looks very reasonable, only thing that I don't think will happen anytime soon is Smash 6. But I'd love to be completely wrong on that",
                "author": "Rynelan"
            },
            {
                "raw_content": "I always throw all my money in to bet on Mario Maker 3.",
                "author": "OfficialNPC"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "nNate Drake says E33 coming to S2, Metaphor ReFantazio too, FFXVI being considered, more Yakuza/LaD. (RUMOUR)",
        "score": 357,
        "text_content": "Tbh all of these were pretty much expected but nice to have a confirmation from a reliable insider.",
        "comments": [
            {
                "raw_content": "Metaphor would be fantastic",
                "author": "lingering-will-6"
            },
            {
                "raw_content": "I hope E33 has a nice Switch 2 port and a physical copy similar to Cyberpunk 2077. It would be day one for me despite owning it on the PS5 already.",
                "author": "Loose_Society9485"
            },
            {
                "raw_content": "E33 devs had already said quite a while ago that they were considering bringing it to switch 2 so that's not new, but I do really hope it happens",
                "author": "Broad-Extent4445"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "NatetheHate: \"The first Nintendo Direct of the year will be on the first week of February\"",
        "score": 291,
        "text_content": "[He mentions the 5th February but hasn't confirmed that with his best sources, but all his contacts said the first week of Feb](https://www.youtube.com/watch?v=JwMQiG9bc4c)",
        "comments": [
            {
                "raw_content": "Did they mention general direct or it could be a partner direct?",
                "author": "Caciulacdlac"
            },
            {
                "raw_content": "So next week? Nice (Also how the hell is january over already?)",
                "author": "Financial-General163"
            },
            {
                "raw_content": "So we are around two weeks away? Amazing",
                "author": "Thin_Molasses_2561"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "New NSO games leaked via Walmart.com promo material",
        "score": 343,
        "text_content": "[https://www.walmart.com/brand/nintendo/10030719](https://www.walmart.com/brand/nintendo/10030719) [https://advertising.walmart.com/thunder/assets/media-service/wcnp-prod/images/a2362b7d-13d8-4a75-93c6-a2aa4d4dadbf/bf4a1d73-f07a-4958-865c-4e9984e34f1b-optimization.jpeg](https://advertising.walmart.com/thunder/assets/media-service/wcnp-prod/images/a2362b7d-13d8-4a75-93c6-a2aa4d4dadbf/bf4a1d73-f07a-4958-865c-4e9984e34f1b-optimization.jpeg) Metroid Prime 2 bros... It may be over... Though at the same time, Pikmin 2, despite getting a (much less impressive) remaster is also in the banner.",
        "comments": [
            {
                "raw_content": "Hilarious that they keep introducing new Gamecube NSO games when the initial slate of games announced aren't even all out yet",
                "author": "KMoosetoe"
            },
            {
                "raw_content": "Very curious as to if they’ll replace the textures in Pikmin 2 or not. I know it sounds silly, but the remaster got rid of all the product placement.",
                "author": "KeybladeBrett"
            },
            {
                "raw_content": "And still no sign of Donkey Kong 64...",
                "author": "Arcade_Gann0n"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "GTA 6 physical copies delayed",
        "score": 867,
        "text_content": "\" This person, who sells physical video game releases in Europe, informed us that the publisher of Grand Theft Auto VI - Take-Two - is currently not planning a boxed edition of Lucia and Jason's story. Or at least not for the premiere due to possible leaks of history or materials from the game. According to the first, unconfirmed information, GTA 6 will first debut in a digital version on consoles, and only after some time will the production appear in a physical edition. \" Rumour comes from Graczdari who claimed FlightSim 2024 was coming to PS5. [GTA 6 and the boxed version. Sellers herald sad news for fans of physical releases](https://www.ppe.pl/news/397290/gta-6-a-wersja-pudelkowa-sprzedawcy-zwiastuja-smutna-wiadomosc-dla-fanow-fizycznych-wydan.html)",
        "comments": [
            {
                "raw_content": "Games go gold like a month before release lol. I feel it’s literally impossible to have this information especially from rockstar, 10 months before release Edit: If Tom says its true its true!",
                "author": "Spheromancer"
            },
            {
                "raw_content": "No way they don't have physical copies ready for christmas",
                "author": "duendifiednlovingit"
            },
            {
                "raw_content": "please don't put gta 6 and delayed in the title ever again ![gif](giphy|YZOsKxJfmvzG0)",
                "author": "ExcitementMotor5521"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Jeff Grubb: February State of Play will be the week of February 12th",
        "score": 582,
        "text_content": "From today's Game Mess Mornings [(at roughly 18 minutes into the episode)](https://www.youtube.com/live/mlcItW4xnec?si=CAgcYR4SZN3i_SFx&t=1089): > So this got people to go ask Nate the Hate, \"hey is there gonna be a Playstation State of Play in February? We've heard that, is that true?\" And he says \"Yes it is.\" And yeah, I agree, it is. It's happening on February 12th. Uh, so there you go. I guess it's probably always safe to say the week of February 12th. Um, yes, that's right, the week of February 12th is what I should say. 'Cuz that's a Monday*, could happen on any of the days there. *will note Jeff says February 12th is a Monday, but it's actually a Thursday. I would guess he glanced at this month's calendar when he said that, since January 12th IS a Monday",
        "comments": [
            {
                "raw_content": "#Jeff Grubb is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Feels like a while since the last Grubb post on here",
                "author": "ChiefLeef22"
            },
            {
                "raw_content": "That date is correct.",
                "author": "NatetheHate2"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "NatetheHate: \"The first Nintendo Direct of the year will be on the first week of February\"",
        "score": 772,
        "text_content": "[https://www.youtube.com/watch?v=JwMQiG9bc4c](https://www.youtube.com/watch?v=JwMQiG9bc4c) He mentions the 5th February but hasn't confirmed that with his best sources, but all his contacts said the first week of Feb",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Finally Nate confirmed what we’ve all been waiting for",
                "author": "Loose_Society9485"
            },
            {
                "raw_content": "Not expecting very much, just the new 3D Mario, next Zelda sequel, Zelda Remasters for Twilight Princess and Wind Waker, DK Bananza 2, and Metroid 5. Just the basics.",
                "author": "SoldierPhoenix"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Nate the Hate says Expedition 33, Metaphor: ReFantazio, and Final Fantasy XVI will come to Switch 2",
        "score": 508,
        "text_content": "https://www.youtube.com/watch?v=JwMQiG9bc4c \"Titles like Expedition 33 will be coming to Switch 2 in 2026.\" \"Other games that I've heard of will include Atlus with Metaphor Refantasio will be coming to Switch 2 in 2026.\" \"Another game from Square Enix that I've heard is under consideration. And I don't know if it'll necessarily come out this year, but I wouldn't be surprised if it's announced this year is Final Fantasy 16.\"",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Metaphor was pretty much guaranteed. All that is left to know is in what state.",
                "author": "Medd-"
            },
            {
                "raw_content": "Nate: Another game from Square Enix that I've heard *is under consideration.* And I don't know if it'll necessarily come out this year, but I wouldn't be surprised if it's announced this year is Final Fantasy 16. Reporting: Final Fantasy XVI **will** come to Switch 2 . . .",
                "author": "NoMoreVillains"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Sony State of Play coming this February, according to NateTheHate",
        "score": 834,
        "text_content": "https://xcancel.com/NateTheHate2/status/2015679942957138341 \"Hello there is a state of Play in February?\" \"There will be, yes.\"",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Isn't this common practice for Sony at this point? Or my memory is serving me poorly?",
                "author": "Lz537"
            },
            {
                "raw_content": "Would they announce a new game? We don’t know what Bend Studio, Cory Barlog or Bluepoint are doing yet",
                "author": "FromChicago808"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Billbil-kun: WWE 2k26 launching March 13, 2026 with a Switch 2 release on the same day.",
        "score": 143,
        "text_content": "Physical versions are planned for PS5/XSX and Switch 2 (code in box) Uncertain on PS4/Xone releases. https://www.dealabs.com/magazine/wwe-2k26-switch-2-plateformes-date-de-sortie-ce-que-lon-sait-60917",
        "comments": [
            {
                "raw_content": "Nice! I’ve really enjoyed 25 on Nintendo Switch 2. I’ll get 26 for Nintendo Switch 2 as well",
                "author": "Greatsnes"
            },
            {
                "raw_content": "wwe2k25 is by far one of the best third party ports on the switch 2, it's the only sports game that came out last year to actually hit 60fps, all the time that being said, shiver entertainment (subsidiary of nintendo) handled the port, and i don't want them to be permanently saddled with wwe2k porting jobs for whole generation; but at the same time, if shiver isn't handling it and visual concepts handles it inhouse, wwe2k26 could end up running much worse on switch 2 pretty exciting overall but i'm a little cautious as how to this'll turn out",
                "author": "TiocStudios"
            },
            {
                "raw_content": "i wonder why they just don’t go for key cards instead of code in box?",
                "author": "cheemsboi69028"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Kiki Talks estimates the red dead 2 next gen update won't come until late 2027.",
        "score": 384,
        "text_content": "[https://xcancel.com/kiwitalkz/status/2015682416929841531#m](https://xcancel.com/kiwitalkz/status/2015682416929841531#m)",
        "comments": [
            {
                "raw_content": "I know game development takes an insane amount of time now but like, it took late 2027 for an upgrade to an 8 years old game!?",
                "author": "SaberDevil2021"
            },
            {
                "raw_content": "Atp keep the fuckin game bro. Idc anymore.",
                "author": "RockRik"
            },
            {
                "raw_content": "After gta 6 would definitely be a choice.",
                "author": "Emergionx"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Panther Lake Arc B390 performance and efficiency analysis: Intel's new iGPU trades blows with the Nvidia GeForce RTX 4050",
        "score": 19,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Will panther lake pc CPU's have this kinda powerful igpu?",
                "author": "jonasrm_21"
            },
            {
                "raw_content": "Stop with these fake benchmarks. You will see when the benchmarks are not cherry picked, it will be no where near a 4050 lol. They had to gimp the poor 4050 all the way down to 30w, which I don’t even know how it even operates as such low wattages for the b390 to have a chance. The full wattage 4050 (100w+) is about as fast as a 3060 desktop, this tiny iGPU in real world gaming tests will be at most best case scenario as fast as a full powered 3050, which is still a massive 50-60% slower than a 4050 laptop.",
                "author": "Crap-_"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel Panther Lake Core Ultra X9 388H performance analysis - Outpaces Arrow Lake and exceeds Zen 5 in efficiency",
        "score": 42,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Arrow lake HX is in a different league compared to this wdym? This barely breaks the 20k mark in cinebench, but the 275hx gets into the 40k scores which is literally desktop perf.",
                "author": "Crap-_"
            },
            {
                "raw_content": "Recently bought 275hx pretty happy overall. Nice to see Intel genuinly having their Ryzen moment with Ultra chips as they progress, amazing efficienct and graphics for ultra light machines, fingers crosses whatever come form nova lake will blast.",
                "author": "onframe"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel Core Ultra 300 “Panther Lake” reviews are here: CPU and iGPU gains analyzed",
        "score": 85,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nova lake will be a beast.",
                "author": "Top_Information3534"
            },
            {
                "raw_content": "I wonder why the big youtube channels didnt release anything about these new chips, i guess theyre waiting for the official release tomorrow ?",
                "author": "thesenut91123"
            },
            {
                "raw_content": "Someone could extrapolate hypothetical Novalake performance from these. It is definitely going to beat Zen 5 by a good chunk but it needs to be substantial really. Like 30%+ to move the needle in high-end desktop mindshare. Like a proper generational leap that zen 6 is unlikely to match.",
                "author": "EmilMR"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Asus ZenBook Duo UX8407 convertible review - Intel Panther Lake is a game-changer",
        "score": 20,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It’s a bit alarming that the first laptop intel let people review a 99.9 whr strange form factor device I’m hoping the more standard x7 normal whr laptops (like the new xps 14) don’t disappoint because I’ll be in the market a few months from now",
                "author": "etherbound-dev"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel’s Tom Petersen says Intel has no Strix Halo rival planned, questions AMD iGPU efficiency",
        "score": 38,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Intel's been down this road before. It's not worth it. 14900HX is the only reminder you need. How fast does it need to be before we start talking about just putting a GPU in? If I'm getting a laptop why would I get a power hog collapsing star? It's called mITX.",
                "author": "EmmerichVibiana"
            },
            {
                "raw_content": "Let's just wait for products to hit, maybe Intel is going to hit it out of the park, but they have a long way to go before I will trust their marketing slides. AMD is no better in that regard, I'm not just shitting on Intel. In all honesty, I'm pretty happy Intel is doing better on the iGPU side, cause it was so bad for so very long. My laptop is currently an i7-1185g7, not their best showing, but was a step in the right direction on the iGPU side. Not anything I would have bought brand new, but being a refurbisher in my spare time has perks. My laptop is always 3-6 years old.",
                "author": "Tower21"
            },
            {
                "raw_content": "From what I've seen today on reviews, they really trade blows at different TDP ranges. I'm yet to see benchmarks that come out with the 70 something percent gains Intel claimed.",
                "author": "DrKrFfXx"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel Is BACK — Panther Lake Changes Everything",
        "score": 53,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And Windows@ARM is gone",
                "author": "Careful-Ad-3343"
            },
            {
                "raw_content": "Can't wait for the Panther Lake X9 Ultra + RTX 4050 pairings!",
                "author": "The_Zura"
            },
            {
                "raw_content": "A super long wait for the budget 3 series segment.",
                "author": "skylinestar1986"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Asus Zenbook Duo (2026) review: Premium Panther Lake",
        "score": 9,
        "text_content": "",
        "comments": [],
        "subreddit": "intel"
    },
    {
        "post_name": "About ”Official ASUS statement on recent ASUS AMD 800-series motherboard and AMD Ryzen 9800X3D concerns\"",
        "score": 151,
        "text_content": "I saw the news about ”Official ASUS statement on recent ASUS AMD 800-series motherboard and AMD Ryzen 9800X3D concerns\" I am currently using ASUS ROG B850F ​​​motherboard. My motherboard is currently running BIOS version 1028 (2025/04/30) and I’m not facing any problems at all. In the latest BIOS release notes, it says that the new BIOS version cannot be rolled back to previous versions. Should I still update my BIOS to the latest version as a precaution? ALSO, is this issue limited only to the Ryzen 7 9800X3D, or does it affect non-X3D Ryzen CPUs as well? What steps can I take to prevent this kind of problem?",
        "comments": [
            {
                "raw_content": "Good thing the 9850x3d just came out, surely that wont push the limits further right?",
                "author": "glizzygobbler247"
            },
            {
                "raw_content": "At this point, I think there’s something wrong with the 9800x3d, not necessarily the motherboards",
                "author": "supershredderdan"
            },
            {
                "raw_content": "It is specifically the 9800x3d that's the problem. Any other AM5 chip should be fine.",
                "author": "CarsonWentzGOAT1"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD preparing Ryzen 7 9850X3D, DDR5 memory and CPU cooler bundles",
        "score": 243,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "A bundle where the most expensive part is RAM, not CPU + CPU Cooler.",
                "author": "spajdrex"
            },
            {
                "raw_content": "The DDR5 modules look remarkable. 😅 Are they even real?",
                "author": "sascharobi"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Homebuyers Are Canceling Deals at the Highest Rate on Record",
        "score": 551,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Under contract for a house right now, on the verge of cancelling because the seller will not provide solar contract. So stupid.",
                "author": "Signal-Work-1425"
            },
            {
                "raw_content": "Its interesting because 1) it follows the same trend as 2024 so it seems we'll have another year, probably even more so, of price declines in many places. 2) Looks like this is undoing that \"bump\" in sales that was reported a few weeks back.",
                "author": "mlody11"
            },
            {
                "raw_content": "We've seen around our neighborhood (Colorado) several homes that were delisted in Oct/Nov/Dec are now coming back on the market. About half are priced lower than when the listings were pulled last year. (Median home price here is $1.5mm.) I can see how buyers might think it's worth waiting to see if prices continue trending downward over the coming months.",
                "author": "cortedorado"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Miami Overtakes New York as the Major U.S. City With the Most $1 Million Homes as Wealthy Buyers Head South",
        "score": 89,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The article says Miami has the most $1M homes that are “for sale”. Not the most $1M homes total…",
                "author": "ShortFinance"
            },
            {
                "raw_content": "Misleading bullshit story. Orders of magnitude more wealth in NYC and the NYC metro compared to Miami. Some may lie and claim Florida residency, but New York has a team whose sole work is finding those people committing residency / tax fraud.",
                "author": "burner456987123"
            },
            {
                "raw_content": "Miami is locked in terms of growth at this point, it can't expand any more than it has because of the Everglades and the ocean. Guess what happens when we can't build and people still want to live somewhere? Also, the headline is misleading, it's that Miami has the most million dollar homes FOR SALE.",
                "author": "projektvertx"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "FHFA’s Pulte Quietly Changed GSE Portfolio Limits to Aid $200 Billion Mortgage Bond Purchase -- an estimated $170 billion increase in bond purchases",
        "score": 6,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Let the inflation rip",
                "author": "2starsucks2"
            },
            {
                "raw_content": "But FHFA can't print money. So to buy bonds, it has to be allocated the money by Congress (or it has to generate the money). I don't think this means as much as people thought it did.",
                "author": "BaluZana"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "More Gen Zers are Buying Homes. But It’s a Trickle, Not a Flood.",
        "score": 0,
        "text_content": "",
        "comments": [
            {
                "raw_content": "None of this is true. 38% of 28 year old Gen Z owns a home.. sure. Who comes up with this BS? There was another survey that mentioned 33% of 30 year olds own a home",
                "author": "phantomfires1"
            },
            {
                "raw_content": "wow 1% and .5% percent gains...lets celebrate.",
                "author": "GreenGardenTarot"
            },
            {
                "raw_content": "And some Gen Z are 13 years old….",
                "author": "OwnLadder2341"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Kimi K2.5 Released!!!",
        "score": 189,
        "text_content": "New SOTA in Agentic Tasks!!!! Blog: [https://www.kimi.com/blog/kimi-k2-5.html](https://www.kimi.com/blog/kimi-k2-5.html)",
        "comments": [
            {
                "raw_content": "Poor Qwen 3 Max Thinking, it's going to be overshadowed again by Kimi 2.5...",
                "author": "sammoga123"
            },
            {
                "raw_content": "How cherry picked are these benchmarks? I mean, is it really better than Gemini 3 most of the time. Seems crazy if so!",
                "author": "Inevitable_Tea_5841"
            },
            {
                "raw_content": "The agent swarm is fascinating. If anyone gets the opportunity to try it, please share your experience. Based on my preconception that the swarm is 100+ instances of the model being directed by one overseeing instance, I’m assuming it is going to be incredibly expensive. I hope that this is somehow one model doing all these tasks simultaneously, but that’d be a major development. Scaffolding makes more sense to me.",
                "author": "skinnyjoints"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "CATL, the world's largest battery maker, launches sodium batteries: extremely durable, stable at –40°C, much cheaper than lithium (5x), safer,10,000 charge cycles, requires no nickel or cobalt...",
        "score": 1707,
        "text_content": "This is the breakthrough that takes electric cars global. Not only is sodium far more abundant than lithium, being dramatically cheaper is crazy. From lithium's $100 per kwh to sodium's $20 per. So what's the drawback? Has to be one, right? Sodium is heavier than lithium. So people had thought that sodium battery chemistry might be constrained to grid scale batteries and stationary systems. But these power density figures are comparable to mid level lithium ion. And the cell does not require nickel or cobalt either. It uses a hard carbon electrode and prussian-blue cathode. The challenge now becomes scaling up the supply, and it's only going to get better from here. Big day for batteries.",
        "comments": [
            {
                "raw_content": "wow, surprised they're going in vehicles already, I assumed they would be for things like houses where energy density and weight are less important.",
                "author": "JoelMahon"
            },
            {
                "raw_content": "Desalination + this, seems like we can power the world and clean water?",
                "author": "bdavid21wnec"
            },
            {
                "raw_content": "Are they selling commercially or only to trade? Can I buy a battery pack for my home directly, or do I need to wait for them to partner up with third party vendors? These are insane numbers, I can't believe it is touching LiFePO4 for performance, and at that price.",
                "author": "randomrealname"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Andrej Karpathy on agentic programming",
        "score": 469,
        "text_content": "It’s a good writeup covering his experience of LLM-assisted programming. Most notably in my opinion, apart from the speed up and leverage of running multiple agents in parallel, is the atrophy in one’s own coding ability. I have felt this but I can’t help but feel writing code line by line is much like an artisan carpenter building a chair from raw wood. I’m not denying the fun and the raw skill increase, plus the understanding of each nook and crevice of the chair that is built when doing that. I’m just saying if you suddenly had the ability to produce 1000 chairs per hour in a factory, albeit with a little less quality, wouldn’t you stop making them one by one to make the most out your leveraged position? Curious what you all think about this great replacement.",
        "comments": [
            {
                "raw_content": "karpathy's conclusion is exactly what the OpenAI executives were talking about a few days ago where they said 2026 is about user adoption. there is a capability overhang and most people are not actually accessing the full potential of it.",
                "author": "imlaggingsobad"
            },
            {
                "raw_content": ">The \"no need for IDE anymore\" hype and the \"agent swarm\" hype is imo too much for right now. The models make wrong assumptions on your behalf and just run along with them without checking. They also don't manage their confusion, they don't seek clarifications, they don't surface inconsistencies, they don't present tradeoffs, they don't push back when they should, and they are still a little too sycophantic. As every logical person has been saying. >I’m just saying if you suddenly had the ability to produce 1000 chairs per hour in a factory, albeit with a little less quality, wouldn’t you stop making them one by one to make the most out your leveraged position? When you're on the hook for quality (refunds, fixing things, reputation damage), the \"quantity over quality\" approach becomes less attractive. If producers had to \"give money back for every broken chair,\" you'd probably see more careful, selective use of AI rather than flooding everything with volume.",
                "author": "YakFull8300"
            },
            {
                "raw_content": "This is a programmer-centric perspective on the impact of AI. Let's step back a bit. Many programmers work in a larger context, with product managers, user interface designers, data scientists, program managers, salespeople, digital artists, etc. And, ultimately, there are customers, the people who will use whatever the programmers create. Here's a question that interests me: within that larger context, one group of people-- programmers-- are suddenly accelerating by like 10x. So what are the consequences for the larger ecosystem? We're going to find out in 2026, and I think it will be... stressful. For example, when coding something took a year, folks working on artwork, the user interface, product specifications, etc. could reasonably take a few months. But now programmers can deliver in a week. So product development time pressure will intensify on people in those other roles: \"PLEASE just pick a UI by the end of \\*today\\*, so AI can code the application over the weekend, and we can ship the product on Monday...\" What was previously delivered in months will now be demanded in days or hours. As a special case, how customers deal with acceleration is an open question. Complex applications have a learning curve, so there is a limit to how fast people can absorb new software. Some software packages roll out UI changes over years, because coding takes time and customers have to adapt. But what if that messy UI in Blender (or whatever) could, in principle, be rewritten as fast as it could be designed? Now customers learning to use the new UI is the bottleneck.",
                "author": "elehman839"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "crazy accurate 2027 prediction",
        "score": 536,
        "text_content": "",
        "comments": [
            {
                "raw_content": "All you noobs reading this on screens when I have it directly ported to my optic nerve via Apple IBall.",
                "author": "DungeonsAndDradis"
            },
            {
                "raw_content": "Literally nobody in general public know about claude (believe or not)",
                "author": "chlebseby"
            },
            {
                "raw_content": "I am wearing the Grokplug",
                "author": "awesomedan24"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Dario Amodei shots fired at xAI and Elon Musk",
        "score": 323,
        "text_content": "https://www.darioamodei.com/essay/the-adolescence-of-technology",
        "comments": [
            {
                "raw_content": "I love Dario but it shows great cowardice that he is able to call out Grok illegal sex art, but he cannot call out his own company's partnership with Palantir, who has a contract with ICE where they are managing deportations. His priorities are way off. Yes, Grok illegal sex art is horrible, but directly assisting an administration who is actively murdering citizens is far worse. Claude will gladly refuse to generate you a sex story because it's \"unethical,\" but Claude is eager to assist in ICE raids and missile strikes.",
                "author": "Neurogence"
            },
            {
                "raw_content": "CEO of one AI company criticizes other AI companies. Oh dear goodness, what a revelation.",
                "author": "ponieslovekittens"
            },
            {
                "raw_content": "He's absolutely correct!",
                "author": "krullulon"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Microsoft says its newest AI chip Maia 200 is 3 times more powerful than Google's TPU and Amazon's Trainium processor",
        "score": 316,
        "text_content": "",
        "comments": [
            {
                "raw_content": "3 times more powerful at doing *what*?",
                "author": "RagnarokToast"
            },
            {
                "raw_content": "Every one of their chip reveals (Maia, Majorana1), have had to be walked back or in the case of Majorana basically walked all the way back from total hype and hyperbole. I don't believe it for a moment because of the track record and the fact that hardware isn't something that one magically gets catapulted to pole position over remarkably capable technical teams that have been doing it for over a decade.",
                "author": "marlinspike"
            },
            {
                "raw_content": "https://preview.redd.it/n3tbxkt11rfg1.png?width=535&format=png&auto=webp&s=39171291fa66ae64bf497373ea17e2934b62b7fc",
                "author": "avion_subterraneo"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Dario Amodei — The Adolescence of Technology",
        "score": 199,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Dario mentions this, especially in the follow-up tweet about the importance of maintaining democracy, but the implication that a few incredibly powerful people will basically control the entire economy and we are at the whim of their potential benevolence is so fucking chilling and it seems likely that it will go badly.",
                "author": "lost_in_trepidation"
            },
            {
                "raw_content": "He is not exaggerating. He said 50 million geniuses 10-100x faster than humans within two years (end of 2027). Anthropic already has 30 million users and Claude Opus 4.5 is already at least 10 times faster than humans, and smarter than most humans in many ways. It just makes weird mistakes. It is just lacking in robustness of reasoning. There is no reason to expect that the rapid progress will halt. We should expect it to continue to become more robust, faster, etc. Also, he is not making these essays primarily as advertisements. He is genuinely concerned about the lack of understanding and responsible and reasonable planning by society and government. We either get blind AI hate or complete lack of concern or foresight.",
                "author": "ithkuil"
            },
            {
                "raw_content": "Claude is definitely becoming the new Apple, but in AI/ML",
                "author": "cantonspeed"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Qwen3-Max-Thinking",
        "score": 254,
        "text_content": "https://qwen.ai/blog?id=qwen3-max-thinking",
        "comments": [
            {
                "raw_content": "Who came up with the idea of using grayscale for this graph?",
                "author": "Important-Farmer-846"
            },
            {
                "raw_content": "Qwen, i love y'all but for the love of god STOP USING THE EXACT SAME MODEL NAME ON MULTIPLE RELEASES. This is the second (or third?) time they have released a model named Qwen 3 Max Thinking",
                "author": "ihexx"
            },
            {
                "raw_content": "What's the explaination for TTS having better results ? Edit : So... It's seems TTS here stand for test-time scaling and not text-to-speech. I was confused lol",
                "author": "Zemanyak"
            }
        ],
        "subreddit": "singularity"
    }
]