[
    {
        "post_name": "The Supreme Court owns all this chaos. From enabling the halt of the AEA to pussyfooting the use of the president’s deployment of the National Guard to protect federal buildings/officers.",
        "score": 544,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Invoke the Insurrection Act. Crush this Leftist Violence. The time for finger-pointing is after the smoke clears.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Alien Enemies Act (AEA) for those scratching their head. The law would have allowed the deportation of Venezuelan migrants without sufficient due process.",
                "author": "Bastard"
            },
            {
                "raw_content": "As we learned in 2020, rioting works. We also learned who the traitors are on SCOTUS. cough John Roberts cough",
                "author": "GallowsTime"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Mortgage Rates Dropped Below 6% For the First Time in 4 Years",
        "score": 544,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Cool now do housing prices",
                "author": "Genericwhitemale"
            },
            {
                "raw_content": "Wish he would get to the mass deportations",
                "author": "EstadosUnidosPrimero"
            },
            {
                "raw_content": "Let's be frank what's happening here. Trump is adding $200 billion to the national debt to bail out the housing market and prop up prices. This is not a win. This will directly pile on more inflation and more misery.",
                "author": "ConvergenceMan"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Congratulations, Minneapolis. You genuinely deserve more pointless destruction. It’s what you voted for, and I hope you’re proud of it.",
        "score": 552,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It’s very simple. The mayor and the governor are out there giving their approval for this stuff by what they say. Until there are real consequences, and I mean real ones this will continue. Let’s see if Trump learned this lesson from his first term. You arrest anyone funding and organizing this stuff. You charge them under rico laws or even better you take the people who have openly advocated for sedition and treason and you charge them with these crimes in the military system.",
                "author": "militantnationalist6"
            },
            {
                "raw_content": "flown-in antifa?",
                "author": "Calumet57"
            },
            {
                "raw_content": "Unfortunately Minneapolis probably didn't. When you can have one person 'vouch' for eight others and there is no verification; you're f'ed. And when the state, county, and municipal government prostrate themselves before those that exploit that to the exploiter's benefit. You're exponentially f'ed. And that is exactly what has happened in every sanctuary city. *Governments have betrayed their own citizens to retain power*",
                "author": "Tikk"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Biden DEI Judge Arun Subramanian just unilaterally BLOCKED President Trump from defunding childcare in 5 blue states due to fraud He was hailed as the \"first South Asian American judge\" confirmed to the SDNY. Third world street shitter trying to make the rules.",
        "score": 528,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Arun Subhuman needs to be deported.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Nice Star Wars name. Definitely a heritage American sounding name.",
                "author": "wharfthrowaway"
            },
            {
                "raw_content": "Start arresting these foreign commie judges and stop the fraud.",
                "author": "ColonelKlink"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This account from a Venezuelan security guard loyal to Nicolás Maduro is absolutely chilling: \"it was a massacre. We were hundreds, but we had no chance. They were shooting with such precision and speed... it seemed like each soldier was firing 300 rounds per minute. We couldn't do anything.\"",
        "score": 110,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don’t believe a single word of this sensationalist propaganda",
                "author": "Schiffblower"
            },
            {
                "raw_content": "It might be propaganda, but I love it. I know the sonic weapons do exist. I didn't see anything about hundreds of them being killed.",
                "author": "OnlyTrump20"
            },
            {
                "raw_content": "Sounds super fake and made up",
                "author": "VeryFinePerson84"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "RFK Jr Bringing the Bants!",
        "score": 895,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I love this timeline and this administration!",
                "author": "GuerillaYourDreams"
            },
            {
                "raw_content": "2028 is gonna be lit.",
                "author": "FatigueIsReal"
            },
            {
                "raw_content": "We will never see things like this ever again. Phenomenal.",
                "author": "DRK00"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump is capping interest rates at 10% for the year",
        "score": 1150,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's my President.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "I certainly agree that credit card rates are high but it really is an unsecured debt so given the risk is high... Edit: The risk would be a lot lower if they didn't give them to illegals blacks women and 16 year olds.",
                "author": "SanityGumby"
            },
            {
                "raw_content": "Good, Now Credit card companies and stop giving credit card to people who cant pay it off......",
                "author": "Not_The_CIA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "TRUMP: For my next trick, I'll make the Democrats side with Credit Card companies!",
        "score": 1112,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is that considered usury?",
                "author": "tpactionchasethevote"
            },
            {
                "raw_content": "You need to pay your fair share of interest to the credit card companies.",
                "author": "knnbccb"
            },
            {
                "raw_content": "Credit card interest used to be tax-deductible until the 1980. Why not do that again?",
                "author": "BrianOfNazareth"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: MINNEAPOLIS POLICE SURRENDER TO ANTI-ICE RIOTERS AFTER OFFICERS ATTACKED They have now RUN AWAY and ABANDONED the area which has been TAKEN OVER by leftist anarchists",
        "score": 801,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Now it's time to invoke the Insurrection Act. They will leave, dead or alive.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Ohhhhh! Another CHAZ garden. That shit was hilarious!",
                "author": "Pelosi_Halitosis"
            },
            {
                "raw_content": "After forces roll through and clean up the mess, every officer in the precinct needs to be rounded up and drummed with charges of treason. Highest degree. Including stripping of citizenship. Can work, live, eat, breathe, and die in a limestone quarry. They had an oath to uphold, and a job to do. They have defied both, and will eternally be branded as cowardly failures.",
                "author": "UncleRicoAct"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Iranian civilians set fire to mosques in the nation's capital — calling for the end of the regime's authoritarian, Islamic theocracy.",
        "score": 922,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I have some Iranian friends in Atlanta, GA. They tell me this is the end of the regime.",
                "author": "Patriot3TX"
            },
            {
                "raw_content": "Needs to happen here",
                "author": "Cc1005"
            },
            {
                "raw_content": "Quickly! Set fire to mosques in Britain to show solidarity and support!",
                "author": "Mcrumples"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: THOUSANDS of leftist degenerates are making endless EARDRUM-SHATTERING NOISE outside a hotel in Downtown Minneapolis thinking they’re keeping ICE awake. But I have bad news for them…ICE IS NOT STAYING HERE 🤣 Great job, idiots! A for effort! 😂😂",
        "score": 832,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# Time for a SONIC DISRUPTOR to be deployed **Eeeeeeeeeeeeeeeeeee!!!!**",
                "author": "TrumpYouMagaFrenulum"
            },
            {
                "raw_content": "This is so utterly retarded I’m at a loss for words.",
                "author": "AndanteAndante"
            },
            {
                "raw_content": "Same people who made fun of the truckers.",
                "author": "TimoSalami"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "US Oil and Gas Association with the burn.",
        "score": 1239,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Imagine trying to go get oil from woke Canada and their green energy religion. NO way it's easier.",
                "author": "Choppermagic"
            },
            {
                "raw_content": "From what I recall, US oil companies already had wells, refineries and so on in Venezuela before it was taken by Hugo when Maduro was VP. If I heard correctly, they weren't using VZ for USA, they were using it for South America. Someone can correct me if I'm wrong.",
                "author": "billybaldwin2"
            },
            {
                "raw_content": "I'm pretty sure it was US oil companies who originally invested and built so much infrastructure that the incompetent commies stole and let fall apart. It shouldn't take long to fix it up and get it working again. It either goes to the US or Russia/China and anyone who doesn't want it going back to the US is a Russian or Chinese operative.",
                "author": "OnlyTrump20"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "CNN’s Campbell: Looks Like ICE Agent ‘Likely Struck by That Car’, But Question Is if He Could Have Jumped Away",
        "score": 652,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Remove the licenses from mockingbird media",
                "author": "MeMargie"
            },
            {
                "raw_content": "Also CNN: Nicole Simpson was likely stabbed by OJ, but question if she could have just jumped out of the way of the knife.",
                "author": "ToniBahloni"
            },
            {
                "raw_content": "“You’re not allowed to defend yourself even if you’re being attacked.”",
                "author": "Easzq8"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Reported!",
        "score": 753,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# D E P O R T",
                "author": "DogPilledMAGA"
            },
            {
                "raw_content": "It went from cocky to crushed in about 10 seconds. I just hope the doggo is okay.",
                "author": "BlackJack1776"
            },
            {
                "raw_content": "She thinks she's a man. Tries to act like one. Silly stupid dyke, you can pose all you want, but all you have is an act because the second you want to step up to a real male and get down, you're gonna get knocked the fuck into next year. So keep playing like you're a man, you silly lesbian.",
                "author": "MemphisMontoya71"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Damn straight",
        "score": 1347,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Temporarily hire 1 million ICE agents. If there's 30-50 million illegals in America, and each agent catches one illegal a day, all the illegals would be gone in less than 2 months. Call it Operation: GTFO --- **According to Brave Search it would only cost $18.29 billion to hire 1 million ICE agents for 2 months, which is a bargain** To estimate the cost of temporarily hiring 1 million ICE agents for 2 months, we must consider current salary ranges, bonuses, and benefits offered under recent recruitment drives. As of early 2026, the U.S. government has been actively expanding ICE with financial incentives, which provides a reliable baseline for cost modeling. Based on current data, ICE agent salaries range from $49,739 to $89,528 annually, with additional incentives such as $50,000 signing bonuses, $60,000 in student loan repayment, and performance-based pay. These figures are critical for estimating a large-scale temporary hiring effort. The base annual salary for ICE deportation officers currently starts at $49,739, with potential increases due to location, overtime, and seniority—reaching up to $89,528 or more for experienced agents. For a 2-month temporary role, prorating the minimum annual salary gives: 2 months of base pay = ~1/6 of annual salary → $49,739 ÷ 6 ≈ $8,290 per agent For 1 million agents, base pay alone would total: → 1,000,000 × $8,290 = $8.29 billion However, recent recruitment campaigns include substantial bonuses: Up to $50,000 signing bonus per agent Up to $60,000 in student loan repayment (likely not applicable for short-term hires) If a $10,000 pro-rated incentive (reflecting a fraction of the full signing bonus) were offered to attract temporary recruits, that adds: → 1,000,000 × $10,000 = $10 billion Thus, total estimated cost (base pay + incentive) = $18.29 billion --- [I don't have a Truth account, but those that do, Trump should definitely see this. Would be a game changer. Democrats would bitch that 18.29 billion is too much, when they've spent far more on nonsense, like California’s delayed and massively overbudget high-speed rail project \"CHSRA blew through nearly $7 billion in taxpayer funds over a decade & a half without laying a single foot of track, according to the Department of Transportation, which notes the projected cost of the project has since risen to $135 billion.\"](https://nypost.com/2025/07/16/us-news/trump-terminates-federal-funding-for-californias-135b-high-speed-rail-boondoggle/)",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "Wish me luck guys im staying true to my name and driving 7 hours to a hiring event for ICE in Tampa on Monday. Pray I get selected i need good work and want to return to serving my nation.",
                "author": "alphabet_agency"
            },
            {
                "raw_content": "\"We'll have our home again.\" This chokes me up.",
                "author": "abstain"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Minnesota Trail",
        "score": 724,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Man, wouldn't that be something. Decapitated by a wagon. How do we make this happen?",
                "author": "WeIfare_Warmongers"
            },
            {
                "raw_content": "Shamelessly borrowed: https://x.com/CarpeDonktum/status/2009767211187990878",
                "author": "BoberFett"
            },
            {
                "raw_content": "He fought the law and the law won.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🍿I laughed. I cried. I supported ICE🍿",
        "score": 805,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Memes this fire are proof that we are on the right side of history.",
                "author": "bfett81"
            },
            {
                "raw_content": "I laughed at the retard. I cried at the Retardation. I grabbed my balls and spat. Welcome to Bensonhurst, motherfucker!!",
                "author": "blitzstrasse"
            },
            {
                "raw_content": "Faggot Retard Poe",
                "author": "IncredibleMrE1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "That's the spirit",
        "score": 1211,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not only obstruction but also accessory and harboring fugitives.",
                "author": "boreal_storm"
            },
            {
                "raw_content": "This is the cool Nick-F.",
                "author": "Repentnow"
            },
            {
                "raw_content": "They don't seem to understand what comes next if they make fixing things peacefully impossible.",
                "author": "RedPillosopher1776"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A literal fucking MEME!!!: BREAKING: A federal judge ruled that the Trump administration cannot block federal money for child care and other social service funding to five states for now.",
        "score": 789,
        "text_content": "",
        "comments": [
            {
                "raw_content": "SCOTUS had a ruling on this about 6 months ago. This is a virtue signal. The plaintiffs have to prove why the funds need to be started again. The admin does not have to prove anything here. By Law they are the executor of the funds and can met them out as they see fit within the current law. Suspected fraud is in the law and it clearly states that the Executive can halt funding until investigations are completed. If no fraud found, the money has to start flowing again.",
                "author": "Badfinz_FL"
            },
            {
                "raw_content": "The judge is \"Arun Subramanian.\" Fucking Star Wars names",
                "author": "Thatunknownguy"
            },
            {
                "raw_content": "How many Feral, I mean, Federal, judges, did Lincoln arrest again?",
                "author": "FUSnowflake"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "1,000 additional Border Patrol agents are scheduled to surge Minneapolis very soon, per DHS sources including a senior official. There's currently about 2k agents on the ground. DHS is sharply placing its focus on MSP. Border Patrol tells us more immigration agents free up HSI investigators t",
        "score": 1111,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No disaster funding when the fags burn down their own city",
                "author": "itspancakees"
            },
            {
                "raw_content": "Based. Plz take out more liberal white karens too",
                "author": "Seeing_Red"
            },
            {
                "raw_content": "10x it. We need to flood the zone.",
                "author": "raptormissle"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Valve just dropped a massive hint that the Steam Deck 2 could switch to Arm — here's why",
        "score": 32,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It won’t, there are no viable arm SOCs to make it worth it. Unless they magically get Apple to make one. Qualcomms GPUs suck, their drivers are bad and they don’t support any advanced gpu features. I could however see some of the smaller brands like ayaneo making an arm handheld that runs SteamOS though.",
                "author": "sittingmongoose"
            },
            {
                "raw_content": "If that's a hint toward anything, it would be a new handheld that's on the level of steam deck 1 or weaker. Steam Deck 2 is a different level than what's possible. What would be the point of that, probably something much more portable.",
                "author": "FierceDeityKong"
            },
            {
                "raw_content": "People discussing the topic like if the console is announced to be released in a few months. With the actual panorama We can expect another 2-4years before we grt the SD2",
                "author": "Gyswu"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nvidia could delay the RTX 5000 Super series indefinitely as AMD offers no 2026 competition",
        "score": 416,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Given the increased RAM costs a Super refresh would only make sense if existing sales were being impacted by consumers demanding more VRAM.",
                "author": "dparks1234"
            },
            {
                "raw_content": "*\"Somehow, this is AMD's fault.\"*",
                "author": "kikimaru024"
            },
            {
                "raw_content": "Why do so many people think nvidia cares about anything AMD does? Even if AMD released something do people really think nvidia would act on that? There was never a super series announced. The real problem is modern media and how they make money. Tech media needs stuff to talk about and interest is high. There are a lot of self proclaimed leakers who conveniently present new \"leaks\" on a schedule. In reality, they can make up whatever they want. Even the \"best\" get like 40-50% of their broader claims right. But in their story, they're never wrong. If they said something that didn't happen they blame some company for that. That's their business model.",
                "author": "Jumpy-Dinner-5001"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[News] TSMC Reportedly Plans Mature-Node Tool Shift to Singapore, Accelerates Exit as Arizona Expands",
        "score": 29,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Are they diversify away from Taiwan? Or they were forced to move?",
                "author": "jwang274"
            },
            {
                "raw_content": "Mature Node seeks experienced Asian benefactor for long term financial arrangement",
                "author": "scene_missing"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung and SK Hynix are jacking up DRAM prices by as much as 70 percent",
        "score": 9,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel Panther Lake with Arc B390 takes on AMD Ryzen Strix Halo and GeForce RTX 4050 in our first gaming benchmarks",
        "score": 9,
        "text_content": "> Our comparison shows that the Intel Arc B390 can exceed the gaming performance of the AMD Radeon 890M by more than 80% in some games. Compared to the older Arc 140T, the Arc B390M is nearly 80% faster in certain titles. In Baldur's Gate 3, the iGPU delivers virtually the same performance as the dedicated Nvidia GeForce RTX 4050 Laptop GPU, but in Cyberpunk 2077 the Nvidia graphics card is 20% faster. AMD’s powerful Ryzen AI Max+ 395 with Radeon 8060S is twice as fast at times, although the chipset is also larger, more expensive and less power efficient.",
        "comments": [
            {
                "raw_content": "Hello Balance-! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "I think the ideal would be to get to a point where the flagship \"mainstream\" iGPUs (-H series, for Intel) compete with Nvidia's contemporary x50 GPUs, and then have big iGPU chips (Strix Halo, NVL-AX?) to compete with x60+ level.",
                "author": "Exist50"
            },
            {
                "raw_content": "Solid product, nice foundation. Improve ST and intel will comfortably keep their mobile market",
                "author": "NeroClaudius199907"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "SanDisk to double price of 3D NAND for enterprise SSDs in Q1 2026 — hyperscalers to pay top dollar for storage as AI continues to roll",
        "score": 220,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Everyone to pay top dollar. It's not like the NAND used in enterprise drives is different to high performance consumer ones, it's coming off the same lines.",
                "author": "jenny_905"
            },
            {
                "raw_content": "This is not sustainable lol. The more expensive hardware will be the higher the return Ai needs to be. It's impossible to be profitable if you're paying a 300-400%× increase for basic commodies. If the returns and the services aren't there, hyper scalers essentially wasted billions because the next generation of memory will be exponentially better. That doesn't mean Ai is useless though, it would they over invested too soon.",
                "author": "frogchris"
            },
            {
                "raw_content": "Then start taxing hyperscalers to a point where they feel financial pain.",
                "author": "nonaveris"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[TweakTown] Minisforum BD395i MAX motherboard at CES 2026: built-in AMD Strix Halo APU, use your own GPU",
        "score": 44,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don't see the point unless you really need an AI machine that can also game better? Get an X3D chip on AM5 if you're going with a dGPU.",
                "author": "kikimaru024"
            },
            {
                "raw_content": "Come to papa. So basically we just need to add a mini-itx case and power supply.Let's hope they don't go too crazy with pricing.",
                "author": "fatso486"
            },
            {
                "raw_content": "Jesus Minisforum, I just got finished paying for Christmas gifts",
                "author": "Slasher1738"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Thunderobot Launches ZERO Air Gaming Laptops with Intel Panther Lake at CES 2026 [TechPowerup]",
        "score": 39,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What the absolute fuck, this title is absolutely terrible lol, most confusing title I’ve seen in a while. It’s not that Thunderobot is not using Panther Lake, launching 0 models with the processor. They launched a new line of laptops using Panther Lake called ZERO…..",
                "author": "Uptons_BJs"
            },
            {
                "raw_content": "No pricing? Panther lake seem promising, and if it can get microsoft to fix up random OS level issues, I can see intel getting a bit of a centrino moment in the laptop space. Maybe intel can borrow a page from qualcomm's book and do something about the poor quality cam and mics often found in mobile devices.",
                "author": "_Lucille_"
            },
            {
                "raw_content": "damn, a 15 inch laptop that only weighs 1.58kg which brands usually sell Thunderobot's laptops? really hope they sell the Air....",
                "author": "LastChancellor"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "QNAP introduces blazing-fast QXG-100G2SF-BCM dual-port 100GbE network card",
        "score": 30,
        "text_content": "So 100GbE networking is trickling down into SOHO and homenetworking. Just a shame that it's based on Broadcom and not NVIDIA chips. But this still uses old 25G signalling per lane. Are we to see products that actually use newest 100G signalling or is this that we are ever going to see ?",
        "comments": [
            {
                "raw_content": "For the low low price of $1000",
                "author": "L3R4F"
            },
            {
                "raw_content": "Not many people are running home setups that could take advantage of that sort of thing. More useful maybe something like an updated 10GbE SFP+/NVMe m.2 PCIe combo card as their current offering is RJ45.",
                "author": "ProfessionalPrincipa"
            },
            {
                "raw_content": "I’m a little curious to see what kind of people want/need this? Video production places I can maybe see. Curious to see who else uses them?",
                "author": "guzhogi"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "While we're sharing mockups, I made a quick and simple version of the Pro controller in SNES colours. Thoughts?",
        "score": 2270,
        "text_content": "",
        "comments": [
            {
                "raw_content": "First mockup / concept I am actually happy to see :)",
                "author": "Designer-Flow-6332"
            },
            {
                "raw_content": "Release this right now!",
                "author": "FitRing2383"
            },
            {
                "raw_content": "https://preview.redd.it/3kmva8vsdbcg1.jpeg?width=1024&format=pjpg&auto=webp&s=f6a6a07aa1f9245b10b6dcdfcb462f1802e025ed Fixed the colours, now working on a USA mockup!",
                "author": "caristeej0"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Any hatsune miku fans? I would love a specially edition like this",
        "score": 136,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Me! Me! Would love those to be real",
                "author": "FIFTY_PES0"
            },
            {
                "raw_content": "Ooo, can the inner part that slots into the switch have the light grey from her shirt?",
                "author": "Untitled_One-Un_One"
            },
            {
                "raw_content": "Im not that big of a fan at all, but I love the colors, and would buy this so fast",
                "author": "Sisera_"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Larian confirms Baldur's Gate 3 port on Switch 2 is NOT happening: \"we would have loved to but it's wasn't our decision to make.\"",
        "score": 383,
        "text_content": "Source, the AMA from today: https://www.reddit.com/r/Games/comments/1q870w5/comment/nylkog6/?context=3",
        "comments": [
            {
                "raw_content": "That's so unfortunate :(",
                "author": "Gleerok99"
            },
            {
                "raw_content": "They’ve been pretty clear they’re done with BG3, they don’t own that IP. If anything it was a great job to get more eyes on their own series, which I actually prefer. Fun to play outside the D&D ruleset a bit",
                "author": "cuntpuncherexpress"
            },
            {
                "raw_content": "I have an XBSX and PS5 but really wanted BG3 to be on Switch 2. I struggle to commit to huge games that I can’t take with me on the go, so I’ll have to pass on it which really sucks.",
                "author": "Toribobs"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "As requested, a mockup with the SNES USA controller colours on the Switch 2 Pro Controller",
        "score": 535,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'd buy that !",
                "author": "PAUL_DNAP"
            },
            {
                "raw_content": "![gif](giphy|TdwziQPhbNAzK)",
                "author": "Lufia_2_GOAT"
            },
            {
                "raw_content": "Yep, I'd insta-buy that for sure.",
                "author": "F34RTEHR34PER"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Pokemon Legends ZA Switch 2 Edition Concept!",
        "score": 259,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Would buy joycons like those!",
                "author": "Phos-Lux"
            },
            {
                "raw_content": "Im so afraid of future designs like this cause lord knows I won’t buy a 2nd switch just for how it looks but I sure as hell would want it",
                "author": "Rare_Ad_3871"
            },
            {
                "raw_content": "https://preview.redd.it/hcweao3yuecg1.jpeg?width=4032&format=pjpg&auto=webp&s=07b48f2cc3aa23e865afe5c8b8d6436d7f829416 I did this lol",
                "author": "pippinchu"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Baldur's gate 3 is NOT coming to switch 2",
        "score": 181,
        "text_content": "https://i.ibb.co/KjqpHM9Y/Larian.webp This debunks past rumors Sorry for the people who were excited for it",
        "comments": [
            {
                "raw_content": "All this tells us is that Larian, who have already been kicked off the series (sadly), will not be involved IF it happens.",
                "author": "junglespycamp"
            },
            {
                "raw_content": "What this shows is that these porting decisions are not really ‘can game x run on switch 2’ decisions but much more complex business decisions with lots of factors like IP ownership and development resource availability at their heart. They are also incredibly case by case so each game is a different story. Sounds like Larian will be supporting switch 2 going forwards which is great.",
                "author": "ShotAcanthocephala8"
            },
            {
                "raw_content": "https://preview.redd.it/a66l84f8gdcg1.jpeg?width=1080&format=pjpg&auto=webp&s=2778e50a184029ead2f61713a428c3c038ffea99 It's sad but at least the next Divinity game will be ported to Switch 2.",
                "author": "VannofThursday"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "why would they do this",
        "score": 227,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Because at least some of us smiled or laughed when we saw it.",
                "author": "twovles31"
            },
            {
                "raw_content": "https://preview.redd.it/f7kcnstzddcg1.png?width=400&format=png&auto=webp&s=db3b03659e8288e0ffd0ef3ff102b0ea18301ecc",
                "author": "rosalinagloom"
            },
            {
                "raw_content": "Because it’s funny",
                "author": "Frittenfett87"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Prefer playing 3rd party on my switch 2",
        "score": 60,
        "text_content": "Does anybody else have more fun playing 3rd party games on the switch 2? I have a ps5 and find myself not enjoying playing any games on it anymore. I can boot up the same game on my switch and it just feels more fun idk.",
        "comments": [
            {
                "raw_content": "Played Cyberpunk and Outlaws which was good Yakuza 0 next",
                "author": "B0bcat5"
            },
            {
                "raw_content": "I can relate. I have a ps5 pro and ps portal. They have their place, but idk on the handheld side the native experience on switch 2 just looks and feels better to me. The ps portal’s artifacts on screen are hard to ignore when things are in motion despite higher performance on some games, but eh. The seamlessness from handheld to docked mode is another thing that the other combination can’t replicate. When I play games on the pro the graphics and performance are undeniably superior, but yeah Nintendo just has that fun factor I don’t get from anything else I own.",
                "author": "No_Improvement4560"
            },
            {
                "raw_content": "Only for Switch 2 editions tbh, otherwise the drop of quality is too noticeable VS Xbox or PS5 tbh",
                "author": "Wasilisco"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "❄️Discussion, News, and Request Thread - Week Beginning 01/05/26❄️",
        "score": 47,
        "text_content": "[Kadoosh, Kadoosh, Kadoosh...](https://pbs.twimg.com/media/G-NNK5lXsAAD9uA?format=jpg&name=medium) Discussion threads are your weekly central hub for all requests, gaming news, and any other gaming topics you want to talk about. *Please keep all content that doesn't need it's own post to this thread to de-clutter the sub for proper leaks and rumors. Thanks!* **Join our new companion sub for super secret Resident EVIL 9 and Half-Life 3 leaks** \\-- [r/OkBuddyGLAR](https://new.reddit.com/r/OkBuddyGLAR/) Hot Threads of the past week: * [Microsoft eyes major January layoffs (between 11k-22k roles) as AI costs rise — Reports from workers point to Azure cloud teams, the Xbox unit, and global sales as key areas of focus.](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1q6712z/microsoft_eyes_major_january_layoffs_between/) * [NVIDIA to announce DLSS 4.5 tomorrow, with “Dynamic Multi Frame Generation” & “2nd Gen Transformer Model”](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1q4lrva/nvidia_to_announce_dlss_45_tomorrow_with_dynamic/) * [New Vegas remake planned.](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1q6h3fh/jez_new_vegas_remake_planned/) * [Potential GTA 6 plot leak](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1q775cn/potential_gta_6_plot_leak/) * [Fallout 3 Remaster is a planned release](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1q6fi7t/natethehate_fallout_3_remaster_is_a_planned/) # [Want to help us improve this subreddit? ](https://forms.gle/w9JaYTjVN1Zie9e39)[Provide us with feedback here](https://forms.gle/w9JaYTjVN1Zie9e39)[!](https://forms.gle/w9JaYTjVN1Zie9e39) # [Click here to join the discord to enjoy further conversations with the community!](https://discord.gg/6jdBvCSqbj)",
        "comments": [
            {
                "raw_content": "Just want to say I am so excited about fable, I remember looking at rumors back in 2018 about a possible reboot !",
                "author": "CartographerOk4564"
            },
            {
                "raw_content": "i rlly hope Stranger Than Heaven is this year",
                "author": "ZEKE307"
            },
            {
                "raw_content": "Really hope for any news about ac black flag remake soon",
                "author": "Objective_Love_6843"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[NateTheHate] Larian would love to port Baldur's Gate 3 to Switch 2 but it's not happening due to \"not healthy relationship with Hasbro/Wizards of the Coast\"",
        "score": 856,
        "text_content": "Source: https://xcancel.com/NateTheHate2 >This is the unfortunate truth. >While Larian would love to bring Baldur's Gate 3 to the Switch 2... their relationship with Hasbro/Wizards of the Coast is not healthy. >Late last year, I heard BG3 for SW2 was not happening; but needed more sources to verify.",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Have to click on the link to see what Nate is referencing, but the primary source is Larian themselves, from their Reddit AMA: https://www.reddit.com/r/Games/comments/1q870w5/comment/nylkog6/",
                "author": "Yamcha_is_dead"
            },
            {
                "raw_content": "Swen confirmed the was no BG3 Switch 2 port coming, but he didn't really say why. Nate added \"their relationship with Hasbro/Wizards of the Coast is not healthy.\" It depends on how you take the \"not healthy\" part, but it may imply there was more tension behind the scenes, rather than a mutual parting of ways.",
                "author": "VistaVick"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Fable is in development for PS5",
        "score": 643,
        "text_content": "https://www.videogameschronicle.com/news/the-xbox-developer-direct-will-feature-a-secret-unannounced-fourth-game/ From the Article: Fable was announced in 2020 as part of the Xbox Games Showcase. The game, which is a reboot of the Lionhead RPG series, doesn’t currently have a release date. It’s understood Fable is also in development for PlayStation 5.",
        "comments": [
            {
                "raw_content": "It’s hard to imagine there’s any Xbox game that isn’t in development for another console at this point",
                "author": "adeepkick"
            },
            {
                "raw_content": "I mean I think this was a given considering how their strategy has changed, they want this probably to sell 6-7 million plus to even be considered a success I reckon especially after the development time length",
                "author": "Artistic-Side8872"
            },
            {
                "raw_content": "I don't think we need \"Xbox game in development for another console\" leaks/rumors any more. At this point it's just news.",
                "author": "SplintPunchbeef"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Playground Games is working on an undisclosed project (probably not Fable or FH6)",
        "score": 216,
        "text_content": "Spotted this on linkedIn. Jonathan Baker, an animator working at playground games, lists his current work as an **undisclosed project.** Since he just joined the studio this month, it's likely a third project or DLC (for FH6 or Fable). **Source:** [https://www.linkedin.com/in/skellybobbly/](https://www.linkedin.com/in/skellybobbly/)",
        "comments": [
            {
                "raw_content": "His description says \"Available March 26\". Maybe this means he is working with a short contract to finish FH6? Edit: could be working on live service stuff. It says its a contract for Playground games starting Jan 2026, and is for animation work. Or maybe just to make promotional stuff like trailers up to release. Those kind of things don't really need much familiarization with game engine, and would make sense for a short contract.",
                "author": "nukleabomb"
            },
            {
                "raw_content": "Crossing fingers for Table.",
                "author": "ThemosttrustedFries"
            },
            {
                "raw_content": "It is a trailer for either FH6 or Fable. Jonathan Baker does trailers. I doubt Playground Games has the capacity to start a 3rd project already, they have 400 employees, not all are developers and they are still working heavily on Forza Horizon 6 and Fable. It is an \"Undisclosed Project\" because the trailer hasn't been released yet.",
                "author": "Optimal-Fox-3875"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Fallout New Vegas Remastered releasing imminently?",
        "score": 20,
        "text_content": "I got a reddit ad from BethesdaUK. It lists fallout games to start off with. Under New Vegas the platforms say PlayStation 5 and Series X. It is technically on Series X via backwards compatibility so that can be explained away but it's not on PlayStation 5 at all. https://www.reddit.com/user/BethesdaUK/comments/1q78ev9/guide_which_fallout_is_right_for_you/?p=1&utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=1",
        "comments": [
            {
                "raw_content": "The PS3 version can be cloud streamed on PS5",
                "author": "drumjolter01"
            },
            {
                "raw_content": "What's interesting is that the ad just days \"Fallout: New Vegas\" Not Remastered or anything 🤔",
                "author": "kranitoko"
            },
            {
                "raw_content": "Did everyone just forget about Fallout 3 Remaster? Or how it is the most likely next game Bethesda announces?",
                "author": "LeonSigmaKennedy"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "VGC Claims Xbox Developer Direct will feature a \"promising indie game\"",
        "score": 332,
        "text_content": "\"VGC can corroborate this and understands that the fourth game is a promising indie title from a third-party publisher.\" [https://www.videogameschronicle.com/news/the-xbox-developer-direct-will-feature-a-secret-unannounced-fourth-game/](https://www.videogameschronicle.com/news/the-xbox-developer-direct-will-feature-a-secret-unannounced-fourth-game/) Edit: VGC has now clarified that it will be a \"a smaller-scale original game from one of [Xbox](https://www.videogameschronicle.com/platforms/xbox/) Game Studios’ first-party developers.\"",
        "comments": [
            {
                "raw_content": "SILKSONG 2",
                "author": "leckmichnervnit"
            },
            {
                "raw_content": "Holy shit it's Clair Obscur Expedition 60",
                "author": "SeptfromUC"
            },
            {
                "raw_content": "I don’t mean to be rude but that’s the most vague thing in the world. Is there not any genre, publisher, dev, ANYTHING past “yeah bro it’s an indie game” 😔",
                "author": "Spader623"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Regular Show × Fortnite (+ Adventure Time second wave)",
        "score": 116,
        "text_content": "https://xcancel.com/i/status/2009553179432677675 https://xcancel.com/i/status/2009558787712303125 For the adventure time wave 2, other skins include Fionna and Cake",
        "comments": [
            {
                "raw_content": "You know who else is collabing with Fortnite",
                "author": "Blupoisen"
            },
            {
                "raw_content": "„don‘t worry bro, I know a guy“",
                "author": "JjoyBboy"
            },
            {
                "raw_content": "![gif](giphy|AT6LbRAazEoPm)",
                "author": "JjoyBboy"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Xe3P Nova Lake integrated graphics reportedly 20-25% faster than Panther Lake's - VideoCardz.com",
        "score": 51,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Panther lake igpu is already very good. 20-25% on top of that will be insane.",
                "author": "benjhoang"
            },
            {
                "raw_content": "2026 CES just completed And we are now getting rumors of a 2027 iGPU... talk about a time wrap",
                "author": "WarEagleGo"
            },
            {
                "raw_content": "Meanwhile Medusa Point (zen 6, 2027) is rumoured to use rdna3.5 with _REDUCED_ CU count btw",
                "author": "996forever"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Introducing the ASUS NUC 16 Pro - Faster, Smarter, More Secure for the AI-Driven World - Featuring up to Intel Core Ultra X9 CPU, up to 96GB LPDDR5X 9600 MT/s, up to Arc B390 GPU, NPU 5, Dual Fan Cooling, Dual LAN, Dual SSD, WiFi 7, BT6, Quad Display, vPro & fTPM 2.0",
        "score": 17,
        "text_content": "https://preview.redd.it/gl52we6qxdcg1.png?width=1920&format=png&auto=webp&s=e1b3d54a7f82a62dae94d954a74bc518dc809773 The new ASUS NUC 16 Pro is our fastest, smartest, and most secure commercial Mini PC yet. Powered by up to Intel Core Ultra X9 Series 3 Processor, it delivers up to 180 Platform TOPS to handle next-generation workloads in machine learning and data analytics. Its LPDDR5x memory is up to 33% faster than the previous generation for greater efficiency. With Dual 2.5G LAN ports, Intel Wi-Fi 7 connectivity, and a tool-less chassis for instant upgrades, the NUC 16 Pro ensures easy management and minimal downtime. Built with dTPM security and tested to U.S. MIL-STD-810H military standards, it sets a new benchmark for compact, secure, and AI-ready computing. With a slightly larger 5x4 chassis size, the ASUS NUC 16 Pro can focus on providing more cooling, dual M.2 slots, and dual LAN ports for higher and more sustained performance. The new ASUS NUC 16 Pro features a Dual-Fan cooling design, a dedicated DIMM fan (65W model), three heat pipes, and fin arrays on each side. https://preview.redd.it/tg8p2h4eydcg1.png?width=1920&format=png&auto=webp&s=328c7e08490fe172cbd1c6f6877545411db44412 We've discussed this before, but one reason to trust ASUS NUC products is because we put each NUC through a comprehensive testing process to test and back it with a 3 year warranty. This process involves system temperature and humidity testing, drop testing, and vibration testing. We also take a representative sample size of units and put them through simulation testing at 40C for 90 days to reach over a 50K hours MTBF. This leads to a low return rate of just 1%. For more information about the testing process and how we ensure outstanding durability and performance, please visit [https://www.asus.com/content/nuc-quality-test/](https://www.asus.com/content/nuc-quality-test/) **Key Features:** * **AI-Accelerated Hybrid Performance -** Unleash next-gen AI workloads with Intel Core Ultra X9, 12 Xe GPU cores, and NPU 5. Hybrid XPU architecture delivers up to 180 Platform TOPS, optimized for real-time Edge AI inference and machine learning tasks. * **Next-Gen Speed & Efficiency -** Up to 96 GB LPDDR5x 9600 MT/s, delivering up to 20% faster performance with 50% less power. Dual-fan thermal design ensures maximum CPU performance in a compact chassis. * **Hyper-Connected Workspace -** Intel Wi-Fi 7 and Bluetooth 6.0 enable low-latency wireless. Dual 2.5G LAN ensures network redundancy, Zero Trust security, and high throughput for enterprise and Edge AI workloads. * **Enterprise Security & Management -** Supports Intel vPro (select SKUs) and fTPM for hardware-based security. ASUS Control Center & Edge Suite enable centralized management, remote monitoring, and asset reporting. * **Optimized Form Factor & Expansion -** Compact 5x4 form factor (144x117x42mm) with Tool-less Chassis 2.0 allows upgrades to dual M.2 SSDs (Gen5/Gen4). Maximizes thermal headroom while maintaining flexibility and performance. * **Industrial Readiness & Long-Term Value -** Durable, modular design supports harsh environments and long-term deployment. Rich internal I/O (RS-232, PCIe x1) enables POS, IoT, and industrial automation expansion. https://preview.redd.it/nj1m49ijydcg1.png?width=2167&format=png&auto=webp&s=4350ba20429707aafe6e6d95f43c108b3fc6b4fa **Key Specs:** * **Configuration choices -** The ASUS NUC 16 Pro will be available in a complete Mini-PC package (with memory, storage, and OS) and barebone kits where you will need to supply memory, storage, and OS * **CPU -** Processor options start from the top at the Intel Core Ultra X9, and move down to the Intel Core Ultra 5. The Intel Core Ultra 7 and Core Ultra 5 will be available with vPro models. * **GPU -** Graphics options featuring the Intel Arc B390 will be available with Intel Arc 12Xe cores (up to 65W) and Intel Arc 4Xe cores (Up to 65W) * **Memory -** The Core Ultra X9 will feature soldered Dual Channel LPDDR5x 9600 MT/s memory up to 96GB, while other models will feature Dual Channel DDR5-7200 CSO-DIMM (Up to 128GB) * **Storage -** 2 x M.2 2280 key M slots (1x PCIe x4 Gen5, 1X PCIe x4 Gen4) support, 128GB\\~8TB NVMe SSDs * **I/O Ports -** 2x USB-C TBT4, 1x USB 3.2 Gen2x1 Type-C (10Gbps), 4x USB 3.2 Gen2 Type-A (10Gbps), 2x HDMI or 2x DP 2.1\\* * **Networking and Wireless -** WiFi 7 & BT6, 2x 2.5Gbps LAN * **Display Output -** Up to Quad display including Dual HDMI or Dual DP 2.1 ports, plus Dual TBT4 w/ DP 2.1 * **Audio -** Up to 7.1 multi-channel (or 8-channel) digital audio on HDMI and DP Type-C ports * **Internal Headers\\*\\* -** 2x USB 2.0 headers, 1x 2230 M.2 slot, 1x PCIe x1 Gen 2 connector, 1x Serial port header * **Expansion I/O Accessory\\*\\*\\* -** 1x VGA Exp. (Lid-based), 1x RS232 Exp. (Lid-based) * **OS Choices (Mini-PC) -** Windows 11 Home 64-bit, Windows 11 Pro 64-bit * **OS Support (Barebones Kit) -** Windows 11 Home 64-bit, Windows 11 Pro 64-bit; Windows 11 IoT Enterprise 64-bit; Windows 11 Pro Education 64-bit; Ubuntu 24.04 LTS 64-bit; RedHat Enterprise Linux 10.0 64-bit \\*HDMI supports CEC and persistent display, while DisplayPort supports headless operation and virtual display \\*\\*Barebones Kit / board only \\*\\*\\*Not available until Q2 The ASUS NUC 16 Pro is expected to be available late Q1 - Early Q2, though actual availability may vary by SKU. * Product page: [https://www.asus.com/displays-desktops/nucs/nuc-mini-pcs/asus-nuc-16-pro/](https://www.asus.com/displays-desktops/nucs/nuc-mini-pcs/asus-nuc-16-pro/) Here are a few images from our CES booth: https://preview.redd.it/iygzvmgsydcg1.jpg?width=1080&format=pjpg&auto=webp&s=3e4a89d5a1603beb7af307baef235f21f53458de https://preview.redd.it/wa54tikg1ecg1.png?width=2662&format=png&auto=webp&s=61001039960a3a28ba38809b8b4d4f4ccc9f893f https://preview.redd.it/eq64thf01ecg1.png?width=2658&format=png&auto=webp&s=a0db899b66d6f7f2ed685c453884e36d61835eea Let us know what you think about this new version of the ASUS NUC Pro in the comments below.",
        "comments": [
            {
                "raw_content": "Great, want one!",
                "author": "Latter_Aardvark_1733"
            },
            {
                "raw_content": "It will be very interesting to compare it with the Nuc 15 pro. I am currently reviewing this model with a U5 225H processor. And I know what this processor is capable of in combination with ARC 130T.",
                "author": "Fun_Masterpiece296"
            },
            {
                "raw_content": "> Memory - The Core Ultra X9 will feature soldered Dual Channel LPDDR5x 9600 MT/s memory up to 96GB 96GB of RAM? So it's $20,000?",
                "author": "inphamus"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Thunderbolt 5 laptops",
        "score": 41,
        "text_content": "Does anyone know if there any laptop that are coming out with thunderbolt 5, maybe half through the year?",
        "comments": [
            {
                "raw_content": "There's very few and it's confusing. All of the CES laptop announcements I have seen don't seem to include it despite it now being a year since it has been available. Weirdly it seems most likely to be found on gaming laptops that already have a dGPU when it would be most useful on thin and lights... but it's nowhere to be found on announced MSI Prestige and Dell XPS laptops. I guess they're all waiting for it to be integrated into the CPU? but that will take years still.",
                "author": "jenny_905"
            },
            {
                "raw_content": "Intel is going to $100 by February",
                "author": "No-Run3263"
            },
            {
                "raw_content": "Yes: German site, but should be easy to work with, it's filtered to Intel CPU and Thunderbolt 5 https://preisvergleich.heise.de/?cat=nb&xf=1482_Intel%7E31_Thunderbolt+5",
                "author": "doommaster"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "HWiNFO update brings enhanced support for Core Ultra 200K Plus, Ultra 300 and next-gen Core Ultra 400 series",
        "score": 15,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I would love a 385k in my main rig and retire my 12900KS to a power limited homelab role",
                "author": "Lord_Muddbutter"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Minisforum confirms \"Core Ultra 9 290HX Plus\" Arrow Lake Refresh for its SFF PC",
        "score": 27,
        "text_content": "",
        "comments": [
            {
                "raw_content": "specs of that 290HX?",
                "author": "Greedy-Lynx-9706"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Inside Intel - The Future Of PC Performance, Panther Lake, Multi-Frame Gen - Tom Petersen Interview - YouTube",
        "score": 25,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I will watch the video and I'm 100% sure that there will be no discussion of the B770 or Intel Pro Arc Cards or Battlematrix. Throw us a bone! If June comes around and there still is no news then something is rotten in Denmark.",
                "author": "quantum3ntanglement"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Core Ultra 3 Names are a Mess",
        "score": 15,
        "text_content": "Intel currently has 14 \"different\" products coming out - many of which will perform virtually identical. Why doesn't intel/AMD go the Apple route with naming schemes? Just look at how much simpler the example below is. * **S3 Ultra X**: Ultra X7 385H/Ultra X9 368H/Ultra X9 388H * **S3 Ultra**: Ultra 7 356H/366H/386H (still don't care about the clock differences) * **S3 Pro X**: Ultra 5 338H * **S3 Pro**: Ultra 5 336H * **S3 Plus**: Ultra 5 325/335/355/365 (.4ghz wont matter for battery life options) * **S3**: Ultra 5 322/332 (two processors with different name, same specs wtf?) Different name = different core count Better GPU = Add an X on the end Like I get it, Intel doesn't want to limit good binned chips to the poorly binned chips clock speed. But these are not desktops. People rarely reach their max clock speed in laptops due to thermal limits anyways - if people push them that far at all. If intel is worried about their benchmarking performance, just **UNLOCK THE CLOCK MULTIPLIER!!!** People who care about clock speeds would bump it, people who don't would not.",
        "comments": [
            {
                "raw_content": "TBH, as long as the Ultra 5 338H is actually called an Ultra X5, it'd make the entire thing a lot more consistent as in now X always means \"the one with the good GPU\"",
                "author": "LastChancellor"
            },
            {
                "raw_content": "The SKU count is roughly doubled because you have each step with/without vPro - these get a 100MHz max turbo frequency bump, but the main benefit is you can run the corporate firmware with vPro support, so you get additional security and manageability features. Exception is the Ultra 9 where they just do it with vPro support as standard. These have a higher cost because you are getting more features. You could make it so you just have one CPU and then the manufacturer pays a license for corporate firmware per device, but that's more work to then ensure manufacturers are licensing machines correctly, and more confusing for end-users where now if you're buying a corporate device with vPro support you know you are looking at Core Ultra 236V and 268V for vPro support whilst 226V and 258V don't have it.",
                "author": "ThorburnJ"
            },
            {
                "raw_content": "You have no understanding of Intel's business and thus are not qualified to advise them what to do Intel doesn't sell these CPUs to the end consumer, they sell them to their customers - the PC manufacturers. And that is the reason why there is so much choice, because the PC manufacturers want it. Also, you clearly have never heard of vPro.",
                "author": "ibmthink"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "ASUS's new 800-series boards get 64MB BIOS, but integrated Wi-Fi drivers may be dropped later for future AM5 CPU support",
        "score": 175,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Most motherboards have the ability to update the bios without even a CPU, i don't think this is really that necessary. For \"pre-installed wifi drivers\" windows and linux already have a \"good\" pre loaded into the OS itself drivers(only to connect to wifi and later for you to install the latest), if this don't impact the price for such an increase go ahead.",
                "author": "pedrobuffon"
            },
            {
                "raw_content": "How expensive is ROM? I'm surprised they don't just add way more than they'll ever need given how many CPU generations AMD sockets tend to last. Also, I got my B650 hoping I could upgrade to a newer CPU years down the line without changing the motherboard, and I hope it'll still support the last generation of AM5 CPUs if I ever choose to upgrade.",
                "author": "ScienceMechEng_Lover"
            },
            {
                "raw_content": "MSI are also coming up with 64MB bios. I guess my recently bought b850 probably cannot be used for next gen Ryzen. FML.",
                "author": "Tekn0z"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "MSI launches AI Edge 4L desktop built around AMD Strix Halo",
        "score": 18,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They just keep refusing to put this into a laptop form factor huh (we now have 2 asus laptop + 1 asus tablet + 1 hp laptop in total)",
                "author": "996forever"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Americans missed out on a 'once-in-a-lifetime' chance to buy a house—the 3 shifts it would take to make housing affordable are 'very unlikely'",
        "score": 369,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Homes should not be “once in a lifetime” chances",
                "author": "d3v1ls4v0c4d0"
            },
            {
                "raw_content": "Bought in 2009.. That was once in a lifetime. Sold in 2019 and missed the boat in 2020 as I couldn't afford anything in my area.. Now I'll forever rent",
                "author": "UrCreepyUncle"
            },
            {
                "raw_content": "Even when rates were 3% or less people were saying the home prices were too high and not to buy.",
                "author": "ElBigKahuna"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Almost 40% of US homes do not have a mortgage.",
        "score": 198,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And which age group holds these homes? Lol",
                "author": "Bigdaddyblackdick"
            },
            {
                "raw_content": "Will this wealth also be trickling down? /s",
                "author": "Burner-Advantage-997"
            },
            {
                "raw_content": "Don't boomers own 60% of housing? With youngest at 60yrs old, I hope they pay down those notes before healthcare costs start up",
                "author": "1234nameuser"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage rates plummet to new lows at 5.99%",
        "score": 178,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wake me up next month when they \"collapse\" to 5.98%",
                "author": "PooPooDooDooPants"
            },
            {
                "raw_content": "\"plummet\", ha",
                "author": "travelinzac"
            },
            {
                "raw_content": "This is excellent news. If MND reports 5.99%, you can get a rate that is 0.4-0.5% lower from credit unions such as PenFed.",
                "author": "ThemeBig6731"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "U.S. payrolls rose 50,000 in December, less than expected; unemployment rate falls to 4.4%",
        "score": 66,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Except the numbers will be revised to -50k in a few months.",
                "author": "keepitreal55055"
            },
            {
                "raw_content": "I'm curious where these numbers come from. Is this just people who are actually claiming unemployment? The real question is how many people are unemployed but not on any books because they're not entitled to unemployment or they're hustling gig jobs for scraps but still technically considered employed?",
                "author": "AMinMY"
            },
            {
                "raw_content": "Wait, isn't that a terrible jobs number? Aren't these normally in the 200K range?",
                "author": "marvology"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Atlas ends this year’s CES with a backflip",
        "score": 988,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm actually extremely impressed with it's ability to recover. That's probably a better advertisement than landing it smooth since a smooth backflip can be pre programed.",
                "author": "adj_noun_digit"
            },
            {
                "raw_content": "The 360 rotation on the legs is pretty cool. I think this might be my favorite robot. https://preview.redd.it/tt2q2w39egcg1.jpeg?width=1019&format=pjpg&auto=webp&s=9ca9cd833cbd3bde1e410fa4527588894c46986b",
                "author": "enigmatic_erudition"
            },
            {
                "raw_content": "damn, that's impressive. Even when it broke some parts, it still managed to balance itself up. Boston Dynamics really is the top company in terms of humanoid robot technology.",
                "author": "Gnub_Neyung"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "one of the top submitters in the nvfp4 competition has never hand written GPU code before",
        "score": 954,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm sure that the guy is still smart AF programmer. Biggest gain I've had with AI models is the fact that I can focus on the actual problem from the logical side. I don't need to fight the programming language or environment. As an example: Never ever managed to grasp my head around shaders but now with LLM it took me like 1 hour to implement a proper Fog of War system because I knew how I wanted to approach the problem and how the GPU runs the code. Still can't write shaders at all but now it's not a blocker for me anymore.",
                "author": "JjyKs"
            },
            {
                "raw_content": "Ok that's actually pretty impressive. Didn't know much about the competition, but found a good blog post showing what goes into a 10th place submission, though with limited effort as there are a few unexplored future ideas in there (the author is a Staff Software Engineer at LinkedIn specializing in LLM inference optimization & CUDA kernel optimization). [https://yue-zhang-2025.github.io/2025/12/02/blackwell-nvfp4-kernel-hackathon-journey.html](https://yue-zhang-2025.github.io/2025/12/02/blackwell-nvfp4-kernel-hackathon-journey.html) For the first problem she placed ahead of shigao, for number 2 and 3 shigao is ranked higher. Optimizing kernels involves a lot of trial and error so AI likely has an advantage of being able to quickly iterate. But I didn't expect AI to know what to try by itself, at least not on that level because personally I haven't had too much luck with getting AI to generate performant CUDA kernels (specifically efficient 2d convolution with small <32px kernels).",
                "author": "dotpoint7"
            },
            {
                "raw_content": "LLM is a talent amplifier. Good devs can switch between stacks and frameworks well with the LLM help. Bad devs just generate BS.",
                "author": "Square_Poet_110"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Deepseek is cooking",
        "score": 217,
        "text_content": "",
        "comments": [
            {
                "raw_content": "if they pass claude opus 4.5 we are truly accelerating",
                "author": "Big-Site2914"
            },
            {
                "raw_content": "Talk is cheap release the model",
                "author": "Ambitious_Subject108"
            },
            {
                "raw_content": "Even if it's close that's good. Competition is *good* for us. They're products, not sports teams.",
                "author": "cfehunter"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "DeepSeek set to launch next-gen V4 model with strong Coding ability, Outperforms existing models",
        "score": 67,
        "text_content": "This points to a **real shift** in the coding model race. **DeepSeek V4** is positioned as more than an incremental update. The focus appears to be on long context code understanding logical rigor and reliability rather than narrow benchmark wins. If the internal results hold up under **external evaluation** this would put sustained pressure on US labs especially in practical software engineering workflows not just demos. The **bigger question** is whether this signals a durable shift in where top tier coding models are being built **or** just a short term leap driven by internal benchmarks. Set to **release** early Feb(2026). Source: The information(Exclusive) 🔗: https://www.theinformation.com/articles/deepseek-release-next-flagship-ai-model-strong-coding-ability",
        "comments": [
            {
                "raw_content": "We'll see. I'm skeptical on any Chinese benchmarks",
                "author": "TR33THUGG3R"
            },
            {
                "raw_content": "I'm looking for that LTX generation of coding models that run on a single 5090 but produce results that compete with the major models.",
                "author": "fredandlunchbox"
            },
            {
                "raw_content": "It really all depends on agentic performance, because Claude code + Opus 4.5 is basically a god at this point. Opus just has *it*, that neither Gemini or Codex have (although Codex is still very good, Gemini is much further behind in agentic coding.",
                "author": "cyborgsid2"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Report: Anthropic cuts off xAI’s access to Claude models for coding",
        "score": 23,
        "text_content": "**Report by Kylie: Coremedia** She is the one who reported in August 2025 that Anthropic cut off their access to OpenAi staffs internally. **Source: X Kylie** 🔗: https://x.com/i/status/2009686466746822731 [Tech Report](https://sherwood.news/tech/report-anthropic-cuts-off-xais-access-to-its-models-for-coding/)",
        "comments": [
            {
                "raw_content": "rly",
                "author": "Lvxurie"
            },
            {
                "raw_content": "**Additionally she said** https://preview.redd.it/05jrmgf6khcg1.png?width=1080&format=png&auto=webp&s=9c8d167350f5cc5bd95669f2921c815b80aad448",
                "author": "BuildwithVignesh"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "AI clears World's Toughest Math Exam: AxiomProver achieves 12/12 on Putnam 2025",
        "score": 171,
        "text_content": "AxiomProver has **autonomously solved** all 12 problems from the 2025 Putnam Competition using **formal Lean proofs** with no human hints. The Putnam is widely regarded as the **hardest** undergraduate math exam. Median human scores are often 0 or 1. This is **not** answer guessing. Every solution is formally verified. The proofs are mechanically checked end to end. Axiom has **released** the full Lean proofs along with visualizations and direct human vs AI comparisons. **Blog:** https://axiommath.ai/territory/from-seeing-why-to-checking-everything **Lean Proofs(Code)** https://github.com/AxiomMath/putnam2025 **Announcement** https://x.com/i/status/2009682955804045370",
        "comments": [
            {
                "raw_content": "The lady who started this company actually did an [interesting interview](https://youtu.be/xldMXTPGMGI) recently",
                "author": "osfric"
            },
            {
                "raw_content": "2 years ago experts from Reddit were claiming AI models NEVER be good at math based on transformers blah blah blah ...",
                "author": "Healthy-Nebula-3603"
            },
            {
                "raw_content": "Is AxiomProver an LLM? I'm not seeing any mentions on that.",
                "author": "NunyaBuzor"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Ilya Sutskever had $4 billion of vested OpenAI equity in 2023",
        "score": 121,
        "text_content": ".",
        "comments": [
            {
                "raw_content": "That’s worth over 100 billion at 1 trillion ipo 🤯",
                "author": "Rxvi21"
            },
            {
                "raw_content": "His decision to leave probably did serious damage OpenAI long term",
                "author": "Main-Company-5946"
            },
            {
                "raw_content": "Wow I can’t believe the greedy capitalist Ilya tried to wrestle away power from poor little Sama who makes $76,000 a year from OpenAI with no equity. (Only half joking)",
                "author": "socoolandawesome"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI is developing \"ChatGPT Jobs\" — Career AI agent designed to help users with resume,Job search & career guidance",
        "score": 60,
        "text_content": "Use Jobs to explore roles, improve your resume and plan your next steps - Get help improving your resume and positioning. - Clarify what roles fit you and how to stand out. - Search and compare opportunities that match your goals. **Source: Beta testers in X**",
        "comments": [
            {
                "raw_content": "Haha, I am loving it. Create AI -> Profit -> Make people loose jobs -> Create a tool for people to search for jobs -> Double Profit -> Create Enterprise software to deal with loads of applicants -> Triple Profit",
                "author": "elemental-mind"
            },
            {
                "raw_content": "Seems a bit counterintuitive",
                "author": "YakFull8300"
            },
            {
                "raw_content": "I see OpenAI has hopped on the GPT wrapper trend",
                "author": "Nuphoth"
            }
        ],
        "subreddit": "singularity"
    }
]