[
    {
        "post_name": "What’s going on with my “boys” and, in some cases, “gals?” They’re all going after Attorney General Pam Bondi, who is doing a FANTASTIC JOB! We’re on one Team, MAGA, and I don’t like what’s happening.",
        "score": 1451,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sorry, but this is deflective bullshit. Full transparency on Epstein, how he made his money, and WHO WAS DOING THE RAPING is information that the public needs to know ASAP, and we're not going to let it go. P.S. Pam Bondi sucks.",
                "author": "RonPaulWasRight"
            },
            {
                "raw_content": "MASSIVE L Calling the files a Democrat fabrication is absolutely wildly insane.",
                "author": "ARMENTO"
            },
            {
                "raw_content": "He needs to go talk to Barron",
                "author": "TrumpInAus"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔴 I don’t agree with President Trump’s assessment of Pam Bondi, but that doesn’t mean that I am going to throw the baby out with the bathwater, because we’re allowed to disagree and at the end of the day maybe I’m wrong and President Trump is correct. We'll see what happens. 🔴",
        "score": 1338,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good take, OP. Let cooler heads prevail.",
                "author": "TheAftermath"
            },
            {
                "raw_content": "We also have to recognize that President Trump could be very wrong too. I will site Covid as an example. Sometimes he needs to be pushed into the correct decision. The thing about Trump is that he listens to A supporters. He’s not a strict constitutionalist with a core set of principles, he’s a centrist, despite the news reports making him seem far right he is not. But he is common sense and not a member of the swamp. And that’s the best I’ve seen in my lifetime but he can be wrong and needs us to point out when he is.",
                "author": "Rob55"
            },
            {
                "raw_content": "I've been ranting about the Epstein situation myself, but this is a fair take, pede. I do stand with President Trump at the end of the day, even though I'm unsatisfied with this one issue. Take my upvote. MAGA",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"I guarantee, he sits down to pee.\" Got to love this guy.",
        "score": 1084,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Damn this is exactly the person needed to deport 20 million illegals !",
                "author": "thebeercules"
            },
            {
                "raw_content": "Alright I’ll admit - I sit down to pee. Stops it from getting everywhere and gives me a minute to catch up on the latest PDW memes. Sorry, not sorry Tom!",
                "author": "ThisTrainHasNoBrakes"
            },
            {
                "raw_content": "CLASSIC TOM HOMAN! LOVE THIS GUY. ~ 12 July 2025",
                "author": "FreeFire"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "You can do both… Be angry that people who raped innocent children on an island walked free and still support President Trump at the same time. I do.",
        "score": 763,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Trump ran on Transparency . He's better than Biden by a million light years. But why the hell did he keep giving us that Fukn stupid story about the woman taking in the Snake. I'm just tired of the Lies.",
                "author": "Trumpdeasses"
            },
            {
                "raw_content": "The ball is not in my court to take more hopium. The ball is in Trump's court to deliver Epstein like he said he would when he ran. If he doesn't, the swamp survives.",
                "author": "DoMe22"
            },
            {
                "raw_content": "I still support Trump. I just think he's wrong about Epstein and Bondi.",
                "author": "ErikaLives"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "It has just been revealed that one of the illegal aliens arrested by the Trump administration at the California weed farm was a CHILD MOLESTER and RAPIST",
        "score": 1228,
        "text_content": "",
        "comments": [
            {
                "raw_content": "One tree. One rope. 🌳",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "But where will I ever get my strawberries from?!",
                "author": "South_Florida_Guy"
            },
            {
                "raw_content": "Highlighting every child molester they catch while denying full Epstein disclosure has the same energy as \"racist\" saying \"I'm not racist, I have black friends!\"",
                "author": "IonlyReplytoBots"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Sec Noem: I was just given an update on Thursday’s operation at the marijuana facility in California. DHS law enforcement rescued 14 children from potential forced labor, exploitation, and trafficking. They arrested 319 illegal aliens. They faced assaults, violence, and even bullets fired",
        "score": 1343,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good. Rub Newscum and Bass's noses in it. Get behind your precious illegals now.",
                "author": "airborne3502"
            },
            {
                "raw_content": "Now get RFK to test the pot for RoundUp. I can't believe they spray that shit on everything.",
                "author": "MythArcana"
            },
            {
                "raw_content": "The libs that cooked \"love is love\" are about to cook up \"work is work\" to protest the \"evil nazi far right\" that's against children working",
                "author": "hisnamewasjeffTwo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Rep. @realannapaulina on the probable inside job assassination attempt and how the US Secret Service had a tip on the assassination attempt days out.",
        "score": 1348,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They wanted America to see his head explode live like JFK. CNN showed up to record live with high speed cameras. Basically like media showing up for fed raids.",
                "author": "wharfthrowaway"
            },
            {
                "raw_content": "Just like JFK and that slimeball LBJ who was waiting in the wings",
                "author": "Justlooking250"
            },
            {
                "raw_content": "Weird how Trump seems completely uninterested in who was behind shooting him.",
                "author": "MoreVanceMemes"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Melanie Joly FIRES BACK at President Trump 35% tariffs on Canadian goods from August 1st, \"While the U.S. is becoming weaker, we will become stronger and we will diversify and turn ourselves towards Europe\"",
        "score": 1109,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's right. Big, strong, stable, economically booming *Europe.* **TREMBLE IN FEAR, YANKS!!!!**",
                "author": "seeling0"
            },
            {
                "raw_content": "Europe that now has zero manufacturing capacity due to having cheap Russian gas cut off? Go right ahead.",
                "author": "Viewer01"
            },
            {
                "raw_content": "She's gonna capitulate just like the rest of them. Nobody on this planet looks at Canada as a source of strength lol",
                "author": "wartooth6"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "HUGE: Secret Service Knew There Was a Credible Threat Against Trump’s Life 10 Days Before Butler Rally Where Trump was Shot and Innocent Supporter was Killed – DID NOT SHARE WITH STAFF ON GROUND",
        "score": 1450,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Butler was an inside job.",
                "author": "MEME-SUPREME"
            },
            {
                "raw_content": "Of course they did. He was supposed to die on stage, and CNN was miraculously there to film it.",
                "author": "cjcivicx"
            },
            {
                "raw_content": "Only rally CNN showed up out of 100s with a slow mo camera. You don't have to be a scientist to know this shit was an inside job.",
                "author": "PeaceMakerDJT"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Whoa: President Trump just got ratio'd on his own platform after making that controversial post.",
        "score": 525,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And it's deserved. Doesn't mean we're abandoning him, but no, he's dead wrong on this.",
                "author": "HeavenlyTrumpets"
            },
            {
                "raw_content": "It should get the smackdown -- it's a stupid post -- doesn't he have someone check his stuff?",
                "author": "ChiefRedRaider"
            },
            {
                "raw_content": "this is a teachable moment- he should easily understand why his supporters feel this way- we’ve been aware of the Podestas and adrenochrome since at least 2016…",
                "author": "KarenLukasik"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Go on... call the roof Korean a faka MAGA",
        "score": 442,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'll stand by the roof top Korean any day of the week. Good guy.",
                "author": "MemphisMontoya71"
            },
            {
                "raw_content": "Tony is awesome.",
                "author": "ErikaLives"
            },
            {
                "raw_content": "I say Tom Homan and RT Korean would be a great team to run in 2028.",
                "author": "Taylor3006"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Never forget when an ABC reporter said in a hot mic that she had mountains of evidence against Bill Clinton, Prince Andrew and Alan Dershowitz being implicated with Jeffrey Epstein years ago. She was blackmailed and threatened into not running the story.",
        "score": 633,
        "text_content": "",
        "comments": [
            {
                "raw_content": "not only silenced, but fired from her job soon after and has never worked in media again.",
                "author": "BidenShowerDrool"
            },
            {
                "raw_content": "Pepe Farms remembas",
                "author": "MtnMover444"
            },
            {
                "raw_content": "Virginia Roberts is dead and 'Kate' is still alive.... for now.. >A woman who testified in the trial of Ghislaine Maxwell under the pseudonym \"Kate\" described her experiences involving Jeffrey Epstein. According to her testimony, she first met Maxwell when she was 17 years old and was invited for tea at Maxwell's London townhome. During this meeting, Maxwell spoke about her boyfriend, Jeffrey Epstein, describing him as a philanthropist who could help with Kate's aspiring music career. Kate testified that she understood Maxwell's job was to take care of Epstein's needs, which included his sexual requirements, as she mentioned that Epstein needed to have sex about three times a day. CBC article for deets. https://www.cbc.ca/news/world/ghislaine-maxwell-trial-second-accuser-1.6275419 Women claiming to have been victims in this ABC article: https://abcnews.go.com/US/alleged-victims-jeffrey-epstein-face-consequences-apparent-suicide/story?id=64900823 ...but notice this is just Epstein named? Dershowitz knows and yet can't name names (or die?), and Ghislaine's 'black book' is off limits? This isn't going away and it ain't over.",
                "author": "MehNahMehNah"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨#BREAKING: ICE federal agents have just announced the arrest of 319 undocumented immigrants at two cannabis farms in California on Thursday, marking the largest worksite immigration raid under the current Trump administration",
        "score": 1401,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Excellent work! Arrest the owners/employers too!",
                "author": "kek-is-tan"
            },
            {
                "raw_content": "That's what I call a high yield crop!",
                "author": "MythArcana"
            },
            {
                "raw_content": "Left is going to be uber pissed with weed farms being targeted. Kek",
                "author": "Here_we_go"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Remember when the NY Times debunked Pizzagate and then later the author of the debunking article was arrested on child pornography charges?",
        "score": 418,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Remember the case of the guy who went into the restaurant with a gun but asked everyone to please leave and he shot the server that their website was running on, then the judge on his case got appointed to the Supreme Court by a guy whose daughter wrote in her diary about him molesting her and then the shooter got released from jail only to be killed in a confrontation with police from which we’ve never seen any bodycam footage?",
                "author": "Taqiyya_Mockingbird"
            },
            {
                "raw_content": "In Chris Farley voice: That was awesome!",
                "author": "FuckJBiden"
            },
            {
                "raw_content": "\"All fucking kid fuckers should fucking hang!!\" ~ Animal Mother",
                "author": "RobinNet"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Any merit to this report of a FBI Deputy Senior National Intelligence Officer speaking to O'Keefe?",
        "score": 1007,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Of course the muslim foreigner in our intel agency is on the “countering white supremacy” unit",
                "author": "wharfthrowaway"
            },
            {
                "raw_content": "White supremacy investigated by \"Rami Hasan\" Hope he gets shit canned asap.",
                "author": "Here_we_go"
            },
            {
                "raw_content": "Epstein didn't kill himself.",
                "author": "Mortal_Wombat"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This story is not going to go away",
        "score": 493,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This won't happen, because the ones who would do the knocking, aren't going to knock on their own doors. The whole of western government is compromised by an Israeli blackmail scheme giving them control over western politics and western governments. Wishful thinking to believe that there are any \"good guys\" out there who are going to go round up the \"bad guys\". They're all bad guys. Compromised by other bad guys. You'll never get what you are wishing for.",
                "author": "CAPTAIN_TENDY_PLATE2"
            },
            {
                "raw_content": "Trump is the one lying now, he needs to be called out everywhere he goes, MAGA does not protect pedophiles who rape children, I do not care what deal was cut or with whom",
                "author": "FKH2"
            },
            {
                "raw_content": "Posobic was given a binder by Bondi early on. So, wtf is he talking about?",
                "author": "Mitzhatzmakoph"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔴 This forum is turning into a circle jerk of black pilling.🔴 I’d rather trust the man whom the deep state tried to kill than all those big right-wing \"influencer\" accounts who’ve been spreading lies about the Epstein List to farm engagement. 🔴 Never bet against Trump.",
        "score": 595,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sorry, I dont agree with pritecting pedos and pedo organizations. Dont care what you label me. But you wont label me a pedo sympathizer or protector",
                "author": "Here_we_go"
            },
            {
                "raw_content": "There is no draining of the swamp. No punishment for the people who did all this.",
                "author": "MAGALADON9"
            },
            {
                "raw_content": "Well no man directs my opinions or interests, and this man who I love told me to just forget about it and move on. THAT doesn't sit right with me. Kinda tastes like piss in my cheerios, I wish he simply hadn't said anything.",
                "author": "kornesque"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: Kristi Noem just announced FIVE MORE Alligator Alcatraz-style detention centers are in the works",
        "score": 1186,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Grizzly Alcatraz in Alaska? I was on an Alaskan Cruise last week and Alaska's vastness is breathtaking, if you know what I mean.",
                "author": "Scatter-Shot"
            },
            {
                "raw_content": "Death valley would be a good location, but Gavin is a bitch...",
                "author": "FuckU/Spez"
            },
            {
                "raw_content": "Each new detention center should feature a different type of dangerous animal",
                "author": "VirTW"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The list exists. They have videos.",
        "score": 458,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Anyone in a video is on the list. And Maxwell is sitting right there.",
                "author": "Dilligaf"
            },
            {
                "raw_content": "Wait, you mean it's not?",
                "author": "Back4more24"
            },
            {
                "raw_content": "It’s not?",
                "author": "Mungo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Megyn Kelly: I’m sure it’s a relief for Pam Bondi to hear the president is still in her corner. Unfortunately, huge swaths of the party are not.",
        "score": 485,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How quickly we've forgotten Meghan Kelly's duplicity when it comes to Trump.",
                "author": "Moebius"
            },
            {
                "raw_content": "Link https://x.com/megynkelly/status/1944179015796896021",
                "author": "I-am-Orlando"
            },
            {
                "raw_content": "When an appointee stops being an asset, it's time for the appointee to resign.",
                "author": "DaninElkhart"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Intel bombshell: Chipmaker will lay off 2,400 Oregon workers",
        "score": 439,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://web.archive.org/web/20250712062311/https://www.oregonlive.com/silicon-forest/2025/07/intel-bombshell-chipmaker-will-lay-off-2400-oregon-workers.html For full article",
                "author": "jigsaw1024"
            },
            {
                "raw_content": "Lip Bu Tan is likely either being mandated by the board to gut the Intel workforce with mass layoffs Worse, he might believe this strategy of deep accross-the-board is how you save Intel. Why? Since it's difficult to debloat an existing workforce, a strategy could be to strip the workforce down to a skeleton crew and then slowly rebuild a more efficient workforce The problem with this strategy is that MANY companies are willing to take on recently laid off Intel employees, and they likely have better stock options, 401k, bonuses and pay compared to Intel. Nvidia, AMD, Apple, Qualcomm and ARM can also afford to pay much higher prices to attract the best industry talent. If Lip Bu Tan cuts too deep, he risks firing irreplaceable talented and veteran employees who worked there for 20-30 years who are loyal to the company. Pat Gelsinger already made the deeply idiotic decision to cut the Royal Core project, which drove most of them to quit. These people included the chief architect for the Haswell uarch from the now defunct Oregon P-core team. These 80-100 people are now part of a startup called Ahead Computing that is now a designing high-performance RISC-V core. The people in the RYC project were the most talented people from the Haifa Israel P-core team and across Intel, which could've bled the Haifa team dry of any real talent. It could explain why GLC and LNC are so disappointing in PPA and PPW. Now, the Intel Atom team in Austen, Texas, has their most talented CPU engineers. If Lip Bu Tan wants Intel to survive, he CANNOT significantly gut this team since they're designing the new Atom based Unified Core uarch that will replace Intel's bloated and underperforming P-core uarch family. If he cuts too deep, it could completely destroy Intel as a company. TLDR: Lip Bu Tan needs to be very careful with layoffs. Edit: Fun Fact: The Atom team was established in Intel's \"Texas Development Center\" in 2004, it was a MUCH smaller team, had a small budget compared to the P-core team and the chief architect of the Bonnell uarch used in the original Atom was Elinora Yoeli who was also the chief architect of the Pentium-M.",
                "author": "SherbertExisting3509"
            },
            {
                "raw_content": "When the initial Bloomberg report came out claiming up to 20% of the company would be laid off, Intel claimed they had \"not set any headcount reduction target\". Yet they seem to be right on track for that number...",
                "author": "Exist50"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Has AMD Stopped Screwing Up?",
        "score": 61,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm not sure the launch pricing rebates and subsequent pricing above MSRP, as well as fairly slow FSR4 rollout are that praise worthy. Where the praise should be directed is RDNA4 design team. In terms of hardware feature set parity, performance per watt and performance per area (ignoring node advantages), this is probably the closest AMD has been to Nvidia since Turing, and probably Maxwell looking at just performance per watt and area. And they did it using cheaper GDDR6 too.",
                "author": "LockingSlide"
            },
            {
                "raw_content": "Damn that thumbnail :D",
                "author": "Renricom"
            },
            {
                "raw_content": "Holy shit, is the bar so low for AMD? I wonder if Nvidia would also get praise for cancelling a presentation at the last minute, ghost everyone for 3 months and brag about having day one stock while lying about the MSRP to get positive reviews. FSR4 situation is also a bit biased, Nvidia got more shit for 32 bit PhysX while AMD can give the middle finger to every other RDNA customer when they spent the last half decade gaslighting them with \"no AI\" or \"no dedicated hardware needed\" while doing demos on competitor GPUs and bragging about not having forgotten older products unlike team green.",
                "author": "4514919"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Jarrod'sTech - RTX 5080 vs RTX 4090 Laptop - 25 Games at 4K, 1440p & 1080p!",
        "score": 3,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TLDR/TLDW: Laptops used: XMG NEO 16 2025: Intel Core Ultra 9 275HX, Laptop RTX 5080 (80-175W TDP), 32GB DDR5-6400 XMG NEO 16 2024: Intel Core I9-14900HX, Laptop RTX 4090 (80-175W TDP), 32GB DDR5-5600 Battery life (both laptops have 99.8Wh batteries): XMG NEO 16 2025 (RTX 5080) lasted 49% longer (Witcher 3 1080P, Medium settings, 200 Nits, 60Hz) Average in 25 games (mix high and ultra settings and RT): 1080P: RTX 4090 Laptop was 8.43% faster 1440P: RTX 4090 Laptop was 9.28% faster 4K: RTX 4090 Laptop was 9.33% faster Average 25 game FPS: 4K: Laptop RTX 4090: 64.54 Laptop RTX 5080: 59.23 1440P: Laptop RTX 4090: 106.27 Laptop RTX 5080: 98.39 1080P: Laptop RTX 4090: 133.13 Laptop RTX 5080: 124.02",
                "author": "Antonis_32"
            },
            {
                "raw_content": "Didn’t watch the video, just read TLDW here, but I’m guessing since they are about the same at 4K, the difference in 1080p and 1440p is because of the CPU. With equal GPU power, equal performance. So basically buy whichever one is the cheaper. Right?",
                "author": "snapdragon801"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Daniel Owen- RTX 5070 vs 5070 Ti- Is it worth it?",
        "score": 1,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TLDR/TLDW: GPUs tested: Asus Prime RTX 5070 Ti 16GB Gigabyte Gaming OC RTX 5070 12GB Cheapest price for RTX 5070 Ti: - EU is around 803 euros - USA is around 830 dollars Cheapest price for RTX 5070: - EU is around 550 euros - USA is around 550 dollars Geomean of all tests (1080P, 1440P and 4K mixed settings): RTX 5070 Ti is 24% faster At 4K (native and upscaled DLSS performance) percentage differential, geomean: the RTX 5070 Ti is 29% faster At 1440P (native and upscaled DLSS balanced) percentage differential, geomean: the RTX 5070 Ti is 22% faster",
                "author": "Antonis_32"
            },
            {
                "raw_content": "It feels like Nvidia is definitely going for the up-sell here. You could get the better value card, but with Vram concerns, or give them way better margins and average sale price by stepping up to the 16GB model.",
                "author": "GloriousCause"
            },
            {
                "raw_content": "It looks like he's using the modded benchmark version of MH Wilds. Someone should tell him he should really test the dlss4/TU2 patch version of the game since they significantly lowered vram usage",
                "author": "six_artillery"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "As someone who was really bad at Mario Kart 8, Mario Kart World is dream come true!",
        "score": 76,
        "text_content": "Hi guys! I don't know about you but I was never able to enjoy Mario Kart 8, I'm really really sorry, I tried to enjoy it for years, but I never liked the controls, and I was unable to enjoy 150cc. The most fun I ever had was with 200c, and even then I'm sure you know how BS that whole mod can be sometimes. And of course, I didn't even bother with online matches, naturally I always got last due to my lack of skill and all of that. HOWEVER With Mario Kart World is different, first, I love the open world, precisely because I just run to my hearts content, if I find a P switch then good! And if I don't then that's good too. And my biggest enjoyment comes from Knockout Tour, holy shit guys, I lose the majority of the time, but when you are in that top 8 racers that's just the best feeling, well, second best. The best feeling of them all is when you actually get into first place!! (I've been able to do it two times now, in real online races of course) So yeah! I just wanted to show some appreciation to the game, I'm really happy to say that I can enjoy this game and this new direction for the series, can't wait for Donkey Kong next week!",
        "comments": [
            {
                "raw_content": "Knockout Tours are just what Mario Kart needed. This is easily my new favorite mode, to the point where I've played it way more than regular races. I really hope we get additional rallies to race on in the future, this mode is so fun!",
                "author": "MegaFloppy69"
            },
            {
                "raw_content": "I love it and I’m with you. I understand people’s gripes with it but I’m having a tonne of fun. I absolutely love knockout online. Yeah it’s mayhem but also staying out of that and taking a good line is part of it. Each stage is an achievement in itself. I was just about to win my second online knockout race last night was in the clear and about to cross the finish line and out of nowhere someone took a shortcut and beat me on the line. Just made me laugh tbh. Still a fantastic fun race and coming second is no mean feat. I’ve already equaled my playtime of MK8 and were only a month in.",
                "author": "BanjoPants74"
            },
            {
                "raw_content": "Mario Kart 8 is still all around the better package. The lack of options in World are utterly infuriating. Its something that can be fixed but as of now I'd rather play 8",
                "author": "Waste-Reception5297"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Switch 2 might just be my favorite console of all time",
        "score": 268,
        "text_content": "Objectively and subjectively, it’s hard to argue that the Switch 2 sucks. I mean the hate it gets online is very dumb and think about it, you get to play all of your switch 1 games and also get to play all the NSO consoles (NES, SNES, N64, GBA, GBC, Genesis) and with the addition of GameCube and Switch 2 games so already a HUGE library. Also graphical enhancements to games like Zelda is a huge win and the mouse gimmick is gonna be cool for the upcoming games to come out with it. Honestly I can just fully admit that this is by far the best gaming console of all time.",
        "comments": [
            {
                "raw_content": "Only the people who don't have it are hating but everyone who owns one loves the Switch 2. The only annoying flaw are the prices (the console itself is fine, but games and accesories aren't). Almost every other aspect is perfect or is not that good but relevant enough either to hate it.",
                "author": "Neat_Sky_3268"
            },
            {
                "raw_content": "You have to admit the battery life is ass.",
                "author": "137thaccount"
            },
            {
                "raw_content": "I’ve been playing on switch 1 for a while, then went back over to the switch 2 it feels 1 million times better",
                "author": "rug1998"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo please I need my updated banana graphic now 😫",
        "score": 125,
        "text_content": "I know I have to wait but wanted to post this has a joke lol",
        "comments": [
            {
                "raw_content": "The Rabbit ate your Updated Banana ![gif](giphy|10xUg8DdgQSs9i)",
                "author": "StockHumor4768"
            },
            {
                "raw_content": "Just switch your time zone to Thursday.. easy",
                "author": "Bootychomper23"
            },
            {
                "raw_content": "I have always thought the game thumbnail should be different than the box and cartridge art. They spend all this money and ***we*** spend all this money just to see one picture on every facing they can slap it on. Why can't they make our purchases more interesting and exciting?",
                "author": "EsrailCazar"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Donkey Kong Bananza is out in the wild, here are some pics of the spine and back of the box 🤩🤩🤩",
        "score": 868,
        "text_content": "Can't wait to get my hands on this.",
        "comments": [
            {
                "raw_content": "Quick add a spoiler tag before that one guys friend sees Pauline!",
                "author": "junglespycamp"
            },
            {
                "raw_content": "I need to check and confirm if all games have this, but the \"Basic reading ability is needed to fully enjoy this game\" line on the back is killing me 😂 Looking forward to getting this next week",
                "author": "Background_Orange_18"
            },
            {
                "raw_content": "Oh, banana!",
                "author": "Farnic"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Just some of my favorite screenshots",
        "score": 263,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What is the game with the two trolls and the full moon???",
                "author": "Ashamed_Round_9173"
            },
            {
                "raw_content": "Not OP, but I'm playing Captain Toad Treasure Tracker right now and it's really fun and charming. It's not very challenging but very well done.",
                "author": "SebNYD"
            },
            {
                "raw_content": "How’d you get widescreen on wind Waker?",
                "author": "SpaceIsAce"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Finished my Mario Kart Lego set.",
        "score": 51,
        "text_content": "Fun Build. Not tough at all. My son and I had a blast with this one. Now back to my Switch 2.",
        "comments": [
            {
                "raw_content": "You put his ears on reversed haha",
                "author": "Pale_Note2750"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "And now we wait!!",
        "score": 282,
        "text_content": "And the wait begins...... Who else is pumped for the game? Can't wait to see if DK gets any other transformations.",
        "comments": [
            {
                "raw_content": "Mario kart world is good don’t get me wrong, But I’m excited for the first true Nintendo switch 2 single player exclusive.",
                "author": "Slightly-Blasted"
            },
            {
                "raw_content": "Quick! Mark this as spoiler so that one guy's friend doesn't see Pauline!",
                "author": "SelectInstruction262"
            },
            {
                "raw_content": "these are gonna be the longest 5 days of my entire life",
                "author": "itsgerii"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "How to set HDR perfectly on your Nintendo Switch 2 using Cyberpunk 2077",
        "score": 115,
        "text_content": "So I know theres a lot of articles out there explaining how to set the HDR on your Switch 2 if your tv doesn't have an HGIG mode. Most of these just tell you to do a certain amount of clicks based on your TVs max brightness. However, I just discovered if you go into the HDR settings in Cyberpunk 2077 it will tell you the exact value your maximum brightness is currently set at on your Switch 2. Then you can go back and adjust the HDR settings on your Switch 2 to match your TVs value exactly. Cyberpunk 2077 locks maximum brightness at what your Switch 2 is set at.",
        "comments": [
            {
                "raw_content": "https://www.reddit.com/r/NintendoSwitch2/s/aUmUBKDLTw",
                "author": "GreenSeaNote"
            },
            {
                "raw_content": "This only works for the maximum brightness setting, which is the first setting in your Switch 2s HDR settings. For the 2nd setting, brightness, start with the slider all the way to the left and add 5 clicks if your tvs maximum brightness is over 1000 nits. If your tv is 1000 nits or under try 6 clicks.",
                "author": "Top-Notice1729"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Jason Schreier implies the Dragon Quest VII Remake is real, just in a smaller scope",
        "score": 237,
        "text_content": ">\"I think it's safe to say that Square wants to remake as many DQ games as possible for modern platforms. Doesn't mean all or any of them are going to be big ambitious revamps like FFVIIR.\" >*\"Why Jason, I want this so bad! This was the DQ game that actually clicked for me.\"* >\"I didn't say there's no remake!\" [source](http://resetera.com/threads/mp1st-square-enix-developing-dragon-quest-vii-remake-planned-for-release-in-2026.1242312/page-3#post-142607631) [previous rumour](https://mp1st.com/news/square-enix-developing-dragon-quest-vii-remake-for-release-in-2026)",
        "comments": [
            {
                "raw_content": "#Jason Schreier is a Tier 1 - Very Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Guessing its just an HD upgrade of the 3DS version just like Bravely Default's Remaster.",
                "author": "Animegamingnerd"
            },
            {
                "raw_content": "Damn, was really hoping they'd do 4, (especially) 5, and 6 first...",
                "author": "DoctorLudnik_717"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Copies of DK Bananza are out in the wild.",
        "score": 209,
        "text_content": "",
        "comments": [
            {
                "raw_content": "![gif](giphy|2I5DVBfFNkPQc)",
                "author": "crossingcaelum"
            },
            {
                "raw_content": "![gif](giphy|TrBHMSDuD0O4SzI6uY)",
                "author": "Calhalen"
            },
            {
                "raw_content": "I just need to see K Rool dawg",
                "author": "MagazineInfamous6142"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "MP1st: Dragon Quest VII Remake in development, planned to be released in 2026",
        "score": 345,
        "text_content": "[source](https://mp1st.com/news/square-enix-developing-dragon-quest-vii-remake-for-release-in-2026)",
        "comments": [
            {
                "raw_content": "Worth noting that this article is written by eXtas1s: #eXtas1s is a Tier 4 - Generally Unreliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)**",
                "author": "ImAnthlon"
            },
            {
                "raw_content": "They're gonna remake all 11 Dragon Quest games before we see 12 lol",
                "author": "Xenobrina"
            },
            {
                "raw_content": "I wonder if this is a port/upgrade of the 3DS remake. That would still qualify for the \"remake\" terminology. I can't imagine a game as big as DQ7 is getting a full ground-up remake, especially before 4-6 get one.",
                "author": "rms141"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Krafton confirms leaked Subnautica 2 docs are real",
        "score": 612,
        "text_content": "https://insider-gaming.com/krafton-confirms-leaked-subnautica-2-dev-document/ Previous rumour: https://www.reddit.com/r/GamingLeaksAndRumours/s/mL97UGbL7X",
        "comments": [
            {
                "raw_content": "Wow, one of the few times a shitty phone picture of a screen instead of a screenshot was actually real.",
                "author": "I-wanna-fuck-SCP1471"
            },
            {
                "raw_content": "this doesn't look great for the subnautica devs, they missed multiple milestones and the game is missing a third of it's planned content AND the publisher is wanting to GIVE them more time? this is usually...the opposite",
                "author": "Cabrakan"
            },
            {
                "raw_content": "After that statement by Krafton, I was second guessing because they were very blunt and that had to be overlooked by lawyers too. But this just confirms the 3 leads were being lazy and trying to push out a extremely barebones product (the early access is not a excuse when you a have a corporate backing) after missing many deadlines for content completion. They said they're sueing Krafton but I think Krafton will be the winners here. I'm sure there's something in the contract that help Krafton by kicking them out if they weren't meeting deadlines or similar",
                "author": "OKgamer01"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel bombshell: Chipmaker will lay off 2,400 Oregon workers",
        "score": 86,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We were told at oregon it's going to be 2 more waves and more focused on orgs that are defunct.",
                "author": "Improvingmyself971"
            },
            {
                "raw_content": "This was not unexpected. The expected layoff % is 15-20%",
                "author": "engprog"
            },
            {
                "raw_content": "I feel really sad for engineers laid off, middle management not so much but I've seen Intel employees post here saying it's targeting is very ham fisted.",
                "author": "Spooplevel-Rattled"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Unsold homes surge nationwide as housing market stalls",
        "score": 105,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nobody buy until it bottoms. Let the markets sink.",
                "author": "MetalstepTNG"
            },
            {
                "raw_content": "Huge disconnect between sellers price and buyers price.",
                "author": "SGAisFlopden"
            },
            {
                "raw_content": "Do deported people by homes or sell homes?",
                "author": "Dry-Interaction-1246"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "High costs keeping many from homeownership, 'cornerstone of the American dream'",
        "score": 37,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Two thirds of US homes are owner occupied.",
                "author": "aquarain"
            },
            {
                "raw_content": "Refusing to move an inch on the map is equally preventing people from home ownership.",
                "author": "KoRaZee"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Fred latest active housing inventory update for June shows housing inventory increase through out the US",
        "score": 35,
        "text_content": "It blew away even my expectations, inventory levels have increased nationwide. Inspite of some better than expected economic data and mortgage rates (rates went back up this week). Wow anyway looking at the numbers Texas almost 30% higher than pre Covid highs.. https://fred.stlouisfed.org/series/ACTLISCOUTX Georgia starting to get near its Covid highs https://fred.stlouisfed.org/series/ACTLISCOUGA Florida saw slight dip but still very elevated https://fred.stlouisfed.org/series/ACTLISCOUFL California the next Florida/Texas? Inventory spiking rapidly https://fred.stlouisfed.org/series/ACTLISCOUCA Washington sets new highs https://fred.stlouisfed.org/series/ACTLISCOUWA Good news in NEast. MA, NY showing inventory levels going up but still well below pre pandemic levels. I expect normalization by next summer if trend continues https://fred.stlouisfed.org/series/ACTLISCOUMA https://fred.stlouisfed.org/series/ACTLISCOUNY Full state level data (every state has increased compared to last June) https://fred.stlouisfed.org/release/tables?rid=462&eid=1129344#snid=1129387",
        "comments": [
            {
                "raw_content": "It’s almost like…. Homes are historically overpriced.",
                "author": "NorCalJason75"
            },
            {
                "raw_content": "The inventory numbers for DFW is insane.",
                "author": "beardko"
            },
            {
                "raw_content": "I can't believe we're almost 12 hours in and not a single person has come along to tell everyone about the house in their neighborhood that sold for double the asking price 20 minutes before they even signed the contract with their seller's agent",
                "author": "SucksAtJudo"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Am I dumb to sell my condo instead of trying to rent it? 2.875% mortgage.",
        "score": 14,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Being a landlord sucks. Maybe it works in California but in Texas you pay so much property tax and insurance it makes it worthless to rent it out unless you have it paid off",
                "author": "DesignerCalendar5104"
            },
            {
                "raw_content": "If he can get the rent to cover his cost (seems he at least think he can) it's a no-brainer",
                "author": "Capital-Giraffe-4122"
            },
            {
                "raw_content": "Zero showings for 315k and banking on 2250/month rent. Seems unlikely!",
                "author": "sifl1202"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "My mom is having a hard time selling her apartment in Glover Park; is the market that bad??",
        "score": 25,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The market is slow, but a 1b 1ba condo doesn’t appreciate or sell quick in essentially any market. Specially an old one",
                "author": "DesignerCalendar5104"
            },
            {
                "raw_content": "Lot of demand for these condos came during Covid as new investors flocked to buy them after listening to a few RE gurus. This caused condo prices which have flat for decades in areas like this to double or triple literally. Builders took advantage building more, while instead of targeting low income/starter home buyers (as they had orginally planned) they basically targeted these new RE investors. Now the reality has set in as they realize that Hoa fees, assessments, maintenance costs and vacancies have eaten away their passive income and it seems folks are in a rush to dump them while they can.",
                "author": "Dmoan"
            },
            {
                "raw_content": "This makes me even more pissed that Amazon's \"HQ2\" shopping was a gigantic feint that they never intended on following through with and was ultimately just a tool to try to pressure the govts of Seattle and WA into giving them a tax break. If Amazon truly did start to leave town I might finally be able to afford a home here",
                "author": "SubnetHistorian"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "NVIDIA CEO Jensen Huang: “50% of Global AI Researchers Are Chinese”",
        "score": 1751,
        "text_content": "So how did this happen? How did China get ahead in AI, at what point did they realize to invest in AI while the rest of the World is playing catch up?",
        "comments": [
            {
                "raw_content": "1) There are alot of Chineese people 2) They strongly invest in education 3) They invest heavily in their research labs. All these investments to make China a STEM powerhouse are a key element of Xi’s national policy. These have been long term investments for 20+ years now",
                "author": "QuailAggravating8028"
            },
            {
                "raw_content": "Because their government defined AI Research as a core pillar of their \"new generation ai development plan for 2030\" strategy, which they adopted back in 2017. This wasn't like the company-level strategies you see in the west. It came directly from the policy makers themselves. We're seeing the results now. 7 years after that policy, with a load of new PHDs around AI/ML = most research in the space is Chinese. I actually work alongside a PhD Data Scientist from China and he said - back home - the attitude towards progress is completely different. There is no protectionism ( think OpenAI hiding reasoning models for months ) as everyone is working to a common goal. If university A makes a breakthrough, they share it, and collaborate wherever possible to facilitate the national strategy. Edit - Since this sparked a bit of debate, a prime example is Tsinghua University. I asked my Chinese colleague why their research is SO good and he said it's because research is seen as noble and honourable in China. Publishing weak or sensationalist research (even preprint) is seen as very undesirable. Xi jingping went to that University and NOBODY dare be the person to disgrace his reputation in any way. For context, the acceptance rate at my university (2nd best in world at the time) was around 30%, and the acceptance rate at Tsinghua university is around 0.3% in a country where getting anything less than perfect grades is seen as failure...",
                "author": "EarEuphoric"
            },
            {
                "raw_content": "Working in academia and the tech industry, it really feels like 50% of people in science & engineering in the US are Chinese.",
                "author": "cancolak"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "SpaceX to invest $2 billion in Musk's xAI",
        "score": 255,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I take coins from one pile and add them to my other pile.",
                "author": "Deciheximal144"
            },
            {
                "raw_content": "this is what elon just did https://preview.redd.it/u3juq2uksjcf1.png?width=537&format=png&auto=webp&s=60f70716d44193dc344b4e2d8f6cf7f47599e508",
                "author": "ZealousidealBus9271"
            },
            {
                "raw_content": "sometimes you forget that Elon thinks the letter X is cool and then you read this and you think, right, he thinks the letter X is cool",
                "author": "Quissdad"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "SpaceX invests in X.ai",
        "score": 45,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Well... as an investor all these intra musk shenanigans would have me worried tbh.",
                "author": "Gods_ShadowMTG"
            },
            {
                "raw_content": "https://preview.redd.it/b6fhz05silcf1.jpeg?width=996&format=pjpg&auto=webp&s=31002b4af4e59b822ba3a80d966fe5b268d65de5",
                "author": "truthwatcher_"
            },
            {
                "raw_content": "https://preview.redd.it/bvn088gyklcf1.png?width=680&format=png&auto=webp&s=108a505b121712e0e6515ebb773157de0cc71bf1",
                "author": "NewerEddo"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Brett Adcock predicts physical and digital agents will do everything a human can by the end of this decade. 👀👀",
        "score": 44,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Can't wait to get unemployed 😊",
                "author": "Pro_RazE"
            },
            {
                "raw_content": "😂 second image caught me off guard, love it",
                "author": "Beeehives"
            },
            {
                "raw_content": "but can they shit themselves in their sleep?",
                "author": "Relative_Issue_9111"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "We Got 100% Real-Time Playable AI Generated GTA Before GTA 6...",
        "score": 234,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We'll get AI generated GTA 7 before Rockstar releases it.",
                "author": "OttoKretschmer"
            },
            {
                "raw_content": "The data from GTA6 streams would just make it stronger.",
                "author": "Fit-Repair-4556"
            },
            {
                "raw_content": "\"Playable\" doing a lot of work here",
                "author": "Commercial_Sell_4825"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The US Department of Energy warns that blackouts could increase by 100 times in 2030 as AI Growth Outpaces U.S. Power Grid Capacity \"The status quo is unsustainable\"",
        "score": 605,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That is why some of these AI companies are buying their own nuclear reactors.",
                "author": "NyriasNeo"
            },
            {
                "raw_content": "China is adding green power capacity at a rate of 5 nuclear power plants per week, with usable energy output of one nuclear power plant per week. Its equivalent of USA building 208 nuclear powerplants during Trumps rule. USA currently has 54 nuclear poweplants with 93 reactors, from the beggining of nuclear time. So in 4 years China will more than double whatever USA built since 1945. If they figure out storage in this 4 years, multiply everything by 5, it will be around 1000 times. And its much cheaper, faster to build and more benevolent than anything nuclear, coal or oil/gas b1ased. At one point bullshit exposes itself as clear bullshit. Like in, math doesnt math anymore :)",
                "author": "sant2060"
            },
            {
                "raw_content": "Hopefully AI reaches a point where it can contribute to new methods of energy generation, such as fusion. I'm not as worried about it though as the article is making it. These companies will figure out a way *driven by the radical green agenda*... Tell me again how this article wasn't written by a Republican with an agenda.",
                "author": "Weekly-Trash-272"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "In seconds, AI builds proteins to battle cancer and antibiotic resistance",
        "score": 30,
        "text_content": "",
        "comments": [
            {
                "raw_content": "[I would argue this article actually undersells the actual paper. Shockingly.](https://www.nature.com/articles/s41467-025-60612-9) Against my better judgement, it's hype time. A TLDR of the paper, in plain language, because good lordy it's a dense paper: E. Coli (and Shigella, and lots of bacterium really but these two are named explicitly) need to consume iron in order to survive and reproduce. This is often what limits how fast these bacterium can reproduce in the human body. This iron is often acquired by taking it from your hemoglobin directly! The outside of the bacterium have special tools (ChuA is the one targeted here because it's the most effective/has the highest binding affinity) that can grab hemoglobin, and then extract the heme cofactor (the iron.) Fox et al. (the above paper) used a wide set of tools to understand exactly how *this* hemoglobin-grabber works, and used AlphaFold to...well, design a plug, essentially. This plug - the \"binder\" - does what it says on the tin and binds to the iron-stealing tool on the outside of these bacterium. The binder mimics the shape of ChuA *just right* such that it can plug into ChuA sort of like hemoglobin would. In fact, it binds way better than hemoglobin does, and therefore even in *really* low concentrations, there's gonna be way more of this binder stuffed into ChuA than actual hemoglobin. It's just that attractive to the bacteria's ChuA. This means very little iron enters the bacterium, and then it cannot reproduce. This kills the infection. Among other things, this work demonstrated that these binders were both able to be manufactured, the manufacturing process strongly resembled the output of AlphaFold, the binders were *highly* effective right out of the box (see: directly from AlphaFold, no additional tweaks necessary), and learned a lot about the process of heme piracy (love that term) by E. Coli. **In summary: It just friggin worked.** A broader generalization (this is my interpretation now) is that it suggests that it is now possible to design bespoke antimicrobials (antibiotics) directly targeting cellular processes, as opposed to traditional routes that can take years to yield this same result. To maximize the hype: I'd put five bucks down on methods like this \"solving\" antibiotic resistant bacteria, inasmuch as we can just continue to crank out antibiotics as fast as they can pass the review process. Okay, hype is done. Let's turn the hype down. Funny thing about that review process. It would still take *many* years for something to go from *this* stage, to an actual medication, not to mention billions of dollars in testing, and all things of that nature. The failure rate of clinical trials for new medications is absurdly high. ...buuuut, that doesn't make this any less incredible. How exciting! Generative design is the single most exciting application of AI research that I've seen so far, and this is the greatest so far. (I think I made a good TLDR! Happy to make tweaks if I totally flubbed anything. Thanks for reading :))",
                "author": "AquilaSpot"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "They call him Jake the Cringebot",
        "score": 179,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That bot giving me all those compliments would’ve made my week.",
                "author": "llkj11"
            },
            {
                "raw_content": "Jake the Rizzbot is a Unitree G1 humanoid robot spotted around Austin, Texas, in public spaces like The Domain and downtown. It’s remote-controlled, not autonomous, and equipped with LIDAR and depth cameras for mobility. The bot wears a cowboy hat, silver chain, and sneakers, and speaks in Gen Z slang as part of a public-facing demo. It’s labeled “IN TRAINING” and appears to be a street test blending robotics with social interaction. It is. Ring remote controlled. In Detroit there is one advertising for a robot fight league Detroit resident spotted a full-size humanoid robot named Zion strolling down 7 Mile Road, stopping to shake hands and greeting pedestrians. The walk was part of a promotional demo for the upcoming RoboWar event on July 19, hosted by Interactive Combat League. Art Cartwright, the event organizer, emphasized that Zion is “harmless” and serves to familiarize the public with robotics and spark youth interest in STEM. Witnesses described the movement as “beautiful” and likened it to RoboCop. The appearance quickly went viral across social media and local news",
                "author": "Ok_Elderberry_6727"
            },
            {
                "raw_content": "https://preview.redd.it/5kjj1ijghicf1.jpeg?width=1068&format=pjpg&auto=webp&s=5d4b62a56f39735f2f3a6d6cd2630e5843afea21",
                "author": "ObiHanSolobi"
            }
        ],
        "subreddit": "singularity"
    }
]