[
    {
        "post_name": "Nate Friedman spoke to the ex-Director of a “Secret migrant shelter in Massachusetts,” he revealed - They charged taxpayers $100,000 per month for just Lyft rides for illegal immigrants - The entire facility was billed at full capacity even when not full - Empty rooms were not only billed every nig",
        "score": 330,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Everyone involved needs consequences for treason.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "Nate Friedman spoke to the ex-Director of a “Secret migrant shelter in Massachusetts,” he revealed - They charged taxpayers $100,000 per month for just Lyft rides for illegal immigrants - The entire facility was billed at full capacity even when not full - Empty rooms were not only billed every night not meals for the empty rooms were billed - Both Uber and Lyft got these payments, totaling roughly $1.2 million a year “I would have 10 empty rooms, but the state would still get billed $180 a night for those 10 empty rooms. They would still get billed for the meals in those room too. So there is a tremendous amount of waste and or fraud” “There's millions of more dollars in fraud” This is one facility, now multiple this by every facility, in every state. The theft to taxpayers is unfathomable",
                "author": "PiratePatriotParrot"
            },
            {
                "raw_content": "Clearly it is not just USAID money that is funding these projects.",
                "author": "knnbccb"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Infamous violent Portland Antifa militant John Hacker, who is Antifa’s chief doxxer, has arrived at the ICE facility in Portland. He immediately started filming ICE agents.",
        "score": 289,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So I have to ask about the face",
                "author": "America_No_1"
            },
            {
                "raw_content": "Why does every Antifa loon look like they either have the wrong number of genders or chromosomes?",
                "author": "Oback_Barama"
            },
            {
                "raw_content": "Dude looks like he used himself for molatov practice.",
                "author": "Tunk"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Although the perpetrator’s motive has yet to be conclusively determined, the location of the sh00ting was the #5 target on a list first distributed by \"Globalize the Intifada\" activists in November 2023.",
        "score": 242,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nah it wasn’t an attack on the place, guy went to a specific floor and killed 2 people before himself. Only killing a guard who was probably trying to stop him while reportedly allowing others to flee on the ground floor. Considering the other two was a man and woman it will probably end up being some type of revenge or anger against a lover/former lover.",
                "author": "Crlsniper"
            },
            {
                "raw_content": "I have to ask, why do people use obfuscation like ‘sh00ting’? I see it a lot here, and don’t understand what it accomplishes.",
                "author": "elmerecido"
            },
            {
                "raw_content": "So they guy drove from LV over 36 hours almost straight and he's following orders from 2023? That's an odd commitment",
                "author": "AngryPoop"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "CNN after they realized the shooter was black",
        "score": 1054,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Down the memory hole we go! …what shooting?",
                "author": "ThisTrainHasNoBrakes"
            },
            {
                "raw_content": "Just listen to the audio and imagine Gordon Ramsay in the maternity ward.",
                "author": "MightyBright"
            },
            {
                "raw_content": "# SHUT. IT. DOWN!",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "NOT Satire: UK Government Posts Job Opening For \"Sharia Law Administrator\"",
        "score": 934,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That is what a conquered nation looks like.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "We'll be seeing this in NYC soon.",
                "author": "MythArcana"
            },
            {
                "raw_content": "Jeez, didn't even take ten years.",
                "author": "Than0sIII"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 WTAF? North Carolina Democrat state Rep FUMES over deportations because, “The crops aren’t being picked.” “The hotels do not have anybody providing the service.” OMG! ROFLOL!",
        "score": 758,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Someone gotta get all this shit in a meme vidya for the midterms. They so worried about who's going to wipe their collective asses, they sell out everyone. What a fuckwit. With a whole buncha fuckwits voting for her. Apparently.",
                "author": "1inchgroup"
            },
            {
                "raw_content": "Democrats have always wanted their slaves to pick their crops. Nothing new under the Sun. ☀️",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "They have zero self awareness and are dead serious when they say this. Friend of an older relative, democrat of course, openly complains about Trump's deportations because it's making finding cheap yard help harder.",
                "author": "HoganP"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: FIVE people have been charged in the black mob’s vioIent assauIt on white tourists in Cincinnati",
        "score": 1761,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"I don't care what side of the fight they were on\" fuck you. If anybody threw fists, knives, or bullets in the name of defense of themselves, or other victims, they should be touted as a hero, not a villain.",
                "author": "toofdood1993"
            },
            {
                "raw_content": "Another DEI hire dyke in charge of a large city police dept. This was a mob, this wasn't a brawl, this was a mob of blacks attacking whites for the color of their skin, a hate crime. Pam Bondi's DOJ needs to charge them with Federal HATE CRIMES.",
                "author": "MemphisMontoya71"
            },
            {
                "raw_content": "We don't have a race problem, we have a problem race",
                "author": "Sea_Still"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A Daily Mail reporter went undercover on dating apps She sent the message “Hi, I’m MAGA” when matching with guys “The men who claimed to be liberal weren’t fazed at all — my inbox blew up”",
        "score": 887,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Summary: 79 out of 80 Men on dating sites will pretend to be anything as long as theres a chance they can plow some poon.",
                "author": "Serp-Patriot"
            },
            {
                "raw_content": "It's cause they are sure she doesn't have a dick.",
                "author": "Ur2sm4rt"
            },
            {
                "raw_content": "Look, I'm a lonely guy. I've tried apps before, I might get like a handful at likes at best over the course of a few weeks. The only time I get matches with those I send out are from bots or those who accidentally swiped right, because they'll immediately unmatch. All of the conservative women, if you swipe on them you get told that she's \"a popular profile\" and you should send a super like (paid feature) instead, so good luck. Unfortunately I don't seem to fit into the categories of men that either side of the spectrum are looking for. Liberal women see me and pass because I'm not 'metrosexual'. Conservative women pass because I'm not a blue collar \"cowboy\" with a lifted truck. I'm an (aspiring) white collar conservative. I never list my politics on my profile, though. I don't believe I'm a bad looking guy, but I think it's just that I can't stand up to the top 10% of men on these apps who are fucking like 80% of the women on there. The women who do send me likes are usually fat, are single moms, have no goals in life, etc. I can do better than that.",
                "author": "LogicCircuits"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Scott Presler: Republicans are 58,530 *active* voters away from flipping Pennsylvania 🟦🔜🟥. This is the LOWEST recorded democrat advantage in modern history. Last week Republicans were 67,635 active voters away from flipping Pennsylvania.",
        "score": 1626,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nice job Scott! Keep up the great work! 🇺🇸",
                "author": "SpaceWizard"
            },
            {
                "raw_content": "Please come to NJ, Scott!",
                "author": "Carmen1956"
            },
            {
                "raw_content": "https://x.com/ScottPresler/status/1949829465766301762 [On January 27th Republicans were 189,109 voters away from flipping Pennsylvania 🟦🔜🟥. ](https://x.com/ScottPresler/status/1883902869159678254) If this keeps up for the next 14 weeks until November 4th, with 9,105 or more (like this week) switching party affiliation from Democrat to Republican in Pennsylvania, then Republicans will have a lead of 68,940+.",
                "author": "Mr_Rightside"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Kaitlin Bennett was attacked by an unhinged Democrat in DeLand, Florida who threatened to K*LL her and all Trump supporters. This is the violent left in action.",
        "score": 802,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Look how tough this faggot is with this girl. Wish I was there.",
                "author": "JoeMcCarthyWasRight"
            },
            {
                "raw_content": "The party of foreign rapists is complaining about Trump again.",
                "author": "MythArcana"
            },
            {
                "raw_content": "Was just visiting Rhode Island this past weekend. Saw a group of retards who looked just like this guy protesting Trump. Boomers who can’t let go of their hippie days. The same retards that fucked the millennial economy.",
                "author": "TheRPatriot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A newly released photo shows the body of 27-year-old Shane Tamura, a former high school football star, lying inside the Manhattan office building with his hand still gripping the assault rifle. Tamura has been identified as the gunman in the deadly NYC shooting.",
        "score": 756,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not an assault rifle.",
                "author": "ciaramella_is_gay"
            },
            {
                "raw_content": "He's White!",
                "author": "barwhack"
            },
            {
                "raw_content": "Be aware of the term \"narcissistic rage.\" Narcissists/sociopaths rely on lies, bribes, threats and manipulation to stay in control of everyone else. But when narcs/sociopaths realize that their bullshit isn't working anymore, and the lies fall apart and people begin to see them for what they really are, they become furiously angry. That's when they start lashing out with physical violence. That's because they don't have any other way to get people to do what they want. You'll see it in individuals, like a family member who suddenly gets violent at home. You'll see it in governments and in entities like WEF who suddenly and viciously crack down on their people. We're seeing it right now with this shooting in NYC today. And as long as the Leftists are still not getting what they want (and they won't,) they will only become more and more enraged and violent and destructive. Never forget this. Be aware of your surroundings 24/7. It's almost certain to get worse before it can be stopped.",
                "author": "Cuetardian"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This is one of my favorite accounts on TikTok. Uncle Clif just puts it out there.",
        "score": 588,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Based black man. Agree with every single word he said, and I don't give a fuck if that makes me a racist. If I'm such a horrible, awful person, then get the fuck away from me",
                "author": "magapatriot_pa"
            },
            {
                "raw_content": "My Uncle Clif, getten this bitch on outta here. He ain't taking no shit, no sir. You can tell he worked hard his whole life.",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "black fatigue is real.",
                "author": "1777"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "To all Trump hating TDS-tards: the harder you CRY, the HARDER we WIN!!",
        "score": 1452,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The Rats are at 19% and falling",
                "author": "Sea_Still"
            },
            {
                "raw_content": "imagine if he just got fair covered. he'd be the most popular president in history",
                "author": "ughicanteven"
            },
            {
                "raw_content": "I put zero stock in polls. I do however understand that the current crop of Dems have ZERO pull, swag, play etc.. I also do know that Trump is kicking ass on global and US policies.",
                "author": "MixedBlacknWhite"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Reports: Manhattan gunman used M4 rifle...",
        "score": 553,
        "text_content": "",
        "comments": [
            {
                "raw_content": "a civilian with an m4? interesting",
                "author": "-Evspra"
            },
            {
                "raw_content": "It wasn't an M4 I literally own a Palmetto State PA-15 .223 and its an AR-15 not an M4 which is fully automatic",
                "author": "MAGAfarmer"
            },
            {
                "raw_content": "Officer Didarul Islam, and arrested fuckers screaming free Palestine. This shit has me laughing.",
                "author": "Geralt_of_Rivia1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ICE has arrested an illegal who was hired as a POLICE OFFICER in Maine. Democrats have gone SO FAR off the deep end, they’re giving illegals the power to arrest YOU.",
        "score": 1756,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Been the plan the entire time. Tavistock studied the fall of the Roman Empire. Providing the invaders authority to abuse the citizenry is a core component.",
                "author": "Ch3f4554551n"
            },
            {
                "raw_content": "You would spend the rest of your life in prison for defending yourself against this criminal",
                "author": "ohwell316"
            },
            {
                "raw_content": "Everyone from the Chief do the bitch in HR who approved this need to be jailed! My son is in law enforcement and background check took 6 months. Fine tooth comb on everything he ever did. Now illegals get another free pass? FK ME!",
                "author": "FuckU/Spez"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I’m in Scotland now after having just completed the EU Deal, and numerous others. The United States is doing GREAT, to put it mildly!!!",
        "score": 462,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I bet his Scottish mom is looking down from heaven smiling at his son.",
                "author": "38WendysHamSquare79"
            },
            {
                "raw_content": "Great, now chain Starmer to the wall in the basement and summon the Inquisitor. It's time.",
                "author": "MythArcana"
            },
            {
                "raw_content": "I can't wait till Daddy's done work and gets home. You're gonna get in big trouble when he finds out you still want the Epstein list.",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Manhattan active shooter found dead on the 33rd floor - NYP",
        "score": 959,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So... not active then?",
                "author": "NancyPeloci"
            },
            {
                "raw_content": "33 wut",
                "author": "charliesean"
            },
            {
                "raw_content": "33. IYKYK",
                "author": "alcowiggles"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Fake News is reporting that I am SEEKING a “Summit” with President Xi of China. This is not correct, I am not SEEKING anything! I may go to China, but it would only be at the invitation of President Xi, which has been extended. Otherwise, no interest!",
        "score": 430,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I think he meant to say that China is begging him to visit because they are about to collapse. That sounds more accurate to me.",
                "author": "MythArcana"
            },
            {
                "raw_content": "DONALD TRUMP, DONT TRUST CHINA!!! CHINA IS ASSHOE...",
                "author": "bigjoe1313"
            },
            {
                "raw_content": "Sum ting wong",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Starmer Had To Go Visit Trump At His Scottish Castle",
        "score": 1116,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The Art of the Power Move",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "I can hear Trump now: >This is one of the smaller properties I own, but has been a decent ROI",
                "author": "America_No_1"
            },
            {
                "raw_content": "Damn I want a castle now",
                "author": "South_Florida_Guy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "NYC midtown shooting live: At least 3 hurt, including NYPD cop as shooter storms Park Ave building, home to Blackstone, NFL",
        "score": 852,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It’s a Muslim",
                "author": "Dway"
            },
            {
                "raw_content": "But guns are illegal in NYC…how could this happen??",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "I urge everyone to keep it on your persons these days. Between Cincinnati, Michigan, all these random church attacks, and this event. It's very clear our administration is making some bold moves and the opposition is waging a war on every front fathomable.",
                "author": "SouthSideBagMan"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Exclusive: Cadence to plead guilty and pay $140 million to US for China sales",
        "score": 22,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">Cadence and its subsidiary Cadence China exported electronic design automation tools at least 56 times to CSCC between 2015 and 2020, with certain Cadence China employees facilitating business with NUDT while knowing CSCC was an alias for the restricted university, court papers said. So still during Lip-Bu Tan's term as CEO at Cadence",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "I wonder how much of a portion that 140 mill is compared to the profit they made",
                "author": "krankyPanda"
            },
            {
                "raw_content": "Non-paywall: https://archive.is/20250728204834/https://www.reuters.com/world/china/cadence-plead-guilty-pay-140-million-us-china-sales-2025-07-28/",
                "author": "-protonsandneutrons-"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Your VPN Kill Switch Won't Always Stop All Leaks - Data Gathered Objectively Testing 20+ VPNs",
        "score": 177,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hi! I'm the networking and VPN writer at RTINGs, and I worked with our engineers, testers, and video team to release this video. I'll be around to discuss any questions about VPNs, our testing, privacy, or whatever else!",
                "author": "duncanRTINGS"
            },
            {
                "raw_content": "Somewhat relevant now that the UK is starting on their own great firewall.",
                "author": "slither378962"
            },
            {
                "raw_content": "I learned the hard way. Got popped. It is fixed now, but yeah a software level kill switch is no good. If the software fails, the data still travels (just not through your VPN anymore).",
                "author": "Minimum-Account-1893"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "NVIDIA GeForce RTX 50 SUPER rumored to appear before 2026 - VideoCardz.com",
        "score": 172,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Original source: [TweakTown](https://www.tweaktown.com/news/106675/geforce-rtx-50-super-series-on-track-for-holiday-2025-release/index.html). Edit: also an unverified rumor. There's no real info here. >based on information obtained from sources, the RTX 50 SUPER Series refresh is actually on track for a holiday 2025 or Q4 2025 release.",
                "author": "InevitableSherbert36"
            },
            {
                "raw_content": "The 5070 Super will be my next GPU if it manifests with that 18GB of VRAM. I'd get the normal one but i just can't justify replacing my 2021 12GB 6700XT with another 12GB GPU in the year of our lord 2025",
                "author": "Firefox72"
            },
            {
                "raw_content": "Guessing no 5090 Super/TI this time around either though.",
                "author": "jedidude75"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Thermal Grizzly’s almost ready to launch their first GPU water block",
        "score": 27,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’m guess it costs something crazy like $500 knowing thermal grizzly.",
                "author": "RandomFatAmerican420"
            },
            {
                "raw_content": "I wonder what ever happened to their 5090 FE block. It's kind of funny that a 'dead' company (EKWB) beat them, and everyone else, to the punch on that.",
                "author": "Firov"
            },
            {
                "raw_content": "I just hope they don't fall into the same trap as EK where some of the watercooling engineers came from. Don't get a completely bloated watercooling portfolio that binds a lot of capital and might need to get an expensive write-off once a GPU generation is no longer sought after.",
                "author": "MrDunkingDeutschman"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "My Commodore 64 has an HDMI port now.",
        "score": 14,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel QAT Accelerators Being Demoted On Linux By FSCRYPT: Bug Prone & Slow",
        "score": 12,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The same is applicable to Arm servers which is mentioned in the article but isn't reflected in the headline. Whatever brings the clicks for ad revenue I guess.",
                "author": "Professional-Tear996"
            },
            {
                "raw_content": "Well damn that didn't last long",
                "author": "EasyRhino75"
            },
            {
                "raw_content": "Depressingly fitting in light of the NEX news.",
                "author": "BatteryPoweredFriend"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Ferroelectric Helps Break Transistor Limits. Negative capacitance boosts GaN devices without the usual tradeoffs.",
        "score": 27,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TIL: negative capacitance is a thing. Really interesting tech.",
                "author": "EloquentPinguin"
            },
            {
                "raw_content": "I read recently news from semiengineering which also talked about this type of transistor but a different group/company had actually fabricated an actual prototype: https://terraquantum.swiss/news/europes-chip-moment-terra-quantum-revolutionizes-ai-world-with-new-super-transistor Just thought I should share it since it seems they are doing similar things in the research paper.",
                "author": "GunZinn"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "I wonder, since we're seeing stuff like thermosiphons or VCs explored again, if one company is going to experiment with pulsed heat pipes for CPU cooling.",
        "score": 24,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Also known as oscillating heat pipes, if you want a related search term.",
                "author": "VenditatioDelendaEst"
            },
            {
                "raw_content": "Cool idea. Pulsed heat pipes might actually help with hotspots, especially on chiplets. Probably a bit complex for mass-market coolers, but would love to see someone try it.",
                "author": "TheComponentClub"
            },
            {
                "raw_content": "I'm more interested in seeing Cooler Master's 3D heatpipes in a finished product.",
                "author": "kikimaru024"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Let's fucking go",
        "score": 1408,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’m going to kill so many flies.",
                "author": "small___potatoes"
            },
            {
                "raw_content": "The reveal video was actually pretty neat and funny, Nintendo should do this for all classic releases. At least the significant ones.",
                "author": "Obienator"
            },
            {
                "raw_content": "So it's a switch 2 only SNES game? Edit: nvm, I remember hooking a mouse up for game builder garage, you can do it on switch 1.",
                "author": "doctorhino"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "An attempt was made",
        "score": 297,
        "text_content": "Lol I tried I don't usually draw with mouse and prefer stylus but I'm willing to learn.",
        "comments": [
            {
                "raw_content": "Cute Rosalina <3 This app has hands 😭 https://preview.redd.it/tr909b9roqff1.jpeg?width=1920&format=pjpg&auto=webp&s=51b1892c95e832d0b028ebf4ec6fcab593c4f845",
                "author": "Holiday-Froyo-5259"
            },
            {
                "raw_content": "She's beautiful",
                "author": "Blue-Stinger475"
            },
            {
                "raw_content": "Awesome!",
                "author": "Pokeguy211"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Based Poppy Kong",
        "score": 765,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good character, I liked her a lot. Her boss fights are the biggest joke in the game though, just ridiculously easy.",
                "author": "hamtaxer"
            },
            {
                "raw_content": "I really really liked Poppy Kong, I hope we see her in other games",
                "author": "MrNintendo13"
            },
            {
                "raw_content": "Its giving Charisma, Uniqueness, Nerve, and Talent! I got to this point last night and I was hollering! I would have done the same.",
                "author": "techi23"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo Switch 2 Firmware Update 20.3.0 is now available.",
        "score": 309,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Only thing is - General system stability improvements to enhance the user's experience.",
                "author": "Delightful_Dantonio"
            },
            {
                "raw_content": "“Say the line Bart…”",
                "author": "Meta13_Drain_Punch"
            },
            {
                "raw_content": "Ver. 20.3.0 (Released July 28, 2025) General system stability improvements to enhance the user's experience.",
                "author": "Training_Project1971"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Mario paint! Not a new version though",
        "score": 279,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Also the SNES app got button remapping with this update!",
                "author": "Tigertot14"
            },
            {
                "raw_content": "The bastards did it.",
                "author": "NarcissisticHedonism"
            },
            {
                "raw_content": "This is so awesome! I never owned an SNES as a kid, but one of my earliest core memories is the weekend we rented one from the video store along with Mario Paint and the mouse. I sat on the couch and played around with it with my dad for what feels like the entire weekend. So fun.",
                "author": "blasto2236"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I Tried",
        "score": 87,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What game is this? Looks great <3",
                "author": "Cute-Artist3756"
            },
            {
                "raw_content": "Looks great. It's going to be rad seeing everyone's Mario Paint art. Back in the day people could only share it with people they knew firsthand, or (people seriously did do this lol) record their drawing process and finished images via VHS, or take photos of their TV. Stuff like this and Gameboy Camera with its little mini-slidehow movies you could make, were really fun. It's nice to see it make a comeback in an era where people can actually see people's art. Edit: Typo",
                "author": "FanSince84"
            },
            {
                "raw_content": "How much is Mario Paint?",
                "author": "Honest_Fault8474"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Playing DK Banaza be like",
        "score": 763,
        "text_content": "Top 2 of the year with Clair Obscur Expedition 33 for me (which I would buy again on switch 2). Was not expecting to live it like I do and I'm only maybe halfway through",
        "comments": [
            {
                "raw_content": "not \"Oh my God\" but \"Oh my Banana\"",
                "author": "echoess84"
            },
            {
                "raw_content": "Its so phenomenal, what made me buckle and get a Switch 2, so blown away by the fun I’m having, it’s just a blast. I’m backtracking right now to find bananas and fossils I originally missed, so I can level up, upgraded my punch to max first, plus I want to get more gold so I can buy the clothes and colors I didn’t grab.",
                "author": "Enrico_Tortellini"
            },
            {
                "raw_content": "If you already love it halfway through, just wait for the other half. Thats what made it my GOTY!",
                "author": "Mucrush"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Mario Paint on SNES NSO, featuring Mouse Controls",
        "score": 59,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Taking this as confirmation of a Mario Paint 2 reveal at this week's direct",
                "author": "Marth-Koopa"
            },
            {
                "raw_content": "This was an amazing game. I remember drawing Mouser from Mario 2 using the stamp game when I was a kid. It took me a week to do it.",
                "author": "snowyetis3490"
            },
            {
                "raw_content": "[https://www.youtube.com/watch?v=FPR4Yf-FfiA](https://www.youtube.com/watch?v=FPR4Yf-FfiA) Compilation of what you do with the music maker",
                "author": "AccordingPay9126"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Manami Kiyota, Xenoblade Series Composer, Working on a New Unannounced Project set to be announced soon",
        "score": 157,
        "text_content": "[Source](https://www.reddit.com/r/Xenoblade_Chronicles/comments/1mbjles/manami_kiyota_xenoblade_series_composer_working/) It could be either a new Monlithsoft game (Xenoblade or New IP) or something else different.",
        "comments": [
            {
                "raw_content": "Praying Monolith is part of launch window. Always felt like the Xenoblade games were too ambitious for any prior piece of Nintendo hardware to faithfully represent on a visual level, and the Switch 2 could actually meet how much they try to squeeze out of pure scale from their RPGs",
                "author": "MyMouthisCancerous"
            },
            {
                "raw_content": "For context (actually stole this bit of info from Famiboard's)), but her previous post like this was 4 months before 3's reveal.",
                "author": "SemiLazyGamer"
            },
            {
                "raw_content": "Would love to see a Switch 2 edition of all the xenoblade games. Just 4k and 60FPS would be excellent. Also hoping we see the xenosaga reboot they seem to have been inching towards",
                "author": "GoldenTriforceLink"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Next WB Games Montreal Project Is A Live‑Service DC Comics Game, Job Listing Reveals",
        "score": 507,
        "text_content": "> Following its last release, the team is already deep into development on its next title. The job listing confirms that this game is based on an iconic Warner Bros. and DC Comics property. The same job listing later states that this project will belong to the live-service genre since the producer is responsible for overseeing the live service strategy for post-launch support. Source: https://tech4gamers.com/wb-games-montreal-live-service-dc-comics/",
        "comments": [
            {
                "raw_content": "It turns out they are in fact, that fucking stupid.",
                "author": "Username41968"
            },
            {
                "raw_content": "Oh fuck, they want their own Marvel Rivals, don't they? Like they literally had a success early on with Multiversus and they still fucked it up.",
                "author": "XxZONE-ENDERxX"
            },
            {
                "raw_content": "How many times do we have to teach you this lesson old man",
                "author": "Robsonmonkey"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Epic Games/Hoursemarque Engineer working with CDPR to present solutions to eliminate stuttering/hitches within Unreal",
        "score": 376,
        "text_content": "(Original Post by u/[MrFrostPvP-](https://www.reddit.com/user/MrFrostPvP-/) From r/Witcher4 ) [https://youtu.be/HaVTYSnGvxA?si=rDdZO5U1bW5auV5u](https://youtu.be/HaVTYSnGvxA?si=rDdZO5U1bW5auV5u) In this presentation in the link above, , Ari Arnbjörnsson interviewed and spoke with many game developers and co-developers some of whom sole jobs are to eliminate stuttering in games, one of them was CDPR themselves! Ari is a former Housemarque dev (now Epic Games) who worked on Returnal a UE4 title which performs really amazingly at the same time as maintaining high fidelity graphics. 0:05 / 0:40 [https://youtu.be/HaVTYSnGvxA?si=\\_ReosZvPZjCK9M5D&t=787](https://youtu.be/HaVTYSnGvxA?si=_ReosZvPZjCK9M5D&t=787) At ***13:07*** Ari mentions the Fast-Geo Streaming Plug-in which CDPR made and shipped for UE5.6 developers to use, its a level streaming plugin that eliminates stutter by streaming in and out assets rapidly, they also used it in the Witcher 4 Tech Demo and its the same thing to TurboTECH you might've already heard about. 0:00 / 0:31 This is basically what almost every developer does even on their own Engines, CDPR's RED Engine was the same method. BTW if you didn't know, Console games that are Pre-Compiled already are shipped with it in the game, since all PS5's run the same hardware as eachother, since all Xbox Series S and X use the same hardware as eachother. PC's however have immeasurable configurations hence why PC games need to precompile on your first start up. Developers who neglect Pre-Compilation on modern DX11 and DX12 games are basically setting you up as a player for a PSO/Shader stuttering mess where your hardware it fighting the graphics in a race on who can render what in real time. So don't use the engine as a scapegoat even if its a different engine like their own proprietary in-house, blame the studio themselves for cutting basic QA. If you have any questions I (u/[MrFrostPvP-](https://www.reddit.com/user/MrFrostPvP-/)) can try answer them, I'm fairly informed when it comes to tech stuff like this and I've been kept up to date with CDPR and Epic's collaborations since 2022. As you can see on this sub I have a post pinned clearing up any fearmongering you may have when it comes to game graphics or game optimisation even relative to CDPR's Witcher 4.",
        "comments": [
            {
                "raw_content": "Thanks for sharing",
                "author": "weeeeeeeeeird"
            },
            {
                "raw_content": "Just want to say that I love Ari! He's \"Myth-Busting “Best Practices” in Unreal Engine\" session was superb. With his amount of knowledge, it will clearly become better, and less preparation will need to be done by not always experienced developers.",
                "author": "SilverGur1911"
            },
            {
                "raw_content": "Returnal on PC still has UE stutter",
                "author": "ResponsibleTrain1059"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Playstation game size is teasing something related to Assassin's Creed.",
        "score": 320,
        "text_content": "https://xcancel.com/PlaystationSize/status/1949853604807921898?t=sqIdARyJYTTZMkpgFTk6RA&s=19 This is not about the Shadows update dropping tomorrow not a 60 fps patch for an older game. It's either black flag remake, the mobile game AC Jade or something else entirely Update: it's a brand new IP so this isn't a dlc nor a patch but a new game entirely. https://xcancel.com/PlaystationSize/status/1949890073362911493?t=LG3MXJqVwS-V3ace3eWYwQ&s=19 Guy also said it's not hexe but said it could be either Black Flag remake or the previously leaked Invictus game",
        "comments": [
            {
                "raw_content": "I hopium its about black flag remake.",
                "author": "Objective_Love_6843"
            },
            {
                "raw_content": "For context this guy sees what's being added to the playstation database and leaks stuff like updates a week in advance. When asked, he said it's not about the ac Shadows new game plus update coming out tomorrow nor it's a 60 fps patch for an older ac game Multiple people commented black flag remake, but he didn't respond to deny this",
                "author": "KvasirTheOld"
            },
            {
                "raw_content": "![gif](giphy|1Ctu1BCYf21we9tRmT|downsized)",
                "author": "The_Iceman2288"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Nintendo is having \"stage data\" maintenance during Wednesday-Thursday PT Time, possibly due to a direct during that time.",
        "score": 590,
        "text_content": "SOURCE: [https://www.nintendo.co.jp/netinfo/en\\_US/index.html](https://www.nintendo.co.jp/netinfo/en_US/index.html)",
        "comments": [
            {
                "raw_content": "The Nintendo Direct is going to break their internal servers when they announce Mario Pinball Land is coming to NSO.",
                "author": "MuptonBossman"
            },
            {
                "raw_content": "I just want shadow dropped switch 1 upgrades for as many games as possible.",
                "author": "bluebottled"
            },
            {
                "raw_content": "FYI tomorrow is the beginning of the Second Platyest for the mysterious online game from Nintendo",
                "author": "Luck88"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Puts The Process Horse Back In Front Of The Foundry Cart",
        "score": 118,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A bit of gloom, some hope if a bunch of things go right that have to go right. But I do love a new process node, it will be interesting to see 18a and its refresh, and hopefully 14a with those very fancy HIGHNA lithography machines.",
                "author": "Spooplevel-Rattled"
            },
            {
                "raw_content": "Intel is getting shaped to be split and sold imo. All signs are pointing to it.",
                "author": "BucDan"
            },
            {
                "raw_content": "Aside from the terrible 10nm fiasco, getting rid of Pat was intel's worst mistake during these past, what? 10 years? Pat had a vision and a plan, he wanted to bet on the foundry. Everyone was like nah you're dumb, gtfo. After all that we're back to \"this Pat guy was lowkey right, damn\"",
                "author": "DshadoW10"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "HP Z2 Mini G1a with AMD Strix Halo review – Compact workstation with Ryzen AI Max+ and Radeon RX 8060S",
        "score": 33,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Pricing is a miss. I know they are trying to baseline high to make sales appear more advantageous, but there are competitors that are much cheaper.",
                "author": "mister2forme"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "US Housing Market Posts Worst Spring Selling Season in 13 Years",
        "score": 462,
        "text_content": "https://www.bloomberg.com/news/articles/2025-07-28/us-real-estate-market-high-prices-mortgage-rates-hamper-spring-home-selling US Real Estate Market: High Prices, Mortgage Rates Hamper Spring Selling - Bloomberg The US housing market just logged its slowest spring season in more than a dozen years, leaving Glennda Baker, a veteran real estate agent in Atlanta, struggling to sell 21 listings. She’s been slashing prices. But months of chatter about AI taking jobs and tariffs tanking the economy is feeding into buyer indecision. “People say price solves everything,” Baker said. “But price doesn’t solve uncertainty.” Spring is traditionally the busiest season in real estate, not unlike Christmas for retailers. And while the most unaffordable housing market in decades has sidelined all but the most determined buyers, there were signs earlier this year that conditions were right for a rebound. By April, mortgage rates dipped, price growth flattened and the years-long inventory drought looked like it had finally broken. But that coincided with President Donald Trump’s “Liberation Day” tariff bombshell, which sent shock waves through financial markets and pushed house hunters back into hiding. Fewer sales contracts were signed in the US from April through June than in any year since 2012, according to data from Redfin. That was back when the housing market was still finding its footing after the collapse that fueled the financial crisis. Before 2025, the previous two springs were also weak, pulled down by high rates and prices, but anxiety over the future of the economy has made things worse this time, said Chen Zhao, head of economics research at the brokerage. Prices, however, are unlikely to plunge because sellers are starting to pull listings off the market, limiting inventory, she said. “We thought we hit rock bottom but we keep discovering there’s more rock bottom to be had,” Zhao said. “You have a lot of people being afraid of what’s to come.” With consumer confidence ticking up and the stock market on a hot streak, the hope is deals that normally might have happened in the spring will get pushed into summer. But there’s likely to be only a small bump, according to Thomas Ryan, an economist at Capital Economics. The rental market is gaining strength because many would-be buyers still can’t afford to purchase, he said. And as borrowing costs remain higher for longer, people have stopped assuming they can buy now and be able to refinance at a later date, according to Ryan. “The outlook for the housing market is dire,” he said. “Affordability is at its worst since the 1980s. Nothing has changed on that front.” Location Matters One silver lining is that buyers have gained some negotiating power as listings climbed across much of the country. But as always in real estate, what matters most is geography. Prices continue to rise fast in the Northeast and Midwest, where inventory shortages are severe. Yet in Sun Belt markets like Florida and Texas, where homebuilders were most active in recent years, the market is sinking. In Las Vegas, active listings shot up more than 38% from a year earlier while sales plunged 15%, according to Redfin data for the four weeks through July 20. The fear of missing out has shifted from buyers to sellers, said Angela O’Hare, an agent with Real Broker in the Las Vegas area. It doesn’t help that sellers have to compete with homebuilders offering to subsidize mortgage rates and help cover closing costs, she said. “Sellers who need to sell will make it happen,” O’Hare said. “I had a listing at $950,000. I cut it down to $799,000 and had three offers.” Even some of the country’s hottest markets have lost some steam. In Narragansett, a picturesque beach town in Rhode Island south of Providence, homes that would have gotten a dozen offers a year ago now get three — if they’re priced right, said Johnny Sheil, an agent with Mott & Chace Sotheby’s International Realty.",
        "comments": [
            {
                "raw_content": "Yeah dawg and also, I don't want to buy a house that's tripled in price over the last 10 years. That coupled with uncertainty does not make me feel like I'm spending my money wisely.",
                "author": "Successful-Cabinet65"
            },
            {
                "raw_content": "[removed]",
                "author": "None"
            },
            {
                "raw_content": "Where are all the people screaming about adjusting economic KPI's for population increases from the GFC??? Because correct me if I'm wrong, but if you adjusted the low sales value for the fact there are 10% more houses today than in 2012...so actually this data is unprecedented in history on an adjusted basis",
                "author": "Extension_Degree3533"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Two FRED data series are flashing red for a housing-generated recession and stock crash",
        "score": 95,
        "text_content": "Going back 60 years there are two pretty clear indicators for impending recessions and stock drops: 1. [New Privately-Owned Housing Units Completed: Total Units](https://fred.stlouisfed.org/series/COMPUTSA) 2. [Monthly Supply of New Houses in the United States](https://fred.stlouisfed.org/series/MSACSR) I have mapped out the following lines on my own graph: 1. Housing completions (as a % of 5 year moving average) 2. Month supply of new housing (as a % of average in last 60 years) 3. S&P 500 returns adjusted for inflation (% of 3 year moving average) https://preview.redd.it/988n7yh5qoff1.png?width=2536&format=png&auto=webp&s=58fefbf0d04a0500457cdb6ad8846c31497cae20 Looking at the data it clearly shows that when new housing supply starts to increase (and is at least 30% above its MA), housing unit completions start to drop sharply against its MA and the S&P 500 has recently been 10% above its MA then it is a clear sign of an impending drop in stock prices. The 4 times this happened was: 1. November 1973 - Followed by a 34% drop in the S&P 500 2. June 1981 - Followed by a 30% drop in the S&P 500 3. April 1990 - Followed by an 15% drop in the S&P 500 4. June 2007 - Followed by a 50% drop in the S&P 500 Notice that 2022 was not triggered by this principle as while new home supply hit the threshold as well as the S&P 500, builders did not panic and building pipelines remained strong, so while this was a stock correction it was not driven by housing (evidenced by the fact housing continued to drive upwards afterwards). Fast forward to today and notice that in June there was a significant increase in supply and a very undiscussed, HUGE decrease in completed homes which now officially triggers all three thresholds. Am I offering guarantees we see a crash/correction this fall? No. Can I explain the economics of this correlation? No (I am a statistician, but my view is that homebuilders are so integrated with the mindset and sentiment of consumers via negotiations that they know before most and are the only industry with really transparent industry wide supply data...). What I am saying is that this pattern as a high correlation, it very accurately predicted crashes in the past and could be a predictor for an impending crash very soon. Also not really a \"hard science\" observation, but notice that the first three indicated stock drops were roughly 8 years apart from end of last one to start of new one.... The 2007 housing crash \"skipped\" a interval with a 16 year gap and...look at that, 16 years from the end of the 2007 crash takes us to summer 2025....",
        "comments": [
            {
                "raw_content": "self proclaimed random guy on YT (minority mindset) is talking alot about housing currently... mostly that rate buydowns have been obscuring the data heavily in recent years, but that its coming to an end and even the largest builders are throwing in the towel",
                "author": "benskinic"
            },
            {
                "raw_content": "Correct me if I’m wrong, I’m not well educated in stats. But isn’t retroactively applying trends to the past eventually going to find correlations? If you map out 200 housing indicators won’t you find patterns due to chance that aren’t necessarily predictive? How do you account for this as a statistician? Truly curious, interesting post!",
                "author": "AggravatingGold6421"
            },
            {
                "raw_content": "\"I know some of these words.\"",
                "author": "beardko"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "America's Largest Homebuilder Issues Florida Warning",
        "score": 52,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If you didn't already know there were problems there, Floriduh",
                "author": "Dry-Interaction-1246"
            },
            {
                "raw_content": "This is just a nonsense article, but there are a whole lot more of these articles lately. Its going to build into a frenzy and become a self fulfilling prophecy. The media will get people in a panic, and then Florida real estate as a whole will implode worse than the condos in South Florida.",
                "author": "Coupe368"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Buyer’s remorse",
        "score": 10,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Overpaying. Signs are everywhere.",
                "author": "Dry-Interaction-1246"
            },
            {
                "raw_content": "People are buying these homes with budgets so tight that nothing is left for maintenance and repairs",
                "author": "pqitpa"
            },
            {
                "raw_content": "HAHAHA OP listed the area code for where they bought. They’re describing it as ‘South LA.’ It’s Baldwin Village. I know that the area has been gentrifying a lot but man…it would take something truly special for me to buy a million dollar house in Baldwin Village.",
                "author": "Horangi1987"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Real estate apocalypse and what it means for tax values?",
        "score": 10,
        "text_content": "It’s over",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "NE Condo has not sold. What would you do?",
        "score": 9,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Below his 2018 price and still not selling? OUCH!",
                "author": "NorCalJason75"
            },
            {
                "raw_content": "https://i.redd.it/w9xb5lqkwxlb1.jpg",
                "author": "acqua_di_hoomertears"
            },
            {
                "raw_content": "If it is not selling, it means the price is high. $450k for a condo. $1560 HOA $3650 in property taxes Good luck finding a sucker that will put that much money. If you have $450k, that yields $1.6k/month in a HYSA. $2.1k/month in a REIT (O). Even if you pay cash and stay away from debt, you'll have to pay $2k every month just to maintain the condo. It will go up with inflation and for me, it feel like paying rent FORVER.",
                "author": "Gambler_Addict_Pro"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The End of Work as We Know It “As a CEO myself, I can tell you, I’m extremely excited about laying off employees because of AI\"",
        "score": 609,
        "text_content": "“AI doesn’t go on strike. It doesn’t ask for a pay raise. These things that you don’t have to deal with as a CEO.”",
        "comments": [
            {
                "raw_content": "We're still not taking this seriously at all. >\"This cool new tool will definitely increase productivity *and my personal wealth*.\" >\"But, it looks like it could surpass us and take all jobs, causing the entire market to crash.\" >\"Nah, not in our lifetimes.\"",
                "author": "Ignate"
            },
            {
                "raw_content": "Markets stop working properly at around 9-12% unemployment as the cascading crash impacts start to compound Feudalism or a bonfire of the elites is inevitable",
                "author": "Helwinter"
            },
            {
                "raw_content": "Oh just wait for the enshitifcation to happen to AI and they keep jacking the price up and you have vendor lock in and you can’t do anything cause you vibe built your entire business and have no real experts or knowledge in what your doing.",
                "author": "eltron"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Apparently GPT-5 is rolling out? With ability to think deeper + video chat and more",
        "score": 71,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/bjukayxjirff1.jpeg?width=1080&format=pjpg&auto=webp&s=6c6a33334f246b6a5e18b1b1310421e0255e3ad6 Most likely real, this was 6 hours ago.",
                "author": "GodEmperor23"
            },
            {
                "raw_content": "GPT-5 doesn't just randomly roll out. This is 95% fake and 5% an accident.",
                "author": "fmai"
            },
            {
                "raw_content": "The user who got access has a Pro account fyi",
                "author": "One_Geologist_4783"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Psilocybin treatment extends cellular lifespan (by 50%) and improves survival of aged mice",
        "score": 79,
        "text_content": "",
        "comments": [
            {
                "raw_content": "that's good news for aged mice",
                "author": "Tystros"
            },
            {
                "raw_content": "It cures their cellular ennui, but the soulless minions of orthodoxy won't tell you that!",
                "author": "Nukemouse"
            },
            {
                "raw_content": "Eat some shrooms and wait for ASI? I am in",
                "author": "IWindyI"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Scientists hit quantum computer error rate of 0.000015% — a world record achievement that could lead to smaller and faster machines",
        "score": 706,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> In research published June 12 in the journal APS Physical Review Letters, the scientists demonstrated a quantum error rate of 0.000015%, which equates to one error per 6.7 million operations. This achievement represents an improvement of nearly an order of magnitude in both fidelity and speed over the previous record of approximately one error for every 1 million operations. Are they being purposely confusing with an already confusing topic? This summary seems to only make what happened more impactful than it was? And citing 'world record achievement'? Of course any improvement is a world record achievement. Do journalists need to label each technical advancement in any industry a world record achievement? If they must use the percentage, they could say \"Scientists reduce quantum computer error rate from 0.000100% to 0.000015% error rate.\" or \"Scientists reduce quantum computer error rate from 1 per million to 1 per 6.7 million.\"",
                "author": "BarrelStrawberry"
            },
            {
                "raw_content": "one step closer to modeling quantum consciousness theories :3",
                "author": "The_Scout1255"
            },
            {
                "raw_content": "Just let me know when it can factor a number larger than 21 or do something practical.",
                "author": "WSBshepherd"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "GPT5 is a 3->4 level jump (or greater) in coding.",
        "score": 431,
        "text_content": "Just wanted to emphasize this. Everyone that's tested the models know, but for those that don't, just felt the need to reiterate. Unfortunately, as far as creative writing, IMO the models I tested were standard levels of LLM bad, if not worse. That is just my opinion, though. **Quick edit:** It's not GOD. But what used to take a series of back and forth prompts and thoughtful input/direction from you, is now done in one shot and the result is better than it would have been. NO ONE (well not us plebs) has been able to publicly test these models on real, giant codebases, in very long winded, multi-turn interactions. Keep all that in mind.",
        "comments": [
            {
                "raw_content": "Which languages were you testing it with? Also what made it feel like a jump? Was it code quality, architectural design, etc?",
                "author": "synap5e"
            },
            {
                "raw_content": "How big is GPT-5's context window?",
                "author": "DepartmentDapper9823"
            },
            {
                "raw_content": "How does it compare to Sonnet 4?",
                "author": "FezVrasta"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"Explosive neural networks via higher-order interactions in curved statistical manifolds\"",
        "score": 40,
        "text_content": "[https://www.nature.com/articles/s41467-025-61475-w](https://www.nature.com/articles/s41467-025-61475-w) \"Higher-order interactions underlie complex phenomena in systems such as biological and artificial neural networks, but their study is challenging due to the scarcity of tractable models. By leveraging a generalisation of the maximum entropy principle, we introduce *curved neural networks* as a class of models with a limited number of parameters that are particularly well-suited for studying higher-order phenomena. Through exact mean-field descriptions, we show that these curved neural networks implement a self-regulating annealing process that can accelerate memory retrieval, leading to explosive order-disorder phase transitions with multi-stability and hysteresis effects. Moreover, by analytically exploring their memory-retrieval capacity using the replica trick, we demonstrate that these networks can enhance memory capacity and robustness of retrieval over classical associative-memory networks. Overall, the proposed framework provides parsimonious models amenable to analytical study, revealing higher-order phenomena in complex networks.\"",
        "comments": [
            {
                "raw_content": "*o3 eli5:* **Imagine you have a giant box of toy blocks.** * **Normal play (ordinary neural networks).** Usually, you connect blocks two at a time—just little pairs snapping together. The whole tower grows in a steady, predictable way. * **Adding “super‑glue” friendships (higher‑order interactions).** The scientists in the paper found a clever way to let *groups* of blocks—three, four, five at once—stick together in one move. Those extra‑big hugs are called **higher‑order interactions**. They hid all the complicated math of those hugs inside one simple dial they call **γ (gamma)**. Turning γ is like choosing how sticky the super‑glue is. * **Curving the playroom (curved statistical manifold).** When you change γ, it’s as if the floor itself bends into a gentle bowl or hill. That bend quietly guides the blocks so they prefer certain spots, making big group‑hugs easier without needing zillions of new rules. * **Explosive towers.** With the right γ, once a few blocks click, the bowl tips and *whoosh!* the rest snap together all at once—an **explosive phase transition**. It looks sudden, but really it’s the floor (and those group hugs) doing the work. * **Why that’s cool for “memory.”** In a brain‑like network, each finished tower represents a memory. Because the super‑glue lets bigger clumps form, the playground can store **more towers at once** and still find them quickly later. It’s like having extra shelves appear just when you need them. * **Self‑tidying magic (effective temperature).** As the tower builds, the floor cools itself so shaky pieces calm down and stay put—no adult needed. That automatic cool‑down is what accelerates building and keeps the towers stable. **In one sentence:** By letting many blocks stick together at once and slightly bending the playroom floor, the researchers created neural networks that remember more and “click” into their answers in a sudden, exciting burst—like watching a pile of blocks leap into a finished castle all by itself.",
                "author": "popcornkrig"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Quen3 235B Thinking 2507 becomes the leading open weights model 🤯",
        "score": 258,
        "text_content": "Data taken from artificialanalysis.ai",
        "comments": [
            {
                "raw_content": "GLM-4.5: hold my beer",
                "author": "seeKAYx"
            },
            {
                "raw_content": "Best RP model currently tbh(Besides the big non open models)",
                "author": "The_Scout1255"
            },
            {
                "raw_content": "Wait until GLM 4.5 gets in that benchmark https://preview.redd.it/i0j3bkzjinff1.jpeg?width=2884&format=pjpg&auto=webp&s=ed5509b2d0b06cb9c35f51c7595876837502c4cf",
                "author": "sirjoaco"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Creating Beautiful Logo Designs with AI",
        "score": 47,
        "text_content": "I've recently been testing how far AI tools have come for making beautiful logo designs, and it's now so much easier than ever. I used GPT Image to get the static shots - restyling the example logo, and then Kling 1.6 with start + end frame for simple logo animations. I've found that now the steps are much more controllable than before. Getting the static shot is independent from the animation step, and even when you animate, the start + end frame gives you a lot of control. I made a full tutorial breaking down how I got these shots and more step by step: 👉 [https://www.youtube.com/watch?v=ygV2rFhPtRs](https://www.youtube.com/watch?v=ygV2rFhPtRs) Let me know if anyone's figured out an even better flow! Right now the results are good but I've found that for really complex logos (e.g. hard geometry, lots of text) it's still hard to get it right with low iteration.",
        "comments": [
            {
                "raw_content": "Probably not the right sub for this but still cool!",
                "author": "Flipslips"
            },
            {
                "raw_content": "Now try making something that hasn’t been done before",
                "author": "DramaAccomplished588"
            },
            {
                "raw_content": "Gross",
                "author": "ColoradoSunLight"
            }
        ],
        "subreddit": "singularity"
    }
]