[
    {
        "post_name": "He deleted all his posts. Someone is scared.",
        "score": 633,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nothing is ever deleted... a request/demand to X and the \"soft delete\" gets reversed.",
                "author": "LogicalReasoning"
            },
            {
                "raw_content": "Innocent people dont do this",
                "author": "TruculentGoose"
            },
            {
                "raw_content": "IDGAF how \"Scared\" they are! \"Scared\" isn't enough! Arrested, convicted, and publicly HUNG is enough! Not \"scared!\"",
                "author": "patrioticwinning3"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Tell me you're retarded without using words",
        "score": 544,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The handicap parking spot is the most delicious irony *chef's kiss*",
                "author": "Scipio_Americanus"
            },
            {
                "raw_content": "Texas has retards too ???",
                "author": "LookFatty"
            },
            {
                "raw_content": "I don't get i. I see words. Is there something I'm missing?",
                "author": "tuaris"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "2018. Tucker Carlson has Eric Swalwell on to present evidence of Trump's collusion with Russia. Swalwell on evidence of collusion: \"When we look back at this in 25 years, we're going to be amazed at how much of it was right in front of us.\"",
        "score": 491,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Swalwell must be blowing the right people.",
                "author": "1MonkeyJr"
            },
            {
                "raw_content": "what’s the evidence?",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Go lift some weights fag",
                "author": "Colorado-Living"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "JD Vance: The entire European press is singing the president’s praises right now, amazed at the deal he negotiated on behalf of Americans. Tomorrow the American media will undoubtedly run headlines like “Donald Trump Only Got 99.9 Percent of What He Asked For”",
        "score": 516,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://x.com/JDVance/status/1949625295020945748",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "what was the 1‰?",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "I wish we could turn the screws and get all those fuckin invaders out of Europe ASAP. There is this sick game, wherein a perma-war with Russia is always taking place, and Germany and the rest of Europe are kept armed and developed, but never enough to overwhelm Internationalist concerns. Trump, I think, is at war with those smarmy pedophile fuckers - the Internationalists. They manipulate groups like the Muslim cousin-marrying low IQ populations in Eurasia, and they but out elites all over the world and educate them and blackmail them, like they did to any local government in China that strove for sovereignty and functional local government. They are playing that whole game against the U.S. right now - with out District Attorneys and Mayors now. Anway, let's fuckin go Trump! Make Europe kick the British globoshlomo empire out.",
                "author": "learntocode"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Not All Heroes Wear Capes",
        "score": 1203,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I was told he fled the US for a golf trip. lol 😂",
                "author": "Spacewilluniteus"
            },
            {
                "raw_content": "Autopen McShitpants: **I GOT MY BUTT WIPED!!**",
                "author": "RobinNet"
            },
            {
                "raw_content": "Yeah! 🍻🥰",
                "author": "BlueKentuckyGirl"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ZERO reports on this violent assault from the news media",
        "score": 1143,
        "text_content": "",
        "comments": [
            {
                "raw_content": "In the UK, that woman would be arrested for getting assaulted.",
                "author": "soupsandwich69"
            },
            {
                "raw_content": "The fucking fatigue I have is unbearable…",
                "author": "Constitution_1788"
            },
            {
                "raw_content": "always in packs, never relax.",
                "author": "abstr4ct"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "👳 ‘Obama Phone’ Scam: Florida CEO Headed to Prison, Must Pay $128 Million Fine After Defrauding Government 💸",
        "score": 1274,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yet another filthy sand rigger stealing our money again. As if that would actually surprise anyone.",
                "author": "MythArcana"
            },
            {
                "raw_content": "Every government gimme ends up being abused. These phones were given to illegals in other countries before they even crossed over our borders to invade us...and we are still paying for their free cell phone services and wifi access.",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "Obama opened up the government to so much waste, fraud, and anbuse its straight out of the communist playbook for overwhelming government services to use as an excuse to usher in communism.",
                "author": "D-Dub"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Just the News: \"New police investigations unit in U.K. will monitor social media posts for anti-migration content.\" A whole dedicated unit! For persecuting people who express their opinions on the internet. Next level.",
        "score": 1261,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Limeys know what to do but they're all too busy watching porn and going to the pub.",
                "author": "darkmodeforgotpass"
            },
            {
                "raw_content": "# Set your VPN for London and have fun people!",
                "author": "redditadminssuckit"
            },
            {
                "raw_content": "Need some VPN based shitposting to keep them chasing their tails",
                "author": "kvsdca"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Wow. A Delta pilot was just arrested immediately upon landing in San Francisco on child s*xual abuse material charges",
        "score": 1129,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don’t understand the attraction to children. It has to be some sort of demonic urge to destroy innocence.",
                "author": "D-Dub"
            },
            {
                "raw_content": "So what's the name of the pilot?",
                "author": "possibletower"
            },
            {
                "raw_content": "Might as well arrest the entire city if they are in San Francisco. There's plenty more where that came from.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "That's an ugly fucking mountain.",
        "score": 973,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Mount Lushmore",
                "author": "permissible_missile"
            },
            {
                "raw_content": "Mount Repeal The 19th",
                "author": "NeoDragoon"
            },
            {
                "raw_content": "The four horsewomen oof the apocalypse",
                "author": "Grindelwald"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Communist Zohran Mamdani weds wife at million-dollar compound owned by his wealthy parents",
        "score": 854,
        "text_content": "",
        "comments": [
            {
                "raw_content": "in Uganda,wher they can pay their servants $1 per day,I bet their money stretches quite a bit there…",
                "author": "KarenLukasik"
            },
            {
                "raw_content": "Another spoiled rich socialist turd who has never lived, and never will, under the system they push on the rest of us. It still amazes me, though it shouldn't, how many poor lefty retards still support these grifters.",
                "author": "rambler045"
            },
            {
                "raw_content": "Just to be clear I do not think that Mamdani is in any way a legitimate communist or socialist. I am NOT saying that in defense of socialism (the basis of communism). I say this because I strongly suspect that Mamdani is just a person who hates America and wants to see it destroyed and he knows full well that street socialists/communists are some of the dumbest people alive and are easily manipulated. So they make a very likely vehicle for his ends.",
                "author": "Roadpower"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trash everywhere. 0 English people. Women all in burqas. UK, 2025.",
        "score": 1357,
        "text_content": "",
        "comments": [
            {
                "raw_content": "England has become a shithole country, and it was all part of the plan",
                "author": "Karpus"
            },
            {
                "raw_content": "Import the 3rd world, become the 3rd world. Brown people are a virus.",
                "author": "TrumpShadow"
            },
            {
                "raw_content": "To be fair, women in burquas standing around are often mistaken for garbage bags",
                "author": "5DchessWatch"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "FBI raided Mar-a-Lago in search of Russiagate files: Devin Nunes",
        "score": 1430,
        "text_content": "",
        "comments": [
            {
                "raw_content": "OK. When can we expect Garland, Wray and Biden to be arrested?",
                "author": "fthecoup"
            },
            {
                "raw_content": "Yes. This is also why the FBI staged J6, to stop Trump from releasing Op Crossfire Hurricane files",
                "author": "UncleDonsBand"
            },
            {
                "raw_content": "We have known this forever.",
                "author": "HunterBidenJR"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Why public transportation is bullshit / Just another day on the NYC subway… Apparently, there are multiple videos of this woman circulating—this isn’t her first time starting a fight on a train.",
        "score": 883,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Punch it in the face. That works.",
                "author": "MemeWarsVet"
            },
            {
                "raw_content": "I knew it. Every single time.",
                "author": "MythArcana"
            },
            {
                "raw_content": "Simply not made for confined space rules based concepts required for western civ. M Notice how all the white people just calmly exited and left the crazy to herself.",
                "author": "Viewer01"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Google Silences Conservative Media",
        "score": 1069,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fuck Google",
                "author": "Trumpwonbidencheated"
            },
            {
                "raw_content": "Google's near monopoly on information is reaching the end of its era anyway. In 10 years, search engines will seem as archaic as public telephones. The AI era is in its infancy and Google does not have anywhere near the monopoly on that as they do with traditional search engines. And even worse for them, the majority of people don't trust them due to their behavior as the search engine leader. They made so much damn money they're going to be around for the foreseeable future but their relevance will decrease and decrease from here on out.",
                "author": "dr_gonzo"
            },
            {
                "raw_content": "Google is a part of Android and Windows operating systems so it is in/on most phones and computing devices.. They act as gatekeepers for a huge number of social sites including YouTube.. Talk about a threat to freedom, here is your alarm bell..",
                "author": "roadrunner0"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "On this day in 1993, a man named Vince Foster went to Fort Marcey Park and shot himself multiple times in the back of his head to avoid testifying against Hillary Clinton.",
        "score": 541,
        "text_content": "",
        "comments": [
            {
                "raw_content": "X POST: On this day in 1993, a man named Vince Foster went to Fort Marcey Park and shot himself multiple times in the back of his head to avoid testifying against Hillary Clinton. His suicide note was 2 pages long and didn't mention himself or his family but was an attempt to exonerate the Clintons from their accused crimes. A .38 caliber antique (untraceable) pistol was found in his right hand. Vince Foster was left handed.",
                "author": "ThisIsHowItStarts"
            },
            {
                "raw_content": "**C**linton **O**rdered **V**ince **F**oster **E**xecution, **F**orged **E**vidence",
                "author": "MudDog"
            },
            {
                "raw_content": "The O.G. Seth Rich.",
                "author": "PirateLaffite"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Rep. Jasmine Crockett (D-TX) is melting down now that redistricting is happening and she’ll lose her House seat. She can’t win at this point, even though the midterms are over a year away.",
        "score": 1523,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Her ass gonna get redistricted to federal penitentiary",
                "author": "ConsrvspkgNJ"
            },
            {
                "raw_content": "Oh no - anyway here is how to check if your LED sign is cheap.",
                "author": "RedditStillSucks"
            },
            {
                "raw_content": "> Texas is a majority minority state. That sentence doesn’t work Jasmine.",
                "author": "grandfather_nurgle"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Katie Hobbs accepted 18,000 ballots after Election Day",
        "score": 545,
        "text_content": "",
        "comments": [
            {
                "raw_content": "God bless Tom Fitton and Teams.",
                "author": "Female"
            },
            {
                "raw_content": "Wait, we know that Hobbs cheated. The wrong size ballot in the conservative districts that removed 100,000 ballots and the ballots that were wrong sized came from her office. She cheated. We know that. No consequences encourages the same behavior.",
                "author": "NotYourMan"
            },
            {
                "raw_content": "Federer? Man, the Chinese suck at this.....",
                "author": "Tikk"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Arizona Woman Sentenced to 8 Years for Helping North Korean Spies to Infiltrate U.S. Companies -- allowed to infiltrate 309 U.S. companies using false identities as IT workers.",
        "score": 1030,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Should make it 80 years and actually forget the prison and just execute the bitch on live TV tomorrow and see if anyone else tries to spy for the nooks",
                "author": "staroframphansbhole"
            },
            {
                "raw_content": "8 years? Wasn’t there a time you’d be put to death in public for that?",
                "author": "Yignuced"
            },
            {
                "raw_content": "Isn't the constitutional punishment for treason the death penalty? Ask the Rosenbergs.",
                "author": "NYforTrump"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Trump DOJ shuts down dark web child abuse website that had 120,000 members and \"millions of files.”",
        "score": 528,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I can think of a couple of religions that are into that kind of stuff",
                "author": "deletedandreacted"
            },
            {
                "raw_content": "Alex Rosenberg is flipping out right now.",
                "author": "Handshake_Shmanshake"
            },
            {
                "raw_content": "Do Reddit next.",
                "author": "JoeMcCarthyWasRight"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Samsung signs $16.5 billion foundry contract lasting to 2033, rumored to be for Tesla FSD chips",
        "score": 141,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Confirmed as Tesla: https://www.axios.com/2025/07/28/musk-tesla-samsung-chip-supply-deal",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": "Intel, you wish this was you, huh? OK, enough piling on (for today). As TweakTown notes, Samsung is keeping steady production internally + externally: * Samsung W1000 SoC on SF3 (gate-all-around) - shipped [millions of units](https://www.canalys.com/newsroom/global-wearable-band-market-q4-2024) in Watch7 and Watch8 * Samsung Exynos 2500 on SF3 (GAA) - will likely ship [in the millions](https://www.androidpolice.com/samsung-jan-november-s24-flip-fold-sales/) * Nintendo Switch 2 SoC on 8N - will likely ship 100+ million * Some customer for $2 billion / yr for 8 years",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": "If this is Tesla, it's a terrible look Intel couldn't snag the contract, considering they are an American company, and Elon's whole \"nationalism\" angle.",
                "author": "Geddagod"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Musk says Tesla, Samsung Electronics sign $16.5 billion chip supply deal",
        "score": 34,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Its been confirmed that Tesla is doing business with Samsung. WTF. Did not expect this at all. I assume this will be made at the Austin TX fabs?",
                "author": "REV2939"
            },
            {
                "raw_content": "How very patriotic of him",
                "author": "surf_greatriver_v4"
            },
            {
                "raw_content": "He has been known to make exaggerated statements.",
                "author": "jxx37"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Tried to push a GTX 1080 Ti to beat an RTX 5050… ended up with a 3300 MHz 5050 i",
        "score": 453,
        "text_content": "I thought this would be simple, overclock a GTX 1080 Ti hard enough to embarrass NVIDIA’s new RTX 5050. On paper, the 1080Ti should win. Easy video idea, right? Except the 1080 Ti turned into a nightmare. The first card died almost immediately. The second one was an absolute potato, wouldn’t clock for shit. The third? It just sat there like a brick. I spent days with this thing, playing with curves, offsets, drivers (I must’ve cycled through half a dozen, weirdly, 577 ended up performing the best), switching DX11 and DX12 back and forth, running it on a coolant loop holding –3 C, VRMs chilled separately, anything to make it move. Nothing. 2000–2050 MHz stable, maybe a flicker of 2150 on a lucky run, but 2200 might as well have been a brick wall. No matter what I did, it just refused. By this point the “1080 Ti beats 5050” idea was dead, and I was ready to throw the card through a wall. Out of frustration I turned to the 5050 I’d bought specifically to be humiliated by the Ti and thought, fine… what can you do? I bolted a CPU cooler to it (the die is so small a water block won’t even fit), dropped temps by about 30 C, load was sitting around 43 C, and just shoved as much offset as it would take. No fancy curve adjustments, just raw offset. The thing clocked to 3300 MHz. Seventeen percent FPS uplift. Across everything. The RTX 5050 went from “the opponent” to absolutely destroying the 1080 Ti, and suddenly this whole project went completely off the rails. It’s now top score overall on Timespy. Top 6 graphics scores. The bench, for anyone curious, stock CPU for stock GPU runs, then an i5‑12600KF locked at 5.3 GHz with the e‑cores off for all the overclocked runs. 32 GB DDR4‑3200 CL16. 1440p DX12. No DLSS, no FSR. Driver 577. This started as me trying to push an old flagship. It turned into a 3300 MHz RTX 5050 science experiment I didn’t see coming. Video if you're interested [https://youtu.be/D1gf638YMfk](https://youtu.be/D1gf638YMfk)",
        "comments": [
            {
                "raw_content": "Seems like the entire 50 series overclocks really well",
                "author": "PCMRbannedme"
            },
            {
                "raw_content": "Your writing feels kinda like a LinkedIn post.",
                "author": "def-not-elons-alt"
            },
            {
                "raw_content": "3352 is insane. Great video, reminds me of the ocn golden days. Thanks for sharing.",
                "author": "Winter_2017"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "This affordable Lenovo laptop is more upgradeable than most ThinkPads: ThinkBook 14 Gen 8 IAL review [Notebookcheck.net]",
        "score": 8,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I have a previous generation Thinkbook 14. The serviceability and expandability is really great for a current production laptop. If they upgraded the screen it would be pretty much perfect.",
                "author": "Homerlncognito"
            },
            {
                "raw_content": "Hello hannopal! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "How Water Cooling Radiators Are Made: From Aluminum to Performance",
        "score": 26,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I would not want to be the straightening-out-individual-fins-by-hand-with-tweezers guy on that assembly line.",
                "author": "VastTension6022"
            },
            {
                "raw_content": "It’s crazy the variety of people you see working at that factory.",
                "author": "Flaccid-Aggressive"
            },
            {
                "raw_content": "Gamermax AIOs so you can expect the quality with those",
                "author": "imaginary_num6er"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel \"Arrow Lake\" Core Ultra 5 225F, 225 & 235 Meta Review",
        "score": 40,
        "text_content": "This (small) meta review aims to determine the performance of the smaller Arrow Lake processors. These are rarely tested, but were popular models for budget builds in previous generations, especially the SKUs Core i5-12400(F), -13400(F), and -14400(F). For the purpose of determining performance, five recent reviews were used, which is unfortunately not as many as is usually the case with these meta reviews. - compilation of the performance results of 5 reviews on Core Ultra 5 225F, 225 & 235 - stock performance on default power limits, no overclocking - only gaming benchmarks for real games compiled, not included any 3DMark & Unigine benchmarks - gaming benchmarks strictly at CPU limited settings, mostly at 720p or 1080p 1% min/99th percentile - geometric mean in all cases - performance average is weighted in favor of reviews with more benchmarks - retailer prices according to Newegg (USA, on July 27) for immediately available offers - for the full results and more explanations check [3DCenter's original article](https://www.3dcenter.org/artikel/zur-performance-der-kleinen-arrow-lake-modelle) The average of the five reviews paints an interesting picture of their performance, with the smaller Arrow Lake models coming surprisingly close to the Core Ultra 5 245K. The performance difference between Core Ultra 5 225 and 245K is significantly smaller than in the previous generation between Core i5-14400 and -14600K. The small Arrow Lake models also perform well against AMD's affordable SKUs. Ø 5 Reviews|Hardware|Apps|Gaming|Newegg|fps/$ |:--|:--:|:--:|:--:|:--:|:--:| Core Ultra 5 245K|ARL, 6P+8E/14T, 159W|_100%_|_100%_|$290|_100%_ Core Ultra 5 245KF|ARL, 6P+8E/14T, 159W|_100%_|_100%_|$285|102% **Core Ultra 5 235**|ARL, 6P+8E/14T, 65/121W|91.5%|99.4%|$265|109% **Core Ultra 5 225**|ARL, 6P+4E/10T, 65/121W|74.9%|91.8%|$211|126% **Core Ultra 5 225F**|ARL, 6P+4E/10T, 65/121W|74.9%|91.8%|$191|139% Core i5-14600K|RPL-R, 6P+8E/20T, 181W|95.2%|104.3%|$190|159% Core i5-14600KF|RPL-R, 6P+8E/20T, 181W|95.2%|104.3%|$198|153% Core i5-14500|RPL-R, 6P+8E/20T, 65/154W|~64.0%|~81.6%|-|- Core i5-14400|RPL-R, 6P+4E/16T, 65/148W|~59.9%|~78.3%|$176|129% Core i5-14400F|RPL-R, 6P+4E/16T, 65/148W|~59.9%|~78.3%|$130|175% Ryzen 7 9700X|Zen 5, 8C/16T, 88W|96.0%|101.6%|$305|97% Ryzen 5 9600X|Zen 5, 6C/12T, 88W|80.1%|96.9%|$205|137% Ryzen 5 7600X|Zen 4, 6C/12T, 142W|~73.4%|~89.7%|$171|152% Ryzen 5 7600|Zen 4, 6C/12T, 88W|~66.9%|~87.9%|$190|134% Ryzen 5 7500F|Zen 4, 6C/12T, 88W|~66.4%|~86.2%|$149|168% This completely different performance characteristic becomes even clearer when comparing the three K models with their respective predecessor models and the two non-K models with the previous generation (only Core Ultra 5 225 and 235 are included here; the Core Ultra 5 245 was not tested). Whereas the K/KF models from Arrow Lake, as is well known, do not show any real performance gains compared to the 14th Core generation, the small Arrow Lake models shine with high performance gains. &nbsp;|Apps|Gaming |:--|:--:|:--:| Core i-14000K &#8594; Core Ultra 200K|+7.2%|–4.1% Core i5-14000 non-K &#8594; Core Ultra 5 200 non-K|**+34.0%**|**+19.5%** Ultimately, this means that the performance difference between non-K and K models within the Core Ultra 200 generation is noticeably lower, with the non-K models coming considerably closer to the performance of the K/KF models. In fact, Intel has released excellent non-K models of Arrow Lake here – which, however, is currently somewhat overshadowed by the poor reputation of the entire Arrow Lake generation. Of course, there are other points that speak against the non-K models from Arrow Lake: for example, the good retailer prices of the predecessor processors as well as the generally poor platform upgradeability at Intel. &nbsp;|Apps|Gaming|Diff. to 14400|&nbsp;|&nbsp;|Apps|Gaming|Diff. to 225 |:--|:--:|:--:|:--:|:--:|:--:|:--:|:--:|:--:| i9-14900K|~129%|~114%|–53% / **–31%**|&nbsp;|**Core Ultra 9 285K**|~138%|~110%|–46% / **–16%** i7-14700K|~118%|~112%|–49% / **–30%**|&nbsp;|**Core Ultra 7 265K**|~124%|~106%|–40% / **–14%** i5-14600K|95.2%|104.3%|–37% / **–25%**|&nbsp;|**Core Ultra 5 245K**|_100%_|_100%_|–25% / **–8%** i5-14400|59.9%|78.3%|&nbsp;|&nbsp;|**Core Ultra 5 225**|74.9%|91.8%|&nbsp; &nbsp; List of hardware reviews evaluated for this meta review: - [ComputerBase](https://www.computerbase.de/artikel/prozessoren/intel-core-ultra-5-225f-235-test.92075/) - [Hardwareluxx](https://www.hardwareluxx.de/index.php/artikel/hardware/prozessoren/65794-intel-core-ultra-5-235-225f-im-test.html) - [Notebookcheck](https://www.notebookcheck.com/Test-Intel-Core-Ultra-5-235-und-225F-vs-AMD-Ryzen-Wer-bietet-mehr-fuers-Geld.1006164.0.html) - [PC Games Hardware](https://www.pcgameshardware.de/Core-Ultra-5-225F-CPU-281191/Tests/und-235-Benchmark-Vergleich-mit-AMD-Ryzen-Release-1469803/) - [Quasarzone](https://quasarzone.com/bbs/qc_bench/views/92752) &nbsp; Source: [3DCenter.org](https://www.3dcenter.org/artikel/zur-performance-der-kleinen-arrow-lake-modelle)",
        "comments": [
            {
                "raw_content": "The 225F seems better than the 14400F it replaces but not worth that huge price jump from $130 to $191. LGA1851 mobos are more expensive, too. For those on a sub-$200 budget, it's possible to keep the RAM from an old Intel 14nm DDR4 build and just get a 14400F+mobo for a significant boost. That's as close as an \"in-socket\" upgrade Intel users will get. The 14400F uses Alder Lake cores too, so it's not at risk for degradation unlike true Raptor Lake CPUs.",
                "author": "Gippy_"
            },
            {
                "raw_content": "What about the transcode capabilities. Anyone test those, for use in a home server? Any major upgrade over something like 14700(or 14600 if that also has the 2x transcode i forget) for transcode?",
                "author": "RandomFatAmerican420"
            },
            {
                "raw_content": "This makes the platform make at least slightly more sense for someone that probably isn't gonna upgrade, it doesn't bridge the gap completely but with a good motherboard sale this makes a lot more sense than the 245K does",
                "author": "Limited_Distractions"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Do it you cowards. I triple dog dare you",
        "score": 620,
        "text_content": "",
        "comments": [
            {
                "raw_content": "X has 60 fps hidden and I’m delaying my playthrough for this!",
                "author": "DDub__"
            },
            {
                "raw_content": "Give thousand year door 60 frames you cowards!",
                "author": "Rent-Man"
            },
            {
                "raw_content": "https://preview.redd.it/tlfyax4o8gff1.jpeg?width=5015&format=pjpg&auto=webp&s=991a6f239adafceed39d741ae5574ad663a57c99 Hoping for the same 🤣🤣😭",
                "author": "c_rorick"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Bday gift!",
        "score": 239,
        "text_content": "Don't care if I'm 42. Best bday gift in a LONG time. Any tips?",
        "comments": [
            {
                "raw_content": "I am 42 and this is the most fun I've had with a game for years. My birthday is in November and I'm hoping for Metroid Prime as my pressie!",
                "author": "Fine-Night-243"
            },
            {
                "raw_content": "Happy birthday and enjoy the smashing 🥂🥂",
                "author": "Cyrex78"
            },
            {
                "raw_content": "That's a good gift! I've been enjoying this game so far! I hope you do too. Happy Birthday!",
                "author": "Williekins"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Picked this up today because I found out it was a switch exclusive no ps5 or Xbox don’t know about pc. Any way what can I expect",
        "score": 130,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You can expect some stickers.",
                "author": "rand_althor"
            },
            {
                "raw_content": "You should play the first game at least. This is a 1.5 sequel spinoff. You won't really know what's going on. The first 2 games on sale for really really cheap quite a lot. Like, less than 8 dollars cheap.",
                "author": "D_Beats"
            },
            {
                "raw_content": "First you can expect is a Download lol",
                "author": "BigGrizzwald"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I feel like there has to be another SW2 holiday exclusive",
        "score": 35,
        "text_content": "What does everyone think they’re gonna reveal at the direct ? Because come on now I get Metroid and Pokemon but they’re cross gen and I don’t think that Kirby air riders would be a system seller ? The fact that DK was in July is so sus as that easily could have been the holiday title",
        "comments": [
            {
                "raw_content": "I really don’t believe so and that’s not a problem at all. Metroid, Pokémon, and Kirby air riders are a good holiday, it’s just not as “hype” perhaps due to some being multi-generation",
                "author": "RichFunkey"
            },
            {
                "raw_content": "Switch 2 is selling faster than its predecessor. If you look back at the Switch 1 launch window, it looks pretty similar to its successor's. A few last-gen ports, gimmick games and low-scope slop and one big hitter. I remember owning a Switch in 2017 and being really hungry for novel titles on the system. I remember us being pumped up about *Arms* for crying out loud. It took a couple of years for the Switch to start to build the massive library it boasts today and it will take the Switch 2 a couple of years to do the same. Nintendo will do one or two massive titles per year and a handful of mid-scope games, party games and re-releases each quarter like they always do. The thing the Switch 2 has at launch that the Switch 1 didn't have is the entire Switch 1 library. There are probably a bunch of good games you missed out on and you can be playing those at a low price until some bigger hitters come out.",
                "author": "ill_monstro_g"
            },
            {
                "raw_content": "Mario kart, dk both system sellers in first 2 months. Metriod prime 4, Kirby dlc and hyrule warriors. So 2 system seller games and 3 other pretty good things all in first like 7 months. Do we really need a big holiday game? A lot of systems take like a year and a half to get this much. First years are normally slow on consoles like way slower then this. Do think we may get mario wonder dlc or mario kart dlc around holidays though.",
                "author": "Zeldabotw2017"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "What games are you holding off on playing/replaying for a switch 2 update?",
        "score": 44,
        "text_content": "For myself i'm waiting to play Hyrule Warriors age of calamity, luigi's mansion 3, fire emblem engage, pikmin 4. havent played through these previously but i'm hoping nintendo drops an update/upgrade for them soon. Kirby as well, but at least that upgrade is coming soon!",
        "comments": [
            {
                "raw_content": "Luigi's Mansion 3. Even though I played it several times on Switch 1. I want to wait to replay it if a Switch 2 version comes out.",
                "author": "No-Priority534"
            },
            {
                "raw_content": "Every single Xenoblade game",
                "author": "Vejuto"
            },
            {
                "raw_content": "I bought Kirby Forgotten Land and am waiting for the update. I would like to do Mario Wonder but sounds like they won’t be getting to it.",
                "author": "VaughnFry"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Is GameCube emulator on switch 2 worth it ?",
        "score": 5,
        "text_content": "I want to play Zelda wind waker on there, but the oldest Zelda I played was on 3Ds xl. Is it worth €70 for the game pad and €30 for extra subscription?",
        "comments": [
            {
                "raw_content": "If you have the possibilities I'd rather suggest to play the wii u hd remake of wind waker, either on the wii u or a pc. You have to decide for yourself when it comes to the gamepad, but the gamecube gamepad is a very good one, even by todays standards. I think 30 € for the extra subscription is fair, considering you get far more than only gc games.",
                "author": "Low-Comment-5093"
            },
            {
                "raw_content": "I enjoy it, it’s great to finally be able to play GameCube games on the Switch. You don’t need the controller to play them though so it doesn’t mean you’d need to spend €70 on it",
                "author": "OfficialCharter25"
            },
            {
                "raw_content": "I would say wait until they add more games if you only want to play GC games.",
                "author": "matuwu18"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Discussion, News, and Request Thread - week beginning 07/28/25",
        "score": 24,
        "text_content": "Discussion threads are your weekly central hub for all requests, gaming news, and any other gaming topics you want to talk about. *Please keep all content that doesn't need it's own post to this thread to de-clutter the sub for proper leaks and rumors. Thanks!* **Join our new companion sub for super secret Resident EVIL 9 and Half-Life 3 leaks** \\-- [r/OkBuddyGLAR](https://new.reddit.com/r/OkBuddyGLAR/) Hot Threads of the past week: * [Nintendo Direct is happening THIS month.](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1m6opbj/natethehate_reaffirms_that_a_nintendo_direct_is/) * [Sony job listing signals intention to expand multiplatform strategy (including Xbox and Nintendo platforms)](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1m9efwf/sony_job_listing_signals_intention_to_expand/) * [Ubisoft recently canceled a sequel to Star Wars Outlaws](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1m8h2ww/tom_henderson_ubisoft_recently_canceled_a_sequel/) * [EA has accidentally leaked Battlefield 6’s release date (October 10th) in a 'game disclaimers' page](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1m87l0r/ea_has_accidentally_leaked_battlefield_6s_release/) * [The Pokemon Company accidentally releases new mobile game called Pokemon Friends ahead of today’s Pokemon Presents](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1m6dghk/the_pokemon_company_accidentally_releases_new/) # [Want to help us improve this subreddit? ](https://forms.gle/w9JaYTjVN1Zie9e39)[Provide us with feedback here](https://forms.gle/w9JaYTjVN1Zie9e39)[!](https://forms.gle/w9JaYTjVN1Zie9e39) # [Click here to join the discord to enjoy further conversations with the community!](https://discord.gg/6jdBvCSqbj)",
        "comments": [
            {
                "raw_content": "NINTENDO GIVE ME METROID PRIME 4 SEPTEMBER RELEASE DATE AND MY LIFE IS YOURS",
                "author": "Ihatenickstreltsov"
            },
            {
                "raw_content": "Give me Prime 4 release date for the love of god I’ve been waiting for 2966 days.",
                "author": "jackdatbyte"
            },
            {
                "raw_content": "Nintendo has a ton of games that have been announced but have no release dates, I could see them not having nearly as many new reveals as prior mid-year Directs, perhaps even just one, their “One Last Thing” reveal We have: - Metroid Prime 4 - Kirby Air Riders - Hyrule Warriors: Age of Inprisonment - Rhythm Heaven Groove - Tomodachi Life: Living the Dream - Splatoon Raiders Announced with no release dates It would also fit with Nate saying the Direct would be “third party heavy” because already revealed games aren’t as groundbreaking as new reveals (June 2024 had Mario & Luigi Brothership, Nintendo World Championships, Donkey Kong Country Returns HD, Super Mario Party Jamboree, The Legend of Zelda Echoes of Wisdom all revealed for the first time, plus the re-reveal of Metroid Prime 4)",
                "author": "LukePS7013"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "NateTheHate continues to believe a direct is next week, as he has heard no new information that would imply otherwise.",
        "score": 214,
        "text_content": "Source: [https://xcancel.com/NateTheHate2/status/1949675594880282816](https://xcancel.com/NateTheHate2/status/1949675594880282816)",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "i guess thursday",
                "author": "matajuegos"
            },
            {
                "raw_content": "I love how there's always anticipation for these things only for Nintendo to say in a simple tweet \"tomorrow\"",
                "author": "Midnight_M_"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Xbox App has leaked the MK Legacy Kollection for a September 29th release",
        "score": 210,
        "text_content": "The Xbox app currently has the collection slated for a September 29th release. (I would attach a screenshot but I am seemingly not allowed to. You can check the app for yourself to confirm it.)",
        "comments": [
            {
                "raw_content": "Maybe we see it more probably at the rumor nintendo dircet",
                "author": "PickleAltruistic3427"
            },
            {
                "raw_content": "Says September 30th for me but I hope it’s real!",
                "author": "ComputerMysterious48"
            },
            {
                "raw_content": "aight but where's mythologies sub-zero and console versions of mk4",
                "author": "robertman21"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "God of War TV show details",
        "score": 77,
        "text_content": "- Season 1 is 10 episodes, 2 seasons greenlit - Scripts are still being written - Will adapt the Norse era games & focus on Kratos and Atreus - Show’s tone will “emulate tone of the game” - Game director Cory Barlog is actively involved - Filming may begin in 2026 at the earliest Collider article: https://collider.com/god-of-war-series-adaptation-prime-video-update-ron-moore/ IGN video: https://youtu.be/qjRM2TFvekQ?feature=shared",
        "comments": [
            {
                "raw_content": "Still think this should have been a animated series",
                "author": "Slmm58"
            },
            {
                "raw_content": "Why the norse era?…. They should def start from the beginning, Nolans The Oddyssey will make greek mythology hot again next year as well.",
                "author": "soliddd7"
            },
            {
                "raw_content": "Kratos is gonna look so goofy lol",
                "author": "Mako__Junkie"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Shinobi: People getting really carried away with that job listing.",
        "score": 535,
        "text_content": "Posted on resetera: https://www.resetera.com/threads/playstation-studios-ot47-the-wolf-pack.1243551/page-48 Also said that: Mezoly said: I still think it's probably safe to assume Sony thawing a bit on hard line exclusivity. GAAS games coming later to xbox if they make sense. More stuff like Lego Horizon, smaller spin offs games can come to Switch, etc Shinobi: Yes to these types of things.",
        "comments": [
            {
                "raw_content": "I'm surprised that fucking xboxera is the only one who leaked the Helldivers 2 port when everyone else knows sooo much about insider shit",
                "author": "boonjun"
            },
            {
                "raw_content": "Knack 2",
                "author": "ArcanaOfApocrypha"
            },
            {
                "raw_content": "It’s like we learned nothing from last year.",
                "author": "Mako__Junkie"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Battlefield 6’s BR map leaked with all POIs - Insider Gaming",
        "score": 322,
        "text_content": "- Map is called Lyndon Beach - 9 main POIs with 27 smaller ones as well - Scattered hints of a metro system - Information comes from trusted dataminer, temporyal Original source with a recreated map image: https://xcancel.com/temporyal/status/1949441365600797010#m Insider Gaming article: https://insider-gaming.com/battlefield-6-battle-royale-map/",
        "comments": [
            {
                "raw_content": "#Insider Gaming is a Tier 2 - Generally Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "To be fair, that map design actually seems to be quite good Its inspired more by Apex's maps and less by Warzone. I.e. more focus on engagements than a running simulator",
                "author": "Diastrous_Lie"
            },
            {
                "raw_content": "The Docks looks like Noshahr Canals",
                "author": "Beasty_Drummer"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Loving my new build",
        "score": 47,
        "text_content": "Finally upgraded from my 3700x to a 9900x cpu and from a 6700xt to a 9070xt gpu. The power color red devil is a pretty nice looking card and I plan on overclocking it soon.",
        "comments": [
            {
                "raw_content": "Is that a Corsair Carbide 500?",
                "author": "lLoveTech"
            },
            {
                "raw_content": "Nice, I recently swapped to a Corsair Frame 4000D RS from a Cooler Master HAF X that I must have had for 15 years. [https://imgur.com/a/fTnxuEp](https://imgur.com/a/fTnxuEp)",
                "author": "ATOJAR"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Say hi to my 2 all-AMD rigs!",
        "score": 115,
        "text_content": "Hi all! I love building rigs and has been building rigs since the 2000s. Nothing fancy, and my cable management skills are not up to the par of most of the folks here, but it's nice to be able to enjoy something I've built. RIG 1 (the main rig) (photo 1, 2) CPU : AMD Ryzen 7 5800X3D GPU : ASUS TUF Radeon 6800XT Mobo : Asrock B550M Steel Legend RAM : Kingston HyperX 3200mhz 32GB 2 sticks PSU : Cougar GEC 750W CPU Cooler : Thermalright Peerless Assassin Chassis : NZXT H3 Flow RIG 2 (the little brother/hand-me-down PC) (Photo 3,4) CPU : AMD Ryzen 5 5600 GPU : Sapphire Pulse 6700XT Mobo : SOYO (yupe) Dragon Monarch B550 RAM : XPG 3200mhz 16gb 2 sticks PSU : Cougar VTX 600 CPU Cooler : Deepcool AK400 Chassis : \"el-cheapo\" Invasion case Very happy with both rigs. Both are not OC/UV. any comments/suggestions ?",
        "comments": [
            {
                "raw_content": "Your Peerless Assassin is mounted upside down. Please fix?",
                "author": "CheemsGD"
            },
            {
                "raw_content": "Deep Cool, you rebel...",
                "author": "bdcrlsn"
            },
            {
                "raw_content": "I've forgotten to list out the soundcards that I am using . For the main rig it's the Sound Blaster Z, and for the 2nd rig it's the Asus Xonar DX ..",
                "author": "Outrageous-Car-4817"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Z2 Mini G1a: HP's AMD Strix Halo mini PC becomes available to purchase",
        "score": 55,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That pricing is certainly a choice ... Oof",
                "author": "mister2forme"
            },
            {
                "raw_content": "So...$2,000 for this or 1.3k for 9070 Prebuild....what am I missing? Why is Strix Halo so expensive? 40 RDNA 3.5 CUs, that's roughly RX7700 level. A $350 card in the current market? I'm converting to US Freedom dollars in my head, so I may be off in pricing, but still...wtf is that price?",
                "author": "SavedMartha"
            },
            {
                "raw_content": "Half a Terabyte of storage on the gen4 bus for $2000 is comical.",
                "author": "Bag-ofMostlyWater"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Scammer Alert",
        "score": 17,
        "text_content": "Guys, beware of the company **Superb Cash Offer** (also known as **Superb Equity Capital**), headed by **Justin \"Jay\" Kirby**. This company hires hundreds of virtual assistants (VAs) to send letters of intent (LOIs) to various realtors, but many of these VAs have reported not being paid for their work. Do not easily trust this company or his executive assistant, **James**, as they continue to assign tasks without proper compensation. In addition, there are reports that Jay Kirby has attempted to **secure loans or funds** without fulfilling repayment obligations. Based on these actions, many consider them **scammers**. Please stay cautious and spread awareness.",
        "comments": [
            {
                "raw_content": "No shit, he says ‘Private Money Connisseur’ …",
                "author": "Porpdk"
            },
            {
                "raw_content": "is Mo Mansoor in on it?",
                "author": "CautiousMagazine3591"
            },
            {
                "raw_content": "r/linkedinlunatics x post",
                "author": "benskinic"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Zillow Is Growing When the Housing Market Is Frozen",
        "score": 99,
        "text_content": ">For many Americans, the housing market isn’t working. Prices are too high for many buyers, and owners who locked in low mortgage rates are reluctant to sell. >Last year, home sales languished at the slowest pace in 30 years. >That hasn’t stopped millions of people from scrolling on Zillow, the country’s largest site for real estate listings. In fact, it’s one of the country’s largest sites of any kind: Each month, it attracts nearly 230 million unique visitors. “Zillow Surfing” is a thing. >Jeremy Wacksman, 48, took over as chief executive of Zillow a year ago, after stints as chief operating officer and chief marketing officer. And he’s no stranger to tough housing markets: He started at Zillow in 2009, in the thick of the subprime crisis. >Despite the housing-market gloom, Zillow reported a double-digit percentage jump in revenue in its most recent quarter. Its stock is up more than 60 percent over the past year. >The company makes money primarily, for now, by selling ads and leads to brokers, agents and others trying to reach the home buyers browsing its listings. It is trying to shift to what it calls a super app that connects users to providers of mortgages, rentals and other housing-related services. >Some competitors are wary of the way Zillow works. Zillow said recently that any home put on the market also must be listed on Zillow within 24 hours, or the listing would never be allowed on the site. >This practice is at the center of a lawsuit filed in June by Compass, the real estate brokerage, which claims that Zillow conspired to maintain a monopoly over digital home listings. Compass calls it the “Zillow ban.” Mr. Wacksman said the company will “vigorously” defend itself and, ever the marketer, that Zillow’s focus is on what’s best for its customers. > An interview follows, [you can find it here](https://www.nytimes.com/2025/07/27/business/zillow-house-prices-sales.html). Zillow is just a social media site, their CEO and CFO have said as much this year. The Zestiments mean nothing and have no legal obligation, so they'll put whatever gets clicks. When you see someone quoting Zillow, linking it? You know you're talking to someone pretty far behind the curve. This is starting to get interesting. For a bubble to pop, you need a 'run on the bank.' Stories like this make me realize that yeah, lots of people out there? They really are dumb enough to accept at face value what NAR and Zillow tell them...",
        "comments": [
            {
                "raw_content": "“ Zillow is just a social media site, their CEO and CFO have said as much this year.” Waiting for them to allow commenting… lol",
                "author": "blakeley"
            },
            {
                "raw_content": "Zillow is useful for their “sold” feature. That’s all I care about. Filter for “sold” and look at the recent actual sale prices of homes in your area or the area you want to buy. If a home sold for 1 million a month ago, that’s the market price in that area. So it’s not just a social media site. It provides real tangible info for anyone interested in actual real estate prices.",
                "author": "My1point5cents"
            },
            {
                "raw_content": "Zillow is PornHub for social deviants.",
                "author": "coolhanddave21"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Savings rate plunges and CC debt rises",
        "score": 71,
        "text_content": "Latest data is in for savings data Savings rate plunged 10% YoY and typically savings rate increases at start of year and drops thru out the year. Pre COVID we were hovering at 6% savings pct level during early summer It will be interesting to see if it drops below 3% this year by the holidays. https://fred.stlouisfed.org/series/PSAVERT All the while CC debt continues to trend at record levels https://fred.stlouisfed.org/series/CCLACBW027SBOG",
        "comments": [
            {
                "raw_content": "\"No one will give up a 2% mortgage!\".... until they have no other option but to give it up. And it seems that day is fast approaching.",
                "author": "VacationAgreeable912"
            },
            {
                "raw_content": "lol “plunges” really OP? It went from 4.9% to 4.4% that’s some hyperbolic language there for a half a percent decrease. Also looking at this savings chart (except for covid) it seems like savings rates just hover between 3 and 7 percent for the past 30 years. Is there really any meaningful data to take away from this?",
                "author": "Skylord1325"
            },
            {
                "raw_content": "Obviously there's gonna be a contraction soon, it's just when and how?",
                "author": "JacobLovesCrypto"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Is the south Florida housing market turning hot again?",
        "score": 9,
        "text_content": "",
        "comments": [
            {
                "raw_content": "All my friends down there don't seem to think so, they can't sell their shit without major cost reductions that would put them in the actual red...not the made up red.",
                "author": "Acceptable-One-6597"
            },
            {
                "raw_content": "Your 1/1 experience is in no way reflective of the entire state of Florida or even Boca as a whole 🙄",
                "author": "Horangi1987"
            },
            {
                "raw_content": "No.",
                "author": "ChadsworthRothschild"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "With Individual Home Buyers on the Sidelines, Investors Swoop into the Market",
        "score": 0,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Age reversal trials beginning soon. 👀👀👀",
        "score": 557,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Where can we learn more about the non-human primate trials? There is a paper, right?",
                "author": "garg"
            },
            {
                "raw_content": "https://preview.redd.it/es36nst19iff1.jpeg?width=810&format=pjpg&auto=webp&s=fa5e495aab6272da691fad14f9c8efe29cc6931d",
                "author": "MapacheD"
            },
            {
                "raw_content": "The age reversal he's talking about is narrowly targeted to retinal ganglion cells using partial epigenetic reprogramming using three of the four Yamanaka factors. They're hoping to rejuvenate ailing RGCs in the optic nerve to restore vision in glaucoma and NAION. Every result they've published so far is incredibly promising, I expect big things here assuming it's not all just lies.",
                "author": "garloid64"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "ChatGPT's mysterious 'Summit' model one-shotting a streaming site",
        "score": 500,
        "text_content": "Not sure what OpenAI is cooking, but if what's been leaking out from WebDev Arena is anything to go by they may be set to cook the competition... ...or at least finally give Sonnet/Opus a serious run for their money. Source: [https://x.com/chatgpt21/status/1949307106038878208](https://x.com/chatgpt21/status/1949307106038878208)",
        "comments": [
            {
                "raw_content": "The UI sure looks good, but I dread thinking about all the horror lurking in the back-end of such a thing..",
                "author": "ohHesRightAgain"
            },
            {
                "raw_content": "Summit is alright, Zenith is better. Not sure why everyone is convinced these are ChatGPT models though.",
                "author": "Pruzter"
            },
            {
                "raw_content": "Is this just the front-end with mock data? I never get these posts…",
                "author": "scrooopy"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "New paper introduces a system that autonomously discovers neural architectures at scale.",
        "score": 488,
        "text_content": "So this paper introduces ASI-Arch, a system that designs neural network architectures entirely on its own. No human-designed templates, no manual tuning. It ran over 1700 experiments, found 100+ state-of-the-art models, and even uncovered new architectural rules and scaling behaviors. The core idea is that AI can now *discover* fundamental design principles the same way AlphaGo found unexpected moves. If this is real, it means model architecture research would be driven by computational discovery. We might be looking at the start of AI systems that invent the next generation of AI without us in the loop. Intelligence explosion is near.",
        "comments": [
            {
                "raw_content": "Claims seem a bit bombastic don't they? I guess we will see in a few months if this is truly useful or hot air.",
                "author": "Beautiful_Sky_3163"
            },
            {
                "raw_content": "https://preview.redd.it/5u1h2cv2ijff1.png?width=1080&format=png&auto=webp&s=01afc2f0b33a20fb01a2187195e3b41d20a214c3 The claims have been debunked. It's another low quality paper with a catchy headline.",
                "author": "BrightScreen1"
            },
            {
                "raw_content": "I hope someone who knows can properly evaluate this claim. From my knowledge I can only paste the link to archive: https://arxiv.org/abs/2507.18074. Explanations are more than appreciated.",
                "author": "redditor1235711"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Zenith attempt on minecraft (presumably gpt 5)",
        "score": 246,
        "text_content": "",
        "comments": [
            {
                "raw_content": "did it actually manage to include procedural generation?",
                "author": "JoMaster68"
            },
            {
                "raw_content": "isn’t this actually crazy or am i tripping?",
                "author": "Sxwlyyyyy"
            },
            {
                "raw_content": "Hi, voxel game developer here. Is the code generating chunk based meshes, or is it simply instantiating a new cube for each voxel? I see a hole in the mesh when you remove a voxel, so it's hard to tell what's going on.",
                "author": "extensional-software"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "many of the anonymous OpenAI models have left lmarena and webdev",
        "score": 41,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yes, testing / teaser over. Release coming in early August.",
                "author": "peakedtooearly"
            },
            {
                "raw_content": "![gif](giphy|3o6vXUgk6M0h07MnuM)",
                "author": "Beeehives"
            },
            {
                "raw_content": "Confirming that all of these models are of the same company!",
                "author": "Independent-Ruin-376"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "This image shows you the best model in the world",
        "score": 176,
        "text_content": "https://preview.redd.it/ckxm4ww3khff1.png?width=609&format=png&auto=webp&s=6ee4bf54a9ea1cd2f4a15e002fba897d007a10a9 Higher is better.",
        "comments": [
            {
                "raw_content": "![gif](giphy|iAYupOdWXQy5a4nVGk)",
                "author": "No-Search9350"
            },
            {
                "raw_content": "![gif](giphy|521JLj0YGzz6AEWsZ5)",
                "author": "Beeehives"
            },
            {
                "raw_content": "Haha, excellent !",
                "author": "3deal"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI now ranks fifth in overall model usage by OpenRouter users, behind Google, Anthropic, Deepseek, and Qwen",
        "score": 227,
        "text_content": "",
        "comments": [
            {
                "raw_content": "what type of crazy person uses oai via openrouter at all? Sure, you can use oai models, for much more money, and way less features, you do you babe.",
                "author": "wi_2"
            },
            {
                "raw_content": "openai has weird policies on there. eg: you can't use o3 without signing up with openai api in which case you may as well use openai api; it defeats the whole point of openrouter",
                "author": "ihexx"
            },
            {
                "raw_content": "I think OpenRouter is primarily used for using the models inside Cline and other coding extensions. OpenAI currently does not have the best coding models and will therefore not be in the top places.",
                "author": "Quinkroesb468"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "A partner at a prominent law firm told me “AI is now doing work that used to be done by 1st to 3rd year associates. AI can generate a motion in an hour that might take an associate a week. And the work is better. Someone should tell the folks applying to law school right now.”",
        "score": 1187,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What's the alternative? No one applying to any degree program to get a job is safe considering it will be 4-10 years before they enter the workforce. Imagine wtf things are going to be like in TEN YEARS? If there are any jobs at all, they won't be entry-level. I think people should either not go to college or go to the cheapest state school that they can and major in whatever is the most interesting to them. You won't regret learning about something you are passionate about, at least, even if it results in no job.",
                "author": "Cryptizard"
            },
            {
                "raw_content": "I've been saying this for half a year, and it doesn't seem to get through, and now for some reason this X post does. Take a look at [https://stevesokolowski.com/dcg](https://stevesokolowski.com/dcg) \\- in particular, the opposition brief for the motion to dismiss, filed in the Pennsylvania case on May 27. The entire brief was created and all cases double checked by the 10 AI tools listed in the AI certification certificate. The AI tools have analyzed the entire litigation web, assisting us with determining how to respond to the satellite cases where we were sued by DCG, UBMI, and Wells Fargo shortly after that opposition brief was filed. This opponents are paying $1050-$2000 for top 20 BigLaw lawyers, the case is headed towards discovery, and a lawyer has never been involved for us.",
                "author": "Ok-Bullfrog-3052"
            },
            {
                "raw_content": "https://preview.redd.it/pw5yug8i4eff1.jpeg?width=1080&format=pjpg&auto=webp&s=fa365fef76becf761a2470c78f7f4fc8b4947478 so many replies like this. do people really think that AI isn't useful for law simply because a few people used AI carelessly?",
                "author": "micaroma"
            }
        ],
        "subreddit": "singularity"
    }
]