[
    {
        "post_name": "VOTE REPUBLICAN FROM NOW ON! For far too long, the Radical Left has put Burdensome and Unnecessary Restrictions on EVERYTHING",
        "score": 954,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Vote Republican? Fuck you uni party.",
                "author": "orange_kek_great"
            },
            {
                "raw_content": "Republicans are just democrats with an R next to their names.",
                "author": "projectarcturus1"
            },
            {
                "raw_content": "Nope. The republicants are worse than useless.",
                "author": "LordCommissarYarrick"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING - Outrage is erupting after it was revealed that Waukegan High School teachers and staff in Chicago Illinois organized a school walkout displaying a crucified effigy of President Trump, prompting mass calls to fire all involved.",
        "score": 1009,
        "text_content": "",
        "comments": [
            {
                "raw_content": "But muh Obama monkeys reee",
                "author": "wharfthrowaway"
            },
            {
                "raw_content": "Wow, the left really is Satanic!",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "That place has been a shithole for so long. The *teachers* are demonic shitbags.",
                "author": "projectarcturus1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "New State Bird Of Minnesota",
        "score": 337,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I lol'ed.",
                "author": "Tookens"
            },
            {
                "raw_content": "Its not wearing a head rag. Better watch out or the Somali kids are going to stone it.",
                "author": "TrumpWonByALandslide"
            },
            {
                "raw_content": "Lear Something New Everyday! 🤣",
                "author": "Xfactorroid"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "GOD BLESS AMERICA: How I sleep at night knowing that I can disembowel the political elite with satirical shitposts anytime that I want",
        "score": 310,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Snug as a bug in a rug",
                "author": "TxPede1776"
            },
            {
                "raw_content": ".....And my account got locked on x.",
                "author": "first_amendment"
            },
            {
                "raw_content": "night kek",
                "author": "OnceADroplet"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump confirms he wants to see EVERY SINGLE illegal alien deported — including the “well-behaved” ones. “We want to see everybody, we're focusing on the criminals…they all broke the law...it's EXACTLY as I said during the campaign!”",
        "score": 1202,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Thank God. That is all. What an enormous relief to hear this. Godspeed President Trump!",
                "author": "TheAftermath"
            },
            {
                "raw_content": "Someone in his inner circle needs to get him to agree to private contractors. Companies have promised they can capture 8-12 million in 16 months for roughly $20 billion. It just requires the feds opening a bounty hunter program. There should also be a tip hotline for schools or companies helping illegal immigrants. Sending feds to investigate would scare A LOT of institutions.",
                "author": "HorrorGameDev"
            },
            {
                "raw_content": "They entered the country illegally. They are all criminals. Every single one of them. I want anchor babies gone and their parents. I don’t give a single fuck. Get out!!",
                "author": "Gofuys"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Somalia just implemented a new program issuing voter ID cards to every voter. This is to ensure every voter can only vote once An ID is mandatory for voting But Ilhan Omar and Democrats reject ID for voting in America….",
        "score": 1170,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If a country with one of the lowest average IQs on the planet can hold elections where every voter must have an ID card, doesn't it kind of invalidate the argument that blacks are too stupid to manage it here?",
                "author": "tholinz"
            },
            {
                "raw_content": "If we had a real press they'd ask her about this.",
                "author": "bigdickhangsright"
            },
            {
                "raw_content": "Trump should make a post congratulating Somalia for election integrity, and urge congress to do the same.",
                "author": "DontTreadOnLego"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Is there a GiveSendGo to fix this?",
        "score": 1074,
        "text_content": "",
        "comments": [
            {
                "raw_content": "All communists do is destroy. They never create.",
                "author": "seattlerunner"
            },
            {
                "raw_content": "Hatred of something manifests only to cover beauty. The irony of the graffitti could not get anymore ironier.",
                "author": "Bornhere"
            },
            {
                "raw_content": "Had this been a mural of a black or LGBT person they would have tracked the perpetrator and charged then with a hate crime.",
                "author": "DontTreadOnSnek"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Spaceking Islamophobia",
        "score": 879,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"Phobia\" implies a fear that is uncalled for. I don't fear Islam; I despise what it stands for.",
                "author": "SwampMonsterJesus"
            },
            {
                "raw_content": "Tell them about per capita",
                "author": "Jodokon92"
            },
            {
                "raw_content": "No girls allowed!",
                "author": "Sythen"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump Walks Away As Shrill Reporters Ask Him to Apologize Over Meme",
        "score": 834,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Which meme was it so I can have it framed on my wall?",
                "author": "MythArcana"
            },
            {
                "raw_content": "People are not scared of being called a racist. They overused the word and it means nothing.",
                "author": "MorningFrost"
            },
            {
                "raw_content": "As the left side makes constant jokes about his weight and entire animated/AI series based on small dick jokes... nah they lost all their fake outrage points.",
                "author": "MaxineWaters4Prez"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Today is a really good day to call your Senators & ask them to cosponsor the SAVE America Act. Also ask them to make a public statement about bringing the SAVE America Act to the Senate floor for debate. Senate phone numbers start with: 👉202-224-XXXX👈",
        "score": 919,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’m sure my phone all will convince murkowski to stop being a rino… but I could try. Again.",
                "author": "Alaskan"
            },
            {
                "raw_content": "POST URL: https://truthsocial.com/@ScottPresler/posts/116025601682254684",
                "author": "ncswicn"
            },
            {
                "raw_content": "Leave a message after the beep….",
                "author": "Magma_Biscuit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Queer Lobby Reports 65% Drop In Fortune 500s Celebrating Corporate DEI",
        "score": 872,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Move over gays, illegal murderers and Mexican gang members are the protected class du jour.",
                "author": "Greenhills"
            },
            {
                "raw_content": "It’s still around, just rebranded and not as pushed into the spotlight. There is still diversity training and diversity goals that are part of managerial performance.",
                "author": "BoomShtick"
            },
            {
                "raw_content": "Last April, I selected stonks based on the lowest ESG scores, in part. It is going well.",
                "author": "Skogin"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Dow Jones Industrial Average just hit 50,000 for the first time in History. CONGRATULATIONS AMERICA!",
        "score": 1525,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What a joke. Fake money.",
                "author": "GdotLee"
            },
            {
                "raw_content": "Great news for the (((bankers)))",
                "author": "Leucophylla12"
            },
            {
                "raw_content": "Yeah and it did great under Biden too while the rest of us were fucked. What a joke",
                "author": "mlp67"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Liberals are now calling to put conservatives into re-education camps and if that doesn’t work then to kiII us for supporting ICE",
        "score": 1284,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Now? Lol, they've been talking about this for years.. but they are communists.. and thats what communists have done virtually every time they have come to power",
                "author": "MJ_43"
            },
            {
                "raw_content": "They are welcome to try..",
                "author": "TrumpPatriot83"
            },
            {
                "raw_content": "Re-Education camps are already here. They are called universities and public schools ran by the teachers union thugs",
                "author": "ElectionMeddler"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Nobody realized that the Crooked Democrat Politicians of the Unselect Committee of Political Thugs and Hacks... were given Pardons by Crooked Joe Biden.... These were CRIMINALS that were released by a “President” who did everything he could to destroy our Country",
        "score": 839,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The pardons weren’t even necessary since Pam has no intentions of ever arresting anyone.",
                "author": "CocaineShark"
            },
            {
                "raw_content": "\"preemptive pardons\" are garbage. do not legitimize them.",
                "author": "perma-maga"
            },
            {
                "raw_content": "Hey Trump, your weak ass choice for AG didn’t do jack shit about this, and let the statute of limitations expire, so why don’t you stfu? You have to take ownership for your administration and this one’s on you, amongst many other failures like no mass deportations",
                "author": "WhiteBoySummer"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "TRUMP VICTORY: A US Appeals court has just VACATED an activist judge’s injunction which HALTED President Trump’s executive order gutting DEI in the federal government",
        "score": 1667,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not every court case goes our way. But we need a mechanism to get rid of judges who push rulings that you HAVE to be racist against whites. It’s literally against the civil rights act.",
                "author": "ThisTrainHasNoBrakes"
            },
            {
                "raw_content": "Moar!!!!",
                "author": "Tordah"
            },
            {
                "raw_content": "Link https://x.com/nicksortor/status/2019846125289717831?s=20",
                "author": "I-am-Orlando"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "10 hours of jail surveillance from Ghislaine Maxwell dropped. Her deposition on Monday with House Oversight Committee.",
        "score": 1041,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That cell is a $3500/month rental in NYC",
                "author": "Alpha_Lemming"
            },
            {
                "raw_content": "why is this footage is important?",
                "author": "UncleTrumpsBand"
            },
            {
                "raw_content": "Aunt Jizzie--just like the not-so-late JEE--has a dead man's switch. Something really bad would happen to any interests who would dare to make her hang herself with paper towels in her cell.",
                "author": "PennsylvaniaRepublic"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Scott Bessent says the IRS is about to hit banks with sweeping audits over their role in washing Minnesota money.",
        "score": 1717,
        "text_content": "",
        "comments": [
            {
                "raw_content": "NO MERCY",
                "author": "Skogin"
            },
            {
                "raw_content": "Just do it and announce it after the results! Tired of the grandstanding bull shit.",
                "author": "TheLion"
            },
            {
                "raw_content": "The libtard fuckers are going to be freaking out at WeApOnIzAtIoN when that cunt Lois Lerner got away scott free.",
                "author": "MississippiRepublic"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "HALF of the children content on Netflix promotes transgender ideology.",
        "score": 1293,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Which is exactly why our family cancelled our subscription quite some time ago.",
                "author": "Qwirkle2075"
            },
            {
                "raw_content": "The adult content as well.",
                "author": "KuzoKevin"
            },
            {
                "raw_content": "I remember when \"content\" was correctly called \"programming\".",
                "author": "DustyGoose"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Tim Allen: Finished the entire Bible it’s been a 13 month word by word page by page no skimming journey. Humbled, enlightened and amazed at what I read and what I learned. I will rest and meditate on so much. I will begin it again.",
        "score": 642,
        "text_content": "",
        "comments": [
            {
                "raw_content": "My grandmother read the Bible to my father and his sister. Three times. Word by word. Page by page.",
                "author": "TEXinLA"
            },
            {
                "raw_content": "Like an English Lit professor, we have all seen videos of \"pastors\" reading passages from the Bible and telling us what they REALLY mean. How about they mean exactly what they say. You dont have to parse the Bible.",
                "author": "racer513"
            },
            {
                "raw_content": "Amen!",
                "author": "JoeBidensDementia1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "SEETHE HARDER: Raskin probes DOJ after Apple, Google blocked ICE tracking app",
        "score": 935,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fck this rat bastard.",
                "author": "PasqualiII"
            },
            {
                "raw_content": "There is no legal protection for using apps for insurrection and felony obstruction of federal agents.",
                "author": "OnlyTrump20"
            },
            {
                "raw_content": "This guy is a giant, and I mean GIANT piece of shit.",
                "author": "Tookens"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Report claims Nvidia will not be releasing any new RTX gaming GPUs in 2026, RTX 60 series likely debuting in 2028",
        "score": 605,
        "text_content": "",
        "comments": [
            {
                "raw_content": "In one sense I get mad, In another I realize I'm playing Rimworld and Terraria.",
                "author": "Saisinko"
            },
            {
                "raw_content": "I've realized I don't care anymore. There is no way I'll pay $1000+ for a gpu anyway so all these new cards and releases and benchmarks are just fluff that doesn't concern me anymore. Building computers used to be fun",
                "author": "LoudBoulder"
            },
            {
                "raw_content": "At this rate I'll be keeping my 5070ti for 10 years",
                "author": "A17012022"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[RTINGS] Wi-Fi 7 Marketing Is Lying About Its Biggest Feature",
        "score": 197,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hey! I'm the main test developper who worked on this article! Let me know if any of you have questions or feedback! And thanks for the share u/AppleCrumpets !",
                "author": "sp_RTINGS"
            },
            {
                "raw_content": "TLDW: The Wi-Fi Alliance pulled an HMDI and USB, making huge portions of the Wi-Fi 7 standard optional. As a result none of the 25 consumer \"Wi-Fi 7\" routers tested actually support the headline feature of the new standard \"Multi Link Operation\" or MLO.",
                "author": "AppleCrumpets"
            },
            {
                "raw_content": "Do any of the companies explain why they half assed the implementation?",
                "author": "Icynrvna"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Noctua - A cooler for life: celebrating half a million mounting upgrade kits",
        "score": 199,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I bought my NH-D15 almost 6 years ago for an AM4 build and it has been with me through numerous build iterations. In fact, it is pretty much the only part that carried over from my first build. The biggest downside about noctua products is that you probably won't get to enjoy the latest and greatest in cooling for at least a decade because there are no reasons to upgrade.",
                "author": "Eastern_Bet3714"
            },
            {
                "raw_content": "There are so many things with weird sized LOUD fans I upgraded with Noctua small fans. Bless them for these little things. They even come with a couple of splice adapters, they just know you're putting them in weird shit. Thanks, Noctua, now I can enjoy my Dreamcast in peace.",
                "author": "nickN42"
            },
            {
                "raw_content": "Thermalright for $35 or Noctua for $150. At least it's something.",
                "author": "Jumpy_Cauliflower410"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Disabling denoising can fix RT reflections when using DLSS 4.5",
        "score": 50,
        "text_content": "As already mentioned in the latest [DLSS4.5 Preset L video](https://www.youtube.com/watch?v=Lv8tJoiApd8) by Alex Battaglia from Digital Foundry the built in denoising seems to conflict with DLSS 4.5's preset L and M. Unfortunately this causes serious lighting instability. # Mirror-like reflections like with ray reconstruction Curiously disabling the denoiser in Silent Hill 2 and some other games resulted in very stable and crisp reflections. It even resolves textures a lot better which helps boost texture quality. The difference compared to Preset K with denoiser enabled is massive and Preset L looked like Ray Reconstruction was enabled. Take a look at the transitions at 7:20, 7:58, 8:15, 8:29, 8:39, 8:45, and 8:51 in DF's preset L video. From a blurry unstable mess to crisp and very stable, which is basically what you would expect from Ray Reconstruction. The benefits can also be seen in Robocop as well: [https://www.youtube.com/watch?v=ZH599M-J6Hg](https://www.youtube.com/watch?v=ZH599M-J6Hg) # Presets L = rrlite and preset M = rrlite_floded Another interesting discovery was made by DLSSTweaks dev \\_emoose\\_ (@mention is broken). Spotted the new models are called rrlite (preset L) and rrlite\\_folded (preset M) in the nvngx\\_dlss.dll file: [https://xcancel.com/\\_emoose\\_/status/2019095400334930344#m](https://xcancel.com/_emoose_/status/2019095400334930344#m) NVIDIA deciding to call the new models this when the rest of them has plant or animal names signifies something else is going on. \\_emoose\\_ saw the DLL file even includes code related to Ray Reconstruction so it does make sense: [https://forums.guru3d.com/threads/info-zone-gengines-ray-tracing-ai-dlss-dlaa-dldsr-tsr-fsr-xess-directsr-and-mods-etc.439761/page-247#post-6388116](https://forums.guru3d.com/threads/info-zone-gengines-ray-tracing-ai-dlss-dlaa-dldsr-tsr-fsr-xess-directsr-and-mods-etc.439761/page-247#post-6388116) # Preset M = preset L lite As suggested by u/ReydeViscerous in another forum the folded implies that preset M is a scaled down version of Preset L: >Speculative but it suggests L was the original model and to make the more performant M model they [folded](https://en.wikipedia.org/wiki/Folding_(DSP_implementation)) part of the complexity or maybe even some of the inputs at the cost of image quality. # Improves PT denoising in Dragon's Dogma 2 The benefits aren't limited to reflections. u/DoktorSleepless shared this video in another subreddit. As you can see preset L denoises PT (experimental) in Dragon's Dogma 2 a lot better that Preset K (old transformer): [https://www.youtube.com/watch?v=G0qyNCVMUNg](https://www.youtube.com/watch?v=G0qyNCVMUNg) In motion the difference grows: [https://www.youtube.com/watch?v=9mMGzJpCvNw](https://www.youtube.com/watch?v=9mMGzJpCvNw) # Wrapping up With such a limited sample size in and it's hard to draw any conclusions and more games need to be tested. Deep dives from DF, Hardware Unboxed and more side by side YT uploads is definitely warranted. I've also seen many people here and in the NVIDIA subreddit claim that the upscaler's denoising is either broken in some games or impossible to test because denoisers can't be easily disabled. Unfortunately as of now the updated super resolution models are incompatible with NRD and other built-in RT denoisers. This defeats the original purpose of DLSS: negating the performance loss of using ray tracing. It's a real shame that NVIDIA couldn't or didn't fix the denoiser issue with Preset L and M yet. **Note to mod:** I've deleted the original low effort Videocardz articl post and decided to incorporate the info from comment section + additional info here instead.",
        "comments": [
            {
                "raw_content": "I think we will see a DLSS 4.7 or whatever in a few months with all the rough edges rounded out. But having an upscaler that can act as a denoiser sounds extremely valuable for heavier RT games.",
                "author": "nukleabomb"
            },
            {
                "raw_content": "Has anyone tried with Cyberpunk yet and disabling RR? I don't know if there would be much to and for it.",
                "author": "aintgotnoclue117"
            },
            {
                "raw_content": "Nice post! Hope it gets more attention to it, tried bringing this up in some other subreddits before but this post explains it a lot better than I could. (btw what I said on twitter about RR looking almost identical to L in CV2, after some more comparisons I was pretty wrong about that, L seems to have a lot stronger (over?)sharpening compared to RR, while RR gives improved lighting & less ghosting compared to L. It did look like bright lights were very close between them though, while J/K gave slightly dimmer lighting, at least in the 1 game I've checked, but I wonder if that's related to the HDR changes that NV mentioned. Hoping more comparisons of RR vs 4.5 might show up eventually.)",
                "author": "_emoose_"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "TSMC is on track to have more employees than Intel for the first time in history — TSMC's explosive growth stands in contrast to Intel's rapid contraction",
        "score": 93,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Uhhh... > Intel employed 85,100 people as of December 27, 2025, following substantial job cuts at Intel in 2024 and colossal job cuts in 2025. TSMC had 83,825 full-time employees serving in various capacities as of December 31, 2024, following years of aggressive hiring amid expansions overseas as well as building out new production capacity in Taiwan. As a result, it is more than likely that when TSMC publishes its Annual Report in mid-April, it will report well over 83,825 full-time employees, therefore surpassing Intel as the biggest employer in the semiconductor industry. So the headline is just clickbait...",
                "author": "Nicholas-Steel"
            },
            {
                "raw_content": "The fact that Intel had more for so long is a testament to just how bloated the companies payrolls were. Nobody likes seeing layoffs, but sometimes that's what's needed.",
                "author": "Competitive_Towel811"
            },
            {
                "raw_content": "Hello Forsaken_Arm5698! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel, AMD notify customers in China of lengthy waits for CPUs",
        "score": 123,
        "text_content": "- Intel warns of delivery lead times of up to six months for some CPUs, sources say - Intel server products in China now cost '10% more generally', source says - Delivery lead times for some AMD products now up to 10 weeks, source says",
        "comments": [
            {
                "raw_content": "This little maneuver's gonna cost us 5 Years - Sam Altman",
                "author": "NeroClaudius199907"
            },
            {
                "raw_content": "CPU consumption is double now for every servers. The next great supply shortage and price increase for CPU is coming",
                "author": "Ecstatic_Secretary21"
            },
            {
                "raw_content": "Whats next? The PSUs getting 5x more expensive?",
                "author": "txdv"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Phoronix] AMD Introduces New GPU Target To AMDGPU LLVM: GFX1170 \"RDNA 4m\"",
        "score": 25,
        "text_content": "The RDNA3 Saga continues... possibly?... Eh probably Kepler\\_L2 [https://xcancel.com/Kepler\\_L2/status/2019850795391361243](https://xcancel.com/Kepler_L2/status/2019850795391361243) >Bit of a \"Rebrandeon\" going on here, but at least with FP8 support added it can run FSR4",
        "comments": [
            {
                "raw_content": "[https://llvm.org/docs/AMDGPUUsage.html#processors](https://llvm.org/docs/AMDGPUUsage.html#processors) So far adds to the list of gfx targets yet to be released. \\-RDNA3.5- gfx1153 - 'APU' \\-\"RDNA4\"\\*- gfx1250 - 'APU' gfx1251 - 'APU' \\*(IIRC 125x is DCAI, CDNA6 possibly, from Kepler) \\-RDNA5- gfx1310 - 'dGPU'",
                "author": "Noble00_"
            },
            {
                "raw_content": "Interesting that they explicitly call it RDNA 4m instead of some 3.x. Could be marketing, or it could be that while being RDNA3-derived it has some more substantial changes compared to 3.5. At least FP8 support seems to be there.",
                "author": "Kryohi"
            },
            {
                "raw_content": "Generational ragebait if they launch new RDNA3 stuff with hardware to run fsr4, while the rest of RDNA3 cant",
                "author": "glizzygobbler247"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Wild leak suggests Snapdragon 8 Elite Gen 6 could run cooler thanks to... Exynos?",
        "score": 11,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Aka Qualcomm might use samsung foundry's heatsink. Wild. And nothing involving exynos.",
                "author": "VastTension6022"
            },
            {
                "raw_content": "I couldn’t find any articles about what Heat Pass Block actually is, just 30 different variations of this article. Anyone know what’s special about it?",
                "author": "crab_quiche"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "So you’re telling me. These run incredibly on Switch 2 but PGA Tour, NBA 2K, Madden and FIFA can’t run at 60fps? Bethesda can’t optimize any of their games to run smooth and still have good lighting? Aspyr couldn’t release a Tomb raider remaster with current gen graphics options? Gearbox? 🙄",
        "score": 327,
        "text_content": "Way too many devs not even putting in effort imo but they won’t be getting my money. That simple.",
        "comments": [
            {
                "raw_content": "Bethesda is just inexcusable. Gearbox, I get, the game was a mess on every platform last year and still isn’t that smooth performance wise. That part isn’t excusable, but a long delay/cancellation for S2 is. Are any of these games pictured at 60fps though?",
                "author": "cuntpuncherexpress"
            },
            {
                "raw_content": "I can't wait for Xenoblade Chronicles 4 to completely outclass everything on the system in terms of graphics",
                "author": "buttsecks42069"
            },
            {
                "raw_content": "My pragmata doesn’t look that good lol but I’m guessing docked?",
                "author": "Worldly-Ad3447"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I made a graphic that shows the first-party lineup for the 1st year of several Nintendo consoles, including the Switch 2.",
        "score": 172,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I think we were spoiled with first party zelda and Mario in the first year of the switch.",
                "author": "dreamingwithcindy"
            },
            {
                "raw_content": "gamecube wins tbh",
                "author": "Elyndria"
            },
            {
                "raw_content": "But between GC and Wii U, there was GBA, NDS and 3DS. So it would be better to show what was released during that as teams were split back then. Now everything is being released for Switch and eventually only Switch 2",
                "author": "Total-Watercress-384"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Bethesda dissappointment",
        "score": 328,
        "text_content": "My excitement turned quickly into dissapointment when I realized Fallout and Oblivion are both a code in a box. Thanks Todd Howard. Oblivion, a code in a box Fallout 4, a code in a box Every single Bethesda physical is a code in a box!",
        "comments": [
            {
                "raw_content": "I don't get codes in boxes. At that point, why not just buy it on the eshop?",
                "author": "MegaFloppy69"
            },
            {
                "raw_content": "But then for Indiana Jones and the Great Circle we get the full game on cart.",
                "author": "Gera-2000"
            },
            {
                "raw_content": "One: put no card in a box Two: put a code in that box Three: make 'em purchase the box And that's the way you do it",
                "author": "ntwild97"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Finally got my hands on a Switch 2!",
        "score": 112,
        "text_content": "Hard work really pays off! Was struggling a bit with money due to finding a job, and my old job not paying a lot. Ended up finding a better paying job, and finally got the Switch 2! It feels great finally being able to buy something you've wanted, and thinking you'd never be able to afford it! Any recommendations for games? I'll be getting Tomodachi Life when it comes out!",
        "comments": [
            {
                "raw_content": "Congrats man",
                "author": "OptimalOcto485"
            },
            {
                "raw_content": "Hello! Welcome to r/NintendoSwitch2! Your post has been sent to the moderators for review. To help manage spam, trolling, and repetitive posts, we restrict new posts from accounts that do not have much comment karma earned in this subreddit. Please contribute through comments on other posts in the meantime. If you are trying to ask about an issue with your Switch console or otherwise seeking help, you may want to check out the peer support community at r/NintendoSwitchHelp. You can find our rules here: https://www.reddit.com/r/NintendoSwitch2/wiki/rules *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NintendoSwitch2) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Dude I love these wholesome posts! I hope you love it like I have, what games are you playing on it first?",
                "author": "silver_crit"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I’m assuming chances are low but it’d be great if we got the N64 Indiana Jones on NSO in anticipation for Golden Circle.",
        "score": 35,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Considering how Disney games are on Sony's classic subscription service. I am genuinely surprised that so far, nothing from Disney has appeared on Nintendo's classic subscription service. As between Disney Interactive and Lucasarts vast library, that's like several years of games for each NSO app.",
                "author": "Animegamingnerd"
            },
            {
                "raw_content": "The game is on steam. I grabbed it for like 2 bucks not that long ago, ha. Makes me hopeful it’ll happen one day. But are there any Disney owned games on the service?",
                "author": "JustinAndFeena"
            },
            {
                "raw_content": "I can see them doing a Indiana Jones classic collection like the Disney afternoon collection",
                "author": "jrpbateman"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I'm really excited for Resident Evil 9. It looks amazing on Switch 2.",
        "score": 283,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’m hoping this does well on Switch 2 and Capcom decide to port RE. 2, 3 & 4 Remakes. 2 & 3 will be tricky as there’s already cloud versions on the store.",
                "author": "ollielite"
            },
            {
                "raw_content": "Definitely getting that three pack.",
                "author": "Mild-Ghost"
            },
            {
                "raw_content": "It looks great, funny how Leon missed many of his shots in the trailer, which is understandable, because Nintendo wanted to not show a violent trailer.",
                "author": "Ghaleon32"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Rate my physical collection",
        "score": 43,
        "text_content": "1-10",
        "comments": [
            {
                "raw_content": "Why is Pokémon violet so dim",
                "author": "bigparsnipenjoyer"
            },
            {
                "raw_content": "Nice collection and nice shoes mang.",
                "author": "Horvat53"
            },
            {
                "raw_content": "No kirby, 0/10.",
                "author": "Bruhmomento6942011"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "WHATS YOUR COMPLETION TIME- post em if you got em",
        "score": 49,
        "text_content": "The game was way better and more fun then I originally expected it to be now I’m just running back to get better times lol - I wonder if anyone has gotten it to single digit numbers first run through was 14.45 second one was this - I wonder how low we can get this speed run",
        "comments": [
            {
                "raw_content": "I got just under 20 minutes and I think I got drawing number 7",
                "author": "Reasonable-Bridge-12"
            },
            {
                "raw_content": "9 mins. Then I stopped doing speedruns when I found out there are no other sketches for that.😅 I'm currently doing the other challenges to get all 8 sketches.",
                "author": "Massive_Fly_1709"
            },
            {
                "raw_content": "https://preview.redd.it/1xaopm699zhg1.jpeg?width=1920&format=pjpg&auto=webp&s=24c3ea2a42ea7168a7bc4b7adcc8cec4386c99e8 Had a faster one under 6 min but didn't save a picture before uninstalling.",
                "author": "Redred1717"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "List of major games Ubisoft has cancelled since 2018",
        "score": 391,
        "text_content": "# 2026: * **Project League**: A co-op Assassin's Creed game, originally conceived as a DLC for AC Shadows. * **Prince of Persia: The Sands of Time Remake**: In development since 2020, and cancelled after rebooting development. It was really close to getting released. * **Three unannounced titles (New IPs) and a mobile game** # 2025: * **Star Wars Outlaws 2**: Cancelled very early in development, according to Tom Henderson. Possibly scrapped due to poor sales. * **Project Maverick (original version):** Extraction-Based spin-off of Far Cry, initially intended to be the multiplayer component of FC7. Development was rebooted in early 2025, and some resources shifted towards FC7. # 2024: * **Project Pathfinder (original version of Project U)**: Announced in 2022 as a “new kind of session-based cooperative shooter”. Development was rebooted in 2024, after the success of Helldivers 2. * **Project Scarlet**: Assassin's Creed game set during the post-American Civil War period. Cancelled for being deemed \"too political\" for the current climate in the US. * **The Division: Heartland:** A free-to-play, PvEvP extraction-survival shooter. Cancelled to prioritize \"bigger\" projects like XDefiant (lol) and the Rainbow Six franchise. # 2023: * **Project Oxygen (Immortals Fenyx Rising 2):** In development at Ubisoft Quebec and set in a fictionalized Polynesian archipelago. Cancelled to prioritize more established IPs. * **Project Q**: A stylized 3rd-person PVPVE game made in Unreal Engine 5. Cancelled to shift priority to other projects. * **Project Renaissance**: A Minecraft-type voxel game where you could create different worlds. After its cancellation between February and May 2023, it turned into another game internally named **Project Alterra**. # 2022: * **Tom Clancy's Ghost Recon Frontline:** A free-to-play, first-person shooter. Developed by Ubisoft Bucharest and announced in 2021. Cancelled due to bad reception. * **Splinter Cell VR**: Announced to be in development by Ubisoft Redstorm in 2020 and eventually cancelled due to the results of cost reduction. * **Two unannounced titles.** # 2021: * **The Story of Rayman/Rayman Forever:** A remake of the original Rayman with the working titles \"Rayman: Forever\" and \"The Story of Rayman\". It was scrapped in 2021, according to a former Ubisoft VFX artist. * **Project Reaper (original version of TD Heartland)**: A standalone battle royale of The Division that was shelved in 2021 due to poor player feedback. It restarted development in 2022, due to Hyper Scape shutting down, and became Heartland, which also got cancelled. # 2019: * **Project Pioneer:** A sci-fi game with non-violent exploration that started development around 2013 and was teased inside Watch Dogs 2. According to Kotaku, it got rebooted into a co-op multiplayer alien shooter. * **Project Avalon**: A medieval fantasy RPG with elements of magic and swordplay, loosely based on King Arthur. Dragon Age creative director Mike Laidlaw was directing the project. * **Sequel to Prince of Persia 2: The Shadow and the Flame:** A 2D sequel to the 1993 game, developed by Ubisoft Montpellier. It was cancelled in 2019, according to Jordan Mechner. # 2018: * **Project Falcon (original version of XDefiant):** A monster-hunting game that Ubisoft San Francisco was developing. It ended up being reworked and became XDefiant. * **Project Ion:** Another sci-fi title that was being developed by Ubisoft Redstorm. There's not much information surrounding this project, so it might just be an earlier iteration of **Pioneer**.",
        "comments": [
            {
                "raw_content": "> It restarted development in 2022, due to Hyper Scape shutting down, and became Heartland, which also got cancelled. That's both sad and funny",
                "author": "Sea-Country8245"
            },
            {
                "raw_content": "Still sour of Immortals Fenyx Rising sequel!",
                "author": "Zikari82"
            },
            {
                "raw_content": "how did a monster hunter clone turned into call of duty clone",
                "author": "Gareebonkabatman243"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Pokemon Gen 10 Leaks Show Graphics Early Graphics, Big City & More",
        "score": 476,
        "text_content": "[https://thegamehaus.com/pokemon/pokemon-gen-10-leaks-island-images-huge-city-more/2026/02/06/](https://thegamehaus.com/pokemon/pokemon-gen-10-leaks-island-images-huge-city-more/2026/02/06/) This is probably the biggest leak of Gen 10 so far. Obviously, the graphics will get better but this is from 2024.",
        "comments": [
            {
                "raw_content": "Terrible website on mobile, anyone got any sceeen shots?",
                "author": "HunchoLou"
            },
            {
                "raw_content": "Really hope Gen 10 is a slam dunk for Game Freak. New engine, new hardware. Could be a nice fresh start for them after how much they struggled in the Switch era.",
                "author": "lattjeful"
            },
            {
                "raw_content": "These beta images look better than the final builds of Scarlet and Violet lol. Excited to see some footage in a few weeks",
                "author": "booktok124"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Tom Henderson/Insider Gaming: MindsEye Co-CEO Alleges €1 Million+ Was Spent in Sabotaging The Game, Will Pursue Legal Action",
        "score": 782,
        "text_content": "MindsEye co-CEO Mark Gerhard has alleged in an internal meeting with Build a Rocket Boy employees that they have “caught the guys” who sabotaged MindsEye in an alleged **€**1 million+ campaign. In the meeting, which took place in late January and was sent to Insider Gaming on the condition that the video not be made public, Gerhard opened the call by saying they “caught the guys who’ve been sabotaging MindsEye.” He alleged that the company behind the campaign was a “very big American company,” but that “it’s probably not the company you’re thinking of.” The story goes into details on how Build A Rocket Boy began tracking employees and that they'll put those they claim are responsible in an upcoming mission in MindsEye that was originally meant for Hitman. SOURCE: [https://insider-gaming.com/mindseye-ceo-alleges-1-million-sabotaging-its-game/](https://insider-gaming.com/mindseye-ceo-alleges-1-million-sabotaging-its-game/)",
        "comments": [
            {
                "raw_content": "#Insider-Gaming is a Tier 2 - Generally Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "> they have “caught the guys” who sabotaged MindsEye in related news, Leslie Benzies was recently seen dressed up as a hot dog",
                "author": "blackthorn_orion"
            },
            {
                "raw_content": "![gif](giphy|l0IykOsxLECVejOzm)",
                "author": "ThinWhiteDuke00"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Pokémon’s 30th Anniversary Super Bowl commercial partially leaked; features Lady Gaga, Young Miko, & Charles Leclerc",
        "score": 290,
        "text_content": "https://xcancel.com/centroleaks/status/2019650640088297854?s=46",
        "comments": [
            {
                "raw_content": "“Must be the water”",
                "author": "ryzenguy111"
            },
            {
                "raw_content": "CHARLES LECLERC???",
                "author": "ComplexStrict6496"
            },
            {
                "raw_content": "I wonder what Lady Gaga’s favorite pokemon is",
                "author": "WallyWithReddit"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[Extas1s] Kingdom Hearts Remake coming early 2027 with KH4 launching Winter 2027",
        "score": 612,
        "text_content": "•Title: Kingdom Hearts Relux •Says he has received images of the remake, provider requested images not be shared •Completely updated graphically, while maintaining original aesthetic •Same core combat mechanics and locations, however with some new additions. Such as expanded areas in Halloween town and Traverse Town •Developed by the makers of FF7: Crisis core reunion •Composed of the remains of the cancelled Missing Link •New world: The Jungle book •New playable Riku segments, Cait Sith supposedly makes an appearance •Re-recorded opening song with another artist to accompany Hikaru Utada •Originally targeting 2026 as a SW2 Exclusive but he says “could” delayed to 2027 due to shift in priority to multi-platform (This point instills the most doubt in me because i’m pretty sure Square was already in the multi-platform push phase by the time missing link got cancelled) [Source](https://youtu.be/40XE3Z5hWBM?si=xvM4ak7JxEzP0jo1)",
        "comments": [
            {
                "raw_content": "#eXtas1s is a Tier 4 - Generally Unreliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Yea & I'ma win the lottery",
                "author": "Raplorde"
            },
            {
                "raw_content": "Okay how would the assets of a cancelled mobile game (Missing Link) that has a completely different story, setting, and gameplay format help at all with a remake of KH1?",
                "author": "Lazzyman64"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Epic Games Store to be on next Xbox on \"Day 1\", allowing native access to PC games",
        "score": 296,
        "text_content": "“We definitely plan to be on the new hardware for Xbox, because, unless their policy or stance on it changes, they are telling us they’re going to welcome that. And we’re going be there, like, on day one. That will probably require us to build in whatever their requirements are, some sort of software to support that.” Seems to support the rumors over the last year that 1) New Xbox is indeed coming 2) New Xbox is a PC hybrid 3) New Xbox will allow third party store fronts https://www.gamefile.news/p/epic-has-many-plans-for-its-game Previous Rumors: https://www.reddit.com/r/GamingLeaksAndRumours/comments/1ohenhf/jez\\_corden\\_microsofts\\_ambitious\\_new\\_xbox\\_your/ https://www.reddit.com/r/GamingLeaksAndRumours/comments/1le4fdp/a\\_complete\\_look\\_at\\_the\\_confirmed\\_suggested\\_leaked/ https://www.reddit.com/r/GamingLeaksAndRumours/comments/1ny4tvs/neogaf\\_xbox\\_new\\_hardware\\_is\\_up\\_in\\_the\\_air\\_and\\_may/",
        "comments": [
            {
                "raw_content": "... Will this be a \"console\" in the sense that the Xbox ROG Ally was a \"console?\" Because it sounds a lot like they're just going to be selling Windows PCs.",
                "author": "Ok_Peace628"
            },
            {
                "raw_content": "Will the next Xbox have free online? I can’t imagine having a pc like console but having to pay for online gaming.",
                "author": "JjoyBboy"
            },
            {
                "raw_content": "This thing is sounding more and more expensive the more I hear about it.",
                "author": "Minimum-Can2224"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Bend Studio Cancelled Live Service “Mirror Pond” Animations Surfaces",
        "score": 165,
        "text_content": "https://mp1st.com/news/report-bend-studio-cancelled-live-service-title-mirror-pond-animations-surfaces",
        "comments": [
            {
                "raw_content": "I’m still grateful they pulled the plug on it, but man it couldn’t have come sooner? We won’t get a new Bend game for at least the next five to six years because Sony decided to go all in on line service slop. What a shame and a waste of talent.",
                "author": "youknowitslucasio"
            },
            {
                "raw_content": "All these live services don't realize people have limited time and money.",
                "author": "GreatGojira"
            },
            {
                "raw_content": "If they would have just made Days Gone 2 using the same assets and framework of the first game they would have had a new release by now. I mean Days Gone wasnt perfect but the shell of something great was there that could have been improved with a sequel. This live service push really hurt SIE's output. What a colossal misfire.",
                "author": "XthecreatordayX"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Potential new spoilers about Resident Evil Requiem from a Chinese insider",
        "score": 207,
        "text_content": "[Original reddit thread](https://www.reddit.com/r/ResidentEvilRequiem/comments/1qxk180/new_re9_requiem_spoilers_from_chinese_insider/) The info was posted on [Bilibili](https://m.bilibili.com/opus/1162383674075774983) and [Tieba](https://tieba.baidu.com/p/10465590677?fr=frs#/) Credit to u/Cautious-Ad4556 Note: the spoilers have been translated with Gemini3 SPOILERS **The Story**: RE9 focuses on the story of two individuals cursed by Umbrella. Someone is secretly helping Grace,this person is confirmed to be neither Leon nor Victor. \"Time\" is a crucial element that runs through the entire game. **Some Dialogue Lines** \"You probably want to know if there's a cure for your condition, Mr. Kennedy.” “I’d like to know when the last time you brushed your teeth was.” **About Leon's Infection** Victor refers to these side effects as \"Umbrella's gift\" The infection visible on Leon's neck does not originate from this game, nor is it a new virus. The strange black growths are described in a conversation with Victor as symptoms that gradually appear in many Raccoon City survivors over time. The \"team\" supporting Leon in this game may \"include\" other survivors of the Raccoon City incident. (Note: The leaker hints that they might not necessarily appear physically). A fourth Raccoon City survivor died in a government office, though specific details were not given. **The Final Boss** Victor is NOT the final boss. The final boss is unexpected; he/she only spoke a single line in the trailers. Most people's first impression of Victor is largely correct, but \"Victor is just Victor\"—he hasn't changed his name, nor has he been possessed/body-snatched.(Note:AI translate trash here,look the hint below) **About Victor** The hooded man who killed Alyssa is Victor, even if they don't look alike. Victor's skin condition is related to Wrenwood Hotel event. Victor is extremely calculating; he can even directly access information regarding DSO government agents. Victor and Leon are influenced by the same thing. This is different from the infection affecting the zombies at the Rhodes Hill Chronic Care Center. Rather describe Victor as a villain, rather than described him as \"another pitiful soul\" or a \"teacher.\" To Grace, he is like Hannibal Lecter to Clarice Starling.(Note:maybe this is about Silence of the Lambs) To Leon, he is like a fellow patient suffering from the same torture. **About Leon** Don't be fooled by how invincible Leon looks in the trailers; he is going to struggle significantly. Victor is very tall and physically strong, similar to Mendez in RE4. Leon undergoes both physiological and psychological torture. The leaker used the word \"Exhausted\" to summarize his state. You will see a clear shift in Leon's mentality. Regarding complaints about Leon's slow reaction to the nurse's death in the demo: The leaker states this isn't the only person he fails to save. There will be similar sequences. In the late game, Leon receives support from his \"team,\" primarily in the form of equipment/gear. Regarding the new dialogue from yesterday's Switch presentation: Leon mentions six Raccoon City survivors who died from the same thing. Their \"curse\" is the same as Leon and Victor's. These six deceased survivors do not include Alyssa. **About Grace** Grace has a gameplay system related to her identity as an FBI Analyst. In the late game, this system can even determine the order in which you explore certain areas. There are numerous documents/files that require Grace's gameplay system to analyze and read. **Other Characters** the woman who contact with Leon in trailer is Sherry.(Note:leaker post a emoji which means \"雪梨\"，雪梨 Xueli，a chinese word pronounced similarly to Sherry) **Rhodes Hill Chronic Care Center** Rhodes Hill Chronic Care Center is filled with high-contrast dark humor. Victor used a specific method to shoot down the helicopter coming to rescue Leon (Note: Likely the new scene shown in yesterday's Switch presentation). The location features a mix of classical architecture and construction sites. There is a sequence similar to Water Hall in RE4 (Note:confirmed by last night Switch Presentation, leaker post this a few days ago ). **Raccoon City Chapter** in trailer Leon drives Grace to Raccoon City. This is done in defiance of the orders from the organization that sent him. They are racing against time. Dialogue between Leon and Grace is sparse in the early game but increases significantly during the drive to Raccoon City and afterwards. **The reason for going to Raccoon City**: \"Something\" went to Raccoon City. **Implied Information** The leaker \"liked\" some comments asking him more about RE9 Leon is alive in the ending. There is someone secretly helping Grace. The leaker \"liked\" a comment asking if Ada would appear in RE9, hinting that Ada might be involved (though potentially not in a physical capacity). The final boss might be Spencer. Take the info with a grain of salt",
        "comments": [
            {
                "raw_content": "\"the final boss might be Spencer\" Somehow Spencer returned",
                "author": "LukasOne"
            },
            {
                "raw_content": "\"You probably want to know if there's a cure for your condition, Mr. Kennedy.” “I’d like to know when the last time you brushed your teeth was.” Yeah this is real lmao",
                "author": "UnidentifiedRoot"
            },
            {
                "raw_content": "The line about brushing teeth is a classic Leon quip lol, Unc still got it",
                "author": "Exige30499"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Arc B390 iGPU beats AMD Radeon 890M by 23% in Phoronix Linux gaming tests",
        "score": 68,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good. AMD has been rehashing same crap lately. This is why competition matters",
                "author": "Current_Finding_4066"
            },
            {
                "raw_content": "only +23% in Linux feels like bad drivers, when the B390's getting 2x performance on Windows",
                "author": "LastChancellor"
            },
            {
                "raw_content": "I want Intel to win but sadly they only win against the HX370 which is a generation behind the 395+. So intel is still behind. They better price it well below the HX370 to regain market share. AMD lost the plot in terms of pricing and HX370 handhelds are well over 1300. If they can partner with MSI and produce a handheld for under 1000 they have a winner. Anything above that is DOA.",
                "author": "WorstRyzeNA"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel XeSS 3 Multi Frame Generation works on entry-level Arc A380 \"Alchemist\" GPU and Claw 8 \"Lunar Lake\" handheld",
        "score": 20,
        "text_content": "",
        "comments": [],
        "subreddit": "intel"
    },
    {
        "post_name": "How long do you think AM4 will keep going until it meets it's end?",
        "score": 149,
        "text_content": "Firstly launched in 2016, and 10 years later it still holds it's integrity and is constantly receiving updates, specially now with this chip shortage, AI bubble, people constantly going for DDR4 and yada yada yada. Considering all this and the fact that even DDR3 systems are making their return, how much more do you think AM4 will last? Year after year it feels like it'll never acutally die or get outdated.",
        "comments": [
            {
                "raw_content": "My 5800x3d will need to last me till AM6. Which it will. Best purchase ever.",
                "author": "Available_Resort_769"
            },
            {
                "raw_content": "Discontinuing the AM4 X3D chips was a big mistake. They should rethink it.",
                "author": "Dunkle_Geburt"
            },
            {
                "raw_content": "Probably until am6/the ram crisis ends, so 27/28",
                "author": "Sharp_Fuel"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD GFX1170 \"RDNA 4M\" spotted in Linux patches, possible RDNA3 APU refresh",
        "score": 74,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And you just know they're going to pair it with Zen 2",
                "author": "ComputerEngineer0011"
            },
            {
                "raw_content": "hello RDNA 3.7, nice to meet you.",
                "author": "Relevant-Audience441"
            },
            {
                "raw_content": "Zen 5, or even Zen 4 with RDNA 4 is gonna be a killer mobile chip. But nooooo. gotta use the 5 year old architecture and let Intel catch up. AMD loves to shoot themselves in the foot.",
                "author": "FunkyRider"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Americans are so broke and housing is so expensive that \"rent now, pay later\" is on the rise",
        "score": 462,
        "text_content": "",
        "comments": [
            {
                "raw_content": "By all means, let’s find new and creative ways to allow asset values to remain propped up, shifting the risk onto the backs of the people. This is America, after all. The people matter less than the institutions.",
                "author": "None"
            },
            {
                "raw_content": "I'll gladly pay you Tuesday for a hamburger today",
                "author": "point_of_you"
            },
            {
                "raw_content": "Can anyone post text cause there’s yet another paywall …",
                "author": "EJ2600"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Rocket CEO says U.S. mortgage industry is a \"tale of two cities.\" His booming business shows a broader reality for American homebuyers",
        "score": 77,
        "text_content": "For the past couple of years, the housing market has been a touchy subject for many Americans. As both mortgage rates and home prices remained elevated far above pandemic levels, many lost hope in the American dream of homeownership, and younger generations gave up on the idea altogether. But the CEO of Rocket Companies, whose flagship subsidiary is Rocket Mortgage, said this week there are signs Americans are moving off the sidelines and vying for homeownership. Coming at the heels of mortgage rates dropping just slightly below 6%, Rocket CEO Varun Krishna told CNBC the company is poised to have the highest mortgage loan production volume and highest gain on sale in four years. Rocket’s current success differs vastly from what’s happening in the mortgage industry more broadly. While the Detroit-based lender rides a wave of renewed demand, PennyMac, a major U.S. mortgage lender and servicer, faces a slower and more painful reset. Read more: [https://fortune.com/2026/02/05/rocket-ceo-mortgage-industry-housing-affordability-tale-of-two-cities-apps-increasing-mortgage-rates/](https://fortune.com/2026/02/05/rocket-ceo-mortgage-industry-housing-affordability-tale-of-two-cities-apps-increasing-mortgage-rates/)",
        "comments": [
            {
                "raw_content": "Yeah mortgage application rate would say otherwise: https://www.mortgagenewsdaily.com/data/mortgage-applications This is your second post today trying to sprinkle some hope in the the housing market. I wonder why?",
                "author": "Yourprobablyaclown69"
            },
            {
                "raw_content": "This article says exactly what I've been saying for months...its those high income buyers with equity who are driving the housing market. \"That “tale of two cities” today illustrates what American households are experiencing. For relatively higher‑income borrowers with strong credit, a modest decline in rates—into the low‑6% range—can be just enough to make a purchase feasible, especially if they already own a home and can tap equity to make a down payment purchase. Those buyers are the ones driving much of Rocket’s new activity, even as they trade the ultra‑low rates of the past for more expensive loans.\"",
                "author": "RealisticForYou"
            },
            {
                "raw_content": "If a tiny change in interest rates gets you back in the game, you either could have at any time anyway or you're cutting too close to be doing it to begin with.",
                "author": "90swasbest"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Anyone else seeing Zestimate cracks?",
        "score": 9,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I've been watching listings around me for a while for a long time, there were almost no foreclosures. Now, I'm seeing a few. I'm also seeing many properties that were bought in 2019-2021, then listed for sale late last year for a significant increase, then were removed from the market and recently relisted for ~100k less than that 2025 listing. I also saw a fun one where someone bought in 2007, for like 650k, listed it last year for sale for 850k and has been slowly walking it back down (at 725k ask now) That's insane to me... for people who bought RIGHT before the 2008 implosion, and held it this whole time, they're not even getting inflation adjusted returns out of it. I mean, they had a place to call their own home this whole time, but still. That's gonna be the people who are buying right now...",
                "author": "neonshaun"
            },
            {
                "raw_content": "No, Walter! I don’t think Larry was about to crack!",
                "author": "zorg-18082"
            },
            {
                "raw_content": "Nope",
                "author": "c0sm0nautt"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The Size of the Housing Shortage: 2024 Data",
        "score": 11,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How is there a housing shortage when there are more sellers than buyers? Sounds like there are unrealistic housing price expectations not shortage. There are apartments all over where I live.",
                "author": "Yourprobablyaclown69"
            },
            {
                "raw_content": "Clearly, the developers don't care about a drought in the Southwest.",
                "author": "mrktcrash"
            },
            {
                "raw_content": "Persistently low homeowner and rental vacancy rates indicate that the U.S. housing market remains structurally undersupplied. Comparing 2024 abnormally low vacancy rates with long-run equilibrium levels across U.S. metropolitan markets, NAHB estimates that approximately 1.2 million additional housing units are required to close the gap and restore vacancy rates to historical norms. This figure represents NAHB’s updated estimate of the structural housing deficit, defined as the cumulative amount of above-equilibrium construction needed to rebalance the market. NAHB’s baseline forecast suggests this adjustment could occur between 2026 and 2030, contingent on sustained home building activity. Homeowner and rental vacancy rates are key indicators of housing market tightness and future price dynamics. In 2022, U.S. rental vacancy rates fell to 5.1%, the lowest level in decades, underscoring the severity of the post-pandemic housing shortage. By comparison, rental vacancy rates have averaged 6.6% since 2005, when the American Community Survey (ACS) began reporting these data. A surge in multifamily construction in 2024 led to improved rental availability across many metropolitan areas, with the national vacancy rate rising to 5.7% but remaining below the historic norm. In contrast, single-family construction remains significantly constrained by structural barriers, including restrictive zoning regulations, limited land availability, and persistent labor shortages. As a result, owner vacancy rates continued to decline through 2023, reaching a record low of 0.8%, the lowest level observed in the ACS series. While showing a modest improvement in 2024, owner vacancy rates remain below 1%, compared with the post-2005 average of 1.8%, indicating that for-sale housing shortages persist nationally. ACS data provide a granular view of vacancy rates across metropolitan areas and allow geographic identification of structural imbalances. The “long run” average vacancy rates can serve as a proxy for normal, or natural, vacancy rates. There are numerous reasons why normal vacancy rates may differ across metropolitan areas. For example, areas with mobile labor markets and higher population turnover will consistently experience higher vacancy rates. Vacation destination housing markets also naturally have higher vacancy rates, reflecting more volatile seasonal housing demand. For example, according to NAHB’s estimates, the rental vacancy rates in Panama City, FL, and Sebastian-Vero Beach, FL, have hovered around 20% since 2005. The averages were even higher in Myrtle Beach, SC, fluctuating around 28%. In sharp contrast, many areas in California, including Santa Maria-Santa Barbara, Santa Cruz-Watsonville, San Jose-Sunnyvale-Santa Clara, Oxnard-Thousand Oaks-Ventura, and Los Angeles-Long Beach-Anaheim, registered long-term rental vacancy rates below 4%. In the case of homeowner properties, natural vacancy rates are usually lower, reflecting slower housing turnover, with owners moving in and out less often compared to renters. It is important to remember that owned seasonal (occasional use) properties do not affect the homeowner vacancy rate. In this context, the vacancy rate is the proportion of vacant units for sale within the combined stock of homeowner-occupied, sold but not yet occupied, and for-sale units. Therefore, vacation or other seasonal properties are excluded from this analysis. Nevertheless, long-term homeowner vacancy rates tend to be higher in resort areas. Consistent with this pattern, several metro areas along the coast of Florida report some of the highest long-term owner vacancy rates. In Sebastian-Vero Beach, FL, and Naples-Immokalee-Marco Island, FL, owner vacancy rates have fluctuated around 4% since 2005. By contrast, San Jose-Sunnyvale-Santa Clara, CA, experienced owner vacancy rates below 1% most of the time. The gap between the “natural” or long-run average vacancy rate and the current vacancy rate helps estimate the number of rental and for-sale units needed to restore vacancy rates to their long-run equilibrium. Unsurprisingly, large metro markets have the greatest shortage of vacant rental and for-sale units, mainly due to their size. In these areas, even a small percentage decrease below the long-run average vacancy rates can lead to a shortage of thousands of vacant units. As of 2024, the Chicago-Naperville-Elgin, IL-IN-WI metro area needed close to 40,000 rental units to bring the rental vacancy rate back to normal levels. The rental shortages in the New York-Newark-Jersey City, NY-NJ, and Philadelphia-Camden-Wilmington, PA-NJ-DE-MD metro areas were around 20,000 units. Similarly, the largest shortages of vacant units for sale were observed in major metropolitan areas, including Chicago-Naperville-Elgin, IL-IN-W; Atlanta-Sandy Springs-Roswell, GA; New York-Newark-Jersey City, NY-NJ-PA; Phoenix-Mesa-Scottsdale, AZ. Adding vacancy shortages across metro areas with unusually low vacancy rates, there is a total shortage of about 1.2 million vacant units nationwide (almost equally split between rental and for-sale units). NAHB’s estimates focus narrowly on the number of vacant units required to return current vacancy rates to their long-run equilibrium levels. They do not incorporate additional sources of housing shortfall, such as pent-up demand from suppressed household formation or the need to replace aging and obsolete housing stock. As a result, NAHB’s estimates should be interpreted as lower-bound estimates of the overall housing shortage and are smaller than estimates that explicitly attribute elevated rates of shared living arrangements and the unusually high share of young adults residing with parents to the U.S. housing shortage. While we admit we do not have definitive answers, we believe the estimates presented here provide a reasonable updated national assessment of the current structural housing deficit. https://eyeonhousing.org/2026/02/the-size-of-the-housing-shortage-2024-data/",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Atlas the humanoid robot shows off new skills",
        "score": 2688,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That feeling when a robot is 10x more athletic than you are…",
                "author": "Key-Fox3923"
            },
            {
                "raw_content": "Imagine walking into a factory of the future and it's just these guys jumping off the walls and doing aerial tricks.",
                "author": "allisonmaybe"
            },
            {
                "raw_content": "We’re f’ckd.",
                "author": "CryMeaRiver2Crawl"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Where is my local ability to remove ALL stupid open mouth thumbnails from youtube videos? This is the purpose of \"AGI\", making my life better.",
        "score": 43,
        "text_content": "Where is my local ability to remove ALL stupid open mouth thumbnails from youtube videos? This is the purpose of \"AGI\", making my life better.",
        "comments": [
            {
                "raw_content": "Well, yea. You're not wrong.",
                "author": "YeOldePinballShoppe"
            },
            {
                "raw_content": "I think there is plugin which changes thumbnails to random position in video and community based titles.",
                "author": "ready_to_fuck_yeahh"
            },
            {
                "raw_content": "this has existed for years https://chrome.google.com/webstore/detail/clickbait-remover-for-you/omoinegiohhgbikclijaniebjpkeopip",
                "author": "Less_Sherbert2981"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Difference Between Opus 4.6 and Opus 4.5 On My 3D VoxelBuild Benchmark",
        "score": 260,
        "text_content": "Definitely a huge improvement! It's clear Opus 4.6 is well above 4.5, even just it's creativity with what smaller details 4.6 chose to add to the builds was quite impressive (like the clouds and flags on the aircraft carrier build). In my opinion it actually rivals OpenAI's top model now. If you're curious: * It cost **\\~$22 to have Opus 4.6 create 7 builds** (which is how many I have currently benchmarked and uploaded to the arena, the other 8 builds will be added when ... I wanna buy more API credits) Explore the benchmark and results yourself: [https://minebench.vercel.app/](https://minebench.vercel.app/) [](https://www.reddit.com/submit/?source_id=t3_1qx3war)",
        "comments": [
            {
                "raw_content": "It's crazy how we're basically saturating the minecraft benchmark",
                "author": "Domenicobrz"
            },
            {
                "raw_content": "In my opinion, Opus 4.6 is comparable to GPT 5.2-Pro, which is insane. Also interested in testing out how GPT 5.3-Codex does when its API is released; 5.2-Codex was (in my opinion) clearly much lazier than default 5.2, which was very visible in the quality of its builds",
                "author": "ENT_Alam"
            },
            {
                "raw_content": "Will you do 5.3 Codex also?",
                "author": "flurbol"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Goldman Sachs taps Anthropic’s Claude to automate accounting, compliance roles",
        "score": 158,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If AI can do compliance work already, we are all cooked.",
                "author": "Chogo82"
            },
            {
                "raw_content": "Buckle up. 2026 feels like the tipping point year. Mind your health. Keep spending frugal. And maybe we can get to the other side of the transition to something better.",
                "author": "BrennusSokol"
            },
            {
                "raw_content": "https://preview.redd.it/7xvad394qxhg1.jpeg?width=1280&format=pjpg&auto=webp&s=de035c25ce8d9602a7d03c3ae023ed2e17460829 Tell when this thing be able to generate food and shelter? [https://www.challengergray.com/blog/challenger-report-january-job-cuts-surge-lowest-january-hiring-on-record/](https://www.challengergray.com/blog/challenger-report-january-job-cuts-surge-lowest-january-hiring-on-record/)",
                "author": "DryNeedleworker5020"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Opus 4.6 is #1 across all Arena categories - text, coding, and expert",
        "score": 178,
        "text_content": "The first Anthropic model since Opus 3 to debut as #1. Note that this is the non-thinking version",
        "comments": [
            {
                "raw_content": "so do the 5.3 results come out 15 minutes later or?",
                "author": "rageling"
            },
            {
                "raw_content": "This website has renamed itself a hilarious number of times",
                "author": "BrennusSokol"
            },
            {
                "raw_content": "Surprise surprise, even after 4.5 was already the leader.",
                "author": "Csuki"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Opus 4.6 uncovers 500 zero-day flaws in open-source code",
        "score": 766,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is a competition i can get behind. Cumulative severity of bugs fixed by a model. New benchmark unlocked.",
                "author": "mxforest"
            },
            {
                "raw_content": "That's really good.",
                "author": "inteblio"
            },
            {
                "raw_content": "In full: [https://archive.is/N6In9](https://archive.is/N6In9)",
                "author": "xirzon"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Opus 4.6 costs 1.7x more than Opus 4.5 to run despite having same per-token costs (it thinks longer)",
        "score": 248,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Meanwhile GPT-5.3-Codex uses [half the tokens](https://x.com/polynoamial/status/2019476535044948419)",
                "author": "FundusAnimae"
            },
            {
                "raw_content": "How are consumers meant to gage the quality of these models for themselves when they can’t always be sure how much reasoning effort is going into their own outputs? What’s the difference between looking at a graph and having someone tell you “just trust me, it’s better”? If the response to that is “just try an old prompt with a newer model, you’ll see the difference!” I have no doubt you’re correct. But how much of that performance is related to user precedent (your own conversational history biasing a reasoning threshold) or simply Anthropic temporarily setting reasoning effort at a global maximum to celebrate a new release window? How will **you** know when they’ve adjusted such a setting? I always judge a box of chocolates by the chocolate. But if I find myself consuming more corn syrup than cacao, that’s on me.",
                "author": "lobabobloblaw"
            },
            {
                "raw_content": "Guy at my work just submitted a 47,000 line merge request that he generated with opus. Literally cost my company $15,000 in tokens. And the managers are all raving about it lmao!",
                "author": "theRealBigBack91"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI possibly charging more for Codex in the future?",
        "score": 111,
        "text_content": "Seems to me they might be charging more for Codex in the future as it continues to get better. Maybe I'm completely misreading this Idk",
        "comments": [
            {
                "raw_content": "The problem is theres nothing to increase the monthly subscription between $20 and $200 other than the $40 credit pack that has no metrics to compare to for how much usage you get compared to the plan.",
                "author": "rageling"
            },
            {
                "raw_content": "As a Pro user, flat monthly is working well. If it turns into the Cursor billing model, I would rather switch to Kimi and roll my own. Cursor’s billing model made me turn to Codex, in fact.. The trade offer is I give high quality RL content and you give me a discount on api prices with a flat subscription.",
                "author": "o5mfiHTNsH748KVq"
            },
            {
                "raw_content": "I'd be pretty upset to spend $20 and it completely fail at the task.",
                "author": "rwrife"
            }
        ],
        "subreddit": "singularity"
    }
]