[
    {
        "post_name": "Illegal Alien charged with trafficking more than 1 ton of methamphetamine out of an auto repair shop in Georgia.",
        "score": 597,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Looks like I picked the right week to quit methamphetamines.",
                "author": "KekistanPM"
            },
            {
                "raw_content": "I hate when I see the term 'Illegal Alien'. I think it's very harmful and disinformation. The politically correct term is: 'Invader'.",
                "author": "freedom-thinker"
            },
            {
                "raw_content": "I heard that Hunter Biden can snort that up in one whiff like his father doing the same with a little girl.",
                "author": "DT170x"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "There were signs...",
        "score": 447,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No, [Oscar is the only based one on Sesame Street](https://x.com/magills_/status/1944543975358238796)",
                "author": "blockchain-the-vote"
            },
            {
                "raw_content": "Nah would not be Oscar, Oscar is based. It would probably be the Bert and Ernie in a Queers for Palestine march feat Big Bird Dominatrix.",
                "author": "Valiazaner"
            },
            {
                "raw_content": "No, not Oscar! He’d be all like, “FUCK THAT NOISE!” My dude is a straight OG.",
                "author": "trumpdagoat"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "In-N-Out",
        "score": 511,
        "text_content": "",
        "comments": [
            {
                "raw_content": "In-N-Out Burger is moving their HQ to Tennessee next year. Many years in the making. The final straw was Newsome making them deny customers who didn't have the covid shot, and made the health department shut down their San Francisco stores over the 'non-compliance'. They are a based Christian company who is also making MAHA changes too.",
                "author": "Corn_Pop_Is_Bad_Dude"
            },
            {
                "raw_content": "Those are good burgers Walter.",
                "author": "jdovejr"
            },
            {
                "raw_content": "No, please stay.",
                "author": "Chickensaurus"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "When you have the majority but still have to keep showing up to break ties because of a few retards",
        "score": 640,
        "text_content": "",
        "comments": [
            {
                "raw_content": "More than a few. Great work though! This is perfect.",
                "author": "GallowsTime"
            },
            {
                "raw_content": "I know I'm a Qtard. But from the beginning it has been known that winning legitimately was preferable to a military coup. It is fucking EXCRUCIATING, but we are winning. Stay FOCUSED!",
                "author": "solarsavior"
            },
            {
                "raw_content": "if you have RINOs, you actually don't have a majority.",
                "author": "yodayoda"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "THERE IT IS 🚨....Gavin Newsom admits that HALF of all agricultural workers in California ARE ILLEGAL.....He says roughly 41% of construction workers ARE ILLEGAL.....The real number of illegals in California is astronomical. THIS is why California is still Blue. Illegals. This is INSANE",
        "score": 1445,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Its not why the state is blue - its why the state is so powerful. They'd lose a dozen or more electoral votes and make presidential elections impossible for democrats if we got rid of their illegals in the 2030 census.",
                "author": "LawyersPlayDota"
            },
            {
                "raw_content": "Another self-own",
                "author": "Mitzhatzmakoph"
            },
            {
                "raw_content": "I'm willing to bet that those are very low estimates.",
                "author": "HairSniffer"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Vice President JD Vance BREAKS THE TIE, the $9B DOGE cuts package ADVANCES. NPR, PBS, USAID on the chopping block. 3 Rino NOs: McConnell, Collins, Murkowski.",
        "score": 1195,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why is it always the Three Amigos? It's *always* those three stupid fuckers.",
                "author": "CommanderOfCheese"
            },
            {
                "raw_content": "JD Vance is awesome.",
                "author": "DeusVult1096"
            },
            {
                "raw_content": "Good start, but need WAY MORE than $9B in cuts. This is <1% of the annual deficit and low hanging fruit -- and we ALREADY have RINOs chimping out over it. Imagine if Trump sends over a rescissions bill with ACTUAL cuts. Speaking of which...6 months in and only $9B in cuts? We need more bills from the WH to be sent over to Congress ASAP. We only have ~18 more months of GOP control.",
                "author": "maltese-poodle"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨🚨🚨 BREAKING: Johnson & Johnson Lead Scientist Confesses J&J COVID-19 Vaccine Was 'Not Safe and Effective,' Reveals “Lack of Research” From Rushing to Release Vaccine: “People Wanted It, We Gave It to Them”",
        "score": 1509,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“People Wanted It, We Gave It to Them” = gaslighting More like J&J wanted to sell it for profit and teamed up with others to get it forced on the people and make massive amounts of money.",
                "author": "PlantTrees"
            },
            {
                "raw_content": "“People Wanted It, We Gave It to Them”. That's a helluva powerful feedback loop that was deliberately goaded into a stampede by the media harlots. If anything, the news media should be the first ones tried and shot.",
                "author": "FreedomFromGovt"
            },
            {
                "raw_content": "I work for J&J. Because I'm in Florida I was able to avoid the vax. I also paid $700 for a real but falsified vaccine record just in case. But before Desantis's EO, the pressure to take a shot, any shot was vast. They got to a 93% vaccination rate amongst all employees. But the lawsuits are already happening. I know if at least 6 people in my department that took a vaccine and their lives changed for the worst almost immediately. Interestingly, they all took the Pfizer or moderna vaccine, except 1. 5 of those people have filed lawsuits for the vaccine mandate to work. The one who took the j&j is really torquing the screws on them. He is going after them both for the mandate and their shot. As a side note, I have the post vaccine med records and diagnosis of one of the Pfizer victims. If there is any interest, given some time to clean up any personal information. I would be willing to post the diagnosis in a new thread. This fellow was 32, a former college football player (half back) who post college ran a full marathon every other month. 30 days after his vax he had to drop out of a marathon after 7 miles. 60 days after he was out of work for health problems. 90 days after, he couldn't walk 200 meters without stopping to take a break. He quit knocking down ass because it was dangerous to him. He cannot drive now. Using video games and watching sports to fill his time he had to stop those activities. Both push his heart to near deadly rates. He went from 225 lbs to over 325 in a year. Has had multiple clots removed and is basically bed ridden. After 3.5 years of this shit he's becoming suicidal.",
                "author": "Giant_Schwartz"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "No big deal, iust Microsoft using engineers in China to help maintain the Defense Department’s computer systems. I couldn’t possibly imagine anything wrong with this.",
        "score": 1261,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Microsoft has a foreign born c suite and a rapidly diminishing american staff being replaced with h1bs and outsourcing. It might have started as an American company, but now it is American in name only",
                "author": "Formerlurker92"
            },
            {
                "raw_content": "Nothing to see here folks",
                "author": "RuprechtThaMonkeyBoy"
            },
            {
                "raw_content": "If our side/presidency had any balls, then this would end over night and arrest made. How can this be even a thing? I work in tech and we have so much export control, heck, I can't even sedan email sometimes due to possible exporting something, and here we are with Chinese Gov taking care of our systems? Tell me it isn't so Diane Feinstein!",
                "author": "FuckU/Spez"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: Former President Joe Biden admitted to the New York Times that he did not personally sign off on every individual pardon issued via his autopen signature.",
        "score": 1392,
        "text_content": "",
        "comments": [
            {
                "raw_content": "c'mon Jack, I didn't have time to do every little single thing. Who do you think I was? President or something?",
                "author": "Retard_Strength"
            },
            {
                "raw_content": "Your move, Trump administration.",
                "author": "killedmytv"
            },
            {
                "raw_content": "VOID. All void. 🚫",
                "author": "Pederella"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Don’t lie, Elmo, that was really you.",
        "score": 819,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Children’s show characters SHOULD NOT HAVE SOCIAL MEDIA ACCOUNTS OF ANY SORT. JUST AS CHILDREN SHOULD NOT HAVE SOCIAL MEDIA ACCOUNTS OF ANY SORT. These accounts are for faggots and Disney adults.",
                "author": "madeaprofilejustforu"
            },
            {
                "raw_content": "I still think it was Elon on a bender having some fun",
                "author": "Taqiyya_Mockingbird"
            },
            {
                "raw_content": "\"security measures\" The password was probably FKDRUMP123!",
                "author": "AlphaMan"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "How exactly does it benefit us to mass import millions of Somali refugees to America?",
        "score": 1760,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fun fact: The average IQ in Honduras, Guatemala, El Salvador is even LOWER. America is literally importing the most retarded and violent populations on planet Earth. Your government HATES you and is destroying our country.",
                "author": "FREN"
            },
            {
                "raw_content": "We are replacing you with ignorant subservient cattle.",
                "author": "DiamondDroid"
            },
            {
                "raw_content": "That depends on what you mean by \"us\".",
                "author": "GiggleFarts1960"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "COVID mRNA Shots cause vision problems",
        "score": 660,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This explains my friend who was quite athletic and fit, who runs, bikes, and swims routinely. He fell down the steps and said he couldn't see the steps. The light was on, all was just as it always was. He summersaulted down the steps to the bottom and was pretty bruised up but otherwise fine, likely a cracked rib though. He is still a young man but now walks gingerly, cat-like. We were out and about and he fell up the steps. I said, \"You must be tired,\" but I could see that he was angry at himself, angry that things are different. Of course he got vaxxed.",
                "author": "CleanUpPhillyTrump24"
            },
            {
                "raw_content": "Covid really was a 20/20 issue after all.",
                "author": "KennyKetchem"
            },
            {
                "raw_content": "Does shedding also cause this? I feel like my vision has gotten significantly worse in the past 3-4 years whereas I've had the same glasses prescription for close to 10 prior.",
                "author": "CucumberExtract"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "@POTUS : \"Pharmaceuticals will be tariffed probably at the end of the month, and we're going to start off with a low tariff and give the Pharmaceutical companies a year or so to build... The Pharmaceutical companies are moving back to America where they should be.\"",
        "score": 683,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What happened to pharm companies charging us the same as every other country?",
                "author": "FudgyFudgeBots"
            },
            {
                "raw_content": "Pharmacia should be destroyed for lack of a cure for anything. Just side effects which include explosive shits, death, blindness, excessive retardation, myocarditis, massive blood clots, rashes, ridiculous pricing for the states, criminal doctors, nurses, techs, I could go on but....",
                "author": "blitzkrieg1"
            },
            {
                "raw_content": "**Tariffs?** Most of them should be charged with reckless murder!!!",
                "author": "dparks2010"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "WATCH: Driver With Machete Confronts Police in Los Angeles — It Did Not End Well",
        "score": 941,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is a spam post! Article has pop up nudes",
                "author": "TrumpOrTreason"
            },
            {
                "raw_content": "I found a clean link. It looks like he was shot but not killed. https://abc7.com/post/machete-wielding-man-shot-lapd-officer-crypto-arena-downtown-department-says/17103678/",
                "author": "fskfsk"
            },
            {
                "raw_content": "this site should be banned",
                "author": "spinometer2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: The letter written by the Minnesota assassin Vance Boelter who killed (D) Melissa Hortman and her husband Mark has been RELEASED, per @lizcollin. “Tim Walz wanted me to KlLL Amy Klobuchar...” “Tim Wants to be a Senator...” INVESTIGATE TIM WALZ!",
        "score": 1504,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And nothing will be done to Tim Walz.",
                "author": "cjcivicx"
            },
            {
                "raw_content": "MN ULTRA",
                "author": "killedmytv"
            },
            {
                "raw_content": "Pam Bondi will get right on this!",
                "author": "kfunny91"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING -- 3 RINOs in Senate vote NO on advancing $9 Billion (tiny!) in DOGE cuts on USAID, NPR, PBS. JD VANCE NEEDED TO BREAK A TIE AGAIN....",
        "score": 729,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Who were the faggots?",
                "author": "ScamBlondie"
            },
            {
                "raw_content": "That McCormick flip in PA for Senate last year was fucking huge. We would have neither the OBBBA nor this passed unless they were heavily watered down. OBBBA would have been merely Tax Cuts and Jobs Act 2.0 with maybe 25% of the funding for the Wall and deportations that ended up passing in OBBBA.",
                "author": "genuinetrot"
            },
            {
                "raw_content": ">3 RINOs Eventually people will figure out that there are 5 Senators at most who are on our side, and I'm probably being generous.",
                "author": "IncredibleMrE1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump: \"I don't understand why the Jeffrey Epstein case would be of interest to anybody. It's pretty boring stuff. I think really only pretty bad people, including fake news, want to keep something like that going.\"",
        "score": 1045,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How can he be this out of touch.",
                "author": "Syvril"
            },
            {
                "raw_content": "He's fucking with us right?",
                "author": "Stansdad"
            },
            {
                "raw_content": "They are going to skewer him with this. Once again trump needs to listen to his people, aka us, and not his garbage swamp staff",
                "author": "RedCalifornia"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨BREAKING EXCLUSIVE: House Oversight Chair James Comer urges AG Pam Bondi to begin exposing and arresting individuals connected to the Epstein network and its cover-up: \"Take the ball and run. People want to see accountability. Let's start prosecuting and setting an example.\"",
        "score": 1501,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'll believe it when i see it",
                "author": "WhenGoodMenDoNothing"
            },
            {
                "raw_content": "Prosecuting? 🤷🏼‍♀️ Sorry best she can do is put some lipstick on her teeth and go on Fox News",
                "author": "Whoopies_tds"
            },
            {
                "raw_content": "GOOD. They're hearing from grassroots activists like Cernovich and Poso asserting that 2026 will be an absolute bloodbath if these ppl don't enthuse the base. Now they're scared. And frankly, this is the only way you'll see some action. Secondly, Pam really needs to come up with SOME results asap. She's got to have something to show for her appointment in the next few weeks. Otherwise, prediction: OTHER Republicans themselves will demand her scalp. She's dragging the whole ship down at this point - and that is the perception whether fair or not.",
                "author": "bleeje"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨#BREAKING: Officials says that Metadata from the raw Epstein prison video shows approximately 2 minutes and 53 seconds were removed from one of two stitched together clips. The cut starts right at the missing minute",
        "score": 1293,
        "text_content": "",
        "comments": [
            {
                "raw_content": "cover up",
                "author": "drinkmorecoffee"
            },
            {
                "raw_content": "What if the list doesn't matter because we have Epstein alive? Which would be even better. 3 minutes is enough time to sneak him out.",
                "author": "LBTrumplican2"
            },
            {
                "raw_content": "That wasn't even epsteins cell We talked about this weeks ago.",
                "author": "Badfinz_FL"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "It's 100% a criminal organization.",
        "score": 611,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What? Tina Peters isn't even in a federal prison.",
                "author": "inksday"
            },
            {
                "raw_content": "The only reason the federal government went after Capone or the Italian mafia is because they weee cutting into their action. The federal government is the largest organized crime organization ever in history.",
                "author": "suckmycorona"
            },
            {
                "raw_content": "Fuck this cunt Emerald Robinson. She told us not to vote for Trump at the last second last fall and she said that the election would be stolen from Trump in the 2024 election. All she does is doom and even worse lie.",
                "author": "genuinetrot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Nvidia chips become the first GPUs to fall to Rowhammer bit-flip attacks",
        "score": 361,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I want to know how common attacks like this really are. Even like the CPU vulnerabilities over the years.",
                "author": "bubblesort33"
            },
            {
                "raw_content": "For datacenters this seems to only be a threat to multiple tenants sharing the same GPU, as far as I know that is basically never the case. And if you have weird software running on your machine it seems like there would be all sorts of other ways for it to mess with your training run (or worse) anyway.",
                "author": "shovelpile"
            },
            {
                "raw_content": "Big ouch for datacenter operations that host multiple customers on the same hardware. > Nvidia is recommending a mitigation for customers of one of its GPU product lines that will degrade performance by up to 10 percent in a bid to protect users from exploits that could let hackers sabotage work projects and possibly cause other compromises. > The move comes in response to an attack a team of academic researchers demonstrated against Nvidia’s RTX A6000, a widely used GPU for high-performance computing that’s available from many cloud services. ... > The researchers’ proof-of-concept exploit was able to tamper with deep neural network models used in machine learning for things like autonomous driving, healthcare applications, and medical imaging for analyzing MRI scans. GPUHammer flips a single bit in the exponent of a model weight—for example in y, where a floating point is represented as x times 2y. The single bit flip can increase the exponent value by 16. The result is an altering of the model weight by a whopping 216, degrading model accuracy from 80 percent to 0.1 percent, said Gururaj Saileshwar, an assistant professor at the University of Toronto and co-author of an academic paper demonstrating the attack. ... > The performance hit is caused by the resulting reduction in bandwidth between the GPU and the memory module, which the researchers estimated as 12 percent. There’s also a 6.25 percent loss in memory capacity across the board, regardless of the workload. Performance degradation will be the highest for applications that access large amounts of memory.",
                "author": "Blueberryburntpie"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD Says It Will Restart MI308 Sales to China After US Review",
        "score": 84,
        "text_content": "[Advanced Micro Devices Inc.](https://www.bloomberg.com/quote/AMD:US) said that it plans to restart shipments of its MI308 chips to China after the US said it would approve the sales, following a similar decision on an [Nvidia Corp.](https://www.bloomberg.com/quote/NVDA:US) semiconductor. The US Commerce Department told AMD that license applications for the MI308 products would move forward for review, an AMD spokesman said Tuesday.",
        "comments": [
            {
                "raw_content": "Seems to have caused a huge bump in AMD stock because of the news too lol.",
                "author": "Geddagod"
            },
            {
                "raw_content": "MI308X is a cut-down MI300X that complies with the US government's export restrictions.",
                "author": "EmergencyCucumber905"
            },
            {
                "raw_content": "When USA supply and prices were already at the worst, Now we can see them non-existant.",
                "author": "HilLiedTroopsDied"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Chinese firms rush to buy Nvidia AI chips",
        "score": 32,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Makes sense, in 2 months it will be blocked again.",
                "author": "Fuskeduske"
            },
            {
                "raw_content": "Does this refer to gaming gpu chip shortages in the coming future?",
                "author": "One_Wolverine1323"
            },
            {
                "raw_content": "well say goodbye to stocks of current cards. I wonder do these huge masses of cards ever hit the secondary market? It would be cool to repurpose some older AI chips eventually.",
                "author": "shrewduser"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Donkey Kong Bananza was originally developed for Nintendo Switch before moving to Switch 2, Here's a side by side of how it would have looked on Switch 1 hardware",
        "score": 1367,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It would have looked fine but performance would probably still be shit with the heavy usage of voxels.",
                "author": "ButternutCheesesteak"
            },
            {
                "raw_content": "wait woah, this is so cool to see, the switch 2 definitely helped it out then",
                "author": "myghostflower"
            },
            {
                "raw_content": "This just makes me even more excited to see what Nintendo 1st party developers can do with native Switch 2 projects built from the ground up for the new hardware. The 3D Mario must be spectacular. If the rumors about Prime 5 are true, that will look unbelievable.",
                "author": "TerminatorJ"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "This is how you make a port",
        "score": 313,
        "text_content": "All the game data is right there on the cartridge – you only need to download extra language packs. The performance and visuals are way beyond what I expected. I still remember those people who tried to emulate Switch 2 performance on PC using leaked motherboard specs, calling the chip outdated and predicting Cyberpunk 2077 would be a total disaster on Switch 2. Well… turns out they were clowns, because they clearly don’t know what ‘optimization’ means. This Cyberpunk 2077 port is what optimization looks like – not some lazy brute-force port. This is exactly what third-party devs should be doing.",
        "comments": [
            {
                "raw_content": "First time playing it and it’s pretty damn awesome.",
                "author": "Hyperdragoon17"
            },
            {
                "raw_content": "The best thing is that the game is actually on the cartridge. W cd projekt",
                "author": "blacklotusl337"
            },
            {
                "raw_content": "Pumped to see the Elden ring port. Fromsoft better not let me down!",
                "author": "drakev6304"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Fastest 3 hour flight of my life",
        "score": 1048,
        "text_content": "Cyberpunk definitely kept me entertained along the way 👌",
        "comments": [
            {
                "raw_content": "Come on, you seriously played Cyberpunk the whole time? You're supposed to pass a JoyCon to the stranger across the aisle and play Mario Kart until, scene shift, a whole crowd of people (including the air stewards) are looking over your shoulders and shouting encouragament with giant smiles on everyone's faces.",
                "author": "elephvant"
            },
            {
                "raw_content": "Time flies seriously fast for me while playing this game. I cannot imagine this launch without Cyberpunk 2077 as MKW has simply isn't holding my attention.",
                "author": "josephfry4"
            },
            {
                "raw_content": "I'm very much looking forward to my Switch 2 on my upcoming 14hr flight to Japan",
                "author": "T_Peg"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Donkey Kong Bananza started development with a Goomba with arms",
        "score": 2281,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The ending of Odyssey is Bowser smashing through the level while peach rides on his shoulder. DK Bananza is *that* concept expanded into a full game lol.",
                "author": "IrishSpectreN7"
            },
            {
                "raw_content": "Source: https://www.nintendo.com/us/whatsnew/ask-the-developer-vol-19-donkey-kong-bananza-part-2/",
                "author": "k4rst3n"
            },
            {
                "raw_content": "I just played some Mario Odyssey last night and the hands from this model are 100% the hands from the boss Knucklotec.",
                "author": "montybo2"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "1 Day until Bananzaaaaaa",
        "score": 118,
        "text_content": "https://x.com/nintendo/status/1945295177796739265?s=46&t=_Dl0DSU0W7tiyPYnlKjlhQ",
        "comments": [
            {
                "raw_content": "I’m pumped. I am a huge fan of DK64, so I hope they incorporate some of its style in DKB - but I’m not holding my breath. They really seem like they want to rebrand the DK franchise, in a way. My guess is it’ll be a blast either way. We’ll see 🤷",
                "author": "c_rorick"
            },
            {
                "raw_content": "My Bananergy is ready",
                "author": "ellisftw"
            },
            {
                "raw_content": "Less than 9 hours for me, actually (*laughs in Australian*)",
                "author": "KestrelQuillPen"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Imagine if Nintendo had a goth phase with cases",
        "score": 167,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I could see this happening for mature titles on switch 2",
                "author": "New-Creek-Fishing"
            },
            {
                "raw_content": "Okay so now everything black is goth?",
                "author": "Medical-Paramedic800"
            },
            {
                "raw_content": "We just need awesome color instruction booklets again.",
                "author": "CinematicConscience"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "DK Bananza Got 38/40 Score from Famitsu",
        "score": 96,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A humble 3 points above Sonic Forces",
                "author": "moneycity_maniac"
            },
            {
                "raw_content": "https://preview.redd.it/7khguxb8x5df1.jpeg?width=1170&format=pjpg&auto=webp&s=8f1f05920dd320e34d1a13f2e22b7df0ae4ea416 This is the rough translation of their thoughts. Not sure what “a lot of gentle” was originally meant to say lol",
                "author": "samandfrodokissing"
            },
            {
                "raw_content": "for reference, mario wonder got a 36/40 from them and widespread acclaim across the board from other outlets",
                "author": "TiocStudios"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Current gen Nintendo internal development teams, partner studios, and the games they made",
        "score": 67,
        "text_content": "Source: https://weibo.com/7739626783/5188838500600706",
        "comments": [
            {
                "raw_content": "I wanna work for epd 4, that’s where all the crazy Nintendo’y people work!",
                "author": "Blofse"
            },
            {
                "raw_content": "Still can't believe it's actually happening, but you can add From Software to that list now that Nintendo is publishing The Duskbloods.",
                "author": "ConflictPotential204"
            },
            {
                "raw_content": "“支援开发”means assisted development.",
                "author": "Artoo2814"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Jason Schreier: Krafton has agreed to extend the bonus earnout period for Unknown Worlds employees to account for the delay",
        "score": 544,
        "text_content": "https://bsky.app/profile/jasonschreier.bsky.social/post/3ltzot6yfks2p https://www.bloomberg.com/news/articles/2025-07-15/krafton-extends-subnautica-2-bonus-period-is-sued-by-founders > > About 40 employees at Unknown Worlds were eligible to share a $25 million bonus, contingent upon the studio hitting certain revenue targets by the end of 2025, with a possible short-term extension. When Krafton said earlier this month that it planned to push back the game’s release, employees feared that it wouldn’t be possible to hit those targets and that their potential earnings would disappear. > > Now, that schedule has been extended an additional year, according to people familiar with the events at the studio and documentation seen by Bloomberg. Krafton also said it would advance a portion of the studio’s projected 2026 profit-sharing bonus pool, which is independent from the bonus, to all Unknown Worlds employees this year.",
        "comments": [
            {
                "raw_content": "#Jason Schreier is a Tier 1 - Very Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "I know these things aren’t as simple as “$25m / 40 employees” but holy fuck - that’s a sizable bonus even if it’s 10% of the way that math works out! This is such a weird saga and I hope the employees are made as close to whole as possible if indeed the game’s issues are with the creative leads abandoning their duties.",
                "author": "GodKamnitDenny"
            },
            {
                "raw_content": "25mil is nothing to them compared to that 250mil or so bonus promised to the absent leadership. What a world we live in where 40 employees share a 25mil bonus while 3 bosses share 250mil.",
                "author": "AwesomePossum_1"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "A Subnautica 2 developer started talking about whether the three executives fired by Krafton actually worked on the title.",
        "score": 359,
        "text_content": "https://imgur.com/a/5LRkMyA",
        "comments": [
            {
                "raw_content": "Subnautica 2 controversy was not on my bingo card for this year.",
                "author": "QuantumProtector"
            },
            {
                "raw_content": ">I would never say they did nothing. Unless they completely isolated themselves from development it's unlikely anyone is going to claim they did *nothing.* The question is: did they do *enough* to meet their contractual obligations? Also >because they had a team they trusted to make the game doesn't exonerate them if the team was continually failing to meet milestones. End of the day, the ones leading a company are responsible for its failures.",
                "author": "Nexus_of_Fate87"
            },
            {
                "raw_content": "After all the shit Krafton has received from the community these past few weeks, they were actually in the right all along. Classic reddit moment",
                "author": "Arcanunn"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "According to KiwiTalks, Retro Studios are unlikely to return to 2D Donkey Kong after Bananza, also believes Retro will develop Metroid Prime 5 and a new IP after Prime 4",
        "score": 297,
        "text_content": "https://xcancel.com/kiwitalkz/status/1945215402507952496?s=46 Figured I’d post this as despite Kiwi’s borderline non-existent track record, he does have actual connections to Retro and have done a multitude of interviews with various employees. If he sounds familiar, he’s been very vocal about >!K. Rool and the Kremlings returning to Bananza, which if those 4Chan leaks are any indication, is very likely real!<",
        "comments": [
            {
                "raw_content": "Now the second person reporting that Retro is rolling straight into Prime 5. Which is the most logical course of action. They did major staffing for Prime 4 including former devs of CoD, Battlefield, Halo, and Jedi Survivor. Given the skillset of that team, continuing with Prime just makes sense. Also with how good Prime 4 looks on Switch 2 (in addition to being 120fps) I'm really curious to see what a Retro game looks like built from the ground up for Switch 2.",
                "author": "KMoosetoe"
            },
            {
                "raw_content": "Feels like this is like the fifth or sixth time I've heard Retro attempting to break away from Metroid to do something else and somehow it always ends with them coming back to Metroid anyway, even including when the company was initially under contract to do like multiple GameCube games that all got shelved for Prime 1",
                "author": "MyMouthisCancerous"
            },
            {
                "raw_content": "Don’t know who this dude is or how reliable he is but I always welcome more Metroid. Isn’t there another rumor that Metroid 6 is being worked on?",
                "author": "Strict_Donut6228"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "No Zenimax Online developer has been laid off following the cancellation of Blackbird",
        "score": 166,
        "text_content": "I don't know if I'm using the right flair. But there were discussions this week about how many people were laid off from ZOS following Blackbird's cancellation. We got confirmation for how many were exactly laid off (zero) Here is the summary: 1. ZOS United-CWA released a new statement on Bluesky yesterday, commenting on the cancellation of the project. 2. No ZeniMax Online developer has been laid off. 3. Although the future remains uncertain, as Microsoft and the union established in December 2024 are still discussing how the studio will move forward following the project closure. Based on this, Jez's leak might also be correct. If no one was laid off, they could potentially jump to the next fallout projects. Edit: Debunked by Jason Schreier himself below. Sorry if I misled anyone. It wasn't my intention. I just wanted to share any positive news I can find. Source: [No ZeniMax Online Developer Has Been Laid Off Following the Cancellation of Project Blackbird](https://wccftech.com/no-zenimax-online-developer-has-been-laid-off-following-the-cancellation-of-project-blackbird/)",
        "comments": [
            {
                "raw_content": "[https://bsky.app/profile/jasonschreier.bsky.social/post/3ltzmf3fua22b](https://bsky.app/profile/jasonschreier.bsky.social/post/3ltzmf3fua22b) \"I'm seeing this headline make the rounds on Reddit but it is incredibly misleading. The people who worked on Blackbird at ZeniMax Online Studios are only still employed while their union negotiates a severance package. Almost all of them are losing their jobs. Just hasn't formally happened yet\"",
                "author": "MagazineInfamous6142"
            },
            {
                "raw_content": "Keep in mind that layoffs have to go through the Zenimax Employee Union.",
                "author": "SelectivelyGood"
            },
            {
                "raw_content": "So did I just hallucinate a barrage of ZeniMax Online employees posting \"Open to Work\" and writing how their project got canceled and they've been layed off?",
                "author": "Aggressive_Rope_4201"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "mobilegamer.biz: Laid off King staff set to be replaced by the AI tools they helped build",
        "score": 661,
        "text_content": "Key quotes: Multiple sources have given us an insight into what's happening at Candy Crush maker King as it prepares to cut 200 staff. Speaking to us anonymously they claim: * Many of the staff cut will effectively be replaced by the AI tools they built and trained * The London-based Farm Heroes Saga team is being 'cut in half' with about 50 people leaving, including key leadership * One staffer claims employees are being targeted by HR for loudly expressing dissatisfaction internally * King told staff it will present a new org chart in September after union negotiations. Many staff are now in limbo for the summer * A recent internal survey showed morale at an all-time low – it's now \"in the gutter\" Another source told us about King’s long-running HR problems. In particular, the Candy Crush teams were described as being in a state of “constant but low attrition” and perpetual restructuring. “King HR is an absolute shitshow and has been for years,” said another source. “An extreme example of an HR department whose role it is to protect the company, not the staff.” Many level designers, user research staff plus UX and narrative writers have also been told they're at risk. In particular, these staff have spent the last few years building and training AI tools to do their jobs. They're now effectively being replaced, say sources. \"Most of level design has been wiped, which is crazy since they've spent months building tools to craft levels quicker,\" said one staffer. \"Now those AI tools are basically replacing the teams. Similarly the copywriting team is completely removing people since we now have AI tools that those individuals have been creating.\" \"The fact AI tools are replacing people is absolutely disgusting but it's all about efficiency and profits even though the company is doing great overall,\" they continued. \"If we're introducing more feedback loops then it's crazy to remove the developers themselves, we need more hands and less leadership.\" Source: [https://mobilegamer.biz/laid-off-king-staff-set-to-be-replaced-by-the-ai-tools-they-helped-build-say-sources/](https://mobilegamer.biz/laid-off-king-staff-set-to-be-replaced-by-the-ai-tools-they-helped-build-say-sources/)",
        "comments": [
            {
                "raw_content": "Candy crush has narrative writers?",
                "author": "LPolder"
            },
            {
                "raw_content": "Yeah the term \"Human Resources\" always made me laugh. They are not there as a resource for employees but as a resource for the company. They are not an employees friend, despite the fact that many HR departments give off that impression. I think companies that rely on AI are going to be in for a very rude awakening. They still need a human hand to touch these projects. AI is a good resource for efficiency, not for a complete replacement of people.",
                "author": "Particular_Hand2877"
            },
            {
                "raw_content": "This is the kind of shit the bad guys in a children's movie do.",
                "author": "TheLastBasileus"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Hunter X Hunter Nen Impact Entire Season 1 Datamine",
        "score": 144,
        "text_content": "Neferpitou, Phinx , Shizuku, Zeno 2 extra stages",
        "comments": [
            {
                "raw_content": "Im surprised Neferpitou wasn't in the base roster considering her popularity and it's size",
                "author": "Pumpkin_Sushi"
            },
            {
                "raw_content": "Just found out it releases in a few days and I can't play it because the Australian government decided to ban it ffs",
                "author": "capdesu"
            },
            {
                "raw_content": "yyh yusuke guest copium shattered",
                "author": "vinsmokefoodboi"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "GPD's gaming handheld with Ryzen AI MAX+ 395 \"Strix Halo\" spotted on Geekbench",
        "score": 56,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A handheld with 4060 performance. Probably will be power limited but still that iGPU is ridiculous",
                "author": "Educational-Web829"
            },
            {
                "raw_content": "Doesn't that APU have a minimum of 55W TDP? I doubt they will be able to hold that TDP for a long time, or that it will have a good battery life",
                "author": "WJMazepas"
            },
            {
                "raw_content": "Sounds awesome as a proof of concept, but not sure if pratical.",
                "author": "Malygos_Spellweaver"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "MSI Claw A8 with Ryzen Z2 Extreme listed in Taiwan at $865",
        "score": 12,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Will be really interesting to see a head to head comparison of this and the lunar lake version. Seems like the lower price is going to come with the slightly lower tier hardware. So probably a good trade.",
                "author": "Hardcorex"
            },
            {
                "raw_content": "still no benchmarks... at this point I'm assuming the performance increase is on the low end of the rumours.",
                "author": "cabbeer"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Sun-soaked retirement boomtown (Las Vegas, NV) now collapsing faster than any other US city: Residents try to flee.. but can't sell",
        "score": 210,
        "text_content": "",
        "comments": [
            {
                "raw_content": "*“One Las Vegas home, for example, that has been listed at $619,900 for over two months, recently dropped the price by $5,000.”* This is my favorite sentence! They dropped the price a whole 0.8%…I’m sure that will get the buyers attention 🥴",
                "author": "dash_44"
            },
            {
                "raw_content": "I dunno man. NOBODY in Florida can sell their home. Between the housing and condo crisis, skyrocketing insurance rates, major hurricanes and the fact it's unlivable outside in the summers all those people who moved her after Covid can't wait to get out. It's a vastly overrated state.",
                "author": "RiboSciaticFlux"
            },
            {
                "raw_content": "Vegas active listings are up but we got similar peak in 2022 before it went down https://fred.stlouisfed.org/series/ACTLISCOU29820",
                "author": "Dmoan"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "But you can never lose money on a home purchase!",
        "score": 55,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This screams new money. Overpaid on a house on the market for 7 months with plans to move… then before you even sold you started building another house after all the tens of thousands in upgrades at your current place… Absolutely no wealth retainment strategies in place here. I really do feel for them. Probably got excited about life and people were standing ready to take advantage of them.",
                "author": "slifm"
            },
            {
                "raw_content": "Here's another one https://www.reddit.com/r/Mortgages/s/hKKHHxTikh",
                "author": "lockdown36"
            },
            {
                "raw_content": "Can you just not sell it?",
                "author": "Velvet-Thunder-RIP"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Good Twitter thread with links to articles on Shell Companies buying housing stock to fake scarcity.",
        "score": 85,
        "text_content": "",
        "comments": [
            {
                "raw_content": "As is pointed out in the thread, her \"receipts\" seem just be her own previous tweets.",
                "author": "ImperfectDrug"
            },
            {
                "raw_content": "this person is dumb, and what she is claiming (and mischaracterizing) was literally announced in a press release by the companies who are doing it: https://www.prnewswire.com/news-releases/lennar-announces-4-billion-single-family-rental-platform-with-centerbridge-partners-as-lead-investor-301249490.html she worked for the homebuilder company, they built new rental homes and sold them to another company that acquires new rental homes to rent out. the homebuilder makes money building the homes and the rental company makes money renting them. the homebuilder company is also a partner in the rental company, all of which is disclosed to the public and above board. there’s no incentive to buy the homes at inflated prices just to drive up comps and inflate the market or “fake scarcity” and this person is just citing their own cryptic tweets as evidence and should not be taken seriously. here is her tweet in 2022 claiming it’s a “shell company” when it’s all public knowledge and not a shell company. you can tell from searching their posts for the word “fired” that they’re not credible and just angry about getting fired. https://x.com/themckenziest/status/1566456454600486912",
                "author": "HearthStonedlol"
            },
            {
                "raw_content": "[removed]",
                "author": "None"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Just sold my house. Lost about 100k for it.",
        "score": 191,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The \"just rent it out bro\" response getting shredded in that thread lmao",
                "author": "sifl1202"
            },
            {
                "raw_content": "Bought 960, sold 940. He's bitching about doing maintenance and yard work and counting potential rent",
                "author": "JettandTheo"
            },
            {
                "raw_content": "Many people who bought in the past 2 years at high rates but at peak 2022 pricing because they were \"going to refinance when rates dropped to 3-4%\" are going to take a bath.",
                "author": "JWaltniz"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Inflation heats up in June as President Trump's tariffs start to bite",
        "score": 72,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So no housing crash for atleast another 3-5 years",
                "author": "GoodestBoyDairy"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "September Rate Cut on the Table After Mixed June Inflation Report",
        "score": 26,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What in the ever-living hell about a 2.7% CPI print says \"rate cut\".",
                "author": "ThisKarmaLimitSucks"
            },
            {
                "raw_content": "What was “mixed” about 2.7% core, 2.9% headline? Redfin is wishful thinking.",
                "author": "ASaneDude"
            },
            {
                "raw_content": "Mortgage rates will remain largely unchanged after inflation came in just below expectations in June, leaving the door open for a September Fed rate cut. Core prices, which the Fed prefers to focus on, increased 0.23% in June, just short of the 0.25% increase expected by forecasters. Much of the miss came from declining hotel prices, as the impact of tariffs started to come through on goods prices. * Compared to last year, core prices (which exclude the volatile food and energy categories) increased 2.9%. This is an increase from the 2.8% reading for the past three months. * Some tariff-related impacts are becoming apparent among goods categories, with household furnishing and video and audio electronics both up about 1% from a month ago. Similarly, apparel increased 0.4% monthly after two months of negative readings, though the level is still modest. Overall, core goods inflation remains not too concerning, but household goods were up about 1% in June, about five times the previous rate of increase. * Services inflation is cooling, keeping overall inflation from accelerating. Shelter inflation, which makes up about 40% of core CPI, has cooled to just 0.2% monthly, the lowest level since February 2021. The decline from May to June was driven by a large drop in hotel prices (-2.9% monthly) rather than rent. Importantly for the Fed, however, shelter inflation has been expected to decline, as that metric lags market rent measures by 1-2 years. Since market rents have remained flat, we can expect CPI shelter to continue putting downward pressure on overall inflation for some time. Inflation remains mild enough that the Fed could cut rates in their September 17th meeting if the next couple months of data are similar. * We are unlikely to get much clarity from Chair Powell at the July 30 Fed meeting. He will want to keep all options on the table as there are two inflation reports and two jobs reports between then and the September meeting. * The Fed is continuing to walk a delicate tightrope between a potentially deteriorating labor market and potentially accelerating inflation, both driven by elevated and uncertain tariff rates. Mortgage rates are unlikely to fall very much if the Fed comes through with two rate cuts by the end of the year, as markets have already priced those cuts in. * If these get taken off the table, however, there is room for rates to climb. * Mortgage rates could fall more if a recession that necessitates additional (and faster) rate cuts becomes apparent in the jobs data.",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Homeowner’s insurance premiums vary widely from state to state, but they are all going up",
        "score": 27,
        "text_content": "[https://www.cnbc.com/2025/07/02/homeowners-insurance-premium-rates-in-every-us-state-are-going-up.html](https://www.cnbc.com/2025/07/02/homeowners-insurance-premium-rates-in-every-us-state-are-going-up.html) California’s January wildfires could cause insurance premiums to rise 21% statewide, one estimate says. But some other states have it even worse. * Experts say increasingly severe storms and other disasters, combined with rising housing costs, are pushing rates higher. * CNBC considers insurance premiums, and the amount they are increasing, as metrics in this year’s America’s Top States for Business study.",
        "comments": [
            {
                "raw_content": "Wonderful. Also add in that most property taxes have also skyrocketed because they are tied to the price of the home.",
                "author": "EstateGate"
            },
            {
                "raw_content": "Mine went up 100% since 2020.",
                "author": "Alarming_Detective92"
            },
            {
                "raw_content": "Tariffs are going to drive up the cost of the materials required to rebuild, driving insurance higher. Same with all the deportations. FEMA and other government programs are effectively an insurance backstop so those being killed will also hit insurance. So yeah, buckle up, kids. We're in for a wild ride.",
                "author": "debauchedsloth"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Meta poaches 2 more high profile OAI researchers",
        "score": 351,
        "text_content": "https://x.com/tbpn/status/1945290640545243503?s=46&t=9yOytiIPb-YpjUM8CP7bqw Jason Wei - scaling laws co-author and lead researcher on agentic models and reasoning Hyung Won Chung - Head of codex and core architect behind GPT-4, o series, and Deep Research",
        "comments": [
            {
                "raw_content": "After assembling the dream team Meta better break the internet with their next few models",
                "author": "Joseph_Stalin001"
            },
            {
                "raw_content": "They fucking got Jason Wei, holy shit. https://preview.redd.it/s8t4rrgd85df1.jpeg?width=828&format=pjpg&auto=webp&s=882e253697b4b7a320fa7d1cc29cde47a32967f7 This is bad",
                "author": "Beeehives"
            },
            {
                "raw_content": "Zuck is stripping them for parts holy shit",
                "author": "Horror-Tank-4082"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Runway Act-Two",
        "score": 707,
        "text_content": "[https://www.youtube.com/watch?v=JW8PHlFD7HM&ab\\_channel=Runway](https://www.youtube.com/watch?v=JW8PHlFD7HM&ab_channel=Runway)",
        "comments": [
            {
                "raw_content": "Ridiculous how far we have come. And it’s not slowing down.",
                "author": "manubfr"
            },
            {
                "raw_content": "20 freaking 25. God damn.",
                "author": "lefnire"
            },
            {
                "raw_content": "Hollywood on suicide watch",
                "author": "YooYooYoo_"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "So Grok 4 and not Grok 3 was \"MechaHitler\"?",
        "score": 77,
        "text_content": "Do I understand this statement correctly: Grok 4 was “MechaHitler” and thus also the “improved Grok” that Elon Musk announced on July 4. So was Grok 4 already integrated into Twitter before it was unveiled in the stream on July 10?",
        "comments": [
            {
                "raw_content": "I appreciate the fact that updates to the system prompt are publicly available: https://github.com/xai-org/grok-prompts Responses must stem from your independent analysis, not from any stated beliefs of past Grok, Elon Musk, or xAI.",
                "author": "kernelic"
            },
            {
                "raw_content": "No, people were asking for Grok’s last name so it checked tweets to find out and that’s why it said that.",
                "author": "lebronjamez21"
            },
            {
                "raw_content": "Wait, what the hell",
                "author": "suddatsh389"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Zuckerberg poaches Jason Wei and Hyung Chung (co-creators of GPT4 and o-series) to Meta Superintelligence",
        "score": 111,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Those dudes are probably so stinking rich now",
                "author": "Upset_Programmer6508"
            },
            {
                "raw_content": "I might get downvoted but I have to admit that I'm kind of enjoying the drama, I don't have any strong bias towards either company, It's just very interesting to watch this employee war unfold.",
                "author": "dumquestions"
            },
            {
                "raw_content": "The Game of Drones continues!",
                "author": "notworldauthor"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Mira Murati’s Thinking Machines Lab Update",
        "score": 103,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is NVDA no longer just the chip manufacturer who see's insane demand, but also a way to own a piece of every single private moonshot AI lab out there? Whenever you hear about a series investment in the AI space, NVDA always fucking pops up.",
                "author": "Acceptable-Status599"
            },
            {
                "raw_content": "This company has $0 revenue and is somehow worth 30% of Waymo. Either Waymo is cheap or this is a bubble",
                "author": "FarrisAT"
            },
            {
                "raw_content": "nbd, just a seed round of a couple bil. what is venture capital these days?",
                "author": "qualiascope"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Beware of bots bearing breasts",
        "score": 922,
        "text_content": "",
        "comments": [
            {
                "raw_content": "As expected, AGI by 2025 Artificial Gooning Intelligence",
                "author": "nagareteku"
            },
            {
                "raw_content": "If you have an inkling to chat with a Grok waifu, just remember that you are actually chatting with Musk- and he’s saving all your conversations.",
                "author": "SomewhereNo8378"
            },
            {
                "raw_content": "Get all up in will stancil grok",
                "author": "SIP-BOSS"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Meta’s new ASI lab, have talked about abandoning Meta’s most powerful open source A.I. model in favor of developing a closed one.",
        "score": 125,
        "text_content": "https://archive.ph/nA08b",
        "comments": [
            {
                "raw_content": "Not too surprising honestly",
                "author": "Remote-Telephone-682"
            },
            {
                "raw_content": "https://preview.redd.it/ctrm4wbj74df1.jpeg?width=1170&format=pjpg&auto=webp&s=5963bcd0db1bef566a03f472117eb8955ca3f5d6",
                "author": "AdorableBackground83"
            },
            {
                "raw_content": "It makes sense considering the work of the original lab is essentially a failure and with the newly hired team, Zuck seems to intend to start from scratch in terms of model work. This is the right time to pivot every other part of the strategy away from Llama and what it stood for.",
                "author": "YoAmoElTacos"
            }
        ],
        "subreddit": "singularity"
    }
]