[
    {
        "post_name": "Elon Musk : The fraud in California, New York and Illinois is far greater than in Minnesota. My guess for how much fraud is happening nationwide is roughly 10% of the Federal budget, so about $700 billion per year.",
        "score": 540,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Make sense. California is the largest state economy in the US and the most corrupt.",
                "author": "airborne3502"
            },
            {
                "raw_content": "And it’s not just money. It’s also elections. Imagine what this country would look like if California, New York and Minnesota were *competitive*. They don’t even have to be red. Just competitive. It would change everything.",
                "author": "Decepticons-superior"
            },
            {
                "raw_content": "LOL if you think it's only 10%. I guess it depends on what you consider fraud though.",
                "author": "Modernturnkey"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Rubio realizing he has to be Governor of Minnesota now too...",
        "score": 512,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Kek. Well played.",
                "author": "KuzoKevin"
            },
            {
                "raw_content": "\"Rubio doesn't fumble his gun. Believe me. Wacky Walz is a total loser. So sad.\"",
                "author": "wharfthrowaway"
            },
            {
                "raw_content": "Honestly, I like the Rubio memes. Now we need something where Franklin meets Rubio.",
                "author": "GuerillaYourDreams"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "TRUMP On TIKTOK: 339 BILLION all-time views of TRUMP TikToks",
        "score": 404,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# TRUMP # IS MY # PRESIDENT",
                "author": "FatigueIsReaI"
            },
            {
                "raw_content": "Am I the only one who thinks this is kinda lame?",
                "author": "GettingSillyNow"
            },
            {
                "raw_content": "339 billion views. ZERO deep state arrests.",
                "author": "Creepy_Joe"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Stephen Miller: BOSS",
        "score": 452,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Leftists will always side with evil.",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "Poor Fake Yapper. If he wasn't such a smarmy, despicable rat-faced piece of shit, I'd almost feel sorry for him.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Gave me chills. Someone with the balls to \"Chad Yes\" the MSM when they try their commie framing.",
                "author": "orcwordlaugh"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "*Hoooooooootttttttt Pocketsssss*",
        "score": 136,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is not from The Joe Rogan show. Multiple content creators and channels clip that intro for tons of content. They use his likeness to get more clicks. Also the video in the clip is pretty old.",
                "author": "DemPanicAtTheDisco"
            },
            {
                "raw_content": "#boomerburned Fucking brutal for the gen-a 'tard who had to grasp how significant this burn was.",
                "author": "ERIC_CIARAMELLA"
            },
            {
                "raw_content": "https://www.youtube.com/shorts/w7niKMGdWvg",
                "author": "LearnAboutRoaches"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Rep Chip Roy, Congress is too corrupt to fix: “At some point people will look at this body and say, maybe we should get rid of all 435 members of the House and all 100 members of the Senate and start over: Congress is literally failing the American people”",
        "score": 1344,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The number of good congressmen is probably single digits… if it’s above 0",
                "author": "Wrexxis780"
            },
            {
                "raw_content": "Yah, and he's one of them, the blowhard dick.",
                "author": "FreedomFromGovt"
            },
            {
                "raw_content": "Convention of States, Fire them all , Amendments 1)Term limits 2) mandatory balanced budget 3) abolish IRS",
                "author": "Iambutanegg"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Always remember that the media doesn't sell the news. It sells narratives.",
        "score": 1121,
        "text_content": "",
        "comments": [
            {
                "raw_content": "All they are supposed to do is report facts, but they can't since it implicates their political party every single time.",
                "author": "MythArcana"
            },
            {
                "raw_content": "Yellow journalism used to get people tarred and feathered",
                "author": "Formerlurker92"
            },
            {
                "raw_content": "The media is a tentacle of the C.I.A.",
                "author": "MAGAguitar"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "In 2024, Arizona State University ( @ASU ) started running a refugee sponsorship program to import Somalians into the school, giving them benefits such as tuition support and providing a pathway to citizenship.",
        "score": 1068,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Can we start bringing down the bitch slap of God onto these commies. Take their money, charter, government contracts and anything else until they stop being fucking retards",
                "author": "Formerlurker92"
            },
            {
                "raw_content": "It’s global wire fraud managed by traitorous shits",
                "author": "MAGAguitar"
            },
            {
                "raw_content": "So literal fucking retards are getting a free ride while our kids are thrown on the streets",
                "author": "PapaPepe"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "HAPPENING NOW: Reports of heavy gunfire in Caracas, Venezuela.",
        "score": 1036,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Looks a lot safer than Chicago or London.",
                "author": "magnokor"
            },
            {
                "raw_content": "Cell phone microphone lose a lot of quality. Almost sounds like firecrackers if you ignore recent events. So who thinks a coup is gonna happen?",
                "author": "Just_a_Patriot"
            },
            {
                "raw_content": "The Ghost of Caracas!!",
                "author": "Nonyer"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Amy Klobuchar is expected to run for Governor of Minnesota to replace Tim Walz. Here’s that time she stood in a blizzard to lecture us about the importance of Somalis to this country. She’s deep in the fraud.",
        "score": 1159,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This evil nazi bitch needs to be arrested along with Omar and her brother husband.",
                "author": "JtBlaze"
            },
            {
                "raw_content": "Things that never happened for $200 Alex.",
                "author": "UltraMagaNeil"
            },
            {
                "raw_content": "They don't even try to hide the fact that they're stealing taxpayer dollars by importing subhuman somalians to be the collateral damage, when it all comes tumbling down and they run away with the money.",
                "author": "USNVET71"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Somali UN Security Council President involved with healthcare company guilty of Medicaid fraud in Ohio",
        "score": 1086,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The list of Somalis NOT committing fraud is probably shorter than Zelenskyy",
                "author": "wharfthrowaway"
            },
            {
                "raw_content": "Man anybody who says I'm racist because I mention that all Somalis look the fucking same can fuck right off. They all look the fucking same. Their gene pool has to be a fucking thimble with 3/4 of it's contents spilled out.",
                "author": "Spacemonkey"
            },
            {
                "raw_content": "Sounds like an arrest needs to be made.",
                "author": "Cakes4077"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Tell me the truth, I'm ready to hear it.",
        "score": 463,
        "text_content": "",
        "comments": [
            {
                "raw_content": "kek",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "And the poison tree Frog color hair doesn't help either",
                "author": "DiamondDroid"
            },
            {
                "raw_content": "Daddy issues. Every time.",
                "author": "stevethefish76"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Minnesota’s Corrupt Governor will possibly leave office before his Term is up",
        "score": 1449,
        "text_content": "",
        "comments": [
            {
                "raw_content": "omar is completely useless as a rep, what has she ever accomplished? all she does is talk shit about America get her the fuck out",
                "author": "TruculentGoose"
            },
            {
                "raw_content": "Um, the facts are already out. Somebody needs arresting, yesterday!",
                "author": "ImYourHuckleberry24"
            },
            {
                "raw_content": "Cool if no one is above the law, why no arrests?",
                "author": "EstadosUnidosPrimero"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: The Corporation for Public Broadcasting, founded by Lyndon B Johnson in 1967, the primary funding vehicle for PBS, has officially been DISSOLVED after President Trump stripped them of funding GOOD RIDDANCE! Taxpayers will NO LONGER subsidize this leftwing propaganda.",
        "score": 1916,
        "text_content": "",
        "comments": [
            {
                "raw_content": "2026 is off to a good start - [Venezuelan commie tyrant Maduro captured](https://truthsocial.com/@realDonaldTrump/posts/115830428767897167) - [Trump and Elon are Best Frens again: Had a lovely dinner last night with @POTUS and @FLOTUS. 2026 is going to be amazing!](https://x.com/elonmusk/status/2007910921914769832) - [Elon will be going all-in funding Republicans to help President Trump keep full control of the House/Senate in the November midterms: America is toast if the radical left wins. They will open the floodgates to illegal immigration and fraud. Won’t be America anymore.](https://x.com/elonmusk/status/2006832891024781722) - Tampon Tim not seeking re-election - CPB dissolved",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "Federal funds, aka the CPB, account for only about 15% of PBS's revenue. If it wasn't run by a bunch of dumbass Democrats, who don't have any business acumen, it would probably survive.",
                "author": "airborne3502"
            },
            {
                "raw_content": "It's kind of sad. It used to be a good thing (PBS, I mean). Actually played a really positive role in many millions of people's lives, especially kids. Just got taken over by Gay Communists is all.",
                "author": "flp999"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Wow we are reaching many.. that last look sells it all",
        "score": 981,
        "text_content": "",
        "comments": [
            {
                "raw_content": "She is cute, but the nose ring sets off alarm bells and has more red flags than the CCP parade.",
                "author": "3-10"
            },
            {
                "raw_content": "I mean, she's a) not wrong, and b) looks like something of a leftist herself",
                "author": "bill_in_texas"
            },
            {
                "raw_content": "I'm getting Blade Runner vibes",
                "author": "Crappydatum"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: The US stock market just hit an ALL-TIME RECORD HIGH under President Trump yet again following the arrest and capture of Maduro. The Democrats panicked that this would \"destabilize\" everything but it's just the OPPOSITE. The \"Experts\" lost AGAIN 🔥",
        "score": 1335,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Okay, but can we stop pretending like the stock market and the economy are the same thing? I'm glad giant corporations are making more money than ever, but I'd also like blue-collar and middle class Americans to be doing better as well.",
                "author": "Keiichi81"
            },
            {
                "raw_content": "Stock market does not equal real economy. Of course the casino is happy and trading high. In the real economy insurance claims are down while miles driven is up, repos on cars is rising every month, 90 day delinquency on payments is 5.1% and rising, consumer spending is way down except at barebottom outlets, all time high CC debt, rising percent of people defaulting on student loans. Labor market had massive layoffs during holidays, job numbers keep getting revised down by insane amounts and even ADP had US jobs negative during holidays. Anyone saying we are in a strong economy is nuts",
                "author": "Sinnister_Agenda"
            },
            {
                "raw_content": "Fuck this bullshit. My electric bill is 500 fucking dollars.",
                "author": "KOMMISSARofMAGA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The White House: President Donald J. Trump and his Administration are UNLEASHING a relentless assault to dismantle the massive fraud empires built in Minnesota under the watch of incompetent Democrats like Tim Walz and his Radical Left enablers. 🔥",
        "score": 903,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Unless Waltz is arrested I don't give a shit. He's behind this fraud 100%.",
                "author": "jml1997"
            },
            {
                "raw_content": "California, NY, and Illinois next please.",
                "author": "MikeTruk"
            },
            {
                "raw_content": "Hard to call them incompetent. Unethical, evil, anti-American, sure. But they have competently robbed billions of dollars from the American people. and as near I can tell - they have gotten away with it. Zero accountability. At least not on this side of the grave. Nonetheless, as Pslam 73 reminds us, no need to fret - Trust in the Lord. Unless these people repent and forsake their evil ways, they will receive a Judgment of fire. God is in Charge.",
                "author": "ElCid777"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Hey Ohio! Day 1 into our Columbus, Ohio fraud investigation. Nothing to see here except me being attacked.",
        "score": 402,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Deport. Deport. Deport.",
                "author": "JtBlaze"
            },
            {
                "raw_content": "I love that citizens are all rising up and exposing more fraud. The left thinks they can smear Nick and make this go away",
                "author": "Choppermagic"
            },
            {
                "raw_content": "Another empty shell company with no services like Hunter Biden's company that funneled money to Joe",
                "author": "snoopy3210"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Its happening... Up to 2,000 THOUSAND federal agents are now set to SURGE to Minneapolis MN, to arrest illegal aliens and investigate massive fraud - CBS. Border Commander GREG BOVINO will reportedly join them on the ground. Send every Somali back. MASS ARRESTS!",
        "score": 1458,
        "text_content": "",
        "comments": [
            {
                "raw_content": "**NOT ANOTHER *WORD* UNTIL ARRESTS.** **I DON’T GIVE A FUCK ABOUT *ANNOUNCEMENTS* OF ‘IMMINENT JUSTICE’.**",
                "author": "PensivePatriot"
            },
            {
                "raw_content": "So, 2 MILLION federal agents?",
                "author": "Crappydatum"
            },
            {
                "raw_content": "Who. The. Fuck. Is. Eric. Daughtry.",
                "author": "TrumpYouMagaFrenner"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "So apparently Sir Transalot doesn't approve of our methods.",
        "score": 1226,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sorry for being rude. His proper name is Sir Transalot du Lac.",
                "author": "Herpawinski"
            },
            {
                "raw_content": "When we want an opinion we'll give it to you. Now go back to your failed state before we do a late night helicopter pick up",
                "author": "Formerlurker92"
            },
            {
                "raw_content": "go suck your granny's cock you fuckin weed",
                "author": "Treefiddydiddy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "AI Circular economy is so obvious in these CES presentations",
        "score": 192,
        "text_content": "In all my years of watching CES I never seen anything like this. AMD is literally giving the stage for companies to advertise their product, and hardly if at all. talk about AMD. it's clear what is going on here, between the \"buy my hardware and I''ll invest in your company\" circular bubble with AI and this. it's silly. this wasn't even a CES presentation it was just ads for AI companies so they raise their valuations and stocks.",
        "comments": [
            {
                "raw_content": "Meanwhile where did all the PSU companies that were shouting \"AI AI AI\" in 2025 gone? Now no one in the consumer market is buying their products since GPUs, SSDs, and RAM has been bought out by real AI customers.",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "AMD's primary customer for AI were the people they brought on stage. AMD doesn't make money from consumers using AI. They make money from the companies presented tonight buying their hardware, and they'll only continue buying that hardware if you use their software. I don't really see it as much different than AMD/Intel bringing Dell, HP, MS, Acer, etc. on stage when talking about their new laptop CPUs",
                "author": "soggybiscuit93"
            },
            {
                "raw_content": "CES stands for \"Consumer Electronics Show\". Someone needs to remind the presenters of this.",
                "author": "markhachman"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel says Arc B390 graphics are 73% faster than AMD Radeon 890M, special version for handheld confirmed",
        "score": 251,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Great. Does this mean AMD will finaly stop pricing Strix Point as if it was made out of gold ?",
                "author": "Standing_Wave_22"
            },
            {
                "raw_content": "I think the LPE cores and them going at chiplets a second time after Meteor lake is paying off. This chip is more efficient than lunar lake, a chip that could do 0.62W idle lol.",
                "author": "OddMoon7"
            },
            {
                "raw_content": "One of the biggest things the current AMD driven handhelds lack is a decent upscaling option, so getting native XeSS support on a fast GPU would be a HUGE performance boost.",
                "author": "Framed-Photo"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "NVIDIA DLSS 4.5, Path Tracing and G-SYNC Pulsar Supercharge Gameplay With Enhanced Performance and Visuals",
        "score": 60,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">DLSS 4.5 Super Resolution takes full advantage of GeForce RTX 40 and 50 Series GPUs, which benefit from faster, more advanced Tensor Cores in our latest architectures. By leveraging FP8 precision capabilities, the hardware doubles inference throughput, allowing the 2nd generation transformer to run with a minor performance tradeoff compared to the first. Finally FP8 Super resolution. https://www.nvidia.com/en-us/geforce/news/dlss-4-5-dynamic-multi-frame-gen-6x-2nd-gen-transformer-super-res/",
                "author": "From-UoM"
            },
            {
                "raw_content": "I remember seeing people wanting to see Gsync Pulsar updates.",
                "author": "-WingsForLife-"
            },
            {
                "raw_content": "About the new transformer model: Building on eight years of research, including six years refining Convolutional Neural Networks (CNNs), we are introducing the first major upgrade of our transformer architecture with DLSS 4.5 Super Resolution. This second-generation model is our most sophisticated yet, utilizing five times the compute power of the original transformer model, having been trained on a significantly expanded, high-fidelity dataset. The model has a deeper understanding in every scene, and more intelligently uses game engine pixel sampling and motion data to deliver images that have better lighting, finer edges, and improved motion clarity. DLSS 4.5 achieves a breakthrough in lighting effects by solving a traditional challenge faced by Temporal Anti-Aliasing (TAA), and earlier super resolution models. Previous techniques operated in logarithmic space to dampen flickering, which unfortunately resulted in muted lighting, clipped details, and crushed shadows in high-contrast scenes. In comparison, DLSS 4.5 Super Resolution trains and infers directly in linear space, the game engine’s native ground truth. Because the new AI model is powerful enough to manage instability without compressing the data, it accumulates lighting with physical accuracy, allowing glowing neon signs and bright reflections to retain their full color range and detail. DLSS 4.5 Super Resolution takes full advantage of GeForce RTX 40 and 50 Series GPUs, which benefit from faster, more advanced Tensor Cores in our latest architectures. By leveraging FP8 precision capabilities, the hardware doubles inference throughput, allowing the 2nd generation transformer to run with a minor performance tradeoff compared to the first. While DLSS 4.5 Super Resolution enhances image quality across all settings, including Quality and Balanced modes, the transformation is greatest in Performance and Ultra Performance modes, where fewer rendered pixels are available. By leveraging the power of the 2nd generation transformer, Performance Mode is now comparable to, and can even beat, native image quality, while Ultra Performance has evolved into a truly viable mode for 4K gaming. Overall, DLSS 4.5 delivers a significant leap in image quality across the board, resulting in sharper anti-aliasing, reduced ghosting, and enhanced temporal stability.",
                "author": "nukleabomb"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "CES 2026: Intel Core Ultra Series 3 Debut as First Built on Intel 18A",
        "score": 165,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hopefully 18A ends up being a success. There needs to be healthy competition to TSMC.",
                "author": "nhc150"
            },
            {
                "raw_content": "The interesting claims: At 45W vs HX 370 890M at 53W, B390 is 73% faster average across 45 games. At 45W vs Arrow Lake H w/4050, B390 is 10% faster in the same 45 games. The platform used for the 4050 is TGP limited so at 45W vs 110W 4050, B390 should be approximately 25% slower. At 25W vs Lunar Lake, Panther Lake is 60% faster in CB24 MT and 77% faster in iGPU gaming with 27 hours of battery life in a Lenovo IdeaPad reference design with a 2880x1620 panel. At 25W 4+8+4 vs Arrow Lake H 6+8+2, Panther Lake is 25% faster in CB24 MT At 12W, Panther Lake matches Lunar Lake single core performance at 20W.",
                "author": "Maimakterion"
            },
            {
                "raw_content": "Cool that 18A chips will be available this soon on consumer devices. I think this is likely the make it or break it moment for Intel. 18A has to deliver.",
                "author": "QuantumUtility"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "NVIDIA confirms no RTX 50 SUPER GPUs at CES 2026, but promises updates for gamers",
        "score": 625,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Updates include: pricing",
                "author": "Same_Mood_8543"
            },
            {
                "raw_content": "Not a big surprise. Supers are scrapped for obvious reasons. I'm guessing 6000 series sometime in 2027 instead.",
                "author": "a_saddler"
            },
            {
                "raw_content": "Update for gamers: > We are relaunching RTX 3060 for folks who want to wait till 5000 Super release.",
                "author": "taking_bullet"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD Ryzen 7 9850X3D launches this quarter",
        "score": 75,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Would be killer value if this replaces 9800X3D at the same msrp. But it's AMD so they will price it at $549 and sell it alongside 9800X3D.",
                "author": "1mVeryH4ppy"
            },
            {
                "raw_content": "So exactly the same specs as the 9800X3D but clocked slightly higher? Seems incredibly pointless, but I suppose it's a convenient way for them to make extra money off the chips that win the silicon lottery.",
                "author": "Ploddit"
            },
            {
                "raw_content": "Does this pair well with Nvidia’s newly release of the 3060?",
                "author": "-Jarvan-"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Hardware Unboxed] AMD Begins to Milk Gamers: Slightly Faster Ryzen 7 9850X3D is Coming",
        "score": 32,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Didn’t everybody expect this to be a 2 year holding pattern until Zen 6 regardless? Isn’t this what usually happens?",
                "author": "M337ING"
            },
            {
                "raw_content": "I had the fastest gaming CPU in the world for 2 weeks",
                "author": "Sharp_eee"
            },
            {
                "raw_content": "Could be worse, you could be a threadripper customer.",
                "author": "-WingsForLife-"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Dell Reverses Course, Brings Back XPS Laptops",
        "score": 39,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Looks slick. Never understood why they tried to nix the brand that sat apart from its competitors.",
                "author": "suzukijimny"
            },
            {
                "raw_content": "No dGPU in the XPS 16 even? Where are they going with this? Edit: Also are these the first laptops with **silicon carbon batteries?**",
                "author": "Forsaken_Arm5698"
            },
            {
                "raw_content": "If it can match the macbook's build which the xps never has, I'll go for it. I have an xps 15 9510 sitting on my desk. It's a tier below the macbook in build",
                "author": "Qsand0"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nvidia to bring back the GeForce RTX 3060 in Q1 2026 to tackle current-gen GPU and memory shortages",
        "score": 629,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Manufacturing a 5 year old GPU still. That's insane.",
                "author": "BlueGoliath"
            },
            {
                "raw_content": "but why? we already have rtx5050.",
                "author": "Kotschcus_Domesticus"
            },
            {
                "raw_content": "Bring back? Given it has never been out of stock I assumed it was always kept in production.",
                "author": "jenny_905"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Early adopters - how we feeling so far?",
        "score": 944,
        "text_content": "Now that we’ve spent some time with the device and that honeymoon phase is over - how’s everyone feeling about the Switch 2? My only complaint is I still feel like we’re missing that flagship heavy hitter first part game.. like how the switch 1 had BOTW. Regardless there is tons to look forward to this year.",
        "comments": [
            {
                "raw_content": "I love my Switch 2 and I wish I had more time to play it. My only complaint is the lack of switch 2 patches/editions .",
                "author": "Mission_Guidance_593"
            },
            {
                "raw_content": "I bought it for my kids for Christmas. Pretty big dad goal accomplished, buying your kids the new Nintendo. Proud. Anyways my daughter isn’t interested and my son still just wants to play Goat Sim on my PS5. My wife is loving it though.",
                "author": "Ancient_Substance152"
            },
            {
                "raw_content": "Sometimes I forget that it's a new console at all. The controls are the same, the form factor is mostly the same. The home menu is pretty similar. My old games are still there and so is their save data, and since I don't buy every single new release, I don't really have that many new games to play, I'm mostly playing older games. This isn't me complaining, I hate when new consoles feel like a giant reset. I think backwards compaitibility is the best feature any console can have. So far the only truly great game I've bought is Donkey Kong Bananza. I liked Mario Kart World but as someone who doesn't really go hard into Multiplayer, I ran out of things to do in it before Bananza even released. And Metroid is fine. I haven't finished it. Really hoping they've got something really big to wow us this year.",
                "author": "pocket_arsenal"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "This is what it’s made for",
        "score": 213,
        "text_content": "This is what Nintendo intended when they made the Switch. Gaming on the go and at the house. The Nintendo Switch 2 made that possible with better graphics, better battery life and amazing games.",
        "comments": [
            {
                "raw_content": "Better battery life? Sounds like astroturfing.",
                "author": "Kabelly"
            },
            {
                "raw_content": "Playing smash bros with my friends on lunch break at college was some of the most fun memories I made there.",
                "author": "IronWolf6677"
            },
            {
                "raw_content": "This picture, is pretty much my wife and I Saturday mornings at the laundromat 👍👍",
                "author": "FactorFear74"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Official Nintendo playing card covered in gold I got yesterday at the Nintendo museum",
        "score": 47,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm saving up for the Nintendo-made Suntory whiskey ones with the naked ladies on them (look it up on eBay hah)",
                "author": "unrequited"
            },
            {
                "raw_content": "Good choice in merch I'd pick up something like this for sure. Are they regular playing cards?",
                "author": "buttfartsmagee"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Shadows is a lot of fun!",
        "score": 82,
        "text_content": "Looks great docked",
        "comments": [
            {
                "raw_content": "Looking forward to this one, it's a great setting and I haven't played one since Black Flag on the Wii U.",
                "author": "FireLucid"
            },
            {
                "raw_content": "Same, when i bought it, everyone was telling me my switch 2 would explode, but no lol didn't happen im loving it!",
                "author": "ProEpikGamer90"
            },
            {
                "raw_content": "Really enjoying Shadows, I've been waiting for a new AC to land on the Switch. I think the graphics look great in docked mode.",
                "author": "mark43w"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Well that looks better (IMO)",
        "score": 606,
        "text_content": "Had a gift card to use on Amazon and had no desire to do a full shell swap so went with this (PlayVital) snap on shell. Happy enough with it and the stick on rubber buttons 😂 only downside for some would be it blocks access to the stand - fine for me I’ve never used it even on Switch 1 - but it does come with a stand that you’d obviously need to carry around separate. Oh and no issues when Docking, fits nicely.",
        "comments": [
            {
                "raw_content": "Looks neat. Does it still fit in the Switch 2 travel case with the shell on?",
                "author": "Qazsedcftgb2"
            },
            {
                "raw_content": "This looks like a cheap toy... I love it!",
                "author": "weaklingoverlord"
            },
            {
                "raw_content": "I recommend covering switch with some thin skin before putting this case on. Had the same SNES one for Switch OLED and it scratched the shit of my console and joy-cons just by being on it",
                "author": "ginencoke"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Dragon Quest VII Reimagined demo launches January 7",
        "score": 77,
        "text_content": "",
        "comments": [
            {
                "raw_content": "FF 7 + DQ 7 for the switch 2 to be released so close together. Really happy for JRPG fans",
                "author": "Major_Stretch_5882"
            },
            {
                "raw_content": "I never tried playing the first DQs that were recently remastered with the 2DHD/Octopath look, but I did play DQVII on the 3ds. Suffice it to say that this is one of the few times where I'd be happy to carry my demo save over to the main game, because this game is LOOOOOOOOOOOOOOOOOONG enough without repeating the beginning. I'm not 100% sold on the art style for this new version, but maybe the demo will sway me.",
                "author": "A_Legit_Salvage"
            },
            {
                "raw_content": "I love that they are releasing a demo for this! It's almost definitely a day one purchase for me, but I really appreciate getting a chance to try things out beforehand! I'm ridiculously excited for this game! I would normally take time off work to get to play more at release, but I'm trying to save it for Fire Emblem later this year",
                "author": "Key_Artichoke8315"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Cable Management",
        "score": 42,
        "text_content": "I just ran wires through my wall to make everything aesthetically pleasing. The only issue is the charging cables coming out of the switch console to the controllers. Has anyone had any luck with different wires or better ways to hide these horrific looking wires?",
        "comments": [
            {
                "raw_content": "Left Joycon left the chat",
                "author": "Mediocre_Rabbit9406"
            },
            {
                "raw_content": "Something tells me r/tvtoohigh",
                "author": "freetotebag"
            },
            {
                "raw_content": ">make everything aesthetically pleasing If you say so.",
                "author": "Voyager5555"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "People, like me, who are going to play FFVIIR for the first time on Switch 2 are (potentially) about to enjoy something wonderful, but very, very rare in modern gaming",
        "score": 7,
        "text_content": "Namely, we are going to get to experience a trilogy of big AAA games within a reasonable timeframe. Remake is out in a fortnight, Rebirth is already confirmed to be coming (and I'd imagine it'll be either late this year or early 2027). While nothing's confirmed regarding the third part, it's extremely likely to be on Switch 2 and will probably release late 2027 or early 2028. In other words, after picking up Remake later this month, people playing this for the first time will most likely be wrapping things up with the final (and brand new) game just a couple of years later. With modern game development times, this is an astonishingly rare state of affairs - although, in my opinion, it's close to a perfect one. To be fair to Squenix, given modern development times, the 8 years or so it'll likely be for people getting each part at its original release is actually relatively quick work, but still...8 *years* from playing the first entry to seeing the ending is a long ass time. In contrast to this, Switch owners especially, might often have experienced trilogies or series of games all getting ported at once and released as a collection. This can be cool, but not all games (and massive jrpgs would be one such type) lend themselves to being played in quick succession, and while 4 years of waiting might be a bit much, a little bit of anticipation can actually be a good, exciting thing that adds to the experience of playing a game. Also, these collections are invariably of all old games, whereas in this case the final entry will be a brand new modern game that we'll be playing at launch. So yeah, playing through this trilogy with each game likely coming about one year apart is, to me, at least, pretty much the perfect release cadence. We'll never have to wait too long between releases while there'll still be enough of a break to both have a bit of a breather and build some anticipation, and it's all going to end with a big, new release that no one's played before. (I just hope I do actually like the game and want to keep going with the rest.)",
        "comments": [],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Warhorse is currently working on a game in UE",
        "score": 195,
        "text_content": "Rumors increasingly suggest that Warhorse is working in parallel on a second project (“Project X”) in Unreal Engine alongside Kingdom Come: Deliverance 3 in CryEngine, or at least laying the groundwork for it. While it’s considered all but certain that Warhorse is currently working on KCD3 in CryEngine (they likely wouldn’t start two entirely new IPs, and they’re still recruiting for Lua expertise), the following current and recent job postings strongly support the existence of a separate Unreal Engine project: • A Senior Technical Animator role explicitly asks for Unreal Animation Blueprints, state machines, and physics-based animations. That’s production-level UE work, not generic “engine experience.” • A DevOps/Infrastructure Engineer posting lists TeamCity / Unreal Engine Horde as a nice-to-have, which points to UE-oriented build and CI tooling (automation, testing workflows, etc.). • Probably the biggest giveaway: an external tech-art recruiting post links to Warhorse’s listings and explicitly mentions a “next UE project.” The account behind that post identifies itself as Jakub Holík, Lead TechOps at Warhorse. • Another supporting hint: a Lighting Artist listing mentions Blueprints (alongside scripting like Python) as a plus, which, while not definitive on its own, aligns with UE workflows. There are also smaller signs pointing in the same direction: several job posts use phrasing like “work on exciting AAA games” (plural), which can imply more than one project. At the same time, they seem to be scaling up longer-term in-house capabilities (QA ownership, checklists/regression, tooling/CI). Notably, the QA listing even includes a concrete onboarding window (e.g., April/May 2026), and they’re hiring multiple QA testers at once (both junior and senior), which fits a studio ramping up for a sustained parallel development. Sources: https://gamejobs.co/Senior-Technical-Animator-at-Warhorse-Studios https://warhorsestudios.breezy.hr/p/c09075f8b44701-devops-infrastructure-engineer https://www.tech-artists.org/t/senior-tools-programmer-tech-artist/17256 https://warhorsestudios.breezy.hr/p/58d889f74eb401-qa-tester-praha",
        "comments": [
            {
                "raw_content": "Hope they continue to utilize CryEngine, KCD2’s optimization was incredible",
                "author": "willklein"
            },
            {
                "raw_content": "Oi ue we gotta go kill omelandah befoar he knicks me son",
                "author": "MistahJ17"
            },
            {
                "raw_content": "Weren't there rumours about them working on a sci-fi space game? Maybe they're using UE 5 for that since tuning CryEngine for a space game will be a lot more work. CryEngine was a good choice for KCD because it does vegetation great.",
                "author": "LogicalError_007"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "NVIDIA to announce DLSS 4.5 tomorrow, with “Dynamic Multi Frame Generation” & “2nd Gen Transformer Model” - VideoCardz",
        "score": 1189,
        "text_content": "- Updated transformer model will have “better temporal stability, less ghosting and cleaner anti-aliasing” - Dynamic MFG will range from 3x to 6x the frames (current max is 4x) - DLSS 4.5 will come to all RTX GPUs right away but Dynamic MFG is only for 50 series and launches in Spring 2026 - Demos and video comparisons coming tomorrow with the announcement Source: https://videocardz.com/newz/nvidia-dlss-4-5-to-feature-2nd-gen-transformer-model-and-dynamic-6x-frame-generation",
        "comments": [
            {
                "raw_content": "What happened to reflex 2 tho?",
                "author": "k0stta"
            },
            {
                "raw_content": "Perfect since they will re-release the 3060 again",
                "author": "AlmoranasAngLubot69"
            },
            {
                "raw_content": "Interesting if the performance can increase with less input lag",
                "author": "Psnjerry"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Wccftech: NVIDIA To Bring Back The GeForce RTX 3060 In Q1 2026 To Tackle Current-Gen GPU & Memory Shortages",
        "score": 583,
        "text_content": "Key Quotes >The new report comes from hongxing2020, who has a solid track record with NVIDIA GPU updates and production plans. The user states that, as per the latest update on 5th January, NVIDIA has updated its partners that the RTX 3060 is coming back in Q1 2026. There's no detail on whether both the 12 GB / 8 GB models or one of those will be produced, but the RTX 3060 is going to be made available on retail shelves once again. >This indicates the extent to which the DRAM shortages have affected consumer GPUs. The GeForce RTX 5060 makes use of GDDR7 memory, and as DRAM costs rise, the [RTX 5060](https://wccftech.com/review/msi-geforce-rtx-5060-gaming-oc-8-gb-gpu-review-mainstream-gamers-deserve-better/) might not only be affected in terms of pricing but also in supply, since procuring the memory is also an issue due to poor supply. The 60-series product family is made for mass consumption, so NVIDIA will have to offer some alternative to its partners. Source: [https://wccftech.com/nvidia-to-bring-back-geforce-rtx-3060-q1-2026-tackle-memory-shortages/](https://wccftech.com/nvidia-to-bring-back-geforce-rtx-3060-q1-2026-tackle-memory-shortages/)",
        "comments": [
            {
                "raw_content": "somehow, ~~palpatine~~ rtx3060 returned",
                "author": "Isunova"
            },
            {
                "raw_content": "The new Forever GPU",
                "author": "KingBroly"
            },
            {
                "raw_content": "maybe 2027 they’ll bring back the 2060?",
                "author": "c0rny_"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Chainsaw Man x Fortnite is in the works!",
        "score": 186,
        "text_content": "https://xcancel.com/i/status/2008156723803254943",
        "comments": [
            {
                "raw_content": "I believe any and all Fortnite collabs at this point. Nothing is too out there for that game",
                "author": "Jammyyyyyyyyyyyyy"
            },
            {
                "raw_content": "From the guy that leaked the bleach collab. The following is just speculation on my part but we'll likely see the 4 main guys: Denji, Power, makima and aki",
                "author": "KvasirTheOld"
            },
            {
                "raw_content": "At this point, One Piece's collab has to be some type of mini-season like the Simpsons' for taking so long.",
                "author": "HearTheEkko"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Persona 5 Fitness Boxing DLC officially announced",
        "score": 89,
        "text_content": "[https://xcancel.com/FitBoxingInfo/status/2008011823237513656](https://xcancel.com/FitBoxingInfo/status/2008011823237513656) Previous rumor: [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1q0y3op/persona\\_5\\_fitness\\_boxing\\_teased/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1q0y3op/persona_5_fitness_boxing_teased/) Honestly I'm a little curious lol",
        "comments": [
            {
                "raw_content": "Man, I was really hoping it was a standalone game, that would’ve been so funny",
                "author": "KooTheBird"
            },
            {
                "raw_content": "How long will they milk P5 before giving us Persona 6",
                "author": "laytblu"
            },
            {
                "raw_content": "Royal themed DLC yet only one of the songs is actually exclusive to Royal lmao No Take Over or even songs like Whims of Fate or Blooming Villain either which is crazy. Hell honestly this is actually a scenario where they could've made a whole game like the Miku and Fist of the North Star crossovers if it meant more songs. The arrangements from Strikers or the PQ2 battle music would've been perfect",
                "author": "MyMouthisCancerous"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Core Ultra 300 “Panther Lake” series CPU series with Xe3 Arc graphics launch on January 27",
        "score": 84,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is insane for a ultrabook without a dedicated dGPU. Intel cooked! AMD brought us the same thing refreshed.",
                "author": "BigDaddyTrumpy"
            },
            {
                "raw_content": "And Intel steps back into the game. The next generation of handhelds is upon us.",
                "author": "rabbi_glitter"
            },
            {
                "raw_content": "despite me using amd, please let intel succeed",
                "author": "Much_Artist_5097"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel doubles down on gaming with Panther Lake, claims 76% faster gaming performance — new X-series chips deliver up to 12 Xe3 cores",
        "score": 77,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I haven't read the article yet but Panther lake will be made with different chiplet configurations, one of which will have a very large GPU tile. So they are likely talking about the largest integrated GPU regarding performance uplift.",
                "author": "whisskid"
            },
            {
                "raw_content": "76% faster than what ?",
                "author": "gitg0od"
            },
            {
                "raw_content": "[deleted]",
                "author": "None"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel says Arc B390 graphics are 73% faster than AMD Radeon 890M, special version for handheld confirmed",
        "score": 52,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That article claims it on par with the 4050 laptop. Jesus christ",
                "author": "Lord_Muddbutter"
            },
            {
                "raw_content": "this is nice but the handheld market could use less ultra 9 and 7s and more ultra 3s. the closer they can get to the nintendo 2DS XL in size while being under $400 the better.",
                "author": "altus418"
            },
            {
                "raw_content": "Hopefully they deliver. Amd needs a shake up in the APU market, mostly the GPU side of it.",
                "author": "akgis"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "This brand returns from the dead: New, more lightweight Dell XPS 14 and Dell XPS 16 laptops announced",
        "score": 15,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No dGPU though lol",
                "author": "bukeyolacan"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Alder Lake Pins",
        "score": 21,
        "text_content": "I’ve had these pins for about 4 years and some change but I’ve never found any info on them. Received them in a package paired with a blanket and matching mouse pad and some other goodies. Anyone have any info about these? Value, rarity, collectibles?",
        "comments": [
            {
                "raw_content": "They're part of promo merch packs that get sent out to giveaway entrants and media partners at the launch of each generation. Sometimes they end up on the Intel storefront, along with things like beach towels, shirts and water bottles, but the numbered sets are specifically promotional. They love making pins. Lots of them out there, for CPUs, GPUs, product lines and mascots like Chippy. I did a quick search and there are a few of these (non-numbered) up on ebay and etsy, along with the Rocket Lake set and some other mousepads, bags, Chipppy plushies and pins. Goodies, galore! Quite a neat thing to have, along with the other stuff you mention. It's not exactly rare art, but odds of someone else having something similar are, well... there are another 699, I suppose, but still!",
                "author": "AK-Brian"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD launches Ryzen AI 400: 12 Zen5 cores with up to 3.1 GHz RDNA3.5 and 60 TOPS NPU",
        "score": 244,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This just looks like a ryzen ai 300 rebrand no?",
                "author": "2cars10"
            },
            {
                "raw_content": "Brand new product, dGPU has no access to FSR4 upscaling, ray reconstruction, etc. Nice.",
                "author": "Shidell"
            },
            {
                "raw_content": "They STILL not putting RDNA4 into their APUs?",
                "author": "AVahne"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD launches Ryzen AI MAX+ 392 and MAX+ 388 “Strix Halo” APUs with Radeon 8060S graphics [VideoCardz]",
        "score": 104,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Should fit a good hole in the line up",
                "author": "Slasher1738"
            },
            {
                "raw_content": "I’d love a max+ 388 in an itx motherboard to make a killer 1080p steam machine. The 395’s cpu is overkill but an 8 core cpu + 8060s + 32gb ram would be awesome. And even better if amd decided to relast fsr4 int8.",
                "author": "User5281"
            },
            {
                "raw_content": "FSR4n't.",
                "author": "Star_king12"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Ryzen 7 9850X3D set to launch on January 29, French retailer claims",
        "score": 86,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "Are those prices Legit or speculation?",
                "author": "Perfect-Cause-6943"
            },
            {
                "raw_content": "No thanks. Iam in the zen6 x3d waiting camp...",
                "author": "Wuselon"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "The Ryzen 7 9850X3D is now official: AMD's fastest gaming CPU just got faster",
        "score": 11,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Ryzen 7 9850X3D launches this quarter",
        "score": 2,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "Introducing the New ASUS AMD 800 Series Lineup - Featuring the ROG Crosshair X870E Glacial, ROG Crosshair X870E Dark Hero, and ROG Strix, TUF Gaming, and ProArt NEO Motherboards across the X870E/X870/B850 Platforms Plus AIO Q-Connector Support with the ROG Strix LC IV AIO Cooler Series",
        "score": 1,
        "text_content": "https://preview.redd.it/mgzb02a1smbg1.jpg?width=2000&format=pjpg&auto=webp&s=a592623409503ba12b5957d790d1aaa8dedac11d Today, ASUS announced new 800 Series motherboards, featuring new flagship motherboards, refreshes of our existing ROG Strix, TUF Gaming, and ProArt motherboards, and a whole lot more. Wait, an AIO cooler? I wonder why that's in a motherboard post.... \\*I'm going to mark this as a WIP article because we currently don't have images or additional information about some of the boards, which we expect in a couple weeks. I will update this post when this information becomes available, but we have a lot to share currently\\* >I also want to point out that our AMD microsite is updated [here](https://www.asus.com/microsite/motherboard/amd-am5-ryzen-9000-x3d-x870e-x870-b850-b840/?utm_source=press_release&utm_medium=pr&utm_campaign=trick-out-your-build), and if you scroll down the page you'll see a section that says \"Choose Your X870E/X870... Motherboard\". Just below that header you'll see an option for \"Full Specs Download\", and you can download a PDF with several of these boards added. The rest will be added in the near future. Despite gaps in some of the information here, these are the boards that are part of our new AMD 800 Series lineup: * ROG Crosshair X870E Glacial * ROG Crosshair X870E Dark Hero * ROG Strix X870E-E Gaming WiFi NEO * ROG Strix X870E-A Gaming WiFi NEO * TUF Gaming X870-PRO WiFi 7 W NEO * ROG Strix B850-F Gaming WiFi7 NEO\\*\\* * ROG Strix B850-A Gaming WiFi7 NEO\\*\\* * TUF Gaming B850-PRO WiFi7 W NEO * ProArt B850-CREATOR WIFI Neo\\*\\* \\*\\*At this time I will not be including these motherboards, but may in a future update. # AIO Q-Connector and the ROG Strix LC IV AIO Cooler https://preview.redd.it/dm1ucin4smbg1.jpg?width=2000&format=pjpg&auto=webp&s=7f54449975316577eaf9a83b952707e835944aa6 When we began our BTF hidden-connector ecosystem to enable PC builders to create clean and cable-free builds, some doubted whether it would be something people wanted to use. With our latest BTF Gen 2.5 designs offering new ways to build a BTF PC and, frankly, some of the similar designs you'll see at CES from other brands, the momentum continues to pickup. But what about other parts of your PC that leave unsightly wires, such as your AIO? Fans now utilize magnetic connectors to reduce cabling, but you still have pesky 4pin AIO and USB connectors to deal with, right? Yeah, we're tired of them too. Enter the AIO Q-Connector present on select new AM5 motherboards and the ROG Strix LC IV AIO Cooler, the first cooler to take advantage of this feature. https://preview.redd.it/bv688l27smbg1.jpg?width=2000&format=pjpg&auto=webp&s=d6476c3bbfb8198456609515d54388c02cb7f152 These motherboards feature exclusive Q-Connector pins that allow you to connect compatible CPU coolers without the need for additional cables. Through these metal contact points, ROG Strix LC IV series AIO CPU liquid coolers receive power and control signals for the pump, ARGB elements, and (with select models) the display. https://preview.redd.it/c2dspy4xsmbg1.jpg?width=2000&format=pjpg&auto=webp&s=b20df52bd737273f63d8820b04f92b884b00b443 There's someone out there who will say that it could have been made better since you still have to deal with the fan wires. We thought of that too. The AIO Q-Connector passes along the PWM signals to the fans through a cable hidden inside the tube sleeving. That's right, no wires. The motherboards that will support this at launch are: * ROG Crosshair X870E Glacial * ROG Crosshair X870E Dark Hero * ROG Strix X870E-E Gaming WiFi7 NEO * ROG Strix X870E-A Gaming WiFi7 NEO The ROG Strix LC IV Series will include both SLC (short tube length), LC, and an LC version that replaces the 5.08\" LCD display with an ARGB logo atop the pump housing. Note that this AIO cooler also includes a separate cable in case you install it to a motherboard without the AIO Q-Connector. These are expected to be available in Q2. # New AMD 800 Series Lineup Features Before we dive into each motherboard, we will cover the similar features and improvements that you can expect with these boards. We continue to move top-tier features across the boards such as AEMP, NitroPath DRAM technology and DIMM Fit, while including USB4, WiFi7 and new EZ PCDIY functions. **Optimized PCIe Lanes** \\- One of the common complaints about modern motherboards is that due to lane-sharing, your primary PCIe slot often is lowered to x8/x8 if you use your second CPU-derived PCIe slot or a PCIe Gen5 M.2. With our new series, we've optimized the lane-sharing to include both M.2 and USB4 ports to give you greater flexibility to keep your first PCIe slot running at x16. With the ROG Strix X870E-E Gaming WiFi7 Neo, for instance, you’ll be able to achieve the full bandwidth of the PCIe 5.0 x16 slot with two PCIe 5.0 M.2 SSDs and three PCIe 4.0 M.2 SSDs installed. **Server-grade PCB Design -** Select motherboards utilize an ultra-low-etch manufacturing process, PCB back-drilling, 2-ounce copper power planes, and an 8-layer design. These processes ultimately improve memory compatibility, lead to better stability, allow for larger capacities, and improve overclocking potential. **64MB BIOS ROM Now Preinstalled with WiFi Drivers** \\- Higher-capacity memory on the BIOS allows for more complex BIOS designs, out-of-the box support for the latest AMD CPUs, but it also impacts how many drivers can be stored and read by the OS during installation. By moving from 32MB to 64MB, the motherboard can include storage space for WiFi drivers. Now, when you go to install your OS, the drivers will be stored on the board making installation much simpler and faster. **3D Vapor Chamber M.2 Heatsink** \\- Select models offer a taller M.2 heatsink with a larger heat dissipation area through a 3D vapor chamber with a tool-free design. **More USB 2.0 Ports** \\- Select motherboards will now feature three USB2.0 ports (up from 2) to connect more internal devices. **USB Type-C Ports up to 60W Quick Charge 4+** \\- Select motherboards will feature 60W ports that can quickly charge your smartphone or other devices to make your PC a more convenient charging station. **New EZ Mode BIOS Interface** \\- We're always looking for ways to improve the main BIOS for novices and advanced users, and with the new EZ Mode and Essential Mode options both can look forward to quickly configuring monitoring and commonly used functions. For example with Essential Mode, you can view key system information and access the most commonly-used overclocking functions without having to go into the more granular Advanced Mode. https://preview.redd.it/xtq1z9n1umbg1.jpg?width=2000&format=pjpg&auto=webp&s=4b6f355d5998161e88c9ef3e28bc1573f958fa13 # New AMD 800 Series Motherboards **ROG Crosshair X870E Glacial** https://preview.redd.it/caje91uqtmbg1.jpg?width=2000&format=pjpg&auto=webp&s=2aa0ce9f1ab35856b96c9140281a53c80798a3e9 Flagship performance meets AI optimization in the ROG Crosshair X870E Glacial, engineered for extreme performance and next-generation overclocking. With 24 (110A)+2(110A)+2 power stages, Dynamic OC Switcher, and Core Flex, it delivers stable, efficient power. DDR5 memory enhanced by AEMP and NitroPath DRAM Technology ensures peak speed and reliability. **Seven M.2 slots** \\- including dual PCIe 5.0 onboard, an additional two PCIe 5.0 via Hyper M.2, and two PCIe 4.0 via Q-DIMM.2 - offer expansive high-speed storage. Dual USB4 ports, dual USB 20Gbps Type-C front connectors (one of which features Quick Charge 4+ (up to 60W)) twelve USB 10Gbps ports, and dual Realtek 10G Ethernet cover all connectivity needs. ASUS-exclusive AI features, such as AI Cache Boost, ASUS AI Advisor, and AI Overclocking streamline setup and maximize performance, while the full-color 5-inch LCD simplifies system monitoring. PCIe Slot Q-Release Switch, AIO Q-Connector, and SafeSlots further ensure an effortless installation experience. Let's talk about a few of these features in detail: **ROG Hyper M.2 Card and ROG Q-DIMM.2 -** ROG-designed cards for M.2 SSDs are not new, but here we have new cards designed to get the most out of PCIe Gen5 M.2 and PCIe Gen4 M.2 SSDs, respectively, as each is capable of supporting two SSDs. This saves space on the board and gives a huge variety of options to maximize your storage. https://preview.redd.it/kabzfm1ztmbg1.jpg?width=2000&format=pjpg&auto=webp&s=7709eddb1aea04286050f0bc13eb714b1b8a62b5 **Optimized PCIe Lane Sharing -** Enjoy the full bandwidth of the first PCIe 5.0 x16 slot and two PCIe 5.0 M.2 slots while still being able to use the second PCIe x16 slot at PCIe 3.0 x4. Need the slots for a multi-GPU setup? No problem, just switch the lanes to x8 / x8 in the BIOS. https://preview.redd.it/b1siecfjumbg1.png?width=4122&format=png&auto=webp&s=3acbee4b369bda651d0a27d3c33269815ffd880a **Dual Realtek 10G Ethernet Ports -** For those who need massive bandwidth for networking and need a board that gives you more than one 10G port. Creators, NAS users, AI workflows, media consumers: this is board will keep up. **Full-Color 5\" LCD Screen -** Show exclusive ROG animations, system information and even personalized services through Armoury Crate. **ROG Memory Q-Fan -** A special memory cooling fan is included that connects to the board via POGO pins to help solidify DDR5 stability and unleash memory overclocking. No screws required. https://preview.redd.it/yi0qt7dbumbg1.jpg?width=2000&format=pjpg&auto=webp&s=60509d856bc331907924f4f9a14dbb762555c398 **90-Degree Power Connectors -** The motherboard utilizes standard and 90-degree connectors for simplicity and to minimize visible cable management, especially for the 24-pin ATX connector. **New PCIe Q-Release Switch -** A new Q-Release switch is designed to lock and unlock your PCIe cards via the same switch. Move the switch up to unlock the top PCIe x16 slot or move it down to unlock the second PCIe x16 slot. **Other notable features:** * EATX Form-factor * Server-grad ultra-low-etch PCB process * AIO Q-Connector, M.2 Q-Latch, M.2 Q-Release, Q-Antenna * 3D Vapor Chamber M.2 Heatsink * Included fan splitter cables allow you to run up to 13 case fans * Extreme OC kit, including LN2 mode * WiFi 7, BT5.4, 2x USB4 ports, 12x USB10Gbps ports for extensive connectivity options * 60W Quick Charge 4+ via front panel USB Type-C * Magnetically attached armor pieces protect the board until you need to access certain areas...and then you can re-cover multiple areas. The ROG Crosshair X870E Glacial is expected to launch towards the end of January, but pre-orders are expected to go up later this week. * Product page: [https://rog.asus.com/motherboards/rog-crosshair/rog-crosshair-x870e-glacial/](https://rog.asus.com/motherboards/rog-crosshair/rog-crosshair-x870e-glacial/) **ROG Crosshair X870E Dark Hero** https://preview.redd.it/ddkjyfo6tmbg1.jpg?width=2000&format=pjpg&auto=webp&s=3e588013f6e9d12a398587dc22f4576e0441c9ac Engineered for stealth and uncompromising power, the ROG Crosshair X870E Dark Hero balances advanced thermal management with a refined design. Two PCIe 5.0 M.2 slots and three PCIe 4.0 M.2 slots provide versatile storage options, while WiFi 7, dual USB4 ports, and front-panel USB Type-C connectors ensure fast, reliable connectivity. AI Cache Boost, ASUS AI Advisor, and AI Overclocking streamline performance, complemented by Polymo Lighting II and Aura Sync RGB for full system customization. To help you unleash your top-end AMD Ryzen 9000 Series CPU, it boasts an upgraded power solution with 20(110A)+2(110A)+2 power stages, ProCool II power connectors, MicroFine alloy chokes, and premium 10K black metallic capacitors. To keep this beefy power solution cool, this board includes massive heatsinks integrated with the I/O cover. https://preview.redd.it/4z5f5budtmbg1.jpg?width=2000&format=pjpg&auto=webp&s=98f46268282ea6804c3b537a368cb78f9f2512af **10G and 5G Ethernet Ports -** While it's not up to the bandwidth of the ROG Crosshair X870E Glacial, those who need less than the maximum bandwidth won't be disappointed with two extremely fast network connections. **Other notable features:** * NitroPath DRAM Technology supports up to 4x DIMM, 256GB DDR5, and up to 9600+(OC) * Server-grad ultra-low-etch PCB process * AIO Q-Connector, M.2 Q-Latch, M.2 Q-Release, Q-Antenna * 3D Vapor Chamber M.2 Heatsink * Extreme OC kit, including LN2 mode * WiFi 7, BT5.4, 2x USB4 ports, 9x USB10Gbps ports for extensive connectivity options * 3x USB 2.0 Headers * 60W Quick Charge 4+ via front panel USB Type-C * Metal Backplate The ROG Crosshair X870E Dark Hero is expected to launch towards the end of January, but pre-orders are expected to go up later this week. * Product page: [https://rog.asus.com/motherboards/rog-crosshair/rog-crosshair-x870e-dark-hero/](https://rog.asus.com/motherboards/rog-crosshair/rog-crosshair-x870e-dark-hero/) # ROG Strix Neo Motherboards ROG Strix boards cater to the gamers of the world who want more, giving them high-performance designs ready to game hard and look good in the process. To meet the needs of today’s gamers, we’re releasing four new ROG Strix Neo series motherboards: the ROG Strix X870E-E Gaming WiFi7 Neo, the ROG Strix X870E-A Gaming WiFi7 Neo, the ROG Strix B850-F Gaming WiFi7 Neo, and the ROG Strix B850-A Gaming WiFi 7 Neo. Select boards in this range also include features such as NitroPath DRAM technology, asynchronous clock, AI Cache Boost, and AIO Q-Connector. **ROG Strix X870E-E Gaming WiFi7 NEO** https://preview.redd.it/k72eyarpumbg1.jpg?width=2000&format=pjpg&auto=webp&s=4199009e9dc643d42402b23ae271565e17af2843 ROG Strix -E models always seem to be one of the best values for your money since it steals several features from the higher-end ROG Crosshair boards while avoiding other features and specs that gamers don't always need to help keep the cost down. This board is no exception. Featuring an 18(110A)+2(110A)+2 power architecture backed by an eight-layer design and two-ounce copper planes, the board will hold up if you have dreams of pushing your overclocking higher than many motherboards. With the embedded Q-CODE display and an easy-to-reach CLR CMOS button on the rear I/O panel, you can quickly restore your BIOS to defaults. **Optimized PCIe Lane Sharing -** The ROG Strix X870E-E Gaming WiFi7 Neo is tuned with gaming in mind, so you can install more M.2 SSDs without limiting the bandwidth afforded to your graphics card. The second PCIe x16 is rated at PCIe 4.0 x16 (@x4). **WiFi 7, BT5.4 and 5G Ethernet Port -** Built for fast connections, you'll be ready for blazing fast speed and low-latency gaming. **Lots of USB -** 2x USB4 40Gbps Type-C, 11x USB 10Gbps ports on the rear panel (including one Type-C with 30W PD), but you also have 3x USB 2.0, 2x USB 20Gbps Type-C front panel ports, and 4x USB 5Gbps Type-A ports. **Polymo Lighting** \\- The I/O shroud features our Polymo Lighting with a multi-dimensional lighting module that provides dynamic RGB illumination for the ROG logo. Customizable through ASUS Aura Sync. **Other notable features:** * NitroPath DRAM Technology supports up to 4x DIMM, 256GB DDR5 * AIO Q-Connector, M.2 Q-Latch, M.2 Q-Release, Q-Antenna, PCIe Q-Release The ROG Strix X870E-E Gaming WiFi7 Neo availability is TBD currently, but will be updated when I have the information. * Product page: [https://rog.asus.com/motherboards/rog-strix/rog-strix-x870e-e-gaming-wifi7-neo/](https://rog.asus.com/motherboards/rog-strix/rog-strix-x870e-e-gaming-wifi7-neo/) **ROG Strix X870E-A Gaming WiFi7 NEO** https://preview.redd.it/pbsllvbwumbg1.jpg?width=2000&format=pjpg&auto=webp&s=e1974dabf08715f6266de703aa1859c082d78652 Sharing the white aesthetic of the ROG Crosshair X870E Glacial, the ROG Strix X870E-A Gaming WiFi7 Neo has a more than a few upgrades over its predecessor. For one, this Neo board features the X870E chipset. But more importantly it includes NitroPath DRAM Technology, asynchronous clock, Dynamic OC Switcher and Core Flex to help push memory speeds over 9000+ MT/s with overclocking. Storage options have also increased with a pair of PCIe Gen5 M.2 and PCIe Gen4 M.2 slots each, as well as an upgrade to four SATA ports. **WiFi 7, BT5.4 and 5G Ethernet Port -** Built for fast connections, you'll be ready for blazing fast speed and low-latency gaming. **Lots of USB -** 2x USB4 40Gbps Type-C, 6x USB 10Gbps ports on the rear panel (including one Type-C with 30W PD), but you also have 3x USB 2.0, 1x USB 20Gbps Type-C and 1x USB 5Gbps Type-C front panel ports, and 4x USB 5Gbps Type-A ports. **Other notable features:** * NitroPath DRAM Technology supports up to 4x DIMM, 256GB DDR5 * AIO Q-Connector, M.2 Q-Latch, M.2 Q-Release, Q-Antenna, PCIe Q-Release The ROG Strix X870E-A Gaming WiFi7 Neo availability is TBD currently, but will be updated when I have the information. * Product page: [https://rog.asus.com/motherboards/rog-strix/rog-strix-x870e-a-gaming-wifi7-neo/](https://rog.asus.com/motherboards/rog-strix/rog-strix-x870e-a-gaming-wifi7-neo/) # TUF Gaming 800 Series W NEO Motherboards https://preview.redd.it/kfdnt062vmbg1.png?width=696&format=png&auto=webp&s=24a00b61498b4feb773190ab7cbcf26db2bacd07 TUF Gaming motherboards have generally become the place to start when putting together a straightforward build for gaming. They're built well, easily cover the specs and performance of the most demanding gaming PCs, and still leave room for a bit extra. And yes, our MB teams have been knocking it out of the park lately with the TUF Gaming aesthetic in both black and white. With options in both the X870 and B850 families, you have a great choice between a board that easily handles gaming, and a board that's ready for more storage, more tinkering, and more cooling. Each of these boards also include overclocking features such as asynchronous clock, Dynamic OC Switcher, and Core Flex. Built with an eight-layer PCB, these boards can enjoy better compatibility with premium memory kits and better stability if you choose to overclock. EZ PCDIY features are packed on these boards, including our M.2 Q-Latch, M.2 Q-Release, and a physical PCIe Slot Q-Release lever. Both boards also include a rear-I/O panel CLR CMOS button making it easier for novices to learn about overclocking, as well. **TUF Gaming X870-Pro WiFi7 W Neo** https://preview.redd.it/lns4vbkavmbg1.png?width=800&format=png&auto=webp&s=91038ac02161d1abf07ace2e7cb27844e6ba09e4 As the higher-end of the two boards, the TUF Gaming X870-Pro WiFi7 W Neo provides you with a bit higher ceiling on its power design, network ports, USB4 options, and an extra PCIe M.2 Gen5 slot. Where this board differs from the previously mentioned ROG Strix Neo motherboards is that you have fewer USB 10Gbps rear ports, one fewer USB 20Gbps Type-C and USB 5Gbps Type-A front panel headers each, several Q-Design features, but nothing that gets in the way of setting up a powerful gaming system or makes the installation process notably more difficult. **WiFi 7, BT5.4 and 5G Ethernet Port -** Built for fast connections, you'll be ready for blazing fast speed and low-latency gaming. **Plenty of USB -** 2x USB4 40Gbps Type-C, 3x USB 10Gbps ports on the rear panel, 4x USB 5Gbps, but you also have 3x USB 2.0, 1x USB 20Gbps Type-C (30W PD/PPS Fast-charge), 1x USB 5Gbps Type-A front panel port, and 3x USB 2.0 front panel ports. **Other notable features:** * 4x DIMM, 256GB DDR5 * M.2 Q-Latch, M.2 Q-Release, Q-Antenna, PCIe Q-Release lever * 3x ARGB Headers * 1x (each) CPU Fan Header, CPU OPT Fan Header, AIO Pump Header, W\\_Pump+ Header * 4x Chassis Fan Header The TUF Gaming X870-Pro WiFi7 Neo availability is expected in mid-Q1 currently. * Product page: [https://www.asus.com/motherboards-components/motherboards/tuf-gaming/tuf-gaming-x870-pro-wifi7-w-neo](https://www.asus.com/motherboards-components/motherboards/tuf-gaming/tuf-gaming-x870-pro-wifi7-w-neo) **TUF Gaming B850-Pro WiFi7 W Neo** https://preview.redd.it/imgxv24ivmbg1.png?width=800&format=png&auto=webp&s=015be21e23d1e1628a07f1524360af4336bb15f2 As a B850 motherboard, you expect that there will be some concessions around lane-sharing and certain other features, and it's no surprise that there are a few compared to its bigger brother. However, a B850 is still no slouch when it comes to performance or providing features for core PC-building. If you're looking for a B850 board like the TUF Gaming B850-Pro WiFi7 W Neo, then you probably have a pretty clear idea about what you want to include in your system and you don't need slots or ports that you won't end up using. Comparatively, you have one less PCIe Gen5 M.2 slot, but you pick up a pair of PCIe 4.0 x1 slots, which can be used to add an expansion card if you need additional USB or other expansion ports. Networking is reduced to 2.5Gbps, which is still much faster than many use for a wired connection currently, and you still have WiFi7 and BT5.4 for connectivity. Ultimately, you still have 10x rear-panel USB ports, including 2x USB 10Gbps Type-C ports. A USB 20Gbps Type-C front-panel connector more than suffices for many chassis, currently, and you still have a standard USB 5Gbps front panel port to go with 3x USB2.0 ports. **Other notable features:** * 4x DIMM, 256GB DDR5 * M.2 Q-Latch, M.2 Q-Release, Q-Antenna, PCIe Q-Release lever * 3x ARGB Gen2 Headers * 1x (each) CPU Fan Header, CPU OPT Fan Header, AIO Pump Header * 4x Chassis Fan Header The TUF Gaming B850-Pro WiFi7 Neo availability is currently TBD, but will be updated when I have additional information. * Product page: [https://www.asus.com/motherboards-components/motherboards/tuf-gaming/tuf-gaming-b850-pro-wifi7-w-neo](https://www.asus.com/motherboards-components/motherboards/tuf-gaming/tuf-gaming-b850-pro-wifi7-w-neo) As noted above, some information and images aren't currently available right now, so I plan to make some updates and/or update images over the next couple of weeks, including availability dates/times. Let us know in the comments below your thoughts about these new motherboards!",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "The 11 large U.S. cities where home prices are expected to rise the most in 2026",
        "score": 112,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Still trying to convince young Americans to come take the bags off the hands of the retired and south-bound midwesterners, huh? We don’t want your frozen, out of maintenance homes in Toledo, Akron, Peoria, or Fort Wayne. Sell ‘em to fucking Blackrock, like they did the future of America.",
                "author": "Nuvuser2025"
            },
            {
                "raw_content": "I believe modest price growth in the Midwest is possible. Can’t convince me everywhere else will keep inflating…",
                "author": "ResponsibleValue7745"
            },
            {
                "raw_content": "Home prices are expected to rise by about 2.2% nationally in 2026, but some large U.S. cities — mostly in the Midwest and Northeast — could see prices climb much faster. That’s according to a recent Realtor.com forecast, which projects “a more balanced” housing market as higher inventory slows overall price growth. Even so, the moderation isn’t expected to be evenly felt. “The Midwest and Northeast have maintained strong demand despite the broader slowdown, largely due to persistent inventory scarcity,” Hannah Jones, senior economic research analyst at Realtor.com, tells CNBC Make It. While many markets in the South and West are seeing price growth flatten or turn negative as new construction adds supply, cities in the Midwest and Northeast have added fewer homes in recent years, which has helped kept prices moving higher, according to Realtor.com. Here are the 11 large U.S. cities expected to see the biggest home-price increases in 2026: 1. Toledo, Ohio Expected 2026 price growth: 13.1% Median home price: $199,900 2. Syracuse, New York Expected 2026 price growth: 12.4% Median home price: $298,950 3. Scranton–Wilkes-Barre–Hazleton, Pennsylvania Expected 2026 price growth: 10.9% Median home price: $260,000 4. Rochester, New York Expected 2026 price growth: 10.3% Median home price: $256,900 5. Hartford–West Hartford–East Hartford, Connecticut Expected 2026 price growth: 9.5% Median home price: $429,000 6. Baltimore–Columbia–Towson, Maryland Expected 2026 price growth: 8.3% Median home price: $375,000 7. New Haven–Milford, Connecticut Expected 2026 price growth: 7.7% Median home price: $439,000 8. Winston-Salem, North Carolina Expected 2026 price growth: 7.7% Median home price: $342,899 9. Albany–Schenectady–Troy, New York Expected 2026 price growth: 7.5% Median home price: $419,900 10. Columbia, South Carolina Expected 2026 price growth: 7.2% Median home price: $303,300 11. Milwaukee–Waukesha–West Allis, Wisconsin Expected 2026 price growth: 7% Median home price: $379,000",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Update: The Housing Bubble and Mortgage Debt as a Percent of GDP",
        "score": 49,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This says the United States economy is heavily financialized, which further confirms my suspicion that it is being propped up by the wealth effect among those in the top 10% of incomes who are earning significant stock returns (roughly, singles or couples who net $200-250k). Increasing home values only reinforces the delusion of wealth creation.",
                "author": "FurryFriendsUnite"
            },
            {
                "raw_content": "What happened after 2003?",
                "author": "Self_Serve_Realty"
            },
            {
                "raw_content": "Almost everyone who stayed on the sidelines since 2022 waiting for a housing crash is entering the market to buy, they are tired of waiting and there is an opportunity cost for them & their families by not living in their dream home.",
                "author": "ThemeBig6731"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Traders can now speculate on U.S. housing prices through Polymarket",
        "score": 38,
        "text_content": "I've seen a lot of posts over the years here asking, \"How can I short the residential housing market?\" type questions... well, here ya go. You can now speculate on the direction of home prices with Polymarket using Parcl's housing data. Looks like they are first rolling out 5 different metro and city markets to predict including the US median home price. Here are the first US housing market predictions you can speculate on. They plan on rolling out more in the future: - What will the median home value in the US be on February 1? - What will the median home value in the Austin, Texas Metro area be on February 1? - What will the median home value in the San Francisco Metro area be on February 1? - What will the median home value in Miami be on February 1? - What will the median home value in New York City be on February 1? - What will the median home value in the Los Angeles Metro area be on February 1? https://parcl.co/blog/parcl-x-polymarket-launch-real-estate-prediction-markets",
        "comments": [
            {
                "raw_content": "Is this another Kalshi?",
                "author": "Hav0c_wreack3r"
            },
            {
                "raw_content": "Here is a [screenshot of the current results.](https://i.imgur.com/mgUw6qJ.png) Pretty short timeline for housing market predictions.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "They really want us gambling our money on everything, don’t they? Folks, please don’t fall for this crap. It’s a road to ruin.",
                "author": "Nuvuser2025"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Did America’s biggest rental bubble just pop?",
        "score": 81,
        "text_content": "",
        "comments": [
            {
                "raw_content": "But, I was told rents never go down.",
                "author": "NRG1975"
            },
            {
                "raw_content": "Indianapolis metro is likely to pop. Complexes that opened a year and half ago only have around 30 percent occupancy. They built complexes in the middle of corn fields near the interstate and are trying to market them as luxury properties.",
                "author": "4PurpleRain"
            },
            {
                "raw_content": "Good people are leaving there because they can’t afford it. Imagine that",
                "author": "VendettaKarma"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage Brokers Boom While Borrowers Burn: The Hidden Cost of 'Free' Home Loan Fixers",
        "score": 39,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Are people just that stupid? Why buy now anyway. Market is looking weak.",
                "author": "Dry-Interaction-1246"
            },
            {
                "raw_content": "Are there limits on higher origination and closing fees built into the loan?",
                "author": "Self_Serve_Realty"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Boston Dynamics & Google DeepMind Form New AI Partnership to Bring Foundational Intelligence to Humanoid Robots | Boston Dynamics",
        "score": 577,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I sometimes wonder if Google regrets selling them.",
                "author": "bentendo93"
            },
            {
                "raw_content": "À bit weird https://preview.redd.it/koqb4fqpvlbg1.jpeg?width=1440&format=pjpg&auto=webp&s=2bc297825b0fa5b13f17aee452375543f15ff91e",
                "author": "GraceToSentience"
            },
            {
                "raw_content": "Oh shit. Now that’s a interesting partnership because both of those labs have excellent people and leaders.",
                "author": "bot_exe"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "We have reached THIS phase of android integration into society",
        "score": 865,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I like how they keep playing but the robot is like \"Yeah enough of that, let's clap and end this.\" LOL",
                "author": "puzzleheadbutbig"
            },
            {
                "raw_content": "![gif](giphy|VGKtXfGNwH6cLifbDY|downsized)",
                "author": "Head_Accountant3117"
            },
            {
                "raw_content": "No we haven't. This is clearly at some kind of tech event, of course the people there are going to be happy to see a robot perform pre-programmed dances. It's neat, but no.",
                "author": "Cobalt81"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Nvidia launches Alpamayo, open AI models that allow autonomous vehicles to 'think like a human'",
        "score": 118,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They invented KITT. My childhood dream is complete.",
                "author": "Illustrious_Image967"
            },
            {
                "raw_content": "How much is Tesla stock going to drop now that it’s clear they don’t have a hold on “alien technology”",
                "author": "ElectricalGene6146"
            },
            {
                "raw_content": "I look forward to some asshole putting it in a go-kart on youtube.",
                "author": "IReportLuddites"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "VP of Research Leaves OpenAI",
        "score": 400,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why does he sign off with “my strawberries”?",
                "author": "Californianpilot"
            },
            {
                "raw_content": "Ideas of *types of research that are hard to do at OpenAI*?",
                "author": "RetiredApostle"
            },
            {
                "raw_content": "'Types of research that are hard to do at OpenAI' Pay close attention to what this man does next.",
                "author": "Gubzs"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Boston Dynamics' Atlas humanoid robot is now a product and heading to factories in 2028",
        "score": 168,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They have the best design imo",
                "author": "Unlikely-Complex3737"
            },
            {
                "raw_content": "Getting a job in a factory is far more important than \"looking human.\" The real challenge lies in stability, maintenance, and how to stop the machine when it malfunctions. 2028 isn't about how smart it is, but whether it can operate normally every day. 😅",
                "author": "Scary-Aioli1713"
            },
            {
                "raw_content": "[removed]",
                "author": "None"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "LFM2.5 Released: Liquid AI brings \"frontier-grade\" reasoning with 2x speedup over Qwen3 and Llama 3.2",
        "score": 27,
        "text_content": "**Liquid AI** has officially released **LFM2.5**, a next-generation 1.2B model (5 open weight models) that outperforms almost every transformer-based model in its weight class while running significantly faster on consumer CPUs. **2x CPU Throughput:** Built on a **new** hybrid architecture, LFM2.5 delivers 200% higher prefill and decode speeds on standard CPUs compared to Llama 3.2 and Qwen3. **Efficiency at 4-Bit:** Optimized specifically for 4-bit quantization. This isn't a small model, designed to **run** on smartphones, laptops and vehicles without needing a cloud connection. If a 1.2B model can now handle complex instruction following and math on a laptop CPU, the era of **Intelligence Abundance** is officially localized. **Source:** [Liquid AI Blog](https://www.liquid.ai/blog/introducing-lfm2-5-the-next-generation-of-on-device-ai) **Hugging Face:** [LFM2.5 Collection](https://huggingface.co/collections/LiquidAI/lfm25)",
        "comments": [
            {
                "raw_content": "W",
                "author": "Psychological_Bell48"
            },
            {
                "raw_content": "How small would a model have to be for current flagship phones to run it",
                "author": "Far-Telephone-4298"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Current State of the American Robotics Industry",
        "score": 124,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This sub is slowly becoming Tiktok.",
                "author": "Josh_j555"
            },
            {
                "raw_content": "should be able to gen southpark episodes by now",
                "author": "kaggleqrdl"
            },
            {
                "raw_content": "https://deepmind.google/models/gemini-robotics/ https://youtu.be/n6ISdRkS37I?si=jHtb6dn2tm6IVDdr",
                "author": "WiseHalmon"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Results on new benchmark PostTrainBench: tests how much models can improve small LLMs with a fixed time and compute budget",
        "score": 47,
        "text_content": "https://posttrainbench.com/ Each model is given access to an h100 instance and 10 hours to improve Qwen3 4b, Smollm3-3b, and Gemma 3 4b as much as possible on AIME, GPQA, BFCL, GSM8k, and Humaneval.",
        "comments": [
            {
                "raw_content": "3 pounds of grey matter for the win",
                "author": "yollobrolo"
            }
        ],
        "subreddit": "singularity"
    }
]