[
    {
        "post_name": "Doing a little bit of trolling tonight",
        "score": 701,
        "text_content": "",
        "comments": [
            {
                "raw_content": "One of the greatest things ever. By law, must be stored and displayed by the US government for infinity?",
                "author": "magnokor"
            },
            {
                "raw_content": "😆😅🤣😂😆😅🤣😂 President Trump is a master troll 🤣",
                "author": "CrankyCrab"
            },
            {
                "raw_content": "As someone from Illinois, this is gold. Hahahahahaha",
                "author": "jeb_is_a_mess"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Shrimps?",
        "score": 477,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I thought for sure this had to be AI… But apparently it isn’t. Amazing 😂",
                "author": "MAGA9428"
            },
            {
                "raw_content": "xenoshrimp",
                "author": "Johnrgalt"
            },
            {
                "raw_content": "\"Hello my baby, hello my darling, hello my ragtime gaaaaaaalll\"",
                "author": "TheOneWhoKnocks"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Missouri House committee on redistricting just PASSED the new Congressional map that will WIPE AWAY a Democrat seat in favor of Republicans in 2026. Time for FULL PASSAGE - and EVERY red state who can do this must follow suit. Florida, Indiana, Ohio are NEXT!",
        "score": 1207,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Awesome. Now stop electing RINOS to fill these seats. MAGA or nothing!",
                "author": "ThorsonTT"
            },
            {
                "raw_content": "Get rid of that little blue piece of shit and then let's talk.",
                "author": "TrumpWonByALandslide"
            },
            {
                "raw_content": "Democrat's 2030 Census skewing plans are falling apart right before their eyes. GO GO GO",
                "author": "McFatty7"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "JD spitten truth!",
        "score": 1843,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Im likin him more every day",
                "author": "Gunmolester"
            },
            {
                "raw_content": "He’s talkin to the R’s is he ?",
                "author": "Lincoln6ech0"
            },
            {
                "raw_content": "Anyone advocating mutilating kids is ineligible to be taken seriously on any topic whatsoever. They npc themselves.",
                "author": "least_counties_ever"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "STOP IT! 😂🤣😂",
        "score": 914,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Are they serving pie for dessert? 🥧",
                "author": "ItsFunToSay-M-A-G-A"
            },
            {
                "raw_content": "It would funny if was satire but it's not.",
                "author": "Tradstew"
            },
            {
                "raw_content": "Bill Gates needs to be publicly hanged by hooks through his ribcage.",
                "author": "MoreVanceMemes"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: In a stunning revelation, newly unveiled emails from the Joe Biden White House show that Biden himself likely did not actually write or sign off on the pardons - \"It’s unclear if Joe Biden himself was even consulted before THOUSANDS of pardons went out.\"",
        "score": 1429,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good. So now Trump can more or less completely ignore everything the biden admin did and will have written in stone evidence to sweep the inevitable lawsuits and activist judge injunctions away. BUT. Don't expect any real arrests until after the mid terms because one its going to take a while to build a case the wall of lawyers billions of dollars thick the demons have in reserve can't beat. Two, sweeping the mid terms are CRUCIAL if we want the last two years of Trumps term to be fully codified into law. We waited years or decades to see the demons hang we can wait another year and a half.",
                "author": "SquiggyMcPepe"
            },
            {
                "raw_content": "He was on a fucking beach for a week straight on some sort of medical treatment, how could anyone pretend not to know he was AWOL in the WH for more than just pardons?",
                "author": "CMDRConanAAnderson"
            },
            {
                "raw_content": "\"Tyeesha\"",
                "author": "FatigueIsReal"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Completely. Trust the science on this.",
        "score": 771,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There's a VAXXX that eliminates mask wearers.",
                "author": "AfterGlow"
            },
            {
                "raw_content": "This means Antifa riot season has arrived",
                "author": "Whoopies_tds"
            },
            {
                "raw_content": "Tell the commie gobment to fuck off.",
                "author": "ColonelKlink"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "So stfu!!",
        "score": 1397,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Diversity is not a strength when your culture is the superior one Diversity would be a strike for the people of India or the Middle East or Africa or South America.. giving them diversity by putting what European culture and ideals in there. It would make them significantly better Diversity is not a strength for America or Europe too It is a weakness that makes them worse yeah The country that built the world doesn't need the people that destroyed it to make itself better",
                "author": "Hillaryizgay"
            },
            {
                "raw_content": "It's not about enriching culture, it's about destroying it, because they know a culturally strong populace is difficult to control. Once you realize that, everything makes sense. It's all about reducing individual power in order to reduce collective power. That's why Bill Clinton destroyed manufacturing in America. If things aren't made in America, worker strikes don't really affect anything, and the populace is kept poor, which means less individual power, which means less collective power. They flood in immigrants for the same reason. The more groups there are with different cultures and different values, the smaller the collective power of those groups, and the less those in power are beholden to all groups, in the long run. Democrats don't have to keep any promises to immigrants, because they didn't actually make any promises to them, all the promises that were broken were made to existing Americans, and so the immigrants have no actual skin in the game when it comes to the fulfillment of those promises. Sure, the Democrats give them a bunch of \"free\" shit, but they can also cut it off at any time, and that's the carrot on the stick. And they routinely do cut it. When Biden made inflation go through the roof, that by proportion reduces the value of entitlements. Number value may be the same, but what that number buys sure isn't. And these immigrants also don't understand what it is to be American, which the Democrats/uniparty/globalists love. They may hear about things like rights, but they don't truly understand them or the underlying foundations of them, which is why it's much easier to take that away from them if need be (especially when they technically never constitutionally had it in the first place). What it ultimately means is evil people in power get people they can control with fear, which is then used as a bludgeon to instill fear in others, and the country becomes soo diluted with outsiders that half the country has no real concept of the principles America was built on, and that's the whole point. Once you see it, it's soo obvious that the assessment can't be anything else, even if they do display incompetence. Just like fake news all gets their scripts, so do the politicians. The end game is a totalitarian dystopia that they want people to believe is a utopia.",
                "author": "preferredfault"
            },
            {
                "raw_content": "White men did everything during the past 500 years, while most civilizations collapsed left and right - China, India, Persia, Maya, Inca we have achieved, for the first time for humanity, the \"escape velocity\" so to speak.",
                "author": "cptKloss6"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "2 armed Venezuelan F-16 fighter jets conducted an aggressive overflight of the US warship USS Jason Dunham Thursday, per",
        "score": 877,
        "text_content": "",
        "comments": [
            {
                "raw_content": "An even bigger question is why the FUCK other countries have shit that our taxpayers developed? Why the fuck does Venezuela have F16's? The people who sold that shit outside of this nation should be hung on live television for treason.",
                "author": "CAPTAIN_TENDY_PLATE2"
            },
            {
                "raw_content": "Flying near a warship should be instant death. Flying over should be guaranteed.",
                "author": "TheMAGAnificent"
            },
            {
                "raw_content": "Imagine thinking you're a badass while showing off the weapon that your enemy developed and sold to you.",
                "author": "bigdickhangsright"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: ICE agents are set to SURGE into Chicago IMMINENTLY for an immigration crackdown, per Fox This is in ADDITION to the National Guard who have been requested by DHS",
        "score": 1174,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Gonna need heavy artillery to match the kinds of weapons criminals have in the city with the nation's strictest gun laws.",
                "author": "CMDRConanAAnderson"
            },
            {
                "raw_content": "ICE ICE BABY",
                "author": "VirTW"
            },
            {
                "raw_content": "Wish they wouldn’t let this leak out. This way they can sneak up on them.",
                "author": "TheSonOfGadsden"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Department of War",
        "score": 1210,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"Reeeee! Hes trying to get us into wars! Warmongering! Reeeeee!\"",
                "author": "DingleBalls"
            },
            {
                "raw_content": "he's calling a spade a spade",
                "author": "wharfthrowaway"
            },
            {
                "raw_content": "Department of foreign war.",
                "author": "Meddlesom"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Illegal Alien Arrested With Arsenal Of Weapons, Ammunition, Cocaine",
        "score": 724,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So a cartel guy. It would be ironic if any of those guns traced back to Fast and Furious.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "But I though illegal aliens can't own guns!! That would be illegal! /s. We should have more gun laws so this doesn't happen",
                "author": "BMCKid"
            },
            {
                "raw_content": "But, I'm not allowed to buy a magazine larger than 10 rounds in my communist state? I guess they really do want you unprotected and dead.",
                "author": "TommyLasordasBallBag"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: A US Appeals Court has just BLOCKED an activist judge’s order to close Alligator Alcatraz! BIG WIN for America — BIG LOSS for activist judges 🇺🇸",
        "score": 1650,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The liberal communist judges are getting so tiresome.",
                "author": "deletedandreacted"
            },
            {
                "raw_content": "This isn't a big win when this is happening over and over and over again.",
                "author": "ThatsDoable"
            },
            {
                "raw_content": "When are the higher courts going to start issuing restraining orders against the worst of these judges? A handful of them are just ruling against the administration on everything, regardless of case law or anything else. They are damaging the integrity of our entire system of government with this shit.",
                "author": "DestroyerofCobwebs"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The White House has reportedly given Eric Adams and Curtis Sliwa a 10-day deadline to exit the NYC mayoral race, aiming for Andrew Cuomo to beat Zohran Mamdani.",
        "score": 956,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You know things are bad when you hope Andrew Cuomo wins the election",
                "author": "Vinnie"
            },
            {
                "raw_content": "Andrew Cuomo should be in prison not running for mayor!!",
                "author": "Stormeyworld13"
            },
            {
                "raw_content": "Coumo is less than ideal but this is a lesser of 2 evils type of situation",
                "author": "ileantotheright"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Feds intercept 1,300 barrels of meth precursor chemicals shipped from China to Mexico. Democrats keep losing their drug profits. LOL",
        "score": 1106,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yep, the US gov't is balls deep in this. Uniparty $$$",
                "author": "ConGrande1"
            },
            {
                "raw_content": "China has been waging a shadow war on us for a damn long time by funneling that poisonous sh*t through Meh-Hee-Ko and it’t about time somebody notices!",
                "author": "Right0hio"
            },
            {
                "raw_content": "I am starting to think that China doesn’t have good intentions for America.",
                "author": "Easzq8"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Daily Mail: \"Heart Problems Surge in Those Under 40.\" Any idezz? Maybe it's the Tylenol? Or drinking a few beers a week? Too much Vitamin D? That's it, really, I'm out of thoughts. There's just nothing else that could cause this to happen.",
        "score": 639,
        "text_content": "",
        "comments": [
            {
                "raw_content": "*The Science* has ruled out C19 gene editing therapies, so no need to worry about those being the cause.",
                "author": "wranlon2"
            },
            {
                "raw_content": "It's probably a lack of diversity",
                "author": "SorosHasBallsackEyes"
            },
            {
                "raw_content": "The United States of Arrhythmia. A nation of poisoned people.",
                "author": "SaltyKrakenBalls"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: President Trump has signed an executive order carrying out the massive JAPAN trade deal which involves an enormous $550 BILLION investment from Japan into the USA. They said it was impossible, but it just happened.",
        "score": 1318,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Visited there not too long ago. What a wonderful country, people and culture. Will go back again.",
                "author": "duehuckleberry"
            },
            {
                "raw_content": "It's not like Japan had a real choice lol. Either make massive investments in the US, or else suffer under heavy tariffs.",
                "author": "McFatty7"
            },
            {
                "raw_content": "God bless Donald Trump! Best president of our lifetimes!! 🇺🇸",
                "author": "SpaceWizard"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "“OMG RFK Jr is too crazy to run HHS”",
        "score": 1216,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Made it 14 seconds...God awful shit we went through with Biden crime party in power.",
                "author": "BlackLightsMatter2"
            },
            {
                "raw_content": "It's Richard (\"Dick\"). NOT Rachel. It's a dude.",
                "author": "duehuckleberry"
            },
            {
                "raw_content": "A lot of hypothetical “what ifs” Like what if you had a dick and pretended to be a woman.",
                "author": "DJT_MFers1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Simpsons predicted the future!",
        "score": 1004,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That lady looks terrified haha",
                "author": "38WendysHamSquare79"
            },
            {
                "raw_content": "The 3rd world wife says thank you come again.",
                "author": "TrumpAndGodWin"
            },
            {
                "raw_content": "Apu got banned from the show years ago when some pussy Indian guy complained about how it was offensive. Ignore the fact that every single character on that show is a stereotype, but only the Indian guy with a lot of episodes and backstory is the one that gets banned from the show.",
                "author": "Beat_to_Quarters"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Please let this happen! Zohran Mamdani challenges President Trump to public debate: ‘Let’s cut out the middle man’",
        "score": 841,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don’t fucking give a shit about this dude. New York City faggots deserve this.",
                "author": "Train_w_no_brakes"
            },
            {
                "raw_content": "Let JD Vance shred them…. Trump got too much shit to do",
                "author": "Trooph-Hurts"
            },
            {
                "raw_content": "Well, that's a dumb idea. What is his upside, exactly?",
                "author": "HelluvaEngineer"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "HP Scammed Us: HP Omen 45L is the Worst Pre-Built We've Reviewed",
        "score": 153,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Man I thought this one might actually be good. HP is a yikes",
                "author": "Culbrelai"
            },
            {
                "raw_content": "Good god.... what the fuck is that advert????",
                "author": "SignalButterscotch73"
            },
            {
                "raw_content": "How do you even achieve 105 degrees cpu temp in 45L chassis",
                "author": "cocacoladdict"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Congress Considers Forcing Nvidia to Sell Leading GPUs to Americans First",
        "score": 436,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And how are they gonna do that? They go to Taiwan and China and police the exits of warehouses?",
                "author": "ea_man"
            },
            {
                "raw_content": "Inb4 Nvidia makes a 6090E that's 10MHz faster than the 6090 to bend the rule like they did the 4090D.",
                "author": "madn3ss795"
            },
            {
                "raw_content": "ah yes, the free market",
                "author": "Gloriathewitch"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Wi-Fi Alliance introduces Wi-Fi for Matter™ certification to accelerate interoperable IoT ecosystem",
        "score": 9,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I would have hoped Thread border routers would’ve been integrated in this specification to make it less of a mess (“Wait, to access Matter devices remotely, I need a hub thing again?!”), but don’t see any specifics.",
                "author": "-protonsandneutrons-"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Seagate IronWolf Pro 30TB HDD Review: Seagate Drops the HAMR with the Biggest NAS Drive on the Market",
        "score": 40,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Oh hey! Finally seeing a hamr drive. I swear I first heard about these like 5 years ago",
                "author": "juhotuho10"
            },
            {
                "raw_content": "I doubt it makes a difference to most people, but IIRC the Exos 24TB is the better performer (not by a huge margin though) and the last non-HAMR drive.",
                "author": "capybooya"
            },
            {
                "raw_content": "As someone *very* interested in large, cheap storage (I'm a media hoarder, don't judge), this is promising because the price isn't mega-outlandish to start with and will certainly get cheaper as they get bought and cycled out by datacenters (2-3 year old former datacenter drives is the sweet spot for me). My current array is 10x12TB with 2 hot spares and I'd like to replace it with something like 4x30TB just to reduce the number of failure points. Flash still has *long* ways to go to match hard drives in raw $/TB and if HAMR catches on, it'll only delay that moment.",
                "author": "Vitosi4ek"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[The Phawx] Intel Answered (Latest LNL Driver Improvements on MSI Claw 8)",
        "score": 61,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm pretty interested to see how PTL ends up landing, especially the 12Xe3 core model. It's still a bit weak relative to say Strix Halo which is about a 20Xe2 core equivalent for the highest end model so you're looking at maybe 60-70% of the performance of that, but if it fits inside a mid to light weight laptop and it's got a solid battery life then I think it'll be a winner as an all-rounder. Lunar Lake has been a surprisingly solid performer and a nice generational improvement in the long-life x86 laptop space.",
                "author": "grumble11"
            },
            {
                "raw_content": "Intel has been continuously improving their drivers. 15W seems like the sweet spot with large performance gains seen there. Unfortunately, through his testing 10W seems to have some regressions. Though, I wouldn't be too concerned as you'd probably wouldn't be running this config with heavier games. So this 'regression' wouldn't be noticeable for lighter games >60FPS saving power at 10W. He didn't compare game benchmarks with the HX370 (Z2E), though you can probably cross reference his benchmarks with his [previous video](https://www.youtube.com/watch?v=Rai8Cxl1PiI). That video is 5 months old and unsure if AMD has made any more driver improvements, that said, Intel has pretty much caught up. Anyways, this update improves the perf/watt and do keep in mind the 3-4W in savings from the RAM in total system power compared to Ryzen mobile. Also, you get the benefit of XMX XeSS upscaling (and FG), which is better than DP4a XeSS and closer to DLSS3 for modern titles.",
                "author": "Noble00_"
            },
            {
                "raw_content": "[removed]",
                "author": "None"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Thermalright Royal Pretor Ultra review with Ryzen 9800X3d",
        "score": 47,
        "text_content": "RoyalPretor Ultra vs ASSASIN IV vs Phantom Spirit 120 Evo vs AK620 They are all really close to each other. However, PS EVO performs better than Royal Pretor LOL Note - the author presents this as a “home test.”",
        "comments": [
            {
                "raw_content": "Thermalright's bigger coolers tend to perform marginally worse with lower TDP CPUs, if you bench with a 250W CPU I'd expect it to beat the Spirit slightly.",
                "author": "vegetable__lasagne"
            },
            {
                "raw_content": "The Phantom Spirit 120 is GOAT.",
                "author": "jasmansky"
            },
            {
                "raw_content": "Note they're testing DeepCool's older Assassin IV, not the Assassin VC Elite WH, which is their latest and greatest vapor chamber cooler and has a 300W TDP rating. Would be interesting to see how that one fares.",
                "author": "Gippy_"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Switch 2 and the little chip that could!",
        "score": 796,
        "text_content": "Few screenshots I took playing Outlaws",
        "comments": [
            {
                "raw_content": "I'm just curious as to what optimizations they made to the RT to get it running so well. It looks comparable to the other consoles most of the time, but scenes with a lot of lighting look very different and not in a bad way. The reflections are way more stable than they are on the PS5 with fewer artifacts, but they're sometimes very simplified. Same goes for the global illumination. Overall it compares really well with the consoles, but there are scenes where it looks drastically different.",
                "author": "nftesenutz"
            },
            {
                "raw_content": "I am very satisfied with the game so far. Not sure why all the hate on the game.",
                "author": "Beneficial-Issue8005"
            },
            {
                "raw_content": "Someone should do an updated photo of a PS5, a series X, the giant PC portables and a Switch 2 size comparison",
                "author": "dekuweku"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Silksong is LITERALLY crashing the eshop",
        "score": 2714,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Its crashed Steam and PS Store as well. Small indie company of 3 people causing havoc for the 3 most popular gaming store fronts lmao",
                "author": "GodKefka"
            },
            {
                "raw_content": "It's so successful, that Microsoft will announce the studio closing and the firing of employees and they don't even own it.",
                "author": "Time-Ad-8722"
            },
            {
                "raw_content": "Why open preorders so people could comfortably buy the game in advance when you can crash everything at once?",
                "author": "AdventurousGold9875"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Ubisoft employee says Star Wars Outlaws is a game key card because cartidges are too slow for streaming assets",
        "score": 165,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Even though the switch 2 carts are a lot faster then switch 1 carts, they are noticeably slower then the switch 2’s internal storage or micro express, so there can be truth to this",
                "author": "AmandasGameAccount"
            },
            {
                "raw_content": "This cold be true, but if it is then why doesn't Nintendo do the same process as Sony and Microsoft - have the game on cart but make it so it installs all or developer-allocated data to the internal/SD storage so it has the required files in the fast storage whilst still offering all files on the cart for the situation where there's no access to the servers? I imagine, as this isn't happening, that Nintendo will need to address this and program it into the OS.",
                "author": "GamePitt_Rob"
            },
            {
                "raw_content": "Then I feel like they should offer carts that you can download a game *from*, similar to how discs have worked on other consoles. Better than a game key card since you can download the title anytime, offline. But it still checks out, the carts are slower than the internal storage or a microsd express, and Star Wars Outlaws as a current gen title (rather than a last gen one) relies heavily on quickly streamed assets.",
                "author": "SamsungAppleOnePlus"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Star Wars Outlaws #4 on Eshop best seller charts.",
        "score": 446,
        "text_content": "Outlaws climbed its way to the #4 slot. Kind of insane how fast of a comeback story this game had. It wasn't even on the top 15 chart until yesterday. And it seems like it can co-exist with the Silksong hype, everyone wins here.",
        "comments": [
            {
                "raw_content": "A good port will be rewarded with good sales. Although we are talking about Ubisoft, I'm sure they somehow are gonna be disappointed.",
                "author": "linkling1039"
            },
            {
                "raw_content": "The game is going to do very well. Ironically, the negative press and subsequent backtracking has done wonders for getting as many eyes in this version of the game.",
                "author": "GronWarface"
            },
            {
                "raw_content": "No Man's Sky slaying as always, you love to see it!",
                "author": "Eggxcalibur"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "No, it's not real. It can't be. Someone wake me up",
        "score": 893,
        "text_content": "",
        "comments": [
            {
                "raw_content": "didn't play the first Hollow Knight, Is it really that good? It is on almost every sub now as I scroll my feed",
                "author": "vladkolodka"
            },
            {
                "raw_content": "Of course it's real, New Super Mario Bros U came out almost 15 years ago! /s Jokes aside, have fun OP.",
                "author": "linkling1039"
            },
            {
                "raw_content": "All this time, I can't believe I couldn't see Kept in the dark, but you were there in front of me",
                "author": "Jimstein"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Seriously, you need to play Silksong with a Pro Controller 2",
        "score": 83,
        "text_content": "The game is filled, filled with tons of different sensations, subtle vibrations, strong vibrations. The HD Rumble in this game is on another level. If you can't get a Pro Controller 2, play with the Joy-Con grip (or portable), but do not use a third-party controller without HD Rumble. Trust me on this. Your hand will truly enjoy this experience.",
        "comments": [
            {
                "raw_content": "I’m still unsure whether to get it for my Switch 2 or my PS5",
                "author": "Silver_Song3692"
            },
            {
                "raw_content": "My problem with this, having tried both, is I just don’t like the D-pad on the Pro Controller 2. The issue in *Silksong* is the down-diagonals are pretty important and finicky to do with the joystick. The Pro Controller 2 D-pad is sadly imprecise (for me), but that’s obviously no issue on the Joy-Con 2.",
                "author": "DylanMcGrann"
            },
            {
                "raw_content": "I'm using the pro controller for Switch 1, the new one is too expensive and I spent a ton on the Switch 2 bundle already. Do most people play Silksong with analog or d pad though?",
                "author": "Eon_Breaker_"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Star Wars Outlaws is another graphical showcase for the Switch 2",
        "score": 424,
        "text_content": "The game has a photo mode. I love taking pics in games when it’s a feature. All of these were taken in docked mode, except for the last three shots which were in handheld.",
        "comments": [
            {
                "raw_content": "I’ve played an hour after transferring my pc save. It’s literally unbelievable how good this game is on switch 2. It’s a big step up from Cyberpunk image quality wise and performance wise. Not seen a dropped frame yet and I’m ok Akiva which is a heavy area of the game. It looks so clean handled and docked and is pushing huge stuff like RT reflections and RTGI. The only thing I can even say is a small negative is the pop in handheld is slightly more than I’d like but that’s being super picky. This is without doubt a stunning achievement. Certainly makes me feel far more confident about future ports for the switch 2. The standard has been set and with a game that is unambiguously graphically advanced and hard to run.",
                "author": "ShotAcanthocephala8"
            },
            {
                "raw_content": "Aside from hair textures and resolution (which on a small screen does not matter that much), it's not too far from how it runs on my rtx 4060 ti rig. For a tablet, this is insane.",
                "author": "Unhappy_Gazelle392"
            },
            {
                "raw_content": "I might give it a try when it goes on sale. The thing that bothers me a bit is that reviews are mixed on the game, saying it’s average and at times boring, but people think that automatically means it’s bad or garbage. Like I see mostly 6/10 or 7/10 and apparently that means it’s a bad game???",
                "author": "waxy15"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Star Wars Outlaws- Steam Deck OLED vs Switch 2",
        "score": 27,
        "text_content": "Has anyone else tried this on their Steam Deck and seen the same performance issues? The difference is stark.",
        "comments": [
            {
                "raw_content": "...And there are still people who say that they will just emulate Switch2 on Steam Deck.",
                "author": "Pristine-Brush-1052"
            },
            {
                "raw_content": "I’m sure this will lead to civil discussions",
                "author": "lingering-will-6"
            },
            {
                "raw_content": "In other discussions I read that the crazy difference is to a big part to Ray Tracing. The Switch 2 chip has dedicated cores for the ray trading while the steam deck doesn't and it just brutforcing it which doesn't result in a good result. Looks amazing on the sw2, will buy it once it's discounted",
                "author": "julesvr5"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Puck: Steven Spielberg really wanted to direct a ‘Call of Duty’ movie and even presented his vision to Activision - but Activision got spooked by Spielberg wanting full control of production/marketing/final cut/economics and went with Paramount instead",
        "score": 153,
        "text_content": ">*Spielberg wanted to direct ‘Call of Duty’*: Paramount is finally confirming what I reported last week: A *Call of Duty* movie is in the works via a new deal with Activision. But no talent is attached yet, which is very different from the Universal pitch for the project. Per three sources, Steven Spielberg really wanted to direct the *CoD* movie, and his Amblin teamed with Universal dealmaker Jimmy Horowitz to present the filmmaker’s vision for one of the world’s biggest gaming franchises. (**Spielberg is famously a big gamer and loves** ***CoD*** **in particular.**) But with Spielberg comes the famous Spielberg Deal, which includes top-of-market economics, final cut, and full control over production and marketing. That spooked the team from Activision, now owned by Microsoft, which instead went with David Ellison’s pitch that offered much more control over the process. Given the constraints, let’s see who Paramount gets to direct that movie… [https://puck.news/newsletter\\_content/what-im-hearing-spielbergs-call-of-duty-pitch-phil-suns-exit-the-rock-rebrand-a-rotten-reckoning/#selection-2355.0-2381.131](https://puck.news/newsletter_content/what-im-hearing-spielbergs-call-of-duty-pitch-phil-suns-exit-the-rock-rebrand-a-rotten-reckoning/#selection-2355.0-2381.131)",
        "comments": [
            {
                "raw_content": "A Spielberg CoD movie would go unbelievably hard. Dumbasses",
                "author": "JVKExo"
            },
            {
                "raw_content": "Genuinely insane considering: * Call of Duty wouldn’t exist if Spielberg didn’t financed and produced Medal of Honor. * he is a CoD player who bought all the releases * has directed award winning war films",
                "author": "RamaAnthony"
            },
            {
                "raw_content": "A war movie directed by one of the greatest filmmakers of all time who also happens to have made one of the greatest war films of all time. But apparently Activision and MS execs think they know better...",
                "author": "Deadly_Toast"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Potential progression system for Deadlock datamined and recreated",
        "score": 128,
        "text_content": "[User DeadlockGreed posted on the game's subreddit](https://www.reddit.com/r/DeadlockTheGame/comments/1n8j3to/i_found_a_complete_hidden_game_mode_in_deadlocks/) about an internal \"tarot\" system they had datamined and recreated. Apparently inspired somewhat by similar metagames within Dota 2, it allows the player to earn \"tiles\" after matches played based on their stats (like kills, healing, souls acquired, etc.) and then fill out boards that grant rewards for meeting certain requirements. All WIP stuff that could easily change or never make it into the game to begin with, but it all seems fairly fleshed out.",
        "comments": [
            {
                "raw_content": "So like Team Fortress 2 contracts?",
                "author": "suspicious_personage"
            },
            {
                "raw_content": "This game and its rollout are so fascinating. From being a hugely hyped game for a few weeks to most of the gaming world having forgotten about it, and it hasn’t even been properly announced (in the classic marketing sense) yet! Latest round of characters look awesome though!",
                "author": "Com_Raven"
            },
            {
                "raw_content": "ok guys don't forget, we all have to act really surprised when they announce this game! you don't want Gabe to cry do you??",
                "author": "daveycloud"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Battlefield 6 - Mirak Valley Map - Ultra Wide Gamplay on YouTube",
        "score": 57,
        "text_content": "[https://www.youtube.com/watch?v=RfLAXwENEHc](https://www.youtube.com/watch?v=RfLAXwENEHc)",
        "comments": [
            {
                "raw_content": "The title of the video is misleading. It’s not a Season 1 map, it’s one of the base game maps (9, if I’m not mistaken) that will be available at release.",
                "author": "LoveLikeOxygen"
            },
            {
                "raw_content": "Can't wait for people to complain the map feels \"too open\" after having a meltdown in the beta over the small maps being, uh, small.",
                "author": "giulianosse"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "SteamVR datamine seems to confirm that Steam Frame is Valve's next-gen \"Deckard\" VR headset",
        "score": 546,
        "text_content": "Steam dataminer Lifeismana found [strings in a SteamVR update released a few hours ago](https://github.com/Lifeismana/GameTracking-SteamVR/commit/edf2115eac4dcb6b42c506f2cafa5ccd51a08818#diff-5e5150189c787b11d80fd8d5e87bc73ea59906c815230db09993841e90bc3912R18-R177) which mention the Steam Frame, a new hardware device that was trademarked by Valve yesterday. This seems to confirm that Steam Frame is the official product name of Valve's standalone VR headset codenamed Deckard, which has been in development since 2021 and has been long-awaited by VR enthusiasts. According to previous leaks and datamines, the device runs on an ARM version of SteamOS Linux with compatibility layers for playing Windows and Android-based VR games. It'll also play non-VR Steam games in a previously datamined theater mode. Another SteamVR dataminer, [SadlyItsBradley, has clarified](https://xcancel.com/SadlyItsBradley/status/1963491451049771216) that SteamVR's \"overlays\" feature is also being renamed to \"frames\" to coincide with the Steam Frame. Because of these SteamVR changes and the trademark filing coinciding, it seems that a reveal of this headset could be imminent. The Steam Deck had trademarks filed on July 14, 2021, and the official reveal happened the next day, so it's possible we can expect a similar reveal at 10 am PT today. (Just an FYI: If you've seen this post already, that's because I had to repost it. It got auto-removed because I accidentally included a Twitter link instead of Xcancel.)",
        "comments": [
            {
                "raw_content": "Honestly, as much as the headset itself is intriguing, I’m more excited at the prospect of an ARM variant of Proton. Android/Linux ARM gaming handhelds are making big strides at running Windows games through stuff like Winlator, but they’re all lacking the sort of polish that a more official implementation would bring to the table.",
                "author": "SpontyMadness"
            },
            {
                "raw_content": "I know I'm gonna be disliked to oblivion but I hope it has \"inside-out\" tracking because my room is just too small to bother with lighthouses.",
                "author": "MadOrange64"
            },
            {
                "raw_content": "I'll believe it when I see it, but I have been squirreling money away for it.",
                "author": "NaughtyMallard"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Panther Lake-H laptop board spotted with 64GB LPDDR5X memory",
        "score": 70,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I feel feel like Intel is on the upswing despite the FUD, but I'm getting so confused by all these \"Lake\" processors!",
                "author": "Historical_Bread3423"
            },
            {
                "raw_content": "We had so many lakes we might drown in the lake of confusion with Intel.",
                "author": "6950"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Radeon RX 9070 on Intel X99 motherboards: boot failures traced to BIOS, not hardware",
        "score": 143,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hmm so there is hope for my x99 setup and the 9070 XT.",
                "author": "o-c-t-r-a"
            },
            {
                "raw_content": "It's all the spy stuff they have to implement these days that is causing havoc.",
                "author": "vBDKv"
            },
            {
                "raw_content": "bios issue on Asus's AM2 socket board with a reference 7900xt.... works fine on some other boards.... so not surprising.",
                "author": "DHJudas"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "GPD Win 5 \"Strix Halo\" gaming handheld to feature Ryzen AI MAX 385/395 APU, 32GB, 64GB and possibly 128GB RAM options",
        "score": 97,
        "text_content": "",
        "comments": [
            {
                "raw_content": "128GB RAM? On a handheld? That would be largely overkill, right?",
                "author": "genesis88"
            },
            {
                "raw_content": "Looks super neat, but it's not for me. It's bigger, and part of the appeal of the Win 4 for me was it (just barely) fits in my pants pocket. I already have larger body handheld so I'll be giving it a pass. I also feel like I'd really miss the keyboard.",
                "author": "_Corbeanu_"
            },
            {
                "raw_content": "Fun fact they named it Win 5 so it makes people click articles expecting a giveaway Source : my own anus",
                "author": "Prefix-NA"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Americans say $74,000 a year is the 'perfect salary.' But that can only afford to buy you a house in two states",
        "score": 662,
        "text_content": "**A $74,000 salary** is above the national median and enough to comfortably cover rent in most U.S. cities, but it still falls short of affording a median-priced home in nearly every state. Monthly mortgage payments often exceed the one‑third income threshold, even for households earning nearly double that “ideal” salary.",
        "comments": [
            {
                "raw_content": "There was a study some 20 years ago that found 75k was the ideal salary. Controlled for inflation that would be well over six figures now.",
                "author": "Substantial_River943"
            },
            {
                "raw_content": "I might be crazy, but I think given a choice between $74k and a larger number, I'd take the larger number. Might just be me though.",
                "author": "lanciferp"
            },
            {
                "raw_content": "Who did they poll that said $74k was the perfect salary lmao",
                "author": "Dalionking225"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Coming soon to a Fed-blown housing bubble near you",
        "score": 162,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I just bought a house today, so that means that the bubble is definitely going to pop tomorrow.",
                "author": "beepincheech"
            },
            {
                "raw_content": "The age-old formula is don’t buy it and the bubble bursts. All bubbles.",
                "author": "muffledvoice"
            },
            {
                "raw_content": "If I'm reading this right that's a 25% drop from ATH? That is a major correction, is this real?",
                "author": "DanielShaww"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Dallas tanking just like the Cowboys",
        "score": 171,
        "text_content": "Dallas bubble status confirmed 6/19/2022 Median price per sq foot $218.39 8/31/2025 Median price per sq foot $194.95 According to Redfin Data",
        "comments": [
            {
                "raw_content": "Such a strange way to use this meme",
                "author": "fatherlobster666"
            },
            {
                "raw_content": "I just went through there last week. The building outside of the metroplex for apartments, condos and housing up to over an hour + out just going west is still absolutely insane. The things going down in Dallas are the ones they tried to double their money in 5 years or less. When Texas crashes it’s going to make 2008 look like a good day. It’s out of control",
                "author": "VendettaKarma"
            },
            {
                "raw_content": "What was it before covid?",
                "author": "Arikota"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "U.S. Investor Home Purchases Fell 6% in the Second Quarter, the Biggest Decline Since 2023",
        "score": 140,
        "text_content": "",
        "comments": [
            {
                "raw_content": "U.S. real estate investors purchased roughly 52,000 homes in the second quarter, the lowest level for that time of year since 2020. That’s down 6% from a year earlier, the biggest drop since the fourth quarter of 2023. This is based on a Redfin analysis of county-level home purchase records across 39 of the most populous U.S. metropolitan areas going back through 2000. We define an investor as any institution or business that purchases residential real estate, meaning this report covers both institutional and mom-and-pop investors. Please see the end of this report for a more detailed methodology. Real estate investors are pulling back for similar reasons individual homebuyers are pulling back: high borrowing costs, elevated home prices and economic uncertainty. It’s more expensive for investors to finance their purchases than it has been in the past. Even though most investors pay in cash and don’t take out mortgages to buy homes, they often take on other loans to fund things like renovations, and interest rates are much higher than they were during the pandemic. Additionally, home prices remain [near record highs](https://www.redfin.com/news/homes-sell-at-slowest-pace-in-decade/). Asking rents have also [declined from their peak](https://www.redfin.com/news/rental-tracker-july-2025/) in much of the country. Additionally, the short-term rental market has [cooled](https://www.redfin.com/news/vacation-towns-home-sales-declining/) in some areas amid tightened regulations. That’s a turn-off for investors who buy properties to rent them out.",
                "author": "CautiousMagazine3591"
            },
            {
                "raw_content": "They caused the problem.",
                "author": "Likely_a_bot"
            },
            {
                "raw_content": "It's market dependent. Some places like Orlando and Atlanta are getting hit while investors in California and Seattle are shugging along. (I suspect Chinese investors are propping up the market out west).",
                "author": "ohhellnaah"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The U.S. housing market is ‘finally starting to listen’ to homebuyers plagued by high mortgage rates and home prices, economist says",
        "score": 60,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Maybe in other markets like Texas and Florida...apparently SoCal have permanent ear plugs on and can't hear a damn thing...🤣",
                "author": "Scblacksunshine"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Nice housing bubble you got there, Toronto - would be a shame if anything were to happen to it",
        "score": 30,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So less than 1% delinquency rate?",
                "author": "Strength_Various"
            },
            {
                "raw_content": "You need to go back to 1972, son!",
                "author": "H3rbert_K0rnfeld"
            },
            {
                "raw_content": "Beahahaha! Looks like the citizens of Toronto are holding a big box of poop. Where did all the politicians who approved all of this go? What about the developers? TREB? Hahaha!",
                "author": "Designer-Welder3939"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "They Couldn’t Afford Homes in the Big City. So They Left.",
        "score": 42,
        "text_content": "",
        "comments": [
            {
                "raw_content": "In other news: Man Can't Afrord Lexus, Buys Toyota Instead.",
                "author": "NnyBees"
            },
            {
                "raw_content": "Newsflash: housing is overpriced even in the middle of nowhere. Only places I found was bad neighborhoods in Milwaukee and decent houses around Scranton PA",
                "author": "kahmos"
            },
            {
                "raw_content": "Grows up in a very expensive area, is surprised when it is still expensive when it's his turn to buy a house. His parents owned/ rented when the US population was 200 - 250 million. Now it's at a minimum 350 million. They were only 10-15 years out from the dollar being taken off the gold standard. The person in this article is 50+ years out from the dollar being taken off the gold standard, and for the first time since Kissinger faces real competition from BRICS and crypto. Since the US hasn't annexed/purchased any more land since 1959, this is the logical conclusion for everyone, not just young people.",
                "author": "hellob525"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "OpenAI set to start mass production of its own AI chips with Broadcom",
        "score": 286,
        "text_content": "https://www.reuters.com/business/openai-set-start-mass-production-its-own-ai-chips-with-broadcom-ft-reports-2025-09-05/",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/nhd4lj31z8nf1.jpeg?width=1050&format=pjpg&auto=webp&s=991a73e5ef2c3fbb1dd9ae73e1611233a999bad6",
                "author": "awesomedan24"
            },
            {
                "raw_content": "It was an obvious choice at some point, let's see how it goes",
                "author": "adarkuccio"
            },
            {
                "raw_content": "Interesting I saw that they will only be using them internally, so for special training or research purposes? Edit: actually just read the actual quote from the article, not sure that’s what it means. Might just mean they aren’t selling the chip to other companies for use: > OpenAI planned to put the chip to use internally rather than make it available to external customers, the report added, citing one person close to the project.",
                "author": "socoolandawesome"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Most humans will be treated how homeless people are treated now in a post human labor society",
        "score": 85,
        "text_content": "As human labor becomes ever more useless people without the highly specialized and economically relevant talents and knowledge will slowly be seen in the way most people currently view homeless or severely disabled people in the US. E.g. some variant of a pariah to be avoided, scorned, sympathy a social problem or a resource drain etc. I do not want this to be true but when I see how readily we, as a society, readily dehumanize people who have become a drain due to an addiction or mental problem it’s hard to imagine that mindset being applied more broadly as average humans slowly become unemployable to the ‘modern’ or ‘primary’ economy. Thoughts?",
        "comments": [
            {
                "raw_content": "The economy doesn't survive in this scenario, for anyone. Businesses that eliminate jobs also eliminate customers. They can make products faster and cheaper but there is no-one to buy them. The coming decades are going to fundamentally change society, never in our species lifetime have we lived in a world were labour isn't necessary, it's not going to look like anything we've got today",
                "author": "theirongiant74"
            },
            {
                "raw_content": "but when the majority has to face the fact that they equal to homeless people, they will all be forced to see each other as equals",
                "author": "Independence-Special"
            },
            {
                "raw_content": "I'm thinking horses are a more apt analogy. Horses had their value in transport, but now machines have made their part obsolete and now horses have lost their value. The only value left horses have are for tradition or scientific research.",
                "author": "Serious-Cucumber-54"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Will figure.ai take over home chores?",
        "score": 261,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Man I hope it comes before I retire.",
                "author": "Lazyworm1985"
            },
            {
                "raw_content": "When these can cook good meals in your own kitchen, I wonder how it will impact the restaurant business. Imagine wanting a certain meal and the ingredients are delivered to your house by drone and your robot unpackages and cooks the meal!",
                "author": "Newcomer156"
            },
            {
                "raw_content": "Home robots will only feel real when they can actually do the boring stuff for us: * Laundry (end to end) * Mopping * Loading / unloading the dishwasher * Flattening cardboard boxes * Taking out the trash + bringing bins back on garbage day * Vacuuming If a robot could nail these, I’m pretty sure people would happily drop **$30–50K**. Can’t wait for that future to show up.",
                "author": "MaxTwang"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Kimi-K2-Instruct-0905 Released!",
        "score": 41,
        "text_content": "",
        "comments": [
            {
                "raw_content": "## 3. Evaluation Results | Benchmark | Metric | K2-Instruct-0905 | K2-Instruct-0711 | Qwen3-Coder-480B-A35B-Instruct | GLM-4.5 | DeepSeek-V3.1 | Claude-Sonnet-4 | Claude-Opus-4 | |------------------------|--------|------------------|------------------|--------|--------|--------|-----------------|---------------| | SWE-Bench verified | ACC | 69.2 ± 0.63 | 65.8 | 69.6* | 64.2* | 66.0* | 72.7* | 72.5* | | SWE-Bench Multilingual | ACC | 55.9 ± 0.72 | 47.3 | 54.7* | 52.7 | 54.5* | 53.3* | - | | Multi-SWE-Bench | ACC | 33.5 ± 0.28 | 31.3 | 32.7 | 31.7 | 29.0 | 35.7 | - | | Terminal-Bench | ACC | 44.5 ± 2.03 | 37.5 | 37.5* | 39.9* | 31.3* | 36.4* | 43.2* | | SWE-Dev | ACC | 66.6 ± 0.72 | 61.9 | 64.7 | 63.2 | 53.3 | 67.1 | - | https://huggingface.co/moonshotai/Kimi-K2-Instruct-0905",
                "author": "1a1b"
            },
            {
                "raw_content": "Decent benchmaxxing for a couple of months.",
                "author": "LoKSET"
            },
            {
                "raw_content": "Good bumps",
                "author": "Psychological_Bell48"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "EmbeddingGemma, Google's new SOTA on-device AI at 308M Parameters",
        "score": 279,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">For ultimate flexibility, EmbeddingGemma leverages Matryoshka Representation Learning (MRL) to provide multiple embedding sizes from one model. Developers can use the full 768-dimension vector for maximum quality or truncate it to smaller dimensions (128, 256, or 512) for increased speed and lower storage costs. That is pretty neat. If the improvements over e5-large hold true in application, this might be pretty useful.",
                "author": "JEs4"
            },
            {
                "raw_content": "What use cases are there for embedding on a mobile device? Thats why they've developed this right?",
                "author": "welcome-overlords"
            },
            {
                "raw_content": "Didn’t they release Gemma 3 270M less than a month ago? Is it the same use case but better?",
                "author": "vintage_culture"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "new stealth model carrot, seems good at coding",
        "score": 81,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Qwen 3 max?",
                "author": "Longjumping_Spot5843"
            },
            {
                "raw_content": "Google vegetable name arc ?",
                "author": "AdIllustrious436"
            },
            {
                "raw_content": "Quick test - failed to create a working to-do list app. Pretty basic request",
                "author": "mintybadgerme"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Chinese tech firms seek NVIDIA chips despite government pressure",
        "score": 7,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's probably why deepseek R2 is delayed. They tried training on Huawei chips because of government pressure but had many technical challenges. They got too famous for their own good, now the Chinese government is breathing down their neck.",
                "author": "10b0t0mized"
            },
            {
                "raw_content": "Semiconductors are among the most difficult technologies to create and master, Chinese semiconductor industry was created decades after the American one was, closing decades-wide gap isn't easy.",
                "author": "OttoKretschmer"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "🤷‍♂️",
        "score": 156,
        "text_content": "",
        "comments": [
            {
                "raw_content": "40B vision MOE- aka The LLm opensource destroyer",
                "author": "maxpayne07"
            },
            {
                "raw_content": "Time to bet!",
                "author": "ohHesRightAgain"
            },
            {
                "raw_content": "Yes!",
                "author": "Healthy-Nebula-3603"
            }
        ],
        "subreddit": "singularity"
    }
]