[
    {
        "post_name": "Mike Benz explains how when DOGE first started it was making the government work how it was supposed to work, even taking the power away from top FBI bureaucrats. Now Mike Benz says the cabinet has regained much of the power and it’s back to “business as usual”.",
        "score": 452,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm not suprised. Without consequences there will never be change. It's really not that complicated or difficult to puzzle out. Ffs",
                "author": "Hangemh1gh"
            },
            {
                "raw_content": "Team DOGE should have been permanent.",
                "author": "BlackPilledMAGA"
            },
            {
                "raw_content": "Mike Benz explains how when DOGE first started it was making the government work how it was supposed to work, even taking the power away from top FBI bureaucrats. He says this worked because Trump deferred to Elon Musk to handle things. Now Mike Benz says the cabinet has regained much of the power and it’s back to “business as usual”. “What happened with DOGE and why can't we sustain the pace? And is there any hope of getting back to a fast pace?” Mike Benz “What I know from my contacts in the admin, I was told by multiple people at multiple different agencies that DOGE was a complete game changer because whereas agencies were previously ruled by careers I was talking about this, for example, with the FBI. We have four political appointees at the FBI. There's 38,000 FBI employees. So it's 4 versus 38,000. The great equalizer in the first couple of months of the admin was that DOGE were in the building and they directly had the deputized power of the Office of Management and Budget effectively to just cut the budgets of anybody in the career class, shut down any department, freeze the funding. If you were a career and you were trying to be insubordinate against the politicals, doge could come in and make the careers have to respect the politicals because if they didn't do what they were told in the chain of command, you'd get doged. That was a game changer. My contacts at state and DHS and in the early USAID were all telling me, oh my God, the agency for the first time seems to be working how it's supposed to be working because the careers are doing what the political appointees told them to do. Not because they fear the political appointees, they fear DOGE. But I think that what was imbued in DOGE was the kind of silent power of Elon Musk and the fact that Trump, I think, before the cabinet was fully filled out, kind of deferred to Elon on most things that Trump didn't care too much about in terms of beer crack management. But I think with that power going away in DOGE no longer representing the full force of Elon Musk, it began to loop moves to the cabinet level consensus, which is a lot more business as usual.” https://x.com/WallStreetApes/status/1994610551507578937?s=20",
                "author": "Capoditutticapi1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Stephen Miller: “40% of rent controlled properties are being lived in by people who weren’t even born in the country….We bring in people from foreign countries, and then we pay to lower the cost of their housing while people who were born here have to pay higher prices.”",
        "score": 195,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We need to stop importing burdens",
                "author": "Formerlurker92"
            },
            {
                "raw_content": "Glad to see someone besides me realizes this",
                "author": "LiteralDogWhistle"
            },
            {
                "raw_content": "How is this even possible? In NYC, there's something like a 20+ year waiting list to get a rent controlled apartment.",
                "author": "fskfsk"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Islamic terrorism isn't native to America. It didn't come on the Mayflower. It's alien to most of American history.",
        "score": 171,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Even if they didn't regularly engage in terrorism and fraud and every other form of criminal behavior, but were completely law-abiding and peaceful, they still would not belong here. Sand negroes have dozens of their own countries to choose from to live in",
                "author": "RINO_fatigue"
            },
            {
                "raw_content": "Pajeets and Muhammads are disgusting \"people\"",
                "author": "38WendysHamSquare79"
            },
            {
                "raw_content": "People have been slow on the uptake, but its nice to see them catching on",
                "author": "Formerlurker92"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING - As part of his escalating crackdown on illegals, President Trump’s Treasury has issued a memo stating it will begin seizing remittances sent abroad by illegal aliens, with all suspicious transactions over $2,000 to be flagged.",
        "score": 1497,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There are going to be a lot of $1,999 wires real soon. That system is too easy to beat.",
                "author": "KuzoKevin"
            },
            {
                "raw_content": "Should be anything over $0. But this is a start.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "I've posted this before, but will say it again. WALMART is one of the biggest winners from illegal immigration. Illegals can deposit their checks at the customer service counter directly into their WALMART account, which can be used immediately at the WALMART in their home country by waiting family members. In this manner, they bypass completely any banking controls.",
                "author": "referencevariable"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Japan rejects 97.8% of asylum claims and it is still too much for them. We should learn from them.",
        "score": 1168,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's still too many. The number has increased over the years. Needs to be down to zero.",
                "author": "notatallimsure"
            },
            {
                "raw_content": "I have more respect for Japan than I do for nearly any other country on the entire planet. Honestly? They're better than us in some ways. We could absolutely learn from them. I'm actually proud to be allies with Japan. I cannot say the same for Canada and European countries (except Poland and Hungary).",
                "author": "TheJakeFroggy"
            },
            {
                "raw_content": "It should be 100%. Japan is for the Japanese!! America is for Americans!! Italy is for Italians!! Britain is for Brits!! Germany is for Germans!!",
                "author": "China4Biden"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"I don't think that the European Union gets to determine what international law is. They CERTAINLY don't get to determine how the United States defends its national security!\"",
        "score": 1103,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He sounds so sick of their shit.",
                "author": "PatriotSkorzeny"
            },
            {
                "raw_content": "They want what they've always had. Keep their socialized bullshit, spend nothing on defense, pass judgement on the US the whole time until shit hits the fan, and then come crying.",
                "author": "DeploraBen"
            },
            {
                "raw_content": "Fuck Europe.",
                "author": "booga"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Freedom is too much for some people, especially leftists.",
        "score": 1099,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Governments can't force capitalism on its citizens, because capitalism requires freedom to choose, but they can force socialism and communism by removing your choices.",
                "author": "KuzoKevin"
            },
            {
                "raw_content": "Who wants to tell them this isn’t a capitalist country? We at best practice gay brown socialism.",
                "author": "Viewer01"
            },
            {
                "raw_content": "Two can play at this game. Trannies and abortion aren't in the constitution either.",
                "author": "Choppa_Pilot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Katanji might get removed as illegitimate",
        "score": 1380,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I seriously doubt it, but I am open to the prospect. Surprise me.",
                "author": "MakingArrowsOrange"
            },
            {
                "raw_content": "I’m tired of the saber rattling. I just want things done.",
                "author": "GuerillaYourDreams"
            },
            {
                "raw_content": "This is copium. Not gonna happen. They can’t even impeach Boasberg ffs.",
                "author": "EuphoricTrillby"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Pennsylvania officials reportedly admitted that for decades, the Department of Motor Vehicles had allowed non-U.S. citizens to register to vote through the state’s ‘motor voter’ system",
        "score": 1156,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This was the original intent of ‘motor voter’ laws.",
                "author": "MrTexan"
            },
            {
                "raw_content": "\"Allowed\" is the wrong word. I used to live in Pennsylvania and had a first-hand report of this happening 25+ years ago. A foreign student (friend of a friend) went to get a driver's license, had no intention of trying to register to vote, did NOT check the box to indicate she wanted to register to vote. This was back when the application was on paper, and \"motor voter\" was still opt-in -- not opt-out, as it is now, where you have to check a box if a you *don't* want to register to vote. She was very surprised when she received her voter registration card in the mail a short time later, and a bit scared because she was afraid she might be accused of deliberately registering even though as a noncitizen she was ineligible. The DMV workers were apparently \"helping\" people who \"forgot\" to the check box. Now it's all on a computer screen, and I'm sure a lot of porrly educated noncitizens with shaky are confused and think maybe they're not supposed to check the opt-out box because it has something to do with voting. And even if they do check the box to opt out, there are probably still DMV workers \"fixing\" it by unchecking it before they process it.",
                "author": "Deplora"
            },
            {
                "raw_content": "I think we need to start bringing back some very public consequences in the town square.",
                "author": "RentFree2020"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Joe Rogan just tells her straight out..",
        "score": 1258,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If you’re still a fuckin covidian at this point you’re beyond help. Get fucked",
                "author": "awsure"
            },
            {
                "raw_content": "I've been around \"Covid positive\" people and never gotten sick this year",
                "author": "RizzlieDoodad"
            },
            {
                "raw_content": "They fucked the DNA pool up and killed millions not just for money but so they could implement mail in ballots in the US and for globalists to assert power in every country controlled by a puppet. Not to mention tear families apart.",
                "author": "KennyKetchem"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Anti Trump RINO Indiana State Senator accused of DUI",
        "score": 812,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'll just settle for accountability for once. Let him have the same consequences for his actions. Just like the rest of us plebes.",
                "author": "Hangemh1gh"
            },
            {
                "raw_content": "Trump said \"retarded\" and the first thing that comes to mind to this RINO and that he uses as an excuse to chicken out is to mention his daughter with Down Syndrome... what a POS father.",
                "author": "Monsieur_Novembre"
            },
            {
                "raw_content": "A retarded faggot jealous of a true leader.",
                "author": "Skogin"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Accurate",
        "score": 878,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The GOP fights Trump more than they fight the Democrats. Which shows that they're not on our side. They pretend to be on our side but in actuality they're on the same team as the Dems. Both parties benefit from corruption. And thus I don't see this war as \"Republicans vs Democrats\", but rather it's us and Trump vs corrupt politicians, their useful idiots and the foreigners they import in the country. Trump won us over back in 2016 not because he was a Republican, but because he called out the establishment in general, which includes people from both parties. The swampy Republicans such as Bush and Cheney hate him just as much as the Dems, and they're also clearly the enemy.",
                "author": "TheJakeFroggy"
            },
            {
                "raw_content": "republicans, snatching defeat from the jaws of victory my whole damn life.",
                "author": "drattastic1"
            },
            {
                "raw_content": "Republicans find any way possible to lose with a winning hand.",
                "author": "wharfthrowaway"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Any document signed by Sleepy Joe Biden with the Autopen, which was approximately 92% of them, is hereby terminated, and of no further force or effect. The Autopen is not allowed to be used if approval is not specifically given by the President of the United States.",
        "score": 1900,
        "text_content": "",
        "comments": [
            {
                "raw_content": "FINALLY some action. All it took was the death of a poor 20 year old guardswomen.",
                "author": "Azill"
            },
            {
                "raw_content": "That should include pardons",
                "author": "Sea_Still"
            },
            {
                "raw_content": "Trump going scorched Earth. The blowback about his weak administration and then the attack / murder on the National Guard sent him over top.",
                "author": "MEME-SUPREME"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump's filter is fading by the day and I love it.",
        "score": 981,
        "text_content": "",
        "comments": [
            {
                "raw_content": "walz's family would agree. seems like trump doesn't give a fuck anymore, and he's gonna say whatever he wants to say.",
                "author": "ThomasSowellisKing"
            },
            {
                "raw_content": "I'm amazed his filter didn't come off along with a little peice of his ear",
                "author": "Formerlurker92"
            },
            {
                "raw_content": "It's ok to be tarded in the good way but don't be a faggot",
                "author": "CommieCrats"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "110 Rapes or attempted rapes a Day in Frace. 11% raped are not women",
        "score": 1153,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Remind me to avoid Frace at all costs…",
                "author": "Winter_Is_Coming2020"
            },
            {
                "raw_content": "Those poor goats!",
                "author": "NotYourMan"
            },
            {
                "raw_content": "You better hide yo’ sheep, hide yo’ goats, cuz they rapin’ errybody in here.",
                "author": "least_counties_ever"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "CNN: “Afghans in America are now living in fear.”",
        "score": 1135,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good",
                "author": "Salty_Sailor"
            },
            {
                "raw_content": "I want them living in fear back in Afghanistan",
                "author": "PapaPepe"
            },
            {
                "raw_content": "They shouldn't be living in fear, they should be living in Afghanistan.",
                "author": "f_bastiat"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Treasury Sec. Scott Bessent is IMMEDIATELY cutting off all federal benefits to illegal aliens, preserving them for citizens only, per President Trump's orders.",
        "score": 1869,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why has it been allowed for last 11 mos? If they had this capability all along???",
                "author": "rextexMG"
            },
            {
                "raw_content": "I wonder how much lower mine and my small company’s health plan premiums would be if we weren’t being tagged for “our share” of 30 million illegals on the Obamacare and Medicaid dole.??",
                "author": "DagneyTaggart"
            },
            {
                "raw_content": "This should have been basic law since the start of the welfare state.",
                "author": "AerialRush"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "How corrupt is Congress? You can get 70 Senators to approve sending American taxpayer money to Ukraine to be stolen but you can’t get 51 Senators to approve passing election integrity laws for America. It’s sickening.",
        "score": 374,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Even if SAVE act is passed, it solves just 1% of the problem. The only thing it does is demanding proof of citizenship to vote which will be verified by leftist election workers when they register your vote. Putting illegals on voter rolls and casting mail-in ballots on their names, casting mail-in ballots of inactive voters, tabulators rigging the count, etc. These are majority of the voter fraud. Trump needs to understand the big picture or we lose to voter fraud again.",
                "author": "Odyssey"
            },
            {
                "raw_content": "It's corrupt to the point where you can hang all of congress and at worst, you've just hanged 1 or 2 innocents.",
                "author": "ReleasetheList"
            },
            {
                "raw_content": "Blame Rand Paul because he will never vote to nuke the filibuster. He votes however Murkowski and Collins vote.",
                "author": "possibletower"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "“Trumps Economy”??? You lying scumbags, its the greatest economy ever!",
        "score": 700,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Greatest economy ever? You weren't alive in the 50s, 60s, or 80s, were you?",
                "author": "Ronaldus"
            },
            {
                "raw_content": "Greatest economy ever? OP, you are either 12 years old or a retarded phaggote.",
                "author": "SenorTrumper"
            },
            {
                "raw_content": "That’s retarded",
                "author": "-f-b-i-"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Well, son'of'a' bitch......",
        "score": 898,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why the hell is gas $3.50 a gallon in Arizona?",
                "author": "awsure"
            },
            {
                "raw_content": "Meanwhile.. holding steady at nearly $6/gallon in the communist empire of Washington State.",
                "author": "Tookens"
            },
            {
                "raw_content": "Just went below $3.00 a couple of weeks ago here. Holding steady at $2.87 for the past few days.",
                "author": "Returningtogod"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Apple and Intel Rumored to Partner on Mac Chips Again in a New Way (Apple allegedly planning on using 18A for M7 and possibly M6)",
        "score": 296,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Can see Apple doing high end on TSMC's latest node and lower end on latest Intel node going forward, two track strategy.",
                "author": "Dangerman1337"
            },
            {
                "raw_content": "All I want to see is an AMD CPU fabbed on an Intel process. My life would finally be complete!",
                "author": "GenZia"
            },
            {
                "raw_content": "I doubt there's any real substance to this. If this is true in any capacity, it is likely just Apple playing games to have a more favorable contract with TSMC and nothing they have any real intention of doing.",
                "author": "III-V"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Dutch chipmaker Nexperia urges Chinese units to help restore supply chain",
        "score": 42,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So they took over a Chinese owned subsidiary and expects China to play nice? Wtf were they thinking?",
                "author": "max1001"
            },
            {
                "raw_content": "I doubt they will get much cooperation considering they fired almost every Chinese executive",
                "author": "tengo_harambe"
            },
            {
                "raw_content": "Fuck around and find out.",
                "author": "1mVeryH4ppy"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel Battlemage Graphics Enjoyed Nice GPU Compute Performance Gains In 2025",
        "score": 39,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "RTINGS: Asus ProArt Display 6K PA32QCV Review",
        "score": 40,
        "text_content": "### Office verdict: **8.9** The ASUS ProArt Display PA32QCV is excellent for office use. It has a high 6k resolution that helps result in sharp text, but its aggressive matte coating causes text to look hazy. It also has a big 32-inch screen that helps with multitasking with various windows next to each other. Thanks to its high screen brightness and superb reflection handling, which helps minimize glare, it's even a great choice to use in a well-lit office space. Lastly, it comes with productivity features, including Thunderbolt support with daisy chaining, a KVM switch, and an ergonomic stand that's easy to adjust. **Pros** * High pixel density for sharp text and detailed images. * Large 32-inch screen. * Gets bright and reduces glare easily. * USB hub includes Thunderbolt 4 and a KVM switch. * Supports daisy chaining. **Cons** * Aggressive matte coating causes haze. ### Editing verdict: **8.0** The ASUS ProArt Display PA32QCV is great for editing. Its 32-inch screen helps if you need to multitask with various windows open, and its high 6k resolution makes images look detailed, and text looks sharp. It comes with picture modes for various color spaces that you may work with, including an sRGB mode, which you need to calibrate for a perfectly accurate image because it has a cold color temperature. It's a bad choice for editing content in HDR, though, as it has a low contrast ratio and its local dimming feature fails to improve the black levels. On the plus side, its Thunderbolt support is great if you want to connect a Thunderbolt laptop, like a MacBook, and it has a few features to help with productivity, like daisy chaining and a KVM switch. **Pros** * High pixel density for sharp text and detailed images. * Large 32-inch screen. * Gets bright and reduces glare easily. * USB hub includes Thunderbolt 4 and a KVM switch. * Supports daisy chaining. * Accurate sRGB mode. **Cons** * Blacks look gray due to low contrast. * Highlights don't pop in HDR. * Cold color temperature out of the box. * Aggressive matte coating causes haze.",
        "comments": [
            {
                "raw_content": "I wrote about the hazing here https://old.reddit.com/r/HiDPI_monitors/comments/1oapqxh/psa_the_matte_coating_on_the_asus_pa32qcv_is_very/ If you don’t have to deal with glare, it is pretty bad. Light small detail on dark background (text in dark mode) is bad. With brighter backgrounds it is not too noticeable. Glare reduction is next level though. Response times are high, but that is true for all high DPI and high color accuracy non OLEDs on the market unfortunately.",
                "author": "moridinbg"
            },
            {
                "raw_content": "You can also vote on which monitor RTINGS reviews next: [https://www.rtings.com/vote/monitor](https://www.rtings.com/vote/monitor) I myself will be very interested in a review of the **LG 32U990A-S**, a competing 6K monitor based on a LG-panel. It would also be very interesting to see a review of the [KTC H27P3](https://www.rtings.com/discussions/-JyCp_ldotuoHRtH/review-updates-ktc-h27p3), the cheapest 5K monitor currently available ($499).",
                "author": "Balance-"
            },
            {
                "raw_content": "Like how much haze? Like inferior to other monitors?",
                "author": "TreadItOnReddit"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Techspot - The Best CPUs - Late 2025 Update",
        "score": 24,
        "text_content": "",
        "comments": [
            {
                "raw_content": "[removed]",
                "author": "None"
            },
            {
                "raw_content": "9700X and 9600X are terrible value",
                "author": "LuluButterFive"
            },
            {
                "raw_content": "TLDR: Entry-Level Upgrade: AMD Ryzen 5 7500F, Price: ~ $145 Best Mainstream CPU: Ryzen 5 9600X (Gaming) or Core Ultra 5 245K (Productivity), Price: ~ $188 Best Value Mid-Range CPU: Ryzen 7 9700X (Gaming) or Core Ultra 7 265K (Productivity), Price: ~ $296 Best Gaming CPU: AMD Ryzen 7 9800X3D, Price: ~ $449 Best Productivity CPUs AMD Ryzen 9 9950X3D or AMD Ryzen 9 9950X, Price: ~ $664",
                "author": "Antonis_32"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Asus GeForce RTX 5090 Matrix Test: Benchmarks",
        "score": 11,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I hope they load balance the connector on the 60 series in 2027. The self immolating connector everyone is forced to use is a little silly. Have AIBs “cheating” by adding extra proprietary connectors on that are incredibly niche. Is interesting to see there is some room for uplift with more power, that price is crazy.",
                "author": "youreblockingmyshot"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nintendo says Prime 4 is the start of a new story, and the Prime Trilogy ended its arc with Prime 3.",
        "score": 975,
        "text_content": "https://www.nintendo.com/jp/topics/article/ed98179e-b57e-4ae8-8ac5-3cdc5d721661 This is something that has been known by longtime fans, and reaffirmed by the series producer in 2015, but in case newcomers weren't aware, it's totally fine to not have played Prime 1-3 before starting 4.",
        "comments": [
            {
                "raw_content": "Well it's not like they would have ever said that you have to play Prime 2 and 3 in order to understand Prime 4.",
                "author": "Caciulacdlac"
            },
            {
                "raw_content": "I've occasionally thought they should have dropped the \"4\" for this reason. It's odd to hear them say it's a break with the past but leave the name as is.",
                "author": "CalypsoSauvin"
            },
            {
                "raw_content": "i mean we killed metroid prime in 3 so..",
                "author": "pkmnBlue"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Metroid prime 4 is the best looking switch game so far",
        "score": 217,
        "text_content": "Just played the demo twice in target in 4k and again in 120hz and wow... It's really that good.... I can't wait for the 4th I can't believe it's finally here",
        "comments": [
            {
                "raw_content": "Better or equal to Donkey Kong Bananza? That looked and played great! So looking forward to this too!",
                "author": "msshirow"
            },
            {
                "raw_content": "I just played the demo today as well. They’re not kidding when they say that the previews and trailers aren’t doing the game justice. The graphics and sound are amazing and the combat is incredibly engaging. When it was over I was absolutely left wanting more.",
                "author": "honorable_doofus"
            },
            {
                "raw_content": "I happened to have a need to go to Target today, so I thought I'd stop by and see if they have a demo for it. After waiting like 20 minutes for a kid to finish playing DK Bananza, I went to look for it and they only had a trailer, lol.",
                "author": "GarionOrb"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Pre load Prime 4 now (29gb) so you don't have to waste precious time downloading when it's release next week",
        "score": 65,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is excellent! and i’m glad the download size is not enormous. For games that i have REALLY high anticipation for, i always wait for the release day to go buy my physical copy, it just preserves the magic of gaming for me.",
                "author": "davidrevilla311"
            },
            {
                "raw_content": "Rather get physical and save 29 gig than be able to play the second the game releases tbh",
                "author": "jrpbateman"
            },
            {
                "raw_content": "I’m waiting for reviews. Which is what everyone should be doing imho.",
                "author": "WilliamG007"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Isn't this not out yet??",
        "score": 184,
        "text_content": "Found Assassin Creed Shadows for Switch 2 at Walmart",
        "comments": [
            {
                "raw_content": "Official release date is Dec 2",
                "author": "InevitableFly"
            },
            {
                "raw_content": "> Isn’t this not Yes, and somehow also no.",
                "author": "TheMonkeyInCharge"
            },
            {
                "raw_content": "Isn't this not",
                "author": "Business_Display_149"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "guys.... why isn't gameshare working....",
        "score": 233,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You need to use the cable https://preview.redd.it/zr5bs2mki24g1.jpeg?width=1080&format=pjpg&auto=webp&s=d23a3e3b46360c9f7f26fcd6cf0905e2aec40bdc",
                "author": "SnooTangerines4321"
            },
            {
                "raw_content": "You probably just have a bit of peanut butter on your switch 2",
                "author": "TabouletVR"
            },
            {
                "raw_content": "Instruction unclear, stuck in vacuum cleaner",
                "author": "TC_Otto_38"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Saw metriod prime 4 demo at store today thank its going to look amazing",
        "score": 17,
        "text_content": "I was at best buy today and they had the metriod prime 4 demo set up only in handheld mode. I dont really play handheld mode i am like 99.9 dock. I didnt want to spoiler much and this will be my first metriod game i tend to hate fps just dont like first person view but thought the trailers and such looked great. Anyway because i didnt want to spoiler much i only played like 2 minutes but it looked really really good so if it looked that good can only imagine how good it will look on my oled 55 inch tv",
        "comments": [
            {
                "raw_content": "I’m looking forward to it. And you’ve reminded me. I’ve not played the first one on my S2 yet!! I don’t think it’s enhanced in any way on the S2 from the 1 but on the 1, it was crisp and buttery smooth anyway. I’m just at _that_ boss…",
                "author": "PsychologicalCar2180"
            },
            {
                "raw_content": "I can't wait to play it! It'll be coming out very soon now.",
                "author": "Williekins"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "My 6 year old won’t play Mario Kart World because it’s “too hard” compared to Mario Kart 8. Anyway I can make it easier for him?",
        "score": 199,
        "text_content": "For single player, he insists on Mario Kart 8 because he’s able to consistently get 1st place. (I know I know, but he’s 6 years old so I’m just letting him be in his little world) Is there something I’m missing in World that would make it easier for him?",
        "comments": [
            {
                "raw_content": "Did he use any of the drive assist features in Mario Kart 8? If so, those can be turned on in World as well I think.",
                "author": "AtlanticRambler"
            },
            {
                "raw_content": "Turn on auto everything. My 4 year old sits there pressing the 'look behind' button for most of the race and still wins",
                "author": "RevolutionaryPeak610"
            },
            {
                "raw_content": "Well I'm a grown ass man and can't always get 1st at mario kart world.",
                "author": "R_Boa"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "New update for wifi?",
        "score": 22,
        "text_content": "Tried logging on a wifi network that requires website login. Was working for the past 2 months but now it’s disabled. Part of the new update?",
        "comments": [
            {
                "raw_content": "I know it’s more hoops than you probably want to jump through, but a travel router will allow you to connect the router to the WiFi and re-broadcast a different network that you can use multiple devices to authenticate. Use your phone to log in and all devices under the router will work.",
                "author": "Dobermaniac"
            },
            {
                "raw_content": "Yes!",
                "author": "Trami_Pink_1991"
            },
            {
                "raw_content": "Weird it’s working for me I did it last night…",
                "author": "Leoowwww"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Geoff Keighley posts cryptic game image on twitter with the caption ¨regal.inspiring.thickness¨",
        "score": 303,
        "text_content": "[https://xcancel.com/geoffkeighley/status/1994609007672381595#m](https://xcancel.com/geoffkeighley/status/1994609007672381595#m) , Elder scrolls 6 sneak peak or something smaller?",
        "comments": [
            {
                "raw_content": "What Three Words puts it near Joshua Tree in California.",
                "author": "Onsiterecordings"
            },
            {
                "raw_content": "This looks like part of a Diablo cinematic.",
                "author": "Midnight_M_"
            },
            {
                "raw_content": "The image makes me think of God of War, ngl.",
                "author": "Evol-Chan"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "MP1st: New Dead Rising Game in Development, Now Set In Hollywood",
        "score": 879,
        "text_content": "[source](https://mp1st.com/news/new-dead-rising-game-development-set-in-hollywood) It is claimed that this new DR game would be set in Hollywood, inside a movie studio. Frank West is returning, and the timeline could be set after DR1 and before DR2.",
        "comments": [
            {
                "raw_content": "they really wrote themselves into a corner with DR4, didn't they?",
                "author": "scott1swann"
            },
            {
                "raw_content": "Movie set has potential as a location. I hope they get around to doing a cruise ship one eventually. Those things are designed from the ground up to be DR settings",
                "author": "Crazykiddingme"
            },
            {
                "raw_content": "I maintain that *Off The Record* was the best instalment of the series, in that it had the core DR1/2 gameplay -nailed-, while having enough QoL improvements to make it a better game. (Saying that, I did enjoy that *DR3* is the only game in the series where you actually meet a competent survivor who doesn't actually need saving. After three games of walking civilians to safe rooms it made for a change of pace...)",
                "author": "Goldenboy451"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Chris Redfield, Sherry Birkin (adult) and Excella Gionne have leaked to be in RE Survival Unit.",
        "score": 85,
        "text_content": "All of them were discovered in the files of Android version of the game. https://residentevil.com.br/noticias/chris-redfield-sherry-birkin-e-excella-gionne-estao-nos-arquivos-de-resident-evil-survival-unit/",
        "comments": [
            {
                "raw_content": "I would love to see Sherry again, she was so likeable in 6 and her campaign was my favorite",
                "author": "Vinjassvp"
            },
            {
                "raw_content": "Don't leak any of this game. Doesn't even deserve the effort to",
                "author": "PER2D2"
            },
            {
                "raw_content": "wtf is RE Survival Unit?",
                "author": "Fluffy_Moose_73"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Nexus Point News: Netflix’s ‘Assassin’s Creed’ Set To Explore Ancient Rome",
        "score": 246,
        "text_content": "[source](https://www.nexuspointnews.com/post/exclusive-netflix-s-assassin-s-creed-set-to-explore-ancient-rome) According to the article, the series will be set in ancient Rome and feature historical figures like Emperor Nero and Seneca the Younger.",
        "comments": [
            {
                "raw_content": "Bruh we're really getting an AC Netflix series set in ancient Rome before an AC game set in ancient Rome. That's like the most iconic setting they haven't covered yet now that they've finally done feudal Japan.",
                "author": "-ImJustSaiyan-"
            },
            {
                "raw_content": "Considering Netflix's track record with historical settings this is going to be a disaster",
                "author": "Greitot"
            },
            {
                "raw_content": "I’m sure they are going to put a Kassandra cameo there",
                "author": "starfieldnovember"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "NateTheHate states he doesn’t think Prince Of Persia Remake will be shown at The Game Awards.",
        "score": 260,
        "text_content": "https://xcancel.com/NateTheHate2/status/1994469129630212552 Reliable insider NatetheHate says he doesn’t think it will be shown at the the game awards contradicting Insider Gaming’s report. I feel insider gaming was just speculating at possibly seeing at The Game Awards. https://insider-gaming.com/prince-of-persia-sands-of-time-remake-release-update/ Kinda strange if it’s gonna release in mid January not to show it at The Game Awards. Edit: Insider Gaming Podcast goes into detail a little bit more about this topic here starting at 15:55: https://www.youtube.com/watch?v=gDN7P9kiMfU",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "What about Ac black flag remake?",
                "author": "Objective_Love_6843"
            },
            {
                "raw_content": "Guys, I think there will be game announcements at TGA, but I don't know what exactly they are.",
                "author": "TheCattBaladi"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "MasGamers: Silent Hill 1 remake set to be unveiled in TGA 2025 according to a well-informed Japanese source.",
        "score": 679,
        "text_content": "Looked through their website, they seem to be a Spanish news article company which has a pretty big following. They haven’t made an article about it yet, just posts on their social media platforms so take this with a grain of salt. https://www.instagram.com/p/DRh63Ebj8XY/?igsh=MWlwYWo1N212MHI4dQ==",
        "comments": [
            {
                "raw_content": "That seems… very soon to me. I guess they could do a cinematic trailer, no gameplay of course",
                "author": "Numerous_Ad_9579"
            },
            {
                "raw_content": "A short teaser I can see, much more seems really unrealistic",
                "author": "ChuckMoody"
            },
            {
                "raw_content": "Maybe show Townfall first?",
                "author": "OrangeLightning7895"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Ubisoft Job Ad Suggests Rumored Crew Sequel Now In Development; Points To AI-Powered Level Design",
        "score": 174,
        "text_content": ">Ubisoft Ivory Tower is currently hiring a Senior Level Designer for an unannounced project. The studio has historically worked exclusively on the The Crew franchise for Ubisoft, and with recent rumors from reliable sources stating that the next Crew game has already been greenlit, it seems the team has begun working on this project. >Looking at the qualifications section of the job listing also reveals something interesting. The qualifications ask for experience with AI-driven level design, more or less confirming that the next Crew title will make use of the technology for its level design. Source: https://clawsomegamer.com/ubisoft-job-ad-crew-sequel-development-ai-powered-level-design/",
        "comments": [
            {
                "raw_content": "AI-driven level design could just mean that people created level elements or chunks and then the actual levels get randomly generated by the internal algorithm. That kind of stuff has been around for like 30 years, but now they label it as AI to sound modern and better for investors.",
                "author": "Meitantei_Serinox"
            },
            {
                "raw_content": "Are they just addicted to losing money",
                "author": "fayhee98"
            },
            {
                "raw_content": "At least half of this sub thinks AI in games started with Chatgpt and alike lmao.",
                "author": "sandblast5391"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Fortnite Chapter 7 - MiniMap leaked",
        "score": 12,
        "text_content": "Chapter 7 minimap leaked. The leak is shared by [SkexieFN ](https://xcancel.com/SkexieFN/status/1994602518006173946?t=spjrCYrp66F_quOptxvPRQ&s=19)on X.",
        "comments": [
            {
                "raw_content": "“Sus Studios” 100% fake.",
                "author": "bytolgakoz"
            },
            {
                "raw_content": "Fake.",
                "author": "Bunie89"
            },
            {
                "raw_content": "lmao not real jfc those names",
                "author": "kikimochaluna"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Massive improvements thanks to Intel Arrow Lake: Lenovo ThinkPad P14s Gen 6 laptop review",
        "score": 7,
        "text_content": "",
        "comments": [],
        "subreddit": "intel"
    },
    {
        "post_name": "After Ditching Intel for Its Own Silicon, Apple Now Appears Ready to Return for Future MacBook Chips Built on the 18A-P Process",
        "score": 11,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"Lowest end\" as their start point may in fact be a good thing. Generally, although this isn't *strictly* the case with Apple, lower-end products tend to be the volume movers, and the main scare point with Intel currently is being able to fill out whatever capacity they end up building.",
                "author": "RJsRX7"
            },
            {
                "raw_content": "Lower end usually one of the most high selling especially on emerging market In This economy",
                "author": "heickelrrx"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "ADLINK W890 motherboard brings OC support and confirms dual tier Xeon 6 Granite Rapids-WS (128-lane and 80-lane)",
        "score": 19,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Monster of a MB I guess that might be typical for a HEDT product",
                "author": "WarEagleGo"
            },
            {
                "raw_content": "Not a fan of Intel's HEDT range ever since they prohibited the capability of running regular sever Xeons starting from the X299 series. It also doesn't help that the boards and CPU's are very expensive as well.",
                "author": "HobartTasmania"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Sapphire's high-end PURE X870A white motherboard leaks out",
        "score": 112,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "the sapphire 870a pure is gonna have far worse pci-e slot spacing than the 850 pure? what were they thinking? you can see, that the 870a pure is gonna have the top pci-e slot one slot down, then have 2 empty spaces and then the 2nd x16 physical slot. this means, that any card bigger than 3 slots will block the only other good pci-e slot on the board and any card, that barely fits like a 2.8 slot card will have terrible airflow if you put a 2nd big pci-e device in the other slot. if they put the top slot into the top most position that wouldn't be an issue. why didn't they do this, which they already did with the pure 850a? WELL GOOD QUESTION. the b850 pure also has just just 2 empty slots inbetween, but that is the only way to space 3 physical x16 slots while giving each of the 2 top slots at least 3 slots of space still. so a big pci-e physical slot design downgrade and for WHAT REASON SAPPHIRE??? did the same people, that thought putting an nvidia 12 pin fire hazard on an amd card, which by now already blew up 3 times, come up with this \"brilliant\" idea? terrible design",
                "author": "reddit_equals_censor"
            },
            {
                "raw_content": "Slot spacing aside, that's a gorgeous board and as a modder it might be my new go-to white board now that NZXT has changed their aesthetics to the weird corrugated look. Can't wait to paint and UV Print all over one of these.",
                "author": "pmjm"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD quietly introduces Radeon PRO W7900D, AI PRO 9600D and AI PRO 9700S graphics cards",
        "score": 94,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Only listed in China for China exclusive market",
                "author": "Ok-Region6452"
            },
            {
                "raw_content": "Man, this is so uninteresting. Can't they launch something actually impressive after so much time?",
                "author": "RDSF-SD"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD ISP4 Linux Webcam Driver Updated For HP ZBook Ultra G1a & Future Ryzen Laptops",
        "score": 22,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "Testing Topton TOPC Ryzen HX 370 miniPC with OCuLink and USB4",
        "score": 14,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I bought this from aliexpress in the summer for a bargain £350 barebones, spent what ever I had left on the 96gb Ram. lt runs cool and quiet - great for local AI and occu-link mean that it will be used for a long time. Did you manage to get to the drivers - [https://www.toptonpc.com/driver-download/](https://www.toptonpc.com/driver-download/) its here on this list but there is a link but its a failed link.",
                "author": "kaisersolo"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AYANEO confirms NEXT 2 powered by Ryzen AI MAX+ 395 will feature 9-inch 165Hz 2400x1504 OLED screen",
        "score": 42,
        "text_content": "",
        "comments": [
            {
                "raw_content": "For the low low price of $1800.",
                "author": "Cipher-IX"
            },
            {
                "raw_content": "Can someone please just put this chip in a freaking laptop. I feel like these handhelds have gotten so gigantic you could knock someone out with one. How are these things even comfortable to hold? I'm starting to wonder if they could just put a dGPU in a handheld and call it a day at this point, with external power supplies and active cooling. Remember when a handheld could fit in your freaking pocket. I kinda miss the GBA days. If cartridges weren't so expensive I might be tempted to bust out the SP. That was a dope handheld and I'll bet it still is. The only way I could even fit a Switch Lite in my pocket is if I put it in some oversized cargo pant shorts, and they swing back and forth and slap me in the kneecap. Dual fan. This has gotten completely absurd.",
                "author": "TurtleTreehouse"
            },
            {
                "raw_content": "Damn, this is the most interesting of the ai max handhelds by far. Finally a screen to match the performance. Clench your cheeks for the price, though.",
                "author": "Middle-Effort7495"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Colorful B850 series officially ready for 'next-generation AMD Ryzen processors'",
        "score": 16,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "MSI details PBO BCLK Booster feature on AMD 800-Series MAX motherboards",
        "score": 6,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "Getting Ready to Party Like It’s 2008",
        "score": 34,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wake up babe, bubblers said it’s 2008 again",
                "author": "PrizePreset"
            },
            {
                "raw_content": "Don't be ridiculous. There's no instability. Line will only go up forever, and the champagne will flow like a river... forever!",
                "author": "NomadicScribe"
            },
            {
                "raw_content": "Vacancy rate in 2008 was over 10%.",
                "author": "NIMBYDelendaEst"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The housing crisis is pushing Gen Z into crypto and economic nihilism",
        "score": 187,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"The skills and support to know it's not yet game over\"? In what way is it not game over if we throw up our hands over this problem and say housing will simply never be affordable again? It's not about wealth accumulation for most people in younger generations. People know they need to break away from the pack to have any chance of affording things that are *meaningful* to them. If the only way to afford to own one's own house, have children, etc. is to make significantly more than median income, one has to take risks beyond the median. Propping up housing costs at the expense of the young is the real financial nihilism.",
                "author": "saranblade"
            },
            {
                "raw_content": "Stop drinking coffee, something, something...",
                "author": "Likely_a_bot"
            },
            {
                "raw_content": "Anybody thinking it will just be economic nihilism is deluding themselves. One only needs to look south to the cartels or towards the east and Isis/isil/iswap if you want to see what can happen to wayward youth detached from the vision of a shared collective future.",
                "author": "No_Cut4338"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "AI Thought Leaders agree on General Takeoff Timeline",
        "score": 474,
        "text_content": "[Tweet](https://x.com/polynoamial/status/1994439121243169176?s=20)",
        "comments": [
            {
                "raw_content": "Watch some Chinese lab drop a continual learning breakthrough in Q1 next year",
                "author": "Full_Boysenberry_314"
            },
            {
                "raw_content": "Problem with linking predictions from ilia, Sam, Dario, lecun, and everyone else is they all have different definitions for agi",
                "author": "ZealousidealBus9271"
            },
            {
                "raw_content": "The point is it’s largely agreed that breakthroughs are required. That’s not a timeline anyone can meaningfully offer, because it’s unknown by definition. If we knew, we wouldn’t need a breakthrough. Any prediction based on something axiomatically obscure to the predictor is not going to be accurate except perhaps by accident 🤷‍♀️",
                "author": "sillygoofygooose"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Remember Orion, which was supposed to be 5.0? The training failed so they launched it as 4.5. So the foundation model for 5+ is still 4o. OAI really needs to figure this out.",
        "score": 79,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It doesn't imply the foundation model for 5+ is 4o. It says they haven't completed a successful pre-training run for a new \\*\\*frontier\\*\\* model since GPT-4o. They pretrained a new model for GPT-4.1, which was explicitly not a frontier model. The rumor is that GPT-5 is based on GPT-4.1, and o3 and o1 are based on GPT-4o.",
                "author": "Klutzy-Snow8016"
            },
            {
                "raw_content": "https://newsletter.semianalysis.com/p/tpuv7-google-takes-a-swing-at-the",
                "author": "GamingDisruptor"
            },
            {
                "raw_content": "5.1 could be 4.1 post trained. it has a distinctly different writing style in many ways.",
                "author": "XInTheDark"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "We are getting Shipmas 2025",
        "score": 91,
        "text_content": "[Tweet](https://x.com/_dmca/status/1984847912770421107?s=20)",
        "comments": [
            {
                "raw_content": "* **Day 1:** Dark Mode Contrast Adjustment * **Day 2:** Haptic Feedback on \"Regenerate\" Button * **Day 3:** Enterprise SOC2 Type III Compliance Badge * **Day 4:** Bulk Archive for Already Archived Chats * **Day 5:** New \"Stop Generating\" Square Icon * **Day 6:** Santa Voice (Removal) * **Day 7:** Terms of Service Font Update * **Day 8:** +1 Message Limit Increase * **Day 9:** Search Bar Rounded Corners (12px) * **Day 10:** Canvas Cursor Blink Rate Optimization * **Day 11:** DALL-E 3 \"Safety\" Watermark 2.0 * **Day 12:** Sora Waitlist Signup Form",
                "author": "Funkahontas"
            },
            {
                "raw_content": "Shipmas was fun but it also led to insufferable complaints on the \"stocking stuffer\" days. They should focus on impactful updates, rather than committing to an unreasonable schedule that'll draw more attention than necessary to releases that would otherwise be a lowkey blog post. also it feels like ages since I've seen a chubby tweet here",
                "author": "micaroma"
            },
            {
                "raw_content": "How can she ship?",
                "author": "DownvoteDaemon"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Google CEO, Sundar Pichai: The internal teams are already pre-training the next generation, with constant innovation pushing the full stack into 2026",
        "score": 452,
        "text_content": "\"Gemini 3.0 Flash is coming, and it's likely our best model yet because it helps developers serve more users efficiently\" 2.5 flash has been awesome. Can't wait for 3 flash. I wonder when they'll transition to a new architecture. Will G4 be LLM or something else? https://youtu.be/iFqDyWFuw1c?si=4iTTqJLLX2ielEqp",
        "comments": [
            {
                "raw_content": "Unfortunately, he said the pre-training teams are *thinking* about the next generation, not already training it. 15:39 [https://youtu.be/iFqDyWFuw1c?t=939](https://youtu.be/iFqDyWFuw1c?t=939)",
                "author": "pavelkomin"
            },
            {
                "raw_content": "I wonder if google will address the code limits being slightly restrictive around 1000 lines of code. Most ive gotten from the web app was 1577 lines of code without having to complain, moan and manipulate gemini 3.0 to get more than that Most of the time it will condense/obliterate your code to get it to around 978 lines of code.. 2.5 pro on the overhand will spit out 3000 lines without a care or yonder in its brain..",
                "author": "peachy1990x"
            },
            {
                "raw_content": "I'm a big fan of Flash models. I use the Gemini 2.5 Flash more than any other model. It's fast, cheap, smart, and almost unlimited. I'm eagerly awaiting the Gemini 3 Flash.",
                "author": "DepartmentDapper9823"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Ilya on his interview",
        "score": 706,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I mean anyone who actually listened to what he said would have gotten that.",
                "author": "Ancient_Bear_2881"
            },
            {
                "raw_content": "This was the frustrating thing about a significant portion of the reactions to this interview. People heard what they wanted to hear.",
                "author": "TFenrir"
            },
            {
                "raw_content": "[Noam Brown followed up with this](https://imgur.com/ghF0wFz) tl;dr breakthroughs needed for AGI are thought by many researchers to be 20 years away at most (with many thinking it'll be sooner), but current paradigm will still be a massive economic and societal impact",
                "author": "deleafir"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Neuralink Patient Trains FPS Aim Using His Thoughts",
        "score": 468,
        "text_content": "",
        "comments": [
            {
                "raw_content": "should ban him for aimbotting",
                "author": "NFTArtist"
            },
            {
                "raw_content": "Neural plasticity: I accepted this challenge! How amazing human brains are!",
                "author": "nsshing"
            },
            {
                "raw_content": "He's literally feeding his neuron's firing data into a neural net. This man is a cyborg. Since Neural links implants are implanted in the motor cortex, theoretically they can train him use his mind to control robotic arms, giant cranes or...a giant gundamn style exoskeleton.",
                "author": "SoggyYam9848"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "xAI is hiring a video game tutor to teach Grok how to make games",
        "score": 124,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The job is really help play on Elon's account",
                "author": "Medium_Apartment_747"
            },
            {
                "raw_content": "Gonna need a League of Legends tutor soon considering that they're planning to challenge world champions next year",
                "author": "i_love_sparkle"
            },
            {
                "raw_content": "social media benchmaxxing",
                "author": "Old-School8916"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini 3 Pro's updated IQ test results have declined.",
        "score": 21,
        "text_content": "",
        "comments": [
            {
                "raw_content": "how/why?",
                "author": "TheAuthorBTLG_"
            },
            {
                "raw_content": "IQ is a stupid metric for LLMs anyway.",
                "author": "space_monster"
            },
            {
                "raw_content": "Benchmarks are increasingly meaningless. It's clear they are being manipulated by the big companies in regard to training new models. Meanwhile, the average user often gets bizarre results to common sense queries from models that are ranked at the top of benchmark listings. I'm ignoring benchmarks as they are pointless.",
                "author": "JackStrawWitchita"
            }
        ],
        "subreddit": "singularity"
    }
]