[
    {
        "post_name": "Today, I have the Great Honor of bringing a $15 Billion Dollar Defamation and Libel Lawsuit against The New York Times",
        "score": 860,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He’s president and still has time to go after his personal stuff. This guy can’t stop Fighting wow",
                "author": "cardinaldrones"
            },
            {
                "raw_content": "\"The New York Times net worth, which is represented by its market capitalization, is approximately $9.59 billion as of September 12, 2025.\" This will bankrupt them. And they deserve it.",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "Don't settle, go to discovery and trial, we want to see everything.",
                "author": "LastHearth"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "You guys know what to do.",
        "score": 901,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Took me a moment to realize this is from 5 years ago.",
                "author": "AmericanJawa"
            },
            {
                "raw_content": "YES. ALL HAIL CHARLIE! #IMCHARLIE",
                "author": "guywholikesDjtof2024"
            },
            {
                "raw_content": "He needs to classify ALL TRANNIES as terrorists.",
                "author": "RogueLeaderX"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Dem-city restaurant owner pleads for help after string of attacks on staff at burger joint",
        "score": 490,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"TEENS\"",
                "author": "Hangemh1gh"
            },
            {
                "raw_content": "Didn't you vote for this, you fat cunt?",
                "author": "AwShitHereWeGoAgain"
            },
            {
                "raw_content": "Stop hiring hooligans that attract more hooligans to fight them. Don't open restaurants in blue cities with high black population. That should take care of all your problems.",
                "author": "bananaguard62"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Thousands of liberals are opting to get fired, rather than keep their mouth shut.",
        "score": 1665,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Are they getting fired by a 30-06? No? Then I don't want to hear their complaints.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Andrea Hsu maiden name CHICOM",
                "author": "Sunnybat2"
            },
            {
                "raw_content": "There's not much self control on the left. Verbal violence is also hurtful just as physical violence. When you work for other people you are expected to be representable. Getting fired for not taking the vax was the best solution for the employee. Getting fired for running your mouth off was the best solution for the employer.",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "GUTTFELD: Don't play that BULLSHlT with me! We don't care about your 'both sides' argument. That SHIT is DEAD. 'What about this, what about that?' We are not doing that because we SAW IT HAPPEN! We saw a young bright man ASSASSlNATED — and we know who did it! The media is dead to us on this story.",
        "score": 2161,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fuck the left",
                "author": "-f-b-i-"
            },
            {
                "raw_content": "He really lit her up...",
                "author": "Lance_Romance"
            },
            {
                "raw_content": "There is only ONE violent political party in America. Guns aren't the problem - liberals are the problem.",
                "author": "RedditStillSucks"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "What they created they can't stop; they've lost control and the DNC has no idea whats coming",
        "score": 1864,
        "text_content": "",
        "comments": [
            {
                "raw_content": "'Exposure to true information does not matter anymore. A person who is demoralized is unable to assess true information.'",
                "author": "CovfefeAnon"
            },
            {
                "raw_content": "Charlie Kirk was a great man. A role model. Fuck. Every time I remember his smile, and the way he greeted everyone around him I start tearing up. Anyone celebrating his death is a fucking demon. The video of him being killed will never ever leave my brain, but seeing it was necessary to truly see the EVIL we are up against. RIP Charlie. One day we will meet again in heaven, brother.",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "Just had a conversation with close family. They literally said this is right wing extremists killing right wing extremists. They literally think the shooter is right wing and follows Nick Fuentes. These people are literally possessed by demons. They refused to look at any of my \"fascist\" propaganda",
                "author": "daveyistheman"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "MAGA AF dropped a meme bomb...this is the hill I guess we will all die on.",
        "score": 1000,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Welcome to the arena. You are in a war. Good or Evil pick a side. Do it now. No compromise. God wins. Biblical Christianity is true. Genesis is true. Audit NGO's. Tarriff tyrannical countries into the DIRT.",
                "author": "guywholikesDjtof2024"
            },
            {
                "raw_content": "I found out how many people would celebrate murdering me back during covid.",
                "author": "PunchbowlTurd"
            },
            {
                "raw_content": "Charlie Kirk wasn't a politician, he wasn't a healthcare CEO. He didn't have any power over anyone's life. He was just a young guy with an opinion who had open dialogue on college campuses. And they killed him for that and celebrated. And they'd do the same to all of us.",
                "author": "MAGA1774"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Pro-Palestine “protestors” are trying to hijack UTSA’s Charlie Kirk vigil, but THOUSANDS of patriotic students are drowning them out by chanting “CHARLIE! CHARLIE!”",
        "score": 1195,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Can we stop being nice yet?",
                "author": "TennesseeScorpio"
            },
            {
                "raw_content": "Fuck Palestine, Fuck Israel, fuck the middle east. You're on the wrong side of the globe.",
                "author": "Valensiakol"
            },
            {
                "raw_content": "Can we deport these Pro-Palestine \"Protesters\" to Palestine and take Greta with them too.",
                "author": "DT170x"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "UTSA’s Charlie Kirk vigil just ended with THOUSANDS of students chanting “CHRIST IS KING!” Charlie would be absolutely FLOORED by all the young people who found God this past week ❤️",
        "score": 1113,
        "text_content": "",
        "comments": [
            {
                "raw_content": "God Bless Texas. And God Bless Charlie's Family and Friends.",
                "author": "TEXinLA"
            },
            {
                "raw_content": "# The little people are in a psychological asymmetrical war with the elite.",
                "author": "tpactionchasethevote"
            },
            {
                "raw_content": "silver lining to a dark cloud, but seeing this happening more often is a white pill moment",
                "author": "austford"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Tolerance of evil is a slippery slope",
        "score": 1521,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What they think exists on the other side of the biggest domino is a utopian communist society.",
                "author": "TrumpKirkGod"
            },
            {
                "raw_content": "I think \"bake the cake\" was probably the 3rd or 4th tile. The earliest I think was the \"we just want to marry the one we love\", to recognize gay marriage. The real goal of that movement was to provide employer's health benefits as a \"spouse\" to cover the catastrophic cost of AIDS therapies in the '80s. It's been all downhill since.",
                "author": "10MeV"
            },
            {
                "raw_content": "Been saying that for years. Homosexuality is a gateway to pedo town. They’re all evil unless they renounce the lifestyle. It means nothing if they’re a conservative fag. They must equally reject the ways of the fag.",
                "author": "RedCapNation"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🧵🚨 MAJOR BREAKING: State Department & UN ties to Armed Queers SLC leader now confirmed 🚨🚨",
        "score": 1091,
        "text_content": "",
        "comments": [
            {
                "raw_content": "there it is. The UN. That is the fly in the ointment. The UN is on a mission to take over the whole world and I pray God sees this and deals with it accordingly since none of them in the UN loves Jesus at all and they are the enemy.",
                "author": "grannylovestrump"
            },
            {
                "raw_content": "Witness my TOTAL lack of surprise.",
                "author": "AFferalAF"
            },
            {
                "raw_content": "What a shocker. We find out that yet again our tax dollars are being used to terrorize us.",
                "author": "Trump454748"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This asshole attempted to ruin a Charlie Kirk memorial and got bear sprayed for his trouble. And he cried like a little bitch. (MORE OF THIS)",
        "score": 899,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Of course a couple libtard white women are comforting their hurt pet monkey.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Distinct lack of handcuffs on that fucker.",
                "author": "BlackJack1776"
            },
            {
                "raw_content": "\"Happy Juneteenth\" fucking white women, I swear.",
                "author": "RustySheckelford"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Every Demorat in America",
        "score": 738,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wondering which side they'd be choosing if Iryna wasn't a beautiful young White woman but if instead she was some rainbow haired tranny. Would they choose the black, or the tranny?",
                "author": "magapatriot_pa"
            },
            {
                "raw_content": "Every single dead is that fucking goblin's fault.",
                "author": "BilbroNaggins"
            },
            {
                "raw_content": "Well is it weren't for hypocracy, wtf would they have besides aids and covid?",
                "author": "ThouShallNotSteal"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Vicious little dick",
        "score": 1088,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No examples of this \"dehumanizing.\" Just parroting the narrative.",
                "author": "26magarat"
            },
            {
                "raw_content": "This mother fucker is the biggest pedophile in California political history he is directly responsible for a 22 year old to have sex with a 12-year-old and getting rid of the sex offender list in California. Fuck this guy he is the biggest vile piece of shit",
                "author": "JayKay1776"
            },
            {
                "raw_content": "Disgusting fag",
                "author": "IslandMan69"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Texas Governor Greg Abbott: The Texas Education Agency is investigating Texas teachers whose actions called for or incite violence following the Charlie Kirk assassination. Those educators—more than 100–will “have their teacher certification suspended and be ineligible to teach in Texas.\"",
        "score": 1960,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fucking beautiful if this actually happens.",
                "author": "SwampMonsterJesus"
            },
            {
                "raw_content": "These evil people should NOT be teaching our children.",
                "author": "Nantucketghost"
            },
            {
                "raw_content": "Holy shit. These are the GOP balls we've been looking for.",
                "author": "nakedjay"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨FOX NEWS ALERT: Charlie Kirk’s ASSASSIN is on SUICIDE WATCH 🚨",
        "score": 725,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There's no question he should die. But don't let that piece of shit die on ***his*** terms. No, no. He needs to die on ***our*** terms.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "I want multiple CCTV cameras (THAT'S WORKING) on the cell door.",
                "author": "Scatter-Shot"
            },
            {
                "raw_content": "I hope his life (whatever remains of it) is absolutely fucking miserable, and he spends every single moment thinking about taking his own worthless fucking life, but is unable to",
                "author": "magapatriot_pa"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: President Trump just OFFICIALLY surged federal resources to Memphis, Tennessee, creates the \"MEMPHIS SAFE TASK FORCE.\" Chicago is NEXT. National Guard, FBI, DEA, ICE, DHS, US Marshals, AND MORE! \"This task force will be a replica of our efforts [in DC].\"",
        "score": 989,
        "text_content": "",
        "comments": [
            {
                "raw_content": "can we just arrest some fucking Democrats please? That is all I want for Christmas. Just one?! really this is all I care about at this point. I certainly don’t care about cleaning up blue shithole cities. Let the joggers kill each other.",
                "author": "leakmouth"
            },
            {
                "raw_content": "Excellent news! Memphis is currently THE most violent city in the US. Do St Louis and Chicago next. The normal everyday people who live in these places deserve a peaceful life.",
                "author": "RoninIV"
            },
            {
                "raw_content": "I been to Memphis. Never seen so many just hanging out in the gas station parking lot.",
                "author": "KamamblaToe"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump says he would designate Antifa a domestic terror organization: “100%”",
        "score": 1828,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He needs to do it IMMEDIETELY. They HATE people speaking against their beliefs. They incite violence against normal people. They HATE this country They are terrorists. They need to be destroyed.",
                "author": "Wrexxis780"
            },
            {
                "raw_content": "Would or will?",
                "author": "TrumpYouMagaFrenner"
            },
            {
                "raw_content": "I'll take an executive order before nightfall thanks",
                "author": "IPMang"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Facts.",
        "score": 1306,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Amen.",
                "author": "Eyepatch_McCain"
            },
            {
                "raw_content": "What a horrible dictator, making America safe.",
                "author": "Aquamine-Amarine"
            },
            {
                "raw_content": "No. I don’t want the one they fear. I want the one they SAY they fear when they are blowing everything out of proportion.",
                "author": "Oback_Barama"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Leftists Are Now Posting Hit Lists of the People They Want to Murder Next. Meet the real Left.",
        "score": 606,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’d be honored to be on their little gay list.",
                "author": "UncleTrumpsBand"
            },
            {
                "raw_content": "Gotta understand leninism. Violent overthrow of social and political order in order to usher in utopia",
                "author": "2008RonPaul2012"
            },
            {
                "raw_content": "https://rentahitman.com/ DIRECT THEM ALL HERE. https://abc7.com/post/rent-a-hitman-murder-for-hire-arrest-website/11273271/ It's a fake honeypot run by a guy who works directly with law enforcement. If anyone submits a request for a hitman, he forwards it directly to police. He's already gotten multiple people arrested. He's legit, he's been in the news and everything. See if any of these dumb asses are stupid enough to take the bait. HA HA HA",
                "author": "Death_Metal_Patriot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "China says preliminary probe shows Nvidia violated anti-monopoly law",
        "score": 493,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It means the trade talks have a likelihood of failing.",
                "author": "Professional-Tear996"
            },
            {
                "raw_content": "1,000% a front to get leverage over the U.S. in tariff/TikTok talks.",
                "author": "Mida5Touch"
            },
            {
                "raw_content": "This feels a lot like the Spider-Man (Men?) pointing at each other meme. lol",
                "author": "FembiesReggs"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel trims full-year expense outlook following Altera stake sale",
        "score": 82,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> In April, Intel agreed to sell 51% of Altera to private equity firm Silver Lake, valuing the unit at $8.75 billion, well below the nearly $17 billion Intel paid in 2015.",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "Holly shit they sold Altera. For reference Altera the second largest FPGA manufacturer behind Xilinx (which AMD bought for 40 BIL). Losing their stake in the FPGA market is just brutal.",
                "author": "atape_1"
            },
            {
                "raw_content": "1. Buy Altera 2. Completely fuck the documentation and all web links 3. Sell Altera 4. ??? 5. Profit",
                "author": "wren6991"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Expect HDD, SSD shortages as AI rewrites the rules of storage hierarchy — multiple companies announce price hikes, too |",
        "score": 89,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Was also posted in Newsmaxx... and my response there is the same as it is here: The article indicates that consumer SSDs and HDDs are not expected to be greatly impacted. Enterprise cares not for our cute little 1TB or 4TB NVME drives, and SATA is just a toy for them. (Meaning, good for us) ;)",
                "author": "RenlyHoekster"
            },
            {
                "raw_content": "I was literally just thinking today \"huh SSDs have come down in price\". Shut up, brain, I can't afford you any more.",
                "author": "INITMalcanis"
            },
            {
                "raw_content": "There's a news like that every 2 years",
                "author": "shinodaxseo"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Phoenix: Rowhammer Attacks on DDR5 with Self-Correcting Synchronization",
        "score": 37,
        "text_content": "",
        "comments": [
            {
                "raw_content": "From the article: >We demonstrate with Phoenix that all DDR5 devices from SK Hynix, [currently the largest DRAM manufacturer](https://www.chosun.com/english/industry-en/2025/04/10/KUEGT5WP7VGITHMS5CNV6LSPRM/), are still vulnerable to a new variant of Rowhammer attacks. Our reverse engineering of their in-DRAM Rowhammer mitigations reveals more sophisticated protection mechanisms, which resist all known Rowhammer patterns. To identify blind spots in the new mitigations, we conducted a series of carefully designed experiments, which revealed that the mitigation does not sample certain refresh intervals. This allowed us to craft two novel Rowhammer patterns that effectively bypass these deployed mitigations. >... **Results** >We test our Phoenix attack patterns on 15 DDR5 DIMMs from SK Hynix, manufactured between the end of 2021 and the end of 2024. We found that all 15 DIMMs are vulnerable to exactly one of the two patterns. Generally, the shorter pattern (128 tREFI intervals) is 2.62x more effective than the longer pattern (2608 tREFI intervals), leading to 4989 bit flips on average. We also analyzed the practical exploitability of these bit flips across three previously shown attacks targeting (i) page-table entries (PTEs) to craft an arbitrary memory read/write primitive (all DIMMs are vulnerable); (ii) RSA-2048 keys of a co-located VM to break SSH authentication (73% of vulnerable DIMMs); and (iii) the sudo binary to escalate local privileges to the root user (33% of vulnerable DIMMs). To demonstrate the real-world practicality, we reproduced the privilege escalation exploit from [Rubicon](https://github.com/comsec-group/rubicon) for the first time on DDR5 DIMMs and demonstrated that the average time to exploitation is just 5 minutes and 19 seconds.",
                "author": "0xdeadbeef64"
            },
            {
                "raw_content": "hey so since rowhammer attacks never go away it seems and on-die fake ecc can't stop them, we will get side band ecc with ddr6 for everyone right? RIGHT??? sth standard in servers for decades and is dirt dirt cheap. and is effectively just working memory, that doesn't have hidden data corruption happening BE DESIGN, when it works as intended or vastly worse when it fails. this time the purely evil industry will finally bring working memory to the masses right? they wouldn't shit on the public yet again as they did for decades, leaving them vulnerable to data loss, crashes and rowhammer attacks (real ecc reduces risk of rowhammer attacks succeeding) right???? right????",
                "author": "reddit_equals_censor"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "NVIDIA Moves to SOCAMM2, Phases Out Initial SOCAMM Design",
        "score": 94,
        "text_content": "",
        "comments": [
            {
                "raw_content": "[removed]",
                "author": "None"
            },
            {
                "raw_content": "Camm is not mainstream, this is the 1st time i heard about SOCAMM which is already phased out. Its gonna be a long time for these to catch up",
                "author": "good-old-coder"
            },
            {
                "raw_content": "Nvidia and awful connector designs, name a better duo. First 12V high power, now this. 12v high power only affected gamers, so they don't want to take any responsibility. now that their SOCAMM1 is not designed properly and it affects hyperscalers, there's new drafts already",
                "author": "steinfg"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[News] Western Digital Raises HDD Prices Amid Soaring Demand, Shipping Delays of Up to 10 Weeks",
        "score": 56,
        "text_content": "",
        "comments": [
            {
                "raw_content": "In order to deliver lower costs of ownership..... we will raise our prices effective immediately. Science!",
                "author": "MIRV888"
            },
            {
                "raw_content": "ah yes famously, the prices need to increase now, so that prices in the future can decrease more... yes yes let the corpo bullshit lies flow wd....",
                "author": "reddit_equals_censor"
            },
            {
                "raw_content": "I had a feeling this would happen, as 24TB (Seagate) and 26TB (WD) seem to be the upper limit for traditional perpendicular CMR (conventional magnetic recording) hard drives. 30TB+ requires HAMR (heat-assisted magnetic recording) and that's an unproven technology, so costs will rise with it. At least 24TB drives seem to be cheap right now, so get them while you can.",
                "author": "Gippy_"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "GIGABYTE intros new X870E X3D AORUS mobos with X3D Turbo Mode 2.0, support for DDR5-9000 RAM",
        "score": 8,
        "text_content": "Published Sep 12, 2025 TL;DR: GIGABYTE's new X870E AORUS X3D motherboards support AMD Ryzen 9000X3D processors with AI-powered X3D Turbo Mode 2.0, boosting gaming performance up to 25%. Featuring D5 Bionic Corsa technology for DDR5 speeds up to 9000 MT/s, advanced 18+2+2 phase VRM, and user-friendly BIOS, they deliver exceptional stability and ease of installation. [https://www.tweaktown.com/news/107701/gigabyte-intros-new-x870e-x3d-aorus-mobos-with-x3d-turbo-mode-2-0-support-for-ddr5-9000-ram/index.html](https://www.tweaktown.com/news/107701/gigabyte-intros-new-x870e-x3d-aorus-mobos-with-x3d-turbo-mode-2-0-support-for-ddr5-9000-ram/index.html)",
        "comments": [
            {
                "raw_content": ">AI-powered X3D Turbo Mode 2.0, boosting gaming performance up to 25%. Boosting up to 25% compared to what baseline? I for sure would be interested to see any review of this board to find out.",
                "author": "0xdeadbeef64"
            },
            {
                "raw_content": "This is false advertising at its finest. The CPU used here are for the memory clock are not your typical desktop chiplet AM5, its using Zen4 8700G which are monolithic die CPUs where the memory controller is in the same die. The CPUs most people here are interested in will not run anywhere near the advertised 9000MT/s, at best the golden sample 9800 X3D might reach 8600MT/s with Apex and delided direct die CPU.",
                "author": "jeeg123"
            },
            {
                "raw_content": "I could not get 8k stabilized on my Aorus 870E Pro with 9800X3D, with XMP based memory kits. Memory testing being such a chore, just decided to tighten timings at 6k. It was surprising that tighter timings were about 10% faster in Oblivion Remastered in CPU bottlenecked settings. While these new motherboards can advertise 9k, that they hit on 8000 series CPUs, even 8400MTs should improve on my results further. Of course, you have to get the FCLK to run stably at 2200 too.",
                "author": "bctoy"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Qualcomm: \"Snapdragon 8 Elite Gen 5: The name, the power, the why\"",
        "score": 35,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is so awfully written. Straight from chatgpt. Their marketing guy needs to be fired.",
                "author": "Creative_Purpose6138"
            },
            {
                "raw_content": "Straight up Qualcomm chip naming rage bait to remind us of Snapdragon Summit. Marketing geniuses.",
                "author": "EloquentPinguin"
            },
            {
                "raw_content": "Honestly, this ain't so bad. The Elite part remains. The gen naming goes in step with other processors in their portfolio.",
                "author": "deadmanslouching"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Quantum Motion Delivers the Industry’s First Full-Stack Silicon CMOS Quantum Computer",
        "score": 0,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "First time?",
        "score": 501,
        "text_content": "This is like, middle of the road for how crazy some ports can be priced from Nintendo, Still overpriced regardless of the new music/storybook pages, but there are atleast 5 more ports that are overpriced-er",
        "comments": [
            {
                "raw_content": "I mean, people were complaining then too. Especially given how DK Returns has straight up broken visuals and multiplayer has issues due to the timing on enemies still being able to be interacted with after defeat which I believe still hasn't been fixed.",
                "author": "Touma101"
            },
            {
                "raw_content": "It’s the same routine all over again. People cry about the price of an old port, then it sells millions of copies and people forget about it entirely.",
                "author": "MyLeftNut_"
            },
            {
                "raw_content": "I think the more sad part is the complaints about the single version. Which is actually cheaper than those ports to the switch were. Because weren't they like all 60 bucks?",
                "author": "Logical-Shirt9236"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "This is what I got the most hyped about",
        "score": 743,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So we are getting Danganronpa 4 with extra steps",
                "author": "DevouredSource"
            },
            {
                "raw_content": "The best announcement was in the Japan Direct https://preview.redd.it/grzq8xprmepf1.jpeg?width=1920&format=pjpg&auto=webp&s=bdaeb7485e466b31f7d5f3c360488deac5bac3c4",
                "author": "KelvinBelmont"
            },
            {
                "raw_content": "As a Mario fan I was pleased. I think I was one of the few that didn't expect a 3D Mario yet. Zelda yes but Mario no. Looking forward to replaying both Galaxies",
                "author": "darkfawful2"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "YEAHHH",
        "score": 106,
        "text_content": "WAAHOOO",
        "comments": [
            {
                "raw_content": "I just checked the app and saw that they have some tracks from Kirby Air Riders up early. How can they do that but not have a single song from Mario Kart World 😭",
                "author": "theshieldsarestillup"
            },
            {
                "raw_content": "Please add Mario Kart world lmao and Donkey Kong Country returns and tropical freeze",
                "author": "Acegolfer04"
            },
            {
                "raw_content": "Not me jamming out to Yoshi Star Galaxy theme for eight hours straight",
                "author": "LAMProductions99"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The effect of USA tariffs revealed as the European prices of the new Amiibo are €10 cheaper across the board",
        "score": 245,
        "text_content": "The latest Direct announced new Amiibo, and the USA prices made the news. Today My Nintendo Store revealed the European prices, and I thought it'd be interesting to compare the pricing across the Atlantic. For reference, historically cheaper products always had a €1=$1 conversion rate (ex. original Amiibo costed €15/$15), with more expensive items comparatively devaluing the Euro (ex. Switch 2 €469/$449). This is instead the price comparison of the new Amiibo lineup: **Metroid Prime 4 Beyond** * Samus/Sylux - $29.99 / €19.99 * Samus Vi-O-La - $39.99 / €29.99 **Super Mario Galaxy** * Mario/Rosalina - $39.99 / €29.99 **Kirby Air Riders** * Kirby/Waddle Dee - $49.99 / €39.99 Contrary to the historic price conversion, this time Amiibo in Europe are converted with a -€10 across the board, with the Samus/Sylux Amiibo keeping the same price point of the previous (more detailed) Amiibo releases. As this batch of Amiibo is the first round of accessories to be released after the tariffs have been set, this may be a first sign of what the future of pricing will be in the USA.",
        "comments": [
            {
                "raw_content": "And don’t forget the EU price includes ~20% VAT/sale tax.",
                "author": "Akaos"
            },
            {
                "raw_content": "Yup, this is why I was tired about all the \"Nintendo is greedy\" comments after the reveal of the Amiibo and Virtua boy prices. I completely understand this sentiment after the reveal of mario galaxy's prices. But people need to remember that all accessories for the switch are priced higher in America because of the tariffs, these 15%~20% increases don't exist in a vacuum and most people who commented on them prefer to ignore them than admit the truth.",
                "author": "Vanilla_Baunilha"
            },
            {
                "raw_content": "This is true of the Virtual Boy also. It’s less obvious because it’s $109 Canadian, but based on the current exchange rate that comes out to be the equivalent of $79 American.",
                "author": "hylianknight"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Me playing with my newly acquired Virtual Boy",
        "score": 233,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's a YOB LAUTRIV. You got the Temu knockoff.",
                "author": "StockHumor4768"
            },
            {
                "raw_content": "Chiropractor is in your future",
                "author": "bludothesmelly"
            },
            {
                "raw_content": "Have you gotten any eye strain or migraines yet?",
                "author": "Effective_Poem7629"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "It’s hard for me to understand why some people say that Nintendo used to be consumer-friendly in the past.",
        "score": 114,
        "text_content": "I mean, Nintendo was Never consumer-friendly since NES. They have always chased for money and searched for new business models. I like Nintendo because Nintendo makes fun games. Not because Nintendo is consumer-friendly. I'm really confused for those who say that they are disappointed for Nintendo because Nintendo is now greedy. Man, Nintendo was greedy since NES Era.",
        "comments": [
            {
                "raw_content": "Nintendo is the best of the big three as far as keeping their employees through the good and the bad times. When you see thousands and thousands getting laid off at every company and Microsoft closing down studios that they just bought, it's great to see Nintendo rarely firing employees in the news. There was also the instance of Nintendo's CEO cutting his salary for the good of the company and it's employees during the bad times. I have no issue paying extra to a company that treats their employees right and doesn't view them as expendable.",
                "author": "twovles31"
            },
            {
                "raw_content": "I always liked how they tried to have backwards compatibility with their handhelds. Playing gameboy games on the GBA SP was awesome, or being able to play GBA games on the DS required a whole extra slot that wasnt necessary but they did it. Classic games on the nintendo shop on wii and wii U were fairly priced at $5-$10 After a few years theyd have Nintendo Select games and lower their big games to $20 Playing Online used to be free (even tho it sucked lol) Wii Sports being included with the Wii was huge. I knew families that bought the Wii just for the sports game and probably never bought any other games When they had games that required the N64 expansion pack they included it with the game (DK64) Or when they introduced the Wii motion+ attachement it was included with Skyward Sword Theres things they did before that they would absolutely nickle and dime you on today. Not saying they were perfect but i thought they were player friendly for the most part",
                "author": "eyebrowless32"
            },
            {
                "raw_content": "the only examples people give of Nintendo being \"consumer friendly\" are almost always examples of Nintendo DESPERATELY trying to get people to buy their stuff cuz they're floundering hard. \"See they used to sell gamecubes for 99 dollars!\" yeah a few years after release because literally no one was buying them. GCN sold 22m in its lifetime. It's competitors, the Xbox and PS2, sold 24m and over 150m respectively. They needed gamecubes to move off the shelves so they discounted it to a degree where they took a huge loss, hoping to make it up in software sales. \"we got Nintendo Classics for CHEAP during the late Wii and Wii U era\" Yeah by the end of its life the Wii was selling like garbage (I was working in video game retail at the time, and yeah we couldn't give them away by the end) and the Wii U was a colossal failure at 13m units sold in its lifetime. They needed incentives for people to buy more, and thats how they handled it during THAT downward spin. \"They used to have gold coins for switch sales\" yeah because they were frigging TERRIFIED of people not catching onto the Switch at first and needed to drive digital sales so the Switch looked like a competent modern console that was up to par in the digital purchase sector. The closest thing Nintendo did to something that was very \"giving\" to consumers was when they started the Voucher system in mid 2019, and that can easily be pointed to as giving people a small discount in exchange for furthering the Switch's appeal as a game console where the games were as good digitally as they were physically. People just like outrage, just forget them and play your games <3",
                "author": "Playful_Lecture7784"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Are you happy with your Switch 2?",
        "score": 548,
        "text_content": "Looking back at the first 3 months of owing a Switch 2 and I have to say that I'm very pleased with the experience so far, even more so than I was with the original Switch. S1 definitely kept me busy for 7 years but if I look at the some of my favorite games they were mostly indie and then a few 1st party titles like Fire Emblem, Kirby, and Link's Awakening. Mario Odyssey and BOTW/TOTK, while nice games weren't among my favorite from their respective franchises nor was Origami King among my favorite Paper Marios. But with Switch 2 I've already played a game that I would consider for GOTY (DK Bananza) and quite a few great 3rd party experiences like Cyberpunk, Rune Factory: Guardians of Azuma, Yakuza 0, and Hitman: World of Assassination. I'm genuinely enjoying these games and making sure that I get my money's worth by not rushing quickly onto the next one. I'm also playing S2 in handheld more, due to the larger screen and sturdier build, whereas with my S1 I played almost exclusively docked. I'm very optimistic about a much more well-rounded lineup of games this time around so how are you guys enjoying your S2s so far and what are your favorite aspects of it?",
        "comments": [
            {
                "raw_content": "I love my switch, but man I really hoped there would be more switch 2 updates games. I am waiting on Xenoblade, and some of my other favorites so I can replay them. Just disappointed in that aspect, but still enjoy the system.",
                "author": "Modest_Wraith"
            },
            {
                "raw_content": "Other than battery life, I love everything about it.",
                "author": "elevenoneone"
            },
            {
                "raw_content": "I think the GameCube Virtual Console and the Switch 2 upgraded games alone have been worth it, but the fact that so many Switch 1 games look WORSE on the Switch 2 is unacceptable. We need more updates ASAP.",
                "author": "notbad4human"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Hear ye, hear ye! In this time of trouble and strife, I bring glad tidings to the people of this sub!",
        "score": 242,
        "text_content": "As you may have heard, everything is terrible. However, I have crossed these troubled lands to bring you some positive headlines, so gather round and I shall share them with you now. * After one of the most tortuous announcement to release processes of all time, **Metroid Prime 4 finally has a release date** \\- and it's less than 3 months from now. On Dec 4th, you will be able to play the first new Prime game in nearly two decades. If you like Metroid, That. Is. Amazing! * And talking of long waits...after 7 long years, **Hollow Knight: Silksong, the most hotly anticipated indie game of all time, has actually released**. And not only has it released, it's good. Very good. It's hard as fuck, but it's good. And it's cheap. You can get it for a mere $20! How amazing is that?! * In further positive pricing news, **Final Fantasy VII Remake will be just $40 - including its expansive DLC**! We're talking 50-60 hours of big, juicy AAA goodness and the chance to play one of the most storied games in history for just $40. AND it's been confirmed that parts two and three of the remade trilogy will be coming to Switch 2 too! * And those are far from the only big AAA games on the way. **Resident Evil Re9uiem and 007: First Light have both been announced as day and date releases on Switch 2**. This sort of thing never happened on Switch 1. These are huge new releases and they're coming day 1 - *and* they look good. * We can look forward to them with a fair degree of confidence, of course, because **Star Wars: Outlaws, an infamously demanding game, has just released on Switch 2 and runs well**. Nobody thought it would. Right up to release day. But it does. And it's massively improved from its original state - and if it can run well, it bodes well for plenty of other future releases, like Indiana Jones and Elden Ring (because, yeah, Indiana Jones and Elden Ring are on the way too). * And on the topic of future releases, not including Prime 4, the **upcoming first-party line-up** consists of: a new Pokemon Legends game *and* a new Pokemon spin-off, a new Splatoon spin-off, a new Fire Emblem game, a new Mario Tennis, a new Hyrule Warriors, a new Yoshi game, and Kirby AirRiders, a follow-up to a cult GameCube game that no one ever thought would be revived - but is being so in a big way with an unusually large marketing push and the full weight of the legendary Masahiro Sakurai. Now, of course, it's not all sunshine and rainbows, we all know that, but maybe take a step back from the doommongering and look around now and then. Yes, DK Bananza's DLC might be a few dollars more than you feel it's worth, but...look, look at all this! Wake up and smell the roses - or at least just look at them, they're all around you.",
        "comments": [
            {
                "raw_content": "I'm just out here playing what games I find fun and ignoring all I don't care about. Haven't run out of stuff to play yet.",
                "author": "doctorhino"
            },
            {
                "raw_content": "It’s nice to see the positivity! I’m so damn stoked for Prime 4 and Age of Imprisonment! Currently considering grabbing Hollow Knight because I’ve never played. Wish there was a Switch 2 patch but that’s not a huge deal.",
                "author": "Robbitjuice"
            },
            {
                "raw_content": "This is the positivity we need! I am sorry for thinking it's yet another justified pirate post by looking at the pic. It's not and I am happy! Good tidings for all, and hope you guys enjoy your game! Will I buy DK Bonanza DLC? Super Mario Galaxy? Probably not for now, but what about the other games? It's a yes from me! Currently waiting for Pokemon Legends ZA. I have no high expectations, but I am looking forward to play it.",
                "author": "ChainedDevilofDesire"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Discussion, News, and Request Thread - Week Beginning 09/15/25",
        "score": 31,
        "text_content": "Discussion threads are your weekly central hub for all requests, gaming news, and any other gaming topics you want to talk about. *Please keep all content that doesn't need it's own post to this thread to de-clutter the sub for proper leaks and rumors. Thanks!* **Join our new companion sub for super secret Resident EVIL 9 and Half-Life 3 leaks** \\-- [r/OkBuddyGLAR](https://new.reddit.com/r/OkBuddyGLAR/) Hot Threads of the past week: * [Super Mairo Bros' second movie title leaks two days before Direct](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1nef1vl/super_mairo_bros_second_movie_title_leaks_two/) * [the state of Marvel's Wolverine: \"From a few playtesters that I've been speaking to, they think that the game looks fantastic\"](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1nc0dm7/tom_henderson_on_the_state_of_marvels_wolverine/) * [Three \"sevens\" show up at the Nintendo Direct: Final Fantasy VII, Resident Evil 7, and Dragon Quest VII.](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1nf436n/three_sevens_show_up_at_the_nintendo_direct_final/) * [Potential websites in GTA 6 leaked \\[Tez2\\]](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1nbwfbs/potential_websites_in_gta_6_leaked_tez2/) * [Switch Force: “I’m anticipating the Direct is announced tomorrow, giving a 48 hour notice for Friday’s show”](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1ncxbr7/switch_force_im_anticipating_the_direct_is/) # [Want to help us improve this subreddit? ](https://forms.gle/w9JaYTjVN1Zie9e39)[Provide us with feedback here](https://forms.gle/w9JaYTjVN1Zie9e39)[!](https://forms.gle/w9JaYTjVN1Zie9e39) # [Click here to join the discord to enjoy further conversations with the community!](https://discord.gg/6jdBvCSqbj)",
        "comments": [
            {
                "raw_content": "I know it happened not long ago but I wonder if any journalist is ever gonna break out a story about the cancelled Square games that happened cuz of their decision to shift focus from multiples releases at a time",
                "author": "gabcro"
            },
            {
                "raw_content": "I would like to formally request any info on TESVI or Bethesda at large. I know about the “mapping the future” tweet, the Pinterest board, and the etching in the console in the Starfield trailer. I know they’re tight lipped but I’m jonesing today for any info.",
                "author": "LavandeSunn"
            },
            {
                "raw_content": "No KCD1 current-gen port at the Switch 2 direct (not that it was expected to be there) after it was found on the PS5 backend, anyone hear any more chatter about this?",
                "author": "Tired_Gamer"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "NateTheHate: \"Sony has a presentation soon.\"",
        "score": 469,
        "text_content": "[https://xcancel.com/NateTheHate2/status/1967712922530148433](https://xcancel.com/NateTheHate2/status/1967712922530148433) In response to being asked \"When will the Playstation Showcase be? Is there a possible date?\"",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "I mean it's either going to be this week or next week That's a given",
                "author": "KMoosetoe"
            },
            {
                "raw_content": "I hope we see that GoW Metroidvania game.",
                "author": "Mindless_Stuff9179"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Silent Hill f leaked info and review score (Dualshockers - 9.5/10)",
        "score": 698,
        "text_content": "[Link](https://bsky.app/profile/did:plc:ej3nt2bh6j35fxqdlxq6yct4?ref_src=embed) The game is extremely disturbing as well. Ryukishi07 went all the way it seems.",
        "comments": [
            {
                "raw_content": "I saw Max Dood played a demo build on stream and it was incredible, I think this will sell really well once the word is out that Silent hill is back",
                "author": "SIotball"
            },
            {
                "raw_content": "I know someone covering this game and the info here is legit. Next week is a crazy week for journos/influencers, which might be why this mistake happened. Silent Hill f, Hades II, and Ghost of Yotei review embargos all drop within the same week.",
                "author": "SOTCWanderer"
            },
            {
                "raw_content": "Wow, are we back?",
                "author": "Fun-Hawk-5167"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Possible Steam Frame / Deckard news coming on Wednesday.",
        "score": 490,
        "text_content": "[Habie147](https://www.youtube.com/@habie147) is a VR youtuber - he won VR content creator of the year 2022. He signs his video off each week with where you'll see him next (usually plugging his twitch) but this week he [told us he'll be uploading on Wednesday for the first time ever.](https://youtu.be/y8Z-eMRr7J4?t=501) >I will see you next, Wednesday. Special report incoming. First time ever Wednesday posting. Big deal. Set an alarm. Alert the Post Office. [Nathie,](https://www.youtube.com/@nathie/videos) another VR youtuber has posted he's in Seattle this week. (Valve headquarters?) https://www.threads.com/@shnnnmcg/post/DOTz03lFRNR Nathie was one of the people [livestreaming](https://www.youtube.com/watch?v=1_yw0PD-tSY) the F8 2019 conference when Valve shadow dropped the Index announcement. F8 2019 if you don't remember was the precursor to Meta Connect and was where they were announcing preorders going live for the Oculus Rift S and Oculus Quest. Valve dropped the Index announcement as Zuckerberg walked on stage. Cas and Haley (more VR youtubers) have [confirmed they're not at Meta Connect this year](https://xcancel.com/CasandChary/status/1967222489211121746) and don't believe any other VR youtubers have been invited either so it's likely that as [Upload VR](https://www.uploadvr.com/meta-connect-2025-predictions-expectations/#:~:text=No%20New%20Quest%20Headset) have said Meta Connect won't contain any exciting VR news. Edit: ~~Also just found this [cryptic post](https://bsky.app/profile/nchan.bsky.social/post/3lyirczzqdh2z) on BlueSky from Norm / Tested last week. Probably a real stretch but could be hinting at a Half-Life reference. I mean, it has 3 likes so clearly it's HL3 confirmed.~~ - was iPhone reference. Edit2: Another one found in comments - [MRTV](https://youtu.be/VPiNJ4pcCtc?si=vENz5rUCoXfqbh42) are heavily hinting it's Deckard related, hearting multiple comments on his YouTube video that mention Valve/Deckard. Edit3: [Nathie is now in Seattle, 20mins from Valve HQ.](https://xcancel.com/NathieVR/status/1967783728685650176#m) > Greetings from Seattle 👀",
        "comments": [
            {
                "raw_content": "COPIUM OVERDOSE",
                "author": "SignificantCode8873"
            },
            {
                "raw_content": "MRTV a German VR content creator has also announced that he will be traveling to Seattle this week to see something new https://youtu.be/VPiNJ4pcCtc?si=Rb1FAlusnJ5d5Lwf",
                "author": "Keckskacke"
            },
            {
                "raw_content": "I hope this could mean news for the next Steam Controller as well.",
                "author": "TheLimeyLemmon"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "NateTheHate on Halo MCC PS5 port: “Am unsure if the layoffs had any impact on that release”",
        "score": 224,
        "text_content": "https://xcancel.com/NateTheHate2/status/1967462202539114593#m “No update. Am unsure if the layoffs had any impact on that release” Curious if Microsoft abandoned the port in favor of new remakes from 343.",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Not really a \"Rumor\", as I said I have no update. I was simply expressing a thought with the latter half.",
                "author": "NatetheHate2"
            },
            {
                "raw_content": "Said it before, but if they are releasing a halo remake next year, why would they release a Halo MCC port? Wouldn’t it just eat up their own sales?",
                "author": "Dull-Caterpillar3153"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Resident Evil Requiem on PS5 and Xbox Series costs €80, and €70 on Switch 2",
        "score": 210,
        "text_content": "[https://xcancel.com/RE9countdown/status/1967590497742184753](https://xcancel.com/RE9countdown/status/1967590497742184753)",
        "comments": [
            {
                "raw_content": "They're really going all in on the marketing. Wonder if/how much money changed hands to be so heavily featured in the Direct.",
                "author": "skyline7284"
            },
            {
                "raw_content": "With how frequently RE games go on sale I think I’ll just wait if this is actually $80. Game will have a ton of patches by then too Edit: Oh this is in Euros not USD. That still sucks ass for EU players though.",
                "author": "Decimator1227"
            },
            {
                "raw_content": "this is not news, this is how these games have been priced in the EU the whole generation. there’s no confirmation of anything yet",
                "author": "account_for_gaming"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Sony removed 'Game Revenue Beyond Console' as a Strategically Emphasized Indicator for their Gaming Division in their new Corporate Report",
        "score": 313,
        "text_content": "Sources: Corporate Report 2025 (page 37): [https://www.sony.com/en/SonyInfo/IR/library/corporatereport/CorporateReport2025\\_E.pdf](https://www.sony.com/en/SonyInfo/IR/library/corporatereport/CorporateReport2025_E.pdf) [https://i.imgur.com/YzMIwAf.png](https://i.imgur.com/YzMIwAf.png) Corporate Report 2024 (page 47): [https://www.sony.com/en/SonyInfo/IR/library/corporatereport/CorporateReport2024\\_E.pdf](https://www.sony.com/en/SonyInfo/IR/library/corporatereport/CorporateReport2024_E.pdf) [https://i.imgur.com/OA7HTiY.png](https://i.imgur.com/OA7HTiY.png) Previous rumor: [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1mk4zkf/sony\\_moving\\_away\\_from\\_hardware\\_centric\\_model\\_to\\_a/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1mk4zkf/sony_moving_away_from_hardware_centric_model_to_a/)",
        "comments": [
            {
                "raw_content": "What exactly does this mean?",
                "author": "cloudfightback"
            },
            {
                "raw_content": "Either they pivoted again or they see no point in emphasizing gaming revenue beyond console",
                "author": "Lighthouse_seek"
            },
            {
                "raw_content": "The \"previous rumor\" that is linked in the OP has literally *nothing* to do with the implication in the OP and it seems the OP was so desperate that he linked any \"similar\" topic to be able to post pure IconEra copium. inb4lock",
                "author": "FlyFight2Win"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "The post-credits teaser of Trails in the Sky 1st Chapter's sequel has been leaked",
        "score": 133,
        "text_content": "[https://www.reddit.com/r/Falcom/comments/1nhol9e/trails\\_in\\_the\\_sky\\_sc\\_remake\\_teaser/](https://www.reddit.com/r/Falcom/comments/1nhol9e/trails_in_the_sky_sc_remake_teaser/) Also to note, some people have access to the game a few days before it releases.",
        "comments": [
            {
                "raw_content": "SC remake has basically been confirmed at this point so no surprise there. It would be awful if they left new fans hanging with the ending of FC and never gave them a proper sequel. FC and SC remakes should be enough to bridge the gap to Zero. If they sell really well maybe we'll see further remakes but I would be surprised.",
                "author": "Wander715"
            },
            {
                "raw_content": "The teaser was in the original game as well.",
                "author": "EducationCultural736"
            },
            {
                "raw_content": "i am just happy those 2 >!enfoncers !<got 3d model and both looks so good.",
                "author": "Ayamebestgrill"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "PLAION Spain says physical pre orders for RE9 open today, Capcom Spain retweets it",
        "score": 126,
        "text_content": "[https://xcancel.com/PLAION\\_ES/status/1967576471008072012#m](https://xcancel.com/PLAION_ES/status/1967576471008072012#m) Title fixed hopefully",
        "comments": [
            {
                "raw_content": "Hope there's a nice collectors edition or at the very least a Steelbook.",
                "author": "noelle-silva"
            },
            {
                "raw_content": "Incoming game key card reveal...",
                "author": "KMoosetoe"
            },
            {
                "raw_content": "I thought this would happen after an event, could this mean a new SoP is coming soon?",
                "author": "Carlosless-World"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "The share of mortgage-free U.S. homeowners just hit a new high of 40.3%",
        "score": 347,
        "text_content": "From latest Census data: https://data.census.gov/table/ACSDP1Y2024.DP04 * Housing units without a mortgage: 34,937,533 * 40.3% Last year numbers (2023) it was 39.8% https://eyeonhousing.org/2024/10/mortgage-free-homeowners-by-congressional-districts/",
        "comments": [
            {
                "raw_content": "Between this and the large percentage of homes with mortgage around 3% it really is game over for anyone (myself included) who didn’t get on that bandwagon 54% of mortgages are 3.x% or lower. That’s out of the 60% with mortgages. So about 25% of housing in play",
                "author": "virtual_adam"
            },
            {
                "raw_content": "Mortgage free here as of last year. I believe it, more people are getting more into taking care of their mental health and paying off debt.",
                "author": "hektor10"
            },
            {
                "raw_content": "I mean when nobody’s buying homes and time passes by, the homeowners still need to pay their mortgages. Those mortgages will be paid off, and the new high will increase until more people buy homes to level it out. Seems like common sense to me.",
                "author": "EzekielYeager"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Canadians don’t want to live in America and it shows: The number of Canadians searching for U.S. homes is down 20% year over year | Fortune",
        "score": 257,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Let's put it into law! It's only fair that we should forbid them from buying property in the US if we can't buy property in Canada.",
                "author": "neanderthalensis"
            },
            {
                "raw_content": "Thank you, please don't rent or own here, prices need to fall. If you wanna visit get an Airbnb.",
                "author": "Then_North_6347"
            },
            {
                "raw_content": "This is actually a Redfin article rewritten by Fortune. Might as well avoid Fortune's paywall to read it straight from the source. https://www.redfin.com/news/fewer-canadians-searching-for-homes-united-states/",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage Rates Are Finally Falling. Here’s Why They Can Move Fast.",
        "score": 96,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Im reading this and im not the greatest at understanding this side, but the author is saying that rates will drop as more people refinance? Can someone ELI5 how that makes sense?",
                "author": "Aggravating_Rest1937"
            },
            {
                "raw_content": "I’ll be happy with a 5% rate. Save $500 a month, would be great.",
                "author": "IhaveAthingForYou2"
            },
            {
                "raw_content": "non-paywall WSJ: https://archive.ph/8IHev",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage Rates Start Week at Another Long-Term Low",
        "score": 52,
        "text_content": "",
        "comments": [
            {
                "raw_content": "when 4% ?",
                "author": "tasty_meatballs69"
            },
            {
                "raw_content": "Long-term is a year? They were lower through multiple periods in 2023 and 2024.",
                "author": "Rude_Judgment7928"
            },
            {
                "raw_content": "I would prefer them not to drop. Houses need to drop along with the taxes.",
                "author": "bigm4sho88"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Housing inventory dropped in August",
        "score": 60,
        "text_content": "",
        "comments": [
            {
                "raw_content": "But it’s higher than last August. Im fairly new here but isnt that how this works?",
                "author": "yuckysmurf"
            },
            {
                "raw_content": "Prices dropped enough for people to delist right?",
                "author": "shitlord_god"
            },
            {
                "raw_content": "Thanks for posting! I’ve been watching for the data and they published later than the date they said it would update. Where I live, inventory increased fairly significantly. That’s in keeping with the trend for the year, so far. The data doesn’t go terribly far back, but we’re higher now than at any other time shown. https://fred.stlouisfed.org/series/ACTLISCOU53073",
                "author": "Surly_Cynic"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Builders Stay Cautious as Single-Family Permits Extend Downtrend",
        "score": 18,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Single-family housing permits slipped for the seventh month in a row, highlighting affordability headwinds and weak demand. While multifamily permits ticked up, the sector’s volatility leaves the outlook uncertain. The split underscores a housing market still under strain, with single-family softness weighing on broader growth prospects. Over the first seven months of 2025, the total number of single-family permits issued year-to-date (YTD) nationwide reached 565,208. On a year-over-year (YoY) basis, this is a decline of 5.7% over the July 2024 level of 599,308. For multifamily, the total number of permits issued nationwide reached 286,836. This is 2.6% higher compared to the July 2024 level of 279,618. Year-to-date ending in July, single-family permits were up in one out of the four regions. The Midwest posted a small increase of 2.0%. The Northeast was 2.5% lower, the South was down by 6.6%, and the West was down by 8.3% in single-family permits during this time. For multifamily permits, three out of the four regions posted increases. The Midwest was up by 23.3%, the West was up by 5.9%, and the South was up by 5.7%, Meanwhile, the Northeast declined steeply by 26.8%, driven by the New York-Newark-Jersey City, NY-NJ MSA which declined by 38.0%. Between July 2025 YTD and July 2024 YTD, 16 states posted an increase in single-family permits. The range of increases spanned 18.1% in Hawaii to 0.5% in New Jersey. The remaining 34 states and the District of Columbia reported declines in single-family permits with the District of Columbia reporting the steepest decline of 28.8%. The ten states issuing the highest number of single-family permits combined accounted for 62.8% of the total single-family permits issued. Texas, the state with the highest number of single-family permits, issued 90,561 permits over the first seven months of 2025; this is a decline of 7.2% compared to the same period last year. The second highest state, Florida, decreased by 11.9%, while the third highest, North Carolina, posted a decline of 2.2%. Between July 2025 YTD and July 2024 YTD, 29 states recorded growth in multifamily permits, while 21 states and the District of Columbia recorded a decline. Mississippi (+97.3%) led the way with a sharp rise in multifamily permits from 222 to 438, while Wyoming had the largest decline of 53.1% from 196 to 92. The ten states issuing the highest number of multifamily permits combined accounted for 61.6% of the multifamily permits issued. Over the first seven months of 2025, Florida, the state with the highest number of multifamily permits issued, experienced an increase of 23.8%. Texas, the second-highest state in multifamily permits, saw an increase of 10.9%. California, the third largest multifamily issuing state, increased by 5.8%.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "yep, responding to the dearth of demand, of course",
                "author": "sifl1202"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "OpenAI releases GPT-5-Codex",
        "score": 710,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Actual link: [https://openai.com/index/introducing-upgrades-to-codex/](https://openai.com/index/introducing-upgrades-to-codex/) API not yet: \\> For developers using Codex CLI via API key, we plan to make GPT‑5-Codex available in the API soon.",
                "author": "quartzjer"
            },
            {
                "raw_content": "https://preview.redd.it/syq3la8p2dpf1.png?width=967&format=png&auto=webp&s=5cc4645f135340b3dd24afd4d59c822fd9b47550",
                "author": "ThunderBeanage"
            },
            {
                "raw_content": "[Vibe check](https://every.to/vibe-check/gpt-5-codex-knows-when-to-think-hard-and-when-not-to) from devs who had access for a few days. TLDR: a solid upgrade",
                "author": "Gold_Cardiologist_46"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI breaks down the most common ChatGPT use cases",
        "score": 221,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hmm. This information makes me feel weird because my use case seems so uncommon. I'm going to talk with ChatGPT to assess how I should internalize this information.",
                "author": "CrowSky007"
            },
            {
                "raw_content": "“I’m arguing with someone in Reddit about XXXX, give me a short sarcastic refutal!”",
                "author": "IAmFitzRoy"
            },
            {
                "raw_content": "Who made this chart, nothing is sorted, come on.",
                "author": "Friendly_Willingness"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Greg Brockman says the next AI milestone is creating genuinely novel breakthroughs",
        "score": 106,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is basically what Demis Hassabis has been saying for a while now. Enough words… fix it.",
                "author": "infinitefailandlearn"
            },
            {
                "raw_content": "I mean, yeah, that's the whole idea. AI comes up with scientific discoveries, solves unsolved problems in physics and mathematics, and coming up with new ways to improve itself in real time that humans would take decades to develop, if ever.",
                "author": "Princess_Actual"
            },
            {
                "raw_content": "Alphaevolve: first time?",
                "author": "Tolopono"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "GPT 5 Codex is a Gamechanger",
        "score": 177,
        "text_content": "So today, I had some simple bugs regarding Electron rendering and JSON generation that Codex wasn't able to figure out 3 weeks ago (I had asked it 10 separate times). When I tried the new version today, it one-shotted the problems and actually listened to my instructions on how to fix the problem. I've seen the post circling around about how the Anthropic CEO said 90% of code will be AI generated, and I think he was right - but it wasn't Anthropic that did it. From my 2 hours of usage, I think Codex will end up writing close to 75% of my code, along with 15% from myself and 10% from Claude, at least in situations where context is manageable.",
        "comments": [
            {
                "raw_content": "My entire day is now spent talking to GPT-5 and babysitting its outputs with 10% coding from me, maximum. Programming changed SO fast this year, it's insane. In 2023 I went from only using tab autocomplete with Copiliot (and occasional ChatGPT chat, which with 2023 models was nearly useless) to a coworker doing 90% of my work.",
                "author": "spryes"
            },
            {
                "raw_content": "It was funny because a few days ago that post was trending because he literally said it about 6 months ago. And there was so many posts about how he was wrong and I am sitting here like, yeah I am fairly certain every single one of you did not actually use Codex because it is getting VERY close to 90-95% at this point, especially with the new Codex updates today. Most common response back was people claiming that my codebase was too simple, and I am literally having Codex write in C++ doing IPC and multithreading, you literally can't get any more complex beyond driver level code lol",
                "author": "yubario"
            },
            {
                "raw_content": "Have to agree, been trying it in a large (to me) codebase and it will spend 10 minutes reading everything and then just makes excellent changes. It also tests the heck out of stuff which is so wonderful",
                "author": "stumpyinc"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "GPT5 codex can work for more than 7 hours",
        "score": 445,
        "text_content": "https://openai.com/index/introducing-upgrades-to-codex/",
        "comments": [
            {
                "raw_content": "Rip my plus plan quota",
                "author": "llkj11"
            },
            {
                "raw_content": "Damn, I can't work for 7h straight. Of course if it adds and deletes the same line, I would not be impressed. When is this UBI thing coming along? Because this year would be a good one (yeah I doubt it will happen, just wishful thinking)",
                "author": "Correct_Mistake2640"
            },
            {
                "raw_content": "Can confirm it's running significantly longer than GPT-5-high did without input",
                "author": "strangescript"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Atlas now squat, lowers its back, legs to perform middle distance manipulation, trained with Large Behaviour Models (LBMs)",
        "score": 264,
        "text_content": "https://youtu.be/HYwekersccY?si=l3yThDsaNjIVZdVc",
        "comments": [
            {
                "raw_content": "wow an actually cool robotics demo",
                "author": "Generic_User88"
            },
            {
                "raw_content": "We'll know we're really getting somewhere when the guy uses that stick to close what the bot just opened, like he does here, and the bot has finally had enough of that horseshit and punches the guy",
                "author": "moose4hire"
            },
            {
                "raw_content": "This is so useless just put a long haired wig on it and a fleshlight between its legs and teach it to do sex moves.. we are all out here waiting with our wallets...",
                "author": "4johnybravo"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Haven’t seen this discussed: GPT-5 Codex does really well at cybersecurity benchmarks",
        "score": 52,
        "text_content": "These are some of the same benchmarks GPT-5 showed disappointing improvement on so I found that interesting. https://cdn.openai.com/pdf/97cc5669-7a25-4e63-b15f-5fd5bdc4d149/gpt-5-codex-system-card.pdf",
        "comments": [
            {
                "raw_content": "pass@12 Give 12 attempts to get a correct answer. If one is correct, then give full marks. These are the kind of benchmarks that are breeding hallucinations. Bad bad bad.",
                "author": "1a1b"
            },
            {
                "raw_content": "I'm more surprised that gpt-5-thinking-mini is better than gpt-5-thinking at these benchmarks.",
                "author": "i_know_about_things"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"How should ‘mirror life’ research be restricted? Debate heats up\"",
        "score": 84,
        "text_content": "[https://www.nature.com/articles/d41586-025-02902-2](https://www.nature.com/articles/d41586-025-02902-2) \"This week in Manchester, UK, scientists will be deliberating whether to restrict research that could eventually enable ‘mirror life’ — synthetic cells built from molecules that are mirror images of those found in the natural world. Over the past year, [many scientists have voiced concerns](https://www.nature.com/articles/d44151-025-00003-7) over experiments that might lead to the creation of such cells, suggesting that they would pose an enormous risk to human health and the environment. “Pretty much everybody agrees” that mirror-image cells would be “a bad thing”, says John Glass, a synthetic biologist at the J. Craig Venter Institute in La Jolla, California. But there are disagreements about where to draw lines to limit research on mirror-image biology, given the potential benefits of such studies.\"",
        "comments": [
            {
                "raw_content": "Maybe a dumb question, but if mirror life is so deadly to us, wouldn't we be just as deadly to mirror life? Like wouldn't it just die out instantly if released due to a lack of compatible amino acids?",
                "author": "mean_bean_machine"
            },
            {
                "raw_content": "Nobody really knows, but it's not hard to think of nightmare scenarios with an escape. Imagine an invasive bacterial species that even dead doesn't degrade since nothing can consume it. Free to reproduce with absolutely no predators, in our oceans, in our lakes, in our food supply, and worse, in our blood. Essentially invisible to our immune system due to it's chirality, it would reproduce until it clogged our blood vessels. Even as our bodies decayed, there would be mats of it remaining on our bones.",
                "author": "LumpyWelds"
            },
            {
                "raw_content": "Reddit didn’t think I had enough shit to worry about already",
                "author": "itsthesecans"
            }
        ],
        "subreddit": "singularity"
    }
]