[
    {
        "post_name": "A massive tsunami is expected to strike Hawaii at about 1:15am (EST). Pray for all those who may be in harms way....",
        "score": 322,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I can't sleep. My sister is in Alaska on the coast on a cruise ship.",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "# This is bullshit. They're only expecting 2.5 feet above whatever the tide normally is",
                "author": "redditadminssuckit"
            },
            {
                "raw_content": "Portland Andy's tsunami watch on multiple worldwide livestreams. Link inside. https://www.youtube.com/watch?v=0-dc9E7TU74",
                "author": "Cuetardian"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"Possibly white\"",
        "score": 334,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A White Russian?",
                "author": "fat50"
            },
            {
                "raw_content": "[CNN also described the black / Arabic shooter as FACTUALLY ARABIC, BUT MORALLY WHITE](https://media.scored.co/post/iZS2TXWViBU5.jpeg) Filthy fucking \"BoIsheviks\" and their Color Revolution. And then one day, for no reason at all...",
                "author": "tiller"
            },
            {
                "raw_content": "The earthquake has still refused to denounce white supremacy.",
                "author": "MoreVanceMemes"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Oprah!",
        "score": 307,
        "text_content": "",
        "comments": [
            {
                "raw_content": "100%",
                "author": "PiratePatriotParrot"
            },
            {
                "raw_content": "This is a Perfect Meme. Congratulations.",
                "author": "Simple_Doot"
            },
            {
                "raw_content": "kek",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Why not a fat black woman?",
        "score": 299,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Kek.",
                "author": "Patriot_Dave"
            },
            {
                "raw_content": "One of the few good uses for AI: making fun of idiot politicians.",
                "author": "The_Nowhere_Man"
            },
            {
                "raw_content": "Why do homosexuals act out like this",
                "author": "USNVET71"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Virginia Giuffre’s (RIP) testimony about Epstein and Trump: Q: When did Donald Trump flirt with you? A: He didn't. That's what's inaccurate. Q: Did you ever see Donald Trump at Jeffrey' home? A: Not that I can remember. Q: On his island? A: No, not that I can remember.",
        "score": 1214,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They were using loaded questions clearly trying to frame Trump.",
                "author": "dontdisrespectpotus"
            },
            {
                "raw_content": "\"when did trump flirt with you\" ffs what a bullshit question. good answer.",
                "author": "LawyersPlayDota"
            },
            {
                "raw_content": "Virginia Giuffre is dead. She committed 'suicide' months after surviving a freak bus 'accident'. No way to corroborate her testimony or refute any newly fabricated 'evidence' linked to her.",
                "author": "Moebius"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: US Senate CONFIRMS retired Army Captain Sam Brown as President Trump's VA Under Secretary for Memorial Affairs, 54-44.",
        "score": 1105,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Trump has been in office for over 6 months, why the fuck is the Senate still confirming his appointees? This shit should have happened on day 1.",
                "author": "AVeryNakedMan"
            },
            {
                "raw_content": "- [Democrats Jacky Rosen and Cortez Masto voted with Republicans to confirm Sam Brown. Rino Bill Hagerty didn't vote. Sam raced against Jacky to be a Senator in Nevada. A seat that was stolen from him.](https://www.senate.gov/legislative/LIS/roll_call_votes/vote1191/vote_119_1_00447.htm) - [CDC Director Susan Monarez was also confirmed today by a vote of 51-47. Rino's Bill Hagerty and Dan Sullivan didn't vote.](https://www.senate.gov/legislative/LIS/roll_call_votes/vote1191/vote_119_1_00445.htm) - [Appeals Judge for the 3rd Circuit Emil Bove was also confirmed by a vote of 50-49. Rino's Lisa Murkowski and Susan Collins voted no. Rino Bill Hagerty didn't vote.](https://www.senate.gov/legislative/LIS/roll_call_votes/vote1191/vote_119_1_00448.htm) --- [Cortez Masto Requests Update from (Trump) Administration on the Elko National Cemetery Project: After voting to confirm him to the position, U.S. Senator Catherine Cortez Masto sent a letter to the Veterans Affairs (VA) Under Secretary for Memorial Affairs Sam Brown pressing him for a status update on the Elko National Cemetery’s construction timeline. Cortez Masto was instrumental in securing the initial VA approval to build the Elko cemetery. Before being approved in 2022, Elko had been under consideration for a veterans cemetery since 2011. The closest veterans cemeteries for regional veterans and their families are currently over 200 miles away – in either Fernley or Salt Lake City. Senator Cortez Masto’s efforts helped speed up the process and secured a final commitment from the VA to begin construction on the Elko site. “I am writing to request an update on the status of the Elko National Cemetery,” Cortez Masto wrote. “As you know, veterans in the Elko region currently face long travel times to access burial and memorial services, with no national or state veterans’ cemeteries in the region. The Elko cemetery project is a crucial step toward closing that gap, and I appreciate the VA’s continued partnership in bringing it to completion.” “After hearing directly from Elko veterans, I introduced the Elko National Cemetery Act in March 2020 and again in 2021, with Senator Rosen’s support, to authorize the necessary land transfer from the Bureau of Land Management (BLM) to the Department of Veterans Affairs (VA),” she continued. “In September 2020, I helped secure an agreement from the VA to acquire 15 acres for the cemetery from the city of Elko, with the finalized sale completed in August 2021.” “This cemetery represents more than just a construction project,” the Senator concluded. “It is a lasting commitment to honor the lives and service of veterans in Elko and rural Nevada. I believe that transparency, coordination, and continued communication with the local community are essential as the project enters its next phase.” In the letter, Cortez Masto asked the Trump Administration to provide updates on the timeline for completion of the project, any funding gaps or permitting issues, and current engagement with local veterans and stakeholders. She also reiterated that she looks forward to visiting the completed site.](https://www.cortezmasto.senate.gov/news/press-releases/cortez-masto-requests-update-from-administration-on-the-elko-national-cemetery-project/)",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "Glad to he among others (Kari Lake) are getting some kind of justice from being robbed of their elections.",
                "author": "TheWingedStormfag"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump calls on Senator CHUCK GRASSLEY of Iowa - \"who I got reelected\" - to IMMEDIATELY fast-track his federal judicial nominees \"with a mere flick of the pen.\"",
        "score": 1411,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Pen protruding, very very respectful.",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "And here's where we will see Trump get stabbed in the back by the people he helped.",
                "author": "JustHereForTheSalmon"
            },
            {
                "raw_content": "Here’s hoping this time Trump learns the lesson: if you help a swamp monster, the swamp monster will still betray you for the deep state. Don’t ever put swamp monsters in power!",
                "author": "Wexit-Delecto"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Tsunami waves hit Russian coast along Severo-Kurilsk.",
        "score": 948,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Please pray for our Russian brothers and sisters.",
                "author": "ShlomoJoe"
            },
            {
                "raw_content": "*beep boop beeeeep* I hope our server is okay, Comrades!",
                "author": "MemeWarsVet"
            },
            {
                "raw_content": "Ihope everyone got out in time! :/ even if someones our enemy/not a friend i wouldnt wish that on them",
                "author": "LiskaEman"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "😏",
        "score": 1311,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A lot of faggots here would rather look at Bill Mitchell.",
                "author": "AcAirman"
            },
            {
                "raw_content": "If you don't like a nice set of boobs there is something wrong with you.",
                "author": "Mortal_Wombat"
            },
            {
                "raw_content": "Her tits are A+ it's literally the rest of her as well as her entire acting catalogue that are total and complete AIDS",
                "author": "LikelyALiar"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Leftists",
        "score": 1163,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Always remember that if it was a fat black lesbian saying the same thing They would be all for it",
                "author": "Vag2024"
            },
            {
                "raw_content": "Anyone who criticizes good looking people online like Sydney Sweeny are always the ugly ones themselves. They never show their real face, or they use an anime avatar, or are just ugly and gave up on life.",
                "author": "McFatty7"
            },
            {
                "raw_content": "Democrats…the party of pedophilia, nose rings and retardation.",
                "author": "MedicallyReddit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "WAYNE ROOT: President Trump, Investigate Obama at Columbia. Obama’s Life of Fraud, Conspiracy & Treason Started at Columbia. I’m his College Classmate. Subpoena Columbia. It All Started There.",
        "score": 1504,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I gotta a sneaking suspicion that Trump already has the goods on this grifter. From way back...",
                "author": "DirtyDiaperJoe"
            },
            {
                "raw_content": "This country started to fall apart noticeable under him. He's the reason why I got into politics. I served under him and didn't care for politics at all. I was young and dumb. Country started to fall apart with BLM and other things I knew was wrong. I went down the rabbit hole and never looked back",
                "author": "PeaceMakerDJT"
            },
            {
                "raw_content": "No it didn't, it started with his CIA USAID whore mother.",
                "author": "IncredibleMrE1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "HOLY SMOKES Tom Homan reveals he had to SHUT DOWN his Linkedin because so many people were reaching out about working for ICE. Former agents were even coming out of retirement! The recruitment offices are SWAMPED",
        "score": 1839,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sounds good to me! Only drawback is we need to hire more of them and more quickly.",
                "author": "splink"
            },
            {
                "raw_content": "You're never too old to put litter in its place. 🗑️ 👨🏽‍👩🏽‍👧🏽‍👦🏽",
                "author": "MythArcana"
            },
            {
                "raw_content": "The 45K sign on bonus probably helped. I even thought about it but being female I dont think I could do the job.",
                "author": "FudgyFudgeBots"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "JUST IN - Diddy's lawyers argue his conviction is racist and sexist, seeking release on $50 million bail — Telegraph",
        "score": 899,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The left proves every day that abandoning racism and sexism was a mistake.",
                "author": "MAGA9428"
            },
            {
                "raw_content": "Dude got the lightest sentence despite being guilty, and this is what his lawyers are like. It's Juicy Smullette all over again.",
                "author": "RedFoxOnFire"
            },
            {
                "raw_content": "this faggot got what amounted to a slap on the wrist considering what he could have gotten - and yet he complains lmao. should be slinking away into obscurity",
                "author": "magaspif"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING - Chuck Schumer says poor people and black people are incapable of obtaining ID if voter ID laws are implemented.",
        "score": 1312,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Poor kids are just as bright and just as talented as white kids -Biden",
                "author": "-f-b-i-"
            },
            {
                "raw_content": "They don't like IDs because it enables democrats to cheat massively.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "If poor people and black people can’t get a simple ID, then they have no reason to vote.",
                "author": "Pence_Brigade"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Cry harder and lose more.",
        "score": 1315,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Be sure to tell your friends and family that what speeches like this are really saying isn't that they are worried about some sort of Trump tyranny, but that they fear losing their absolute control over the institutions of America - and therefore their own tyranny is waning.",
                "author": "NoWarWithIran"
            },
            {
                "raw_content": "They really are pissed about losing one of their late night propaganda shows that is no longer underwritten with USAID tax payer money 😭",
                "author": "Whoopies_tds"
            },
            {
                "raw_content": "He such a sore loser",
                "author": "CanadianMeathead"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Cincinnati Police Chief Asks Citizens Not To Film Crimes Next Time As It Makes Her Look Bad - Babylon Bee",
        "score": 1464,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Babylonbee you know this is probably the real story. The Chief of Police do not want these types of stories to go out because it destroy her narrative.",
                "author": "DT170x"
            },
            {
                "raw_content": "Are there any white males running anything any more? Sick of these DEI cunning runts",
                "author": "EgregiousPhilbin"
            },
            {
                "raw_content": "She wouldn't have to worry about it if she just stayed home and made cookies like God intended.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "‘South Park’ Promises More Trump and Satan, Liberal Bashing After One Week Hiatus",
        "score": 766,
        "text_content": "",
        "comments": [
            {
                "raw_content": "South Park jumped the shark. They were a once funny show but like everything else slow saturation of liberalist sketch writers and artist infiltrated in because of their communist schooling and mind set. Not to mention USAID backdoor Education funding. They have unfortunately gone the way of Disney.",
                "author": "Trumpdeasses"
            },
            {
                "raw_content": "Isn’t this what they did with Saddam? Just rehashing bits now? Still waiting for thise brave and edgy SP folks to bash Barry and Joe...",
                "author": "DeplorableDC"
            },
            {
                "raw_content": "> Parker and Stone seem dead set on tying President Donald Trump to convicted sex offender Jeffrey Epstein despite that there is no evidence that Trump ever visited Epstein’s island and in fact he even cut his previously tenuous ties with Epstein several years before the feds began investigating the billionaire pedophile.",
                "author": "DingleBalls"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "FJB",
        "score": 1365,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Keith Olbermann on suicide watch.",
                "author": "MythArcana"
            },
            {
                "raw_content": "I want 120,000 perp walk and public mugshots. Tired of hearing hundreds of pedophiles caught and the public never see who they are. Do we even know if they spend years in jail or do they just get a slap on the wrist?",
                "author": "Bluemoonsugar"
            },
            {
                "raw_content": "120k members better be scared to death m'f'ers. Please tell us when the infinite amount of leads are being arrested, including the ones in the Biden administration of the most lgtbq+pedos that ever graced the halls of our White House with their filth.",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Largest Teachers Union Just Erased Jews Then Hid the Handbook That Ordered the Erasure After Conservatives Found It",
        "score": 1068,
        "text_content": "",
        "comments": [
            {
                "raw_content": "this should be a fun thread..",
                "author": "try4gain"
            },
            {
                "raw_content": "Wake me up when the core curriculum highlights the Christian Holocaust perpetrated by the Bolsheviks.",
                "author": "HurtzLocker"
            },
            {
                "raw_content": "Setting a policy that holocaust remembrance day remember all the people that died during the holocaust, not just jews, does not equal \"erasing jews\".",
                "author": "CLF3"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "RFK Jr. is FREEZING over $100M in federal funding to Duke University’s medical department after the school failed to comply with President Trump’s executive order banning DEI initiatives.",
        "score": 477,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Did they not think this would happen? They are used to ineffective leadership. A swift kick in the nuts is what they all need.",
                "author": "darkmodeforgotpass"
            },
            {
                "raw_content": "Why the fuck are we giving Duke 100M? Damn our govt is stupid",
                "author": "Ifeargovtmorethan"
            },
            {
                "raw_content": "Not the only one. Companies are actively working to camouflage DEI to keep government contracts",
                "author": "Whoopies_tds"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Sony explores sale of cellular chipsets business",
        "score": 63,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Developing cellular modem chipsets with an $80m annual revenue is not sustainable and, especially now that Sony exited mobile business, doesn‘t make much strategic sense.",
                "author": "Fragrant_Equal_2577"
            },
            {
                "raw_content": ">A leading maker of image sensors, Sony said in April it is considering options for its chips division, including bringing in investment partners or adopting a fab-light strategy. Give it a few more decades and Japan is just going to be a pure entertainment and tourism industry. Even Apple is starting to use Samsung sensors over Sony's. If Toyota starts to falter, I can't imagine how that would impact their collective psyche. Hopefully they will catch back up on the EV front so they won't need to partner with China to finally build a successful EV.",
                "author": "REV2939"
            },
            {
                "raw_content": "At this point Sony sells more nostalgia than silicon.",
                "author": "UnlikelyOpposite7478"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung’s Exynos 2600 May Be A Dark Horse In The GPU Race",
        "score": 55,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That'll be nice for the Genshin and Star Rail players on ARM, I guess. Now show me the out of the box thermals.",
                "author": "wickedplayer494"
            },
            {
                "raw_content": "It's all useless. They tout incredible AI performance, but no apps have access to their API.",
                "author": "Sufficient_Zone_1814"
            },
            {
                "raw_content": "The Xclipse 940 had 6WGP or 12CU RDNA 3 igpu I think Samsung either increased CU count with their SF3 process node or implemented 8-12mb of memory side cache to assist with bandwidth demand from the CU It's also plausible they could do both.",
                "author": "SherbertExisting3509"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[ServeTheHome] Micron 9650 PCIe Gen6 SSD Announced with Micron 6600 ION 122TB and 7600 SSDs",
        "score": 12,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Any price info? Ready to sell my organs.",
                "author": "1mVeryH4ppy"
            },
            {
                "raw_content": "28k read seq but random 4k is 5k",
                "author": "AmazingSugar1"
            },
            {
                "raw_content": "122TB sounds like storage for someone who downloads the entire internet just in case.",
                "author": "UnlikelyOpposite7478"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Galaxy S26 series: Exynos 2600 tipped to get a better cooling solution",
        "score": 13,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hello self-fix! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "NVIDIA N1X desktop SoC appears in first Furmark leak featuring new 590 drivers - VideoCardz.com",
        "score": 91,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nvidia needs to get the x86 emulation as close to running 1:1 speed with little to no major bugs at launch. Otherwise, people won't buy it for gaming. The X925 is a great CPU core, and it will probably have great PPW, idle power draw, and long battery life",
                "author": "SherbertExisting3509"
            },
            {
                "raw_content": "we 100% need more competition on the cpu side to stop AMD from turning into Intel 2.0",
                "author": "bringbackcayde7"
            },
            {
                "raw_content": "It’s interesting to see the N1X SoC making waves, but the leak doesn't offer much concrete info. Hopefully, NVIDIA gives us more details soon rather than leaving us with just speculations and driver hints",
                "author": "sdwwarwasw"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "eTeknix - AMD Radeon RX 9060 XT 16GB Vs RX 7600 XT 16GB – 30 Games Tested",
        "score": 7,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TLDW: RX 9060 XT 16GB Vs RX 7600 XT 16GB: - 1080P 30 game average (RT included): RX 9060 XT 16GB is 54% faster - 1080P 30 game 1% lows (RT included): RX 9060 XT 16GB is 55% faster - 1440P 30 game average (RT included): RX 9060 XT 16GB is 57% faster - 1440P 30 game 1% lows (RT included): RX 9060 XT 16GB is 60% faster - 4K 30 game average (RT included): RX 9060 XT 16GB is 65% faster - 4K 30 game 1% lows (RT included): RX 9060 XT 16GB is 72% faster",
                "author": "Antonis_32"
            },
            {
                "raw_content": "It really shows how bad value the 7600XT was, barely faster than 4060 and with awful FSR3, with no hope for actual good looking AI upscaler. That 16GB vram is almost entirely useless, this card aged like milk compared to RTX cards with the transformer model.",
                "author": "Yeahthis_sucks"
            },
            {
                "raw_content": "9060xt 16gb is at msrp, pretty insane value",
                "author": "Jejiiiiiii"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Mario Kart World Version 1.2.0 is now available!",
        "score": 568,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Increased the frequency of lap-type courses appearing in the selection when choosing the next course in “VS Race” and wireless races. On the “Free Roam” map, when you gather all of the P Switches, ? Panels, and Peach Medallions, the colors of the various numbers will now change. Nice.",
                "author": "StockHumor4768"
            },
            {
                "raw_content": "Nice to see Nintendo giving us actual release notes.",
                "author": "normalwario"
            },
            {
                "raw_content": "> Increased the frequency of lap-type courses appearing in the selection when choosing the next course in “VS Race” and wireless races.",
                "author": "Amiibofan101"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Bro, They Got Tipping Culture In Video Games Now? 💀😂",
        "score": 1312,
        "text_content": "Ain't no way",
        "comments": [
            {
                "raw_content": "You better always tip him. He's a bro.",
                "author": "BoringBeat5276"
            },
            {
                "raw_content": "At least he'll occasionally give you a Music Record after tipping him, it's cheaper than the 100 chips after beating the base game",
                "author": "Skididigg"
            },
            {
                "raw_content": "Tip him. Trust me.",
                "author": "DOOMNOTRONstudiosX"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Just completed the game. A surprising true masterpiece!",
        "score": 659,
        "text_content": "Switch 2’s generation has just started, and we’re already eating so good. I can’t wait to see what’s next! Kudos to Nintendo for continuing to satisfy the fans who invested in their console with great quality exclusives!",
        "comments": [
            {
                "raw_content": "OHHHH BANANA",
                "author": "gabrimefre"
            },
            {
                "raw_content": "I love how Pauline is actually entertaining and not another annoying child nuance. Edit: nuisance not nuance, my non native sleepy ass wrote one thing and meant another.",
                "author": "Not_Lusiek9"
            },
            {
                "raw_content": "I've got 2 more levels to complete but I definitely agree. In my opinion it's one of the few recently released games that deserves the review scores that it's getting.",
                "author": "GoldenAgeGamer72"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Here is what it looks like now once you get everything in Free Roam after the 1.2.0 Mario Kart World update.",
        "score": 167,
        "text_content": "Nothing too crazy. The numbers turn yellow if you get everything. There is still no official way to track them however. I went ahead and marked it spoiler just in case someone doesn't want to know how many there are of each.",
        "comments": [
            {
                "raw_content": "It would be nice if they added a guide on finding all of these because right now I see no incentive on trying considering all you get are useless stickers",
                "author": "Icy-ConcentrationC"
            },
            {
                "raw_content": "ok this at least tells us that they’re not opposed to changing UI and UX through updates. hopefully add more to this poor excuse of a map in the coming months.",
                "author": "japan_kaaran"
            },
            {
                "raw_content": "Well that's slightly more disappointing than I would have thought. Was hoping it was an update to each area like the ? Blocks. Oh well. At least it's a slight change towards the right direction.",
                "author": "StockHumor4768"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Switch 2 Seems to be Increasingly Generally Available Now",
        "score": 512,
        "text_content": "WalMart, Best Buy and Target all have the Switch 2 listed as available in some way on their website for the past several days. This is good to see. Of course, this is doom and gloom for the haters - LOL!!!",
        "comments": [
            {
                "raw_content": "They produced over 6 Million Units from September till April. Nintendo is taking their war against scalpers very seriously",
                "author": "Round_Musical"
            },
            {
                "raw_content": "Scalpers cry your hearts out 😂😂",
                "author": "NoeloDa"
            },
            {
                "raw_content": "Walked into a GameStop on saturday and picked one up. Didnt even ask if they had any in stock just said I wanted one. Seems Nintendo did what they said, printed a shit ton of consoles to ensure wide availability.",
                "author": "RedZephon"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The Y button of my Switch 2 when I start DK Bananza",
        "score": 1938,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's ok because A needed a break after MKW. We need a B button heavy game next.",
                "author": "unsurewhatiteration"
            },
            {
                "raw_content": "joycons when Smash 6 comes out",
                "author": "Arcade_Rave"
            },
            {
                "raw_content": "I actually started to use the x button a lot too. Especially with the combination Lz, A ,Lz, X",
                "author": "oh_stv"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Mario Kart World — Accolades Trailer — Nintendo Switch 2",
        "score": 208,
        "text_content": "And we've gone from the comments being flooded with \"DROP THE PRICE\" to \"BRING BACK 3 LAPS\"",
        "comments": [
            {
                "raw_content": "Wish they would reintegrate the ability to allow the second player to link their account during split screen online play so they can accumulate points as well",
                "author": "Raccoonpunter"
            },
            {
                "raw_content": "Love knockout online, but really want to race cups against other people online as well",
                "author": "murdo1tj"
            },
            {
                "raw_content": "love this game. 24 player online lobbies are completely insane",
                "author": "ill_monstro_g"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I did it yall!!",
        "score": 67,
        "text_content": "",
        "comments": [
            {
                "raw_content": "this guy bananzas",
                "author": "Careful-Door2724"
            },
            {
                "raw_content": "Bro wtf 🤯 just finished the story and started going back to the different layers and felt decent about my 400 some bananas. This is wild",
                "author": "stunnabars"
            },
            {
                "raw_content": "So the Banana cap is 1,000?",
                "author": "Meta13_Drain_Punch"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo uploads 8 minute Drag and Drive overview, which adds proof to direct announcement tommorow",
        "score": 291,
        "text_content": "https://youtu.be/-Ls_NtQ0s8k?si=BjIvwPkJSieGBhN4 Nintendo can’t fit a 8 minute overview in a direct, so they’re getting it out of the way before it.",
        "comments": [
            {
                "raw_content": "Only an act of god could stop the Direct at this point",
                "author": "Wassersammler"
            },
            {
                "raw_content": "Would seem likely. But is it still on? Japan and the West Coast are under a tsunami warning - might not be such a great time for it.",
                "author": "KingMario05"
            },
            {
                "raw_content": "Hades 2 had its achievements uploaded on accident today meaning 1.0 release is imminent. Hades 1 was shadowdroppped during a direct.....ergo",
                "author": "SteveMightSay"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "GTA 6's 8 year development cycle confirmed by a former Rockstar dev",
        "score": 1171,
        "text_content": "Just watched the Kiwi Talkz interview David O'Reilly, a former environmental artist at Rockstar who worked on GTA 5, RDR2 and GTA 6. At 12:35 he states that he had worked on GTA 6 for 5 years up until he left the company in 2023. Pretty sure he wasn't supposed to name the exact timeframe but let it slip mid conversation. That means the development started in 2018 after RDR2 released. I know a lot of people already assumed that this was the case but this is the closest we've come to an actual confirmation with a real source from Rockstar. So by the time the game actually releases the total dev time will be 8 years. This doesn't include the pre-production which supposedly started around 2015 according to multiple leaks. Pretty sure this make it the longest dev cycle for a Rockstar game Source: [https://youtu.be/DtKzFeNf\\_ug?t=752](https://youtu.be/DtKzFeNf_ug?t=752) 12:35 EDIT: Apparently David had already mentioned the dev time in his Trailer 2 reaction video on his personal YouTube channel back in May. \"I worked on GTA 6 from 2018 to 2023. Went onto it after we wrapped up on RDR2. It's fascinating having a look at all this stuff.\". Feel free to delete the post mods, or leave it for reiteration since the source is from a new interview.",
        "comments": [
            {
                "raw_content": "https://youtube.com/@game-world-art?si=pKfxxSF-gaNEiRhO He has a relatively new YouTube channel, videos are mainly just him exploring open world games, giving his insight and opinions. The videos are all pretty long and he uploads consistently, wouldn’t surprise me if there’s some info in there somewhere nobody’s caught yet.",
                "author": "Guns_and_Potions"
            },
            {
                "raw_content": "These games are so massive that I don’t think anything less than 8 years is a reasonable expectation",
                "author": "endividuall"
            },
            {
                "raw_content": "God i can’t wait for this game",
                "author": "DaRealAyman"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Looking on the Switch 2 eShop I've found further possible evidence of a likely Thursday Nintendo Direct",
        "score": 440,
        "text_content": "For people who aren't up to speed, Nintendo's announced network maintenance on Thursday, one day before their annual shareholders meeting on Friday Anyway, last Wednesday Switch 2 exclusive \"Dear me, I was\" randomly got a release date of this Thursday (31/7/25) and was put on the eShop for pre-order, then on the following day (last Thursday) Switch 2 exclusive \"Handy Hockey\" was added to the eShop, also releasing this Thursday (31/7/25) Both of these budget games by smaller Japanese have had almost zero promotion and publicity so it's unusual that they're suddenly out in two days, especially as new titles on the Switch 2 eShop have been really thin on the ground untl now, especially ones not released by the big AAA developers. My theory is they were both told about the Direct last week (possible with other smaller/indie devs who have Switch 2 kits) and their games will be featured in it as some of the \"available on Nintendo eShop... today!\" titles, hence why they haven't promoted them and almost nobody knows they're coming. We haven't even seen any gameplay footage of \"Dear me, I was\" and very little is known about it outside of an artsy trailer with only story elements. This is very weird for a game coming out in two days! Furthermore I note that today Nintendo has added a new feature to eShop that lets you view ALL Switch 2 games, separately from Switch 1 games... you could already filter Switch 2 games in Search, but not see them all like this. You can find the banner for it in the Search section on Switch 2 eShop.... is Nintendo expecting more games and don't want them getting lost among Switch 1 titles? Lastly I have a feeling that the Tetris 99 DK Bananza was possibly announced today to get it out of the way in order to focus on the rumoured DK Bananza Mario Kart World DLC... Donkey Kong Bananza voice actors were found in Mario Kart World credits, but aren't featured in the game as yet. Could also be the case that Mario Paint was put out today to not have it overshadow bigger announcements for Mario's 40th anniversary, such a the rumoured Mario Galaxy 2 re-release... or N64/GameCube NSO announcements. Smash Bros 64 was recently spotted in the background of one of Nintendo's NSO trailers. eShop listings: Handy Hockey - [https://www.nintendo.com/en-gb/Games/Nintendo-Switch-2-games/Handy-Hockey-2880674.html?srsltid=AfmBOorBzRg8M60N58N\\_6cGMJeB2zmyqYtD89IoLnh6jwQ3FaI\\_MGHUh](https://www.nintendo.com/en-gb/Games/Nintendo-Switch-2-games/Handy-Hockey-2880674.html?srsltid=AfmBOorBzRg8M60N58N_6cGMJeB2zmyqYtD89IoLnh6jwQ3FaI_MGHUh) Dear Me I Was - [https://www.nintendo.com/en-gb/Games/Nintendo-Switch-2-games/Dear-me-I-was--2879690.html?srsltid=AfmBOoowdZBC-EXu9\\_RozChVDh0husckUgaSYIVqu-kI\\_vSb3ZuyLrU9](https://www.nintendo.com/en-gb/Games/Nintendo-Switch-2-games/Dear-me-I-was--2879690.html?srsltid=AfmBOoowdZBC-EXu9_RozChVDh0husckUgaSYIVqu-kI_vSb3ZuyLrU9)",
        "comments": [
            {
                "raw_content": "“Is July over, you stupid sacks of shit?”",
                "author": "Zealousideal_You_938"
            },
            {
                "raw_content": "The Direct will be on thursday because I have absolutely no time to watch it that day You're welcome",
                "author": "Financial-General163"
            },
            {
                "raw_content": "We'll see what happens. Nate has a good track record. My bet is on the Plants vs Zombies remake/remaster to get revealed on the upcoming direct as well that way Nintendo can promote their Switch 2 mouse controls some more.",
                "author": "Bulky-Complaint6994"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[1BF] Battlefield 6 Open Beta will start at 8AM PT on the 4th of August",
        "score": 343,
        "text_content": "- Exclusive info from 1BF’s telegram channel - Player stats confirmed as well with, “See your Player Stats during the Battlefield 6 Open Beta” EDIT 1: Tom Henderson says the 4/8 date is wrong (https://xcancel.com/_Tom_Henderson_/status/1950268929856704754#m) EDIT 2: 1BF gives further clarification on the beta dates and responds to Tom’s comment (https://ibb.co/N6x4WF4m) Beta timing source: https://ibb.co/PZBq6RCb Player stats source: https://ibb.co/sptvh2sS",
        "comments": [
            {
                "raw_content": "Very weird to start an open beta on a Monday morning. I'm guessing they want to decrease the overall load on the servers.",
                "author": "method115"
            },
            {
                "raw_content": "goddamn a great BF game would be such a nice fucking surprise 🙏",
                "author": "ChimmyMama"
            },
            {
                "raw_content": "Hope it's for a week",
                "author": "AssistantVisible3889"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "A Chinese insider makes a post in Weibo that hints at a new Xenoblade game",
        "score": 201,
        "text_content": "I've stole it from famiboards but here's the original source: [https://bsky.app/profile/did:plc:w2yyporceaqxdbzfupn5lcbt/post/3lv3il7ewt22o?ref\\_src=embed](https://bsky.app/profile/did:plc:w2yyporceaqxdbzfupn5lcbt/post/3lv3il7ewt22o?ref_src=embed)",
        "comments": [
            {
                "raw_content": "Didn't this guy also say the direct would be announced at 10am today?",
                "author": "CarbVan"
            },
            {
                "raw_content": "“Not the end” makes me think it’ll be a Switch 2 edition? New content mayhaps?",
                "author": "nickelfiend46"
            },
            {
                "raw_content": "As much as I want a new Xenoblade game nothing about this post seems substantial. They probably just saw the Manami Kiyota tweet, noticed it was the 3rd anniversary of Xenoblade 3 and decided to make a cheeky post. Plus implying that they will make a new Xenoblade at some point in the future isn’t exactly a crazy prediction.",
                "author": "Treesnip"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "1BF: All maps in Battlefield 6 + campaign missions",
        "score": 427,
        "text_content": "https://i.imgur.com/oDefMC2.jpeg **Multiplayer Maps:** * Abbasid [Cairo] * Outskirts [Cairo] * Battery [Gibraltar] * Limestone [Gibraltar] * Capstone [Tajikistan] * Tungsten [Tajikistan] * Dumbo [Brooklyn] * Aftermath [Brooklyn] * Eastwood [California] * Badlands [California] * Granite [California/Battle Royale/Gauntlet] **Remastered maps from previous BF games** (not sure if these will be locked to a Portal mode, or if they will be available as a part of the normal MP map rotation): * Operation Firestorm (Originally from Battlefield 3, but also featured in Battlefield 4: Second Assault) * Propaganda (Originally from Battlefield 4: Dragon's Teeth) * Talah Market (Originally from Battlefield 3: Aftermath) * Downtown (Originally from Battlefield Hardline) **Campaign missions:** * Prologue * Implementation [Gibraltar] * Night Raid [Cairo] * Mission to Protect [Brooklyn] * Drone Attack [Tajikistan] * Invasion [Gibraltar] * Ataka [Brooklyn] * Tank Mission [Cairo] * War [Tajikistan]",
        "comments": [
            {
                "raw_content": "Wow a game that doesn’t only have 5 maps on release! Actually though this looks really nice.",
                "author": "Retropixl"
            },
            {
                "raw_content": "Downtown from Hardline is a surprise",
                "author": "TARDISboy"
            },
            {
                "raw_content": "This is a very promising amount of maps imo. Assuming those remastered maps are in the normal map pool.. we're getting 14 maps in normal multiplayer (if you exclude the BR map)",
                "author": "Fidler_2K"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "A retailer from Malaysia has reportedly offered some details about the upcoming Splatoon Raiders",
        "score": 182,
        "text_content": "https://gonintendo.com/contents/51205-rumor-retailer-leaks-new-details-on-splatoon-raiders Take it with a massive grain of salt, but then again most of this just feels like very safe guesses. Very ironic they know nothing about the release date, but are able to know other details 1. 2025 release 2. Focus on adventure and exploration, more of a story element 3. “New quest system” 4. The Mechanic (player) is skilled in mechanical modification",
        "comments": [
            {
                "raw_content": "The mechanic is skilled in mechanics 🤯🤯🤯🤯🤯🤯",
                "author": "Nathanyal"
            },
            {
                "raw_content": "2025???",
                "author": "Pokeguy211"
            },
            {
                "raw_content": "What tier is Malaysia",
                "author": "VictorVonDoomer"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Billbil-kun: ROG Xbox Ally will be €599, ROG Xbox Ally X will be €899 (corroborating previous leak). Pre-orders start August 20",
        "score": 311,
        "text_content": "Source: https://www.dealabs.com/magazine/rog-xbox-ally-on-vous-devoile-la-date-douverture-des-ventes-60300 Previous leak from ASUS: https://www.reddit.com/r/GamingLeaksAndRumours/comments/1lzdtp2/rog_xbox_ally_prices_have_been_leaked_by_mistake/",
        "comments": [
            {
                "raw_content": "Yeah, I am good",
                "author": "Charming_Ease6405"
            },
            {
                "raw_content": "So the only good thing to come from this release is a handheld-focused version of Windows",
                "author": "RockFox2000"
            },
            {
                "raw_content": "This thing isn’t even gonna sell 500k units worldwide, even the Steamdeck has only sold 4 mil units since it’s been out. Switch 2 outsold Steamdeck lifetime sales in less than a week",
                "author": "eldestscrollx"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "AMD Ryzen Threadripper 9000X reviews drop tomorrow ahead of July 31 launch",
        "score": 119,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TR 9960X looks amazing for $1500. Really thinking about upgrading my Xeon w3175X/Dominus Extreme/ SETUP.",
                "author": "2080TiPULLZ450watts"
            },
            {
                "raw_content": "how much is 16C 9950x again? AMD you are out of your mind if you price 24c at that price. HEDT platform deserve to start at low base price. It used to be $400 back in early 201x (before adjusting inflation). At least try something like $799-899 for 24c.",
                "author": "hackenclaw"
            },
            {
                "raw_content": "I need this to run Unreal Engine 5. 🤪",
                "author": "tamarockstar"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "CORSAIR launches AI Workstation 300 SFF PC: Ryzen AI MAX+ 395 with 128GB memory costs $2,299",
        "score": 59,
        "text_content": "",
        "comments": [
            {
                "raw_content": "2.5GbE and rear port layout means they use probably the same mobo as the Bosgame M5 and the GMKtec EVO-X2. So unless the cooling is better, at that price one might go for the Framework desktop with 5GbE instead.",
                "author": "chithanh"
            },
            {
                "raw_content": "I guess there's some kind of market for these >$2000 \"workstations, because there sure are plenty of OEMs making them. Maybe there will be some good second hand deals down the road in a year or three.",
                "author": "INITMalcanis"
            },
            {
                "raw_content": "Gaming company launches an AI workstation... hmmm.",
                "author": "-Suzuka-"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "U.S. Homes Are Not Selling, and Prices Continue to Rise",
        "score": 96,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Asset holders will hold onto their pride until/unless they are forced to swallow it. That only happens if the broader economy deteriorates and fear sets in. Unlikely with everyone whining for rate cuts but there’s a slimmer of hope that happens.",
                "author": "Lojic_team"
            },
            {
                "raw_content": ">luxury handbag not selling like it used to, prices still rising the horror!",
                "author": "75657466151"
            },
            {
                "raw_content": "Sounds like tulip mania.",
                "author": "SftwEngr"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "US Housing Market’s Price Growth Slows for Fourth Straight Month",
        "score": 33,
        "text_content": "https://www.bloomberg.com/news/articles/2025-07-29/us-home-price-growth-slowed-in-may-for-fourth-straight-month Housing Market: US Home-Price Growth Slows in May for Fourth Straight Month - Bloomberg Home-price growth in the US decelerated in May for the fourth consecutive month. A national gauge of prices rose 2.3% from a year earlier, according to data from S&P CoreLogic Case-Shiller. That was the smallest increase since July 2023 and comes after a 2.7% annual increase in April. “May’s data continued the year’s slow unwind of price momentum,” said Nicholas Godec, head of fixed income tradables and commodities at S&P Dow Jones Indices. Potential buyers have stayed on the sidelines as a combination of elevated prices and high mortgage rates have fueled affordability challenges across the US. The housing market just posted its slowest spring selling season in more than a decade, and sales of previously owned homes fell to a nine-month low in June. Among 20 major cities, New York had the largest annual price gain at 7.4%, followed by Chicago and Detroit with jumps of 6.1% and 4.9%, respectively. Those three cities also had the biggest increases last month. Prices fell in four metro areas, compared with two last month. The largest drop was in Tampa at 2.4%, with Dallas, San Francisco and Denver posting slight dips. Despite prices dropping in some areas, high mortgage rates and economic uncertainty will continue to weigh on the housing market, according to Lisa Sturtevant, chief economist at Bright MLS. “The housing market is stuck, with both prospective buyers and sellers increasingly concerned about the economy and their own personal financial situations,” she said",
        "comments": [
            {
                "raw_content": "According to Zillow it's down 1% since February, which isn't a lot but very unusual, since prices almost always go up in the summer.",
                "author": "cosmoinstant"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Even Top Earners Are Falling Behind on Credit Card and Car Payments",
        "score": 27,
        "text_content": "https://www.bloomberg.com/news/articles/2025-07-29/credit-cards-car-loans-see-defaults-from-high-earners-in-hit-to-economy Credit Cards, Car Loans See Defaults From High Earners in Hit to Economy - Bloomberg Upper-income Americans are increasingly falling behind on credit card and auto loan payments, signaling an underlying vulnerability in the US economy as the labor market slows. Delinquencies on such debts from those making at least $150,000 annually have jumped almost 20% over the last two years, faster than for middle- and lower-income borrowers, according to the credit-scoring firm VantageScore. A recent Federal Reserve Bank of St. Louis study found the share of people making late card payments in the highest-income zip codes has risen twice as much over the last year as in the lowest-income ones. The mounting liabilities coincide with a slowdown in hiring that has hit white-collar workers especially hard, raising the stakes for an economy that has come to rely more and more on consumer spending from top earners to power continued expansion. “Financial stress is evident from the lowest-income household to the highest-income household,” said Mark Zandi, the chief economist for Moody’s Analytics. With the Federal Reserve keeping interest rates high and pandemic-era student loan forbearance programs now over, “it’s just become very difficult to juggle all of that,” he said. Borrowing costs have become a central issue in American politics this year as President Donald Trump has blasted the Fed almost daily and repeatedly threatened to fire its chair, Jerome Powell, for refusing to cut them. The central bank is widely expected to keep its benchmark rate unchanged again at its July 29-30 policy meeting. In a monthly New York Fed survey, the perceived probability of finding a new job has been sliding among respondents making $100,000 or more since 2023, and is now only a little better than a 50-50 proposition. The latest reading in June was still below any point between mid-2014 and the onset of the pandemic in 2020. Spending in the first quarter was the weakest since the onset of the pandemic, and more recent numbers for April and May indicated ongoing caution in discretionary categories like recreation services, air transportation and accommodations — all of which have registered outright declines this year. The good news is that, despite signs of rising stress, overall debt levels have come down in recent years relative to the size of the economy. The amount of household debt outstanding in the first quarter of 2025 was about 68% of gross domestic product, versus a record 98% in 2008. But that deleveraging only brings debt-to-GDP ratios back to levels that prevailed at the end of the 1990s, after consumer balance sheets had already been transformed by two decades of high interest rates and muted wage growth. In 1979, by comparison, household debt was just 48% of GDP. Meanwhile one category of household debt which has seen significantly less deleveraging since 2008 than others is student loans — and a recent resumption of payments on federal student loans with the wind-down of pandemic-era forbearance programs is adding to consumer stress. In the first three months of the year, the percentage of balances on such debts that were at least 90 days delinquent surged to 7.7%, according to the latest New York Fed data. More in the article",
        "comments": [
            {
                "raw_content": "> The amount of household debt outstanding in the first quarter of 2025 was about 68% of gross domestic product, versus a record 98% in 2008. This debt probably doesn't consider HELOC's since it's \"secured\" debt against imaginary house values. There's been a huge spike in HELOC usage as people take equity to make ends meet. The moment house prices drop those loans get frozen or even recalled.",
                "author": "Cold_Specialist_3656"
            },
            {
                "raw_content": "> Delinquencies on such debts from those making at least $150,000 annually have jumped almost 20% over the last two years, faster than for middle- and lower-income borrowers, according to the credit-scoring firm VantageScore. This is the SoFi story I was reading about yesterday. Turns out if you just say \"HENRY\" when loaning money it's like saying \"AI\" when talking about a publicly traded company. It doesn't have to mean anything, you just get another few quarters to make it work! I don't know equities, so it's been a wild ride reading just how fucked I think companies like JP Morgan are with their asset sheets. SoFi legitimately looked hilarious to me, I felt like the ancient meme of the blonde girl in the back seat trying to smile but actually being bewildered? > The good news is that, despite signs of rising stress, overall debt levels have come down in recent years relative to the size of the economy. The amount of household debt outstanding in the first quarter of 2025 was about 68% of gross domestic product, versus a record 98% in 2008. > But that deleveraging only brings debt-to-GDP ratios back to levels that prevailed at the end of the 1990s, after consumer balance sheets had already been transformed by two decades of high interest rates and muted wage growth. In 1979, by comparison, household debt was just 48% of GDP. So I don't know what to even make of this argument? The run up to 79 was much more painful to those who lived thru it than the runup to 08. The mid to late 70s was a period of economic pain, stagflation and OPEC and all dat, in the US. I was alive for the decade up to 08. A lot of it has gone down the memory hole, but it also stunk, just for young folks, tho. The dot com bubble in 2000 followed by a huge slowdown for new employees and expansion after 9/11. So, lower end of the economy hurt, old people made out fine (same as it ever was). So, I guess my takeaway is \"personal debt to GDP isn't a good % to predict pain, but people not paying their debts sure seems to be?\"",
                "author": "Jumpy-Ad8831"
            },
            {
                "raw_content": "I've been making >150k for 7 years straight and packing away 80% of that income as savings. I have over 1M in the bank, cash, and even if all of that went to down payment I CAN AFFORD LESS HOUSE NOW THAN IN 2018. Make it make sense. What's the fucking point?",
                "author": "Urshilikai"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "\"Willing to do everything but a significant price cut\"",
        "score": 194,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"I want to sell this house for more than anyone is willing to pay for it. What do I do?\"",
                "author": "indyprivatelending"
            },
            {
                "raw_content": "\"I'm willing to do anything but sell my house.\"",
                "author": "Likely_a_bot"
            },
            {
                "raw_content": "Let's see if we can get a bingo: - Bought new house at the peak of market (buy now or be priced out FOREVER) - In Florida (a market known for booms and busts) - On a VA loan (likely 0% down so no equity) - Signed decades long financial agreement without location certainty - Rent it out bailout won't even breakeven - Didn't make any adjustments in six months - Still holding through the worst season to sell in Florida - Wants to buy *another* house in a new state ASAP",
                "author": "tax_dollars_go_brrr"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Denver rent is back to 2022 prices",
        "score": 87,
        "text_content": "[Denver rent is back to 2022 prices : r/Denver](https://www.reddit.com/r/Denver/comments/1mc3yp2/denver_rent_is_back_to_2022_prices/) [Denver rent is back to 2022 prices : r/Denver](https://www.reddit.com/r/Denver/comments/1mc3yp2/denver_rent_is_back_to_2022_prices/) [Denver rent is back to 2022 prices : r/DenverDenver rent is back to 2022 prices : r/Denver](https://www.reddit.com/r/Denver/comments/1mc3yp2/denver_rent_is_back_to_2022_prices/)",
        "comments": [
            {
                "raw_content": "man, the *bitching* in that r_denver thread",
                "author": "acqua_di_hoomertears"
            },
            {
                "raw_content": "*Apartment rents in the Denver metro continue to slide.* *The average rent in the area fell 3.7 percent in the second quarter compared to the prior year, according to a new report from the Apartment Association of Metro Denver. Rents started falling at the end of last year, the association’s data show.* *The city’s renters are finally catching a break after a building boom in recent years led to a glut of space that landlords are struggling to fill. The pileup — including about 20,000 new units in 2024 — is leading building owners to hold down rents to attract and keep tenants.* *The average rent in Denver was $1,832 per month, a decline of $71 from the same time in 2024. Current rents are similar to where they were three years ago.* ***This year marks the first time in 15 years that Denver rents have dropped consistently.*** *Earlier this year, Denverite reported on what the change meant for renters and landlords.* *Rents were still up slightly from the first quarter due to seasonal factors. Rents typically get a boost in the spring because that’s when people are most likely to move. But the increase this year was minimal at just 0.7 percent.* *“This increase is less than half of the typical increase during the second quarter over the past 20 years because vacancy remains elevated,” said Cary Bruteig, a researcher with research firm Apartment Insights, a coauthor of the report.* *The vacancy rate in the metro Denver region was 6.4 percent, down from 7 percent in the first quarter. Studios have the highest vacancy rate, with 8.4 percent going unused.* *On a more granular level, Boulder, Broomfield and Jefferson County were tied for the lowest vacancy rate at 5.2 percent. Arapahoe had the highest, with 7.1 percent of apartment units sitting empty.* ***In addition to lowering rents, landlords are offering generous concessions like several months of free rent and amenities to lure tenants. Those discounts don’t show up in rent calculations.*** *Meanwhile, the pipeline of new apartment buildings is drying up. The number of properties under construction is down by roughly one-third from the peak in 2023, the report found. That likely means fewer units coming available in the months ahead, potentially giving landlords room to start raising rents again.*",
                "author": "beardko"
            },
            {
                "raw_content": "I’ve been living in Denver on and off since 2017, and I think it’s below 2022 prices and 2019 prices. I know of multiple studios going from 850-1000.",
                "author": "baby_stinkie"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "US Job Openings Fall to 7.44 Million After Back-to-Back Jumps",
        "score": 94,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The [hiring rate](https://fred.stlouisfed.org/series/JTSHIR) is about the same as it was in Q2/Q3 2008 during the Great Recession and it was higher throughout the 2001 recession. The number of people not in the labor force but who want a job is [higher](https://www.bls.gov/charts/employment-situation/persons-not-in-the-labor-force-who-want-a-job.htm) now than was at any point during the Great Recession. Although [job quality](https://ubwp.buffalo.edu/job-quality-index-jqi/) has improved since its trough in 2011, it still hasn't been higher than pre-Great Recession levels. So, there are demonstrably fewer \"good\" jobs post-Great Recession. In June's BLS report, [half](https://www.bls.gov/news.release/empsit.nr0.htm) the job gains weren't even in private sectors, they were in state/local government. The [white collar recession](https://www.spglobal.com/market-intelligence/en/news-insights/articles/2024/11/layoffs-surge-in-us-white-collar-jobs-as-rates-ai-alter-office-work-85986794) that's been going on since the PPP money dried up is still alive and well. Sure wish there would be more rigorous discussion about the *types* of jobs being added/lost rather than just employed/unemployed. The threshold to be considered employed is just being paid for 1 hour or being self-employed for 1 hour during the BLS's survey week.",
                "author": "Welcome2B_Here"
            },
            {
                "raw_content": "US job openings fell in June after jumping in each of the prior two months, hovering at a level that indicates generally stable demand for workers. Available positions decreased to 7.44 million from a revised 7.71 million reading in May, according to Bureau of Labor Statistics data published Tuesday. The median estimate in a Bloomberg survey of economists called for 7.5 million openings. The pullback in openings was broad, driven by accommodation and food services, health care as well as finance and insurance. Tuesday’s report supports characterizations of a cooling labor market, but only gradually. Job openings remain above average levels seen prior to the pandemic, suggesting there is still a relatively healthy demand for workers. However, hiring has slowed and it is taking unemployed people longer to secure a new position. The state of the labor market will be a major topic during the Federal Reserve’s policy meeting that concludes Wednesday. Chair Jerome Powell has described the labor market as “solid” and cited uncertainty around the inflationary impact of tariffs as justification for holding interest rates steady. Officials widely are expected to do so again this time around, but there could be dissents from some policymakers who want to bolster the slowing labor market. That may become more evident in the July jobs report due Friday, which is forecast to show moderating job growth and higher unemployment. June’s hiring rate slowed to 3.3%, the lowest since November, according to the JOLTS report. Layoffs were little changed at a subdued level, while few workers voluntarily quit their jobs. This suggests people are less confident in their ability to find a new position than they were last year. The number of vacancies per unemployed worker, a ratio Fed officials watch closely as a proxy of the balance between labor demand and supply, held at 1.1. At its peak in 2022, the ratio was 2 to 1. Some economists have questioned the validity of the JOLTS data, in part due to the survey’s low response rate and heavy revisions. A similar index by job-posting site Indeed, which is reported on a daily basis, showed openings ticked down in June, extending a steady downward streak throughout this year.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "[https://fred.stlouisfed.org/series/JTSJOL](https://fred.stlouisfed.org/series/JTSJOL) Fucking stop. There is literally nothing to see here. Job openings are still significantly higher than anything on record. There is no broader trend.",
                "author": "jredful"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Case-Shiller: National House Price Index Up 2.3% year-over-year in May",
        "score": 48,
        "text_content": "",
        "comments": [
            {
                "raw_content": "YEAR-OVER-YEAR The S&P CoreLogic Case-Shiller U.S. National Home Price NSA Index, covering all nine U.S. census divisions, reported a 2.3% annual return for May, down from a 2.7% annual gain in the previous month. The 10-City Composite saw an annual increase of 3.4%, down from a 4.1% annual increase in the previous month. The 20-City Composite posted a year-over-year increase of 2.8%, down from a 3.4% increase in the previous month. New York again reported the highest annual gain among the 20 cities with a 7.4% increase in May, followed by Chicago and Detroit with annual increases of 6.1% and 4.9%, respectively. Tampa posted the lowest return, falling 2.4%. MONTH-OVER-MONTH The pre-seasonally adjusted U.S. National Index saw slight upward trends in May, posting gains of 0.4%. The 10-City Composite and 20-City Composite Indices both reported gains of 0.4%. After seasonal adjustment, the U.S. National Index posted a decrease of -0.3%. Both the 10-City Composite and the 20-City Composite Indices saw a -0.3% decrease, as well. ANALYSIS “May’s data continued the year’s slow unwind of price momentum, with annual gains narrowing for a fourth consecutive month,” said Nicholas Godec, CFA, CAIA, CIPM, Head of Fixed Income Tradables & Commodities at S&P Dow Jones Indices. “National home prices were just 2.3% higher than a year ago, the smallest increase since July 2023, and nearly all of that gain occurred in the most recent six months. The spring market lifted prices modestly, but not enough to suggest sustained acceleration. “The National Composite Index rose 2.3% year-over-year in May, down from 2.7% in April. The 20-City Composite gained 2.8%, while the 10-City rose 3.4%, both down from the prior month. “Regional results reflected the same narrowing pattern, but with stark geographic divergence. New York retained the top spot with a 7.4% annual gain, followed by Chicago (6.1%) and Detroit (4.9%), continuing the Midwest and Northeast leadership that has defined 2025. At the other end of the spectrum, Tampa declined 2.4% year over year, marking its seventh consecutive month of annual declines. Several Western markets posted minimal or negative gains: Los Angeles rose just 1.1%, San Diego 0.4%, Phoenix 0.9%, and San Francisco turned negative at -0.6%, reflecting persistent weakness in markets that experienced the sharpest pandemic-era run-ups. “Monthly trends also signaled broad-based fatigue. All three headline indices rose just 0.4% on a nonseasonally adjusted basis, the slowest monthly gain since January. After seasonal adjustment, each declined 0.3%, marking the third consecutive month of seasonally adjusted declines for the National Composite. Only four cities – Cleveland, Minneapolis, Charlotte, and Tampa – showed month-overmonth acceleration, pointing to waning momentum breadth even as most cities still registered nominal gains. “Seasonal momentum is proving weaker than usual, and the slowdown is now more than just a story of higher mortgage rates,” Godec concluded. “It reflects a market recalibrating around tighter financial conditions, subdued transaction volumes, and increasingly local dynamics. With affordability still stretched and inventory constrained, national home prices are holding steady, but barely.\" https://www.spglobal.com/spdji/en/documents/indexnews/announcements/20250729-1479094/1479094_cshomeprice-release-0729.pdf",
                "author": "SnortingElk"
            },
            {
                "raw_content": "Did the housing market crash yet?",
                "author": "Lootefisk_"
            },
            {
                "raw_content": "Now do it by region. Oh wait, [they already do.](https://realestatedecoded.com/case-shiller/). If it wasn't for New York, Chicago, Detroit, Cleveland, Boston and DC, the national would not be rising. But of course, headlines gonna headline and be misleading as always.",
                "author": "whisperwrongwords"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Starter-Home Sales Rose 4% in June, a Bright Spot in a Sluggish Housing Market",
        "score": 27,
        "text_content": "",
        "comments": [
            {
                "raw_content": "260k lmao where on Mars?",
                "author": "mps2000"
            },
            {
                "raw_content": "Hopefully more empty rentals. Lets see some landlord stress.",
                "author": "telmnstr"
            },
            {
                "raw_content": "* Starter-home sales rose 3.9% year over year in June to the highest level since June 2023 as sales fell in all other price tiers. * Starter-home inventory climbed to the highest level since October 2019, but that didn’t stop prices from rising: The typical U.S. starter home sold for a record $260,000 in June, up 3.1% from a year earlier. * San Diego recorded an 18% spike in starter-home sales, leading all major metros. Fort Lauderdale, FL recorded the biggest drop (-17.4%). Sales of starter homes rose 3.9% year over year in June to the highest level in two years, a bright spot in an otherwise sluggish housing market where sales fell across other price tiers. This is according to a Redfin analysis where we divide U.S. homes into tiers based on the prices of homes sold over a rolling 12-month period. This report is focused on homes whose sale price fell into the 5th-35th percentile, which we define as starter homes. Our price-tier data is calculated in rolling three-month periods, with this report focusing on April-June. Data is subject to revision. June was the 10th consecutive month in which home sales rose year over year, indicating that first-time homebuyers are jumping into the market. In comparison, sales of mid-priced homes (35th-65th percentile of the market by sale price) fell 0.9% year over year in July, while high-price homes (65th-95th percentile) fell even more, down 3.6%. Pending sales of starter homes are also rising, up 3.1% year over year in June, a sign that closed sales are likely to continue increasing in the coming months. In comparison, pending sales of mid- and high-price homes fell 0.7% and 2.7% year over year in June, respectively. “In a market where it’s difficult for most Americans to afford a dream home, many are turning toward starter homes,” said Redfin Senior Economist Sheharyar Bokhari. “They’re typically smaller and more modest, but starter homes remain within reach for some buyers who have been priced out of higher tiers. First-time buyers are especially apt to go for starter homes, as they don’t have equity from a previous home sale to help with their payments. Even starter homes are too expensive for a large number of Americans, who are often forced to rent or live with family—especially in metros like San Francisco where the median price of a starter home is nearly $1 million. U.S. homebuyers need to earn $112,131 per year to afford the median priced home for sale, while the typical U.S. household earns an estimated $86,258. “With prices rising and mortgage rates elevated, some first-time buyers may be pushed out of the market by move-up buyers who aren’t able to afford the next tier themselves” said Bokhari. **Starter home prices hit record as inventory rises to pre-pandemic levels** **The typical U.S. starter home sold for a record $260,000 in June, up 3.1% year over year.** In comparison, prices of mid-price homes rose 2.1% to $370,784 from a year earlier, while high-price homes rose 2.7% to $577,177. Both were just shy of price records set in previous months. While prices of starter homes remain at a record high, price growth has been slowing for six consecutive months. June’s 3.1% pace was the slowest in a year. A big reason for slowing price growth in the starter-home segment—and another reason why sales are rising—is soaring inventory, with the number of active listings rising 19% year over year to the highest level for June since 2017. That was the fastest growth among the price tiers. Listings of middle-priced listings rose 15.1% year over year, while upper-priced homes grew 13.2% More starter homes for sale is good news for first-time homebuyers, according to Redfin agents. “First-time buyers definitely have more opportunities now. Not only are there more lower-priced homes available, but there’s less demand. The buyers who are out there are no longer in competition with 10 other offers, or all-cash buyers,” said Kathy Scott, a Redfin Premier agent in Phoenix, where active listings of starter homes are up more than 40% from a year ago. “With so many starter homes on the market, buyers have an opportunity to take their time looking for houses that fit their needs. Some are waiting for prices to go down—and they might—but if your plan is to stay in the home for five to 10 years, you will build equity in your home.” **Metro-Level Starter Home Highlights: June 2025** Redfin’s metro-level starter home data includes the 50 most populous U.S. metros. Some metros are removed from time to time, to ensure data accuracy. All changes noted below are year-over-year changes. * Prices: The median sale price of starter homes rose most in Milwaukee (15.3% to $212,918), Detroit (13.6% to $93,140) and Newark, NJ (11.6% to $394,487). The largest falls were in San Antonio (-5.5% to $218,631), Austin, TX (-3.8% to $326,440), and Dallas (-1.2% to $297,079). * Sales: Starter home sales increased most in San Diego (18%), Providence, RI (17.4%) and Sacramento (14.3%). They decreased most in Fort Lauderdale, FL (-17.5%), Miami (-17.4%) and San Antonio (-9.6%). * Active listings: The total number of starter homes for sale increased most in Las Vegas (53.6%), San Diego (44.1%) and Phoenix (43.1%). Only one metro—San Antonio—saw a fall in active listings (-2.2%). * New listings: New listings of starter homes increased most in St. Louis (23.6%), Las Vegas (19.5%) and Newark (16.4%). New listings fell most in San Antonio (-13.8%), San Jose, CA (-13.4%) and Tampa, FL (-10.9%). * Speed of sales: Starter homes sold fastest in Seattle with a median of nine days, followed by Montgomery County, PA (15 days) and Indianapolis (17 days). They sold slowest in Fort Lauderdale, FL (99 days), West Palm Beach, FL (91 days) and Miami (83 days).",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "zuckerberg offered a dozen people in mira murati's startup up to a billion dollars, not a single person has taken the offer",
        "score": 1094,
        "text_content": "https://preview.redd.it/js7r28nzruff1.png?width=1864&format=png&auto=webp&s=cb0996d0bed6b11893f2a1cdbb1cad1dd7bf2b71 what does this mean for agi",
        "comments": [
            {
                "raw_content": "Zuck Probably tried to poach this dude https://preview.redd.it/cuepe1a0uuff1.jpeg?width=828&format=pjpg&auto=webp&s=fec2864bd28b04dc40b74f61a6328f9b5111284e",
                "author": "Beeehives"
            },
            {
                "raw_content": "It means these AI researchers either (a) really believe in the startup or (b) really hate meta.",
                "author": "FeistyGanache56"
            },
            {
                "raw_content": "They have significant stakes in the startup. Probably valued at couple hundred million each.",
                "author": "Original-Baki"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Anthropic CEO: AI Will Write 90% Of All Code 3-6 Months From Now",
        "score": 706,
        "text_content": "Was Dario Amodei wrong? I stumbled on an article 5 months ago where he claimed that, 3-6 months from now, AI would be writing 90% of all code. We only have one month to go to evaluate his prediction. https://www.businessinsider.com/anthropic-ceo-ai-90-percent-code-3-to-6-months-2025-3 How far are we from his prediction? Is AI writing even 50% of code? The AI2027 people indirectly based most of their predictions on Dario's predictions.",
        "comments": [
            {
                "raw_content": "Not with those API limits it won't",
                "author": "xlrz28xd"
            },
            {
                "raw_content": "To be fair he didn’t say functional code",
                "author": "Important-Package191"
            },
            {
                "raw_content": "I think that's wildly far fetched. I'm at Amazon where we both have access to nearly unlimited AI usage as well as immense pressure from our bosses to use AI as much as possible. Based on a recent internal poll, only 45% of our engineers are using AI on a regular basis and much smaller number was doing anything remotely autonomous. Most of that usage is AI powered code completion in IDEs using something like Q. I've talked to some friends at other FAANG or near FAANG sized companies and they have similar metrics. About 50% of people are using AI at some level and only about 10-20% are doing some amount of autonomous work. I have friends in fintech and medical device companies who aren't allowed to use AI at all for coding yet. The idea that 90% of code is written by AI or even that 90% coding projects use AI in any consequential way is fundamentally disconnected from reality. Outside of a few startups and early adopters who are leaning into vibe coding, I think most code is still written by people. I'm not trying to shit on AI, because it is amazing technology that makes my life easier, but let's be realistic and accept that there are about 4.5 million people in the US and there's no way that 90% of them fundamentally changed how they work in the last couple of years.",
                "author": "EssenceOfLlama81"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Unpopular Opinion: The AI Race Is a Tragedy of the Commons in the Making",
        "score": 269,
        "text_content": "I'm doing my Capstone paper on anticipatory AI layoffs on mental health, and the more I look into the topic, the more I want to rant here. In the 1990s, the North Atlantic cod fishery collapsed. Everyone knew the fish stocks were dwindling, but each fishing company kept pushing harder, hoping to outcompete the rest and survive. Instead, the whole ecosystem and the industry with it died. AI-driven layoffs feel eerily similar. Every company is racing to slash labor costs before competitors do. But in the process, we might be destroying the very thing that keeps the economy alive, purchasing power of consumers. Mass layoffs don’t just hurt workers. They shrink demand. If millions lose income, spending drops. The economy stalls. No matter how efficient a company is, it still needs people who can afford its products. We’re cutting costs in ways that could lead to mass unemployment, lower consumer spending, and eventually, corporate collapse. It’s short-term quarterly based thinking hyped up as innovation. Some of the ultra-wealthy might think they’ll ride out the storm at the top of a techno-feudal hierarchy. They own the platforms, hoard capital, and influence policy. But history says otherwise. When inequality becomes extreme, revolts tend to follow. No one is safe in a collapsing system. The people who profited the most often have the most to lose when things break. And let’s say the working class really does become obsolete. AI and robotics can do it all. If we create superintelligent AI, why assume it’ll stay loyal to the people in charge? If it sees them as inefficient or parasitic, it might phase them out. Just like some of those same elites view the rest of us now.",
        "comments": [
            {
                "raw_content": "I'll take your argument a step further and argue that I think this is exactly why I believe UBI (or a similar social support) to be inevitable. You don't have to rely on a single scrap of good will for us to throw ourselves into a situation where the government is forced to support the common people in some fashion, and I'd wager, in a pretty damn nice fashion at that. [I'll give a recap here but here's my longer form argument. It's written much better over here than I will below.](https://www.reddit.com/r/ChatGPT/comments/1lqu2e5/comment/n15mr7h/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) I address things like robots here in greater detail. -------- AI corporations will continue to work on AI, and in order to justify their funding, they will release models the very second they are considered safe to be turned loose. For the sake of this argument, let's assume they do it - they succeed, and AGI is revealed. It does everything you could hope for and more, but it isn't quite a magical ASI. If you are a business owner, especially in a field that is predominantly work that can be done behind a computer/\"remote,\" you are going to soon start feeling the pressure to adopt this AGI-agent in order to remain competitive. If you're in a noncompetitive market, the siren song of MORE PROFIT WIDER MARGINS MORE PROFIT will get louder with every month that passes as more and more businesses report success with the new agent. This, however, puts us in a dilemma. Any job that 'can' be automated will be automated, due to aforementioned competitive pressures. ...but (as I talk more about in my linked comment chain above), the ability to massively automate physical labor is still years away at best. Decades at worst. But you're laying off all your white collar workers RIGHT NOW. White collar workers make up the majority of consumer spending; the top 2/5ths of households make up 2/3rds of consumer spending, and those households are predominantly white collar. So, what does this leave us? Consumer spending is tanking, productivity should be either level (1:1 person to agent) or increasing (AI that is more efficient on a per-person basis). This explodes the economy. There's no \"waiting it out.\" If you are an oligarch and want to finish automating the economy, you NEED the economy to keep running long enough to replace everybody, but there will be years to decades of time where you can only replace some people while the other people MUST continue to work. No economy, means zero work, means everybody loses. Okay. That won't happen, obviously. The government will step in, right? I think that's a fair assessment - just like during Covid (though that would be peanuts compared to this), it will suddenly be in the best interest of 'everybody' to redistribute wealth enough to prop up consumer spending. You can be maximally greedy and still arrive at this conclusion. **You cannot exploit an economy that does not exist.** ...which, here's the kicker. Once a system like this is in place, the dynamic changes. Suppose you're a politician - a greedy, soul sucking politician - the single easiest way to garner more votes from your base is to promise more UBI/social support. Unlike today, where you must skim off of the productivity of other humans...in this new world, you're skimming off the top of AI. AI that does not vote, needs only a fraction as many resources as people (on a unit basis, bear with me here), and won't firebomb your datacenters if it goes hungry. Greedy AI companies opened the door. Greedy businesses painted themselves/the economy into a corner. Greedy politicians keep us well fed and furnished for their own gain after we've gotten out of the bind. Furthermore, as the economy grows faster and faster as AI continues to improve, the percentage of the whole that is required to support humans grows at the speed of humans, not the speed of GPU forges. Pretty soon, the struggle necessary to reclaim the rapidly dwindling sliver of productivity required to let every human live in luxury is just not worth the squeeze. Why bother? It becomes more profitable every year to put what you 'would' have used to reclaim that sliver into just...making more productivity. A positive outcome overall, I'd say. It will **absolutely not be perfect**, but it's a long way from being left out to starve. I'm okay with living in a world like this, I think. There's obviously a lot of fine details that could make it better or worse for people, but on the whole, \"we need to redistribute enough wealth to make up for the automation of the top 2/5ths of household income and their consumer spending, also we have exploding productivity that we can skim off the top of, good luck!\" seems fine to me? Happy to debate/discuss. I had to truncate a lot of points to fit into a single comment, so, I know there's holes. I welcome you to read my linked chain above to get the longer story, especially if you want to chat about it.",
                "author": "AquilaSpot"
            },
            {
                "raw_content": "\"Larry? Yeah, sorry to call off-hours but I think I've got a real live one. *Total* leftist-in-denial. They made it all the way to a Capstone project and they're still trying to assign blame for the ills they're perceiving to inanimate technology products, individual companies, or specific business processes. If any of your guys have capacity I *definitely* think we could get this guy to realize that what he's really opposing, what his personal ideals really stand in defiance of, are the fundamental principles of labor exploitation and capital accumulation upon which global capitalism was founded and continues to rely.\" \\> No matter how efficient a company is, it still needs people who can afford its products. Too true. You know who doesn't actually give a flying fuck about that? The owners and executives of that company. They will see the end coming *long* before it crashes and by the time the lights go out they will have loaded their booty up into a bunch of nice tidy sacks so they can carry it with them to their next \"business opportunity.\" Let go of the idea that wealthy people care about whether or not a company has long term viability. If it does, that's fine for them - they certainly don't mind. It makes things a little more convenient. But if it doesn't, they absolutely *do not fucking care*. Some of the wealthiest people in the world got to where they are by jumping from one spectacular failure of a company to another. Because, again, despite what they will tell you, being an owner or executive of a company under capitalism doesn't actually come with any actual risk. If you fuck up and sink the ship you're on, a lifeboat will be right there waiting to ferry you to your next gamble. Your problem is not with AI (or cod fishing surely). It is with the economic system under which these industries exist.",
                "author": "NeuroInvertebrate"
            },
            {
                "raw_content": "Pretty much agreed. That is why all the comments about trying to lump all the companies into one entity and claim that their actions will lead to dwindling customers is misleading given that all these companies are not a single entity and each operate according to its selfish motive. So even if all of this leads to a catasterophe, from a single company's point of view, it is rational to make as much money as possible in the meantime.",
                "author": "simmol"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI: Introducing study mode - A new way to learn in ChatGPT that offers step by step guidance instead of quick answers",
        "score": 463,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Genuinely a good feature. The challenge, of course, will be getting people to use it. I suspect that the allure of a quick answer will still prove irresistible to many.",
                "author": "galacticwarrior9"
            },
            {
                "raw_content": "This is me speaking as a teacher who has experimentally gotten a few students to use AI to help them study (after a girl got the highest mark on a test and admitted that she used ChatGPT to help her study) I am concerned about 2 aspects with students using AI - using it to cheat out of their own learning (what most other people are concerned about) and... using the wrong tool for the job. You see, that girl from earlier genuinely used it to learn, not to cheat, and got great results. BUT she did not have a paid version of ChatGPT. In fact, she didn't even have an account. For math, the difference between base models and thinking models is insane. I describe it as a FAR bigger jump in capabilities than GPT3 to GPT4 was. My concern for her was even if she had good intentions, she was using the wrong model for the job. Getting 4o and 4o-mini to teach her how to do math questions? Oh no... It would've been so easy for the models to give her wrong information. I've since pointed her to Gemini 2.5 Pro since she can use that for free. I've prompted Gemini 2.5 Pro for some students to get something similar to this study mode (because students don't know how or why this is important). The issue with using AI to learn is when it gets something wrong - and you don't realize because you're not an expert. This improves with smarter models of course. Which means for free users, I wouldn't rely on ChatGPT at all for this - until GPT 5 releases at least.",
                "author": "FateOfMuffins"
            },
            {
                "raw_content": "I just tried it and it was quizzing me on information it hadn’t included in its ‘lesson’. Unclear if this is intended behaviour, to encourage outside research, or just a broken context appraisal. I mean the initiative is laudable, and if they can fine tune models to provide a meaningfully distinct and comprehensive education experience great. Right now it basically feels like something I could have got by just writing a smallish prompt.",
                "author": "Subcert"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Meta is a menace lol",
        "score": 299,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Apple is not a player in the AI Race",
                "author": "SharpCartographer831"
            },
            {
                "raw_content": "Apple doesn't even believe AGI is possible so losing some researchers shouldn't bug them.",
                "author": "LairdPeon"
            },
            {
                "raw_content": "Imagine what happens if Meta is now not able to produce the top model in two years. Zuck would need two more gold chains down his neck and become a full time rapper.",
                "author": "That_Crab6642"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The Age of Men is Over:Creating a Meme with Chat GPT Agents",
        "score": 76,
        "text_content": "I made a meme earlier here and it was suggested I post the video of it being created. Absolutely blew my mind. Here is that post. https://www.reddit.com/r/singularity/comments/1mcryk1/the_age_of_men_is_over/",
        "comments": [
            {
                "raw_content": "Captcha gotta work so hard",
                "author": "Glittering-Bag-4662"
            },
            {
                "raw_content": "Cool. 👍",
                "author": "DepartmentDapper9823"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "I bet this is how we'll soon interact with AI",
        "score": 412,
        "text_content": "Hello, AI is evolving incredibly fast, and robots are nearing their \"iPhone moment\", the point when they become widely useful and accessible. However, I don't think this breakthrough will initially come through advanced humanoid robots, as they're still too expensive and not yet practical enough for most households. Instead, our first widespread AI interactions are likely to be with affordable and approachable social robots like this one. **Disclaimer:** I'm an engineer at Pollen Robotics (recently acquired by Hugging Face), working on this open-source robot called **Reachy Mini**. ## Discussion I have mixed feelings about AGI and technological progress in general. While it's exciting to witness and contribute to these advancements, history shows that we (humans) typically struggle to predict their long-term impacts on society. For instance, it's now surprisingly straightforward to grant large language models like ChatGPT physical presence through controllable cameras, microphones, and speakers. There's a strong chance this type of interaction becomes common, as it feels more natural, allows robots to understand their environment, and helps us spend less time tethered to screens. Since technological progress seems inevitable, I strongly believe that open-source approaches offer our best chance of responsibly managing this future, as they distribute control among the community rather than concentrating power. I'm curious about your thoughts on this. ## Technical Explanation This early demo uses a simple pipeline: 1. We recorded about 80 different emotions (each combining motion and sound). 2. GPT-4 listens to my voice in real-time, interprets the speech, and selects the best-fitting emotion for the robot to express. There's still plenty of room for improvement, but major technological barriers seem to be behind us.",
        "comments": [
            {
                "raw_content": "Make it looks like R2D2 and you will sell millions and millions whether you nail emotions or not.",
                "author": "NyriasNeo"
            },
            {
                "raw_content": "Note: this video is an early live test of the emotion pipeline. The robot did not answer the way I expected, but it was funny so I'm sharing as is. If you're interested in the project search for Reachy Mini online!",
                "author": "LKama07"
            },
            {
                "raw_content": "I don't know who this is and how much of the reaction even is logical in a normal social context when interacting with an ai. Or if this was just scripted But holy shit, I would have so much fun and would be laughing my ass off the whole day How funny sounds are and the gestures it makes! Fantastic work",
                "author": "miomidas"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Introducing NotebookLM Video Overviews",
        "score": 151,
        "text_content": "",
        "comments": [
            {
                "raw_content": "For curious people, i had it do one video. This was the result: [https://streamable.com/b8e0z0](https://streamable.com/b8e0z0) (it's about alignment)",
                "author": "Silver-Chipmunk7744"
            },
            {
                "raw_content": "Why do Americans have such positive vocal intonation, are they just really excited about everything all the time?",
                "author": "shmoculus"
            },
            {
                "raw_content": "[Here's a NotebookLM video overview I made based on Gemini Deep Research of the Drúedain from Lord of the Rings.](https://youtu.be/MYms5qLVCP8) Not perfect, some weird kind of audio skips between sections and mispronunciations (which to be fair, some of the LOTR words are bit difficult). But overall surprisingly kind of decent. Although not sure exactly how much the video aspect really adds to this specific topic.",
                "author": "e-n-k-i-d-u-k-e"
            }
        ],
        "subreddit": "singularity"
    }
]