[
    {
        "post_name": "When the teleprompter stops working",
        "score": 625,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Joe Biden was not President. For 4 years, we were ruled by a criminal junta. Change my mind.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Joke's on them. Trump is far more effective without a teleprompter.",
                "author": "DeusVult1096"
            },
            {
                "raw_content": "Biden's mind was not right. We've never done anything about that to prevent it from happening ever again.",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Pentagon Seeks Trump’s Approval for Execution of 2009 Fort Hood Shooter Nidal Hasan",
        "score": 653,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Death penalty should always be administered in 3 years tops. Waiting 15+ years defeats the purpose.",
                "author": "ModsAreCucked"
            },
            {
                "raw_content": "Can we put a yellow button on his desk that says, \"EXECUTE THE FUCKING TERRORIST\"?",
                "author": "DebunkTheLeft"
            },
            {
                "raw_content": "They need to bring back public hangings to make the madness end. 🪢",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Lake County, Florida voted 5-0 in FAVOR of renaming one of their roads to \"Charlie Kirk Memorial Highway\" in honor of Charlie. This comes after leftists criticized the board during a meeting for their proposal, calling Charlie \"divisive\" and \"racist\"",
        "score": 678,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If they get Juneteenth we should get a Charlie Kirk Memorial Day. Make it a national holiday.",
                "author": "HankScorpio"
            },
            {
                "raw_content": "CJK highways > MLK boulevards",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "I'd rather watch executions on the white house lawn.",
                "author": "Spawnlingman"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: University of South Dakota professor Phillip Hook suspended for celebrating Charlie Kirk’s kiIIing and calling him a “NAZl” has been REINSTATED by Senior Clinton-appointed Judge Karen Elizabeth Schreier. No! Appeal this all the way to SCOTUS!",
        "score": 1282,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How can a court reinstate someone at a university? I confuse",
                "author": "AngeredKabar"
            },
            {
                "raw_content": "Why do these judges all look demonic?",
                "author": "WhatsFappening"
            },
            {
                "raw_content": "I don't get how judges have the power to do this?",
                "author": "NoahGav"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Three suspects arrested after a Texas youth baseball coach was shot during a pregame prayer with his players, according to local media.",
        "score": 1133,
        "text_content": "",
        "comments": [
            {
                "raw_content": "INCOMPATIBLE",
                "author": "_M_A_G_A_"
            },
            {
                "raw_content": "So three muslims \"accidentally\" shot up a group of white people praying. Okay let's see what the state of Texas thinks about that.",
                "author": "Zskills"
            },
            {
                "raw_content": "Wtf is going on",
                "author": "Bball-gurl"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump saw the Marine Corps Silent Platoon practicing on the White House South Lawn, so he invited them into the Oval Office",
        "score": 1331,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is while they're in the Oval Office. There's no other President like Trump. He genuinely loves this country and everything that goes with it. https://x.com/MargoMartin47/status/1970997782258516426",
                "author": "PeaceMakerDJT"
            },
            {
                "raw_content": "With Led Zepplin in the background!",
                "author": "YellowCrazyAnt"
            },
            {
                "raw_content": "I rarely seen Marines in dress blues at ease. ❤️🦅",
                "author": "Covfefebrulee"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Stephen Miller comes in swinging at Gavin Newscum",
        "score": 1629,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There does come a point where the administration encourages the murder of conservatives and the dance on our graves by scumbags like Newsome by only issuing Twitter burns in response.",
                "author": "Throwingway22"
            },
            {
                "raw_content": "Gavin Newsom is more authoritarian with his \"do as I say, not as I do\" approach. The Trump administration has been kind and firm, not authoritarian. We are MAGA and want to save our country and Americans.",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "So fucking do something about Stephen. Get in Trump's ear, make him fire worthless dumbass bondi, get gaetz in there, and fucking do something. Start building prisons and fill them with these demons.",
                "author": "Schroeder09"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "James O'Keefe: Senior DOJ Epstein Investigator Reveals ‘Epstein Was CIA’ — Confirms ‘Rapes Occurred While Bill Clinton Was on the Plane’ — Says of President Trump, \"He’s Protecting a Lot of Other People… He’s Not Protecting Himself, Because There’s Nothing There\"",
        "score": 1181,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So, wait...is this guy saying that Trump is protecting a lot of people and that's the reason why we haven't seen a file dump....? I don't give a fuck who goes down for this shit. Epstein files need to be dropped and if it brings the first world down with it, lock in, get strapped and prepare to defend what you believe most. ‘What is there about this that is unendurable and unbearable?’",
                "author": "lynxxyarly"
            },
            {
                "raw_content": "Eh, they don’t get angry when you say he might have been CIA, they get angry when you say he may have been _MOSSAD…_",
                "author": "GabeC1997"
            },
            {
                "raw_content": "We can't heal until these monsters stop being\"protected\"",
                "author": "obamagavemeaphone"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Paid protester identified and tracked to a Democrat activist NGO that organizes protests 🚨 Nate Friedman found their tax documents and discovers he’s being paid $75,000 per year to protest This NGO also has financial ties to the CCP The document proof is shown in video",
        "score": 1345,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And what are we going to do about it?",
                "author": "DeusVult1096"
            },
            {
                "raw_content": "If this rando can find that shit out... >>> SO CAN THE FBI <<< They owe him some money for doing their fucking jobs for them. Or... would they have preferred he not speak of this?",
                "author": "PhantomShield72"
            },
            {
                "raw_content": "The worst part is they are likely using our tax money to pay this asshole.",
                "author": "1776take2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Congratulations Dan Scavino. She said YES❤️‍🔥💍🙏🇺🇸",
        "score": 922,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Love at The White House! Happy engagement to both! ❤️",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "Why do people make these moments for public consumption? It's sickening.",
                "author": "MAGA_NRG"
            },
            {
                "raw_content": "Lucky dude. I got engaged once, then was dumped when I woke up from surgery after my deployment ended on a really bad note. Literally in the hospital bed getting the \"Dear John\" call. Only blessing is she died 4 years later from poor decisions. I'm really a bit jealous.",
                "author": "3-10"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "In case your hate for media started slipping.",
        "score": 1027,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Rage bait: https://www.salon.com/2025/09/24/dont-worry-erika-kirk-will-never-replace-her-husband/",
                "author": "-f-b-i-"
            },
            {
                "raw_content": "Jealousy is a hell of a drug. Author looks exactly how you'd expect a Salon writer to look.",
                "author": "PresidentialPepe"
            },
            {
                "raw_content": "If only they knew….she is way more rightwing than him.",
                "author": "MAGA-Fett"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Without swift justice, this is going to geat very ugly for everybody",
        "score": 674,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They won't stop until they are stopped.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "The democrats are waiting for that to happen. They need a new \"victim\" like Fentanyl Floyd. Then they will have massive riots ready to go",
                "author": "PapaPepe"
            },
            {
                "raw_content": "Well, considering what has happened after Charlie's homicide, we already know what happen. We'll complain online, including myself, talk about how much the left would rage if the situation was reversed, rinse and repeat until we're living under utter totalitarianism where the righteous are afraid to be righteous, and the wicked have no reason to stop being wicked. Scary times. We need to be praying the Lord has mercy on us.",
                "author": "TheMrStone"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Greg Gutfeld just WENT OFF on Jessica Tarlov and leftists for ENCOURAGING leftist vioIence “You label someone a fascist or a racist or a NAZl. It makes you free to attack them. And that has been the ideology from the start.”",
        "score": 1637,
        "text_content": "",
        "comments": [
            {
                "raw_content": "She's such an insufferable dumb bitch",
                "author": "Plutossextape1"
            },
            {
                "raw_content": "You cant reason with these people. Pick a side its over.",
                "author": "FusionBlack"
            },
            {
                "raw_content": "They don’t murder us because we are Nazis, they call us Nazis to murder us. RIP Charlie Kirk",
                "author": "Dangerous_donald1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ANTIFA DOG WHISTLES: Rep. Pramila Jayapal (D) calls on Democrats to be “strike ready” and “street ready.”",
        "score": 940,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Another Indian immigrant that wants to destroy America",
                "author": "racer513"
            },
            {
                "raw_content": "They just get more violent.This is a dangerous game they are playing. I honestly think these people want one of their own to be attacked just to use the excuse for all out violence.",
                "author": "FusionBlack"
            },
            {
                "raw_content": "Hideous bitch",
                "author": "TheDudeWillNotAbide"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨BREAKING: The 15 year old involved in the attack of \"BIG BALLS\" in Washington DC plead guilty to four counts: felony assault and robbery and attempted robbery and simple assault",
        "score": 1418,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Let me guess, he'll be home for Columbus Day?",
                "author": "Bongos"
            },
            {
                "raw_content": "Prison system overhaul needed. No more gen pop. You work 10 hrs a day. Solitary confinement. The money made goes to the victims and families. Tired of murderers and rapists going to a country club existence.",
                "author": "RedCapNation"
            },
            {
                "raw_content": "Execute him. No point in his existence. Will likely become a much bigger problem within 10 years. Remember Iryna Zarutska!",
                "author": "Thatunknownguy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔴Trump Truth: \"I have been briefed on the deadly shooting at the ICE Field Office in Dallas, Texas. It has now been revealed the deranged shooter wrote “Anti-ICE” on his shell casings. This is despicable!\"",
        "score": 1559,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If you want to go after the left-wing terrorists responsible, start with the Democratic Party.",
                "author": "airborne3502"
            },
            {
                "raw_content": "I honestly would like to know how many more people have to die before Democrats are held accountable in real and actionable ways.",
                "author": "NoWarWithIran"
            },
            {
                "raw_content": "ICE shooter. Charlie Kirk tranny lover killer. ABC Sacramento shooter. MN tranny school shooter. There's a pattern here boys, do we see it yet?",
                "author": "Bongos"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Kamala Harris, who is DUMB AS A ROCK, is going around and using, as a standard part of her Speech on why she lost the Election, that 2024 was the “closest Presidential Election in the 21st Century.” Everyone knows this is a lie, and was covered as such by Fox News",
        "score": 1254,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I can hear them now: He is so thin-skinned, blah blah blah",
                "author": "Returningtogod"
            },
            {
                "raw_content": "It was close because the bullet clipped his ear.",
                "author": "utfanx2"
            },
            {
                "raw_content": "Stop giving her attention",
                "author": "Bearcat_batch"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Democrat lawyer for Tyler Robinson, Charlie Kirk’s assassin, has pronouns in her bio. Because of course she does. Takes a Troon lover to represent a Troon lover I suppose.",
        "score": 1097,
        "text_content": "",
        "comments": [
            {
                "raw_content": "She probably meant to put \"Her/shey's\" instead.",
                "author": "nukiebear"
            },
            {
                "raw_content": "I cant wait to hear her squeal(pig noises) out his defense.",
                "author": "AssPhixEAtion627"
            },
            {
                "raw_content": "I suspect she's working as a public defender on this case. She has a private practice, but also a lot of experience as a public defender. https://www.nesterlewispllc.com/our-team > Kathy has been married to her junior high school sweetheart for thirty-five years and is a proud mom to two grown daughters and a son-in-law, who all entered careers in the legal field. In her spare time, Kathy enjoys singing in her church choir, watching good movies, solving puzzles and traveling to anywhere near water.",
                "author": "Deplora"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump did it again with White House renovations. This time he renovated the Palm Room in the White House.",
        "score": 530,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How bout we fucking kick out illegals, stop H1Bs, catch pedos, end wars, stop giving out our tax dollars for wars, correct the economy, put Americans over Israelis, and prevent leftist terrorists from killing / attacking / injuring all of us first. You know, as promised.",
                "author": "Pied-Trumper"
            },
            {
                "raw_content": "Is he slowly renovating as much of white house as can to eliminate CIA bugs?",
                "author": "dres3"
            },
            {
                "raw_content": "Imagine the deep cleaning and odor removal they had to do.",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 LMAO! This young patriot skipped school to see JD Vance in North Carolina, and competed with local media to get his question in. KID: \"I skipped school. Can I have a picture with you?\" 😂",
        "score": 1765,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Schools are gay anyway, kids would be much better off not going.",
                "author": "SadFugeeFace"
            },
            {
                "raw_content": "Vance will be such a great President.",
                "author": "Spiritof2015"
            },
            {
                "raw_content": "Wholesome.",
                "author": "NADSAQ"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Intel is seeking an investment from Apple as part of its comeback bid",
        "score": 334,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Intel was tired of burning their own money, instead they want to burn other company's as well",
                "author": "Slasher1738"
            },
            {
                "raw_content": "It increasingly looks like a big drive to get Intel's fab utilization up by any feasible US means, to have a US-based competitor to TSMC. Which makes a lot of sense, as it's the last shot the US has got at having their foot in the door at cutting edge semiconductor fabrication, as I don't think anyone else would be building what Intel already has got from scratch again.",
                "author": "PastaPandaSimon"
            },
            {
                "raw_content": "No paywall: https://archive.is/20250924195120/https://www.bloomberg.com/news/articles/2025-09-24/intel-is-seeking-an-investment-from-apple-as-part-of-its-comeback-bid",
                "author": "-protonsandneutrons-"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "New Snapdragon X2 Elite Extreme and Snapdragon X2 Elite are the Fastest and Most Efficient Processors for Windows PCs",
        "score": 187,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">The platform boasts up to 31% faster performance at ISO power and requires up to 43% less power \\[at ISO performance?\\] than the previous generation Those are some big improvements wow",
                "author": "Just_Maintenance"
            },
            {
                "raw_content": "It means nothing if they can’t get their drivers in order. The amount of problems with the first gen chips in windows were staggering and it wasn’t just gaming issues. Just basic productivity had major stability issues. And even recently too, not just at launch.",
                "author": "sittingmongoose"
            },
            {
                "raw_content": "Among other big upgrades, on-package RAM! https://hothardware.com/news/we-got-to-see-snapdragon-x2-elite-in-action-and-it-looks-impressive",
                "author": "-protonsandneutrons-"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Qualcomm Snapdragon 8 Elite Gen 5 Architecture Deep Dive - Geekerwan (English Subtitles)",
        "score": 38,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Like they said, the results here are from the demo phone made to showcase these chips under ideal conditions, but I imagine the actual retail phones won't be too far off, some small % of perf lost here and there. And that's not enough to change the outcome: it's a really impressive showing! On the GB6 results side they do point out the caveat that most of the gains are from the SME2 support so we should wait for retail devices to get the full picture, but all the other metrics point to an amazing chip so I'm not too concerned. That efficiency is looking amazing!",
                "author": "Ar0ndight"
            },
            {
                "raw_content": "The subtitles are a tad bit scuffed when they talk about the uArch diagrams. Other than that, a small bump in SoC die size from 124mm2 to 126mm2 (1.6%). Added physical 4 independent SME units. Now 6MB $ per GPU slice and there is a HW-level sync between the GPU and NPU (seems interesting). For the GPU bounded games (I assume), It can perform 10% better than last gen (1st game) while consuming \\~20% less (first 2 games). SME2 may have boosted the numbers (\\~5% 1T gap between SD and Apple), though independent workloads from the twitter mill (uploaded GB scores) have pointed to other areas with uplifts that don't use such instruction sets. We'll see in actual retail units/reviews",
                "author": "Noble00_"
            },
            {
                "raw_content": "Perf/mm2 gains seems to be insanely good gen on gen. \\~5% more area for >10% specint2017 ST perf is crazy.",
                "author": "Geddagod"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Qualcomm Oryon v3 vs v1 - 39% higher perf, 43% lower power usage",
        "score": 78,
        "text_content": "[https://www.youtube.com/watch?v=fpHCkdIg9gU](https://www.youtube.com/watch?v=fpHCkdIg9gU) Just Announced on the Snapdragon Summit 20% higher perf vs Oryon v2 with 32% in web browsing 43% lower power is at peak Oryon v1 performance ISO performance EDIT: I'll keep adding details as the summit goes forward According to hothardware, X2 Elite reaches 5Ghz, first ARM CPU 31% faster vs previous generation X2 Elite announced with 18 cores, 12 P + 6 E Flagship PC chip does 39% better ST vs gen 1, +50% MT, 2.3x GPU and +78% NPU ST: +44% perf ISO power vs Intel, Intel needs 144% more power to reach the same perf MT: +75% perf ISO power, Intel needs 222% more power to reach that performance level this is X2 Elite vs Intel Core Ultra 9 285H up to 53% higher browsing perf vs Ryzen 9 HX 370 2x file compression vs Intel Core 9 288V X2 Elite Extreme 64% faster in Blender vs X Elite, 45% in Affinity Photo 2 and 18% in CorelDraw, 28% faster in Photoshop, 43% in lightroom and 47% in Premiere Pro Microsoft says the X2 Elite can run their new phi reasoning models on device that compete with the mini models from OpenAI Faster than 9900X in ST and MT on cinebench R24, faster than every x86 CPU in ST",
        "comments": [
            {
                "raw_content": "Test platform benchmarks for 8 Elite G5 (Android phones) https://hothardware.com/news/qualcomm-snapdragon-8-elite-gen-5-benchmarks No power, just perf. 3793 ST / 12287 nT in GB6 (unclear which version). These devices can score a bit higher than shipping devices, after all the gunk OEMs put on, but should be pretty close.",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": "I guess this really proves that X Elite had some serious technical issues causing high power consumption. This is finally the perf/watt that will make Intel and AMD very nervous as this chip can take a 50% x86->ARM translation penalty and still be good enough. The only thing holding it back (for some people) looks to be GPU drivers.",
                "author": "theQuandary"
            },
            {
                "raw_content": "It looks pretty good, but really underscores how badly they messed up with gen 1, getting blown out by their own phone SoCs and leaving a bad (2nd? 3rd?) impression with the \"this time for real!\" WoA relaunch.",
                "author": "VastTension6022"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Snapdragon 8 Elite Gen 5, the World’s Fastest Mobile System-on-a-chip, Establishes New Consumer Experiences and Sets New Industry Benchmarks",
        "score": 57,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Geekerwan's review of the reference device is out on bilibili.",
                "author": "basedIITian"
            },
            {
                "raw_content": "A Lil bit unrelated but look at this man. Qualcomm mediatek and apple competing with each other to the death just to claim \"the fastest\" and we get to get more and more beastly socs with each passing year. And look at the consumer gpu market. A monopoly owned by Nvidia alone and it's just a money grab without any proper advancement at all. I don't care who has the fastest soc. Competition is always the best for consumer period.",
                "author": "AciVici"
            },
            {
                "raw_content": "What’s it going to take for them to make a 9?",
                "author": "SomeoneBritish"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Snapdragon 8 Elite Gen5 Review: Regular Upgrade - Geekerwan",
        "score": 7,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Quite decent CPU upgrade in spec2017 EDIT: This video explains why the score was different than Xiaobai(S.White) review. It draws >20W on single core in some workloads and it always throttle instantly to 4.2Ghz and lower.",
                "author": "uKnowIsOver"
            },
            {
                "raw_content": "Puts a bit of a damper on the cpu upgrade compared to qualcomms numbers. Great peak performance overall, but it comes at big frequency and subsequent power draw increases that aren’t very sustainable in mobile phone form factor. The GPU is actually slightly behind Mediathek but in front of Apple.",
                "author": "Apophis22"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Snapdragon X2 Elite Product Brief",
        "score": 34,
        "text_content": "3 SKUs 1 with 192 bit LPDDR5X and 5Ghz clocks 1 with 128 bit LPDDR5X and 4.7Ghz 1 with 12 cores, 128bit LPDDR5X and 4.7GHz, perhaps cut down GPU if we use the \"part\" number QC does it again by calling a X2 Plus part as \"X2 Elite\"... According to leaks, a X2 Plus is coming later with 6P+6E, exactly the same as the lower end X2 Elite",
        "comments": [
            {
                "raw_content": "That X2 name is going to be a little bit difficult to search for.",
                "author": "theQuandary"
            },
            {
                "raw_content": "Middle one looks like the sweet spot with the additional cores and cache. The extreme probably uses a lot more power to reach those clocks. We won't know for sure until we have hands on testing though...",
                "author": "OddMoon7"
            },
            {
                "raw_content": "I gave the X1 Elite the benefit of the doubt while most (I'd say, rightfully so) haven't given it a second glance. Quite excited for this launch especially with PTL coming around the corner (though, rumoured highest config seems to be P+E+LPE; 4+8+4, this'll be interesting for nT). While I'm not in the know for WoA (mostly so as no outlet really cared to cover any updates), I do hope they've made decent strides. Stuff I saw interesting: 228gb/s of bandwidth in X2E Extreme (almost double that of AMD's Strix and close to STX-H). X2E Extreme comes minimum with 48GB of ram. AV1 encode/decode",
                "author": "Noble00_"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "OnePlus 15 Performance Hands-On: Decent Gaming Experience [Geekerwan]",
        "score": 4,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Google says more on desktop Android, Qualcomm ‘incredibly excited’",
        "score": 168,
        "text_content": "",
        "comments": [
            {
                "raw_content": "With how they've been treating sideloaded apks I can't wait for them to block installing Firefox wholly. 😂 \"oh you want to access %appdata%? Haha no\" (or whatever android has..)",
                "author": "Specific_Frame8537"
            },
            {
                "raw_content": "Wouldn't it be lovely if instead of an open computing system that lets you install any hardware or software you like, you could have a closed system instead that allows you to only install certified hardware and software? And don't laugh, apple's been doing exactly that ever since it was created and look at them.",
                "author": "redstej"
            },
            {
                "raw_content": "Honestly Android wouldn't be terrible if Google actually treated it as an open source Linux distro instead of a mutilated bastard child.",
                "author": "illathon"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Metroid Prime 4 is reportedly Nintendo’s most expensive game ever with a $100 million budget",
        "score": 2442,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Its been in development since at least 2017 and they had to restart development at one point as well so its not surprising tbh",
                "author": "CSBreak"
            },
            {
                "raw_content": "Seems like they had no money left for marketing.",
                "author": "Cabbage_Vendor"
            },
            {
                "raw_content": "The reboot must have hurt the numbers. It'll have a hard time to break even, as much as I love Metroid, it rarely breaks 2 million copies sold.",
                "author": "DrKrFfXx"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Hades is 2 a Game of The Year Contender",
        "score": 1054,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Dude this year is actually insane.",
                "author": "Affectionate-Emu6609"
            },
            {
                "raw_content": "Why is literally no one mentioning the switchup between \"is\" and \"2\" lmao",
                "author": "Bat_Raptor_3"
            },
            {
                "raw_content": "We knew this Hades 2 Silksong Kcd2 Death stranding 2 Donkey Kong bananza Clair obcur Blue prince Garfield kart 2 Maybe ghost of yotei It just depends on who's making the final cut Because I don't think their gonna chose more than 6 (Feel free to add to the list of possible contenders this year if I forgot some)",
                "author": "zaadiqoJoseph"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "FF7 Remake producer Hamaguchi confirms the game will get a free demo at the end of this year, FF7 Rebirth is already running well on Switch 2 and in the optimization phase, plus Square Enix want to give Switch 2 users enough time to play Rebirth before releasing part 3",
        "score": 19,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">**――I see. A common concern with multiplatform titles is that quality gets sacrificed to accommodate lower-spec hardware. What are your thoughts on that?** >**Hamaguchi** We hear that concern often, but there's absolutely no need to worry. Our development environment is fundamentally centered around high-spec platforms. Our target quality remains unchanged, and our focus is on achieving that same level of quality seamlessly on handheld devices. There's absolutely no need to feel uneasy about the game's quality. Rest assured. >The Switch 2 version of FFVII REBIRTH, which is currently undergoing intensive optimization, is already running at the quality we aim for. The know-how gained from this port will be hugely valuable going forward. >**――So the gaming experience will be similar across all platforms. What about release timing for each system? Will the final installment of the FFVII Remake series be playable around the same time?** >**Hamaguchi** We can't share specifics yet, but we aim to ensure players on the Switch 2 and Xbox Series X|S versions have sufficient time to play FFVII REBIRTH before the third installment releases. We're planning to create a satisfying flow leading up to the final installment for everyone. >**――Finally, could you share a message for those planning to attend Tokyo Game Show 2025 or looking forward to the January 22, 2026 release?** >**Hamaguchi** At Tokyo Game Show 2025, you'll be able to try out FFVII REMAKE INTERGRADE on the Switch 2 in handheld mode and on the ROG Xbox Ally. Playing it will likely surprise you—you'll think, “Is this really the era where games run this well on handheld devices?” In a way, I believe it will let you feel the tide of a new era. >Of course, we understand many won't be able to attend Tokyo Game Show 2025. That's why we're preparing to release a demo for both the Switch 2 and Xbox Series X|S versions around year-end. We've put significant effort into optimization this time, so we hope you'll see it as a model case for HD game ports on the Switch 2 and give it a try. Translated with DeepL.com (free version)",
                "author": "Joseki100"
            },
            {
                "raw_content": "EXCITED!",
                "author": "Dramatic-Limit-1088"
            },
            {
                "raw_content": "I would've bought it if it wasn't gkc but that size..so reasonable",
                "author": "djricekcn"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Professor Layton and the New World of Steam new trailer (the game has been delayed to 2026)",
        "score": 52,
        "text_content": "",
        "comments": [
            {
                "raw_content": "To the surprise of no one.",
                "author": "Vampir3Daddy"
            },
            {
                "raw_content": "It's not a Level-5 game without a delay!",
                "author": "LynxyShinx"
            },
            {
                "raw_content": "So which one will come out first, Decapolice or Layton World of Steam?",
                "author": "reevestussi"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "IGN Hades 2 Review (10/10)",
        "score": 294,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I agree 100%. It improves on and adds to the original in every way. Meanwhile I saw the Polygon review's title and subtitle and just groaned. Such clumsy, obvious rage farming. Their DK review did the same thing.",
                "author": "CalypsoSauvin"
            },
            {
                "raw_content": "I thought ign were terrible reviewers and on the do not trust list",
                "author": "vixgdx"
            },
            {
                "raw_content": "IGN Hollow Knight Review 9.4/10 (Tom Marks) IGN Hollow Knight: Silksong Review 9/10 (Tom Marks) IGN Hades Review 9/10 (Nick Limon) IGN Hades II Review 10/10 (Lena Haefer) I'm sure Hades II is as good or better than Hades. Personally, I think Silksong is as good or better than Hollow Knight and the complaints about difficulty and fetch quests are ridiculous.",
                "author": "MIB18"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "[Preview] Hyrule Warriors: Age of Imprisonment Is Adding A Lot More Depth To Combat",
        "score": 31,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Can't wait. Love HW and AOC.",
                "author": "linkling1039"
            },
            {
                "raw_content": "I hope so because I was not a fan of Dynasty Warriors style games nor could I get into the previous Hyrule Warriors game. But this new one has a story that I don’t want to miss.",
                "author": "GoldenAgeGamer72"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Is Monolithsoft cooking something?",
        "score": 375,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Switch 2 upgrades PLEASE",
                "author": "hal-incandeza"
            },
            {
                "raw_content": "[deleted]",
                "author": "None"
            },
            {
                "raw_content": "The new instalment in Xeno series: Xenogun/s",
                "author": "Brilliant-Copy4258"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Capcom confirm Resident Evil requiem for Switch 2 will be playable at TGS",
        "score": 186,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Very curious to see how it runs! After how good Street Fighter 6 was though, I have a feeling this will be a very solid port.",
                "author": "__breadstick__"
            },
            {
                "raw_content": "it looked fine (compromised obviously, but in acceptable ways for the hardware) in the Direct and is already playable at a trade show, both signs of confidence from Capcom",
                "author": "moneycity_maniac"
            },
            {
                "raw_content": "I'm curious to see how it runs.",
                "author": "jwhudexnls"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "[MEGATHREAD] Tokyo Game Show 2025 | Sept. 25-28",
        "score": 120,
        "text_content": "|| |:-:| |**Tokyo Game Show 2025**| |**Dates:** September 25-28| |**Where to Watch:** [IGN's Youtube](https://www.youtube.com/@IGN/streams) | |**[Schedule](https://www.shacknews.com/article/146046/tgs-2025-schedule-dates-how-to-watch-livestreams?amphtml=1)**",
        "comments": [
            {
                "raw_content": "Please Yoko Taro... I'm begging you for ANYTHING! Drakengard collection... Nier Reincarnation Offline... I'm desperate enough to play a straight port of Drakengard 1 with zero improvements whatsoever.",
                "author": "TheCrypticRealm"
            },
            {
                "raw_content": "The schedule doesn’t really make me believe we’re getting a ton of announcements, if anyone knows when Square might talk about something new please do let me know, their shows look like a lot of talking about games already announced.",
                "author": "Ratchet2332"
            },
            {
                "raw_content": "Not really a fan of remakes but the Fatal Frame 2 remake might at least bring the series into a more mainstream light again.",
                "author": "Your_Favorite_Porn"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Marvel's Wolverine revealed at State of Play, launching Fall 2026",
        "score": 500,
        "text_content": "State of Play Trailer: https://youtu.be/s3pDMUWlA6I?si=J1mxIhENMoRXKPCk Previous rumor: https://www.reddit.com/r/GamingLeaksAndRumours/s/Ol63IvymEO",
        "comments": [
            {
                "raw_content": "Does it releasing in fall 2026 give any leaks more credit, and do those leaks mention what's going on with the supposed Venom game?",
                "author": "Helios_Exousia"
            },
            {
                "raw_content": "the face models and animations are so much better than the last 3 Spider-Man games, it’s kinda wild",
                "author": "piperpiparooo"
            },
            {
                "raw_content": "Those early voice lines from the leaked gameplay did not do Liam McIntyre justice. He sounds considerably better here. I'm also so fucking excited about Omega Red being a boss character I dig the Insomniac take on the classic suit but I wish it had more blue around the sleeves",
                "author": "MyMouthisCancerous"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Spider-Man 2: Enter Electro Deleted Scene",
        "score": 189,
        "text_content": "A deleted scene with Thor from 'Spider-Man 2: Enter Electro' has been found after being lost for 24 years. Source: https://www.instagram.com/reel/DO7ZQ0xEQGo/?igsh=NjZiM2M3MzIxNA== EDIT: For the people who don’t wanna sign in on Instagram, here’s the full video on YouTube: https://youtu.be/XaAME_x4ZnQ?si=YRYqyibyGB1HzJq7",
        "comments": [
            {
                "raw_content": "Man i really wish they'd add these games to ps plus with trophy support. They havent aged well mechanically, but the first game is still my favorite Spidey game of all time",
                "author": "FindTheFlame"
            },
            {
                "raw_content": "I’m already at full health.",
                "author": "HaikusfromBuddha"
            },
            {
                "raw_content": "Legendary day",
                "author": "Quantum_Quokkas"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "OD will be episodic & like a horror anthology series- KNOCK will be Hideo Kojima's subtitle for his part. Other directors like Jordan Peele will have their own subtitle for their own parts",
        "score": 631,
        "text_content": "https://xcancel.com/Genki_JPN/status/1970473426919006577",
        "comments": [
            {
                "raw_content": "Something I find interesting, one of the comments states that Mike Flanagan is going to be apart of the project based on an experience they had with, and it also implied that Sam Lake is somewhat related. That’s not verified, so do with that what you will.",
                "author": "Systemshock1994"
            },
            {
                "raw_content": "So if rumours of Sam Lake being involved is true, it means he gets an episode as well? That's amazing!",
                "author": "Fluffy_Moose_73"
            },
            {
                "raw_content": "If we get several PT-like experiences, I would be completely okay with that.",
                "author": "HydraTower"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Microsoft Flight Simulator 2024 coming to PS5, PSVR",
        "score": 252,
        "text_content": "[https://www.youtube.com/watch?v=S5xeNotR5Hw](https://www.youtube.com/watch?v=S5xeNotR5Hw) Previous rumor: [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1nk4n7e/microsoft\\_flight\\_simulator\\_coming\\_to\\_ps5/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1nk4n7e/microsoft_flight_simulator_coming_to_ps5/)",
        "comments": [
            {
                "raw_content": "I wonder when the hell they’re gonna show that god of war metroidvenia game? I thought it’d be today for sure",
                "author": "Tomrodders"
            },
            {
                "raw_content": "Even PSVR, Microsoft did a good job.",
                "author": "longbrodmann"
            },
            {
                "raw_content": "And with that, the discord leak is complete.",
                "author": "4000kd"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "A CG trailer has leaked of the upcoming Sonic x PUBG Mobile collab; Sonic helps Kaiju No. 9 fight Skibidi Toilet",
        "score": 373,
        "text_content": "Leaked trailer here: https://bsky.app/profile/sonicstadium.org/post/3lzlv3hy5o22u **EDIT: It's actually Kaiju No. 8, apologies!**",
        "comments": [
            {
                "raw_content": "what ![gif](giphy|CpAGyBCgY6qrHIKYTt)",
                "author": "Gabrielhrd"
            },
            {
                "raw_content": "\"Sonic helps Kaiju No. 9 fight Skibidi Toilet\" My God, I had a stroke reading that. What's this timeline bro",
                "author": "Astraliguss"
            },
            {
                "raw_content": "I thought I just woke up from a nap, but nope, clearly still asleep.",
                "author": "darkcomet222"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Dealabs: Alan Wake II is the headliner of October's PS+ Essential lineup",
        "score": 359,
        "text_content": "https://www.dealabs.com/magazine/cette-pepite-fera-partie-des-jeux-du-mois-doctobre-2025-du-playstation-plus-essential-60568 Edit: Also included in next month's lineup: - Goat Simulator 3 - Cocoon",
        "comments": [
            {
                "raw_content": "Damn that's a nice get. Already played and beat it but still a nice game.",
                "author": "method115"
            },
            {
                "raw_content": "for Essential tier that’s crazy",
                "author": "Ill_Student9465"
            },
            {
                "raw_content": "Was just thinking of picking this up but missed the last deluxe sale so excellent timing",
                "author": "Johnhancock1777"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Incomplete list of studios/publishers present at today’s SoP",
        "score": 308,
        "text_content": "- Information shared by SugoiLITE (big anime leaker). Original source is bgette0, founder of OECUF (extremely reliable as well) Studios listed are: - illFonic - Gungho - Code Vein II (Bandai/Shift) - Pearl Abyss - SHUEISHA Games - Xbox Game Studios - EA (Electronic Arts) - ZA/UM Image: https://ibb.co/Gv16YqrV",
        "comments": [
            {
                "raw_content": "Code Vein 2 is my favorite publisher",
                "author": "Ratchet2332"
            },
            {
                "raw_content": "So this \"insider\" has connection to 3rd party publishing. We already know that PS Studios will have updates",
                "author": "NewChemistry5210"
            },
            {
                "raw_content": "EA I think could be the Star Wars tactics game that they revealed months ago and then went silent about. Doubt it’s battlefield when they’ve already announced they’re showing off the single player at TGS on Friday.",
                "author": "Redlodger0426"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Forza Horizon 6 ads are going up on Instagram",
        "score": 24,
        "text_content": "Source: [https://www.reddit.com/r/ForzaHorizon/comments/1nq0dts/forza\\_horizon\\_official\\_instagram\\_confirms\\_horizon/](https://www.reddit.com/r/ForzaHorizon/comments/1nq0dts/forza_horizon_official_instagram_confirms_horizon/) Horizon 6 is set in Japan and coming 2026| Seems like someone fucked up the ad timings",
        "comments": [
            {
                "raw_content": "I know it was basically already confirmed but: Holy shit it’s finally fucking happening. Forza Horizon in Japan. Even by that blurred background in the ad, you just know Playground are gonna cook with the world design and graphics.",
                "author": "NfinityBL"
            },
            {
                "raw_content": "Let’s goooooooo",
                "author": "DirectAdvertising"
            },
            {
                "raw_content": "Looks to be legit. Though given how Xbox is practically dead in japan. I do wonder what the local audience will think of this. I do hope they ditch the dude bro vibe the previous games have and go for something a bit more appropriate.",
                "author": "grilled_pc"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "GEEKOM A9 Max Review",
        "score": 9,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "Housing costs are so high some Americans are delaying milestones like getting married, having kids and even adopting a pet | Fortune",
        "score": 274,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Duh",
                "author": "AwakePlatypus"
            },
            {
                "raw_content": "Not just housing. The cost of everything is too high lmao",
                "author": "Responsible_Knee7632"
            },
            {
                "raw_content": "Just wait until you’re 50 and make 3x’s what you did when you were 25 and still feels impossible to buy. (Unless you have a parent or in-laws that front you 10’s of thousands for down payment)",
                "author": "MasChingonNoHay"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "New home sales soar 20% in August to a three-year high",
        "score": 115,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Well yeah. They're actually cutting their prices. I'm sure existing home sales could soar to a 3-year high too if they just drop their price. Rate buy downs, upgrades, closing costs, lowering the price of the house, etc.. are all the major contributing factors of why new housing is doing so much better than existing homes. Take note existing home sellers.",
                "author": "TX_AG11"
            },
            {
                "raw_content": "New homes are the current comparative value. Never has the spread between new and existing homes been so large. Believe it or not, this is a sign of bubble deflation. Transactions are needed for that to happen.",
                "author": "bigmean3434"
            },
            {
                "raw_content": "KEY POINTS * Sales of newly built homes rose a much larger-than-expected 20.5% in August compared with July, according to the U.S. Census. * That's despite mortgage rates that are higher than they are today. * The median price of a new home sold in August was $413,500, in increase of 1.9% year over year. Sales of newly built homes rose a much larger-than-expected 20.5% in August compared with July to the highest level since January 2022, according to the U.S. Census. It is also the largest one-month gain since August 2022. Sales were 15.4% higher than August 2024. This count is based on people out shopping in August and signing deals, when the average rate on the 30-year fixed mortgage was higher than it is today. That rate started August at 6.63%, according to Mortgage News Daily, and didn't really move much during the month. The sharp decline in rates began in September, when it fell to a three-year low of 6.13% the day before the Federal Reserve cut its lending rate, and then moved higher to where it is now at 6.37%. Given that rates hadn't fallen yet, it's curious that August sales jumped so high. Part of the answer may be in the survey itself. \"We were expecting a gain but not that large,\" said Robert Dietz, chief economist at the National Association of Home Builders. \"Always important to remember the margin of error for new home sales is large. We'll need to wait for revisions next month and the September data point to see if this is smoothed out.\" While builders have talked a lot about cutting prices and incentives, the median price of a new home sold in August was $413,500, in increase of 1.9% year over year. In a separate survey on builder sentiment from the National Association of Home Builders, 39% of builders reported cutting prices in September, up from 37% in August and the highest percentage in the post-Covid period. New home sales were strongest in the Northeast, where overall new construction is low, so swings can be large. It was also strong in the South, where homebuilding is busiest. Sales, while higher, were weakest in the West, where prices are highest. \"While a volatile figure each month and always best to smooth out, I have to believe that the elevated level of home builder incentives was the main catalyst for the large upside surprise to new home sales,\" wrote Peter Boockvar, chief investment officer of One Point BFG Wealth Partner. \"And we'll, of course, see the impact of lower mortgage rates when the September figure comes out, but keep in mind, if mortgage rates continue down ... builders will then reduce the pace at which they are implementing incentives and thus possibly offsetting the benefit of lower mortgage rates for new homes.\" Strong sales took inventory down to a 7.4-month supply in August from a 9-month supply in July, a nearly 18% drop. Single-family housing starts and permits slowed in August both from July and from August of last year. This would seem to indicate that builders expected slower sales.",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage demand stalls after mini refinance boom",
        "score": 109,
        "text_content": "",
        "comments": [
            {
                "raw_content": "When refinance demand is higher than mortgage demand you can tell people are desperate to get out from under a mortgage they can't afford. Especially being such a small drop.",
                "author": "probably-theasshole"
            },
            {
                "raw_content": "Refinancing when the 10 year hit 4.0% was just smart. Anyone expect long duration yields to go lower than that?",
                "author": "ThisKarmaLimitSucks"
            },
            {
                "raw_content": "KEY POINTS * Total application volume rose 0.6% last week from the previous week, according to the Mortgage Bankers Association’s seasonally adjusted index. * Refinance demand, which had surged to the highest level since, rose just 1% for the week but was 42% higher than the same week one year ago. * Mortgage applications to purchase a home were essentially flat, up just 0.3 % for the week and up 18% from the same week one year ago. After a massive 58% weekly surge in refinance demand the week before, mortgage demand stalled again last week, even though interest rates fell further. Total application volume rose 0.6% last week from the previous week, according to the Mortgage Bankers Association’s seasonally adjusted index. The average contract interest rate for 30-year fixed-rate mortgages with conforming loan balances, $806,500 or less, decreased to 6.34% from 6.39%, with points increasing to 0.57 from 0.54, including the origination fee, for loans with a 20% down payment. That is the lowest level since September 2024. That, however, is a weekly average, and last week was particularly volatile. Early in the week, before the Federal Reserve cut its rate, mortgage rates, which follow loosely the yield on the 10-year Treasury, fell to the lowest level in three years. In the days after the Fed cut, however, rates rose about a quarter of a percentage point. Refinance demand, which had spiked dramatically higher the week before, climbed just 1% for the week but was 42% higher than the same week one year ago. “Interest rates generally have moved up following the [Federal Open Market Committee] meeting last week but remain in a range that should continue to lead to increased refinance activity. Refinance volume increased further last week and is now 80 percent higher than four weeks ago, accounting for more than 60 percent of all application activity,” said Mike Fratantoni, senior vice president and chief economist at the MBA, in a release. “The refinance boost last week was from government applications, with VA refinance volume up almost 15 percent.” Mortgage applications to purchase a home were essentially flat, up just 0.3% for the week and up 18% from the same week one year ago. “While homebuyer demand typically tends to decrease during the fall, purchase application activity remains relatively strong right now,” Fratantoni added. After a huge surge in demand for adjustable-rate mortgages, demand for those riskier loans fell back last week. Borrowers had been looking for any type of savings on the monthly payment, and ARM rates are much lower than fixed-rate loans. Mortgage rates barely budged to start this week, according to a separate survey from Mortgage News Daily, as there were no major economic reports to influence the bond market. There were some speeches from Federal Reserve governors as well as Chair Jerome Powell, but none diverged from previous policy statements. “Fed speeches can certainly have an impact, but it depends on the specifics. [Tuesday’s] most important comments came from Fed Chair Powell, but they didn’t represent any major departure from his press conference following last week’s Fed announcement,” wrote Matthew Graham, chief operating officer at Mortgage News Daily. “Still, some traders were relieved that he didn’t use the opportunity to reiterate several of last week’s topics that pushed rates higher.”",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "A Small Family Journey to Finding Their First Home in Noida",
        "score": 1,
        "text_content": "[A Small Family Journey to Finding Their First Home in Noida](https://preview.redd.it/w9td9t24j9rf1.png?width=1536&format=png&auto=webp&s=7790028e511f9e16b9df5b7ba1ed6c8707302791) # Intro For years, living in Delhi meant constant stress for a young couple with their little daughter and grandparents. The rising rents in popular localities kept eating into their monthly budget, leaving little room for savings. Every year, they found themselves negotiating with landlords, packing boxes, and worrying about shifting again. That’s when the thought of owning a home became stronger. After exploring different options across Delhi NCR, they discovered Noida Extension, a location that promised modern housing within a realistic budget. The couple was drawn to the idea of [**3 bhk flats in Noida**](https://miglani.org/what-we-do/) —spacious enough for their small family’s daily needs while also accommodating visiting parents and grandparents comfortably. **1. Rising Rents in Delhi – The Breaking Point** For years, living in Delhi meant constant stress for a young couple with their little daughter. * Yearly rent hikes made it impossible to plan savings. * Brokerage, high maintenance charges, and frequent shifting added more financial pressure. 👉 These rising expenses kept eating into their savings. The family realized that despite paying lakhs every year in rent, they were building no long-term asset. Example: A close friend in Dwarka had been renting for 6 years. By the time she looked back, she had already spent enough money to cover the down payment of her own flat. That was the turning point for this couple too. **2. Why They Chose Noida Extension** After exploring options across Delhi NCR, they discovered Noida Extension as a smarter alternative. * Connectivity: Metro access, highways, and the upcoming airport link ensure smooth travel. * Lifestyle benefits: Schools, shopping complexes, and reputed hospitals are close by. * Modern living: Gated communities with amenities like green parks, gyms, clubhouses, and even co-working spaces for work-from-home parents. 👉 Compared to Delhi, where the same budget would only fetch an old flat in a crowded locality, Noida Extension offered a modern home in a well-planned township. **3. Life After Moving – More Than Four Walls** The decision wasn’t just financial—it transformed their daily lives. What started as a search for a compact home soon turned into a bigger dream. The couple realized a home wasn’t only for the three of them—it also had to welcome parents, grandparents, and relatives. That’s when they decided to explore 3 bhk flats in Noida. * A separate room for their little daughter to grow, play, and study. * A guest room where grandparents could stay comfortably during visits. * Extra space for work-from-home setups, festive gatherings, and family bonding. Living in a 3 BHK gave them not just stability, but the joy of creating a place where three generations could live, celebrate, and build memories together. **4. The Bigger Picture – A Trend Among Families** This story isn’t unique. Market insights show: * Most first-time buyers in Noida Extension are now choosing 3 bhk flats in Noida to future-proof their investment. * Families prefer extra rooms not just for kids, but also to accommodate parents and grandparents. * IT professionals and entrepreneurs value smart amenities like EV charging points, co-working lounges, and wellness centers. 👉 The demand for 3 BHK homes reflects a shift—buyers are no longer just looking for affordability but also for comfort, convenience, and modern lifestyle upgrades. **5. Real Stories, Real Inspiration** Many similar case studies can be found on [**Miglani**](https://miglani.org/), where buyers share journeys of shifting from rented spaces to their first permanent home in Noida Extension. **Conclusion** For young families, the choice between renting in Delhi and owning in Noida Extension is more than just a financial calculation—it’s about stability, security, and quality of life. Rising rents in Delhi continue to drain savings without building long-term value. In contrast, Noida Extension offers an affordable entry point into homeownership, modern infrastructure, and a family-friendly environment. This small family’s story reflects a growing trend: today’s renters are becoming tomorrow’s homeowners, investing in 3 bhk flats in Noida that not only provide shelter but also create space for parents, grandparents, and children to live happily together—building memories, celebrating milestones, and shaping a secure future.",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Skild AI showcases an omni-bodied robot brain",
        "score": 1251,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Pretty good strategy: \\--> Train an AI on 100.000 different variations of random robots \\--> Let it figure out general rules \\--> Then stuff it into a random robot Genius!",
                "author": "elemental-mind"
            },
            {
                "raw_content": "Poor doggo",
                "author": "The_Scout1255"
            },
            {
                "raw_content": "Remember that scene in Terminator where it's blown to bits but still moving, just with its upper torso crawling towards the main character? It probably had software like this.",
                "author": "MonoMcFlury"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "GPT-5 may represent the beginning of progress toward models capable of passing the Gödel Test",
        "score": 283,
        "text_content": "",
        "comments": [
            {
                "raw_content": "From gaslighting AI that 1+1=4 to them solving Open maths conjectures 3/5 times in just ≈2 years. We have come a long way!",
                "author": "Independent-Ruin-376"
            },
            {
                "raw_content": "Paper: [Gödel Test: Can Large Language Models Solve Easy Conjectures?](https://arxiv.org/abs/2509.18383)",
                "author": "Outside-Iron-8242"
            },
            {
                "raw_content": "I wish we went back to the gpt-4 times where there was like 5 different models, o1-pro, o3-high, o4-mini, because nowadays people are talking about gpt5 but never specify if it's reasoning model and what reasoning effort it is, or if it's even gpt5-pro.",
                "author": "Ormusn2o"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Introducing OK Computer — Kimi’s agent mode",
        "score": 35,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I liked the graphics on this ad a lot",
                "author": "sunilmaj43"
            },
            {
                "raw_content": "Those commercials used to be for products that actually WORK. But with AI nothing actually \\*really\\* works. So sadly now I look at this ad and think: amazing, but probably fails in production. I might be even wrong, but I have been trained to think that.",
                "author": "Altruistic-Skill8667"
            },
            {
                "raw_content": "3 free uses per user is not bad at all, I think thats market leading actually?",
                "author": "The_Scout1255"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Mr Altman, probably",
        "score": 619,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The singularity will take gigawatts or even terrawatts to bring about. Send more money.",
                "author": "Ok_Elderberry_6727"
            },
            {
                "raw_content": "Both of these subs are a joke",
                "author": "Atomic-Avocado"
            },
            {
                "raw_content": "More importantly he wants a 5th home",
                "author": "This_Wolverine4691"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "250 gigawatts of compute by 2033",
        "score": 15,
        "text_content": "[https://sources.news/p/openai-ads-leader-sam-altman-memo-stargate](https://sources.news/p/openai-ads-leader-sam-altman-memo-stargate)",
        "comments": [
            {
                "raw_content": "Hah now I have to deal with ads along with hallucinations? Unsubscribe. Good thing we got so many LLMs to choose from, especially the open source ones that can run locally.",
                "author": "lolwut778"
            },
            {
                "raw_content": "Not needed answer is 42",
                "author": "Significantik"
            },
            {
                "raw_content": "https://i.redd.it/ejqn0479b9rf1.gif",
                "author": "error00000011"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Huntington's disease successfully treated for first time | BBC News",
        "score": 356,
        "text_content": "",
        "comments": [
            {
                "raw_content": "13 is saved!!! (But seriously this is good news)",
                "author": "zero0n3"
            },
            {
                "raw_content": "That's awesome",
                "author": "live_love_laugh"
            },
            {
                "raw_content": "Isn't Science amazing? Huntington’s disease is so aggressive, but now there is hope.",
                "author": "Pleasant_Ball3192"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Alpha Models just appeared in my ChatGPT — what's this?",
        "score": 157,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm guessing agent with truncation would be chatgpt agent but it deletes part of its history as it goes on to decrease cost and increase speed",
                "author": "ThunderBeanage"
            },
            {
                "raw_content": "https://preview.redd.it/sbrpuwer95rf1.png?width=220&format=png&auto=webp&s=0a17dea52f642ac673618947f93ad7594d25e3d7 I've used it and it seems like the normal chatgpt agent.",
                "author": "GMSP4"
            },
            {
                "raw_content": "https://preview.redd.it/8iaz522pa5rf1.png?width=926&format=png&auto=webp&s=ab25cca89c656c5d7056fb5e8e72837e64873a86 I also have \"Agent with Prompt Expansion\". Anyone have prompts they want tested?",
                "author": "ethotopia"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Greg Brockman said we are 3 orders of magnitude (in terms of compute power) away from where we need to be.",
        "score": 70,
        "text_content": "What can we not achieve if we don’t have this level of compute ? And what’s the height of what we can achieve with what’s available today? That’s billions of GPUs, and just thinking about the cost of building the infrastructure, the energy cost, the production cost, etc. this seems to be hilariously lofty goal. If they’re saying we can achieve AGI with only hundreds of thousands then why this billions goal?",
        "comments": [
            {
                "raw_content": "He said something like you really want every person to have their own dedicated GPU so that’s why he said 10 billion People here keep conflating compute for training and compute for serving people, and not realizing they are two different things. A lot of compute will be used for both, but here he was specifically talking about serving a dedicated GPU to each person in the world.",
                "author": "socoolandawesome"
            },
            {
                "raw_content": "He isn't saying thats what needed to get to AGI, he’s saying if billions of people are going to be able to use AI agents all day like people currently use the internet they will need an H100 equivalent for every person on earth.",
                "author": "stonesst"
            },
            {
                "raw_content": "They can get 2 orders of magnitude with the money they have been promised. Hence the 3 orders of magnitude.",
                "author": "Advanced_Poet_7816"
            }
        ],
        "subreddit": "singularity"
    }
]