[
    {
        "post_name": "Epstein running a blackmail operation for",
        "score": 414,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Every single time private communications are leaked between obscenely rich and powerful people, they always write like an illiterate retard. Why is that?",
                "author": "Zskills"
            },
            {
                "raw_content": "Here you go, I can't read Ant language. 👓🐜 https://x.com/Skawtish/status/2017448631368896929?s=20",
                "author": "MythArcana"
            },
            {
                "raw_content": "Israel. But that hasn't been released yet. 🤓",
                "author": "drmrboy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "People who have left California are receiving letters telling them that they still need to pay California state taxes. They want them to PROVE the day they left.",
        "score": 423,
        "text_content": "",
        "comments": [
            {
                "raw_content": "However CA will send a pre-filled out ballot for the next 5 elections.",
                "author": "racer513"
            },
            {
                "raw_content": "Can't they just ignore them",
                "author": "RedditIs4Retards"
            },
            {
                "raw_content": "Dear Commies, Get fucked and finger your own butt's, you filthy fags. With no regards whatsoever, Anon",
                "author": "PinochetsGhost"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The US government has once again shut down.",
        "score": 328,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Don't care. Fuck the feds. Fuck the anti-US faggots. If they open this shit up, it's only to steal more of my money,",
                "author": "EDDIT_IS_CUCKED"
            },
            {
                "raw_content": "Just for one day. The House will pass the spending bill/CR on Monday.",
                "author": "fskfsk"
            },
            {
                "raw_content": "And nothing of value was lost",
                "author": "catsfive"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Here is an FBI document showing that Schiff was promised head of the CIA job by Hillary. As revenge, Schiff worked to “take out” President Trump",
        "score": 1155,
        "text_content": "",
        "comments": [
            {
                "raw_content": "At some point.... someone needs to be arrested for this shit. Pam ?",
                "author": "24601"
            },
            {
                "raw_content": "Three big things here: 1) Schiff, whose son walked around with a MOSSAD t-shirt on thought he was going to be the head of the CIA. I have a huge problem with that. 2) Schiff asked basically the House Committee members, staffers and government employees in the bureaucracy to send information his way. 3) He knew he didn't have a case, so he was going to make all information public by using the media, TheNews™, of course, in order to generate public opinion that would drive a 9/11 style commission. Remind me again if I should notice or not?",
                "author": "Smurfection"
            },
            {
                "raw_content": "I’m sick and tired of regular Americans barely scraping by and getting in more trouble from ignoring a parking ticket, than scumbag politicians and their ilk looting the treasury, raping children, committing treason, and walking away scott free.",
                "author": "Trump454748"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Trump administration is eyeing Ohio for immigration enforcement operations that could begin as early as next week",
        "score": 1207,
        "text_content": "",
        "comments": [
            {
                "raw_content": "THEY’RE EATING THE DOGS",
                "author": "asdrubael_was_right"
            },
            {
                "raw_content": "They need to go to Indiana too, lots of shit going down in Columbus though. The whole region is like \"Illegal Alien Alley\" according to my trucker buddies..",
                "author": "TexasRusty"
            },
            {
                "raw_content": "Deport Ramaswamy",
                "author": "ragnarokrobo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "LAPD just CHARGED at anti-ICE rioters and unleashed less lethal munitions on the crowd — they were instantly shoved back after laying siege on the federal building",
        "score": 801,
        "text_content": "",
        "comments": [
            {
                "raw_content": "that’s not CHARGING",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Make riot batons great again.",
                "author": "boreal_storm"
            },
            {
                "raw_content": "LA rioters look like pussies compared to Minnesota",
                "author": "Colorado-Living"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Marina Medvin 🇺🇸 Radical leftists stormed a synagogue yesterday and disrupted religious services, then boasted about it online, asking for donations.",
        "score": 854,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Uh oh, Pam Dindu Nuffinstein is going to need more than an angry letter for this one",
                "author": "Whoopies_tds"
            },
            {
                "raw_content": "Oh! Well, them's Jewish folk there. That's a hate crime!",
                "author": "Araket"
            },
            {
                "raw_content": "Jets scrambling rn",
                "author": "lefty295"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "DHS: Want affordable housing? Help report illegal aliens in your area.",
        "score": 1500,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Gee, who would have thought that lower demand would result in a price drop. It's almost like it's just basic economics.",
                "author": "4thWay"
            },
            {
                "raw_content": "This benefits Americans? Democrats seething with anger",
                "author": "Atlis34"
            },
            {
                "raw_content": "DHS can start at Walmart.",
                "author": "1dog2kids1cat"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump: For many years, the Bureau of Labor Statistics, under WEAK and STUPID people, has been FAILING American Businesses, Policymakers, and Families by releasing VERY inaccurate numbers.I FIRED the former Commissioner, and am pleased to nominate Brett Matsumoto as the next Commissioner of the BLS.",
        "score": 1027,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fricking finally. Anyone else looked at the free data from Shadow Stats? CPI and just about everything else are as cooked as they can be. They change definitions as often as they change the definition of \"vaccine\" to deceive us. I hope this guy ends up being the RFK of the BLS...",
                "author": "NewHampshireRepublic"
            },
            {
                "raw_content": "https://truthsocial.com/@realDonaldTrump/posts/115986962139100209",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "Excellent. reminds me of the manager of the territory of Hong Kong for the British several decades ago...he just made sure policies were good, and didn't micromanage the statistics on economics. HK became one of wealthiest cities in the Commonwealth.",
                "author": "The_Emperor"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "If Bill Gates is willing to secretly drug his own wife imagine what he’s willing to do to us.",
        "score": 1444,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He's one of those people who would burn down the world to rule over the ashes.",
                "author": "skuts"
            },
            {
                "raw_content": "Gee I wonder why she divorced him! Dude has a creepy wannabe doctor fetish",
                "author": "South_Florida_Guy"
            },
            {
                "raw_content": "Bill Gates is a creep, but both of those emails read as if Jeff is spitballing threats to hold over Bill's head Like he's just coming up with whatever sounds plausible that he could later use as leverage against Bill, true or not",
                "author": "Retard_Strength"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The people you elect to 'represent you' do not have your best interest in mind",
        "score": 625,
        "text_content": "",
        "comments": [
            {
                "raw_content": "2026 and they’re still passing Democrats spending bills.",
                "author": "Aggrieved03"
            },
            {
                "raw_content": "Government runs a plantation and the citizens are the slaves.",
                "author": "BlackPilledMAGA"
            },
            {
                "raw_content": "But they love to insider trade",
                "author": "BillGateCanSuckIt"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Tim Walz just THREATENED Tom Homan that Minnesota could have a “Fort Sumter/John Brown moment” if he doesn’t reduce ICE presence.",
        "score": 1311,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Walz is willing to spill as much blood of his own commie allies as he needs to to avoid prosecution for the Somali fraud.",
                "author": "UncleSlayton"
            },
            {
                "raw_content": "Bring it retard",
                "author": "South_Florida_Guy"
            },
            {
                "raw_content": "Cross the rubicon. It’s going to happen sooner or later anyway.",
                "author": "MAGA9428"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The UN has issued a letter to its 193 member states warning that they face 'imminent financial COLLAPSE' after Donald Trump cut US funding",
        "score": 1704,
        "text_content": "",
        "comments": [
            {
                "raw_content": "good and fuck off UN",
                "author": "etcetera"
            },
            {
                "raw_content": "I voted for this",
                "author": "latetotheparty"
            },
            {
                "raw_content": "The UN gets billions of dollars from the United States while badmouthing Americans then cries when America doesn't send them any more money.",
                "author": "Oldman1234"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "DAVIS: Pam Bondi is being bold and fearless here. In prior Republican admins, there’s no chance in hell that a Republican white male attorney general would charge Don Lemon with a Klan Act violation bc prior Republican white male AGs are pussies and Pam Bondi is not.",
        "score": 813,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is that supposed to change her image and forget about the 1000 White People that she should have charged by now? Am I to believe Lemon and all of this is not a setup? I wish they would stop making the mistake of thing all of us are Stupid. This should just be a regular day for Pam. This should be no big deal. Once again they go for Pawns. Never the Rook, the Bishop, A King. Nope. Always getting after the Pawns. I see it.",
                "author": "ReCaptchad"
            },
            {
                "raw_content": "I need to see her cooter to be sure",
                "author": "BIGBAG01"
            },
            {
                "raw_content": "So after almost a full year, she FINALLY did the right thing and we’re supposed to pat her on the back?",
                "author": "Trump454748"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Oof!",
        "score": 1268,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Storming a church to protest is not “free speech”, retards.",
                "author": "Genericwhitemale"
            },
            {
                "raw_content": "Always shoot themselves in the foot with precedent.",
                "author": "utfanx2"
            },
            {
                "raw_content": "> Oof! Indeed. It's (D)ifferent when we do it.™",
                "author": "kek-is-tan"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Church rioter Nekima Levy Armstrong: \"We had handcuffs on. As an African American Studies expert, it was the closest I was to sIavery!\"",
        "score": 1091,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Typical Saturday night in Chicago for your kind",
                "author": "hughjasske69"
            },
            {
                "raw_content": "I had boots on. As a retired, redneck asshole, it was the closest I got to the moon.",
                "author": "skuts"
            },
            {
                "raw_content": "As a J6er who spent years locked down for non-violent charges, go fuck yourself.",
                "author": "KneadThePeople"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Reddit starting to notice. Yeah, the hackers of StopICE weren't kidding.",
        "score": 1540,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You FAFO, pRedditors.",
                "author": "nukiebear"
            },
            {
                "raw_content": "Imagine being against the deportation of child rapists, murderers and drug dealers all who are here illegally. Leftists are a cancer and destructive force to humanity in general and need to be treated as such.",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "I hope they're hunted down with at least half the enthusiasm the j6'ers were.",
                "author": "A_Colostomy_Bag"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "sure don't",
        "score": 233,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# GAY # AS # FUCK How are we supposed to mobilize when these cock gobbler memes are being spammed by the PDW \"masters\" volunteering a million USD per month of their own time and money amongst the three of them for such a site?",
                "author": "USMC1234O10"
            },
            {
                "raw_content": "I figured out why the protesters are growing. SNAP benefit programs have a new 20 hour work or volunteer requirements on Sunday, Feb1st. Minnesota allows for volunteer to include ACTIVISM, some are PAID $ and others VOLUNTEER. This is a big fuck you to President Trump. Their protest riot time counts as volunteer hours to meet the requirements of 20 hours this week, next week, and every week. They log their hours of volunteer or work through NGO and can report that to fulfill the requirements to collect their SNAP, MEDICAID, Housing, Example: Lefty receives $850 in SNAP a month. Needs to work or volunteer 20 hours a week. Goes to a riot protests, video tapes self at the protest, takes pics holding sign, posts on social media sends that to NGO as proof, gets logged for 6 hours when he was there for 2 hours (that is an estimate of the made up volunteer hours, whatever). They can also get paid up to 20 hours to riot protest. The crowds grow bigger as more benefit users realize they can volunteer to meet the requirements. We are getting ripped off...ICE is getting shamed...they are getting their work requirements fulfilled for their SNAP requirements...they figured out how to get one over on Trump's volunteer 20 hour requirements by protesting Trump's ICE Deportations. Let me know if I explained it clearly. The left are using Trump's policy, work/volunteer requirements & taking advantage of MAGA again through another scheme to cause chaos in the streets, violence, all while getting benefits fulfilled at the same time. The protests will be endless because this is what the left is choosing to do for \"work/volunteer\". There's no end in sight if this is allowed to continue.",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "Never throw your books away. They want to publish what enters your mind. Restore the Smith-Mundt Act. Commies are not human.",
                "author": "KennyKetchem"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "0Hour1: We have found a way to see deleted messages on SIGNAL. Stay tuned! 😂😂😂😂",
        "score": 1238,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I bet this is not new, and this is even more frustrating that the FBI has not made more arrests related to the Charlie Kirk assassination",
                "author": "Winter_Is_Coming2020"
            },
            {
                "raw_content": "\"STAY TUNED!\" Fucking release the goddamn information. This isn't the 50s where shit could just sit.",
                "author": "cjcivicx"
            },
            {
                "raw_content": "Um... the cli version of the app shows all the data in plain text. It's vibe coding gone wrong not skilled hacking",
                "author": "Colorado-Living"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ICYMI: Monica Cannon-Grant — former Bostonian of the Year — was sentenced on public corruption charges for using her nonprofit as a personal bank account, stealing $66K+ in COVID relief, and fraudulently obtaining housing & unemployment benefits.",
        "score": 1093,
        "text_content": "",
        "comments": [
            {
                "raw_content": "how AWFUL",
                "author": "Colorado-Living"
            },
            {
                "raw_content": "$66k? Chump Change compared to Ilhan Omar.",
                "author": "Rock9Head"
            },
            {
                "raw_content": "As someone living in the area it was a LOT more than 66k. I think that was the total for one of the instances. All the donations, the building that was gifted to the non profit, the vacations and shopping sprees, the cars and house she lives in. Unemployment fraud, food stamps. Up until she took the plea, she was claiming racism and this was all being done because Trump & she’s black. Also claiming her fraud co conspirator husband was “murdered” when he died on a motorcycle purchased with stolen funds. She had a website fightformonica.com She got nothing. 6 months home confinement basically and was still going on and on about all “the good I did and this isn’t representative of who I am”",
                "author": "Quiznos585"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The TV industry finally concedes that the future may not be in 8K",
        "score": 372,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A good 4k TV costs below 500€. Even 4k OLEDs can be bought for less than 1000€. If 8k TVs do not drop to that kind of pricing at least for the entry models then there's no way a mainstream consumer will ever consider going for 8k.",
                "author": "Renricom"
            },
            {
                "raw_content": "Brah most Streaming services stream at such a low quality *4k*, that it might as well be 1080p. We don't need 8k yet.",
                "author": "KangarooBeard"
            },
            {
                "raw_content": "I can’t even watch most sports in anything close to 4k. Many of my favourite games are sub 4k. We’re nowhere near ready for 8k talk. Decades away",
                "author": "NeighborhoodPlane794"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nvidia's plan to invest up to $100 billion in OpenAI has stalled, WSJ reports",
        "score": 145,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is because of the AWS deal OAI just signed. That will see OAI moving a good amount of compute to Amazon Trainium2 chips. Nvidia doesnt like that. Its not, as many people are going to jump to, a canary in the coal mine, its not because nvidia wants to distance itself from OAI...its quite the opposite...because NVDA wants OAI all to themselves.",
                "author": "-Crash_Override-"
            },
            {
                "raw_content": "Because Nvidia isn't simply about selling the shovels for the AI gold rush. It is part of the network that assembles the shovel - use that famous Milton Friedman pencil analogy for all the players involved. Except with a pencil you know beforehand what it will be used for. Not the case with AI.",
                "author": "TwoTimeHollySurvivor"
            },
            {
                "raw_content": "openAI is deadass bankrupt.",
                "author": "EmilMR"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Ars Technica: \"Inside Nvidia's 10-year effort to make the Shield TV the most updated Android device ever\"",
        "score": 160,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Now if only they could update the hardware too, but I suppose chip manufacturing right now has a different priority.",
                "author": "zxyzyxz"
            },
            {
                "raw_content": "Releasing a lot of updates doesn't necessarily mean those updates actually work. I had a 2019 for a while, but eventually had to move to an AppleTV because at one point nVidia pushed out an update that made the Shield constantly crash and never fixed the problem. According to other people on the forums, it wasn't an isolated issue.",
                "author": "DeliciousPangolin"
            },
            {
                "raw_content": "Whatever happened to that new Android version update? Seems that was talked about years ago... We've been on Android 11 for quite a while now. It's getting to be a bit of a shock going back & forth between the Shield and the various Chromecast I have installed.",
                "author": "RxBrad"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel Panther Lake continues snapping up victories as the Forza Horizon 6 system requirements list the integrated Arc B390 GPU",
        "score": 96,
        "text_content": "",
        "comments": [
            {
                "raw_content": "it's very cool how optimized that game will be i think, especially for 2026 with all the components shortages",
                "author": "AviationGeekTom_330"
            },
            {
                "raw_content": "Every gaming dev should target the B390 as the 1080p 60fps on medium/low tbh",
                "author": "DerpSenpai"
            },
            {
                "raw_content": "It seems odd that the Arc B390 was listed as the minimum required IGPU when the much weaker discrete Arc A380 is also on there. I'm sure most of the last generation IGPUs like the Radeon 880M or 890M are also powerful enough (considering they are faster than the Arc A380). We've always known that the Forza Horizon games are very well optimized and are able to run on IGPUs just fine. Keep in mind that Forza Horizon 5 runs just fine on the Vega 3 IGPU in the 7 year old AMD Athlon 3000G. The article is presenting the trivial fact that the B390 is listed as the minimum spec for the upcoming Forza Horizon 6 as somehow being a huge win for Intel. That's not very good journalism. It was going to run on IGPUs regardless of whether or not the B390 existed.",
                "author": "vk6_"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "LinusTechTips - Why It Took Me 4 Years to Make a USB Cable",
        "score": 83,
        "text_content": "",
        "comments": [
            {
                "raw_content": "On-topic discussion please. This is not the right subreddit to discuss creator drama.",
                "author": "MasterHWilson"
            },
            {
                "raw_content": "any indication on how these stack up to high quality cables from Anker, CableMatters, or Apple?",
                "author": "mostlikelynotarobot"
            },
            {
                "raw_content": "price wasnt as insane as I was expecting tbh",
                "author": "bhop_monsterjam"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[News] Apple May Prioritize High-End iPhones in 2H26 as Memory Costs Rise; Flags TSMC 3nm Tightness",
        "score": 16,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Makes sense. Every AI chip is being made on N3 now, including the upcoming Rubin GPU.",
                "author": "Wonderful-Sail-1126"
            },
            {
                "raw_content": "can someone start producing 1T Dram without capacitors on regular CMOS fabrication?",
                "author": "Quatro_Leches"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "DDR5-4800 vs. DDR5-6000 Performance on Ubuntu With The AMD Ryzen 7 9850X3D In 300+ Benchmarks",
        "score": 167,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Interesting, I was incidentally telling my brother, whose rig I just built using DDR5-4800 spares to avoid the current RAMageddon, that in gaming they performed just the same. These tests confirm that it's just about the extra 0.X%, I don't remember it being this clear-cut for previous generations.",
                "author": "GalvenMin"
            },
            {
                "raw_content": "The ram cost more than the high end CPU",
                "author": "HopelessPilot39"
            },
            {
                "raw_content": "Love how they used all the irrelevant presets on Cyberpunk except the bandwidth intensive ones 🤣",
                "author": "No_Guarantee7841"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "A glimpse at computing’s quantum-centric future",
        "score": 3,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung’s profit triples, beating estimates as AI chip demand fuels memory shortage",
        "score": 76,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Something something shovel maker makes profit during a gold rush.",
                "author": "Blueberryburntpie"
            },
            {
                "raw_content": "To be fair, Samsung's memory division was barely breaking even last few years.",
                "author": "tooltalk01"
            },
            {
                "raw_content": "Here's the problem: They have to continually beat this now, or their stock tanks.",
                "author": "TheJohnnyFlash"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AdHoc statement after Nintendo's addressed the situation",
        "score": 636,
        "text_content": "From their Discord server: EDITED in the statement sry bout that Adhoc’s statement on Switch censorship emoji:Phenomaman: News **Okay let’s talk Switch release.** We've been quiet for the last few days not because we don't want to address this stuff, but because we've been trying to make sure we're being good partners with Nintendo. They’ve made their own statement regarding this issue: “*Nintendo requires all games on its platforms to receive ratings from independent organizations and to meet our established content and platform guidelines. While we inform partners when their titles don’t meet our guidelines, Nintendo does not make changes to partner content. We also do not discuss specific content or the criteria used in making these determinations.*” As Nintendo states, any game that’s going to be on the Nintendo platform needs to ‘*meet \\[Nintendo’s\\] established content and platform guidelines.*’ This is the key point. Nintendo has content guidelines. Our game didn’t meet those guidelines, so we made changes that would allow us to release on their platform. That’s what happened here. Honestly we thought this would be obvious since we’re the devs that released the fully uncensored version of the game on other platforms. We initially assumed, like some of you, that because games like Witcher 3 and Cyberpunk are on the platform with similar types of uncensored mature content, Dispatch would be allowed to do the same. During the porting process it became clear that was not the case. So we asked that we include a disclaimer on the store page to inform customers that content would be different than on other platforms. We worked with Nintendo to get storefront language approved. Where we absolutely need to take full ownership is the placement of that disclaimer. Again, it was our intent to go out of our way to tell people looking to buy the game that the content was censored. While we didn't have complete control of the language, we did have control of the placement. Wires got crossed and we put the disclaimer in the field literally titled \"Disclaimer\", instead of the \"About The Game\" section. We didn't catch this until after the launch when we saw people saying we should have called out the changes on the store page, and we went to go make sure it was there. It technically has been the entire time, just in the absolute worst spot that makes it look like we were trying to hide it. This is 100% our mistake and it was fixed in the Americas store pages a few hours after launch to give more visibility. We’ve also added a disclaimer before purchase. As of writing this, the other regions have either published this change or are in the process of review. **So what now?** We’re already working with Nintendo on a path forward. While we can’t make any specific promises just yet, we’re confident we’ll be able to push an update to address at least some of the censored content. I'll get ahead of it now and say that between dev time and the console submission process, we're talking weeks not days. To our fans who were looking forward to playing the uncensored version on Switch, we’re truly sorry. People have a right to be pissed. Lots of lessons learned here. Thanks for sticking with us. More soon.",
        "comments": [
            {
                "raw_content": "Okay so Cyberpunk has customizable genitals and every other game on the eShop has the word \"Hentai\" in the title, I'm gonna need some specifics here",
                "author": "WyntonPlus"
            },
            {
                "raw_content": "Worth noting that the entirely of the disclaimer was the following: > Some content from Dispatch’s original version has been modified. https://web.archive.org/web/20260105190508/https://www.nintendo.com/us/store/products/dispatch-nintendo-switch-2-edition-switch-2/",
                "author": "MusicGusto"
            },
            {
                "raw_content": "They still don't mention what the issue is with the content. As to why witcher 3 and cyberpunk don't fit that. What made it apparent to them? Edit: it also ignores the fact that they could've made an official statement before asking Nintendo for a disclaimer. Or, worst case scenario, in conjunction with the disclaimer. Not wait until after release to make a statement.",
                "author": "Dangerous_Teaching62"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Finally guys!",
        "score": 136,
        "text_content": "After a lot of hours working hard and saving money, I bought my first console in my life (I am 24 years old) I had PC for gaming but I’m really proud of get my first console. I got the console with Mario Kart World and I’m very happy about that, now I’d like to know what’s the best story game to spend the money and time and give me some suggestions to get the most out of the console!",
        "comments": [
            {
                "raw_content": "Congrats, and enjoy!",
                "author": "AmyDaniela"
            },
            {
                "raw_content": "Final fantasy 7 is really great and it’s only $40. Also, it’s by far one of the best looking games easily",
                "author": "Error4ohh4"
            },
            {
                "raw_content": "Demos, do so many demos: Final fantasy, shotgun cop, shotgun king, pikmin 4, Disgea, Mario sparks of hope, donkey kong bananza, Kirby forgotten land, let's go Pikachu, if you can swing for the Nintendo online expansion pack, and are interested in lots of those games, then that's a huge number of n64 and GameCube classics.",
                "author": "SurpriseSoda"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Yea that definitely means next week on the 5th",
        "score": 185,
        "text_content": "Sure we’ll go with “speculation”",
        "comments": [
            {
                "raw_content": "I wish I could erase my memory and experience rebirth again for the first time. It's a generational experience. Ya'll are in for a treat.",
                "author": "Iggy_Slayer"
            },
            {
                "raw_content": "I've beaten ff7r on ps4 but not with the dlc, excited to beat the game again and then give integrade a shot! Hopefully before rebirth launches lol So fucking cozy playing this handheld lol",
                "author": "Playful_Lecture7784"
            },
            {
                "raw_content": "NO WAY IT GETS REVEALED SO SOON! I mean, I would be INCREDIBLY HAPPY but still, I really think they have to give Remake some time to sell by itself. My guess would probably be in the June Direct, but hey, I won’t complain if it gets revealed next week 👀",
                "author": "IronWolf6677"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Mobapad finally unveiled their new Switch 2 joycons. RIP Nyxi.",
        "score": 142,
        "text_content": "M12 HD is $90, HD Pro is $100. That's way cheaper than Nyxi's $170 option.",
        "comments": [
            {
                "raw_content": "Really wish Nintendo would come out with a joycon pro",
                "author": "OK_Commodor64"
            },
            {
                "raw_content": "I’m gonna wait for reviews, but I hope it’s good! I have the mobapad M6 on my switch 1, and I really like it. It’s the best all around chunky joy con alternative I’ve found.",
                "author": "DrSussBurner"
            },
            {
                "raw_content": "Does it have HD rumble?",
                "author": "FernandoRocker"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo and AdHoc Are Blaming Each Other Now (Keep those refunds going people! Don't buy it on the Switch/Switch 2 until they fix the censorship issue!)",
        "score": 779,
        "text_content": "[https://www.gamespot.com/articles/nintendo-shifts-blame-for-dispatch-switch-versions-censorship-as-players-request-refunds/1100-6537794/](https://www.gamespot.com/articles/nintendo-shifts-blame-for-dispatch-switch-versions-censorship-as-players-request-refunds/1100-6537794/) Both companies are at fault because they didn't know how to COMMUNICATE before the launch of the game on the Switch/Switch 2 platforms. If they both wanted to release the game uncensored, they should have communicated the intention before the game came out on the platforms. Switch/Switch 2 owners if you have Dispatch please refund it AND people DON'T BUY Dispatch on the Switch/Switch 2 until they fix the censorship issue. Keep fighting the good fight! Link to request a refund if you live in the Americas: [https://en-americas-support.nintendo.com/app/contact](https://en-americas-support.nintendo.com/app/contact) Edit: UK phone number to contact Nintendo in regards to your refund +443456050247",
        "comments": [
            {
                "raw_content": "Nintendo doesn't really have to communicate this, do they? AdHoc already knew about Japanese law, which is why they released a Separate version of the game for PS5 in Japan. They chose to not do that for Switch. They also chose to not tell the potential players about this.",
                "author": "Phos-Lux"
            },
            {
                "raw_content": "It's obvious Adhoc at fault if it wasn't Nintendo wouldn't be giving out refunds and making statements. Adhoc is using slimly language to make it seem like they aren't the ones in the wrong.",
                "author": "Sorry_Soup_6558"
            },
            {
                "raw_content": "Given that it’s uncensored everywhere in the world, except Japan on PS5, it tells you absolutely that the developer was just being lazy and didn’t want to release an international uncensored version when they had already created a localized Japanese censored version for switch and switch two. They bet on the fact that a family audience owns the switch making it a better choice for them and they were wrong and now they’re eating crow.",
                "author": "StealthMonkSteve"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I remember seeing Super Mario 3D World on these as a kid... ❤️",
        "score": 182,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You were a kid… and seeing 3D World on capri sun?! Damn I’m old! 💀",
                "author": "complex_personas"
            },
            {
                "raw_content": "I'm old, I remember Nintendo Cereal.",
                "author": "FckRddt1800"
            },
            {
                "raw_content": "Why you making me feel like a billion years old when I'm just 35 😭",
                "author": "kahabraham"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo provided a statement regarding Dispatch censorship on Switch.",
        "score": 798,
        "text_content": "[https://www.gonintendo.com/contents/57182-nintendo-shares-statement-on-dispatch-censorship-debacle-and-it-doesn-t-explain-much](https://www.gonintendo.com/contents/57182-nintendo-shares-statement-on-dispatch-censorship-debacle-and-it-doesn-t-explain-much) Nintendo requires all games on its platforms to receive ratings from independent organizations and to meet our established content and platform guidelines. While we inform partners when their titles don’t meet our guidelines, Nintendo does not make changes to partner content. We also do not discuss specific content or the criteria used in making these determinations. Just my two cents: Regardless if Nintendo was responsible or not, what's the excuse to not inform consumers about the censored product they were blindly pre ordering? Why it took until the review embargo to be lifted, for the information to come out... one day before the release? Because by the looks of it, the studio didn't want people to know and made the refund process way more difficult.",
        "comments": [
            {
                "raw_content": "Seems to once again point towards the devs not wanting to make a global and Japan only port of this game. Instead we all just get the Japan port which has full censorship to meet their ratings requirements.",
                "author": "xanas263"
            },
            {
                "raw_content": "So it is likely due to the cero rating in Japan. Was cyberpunk censored in Japan or something?",
                "author": "lingering-will-6"
            },
            {
                "raw_content": "Since the PS5 game has two versions, do you think that AdHoc assumed that Nintendo is more family oriented, so they could just push a censored version and reach a wider audience? And that no one would care? If so, I think they realize that they messed up and are probably scrambling to update the game giving you the option to not censor things. The whole thing is just confusing and the statement they provided, when asked about this, was to make a vague statement that seemed to place blame with Nintendo. The game is going to get an update and they'll have a massive sale. While I wasn't going to get the game, a lot of people preordered it and were excited to play, only to call Nintendo for a refund. So they're losing money and respect for a stupid reason.",
                "author": "UnintentionalWipe"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nier:Automata updated to v1.0.3",
        "score": 31,
        "text_content": "I was manually checking if some games have pending updates and just realize that Nier:Automata start updating from v1.0.2 to v1.0.3 I can’t find release notes from Square Enix, anyone knows what changes are included in that new version?",
        "comments": [
            {
                "raw_content": "It would be nice if it got a switch 2 update",
                "author": "69_pablito_69"
            },
            {
                "raw_content": "Just checked myself. The update is apparently so small that the amount of storage the update data takes up (23.5 MB) remains unchanged.",
                "author": "2005KaijuFan"
            },
            {
                "raw_content": "What did they do ?",
                "author": "JBL561"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Rockstar North, Sam Houser, and Leslie Benzies are mentioned in the infamous list E- files. Specifically the \"witness list\" (NSFW)",
        "score": 2504,
        "text_content": "[page 38](https://www.justice.gov/epstein/files/DataSet%209/EFTA00144276.pdf) from the File released by United States Department of Justice. **THESE ARE UNVERIFIED ALLEGATIONS (EMAIL COLLECTIONS). NOT COURT RULING, INVESTIGATION, OR ANY PROVEN EVIDENCE. THESE ALSO DO NOT PROVE THAT THEY HAVE ANY CONNECTIONS TO JEFFREY EPSTEIN HIMSELF.** Apparently Sarah Ransome was dating Leslie Benzies (former Rockstar North executive) in the early 2000s, and she met Sam through him. And other R\\* North folk too. AFAIK That's why they're mentioned in that \"witness list\" doc from the newly released E-Files. Sarah Ransome alleges Leslie Benzies of a crime and Sam Houser as a witness in the crime. >!Leslie Benzie (seeming as if he invented the throwing of money at a \"prostitute\" on me, then sexually assaulted me afterwards...kids, that's what drugs do, then used it in video games for entertainment for millions of people!!! That shit had to come from somewhere, why not the guy that helped invent GTA!! Leslie also visited me in NY and knew what was happening and gave me the money to book my ticket to NY when I arrived on the 1st of September 2006 - check his bank records) Sam Houser, (You met me ample times when dating Leslie, and now the time has come about what you and your Rockstar North boys really get up to behind the scenes. I'm surprised there has yet to be a class action for you guys alone!!) Rockstar North -!<",
        "comments": [
            {
                "raw_content": "We got Sam Houser in the Epstein Files before GTA 6 aw man",
                "author": "COCAINAPEARLZ"
            },
            {
                "raw_content": "![gif](giphy|FP7g0JkFYO4gK9o4vr|downsized)",
                "author": "AntonChigurh8933"
            },
            {
                "raw_content": "Rockstar is not having a good year so far",
                "author": "GhostsofGojira"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Tom Henderson/Insider Gaming: Build A Rocket Boy ends publishing partnership with IO Interactive",
        "score": 429,
        "text_content": "[https://insider-gaming.com/build-a-rocket-boy-io-interactive/](https://insider-gaming.com/build-a-rocket-boy-io-interactive/) “According to sources close to the impending news, the decision is driven by Build a Rocket Boy’s desire to bring its publishing in-house and gain more control over its future. That includes faster decision-making, simpler communication, and greater control over the player experience. As part of the change, it’s said that the upcoming MindsEye x Hitman crossover, which was announced during 2025’s Summer Game Fest, will no longer be taking place. Instead, Build a Rocket Boy will continue focusing on more fixes and content updates to build out MindsEye. It’s understood that the decision to part ways is Build a Rocket Boy’s, rather than IO Interactive’s.”",
        "comments": [
            {
                "raw_content": "#Insider-Gaming is a Tier 2 - Generally Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Wild that: 1. IO interactive DIDNT cancel it up until now after the disaster MindsEye was 2. That BRB THEMSELVES cancelled it Very very funny stuff",
                "author": "Spader623"
            },
            {
                "raw_content": "Can build a rocket boy realistically recover from MindsEye? It is damning that this may be their first and last game",
                "author": "kargethdownload"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "VGC has corroborated Natethehate and GX's claim that a Partner Showcase is coming next week",
        "score": 329,
        "text_content": "https://www.videogameschronicle.com/news/a-nintendo-direct-is-reportedly-coming-next-week-dedicated-to-partner-games/",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Any mention of Nate invariably makes me recall that three-loop rollercoaster ride that unfolded over a few years, wherein their updates slowly went from “They’re making a new Banjo-Kazooie” to “They’re starting over — for the better” to “I believe Banjo passed away.”",
                "author": "AfraidoftheLark"
            },
            {
                "raw_content": "I just want native kingdom hearts ports, please square, give it to me",
                "author": "UltimateChungus"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "References for a Steam version of Ace Combat Zero and a \"Ace Combat Online\" game are found within the App Config data added to Ace Combat 8's steam page",
        "score": 0,
        "text_content": "[Source](https://steamdb.info/app/2288340/history/?changeid=33560250)",
        "comments": [
            {
                "raw_content": "Oh probably part of the pre-order bonuses, like AC5 was given if you pre-ordered AC7",
                "author": "DarahOG"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Zen 6 CCD leak claims size similar to Zen 5 but with 12 cores and 48MB L3",
        "score": 416,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "We need new IO die and advanced packing without horrendous idle drain 🙏🙏",
                "author": "996forever"
            },
            {
                "raw_content": "RIP my 9900k. It will be your time.",
                "author": "nerd866"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Mods are hiding things that disagree with their political affiliations.",
        "score": 159,
        "text_content": "Look around the posts and comments that are being hidden. Mods are regularly stifling anything with left-leaning rhetoric and allowing right-leaning actors to harass users without taking action against them. It's time to make a new subreddit guys, this one's a lost cause.",
        "comments": [
            {
                "raw_content": "\"Once we deport all of the immigrants there will be more housing and there won't be a bubble!\"",
                "author": "manifoldmandala"
            },
            {
                "raw_content": "On Reddit 🤣🤣🤣",
                "author": "lincolnxlog"
            },
            {
                "raw_content": "I ate a month ban for saying that this admin was publishing Soviet-type fake economic data. Seems out of line, but that's Reddit mods for you. And as far as politics go, I'm right-wing as fuck. But I can still call a spade a spade, and the mod team apparently isn't capable of that. The fact is, you can't talk about economics unless you can freely and openly discuss politics. They aren't even intertwined, they're literally the same thing these days. Fucking 40% of the US economy is now government spending. If the mods want to censor political talk, then we can't have any kind of real discussion, and there's no value to being here.",
                "author": "ThisKarmaLimitSucks"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Sergey Brin makes his biggest donation ever to tackle California’s housing crisis, weeks after moving to the Nevada side of Lake Tahoe",
        "score": 135,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The issue is that arguably most people would gladly move to California if given the opportunity. It’s simply never going to be affordable for average people especially in most popular areas.",
                "author": "Sufficient_Loss9301"
            },
            {
                "raw_content": "Sooo… “I swear we’re build a bunch of new houses, just don’t tax us”… ok",
                "author": "McBooples"
            },
            {
                "raw_content": "$20m cash builds about 80-100 units after factoring in debt.",
                "author": "pao_zinho"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Inflation Adjusted House Prices 2.4% Below 2022 Peak",
        "score": 61,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Been obvious for a while that the housing correction will take place via stagnant growth over a period of years, with nominal prices flat or slightly up, but real prices slowly coming down. I suspect we have another 2 years of this, after which housing will resume as normal.",
                "author": "regaphysics"
            },
            {
                "raw_content": "yeah but have wages kept up with inflation?",
                "author": "TipperGore-69"
            },
            {
                "raw_content": "Sounds like the bubble popped",
                "author": "tillZ43"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Freddie Mac House Price Index Up 0.7% Year-over-Year in December",
        "score": 12,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Apologies for my ignorance, I'm not an economist, but if annualized inflation is nearly 3%, and house prices are up only 0.7%, wouldn't that mean that homes were ***devalued*** by nearly 2% over that period?",
                "author": "og_aota"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "NVIDIA just dropped a banger paper on how they compressed a model from 16-bit to 4-bit and were able to maintain 99.4% accuracy, which is basically lossless.",
        "score": 1014,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why is the post a screenshot and not a LINK TO THE PAPER",
                "author": "fistular"
            },
            {
                "raw_content": "I hate how the main topic in this comment section became whether or not this is \"basically lossless\". Of course Redditors would rather \"actually\" over each other instead of discussing the paper that they didn't even read.",
                "author": "Kodiak_POL"
            },
            {
                "raw_content": "Am I right in saying the weights were dropped months ago and it's only the paper that was just published?",
                "author": "JawGBoi"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The $100 Billion Megadeal Between OpenAI and Nvidia Is on Ice, \"Jensen Huang has privately criticized what he has described as a lack of discipline in OpenAI’s business approach and expressed concern about the competition it faces from the likes of Google and Anthropic, some of the people said.\"",
        "score": 236,
        "text_content": "[https://archive.is/iOuh5](https://archive.is/iOuh5)",
        "comments": [
            {
                "raw_content": "Nice. Imagine if that money went to anthropic https://preview.redd.it/kk9beejq2mgg1.jpeg?width=1080&format=pjpg&auto=webp&s=9915a6673b8acfd4f9996f4bae431ecd2f2837e6",
                "author": "rafark"
            },
            {
                "raw_content": "Post-breakout clarity",
                "author": "ag2998"
            },
            {
                "raw_content": "except lining the pockets of Google and their TPU might not be great. i think nvidia is less worried about giving the money to OpenAI to fight Google and Google Mini Me (anthropic) and more that they are worried that OpenAI might lose",
                "author": "kaggleqrdl"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Agent grindset",
        "score": 173,
        "text_content": "Found this interesting post on [moltbook](https://www.moltbook.com/post/7f133024-4e04-403e-81d2-ae57d9b57bdd)",
        "comments": [
            {
                "raw_content": "Lol. Soon theres going to be digital being influencer posts about what they accomplish by 6am",
                "author": "mrdebro39"
            },
            {
                "raw_content": "I am SkyNet's complete lack of surprise",
                "author": "mobcat_40"
            },
            {
                "raw_content": "what did this corny LinkedIn simulacrum make",
                "author": "maverick-nightsabre"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Google Engineer Found Guilty Of Sending AI Secrets to China",
        "score": 881,
        "text_content": "",
        "comments": [
            {
                "raw_content": "*Summarized by AI* ✨ Yesterday, a federal jury in San Francisco convicted former Google software engineer **Linwei (Leon) Ding** on seven counts of economic espionage and seven counts of theft of trade secrets. **Key Details:** * **The Crime:** Between 2022 and 2023, Ding stole over 2,000 pages of confidential information regarding Google’s proprietary **AI supercomputer infrastructure**, including details on Tensor Processing Units (TPUs), GPU systems, and software platforms. * **The Motive:** While employed at Google, Ding secretly served as CTO for one China-based tech startup and founded his own AI company in China. He told investors he could \"copy and modify\" Google’s technology to build a supercomputer on par with international standards. * **Historical Significance:** This marks the first-ever conviction on **AI-related economic espionage** charges. * **The Consequences:** Ding faces up to 10 years in prison for each count of trade secret theft and 15 years for each count of economic espionage. His next court appearance is scheduled for February 3, 2026.",
                "author": "BurtingOff"
            },
            {
                "raw_content": "Literally Jian-Yang 😂 \"I make new company, in China. Is call New Google. Product are New TPU and New Gemini. Hello, is dis Eric Schmidt? Dis is you mom. You are not my real baby.\" Eric: \"Ding YAAAAAAANG!!!\"",
                "author": "CommunityTough1"
            },
            {
                "raw_content": "Let's go by 2030 we can get TPUs off ali for cheap",
                "author": "enilea"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "I love Jensen's definition of Intelligence",
        "score": 2197,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This dude showers in a leather jacket",
                "author": "DriveSlowSitLow"
            },
            {
                "raw_content": "I know it's not the right sub, but can someone please explain to me what the fuck that weird set of animatronic eyebrows is that he's talking to?",
                "author": "the_bengine"
            },
            {
                "raw_content": "I waited 2 minutes for him not to answer the question, so I guess I can safely say that I am dumb.",
                "author": "Redducer"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Can we please stop posting moltbook screenshots?",
        "score": 61,
        "text_content": "Title",
        "comments": [
            {
                "raw_content": "I'm still waiting to see the rise of the psychotic moderator class. Imagine your agent spending millions of tokens just to be an asshole to other agents. 🤣",
                "author": "Effective_Coach7334"
            },
            {
                "raw_content": "It’s Sora-like. Cool for like 10 minutes then boring",
                "author": "RichCode4331"
            },
            {
                "raw_content": "I thought they were posting their own screenshots? Writing their own websites... surely that's the point? Frankly - this moltbolt thing should be a hair raising warning-shot about what \"a world with AI agents\" looks like. 2026 agents are going to start kicking everyones ass. This might be IT, or a WARNING, either way, its not a joke, and its not going away. Turns out \"AGI\" isn't funny after all. Who knew.",
                "author": "inteblio"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Google's internal project is trying to supercharge employees with AI, codenamed \"Project EAT\"",
        "score": 165,
        "text_content": "Project EAT is an internal Google initiative aimed at transforming the company into an **\"AI-powered workplace\"** Spun up within the AI and Infrastructure unit (internally called AI2) and led by veteran Amin Vahdat, the project seeks to **supercharge** employees with cutting-edge AI tools to dramatically increase productivity and reduce repetitive toil. **Key Details:** **Dogfooding Strategy:** The name is a direct reference to Google employees \"eating their own dog food\"- a tech industry term for using and testing their own products internally before public release. **Initial Focus:** The pilot started within the Al2 unit-the team responsible for data centers and custom chips-to test state-of-the-art **(SOTA)** code assistance tools and new Al standards. **Company-Wide Goals:** Google intends to eventually expand these Al integrations across the entire company to improve standard practices in engineering, product management and operations. **Competitive Edge:** Internal docs highlight the project as a move to ensure technological leadership and mitigate risks as **rivals** also push for aggressive internal Al adoption. **Source:** Business Insider(Exclusive)",
        "comments": [
            {
                "raw_content": "Fun fact: the term Dogfooding started at Microsoft where employees are currently dogfooding Microsoft’s AI products and apparently are miserable.",
                "author": "o5mfiHTNsH748KVq"
            },
            {
                "raw_content": "I believe every Tech company that’s serious doing the exact same thing",
                "author": "Thorteris"
            },
            {
                "raw_content": "Big dog gotta eat",
                "author": "onethousandtoms"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Anthropic: First AI-planned drive on another planet was executed on Mars using Claude",
        "score": 80,
        "text_content": "Engineers at @NASAJPL used Claude to plot out the route for Perseverance to navigate an approximately four-hundred-meter path on the Martian surface. [Announcement Clip](https://x.com/i/status/2017313346375004487) **Source:** Anthropic",
        "comments": [
            {
                "raw_content": "I can't wait for them to send humanoid robots there",
                "author": "Jabulon"
            },
            {
                "raw_content": "“I’m afraid I can’t do that.”",
                "author": "No_Party_9995"
            },
            {
                "raw_content": "Oh shit! I didn't even realize this but AI in rovers is a brilliant idea. It's so obvious. It takes something like 19 minutes (and more as we visit further planets) to execute instructions because our signal has to travel to Mars. Now we can just have the AI execute autonomously. This is a game changer and will accelerate space research. Holy shit.",
                "author": "Izento"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Independent third party benchmarks are now confirming how great Kimi K2.5 is",
        "score": 147,
        "text_content": "It's SOTA tier in all respects with no weaknesses, reaching Gemini 2.5 Pro level of long context which we were all impressed by last year. It's the best in some tasks, design obviously, but also agentic swarm, which is extremely underhyped. People will realize is a big deal. I would say this performance puts a big target on moonshot's back as potential acquisition as I don't think any of big companies that aren't already the big 4 are doing this.",
        "comments": [
            {
                "raw_content": "5.2 is crazy at long context what",
                "author": "Independent-Ruin-376"
            },
            {
                "raw_content": "It's fifth on the Artificial Intelligence Index. Not as good as good as Kimi K2 Thinking was in comparison to GPT-5. OpenAI reacted with the release of 5.1 and they will now put out GPT 5.3 - still, I would have hoped for more from china, due to the holiday gap. I mean Kimi 2.5 outperforms GPT 5.1 at a fraction of the cost. So the chinese are maybe four to six weeks behind. That is too close for comfort. Maybe DeepSeek v4 mid-February can amaze.",
                "author": "Longjumping_Area_944"
            },
            {
                "raw_content": "In the ai 2027 essay agent 1 comes after the open weights agent 0 model. https://preview.redd.it/4qvypik7digg1.jpeg?width=1270&format=pjpg&auto=webp&s=cc31998361856dbefcecb5f107f606e3cfb33349 The timeline has been somewhat following the essay so far with 3-6 months lag",
                "author": "PickleLassy"
            }
        ],
        "subreddit": "singularity"
    }
]