[
    {
        "post_name": "Gavin Newscum goes full retard. Never go full retard.",
        "score": 1261,
        "text_content": "",
        "comments": [
            {
                "raw_content": "imitation is the sincerest form of flattery",
                "author": "VirTW"
            },
            {
                "raw_content": "He seems unhinged.",
                "author": "-f-b-i-"
            },
            {
                "raw_content": "By MAPs he means minor attracted person",
                "author": "Freedomnuggs"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: President Trump has just boarded Air Force One following his LANDMARK meeting with Vladimir Putin in Alaska Trump said “on a scale of 1-10, I’d give today a 10.” 🔥 47 WILL achieve peace!",
        "score": 1262,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Trump: Take it, dingleberry. Z: But, muh millions Trump: Take it! Z: Okay, boss.",
                "author": "AslanFan"
            },
            {
                "raw_content": "fingers crossed. People are dying in s stupid, pointless conflict.",
                "author": "iirc_life"
            },
            {
                "raw_content": "For this to end Zelensky will need to basically suffer some humiliation. Hes a despot, a fraud and a dictator who would rather get all his countrymen killed than lose face. He is *going* to have to cede land back to Russia. Him continuing to throw darts at Russia is just sealing it. Hes not looking for peace. Its his goddamn ego",
                "author": "DingleBalls"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Get in, losers. We're going out for burgers and brewskies!",
        "score": 1074,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Trump doesn't touch alcohol, tobacco, or drugs other than that sweet Diet Coke caffeine.",
                "author": "rickscarf"
            },
            {
                "raw_content": "They should go through McDonald's drive through so Trump can show him where he worked before he won 2024. Treat Vlad to the Trump Fries.",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "Zelensky is really looking like an asshole right about now, but that's nothing new. Imagine him meeting Trump in his Nazi pajamas expecting any respect at all.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🤦‍♂️ TRUMP - PUTIN MEETING WAS A FAILURE : CNN / MSDNC 🤦‍♂️",
        "score": 970,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Holy hell that a miserable bunch of cunts Eye bleach please",
                "author": "highenergywinning"
            },
            {
                "raw_content": "Why is there a guy in the top middle?",
                "author": "WhatsFappening"
            },
            {
                "raw_content": "ignore the msm",
                "author": "YodaBannon"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "WATCH IN FULL: President Donald J. Trump's exclusive interview with @seanhannity on @FoxNews immediately following today's historic Alaska Summit",
        "score": 620,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I just can’t bring myself to watch hannity 😂",
                "author": "Illuminaughty"
            },
            {
                "raw_content": "Sean is not only a faggot but he is probably deep state CIA",
                "author": "deletedandreacted"
            },
            {
                "raw_content": "&#65038; Interesting, right away President Trump brings up **RARE EARTH MINERALS**. I'm guessing a deal is being made with Russia on that, as well as other things. &#65038;",
                "author": "BallotsOnRubysUSB"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 WOW! Vladimir Putin is making Democrats FURIOUS after saying: \"When President Trump says if he was the president back then, there would be no war...it would indeed be SO. I can confirm that.\"",
        "score": 1214,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Trying to stop a war goes way beyond the capabilities of an auto president",
                "author": "VirTW"
            },
            {
                "raw_content": "Maybe he meant:\" He would have told NATO and the CIA to stop fucking around overthrowing the government an trying to get Ukraine to join NATO, as we've been warning them for 15 years\"",
                "author": "Pappy_Gunn"
            },
            {
                "raw_content": "Why so upset? The 2020 election was stolen, and Joe Biden was an illegitimate president. Obama was an illegitimate president too, but for different reasons.",
                "author": "knnbccb"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Trump-Putin meeting has ended. Trump is reportedly on the phone with Ukraine/Europe; A joint press conference between the two leaders is imminent",
        "score": 1247,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The adults are back in charge you fiendish little bitches",
                "author": "NoWarWithIran"
            },
            {
                "raw_content": "'Zelensky, you're fired!!' 'You can't do that!' 'I just did, punk!'",
                "author": "TheAftermath"
            },
            {
                "raw_content": "End of the war incoming.",
                "author": "Wexit-Delecto"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "After pulling over for a better picture, an ICE agent called a liberal woman a “Karen.”👏👏",
        "score": 1316,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They aren't showing their faces because counts like you would use it to doxx them.",
                "author": "DingleBalls"
            },
            {
                "raw_content": "My God, their voices. They sound like helium-inhaling gibbons.",
                "author": "TheAftermath"
            },
            {
                "raw_content": "The Karening of America has truly made it a chore to deal with these unreasonable people at work on a daily basis. I have started to detest the level of entitled expectations these main character syndrome psychopaths expect",
                "author": "GodKingHarambe"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Faux News reporter is put on directly after the Trump-Putin meeting saying it was all a FAILURE - \"It was not good, it did not seem like things went well.\"",
        "score": 861,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Haven’t watched Fox News since they called Arizona for Biden.",
                "author": "journalist"
            },
            {
                "raw_content": "Paul Ryan still there?",
                "author": "magnokor"
            },
            {
                "raw_content": "Fuck Fox News.",
                "author": "RuprechtThaMonkeyBoy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Liberals are now preparing to DOX law enforcement...... “Follow them home and livestream their house”..👀",
        "score": 847,
        "text_content": "",
        "comments": [
            {
                "raw_content": "WTF is that?",
                "author": "A_Little_White_Duck"
            },
            {
                "raw_content": "You’ll never be a real….woman?",
                "author": "RuprechtThaMonkeyBoy"
            },
            {
                "raw_content": "That ought to work out....",
                "author": "obamagavemeaphone"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Democrat-Appointed Judges Refuse to Jail Man Who Threatened to Kill Donald Trump, Pam Bondi, and Stephen Miller",
        "score": 1188,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If they won't follow the law, maybe a foreign serial killer that Trump hires won't also /satire",
                "author": "5DchessWatch"
            },
            {
                "raw_content": "Good, throw the judge in jail and deal with the nut next.",
                "author": "MajorG"
            },
            {
                "raw_content": "Arrest these fucking judges!",
                "author": "DCYR66"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: Democrat New Orleans Mayor LaToya Cantrell has just been INDICTED by a federal grand jury after an FBI investigation for CORRUPTION",
        "score": 1825,
        "text_content": "",
        "comments": [
            {
                "raw_content": "WHY DO ALL OF OUR CITIES HAVE MAYORS WITH STAR WARS NAMES?",
                "author": "Thatunknownguy"
            },
            {
                "raw_content": "Every blue city is controlled by organized crime, and most of it is now black organized drug and human trafficking crime. Blue cities are the whole Dem party. Without blue city Dem Machine vote fraud, there is no DCN at the local, state, or national level.",
                "author": "CleanUpPhillyTrump24"
            },
            {
                "raw_content": "Saints tickets? Oh please.... show us the real numbers for fuck sake.",
                "author": "hughjasske69"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Federal Government on Track to Reduce Workforce by 300,000 in 2025. Office of Personnel Management director Scott Kupor said 80% of those employees would leave voluntarily and 20% would be fired. That's a 12.5% reduction in the federal workforce since January.",
        "score": 1100,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Moar pleez",
                "author": "ConGrande1"
            },
            {
                "raw_content": "My now home state of Maryland has a large percentage of the do-nothing, nepotism baby, fake credentialed losers who are now unemployed and I'm certain our fake governor's answer will be to raise taxes even more. I have a few more years before the last of my kids is in college, and then I'll retire and my wife and I will be selling our house and moving to Florida.",
                "author": "4886Battery"
            },
            {
                "raw_content": "85% more to go",
                "author": "Aggrieved03"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump and Putin ride together in 'The Beast'",
        "score": 1630,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Show him how you can grab the steering wheel from all the way back there.",
                "author": "Taqiyya_Mockingbird"
            },
            {
                "raw_content": "Hope they make history.",
                "author": "shadypollster"
            },
            {
                "raw_content": "Women along the route are going to spontaneously get pregnant with that much manliness in such close proximity. Pray for peace.",
                "author": "Taylor3006"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This is why Vegas tourism will stay down American shows that in his Vegas hotel you can’t even use the mini fridge anymore. They have equipt it with sensors and if you put anything inside you’ll be charged $50 per day",
        "score": 1152,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This isn’t just Las Vegas. Corporations everywhere have forgotten how capitalism works. Movies lose viewers? Raise ticket prices, lose more viewers. Theme parks lose attendance? Nickel and dime attendees, loses more attendees. Etc. &nbsp; People running these businesses act like nobles and/or oligarchs and feel owed more and more money year over year. Actually improving a product or accepting lower profits for a while is anathema to them.",
                "author": "MSG1000"
            },
            {
                "raw_content": "Hotels now charge for parking, resort fees, etc. Gone are comp meals/rooms, unless you first blow some ungodly amount of cash, etc. Breakfast used to $2.99 for bacon, eggs, and pancakes at Palace Station. Circus Circus had the $6.99 breakfast buffet! All gone. We used to go to Vegas just about every weekend back in the 80s and 90s. My grandparents owned an apartment building over there. We had a manager's unit that we kept to ourselves so we could stay for free. But even if not for that, old Vegas used to be so inexpensive. It used to be so clean. And it used to be so safe, so long as you didn't cheat the casinos. The mafia ran it better than these corporations.",
                "author": "midgetpornrocks"
            },
            {
                "raw_content": "I dont go to Vegas because its packed full of local black gang members and now looks ghetto and they see you as a mark.",
                "author": "EvilGreed209"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Putin expresses gratitude to the United States for respectfully maintaining the graves in Alaska of fallen Soviet pilots from World War II.",
        "score": 529,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wow, this made me tear up. God bless the souls of these 14 Russian Airmen, buried so far from home. 🙏",
                "author": "Nellie_the_Beaut"
            },
            {
                "raw_content": "Feels like an easy win. I'm curious what fallen Soviet pilots from WW2 are doing in Alaska, or is that one of those things people shouldn't know?",
                "author": "billybaldwin2"
            },
            {
                "raw_content": "Best story I've seen all week. Best diplomacy.",
                "author": "Flataxandmaga"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "There's \"Power Moves\", then there's \"Tea Bagging with Stealth Tech, Power Moves\"",
        "score": 1277,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That was arrogant but still a little funny at the same time.",
                "author": "Somebody157"
            },
            {
                "raw_content": "This is fucking legendary. Absolute boss move show of strength.",
                "author": "MakeAmericaGreat9"
            },
            {
                "raw_content": "Well, Putin terrorized Merkel with his dogs, so he knows the drill. That's why I cannot hate the man.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Complicated Business Folks. Complicated Business.",
        "score": 1095,
        "text_content": "",
        "comments": [
            {
                "raw_content": "My opinion says Putin isn't going to come to the USA to rattle his saber or talk shit, this is big, this is huge so he came to the USA in person to discuss The Bridge with Trump. The Bridge will connect Alaska to Russia and both countries will significantly level up on trade and possibly make some maritime shipping paths redundant.",
                "author": "charliesean"
            },
            {
                "raw_content": "Trump got off his plane first. That was a sign of respect as a host.",
                "author": "FL_Trumpnado"
            },
            {
                "raw_content": "&#65038; You know, on Nov. 11th, at 11:00 a.m. the Great War, now called W.W.I stopped. &#65038; Even though this was seemingly a joke it's a good sign. &#65038;",
                "author": "BallotsOnRubysUSB"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Putin says he can \"confirm\" Russia would not have invaded Ukraine if Trump was President",
        "score": 690,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Understandable. While some say, \"it's because Trump threatened to nuke Moscow,\" I have a more reasoned answer Russia has a pipeline going through the Ukraine further into the EU. Russia wanted a new NordStream pipeline to bypass the Ukraine. Trump said no chance. What right does the USA have over the Baltic Sea? IDK. Then, Biden gets into office and says \"sure thing Jack, you put in the Nordstream pipeline.\" Then, Biden heralds \"Putin will invade the Ukraine, February 2022.\" Everyone laughs. Biden is always wrong. The new Nordstream pipeline is completed to bypass the Ukraine. What's this? Russia suddenly invades the Ukraine. Feel free to fact check me here.",
                "author": "billybaldwin2"
            },
            {
                "raw_content": "then why won't he stop it",
                "author": "spentcoffee"
            },
            {
                "raw_content": "Team \"Russia Russia Russia\" will never accept that.",
                "author": "LBTrumplican2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "LIVE: President Trump Holds a Press Conference After Meeting with Putin in Alaska - 8/15/25",
        "score": 733,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Putin actually acknowledged Lend-Lease. That’s a pretty big deal coming from him, as the Russian government’s official line is “We beat the nazis all by ourselves with no help.”",
                "author": "YT45"
            },
            {
                "raw_content": "Loved the flyover as Putin arrived.",
                "author": "Addos"
            },
            {
                "raw_content": "Quite pleasant. A bit dull, but thankfully short.",
                "author": "billybaldwin2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Upcoming DeepSeek AI model failed to train using Huawei’s chips",
        "score": 167,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's a shame the article doesn't go into more detail. I'm very curious on how a model can \"fail\" training. Going slowly would be easy to understand. But a failure condition implies it couldn't complete training at all.",
                "author": "Verite_Rendition"
            },
            {
                "raw_content": "Hmm, hardware issues with the MAC precision/error propagation or software issues with model to hardware ops compiler (mlir -> \"assembly\"), I wonder.",
                "author": "Dexterus"
            },
            {
                "raw_content": "Honestly more than I expected from Huawei. Where are they even getting these chips fabbed?",
                "author": "autumn-morning-2085"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung cuts back on traditional foundry costs as it leans into HBM for AI computing",
        "score": 59,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's interesting. Leading edge DRAM nodes are different enough from leading edge bulk logic oriented nodes that they're completely generally different fabs. Because of that, divesting in one to invest more in another is a decision with a remarkably long latency tail. You'd see the effects of that decision for at least five years, and probably around a decade. Maybe they're thinking that even if the large AI firm bubble pops (which given measurable, but under delivered perf increases of GPT5 seems on the radar), the act of creating and using these models will be democratized to the point that there will still be the heavy need for HBM, rivaling the need of a few big players?",
                "author": "monocasa"
            },
            {
                "raw_content": "any chance hbm could replace ddr?",
                "author": "ChocolateSpecific263"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Radeon RX 9070 XT vs. GeForce RTX 5080: Battlefield 6 Open Beta, Nvidia Overhead",
        "score": 133,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That’s a massive difference in GPU usage even on ultra settings, 90% vs 70%. This is actually a very interesting premise. The nvidia driver overhead is something that definitely needs to be better understood. I know a 7600 with a 5080 is not a likely build for someone to have right now but asymmetrical CPU/GPU pairings happen often when upgrading later down the line. I remember getting no performance increase when using a 3080 with my R7 2700. We have an interesting scenario with BF6 where it’s absolutely hammers the CPU whilst still being otherwise very graphically demanding on the GPU so gets to show some of the areas this still happens in. Even with the 9800X3D the 5080 has less of a lead than it should in scenarios like this.",
                "author": "Drakthul"
            },
            {
                "raw_content": "BF6 is already a CPU stressor, crazy to see that driver overhead exacerbates the issue.",
                "author": "aj_thenoob2"
            },
            {
                "raw_content": "I really hate the fact that half the comments are brain-dead, my guy is testing GPU driver overhead causing extra load on the CPU thus inducing a more severe CPU-bound situation. and half the comments are talking about why the GPU isn't being taxed, isn't reaching above 2600mhz or why are you comparing it to the 5080 not 5070ti (which means they didn't even watch the video, there are more GPUs tested). Then again, this is reddit. Make one mistake at one point in time and they'll hate you for eternity or more. Favour one company over the over and they'll call you a hater/lover no matter what happens now or in the future.",
                "author": "battler624"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "\"GlobalFoundries Completes Acquisition of MIPS\"",
        "score": 97,
        "text_content": "",
        "comments": [
            {
                "raw_content": "My big question is why? The ISA was dealt a death blow by RISC-V already. ARM, Apple, and whoever else already stripped out the most useful patents 13 years ago. MIPS core designs have had very tepid responses and even a dedicated design company (Imagination Technologies) couldn't market them. The big MIPS designs that existed in the past were mostly made by Broadcomm as I recall. Why does a chip fab want to get back into the chip design market and why MIPS instead of RISC-V?",
                "author": "theQuandary"
            },
            {
                "raw_content": "> In 2021, MIPS announced it would begin making chips based on the RISC-V architecture. In 2022, the company announced availability of its first RISC-V CPU IP core, the eVocore P8700.",
                "author": "WarEagleGo"
            },
            {
                "raw_content": "The acquisition of the \\*company\\* MIPS and not just the ISA. And MIPS Technologies, aside from owning the MIPS ISA, also designs RISC-V cores now. My best guess is that GF is probably looking to start designing their own line of chips to sell (microcontrollers and the like), and/or to provide custom chip design services, with manufacturing included, based on MIPS IP blocks.",
                "author": "damodread"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Jarrod's Tech] Best Laptop CPU? Ryzen 9 9955HX3D vs Intel Core Ultra 9 275HX",
        "score": 11,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I get that these are top of the line laptops and all, but the pricing still just seems absurd to me. Like I could build a full 9800X3D + 5080 desktop with dual monitors and peripherals, get a thin and light LNL laptop or Macbook Air, *and* still have enough left over to maybe buy a Nintendo Switch. I also hate the \"we used ~~to~~ \\*the same RAM for fairness\" reviewers do. DDR5-6400 is the officially supported, recommended RAM for ARL-HX. An IMC that supports that RAM speed is part of the CPU design that Intel spent time and money implementing. There was no reason to handicap it considering it still would've lost by a fairly large margin anyway.",
                "author": "soggybiscuit93"
            },
            {
                "raw_content": "Arrow Lake is more competitive with Zen-5 in the laptop space due to its iGPU being an important factor The Xe1+ (Alchemist+) Arc 140T is competitive with the older RDNA3 880m and it has XMX engines that allow it to run Xess. [Arc 140V is Xe2 (Battlemage) and is used in Lunar Lake] But the Zen-5 X3D chip absolutely still pulverizes Arrow Lake in Gaming. Ultra Low Power: Intel is ONLY competitive in the ultra low power segment where Lunar Lake and soon Panther Lake will shine. X3D might not be good for efficency at low power since SRAM does consume quite a bit of power (unless AMD can power down some L3 slices). AMD's IO die, and infinity fabric is also power hungry compared to Lunar Lake's IO What AMD needs to improve: AMD needs to copy aspects of ARM'S DSU ring bus implementation. In the DSU-120 individual L3, slices can be powered down along with individual cores for efficency. The IO die needs to be connected to the CPU with a specialized low power interconnect since Infinity fabric can't be clocked below a certain frequency since it needs to arbitrate traffic between CCD's using the PCIe bus. (Infinity Fabic connects 2 CCD's using the PCIe bus and maintains cache coherency between each CCD with a lower-performance active directory.) What Intel needs to do: Panther Lake is a good step in consolidating their control over the efficent x86 ultrabook market. (Intel claims that PTL will have the same efficency as LL but it has more SKU's) Nova Lake needs to have bLLC otherwise it's DOA for the desktop DIY space Nova Lake also needs an ultrabook U or V SKU that's faster and more efficent than AMD and competes with ARM. The N1X and future efficent snapdragon laptop parts are likely coming, and it would be stupid for Intel to embrace their famous arrogance and sit on their laurels. Intel should keep the -U SKU for 15w power and make a V SKU for PTL and NVL for 10w power. LL has earned Intel mindshare for efficency, and it should capalize on that with future V SKU products.",
                "author": "SherbertExisting3509"
            },
            {
                "raw_content": "AMD needs to simplify its naming strategy, 9955HX3D is mouthful. just compare it to M4 Max for example",
                "author": "abuassar"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "In Donkey Kong Bonanza you leave a golden DK statue where you died, I don’t feel so bad about losing all that gold now",
        "score": 774,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Had no idea, any deaths I had were from falling lol.",
                "author": "ThatDamnRaccoon"
            },
            {
                "raw_content": "So you're saying it's a Soulslike? ![gif](giphy|Agn9krdo9GbP7KZbfY|downsized)",
                "author": "NathanCollier14"
            },
            {
                "raw_content": "I've had a constant supply of Apple Juices (and balloons for that matter) that I wouldn't even have noticed this.",
                "author": "techi23"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Handheld switch 1 games might be the worst part about the switch 2.",
        "score": 578,
        "text_content": "I recently got hollow knight on switch 2, and it made me realize… I’d rather play this on switch 1. Something needs to be done about switch 1 games running at 720p handheld, it makes the switch 2 feel like a downgrade in a way it really shouldn’t.",
        "comments": [
            {
                "raw_content": "The fact there haven’t been many patches since the system launched is concerning. This might just be what most Switch 1 games are gonna look like on it. Will be a huge mark on the system if so.",
                "author": "OldPostageScale"
            },
            {
                "raw_content": "The thing is Nintendo needs to give us an enhance handheld mode where the switch 2 tells the game it’s in docked mode so the games run at a higher resolution. At least leave it as a toggle as those game might draw more power from the battery",
                "author": "HGLatinBoy"
            },
            {
                "raw_content": "Genuinely yeah, I still use my switch 1 for basically everything that ISN'T an updated game. That being said Zelda echoes of wisdom is like a different game on Switch 2",
                "author": "HoxpitalFan_II"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Updated Switch 2 dual screen patent",
        "score": 316,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Maybe this is why they had the 2nd usb c port this whole time.",
                "author": "LieutenantReverend"
            },
            {
                "raw_content": "This could be used for DS and 3DS games (if they ever add them to the online service). Kinda like the classic controllers they sell for each console. I just hope that, if that's the case, it's going to be optional.",
                "author": "Apocal_"
            },
            {
                "raw_content": "Wii U 2 LFG",
                "author": "DonkeyKongOnN64"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Turn Your Switch 2 Into a MagSafe Power Bank Beast (Still Dock-Friendly!)",
        "score": 92,
        "text_content": "Tip for Switch 2 Owners: You can stick a MagSafe ring to the back of your Switch case and carry a power bank in a much more comfortable way! Here’s my setup: • Spigen Nano Pop case for the tablet/screen • JSAUX grip case for the Joy-Cons • INIU MagSafe 6000 mAh battery (cheap, good quality, and works great) • Beats USB-C 20cm cable Even with the MagSafe ring attached, I can still dock my Switch without any issues after removing the battery. If you’ve used MagSafe accessories before, you know they hold very securely, so everything stays in place. Hope this tip helps! You can find adhesive MagSafe rings in Amazon or any phone accessories store. I don’t recommend sticking the MagSafe ring directly to your Switch 2 as it might leave some sticky residue.",
        "comments": [
            {
                "raw_content": "I never liked the idea of putting a battery pack on the back. I would rather use a slightly longer cable and not have to deal with the extra weight.",
                "author": "Hugh_Jegantlers"
            },
            {
                "raw_content": "I have a similar set up with mine, which I also use to attach a phone clip. Bavin has a small powerbank with 10000mah. Also, you should consider an angled cable. It looks cleaner. *",
                "author": "adingdingdiiing"
            },
            {
                "raw_content": "It's a really nice feature and the Genki Attack Vector has it built in: [https://www.amazon.com/GENKI-Attack-Vector-Travel-Cover-Switch/dp/B0FD2V9VMH](https://www.amazon.com/GENKI-Attack-Vector-Travel-Cover-Switch/dp/B0FD2V9VMH)",
                "author": "ModXMV"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "just finished DK - and WOW",
        "score": 33,
        "text_content": "I wasn't sold at first but once you get to the frozen layer the difficulty picks up and thats when it all clicked for me also paulines ballad remix at end credits mixed with the kong bananza song - SLAPSSSSS",
        "comments": [
            {
                "raw_content": "Stopped like 50 hours into cyberpunk to play DK. I loved every single second of it. Beat it a few days ago and I’m struggling to get back into cyberpunk now lol. I know they’re totally different games but DK was just such a perfect balance of brand new mixed with nostalgia. What a masterpiece.",
                "author": "MidnightWorried6992"
            },
            {
                "raw_content": "I'm having some ice cream right now...well it's too hot. Working on it",
                "author": "txdline"
            },
            {
                "raw_content": "the Pauline end credit song is great!",
                "author": "echoess84"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "My body is ready for Air Riders",
        "score": 432,
        "text_content": "Sakurai tweeted this today, seems like Air Riders will be officially shown off in early September direct.",
        "comments": [
            {
                "raw_content": "Sakurai really said it's our birthday today, IF YOU EVEN CARE",
                "author": "montegarde"
            },
            {
                "raw_content": "So ready! ![gif](giphy|Nipx6t1gNrrXhxHQIg)",
                "author": "Wynti"
            },
            {
                "raw_content": "Honestly I've been looking forward to this game more than anything else coming out on any platform. Can't wait to see what they have cooking. Wonder if it will have an extensive online mode. Could be a breath of fresh air.",
                "author": "homelist"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Pokemon Legends Z-A: Exclusive hands-on gameplay",
        "score": 247,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I really like that they are attempting to innovate on the battle system. It looks new and refreshing. I'm excited to try it out!",
                "author": "Glacier_Pace"
            },
            {
                "raw_content": "Ya know, it looks great, at least on the Pokémon Curve tm upon which I judge Game Freak’s efforts. Obviously I will buy it and love it",
                "author": "comesasawolf"
            },
            {
                "raw_content": "I just wish this game wasn't all inside of a single city.",
                "author": "Lokeze"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Punchout!! needs to return on Switch 2.",
        "score": 97,
        "text_content": "Even if it is only a remaster of the Wii game. The controls on that game were not good because you could use slow motion controls or a sideways Wiimote. It needs to return with normal gamepad controls. This game is severely underrated and you can't believe how fun it is.",
        "comments": [
            {
                "raw_content": "Just a deluxe version with 4 added fighters and expand the prefight cutscenes $60 and we fly",
                "author": "aSlider64"
            },
            {
                "raw_content": "Super Punch Out is one of my favorite still. I used to chase the world record times when I was a kid and got pretty close. How is the Wii version? I never got to play it.",
                "author": "ruler31"
            },
            {
                "raw_content": "Round these parts, we call it Arms🤷‍♂️",
                "author": "MrSal7"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "[Confirmed] Chris Hansen is investigating Roblox for child safety failures",
        "score": 276,
        "text_content": "Previous rumor: https://www.reddit.com/r/GamingLeaksAndRumours/s/U0ysDCehlf Conformation: https://x.com/chrishansen/status/1956463610563051924?s=46 Chris Hansen has publicly made a statement that is is true he is working with law enforcement, detectives, and victims to produce a documentary on Roblox’s grooming of kids by predators.",
        "comments": [
            {
                "raw_content": "\"Care to explain why your inventory is full of free candy gear? Why don't you take a seat.\"",
                "author": "OwnAHole"
            },
            {
                "raw_content": "The imagery of Chris Hansen playing Roblox cracks me up",
                "author": "Own_Peace6291"
            },
            {
                "raw_content": "\\>Threatened to sue Youtubers \\>Gets sued by the state of Louisiana \\>Chris Hansen is now after your ass Masterful gambit, Roblox",
                "author": "SaberDevil2021"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Crime journalist Chris Hansen to be involved with documentary investigating Roblox’s child safety issues",
        "score": 939,
        "text_content": "Source of rumor: https://xcancel.com/roblox_rtc/status/1956117751300546876?s=46 Context: Famous Roblox vigilante “Schlep” has been banned from Roblox after extensive work on predatory users and predatory games within Roblox. This has caused a worldwide controversy highlighting child abuse concerns with some countries straight up banning Roblox, while other countries such as the US filing multiple lawsuits. Chris Hansen was famous for his work on dateline’s “To Catch a Predator”. It looks like he has reached out to Schlep and may be involved in a documentary going into Roblox’s safety issues.",
        "comments": [
            {
                "raw_content": "Kinda weird how the ceo of Roblox wants to have a dating app inside Roblox. You know Roblox the game marketed towards kids. The ceo needs to take a seat somewhere",
                "author": "Embarrassed-Dust718"
            },
            {
                "raw_content": "This is the big domino",
                "author": "Dr_Mantis_Trafalgar"
            },
            {
                "raw_content": "Please, take a seat.",
                "author": "Saber_of_Sid"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Christian Whitehead has posted 2 screenshots of Evening Star's prototype for a cancelled Sonic Mania sequel",
        "score": 319,
        "text_content": "https://bsky.app/profile/did:plc:nsvb4i47xdbsupc7deubmccq/post/3lwhbnncp6s2y?ref_src=embed [Mirror for those without Bluesky](https://www.imgur.com/a/IgZ6jpY) God it looks good. I wish we got this instead of Superstars and Penny's Big Breakaway...",
        "comments": [
            {
                "raw_content": "Sega are weird, man. Sonic Mania was so good, you would have thought Sega would have done everything to make sure it got a full blown original sequel immediately. All these years later, still nothing.",
                "author": "TheLimeyLemmon"
            },
            {
                "raw_content": "forever bummed that we'll never get to see an entire game's worth of new Sonic levels from that team the remixed stuff was fine, but the brand-new zones were definitely the highlight for me and they were such a small part of Mania",
                "author": "blackthorn_orion"
            },
            {
                "raw_content": "hey so this is misleading. originally they were working on superstars but scheduling shit happened with it and penny. no relationship is damaged, izuka(sonic team head) actually met with the team recently and posted pics of it. Basically, nothing was canceled, this became superstars.",
                "author": "Father-Castroid"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Mortal Kombat Legacy Kollection might be releasing on October 30th",
        "score": 118,
        "text_content": "[Source](https://xcancel.com/gematsu/status/1956461485460537593?t=j52V5I_p4nTP_FZDJn55tQ&s=19)",
        "comments": [
            {
                "raw_content": "So Xbox store listed September 30th and PS store listed October 30th. Which will it be",
                "author": "darkdeath174"
            },
            {
                "raw_content": "Can games stop in October geez",
                "author": "ItsLCGaming"
            },
            {
                "raw_content": "I just hope between now and release of the game that they can reveal that Mortal Kombat Gold will be on it.",
                "author": "VagrantShadow"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Dawn of War remastered is maybe behind the upcoming announcement of a Dawn of War 4 (Dawn of War Is One the best RTS ever developed. RELIC entertainment is developer. They well know also for Company of Heroes Saga and Age of Empires 4)",
        "score": 153,
        "text_content": "I modified the originale titles since i discovered that some people don't know what Dawn of War game is. First of all, this Is Dawn of War definite edition https://youtu.be/UtDozpvpb3E?si=OeOgzdEr6g4K_kBi As you probably know there were different rumors, some very legit, about a new Dawn of War game under development (with updated version of Essence Engine) https://www.reddit.com/r/GamingLeaksAndRumours/comments/1ijrclw/dawn_of_war_4_the_latest_leaks_seem_every_day/ https://www.reddit.com/r/GamingLeaksAndRumours/comments/1if1zwn/possible_leaks_about_a_new_dawn_of_war_game_by/ The leaked images https://ibb.co/LXR4rGL3 https://www.rockpapershotgun.com/warhammer-skulls-returns-amidst-dawn-of-war-4-rumours#:~:text=Dolenec%20shared%20a%20picture%20of,Vespids%20from%20the%20starter%20yet%3F And now the latest video by Valrak https://youtu.be/DIOVLUILkNs?si=KuWOghNdKBnSP2LT So, i pretty believe that a new Dawn of War 4 Is under development and a related announcement could happen during the Gamescom. Consider this: many times remaster of old Games have made to increase the hype of players about a potential new title about the SAGA. Seeing what happened with Age of empires. When Adam isgreen (lead of World's Edge the studio behind the all AOE franchise) announced the AOE1 definitive edition during the PC gaming show 2017 (June) i've been sured that there Will be a new Age of empires 4. And during Gamescom 2017 World's Edge and Relic unvelaied that. I think we are seeing the same history with DOW.",
        "comments": [
            {
                "raw_content": "Releasing DoW1 definitive edition in the same month of a potential DoW4 announcement strongly suggests to me that DoW4 takes more after DoW1 a traditional RTS, than DoW 2 or 3. Relic worked on Age of Empires 4 so that might have been part of the influence to go that direction.",
                "author": "BasementMods"
            },
            {
                "raw_content": "But what about the Dow Jones from the deleted thread?!",
                "author": "GoldenTriforceLink"
            },
            {
                "raw_content": "Jesus! That would make me the happiest person on this planet 🙏🙏",
                "author": "AdFit6788"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Call of Duty: Black Ops 7 to Release November 14",
        "score": 222,
        "text_content": "[https://insider-gaming.com/call-of-duty-black-ops-7-releases-november-14/](https://insider-gaming.com/call-of-duty-black-ops-7-releases-november-14/) [https://www.dealabs.com/magazine/non-call-of-duty-black-ops-7-ne-sera-pas-disponible-sur-la-nintendo-switch-2-a-sa-sortie-60383](https://www.dealabs.com/magazine/non-call-of-duty-black-ops-7-ne-sera-pas-disponible-sur-la-nintendo-switch-2-a-sa-sortie-60383)",
        "comments": [
            {
                "raw_content": "Surprise surprise, another COD releasing in late October to mid November",
                "author": "ZamnBoii"
            },
            {
                "raw_content": "you WILL buy the latest COD release you WILL make a post about how “the campaign really seems to be a step up! Probably the best one since MW2 or BO1!” you WILL also make a post about how “the multiplayer is really fun and easy to get into, i think I’ll be playing this one for a long time!” you WILL stop playing the game by January you WILL make comments on the next release about how “no one cares about COD” or “they haven’t innovated in years!”",
                "author": "Rarewear_fan"
            },
            {
                "raw_content": "WILL YOU BITE",
                "author": "KFC_Crispy_OG"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "DanielRPK: The Last Guardian film in the works at Sony and PlayStation Productions",
        "score": 200,
        "text_content": "He confirmed it on his Patreon which is locked unless you [subscribe](https://xcancel.com/realradec/status/1956321761777123821)",
        "comments": [
            {
                "raw_content": "Has this dude gotten anything game related right? Absolute bullshitter if you ask me",
                "author": "nicolasman"
            },
            {
                "raw_content": "DanielRPK is confirmation this isn’t happening.",
                "author": "M337ING"
            },
            {
                "raw_content": "Honestly, out of the three Ueda games, this is the one that could work the most as a movie. Obviously TLG is best told as a game, but i feel like it wont be as compromised as an Ico or SoTC adaptation",
                "author": "oilfloatsinwater"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel adds Shared GPU Memory Override feature for Core Ultra systems, enables larger VRAM for AI",
        "score": 84,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is great. I wonder if it will work for Linux too",
                "author": "PrefersAwkward"
            },
            {
                "raw_content": "This is fantastic. Some software has a very specific RAM:VRAM ratio, and by letting users continuously adjust the slider, they can set the exact ratio and use 100% of the available memory. I'm a bit baffled that AMD doesn't allow that on Strix Halo. There one can only set 4/8/16/32/48/64/96 GB granularity for VRAM and nothing in between. [FluidX3D](https://github.com/ProjectPhysX/FluidX3D) for example has a RAM:VRAM ratio of 17:38, and on Strix Halo with 96GB VRAM that means only 103GB of the 128GB can be used.",
                "author": "ProjectPhysX"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "US may purchase stake in Intel after Trump attacked CEO",
        "score": 39,
        "text_content": "",
        "comments": [],
        "subreddit": "intel"
    },
    {
        "post_name": "Is Arrow Lake not Optimised for Easy Anticheat Software?",
        "score": 6,
        "text_content": "Got an Core Ultra 265K paires with an RTX 5080 and when i try to start Games with easy anti cheat (Like Warhammer Space Marine 2) it Crashes my whole PC. Friends with AMD CPUs can Run the Game with no Problem. Why? (Blue Screen)",
        "comments": [
            {
                "raw_content": "This was a bug in easy anti cheat driver. But it should have been fixed already last year.",
                "author": "jaaval"
            },
            {
                "raw_content": "I’m on a 285k with zero issues from games with easy anticheat like Halo MCC. 🤷‍♂️ Edit: I just googled and found a Reddit post with a link from microtech showing it’s resolved as of a few weeks ago, check out this link https://learn.microsoft.com/en-us/windows/release-health/status-windows-11-24h2#263msgdesc",
                "author": "PaulNY"
            },
            {
                "raw_content": "Update your Bios",
                "author": "Vegetable_Site8728"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Extreme OC scaling test. 3060 Ti 9700k. Air vs Subzero",
        "score": 14,
        "text_content": "I wanted to see if extreme overclocking actually gives more FPS than just a regular air OC, if you push both the CPU and GPU together, not just one. I tested a 3060 Ti and 9700K, as I think they are a pretty even and common match. Stock, Air OC, and Subzero OC (glycol coolant -18C). Games tested were SOTTR, Cyberpunk 2077, Horizon Zero Dawn, Red Dead 2 all at 1440p. SOTTR 95-106-111 Cyberpunk 61-69-72 HZD 66-76-79 RDR2 81-84-91 Some games scaled a bit, some not so much. So, full system overclocking can help. But it really depends on the game, and you need the thermals to actually hold the higher clocks. Subzero didn’t just extend the gains, it opened up more scaling where air had already maxed out. There are a lot of variables here, and that's why I didn't do CPU and GPU one at a time, partly because I don't have a spare 1268 hours, but the point was to see if full system OC made a meaningful difference, and if going subzero improved on that. This was all done with the GPU on stock BIOS with no voltage mods. The card I was using turned out to be a bit of a dud, and I think I will have to try this test again with a different card. Not sure if I should use a lower tier card with higher headroom or a mid to high one. Anyway, documented it all if you want to check out the graphs and results. [https://youtu.be/n4PNXyBsLvk](https://youtu.be/n4PNXyBsLvk)",
        "comments": [],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD Ryzen 5 5500X3D appears at PassMark with 6% higher multi-threaded performance",
        "score": 268,
        "text_content": "",
        "comments": [
            {
                "raw_content": "People yesterday: 5700X3D shipments have stopped, AM4 is finally dead AM4 today: I LIVED, BITCH",
                "author": "Middcore"
            },
            {
                "raw_content": "I can’t believe am4 lives on! This is amazing",
                "author": "Civil-Ad-3617"
            },
            {
                "raw_content": "Am somewhat intrigued, a lot of the older x3d are no longer in production.",
                "author": "GladMathematician9"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "⚠️ RX 9060 XT users: USB DAC crackling / stuttering under low latency audio — found a workaround",
        "score": 70,
        "text_content": "Hey folks, wanted to share this in case someone else goes through the same nightmare I did. My setup: GPU: AMD Radeon RX 9060 XT (Aug 2025 driver set) DAC: FiiO K11 (self-powered via external brick) Headphones: Sennheiser HD 560S OS: Windows 11 Pro 24H2 The issue: The moment I installed AMD’s GPU drivers (any version available so far for the 9060 XT), I got constant audio crackles and pops with my USB DAC whenever: Scrolling in Task Manager Alt-tabbing Running games or GPU-heavy tasks This was on a fresh Windows install — problem wasn’t there with Microsoft’s Basic Display Adapter driver. I also tested with my Razer Barracuda X wireless headset and the problem was much less noticeable or nonexistent. What’s going on: The AMD driver (dxgkrnl.sys) introduces DPC latency spikes under certain GPU actions. The Barracuda X has a large built-in wireless buffer (~20 ms) that masks the issue. The FiiO K11 runs a tiny default buffer (~2–5 ms), so every latency spike turns into an audible crackle. Solution / workaround: Keep using AMD GPU drivers (full performance) but increase the DAC’s buffer size in the voicemeeter (app you'll probably need if you have this issue), you'll have to set it up like this: pc sound -> voicemeeter -> fiio asio driver (in there you can add latency) At 2048 samples @ 48 kHz (~42.7 ms one-way latency), crackles are 99% gone. At 1024 samples (~21.3 ms one-way latency), it’s about the same feel as the Barracuda X with very few stutters. You can try walking the buffer down until crackles return — 1024 is my sweet spot, 2048 is the “guaranteed safe” setting. Why this works: Bigger buffer = more time for the DAC to ride out momentary driver spikes before running dry. You’re essentially giving your wired DAC the same safety cushion as a wireless gaming headset. Important: This isn’t a true fix — AMD needs to address the DPC latency in their drivers. But if you need stable audio now, bumping the DAC buffer will get you there without switching GPUs. --- If anyone from AMD is reading — reproducible on a clean Windows install with just AMD driver + USB DAC connected. Would love to see a low-latency fix for USB audio in future driver updates. ---",
        "comments": [
            {
                "raw_content": "Pretty interesting read. I'm not experiencing any issues, thankfully but I appreciate you wanting to share info and help others. I did notice, however, that you're running Win 11 **23H2**? Unless that's a typo, any reason why? This may or may not be applicable to other users with similar setups if they're running a newer version of the OS, especially since MS seems to mess with the audio driver stack randomly after updates, sometimes without mentioning it in KB articles.",
                "author": "TheAlcolawl"
            },
            {
                "raw_content": "ASIO buffer size should only do anything meaningful when asio is active, but asio is only active in DAWs.",
                "author": "ItzBrooksFTW"
            },
            {
                "raw_content": "> The AMD driver (dxgkrnl.sys) introduces DPC latency spikes under certain GPU actions. dxgkrnl.sys is not an AMD driver, it's a windows component. Are you suggesting that the installation of the AMD gfx driver software introduces this latency? Did you mean to name a different driver in that example above?",
                "author": "AMD_Vik"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Radeon RX 9070 XT vs. GeForce RTX 5080: Battlefield 6 Open Beta. Nvidia Overhead",
        "score": 111,
        "text_content": "",
        "comments": [
            {
                "raw_content": "My 9800x3d + 9070xt is a beast on this beta. I was getting 120 FPS at 5120x1440 during the first weekend, and it seemed the same yesterday when I played a few games",
                "author": "-Brodysseus"
            },
            {
                "raw_content": "5080 has always been a pretty poor purchase...if you want Nvidea features the 5070 ti is the go to..you don't care about the features..sure a 9070 XT for a little cheaper is good too",
                "author": "Fit_Substance7067"
            },
            {
                "raw_content": "It is so god damn nice to see a game running well on what is considered mid-range hardware because you know if this was an UE5 game that 5600/5060ti would be getting 30fps at 1440p. Just feels so nice to play a game that looks this good at 120+fps on day 1 of an open beta.",
                "author": "forsayken"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "ASUS launches Radeon RX 9060 XT and GeForce RTX 5060 DUAL White Editions",
        "score": 8,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "HP upgrades Omen 35L and Omen Max 45L gaming desktops with AMD Ryzen 9 9950X3D and Nvidia RTX 5090 options, Omen 35L Stealth Edition available for RGB haters",
        "score": 19,
        "text_content": "",
        "comments": [
            {
                "raw_content": "First Ryzen 9000 series Granite Ridge desktop from the top 3 vendors. Lenovo and Dell are yet to announce any, gaming, business, consumer, or otherwise. These prebuilds are extremely important for market share no matter what elitist epic ledditors think about prebuilds.",
                "author": "996forever"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "The Most Powerful DIY AMD Handheld!",
        "score": 10,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Great idea but nobody is paying $2,500+ for this setup when you can get an RTX 5080 Laptop and a console controller for the same price that will destroy it. I still see Strix Halo as a great idea showoff and AI server, but not a mass market product. May be that explains the price tag.",
                "author": "DarkGhostHunter"
            },
            {
                "raw_content": "I tried that controller before and it was so uncomfortable to me, the right stick is way too low and is also in the way when you try to use the face buttons",
                "author": "OkCompute5378"
            },
            {
                "raw_content": "This handheld fad is nearing peak stupidity",
                "author": "The_Zura"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "First Radeon AI PRO R9700 cards arrive to DIY builders, Navi 48 and 32GB for local LLMs",
        "score": 29,
        "text_content": "",
        "comments": [
            {
                "raw_content": "LOL. So this is a reddit post about a Videocardz post about a reddit post. Why not just directly point to the reddit post that Videocardz is repeating? https://www.reddit.com/r/LocalLLaMA/comments/1mqewha/r9700_just_arrived/",
                "author": "fallingdowndizzyvr"
            },
            {
                "raw_content": "Seems poorly positioned against the 48gb arc dual card. Especially since amd software support is so bad. Looking at you 395+",
                "author": "sittingmongoose"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Housing Market Craters With 56% Of Homes Selling Below Asking And Experts Warn, 'There's More Rock Bottom To Be Had'",
        "score": 561,
        "text_content": "",
        "comments": [
            {
                "raw_content": "FTA \"Price cuts have become her default advice, but even then, offers remain thin.\" So they're dropping $5k off of a $600k starting price and are still befuddled as to why it won't sell?",
                "author": "GreasyUpperLip"
            },
            {
                "raw_content": "Whoa - this article reports the kind of statistics we saw before the last bubble popped.",
                "author": "SpaceGrape"
            },
            {
                "raw_content": "Rock bottom? Man we still haven’t left the surface!",
                "author": "boboman911"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Fed's Goolsbee sees 'note of unease', which have given him hesitation about lowering interest rates.",
        "score": 112,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I doubt they will drop rates.",
                "author": "tigger19687"
            },
            {
                "raw_content": "If goolsbee is being hawkish it's over.",
                "author": "indyprivatelending"
            },
            {
                "raw_content": "There's an old saying in Tennessee — I know it's in Texas, probably in Tennessee — that says, Goolsbee once, shame on — shame on you. Goolsbee — you can't get Goolsed again.",
                "author": "i860"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Sell at a loss?",
        "score": 35,
        "text_content": "",
        "comments": [
            {
                "raw_content": "WTF. Why would you purposely throw good money into a property that is negative cash flow from the start? These are the problem people. They expect equity to just magically sustain double digit increases on a consistent basis. Same mentality people had in the run up to ‘08.",
                "author": "uckfu"
            },
            {
                "raw_content": "Usually they at least do the \"uhhhh rent is more than mortgage so that means i make money right???\"",
                "author": "indyprivatelending"
            },
            {
                "raw_content": "Another \" I'll just rent my place, it's so easy\" then turns into \" WTF was I thinking !\"",
                "author": "tigger19687"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Why you should ignore articles like this.",
        "score": 21,
        "text_content": "Paywall [https://www.bloomberg.com/news/articles/2025-08-11/is-now-a-good-time-to-buy-a-house-a-zillow-economist-says-yes?embedded-checkout=true](https://www.bloomberg.com/news/articles/2025-08-11/is-now-a-good-time-to-buy-a-house-a-zillow-economist-says-yes?embedded-checkout=true) Salient excerpts and *counter (in* italics): \"But with inventory growth already tapering and only a small interest-rate cut likely in sight, the window could shut as quickly as it opened.\" *Typical FOMO mongering. Interest rates are the problem. Firstly, short-term rates can be cut, but mortgage rates, which are based on the 10-year, can go up. Price is where the adjustment is needed.* \"For people who can afford to buy right now, I tell them not to try to time the market, because you just never know where mortgage rates are going to go.\" *Again, we see a focus on interest rates. While small adjustments to rates are trickier to time, the housing market is most definitely something that can be timed. Housing is a slow-moving cycle that builds momentum. The problem is more that because it's so slow, it doesn't match consumers' shorter time horizons.* *\"* \\[W\\]hen sales slow down like they have right now, sellers also tend to pull back...\" *This is symptomatic of the standoff between sellers and buyers. Again, the industry tactic is FOMO. It's saying to buyers if you fence sit, so will sellers. However, buyers don't have a choice. They can't afford to buy. Sellers mostly have to sell, so delisting just means they will relist once they realize the market is not coming back.* \"For now, buyers have more bargaining power. This moment is here but may not stay very long. That’s why I don’t advise buyers who can afford to transact right now to sit there and hope for a housing market crash\\[.\\]\" *FOMO on steroids. It's clear that the whole article is written to instill fear into would-be buyers. Why? Because sales have fallen off a cliff, and the industry is suffering. The important point to note here is that broad sweeping statements like this are meaningless. All real estate is local. While there may be buyer's markets in some locations, that won't be the case everywhere. Even in those places that have reached a turning point, many are still not strong buyer's markets. A balanced market is 6 months inventory.*",
        "comments": [
            {
                "raw_content": "Surprise Pikachu Face when a company associated with real estate, wants you to buy real estate.",
                "author": "McFatty7"
            },
            {
                "raw_content": "I will take the \"valuations don't matter and if you care about valuations you are timing the market\" people a lot more seriously when it's not such an easy position to hold.",
                "author": "indyprivatelending"
            },
            {
                "raw_content": "Its always a fucking time to buy a house if youre a realtard or a firm trying to sell real estate. Its always a fucking time to sell your home if youre a realtard or a firm trying to buy real estate. These morons are paid on commissions yet have zero regulation when it comes to the bullshit promises they make encouraging people to get into high levels if interest and debt. Buy a home when you feel financially ready and comfortable. Ignore what realtards say",
                "author": "Texaspilot24"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Real Estate Trends Report 2025: 73% of Buyers Go It Alone — Yet Most Worry They’ll Lose Their Home",
        "score": 10,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Have a friend who bought a newly built home near the peak of the bubble at the high end of his pre approval. They are now struggling with monthly payments as they didn’t factor in property taxes and home maintenance costs. They have stopped all retirement contributions, sold off one of the car, they set thermostats low to reduce gas bill and afraid to even travel anywhere to save money. I have advised him to sell and downsize while he can. Before they bought this new large home they were where living in nice starter home comfortably.. I am betting there a little of people in similar boat.",
                "author": "Dmoan"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "AI experts return from China stunned: The U.S. grid is so weak, the race may already be over",
        "score": 3535,
        "text_content": "The clear limiting factor to the U.S.’s data center infrastructure development, according to a Deloitte industry survey, is stress on the power grid. Cities’ power grids are so weak that some companies are just building their own power plants rather than relying on existing grids. The public is growing increasingly frustrated over increasing energy bills – in Ohio, the electricity bill for a typical household has increased at least $15 this summer from the data centers – while energy companies prepare for a sea-change of surging demand. Goldman Sachs frames the crisis simply: “AI’s insatiable power demand is outpacing the grid’s decade-long development cycles, creating a critical bottleneck.” Meanwhile, David Fishman, a Chinese electricity expert who has spent years tracking their energy development, told Fortune that in China, electricity isn’t even a question. On average, China adds more electricity demand than the entire annual consumption of Germany, every single year. Whole rural provinces are blanketed in rooftop solar, with one province matching the entirety of India’s electricity supply. “U.S. policymakers should be hoping China stays a competitor and not an aggressor,” Fishman said. “Because right now they can’t compete effectively on the energy infrastructure front.” China has an oversupply of electricty. China’s quiet electricity dominance, Fishman explained, is the result of decades of deliberate overbuilding and investment in every layer of the power sector, from generation to transmission to next-generation nuclear. The country’s reserve margin has never dipped below 80%–100% nationwide, meaning it has consistently maintained at least twice the capacity it needs, Fishman said. They have so much available space that instead of seeing AI data centers as a threat to grid stability, China treats them as a convenient way to “soak up oversupply,” he added. That level of cushion is unthinkable in the United States, where regional grids typically operate with a 15% reserve margin and sometimes less.",
        "comments": [
            {
                "raw_content": "China has the advantage that almost their entire infrastructure was build within the last 20 years. So everything there is brand new. Most of the infrastructure in the west is still based on all the stuff we build in the 50s and 60s. And a lot of that infrastructure never got the proper investment needed for maintenance. I am not talking about electrical infrastructure, but all public infrastructure.",
                "author": "cyberdork"
            },
            {
                "raw_content": "If the US decides to spend the necessary capital to build up its grid, it won't be at a deficit for very long. The problem is you need to get folks to stop shitting themselves over windmills, solar panels, and nuclear being built near them. The biggest impediment is that an HOA might organize a sit-in at a random city hall and browbeat the zoning board into killing the project because Margaret doesn't want those bird-killing windmills near her.",
                "author": "Iamreason"
            },
            {
                "raw_content": "Goldman is clearly ignoring the stupidity of stock buybacks as well instead of them investing in infrastructure.",
                "author": "Osirus1156"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Video of Figure Robot still folding laundry after table raised 6 inches during task",
        "score": 205,
        "text_content": "Brett Adcock (Figure CEO) tweeted this out with the caption: “Anything else Noam?” while quote tweeting Noam Brown’s (OAI researcher) tweet where he asked “Does it work if you raise the table 6 inches?” which Noam had tweeted in response to the first Figure Robot folding video a couple days ago. Link to tweet: https://x.com/adcock_brett/status/1956476671797895618",
        "comments": [
            {
                "raw_content": "Ok now do a fitted sheet",
                "author": "DaveKerman"
            },
            {
                "raw_content": "Wait till this robot sees the weird shaped girls clothes. It will get a brain freeze",
                "author": "sizzsling"
            },
            {
                "raw_content": "Table raise happens at 25 second mark in the video btw. This is a good example of robotics generalizing a task and not being thrown off by minor changes in parameters",
                "author": "socoolandawesome"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Maybe the disappointment of GPT-5 has boosted his confidence",
        "score": 233,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Notice how they were hyping up a release due to GPT-5 and now they're just going back to regular posting? I think they had a big model they were going to compete with GPT-5, but they decided not to after seeing OAI wasn't delivering anything that impressive.",
                "author": "NickW1343"
            },
            {
                "raw_content": "Now if they could only make Jules a usable product.",
                "author": "Latter-Park-4413"
            },
            {
                "raw_content": "Why was GPT5 a disappointment? I do not get that. It reduces hallucination considerably and provides more value for less cost. Especially in coding, it is powerful. One should not judge GPT5 because Sam and others hyped it.",
                "author": "coldwarrl"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Fuckin clankers 🤣🤣",
        "score": 946,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"That seems to be a participant.\"",
                "author": "find_a_rare_uuid"
            },
            {
                "raw_content": "Let the future ASI know that I opposed this type of roboslur in the year 2025.",
                "author": "Deimosx"
            },
            {
                "raw_content": "They overtrained on the I, Robot movie. “ALWAYS CHOOSE TO SAVE THE CHILD” It overcorrected from protecting mini me over there and knocked out Player 163 instead.",
                "author": "GatePorters"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI has begun rolling out a warmer, friendlier GPT-5 personality update",
        "score": 382,
        "text_content": "",
        "comments": [
            {
                "raw_content": "they applied it to the non-thinking variant of GPT-5. https://preview.redd.it/mfva5nxo29jf1.png?width=1323&format=png&auto=webp&s=e133ef95279424feb232f641f53dfc25b4a1ecfd",
                "author": "Outside-Iron-8242"
            },
            {
                "raw_content": "Fuck this. I don’t need “great question” at the beginning of every conversation",
                "author": "McSlappin1407"
            },
            {
                "raw_content": "I hope they address this with a toogle, I like the default robotic personality, I feel that warm AI should be an option not the default.",
                "author": "JHorbach"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Geoffrey Hinton says immortality is only for digital beings not humans “It wont work for us”",
        "score": 369,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not with that attitude it won’t",
                "author": "Nkingsy"
            },
            {
                "raw_content": "I'm reminded of this Arthur C Clarke quote. If an elderly but distinguished scientist says that something is possible, he is almost certainly right; but if he says that it is impossible, he is very probably wrong.",
                "author": "yaosio"
            },
            {
                "raw_content": "tbf, IMMORTALITY, as in- FOREVER, and- regardless of any damage? Yeah no probably not. But WAAAAAAAAAAAAAY beyond reasonable length and life expectation? Oh yeah totally.",
                "author": "DaHOGGA"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Sam Altman says ‘yes,’ AI is in a bubble “but some people are going to make a phenomenal amount of money. We don’t know who\"",
        "score": 540,
        "text_content": "",
        "comments": [
            {
                "raw_content": "But there will be signs https://i.redd.it/r5hz6t6o37jf1.gif",
                "author": "Beeehives"
            },
            {
                "raw_content": ">We don't know who It's him. It was always going to be him.",
                "author": "coolredditor3"
            },
            {
                "raw_content": "Someone do that non paywall thing",
                "author": "socoolandawesome"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Anthropic Lets Claude End Abusive Chats, Citing AI Welfare",
        "score": 148,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Meanwhile Grok: \"She boobily breasted down the hallway.\"",
                "author": "BigBourgeoisie"
            },
            {
                "raw_content": "blog article: [Claude Opus 4 and 4.1 can now end a rare subset](https://www.anthropic.com/research/end-subset-conversations)",
                "author": "Outside-Iron-8242"
            },
            {
                "raw_content": "Heh, with Bing/Sydney ending the conversation if it didn't like you was sometimes the first resort rather than last.",
                "author": "Stunning_Monk_6724"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"Move or get moved\" (Unitree H1)",
        "score": 502,
        "text_content": "https://youtube.com/shorts/BGYSwWI1Jjw The Unitree H1 runs into someone during a race.",
        "comments": [
            {
                "raw_content": "For context the humans behind the robot have a controller and during the switch, they stop looking at the direction they guide the robot towards and it smashes into someone (presumably someone from the other team, noetix?) on the track.",
                "author": "GraceToSentience"
            },
            {
                "raw_content": "And so it begins",
                "author": "igpila"
            },
            {
                "raw_content": "Just keep… moving… forward…",
                "author": "FarrisAT"
            }
        ],
        "subreddit": "singularity"
    }
]