[
    {
        "post_name": "I have a serious question, why are we allowing this in America? This is Michigan. Part of Islam is to run for office, take over governments they migrate to and then implement Sharia Law. WHY is this being allowed to spread in America?",
        "score": 957,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What am I supposed to drive half way across the country and just start dropping somalis? I'm down but I'm not going first",
                "author": "RudeFrog"
            },
            {
                "raw_content": "\"The price good men pay for indifference to public affairs is to be ruled by evil men.\" ~ Plato",
                "author": "HappyFunBall"
            },
            {
                "raw_content": "Because it wasn't up to me. I wouldn't have let one of them in here.",
                "author": "airborne3502"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Except what is written and broadcast in the Fake News, I now have the highest poll numbers I’ve ever had, some in the 60’s and even 70’s. Thank you. MAKE AMERICA GREAT AGAIN!!!",
        "score": 879,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He has certainly earned them. What a tremendous start right out of the blocks. Three more years, and the rest of this one, feels like an eternity at the pace he's going.",
                "author": "airborne3502"
            },
            {
                "raw_content": "\"Trump claims without evidence his approval rating is 60 or 70 percent. Here's what we at CNN found: Trump approval rating is 59%, 95% republican and 36% democrat approve of Trump's handling of jobs, the economy, peace, and immigration\" --zero self awareness CNN probably",
                "author": "Light_HIV_Effect"
            },
            {
                "raw_content": "We did it, we fucking did it Congrats MAGA",
                "author": "YodaBannon"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Secretary Sean Duffy : 🚨 Big news! @USDOT is cracking down on states & carriers ignoring trucker safety rules. Non-compliance will have serious consequences.",
        "score": 768,
        "text_content": "",
        "comments": [
            {
                "raw_content": "make it illegal for illegals to operate vehicles on interstate highways. if they have a state driver license, then enhance the punishment to a stay at CECOT",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "No, start with the consequences NOW. Not in two more weeks, fucking now.",
                "author": "Doritalos"
            },
            {
                "raw_content": "Do an immediate forced English proficiency test on all truckers and fire and jail everyone who fails. Then our roads will finally be safe.",
                "author": "Simpadoodledoo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Roger Stone: This dumb fuck",
        "score": 383,
        "text_content": "",
        "comments": [
            {
                "raw_content": "have they considered locking the criminals up?",
                "author": "Raetchel"
            },
            {
                "raw_content": "Link https://x.com/RogerJStoneJr/status/1959823540716237062 Roger Stone is right >Mayor blames Richard Nixon for Chicago’s intractable violence https://cwbchicago.com/2024/07/mayor-blames-richard-nixon-for-chicagos-intractable-violence.html",
                "author": "I-am-Orlando"
            },
            {
                "raw_content": "Say it Roger, \"This dumb ni-\"",
                "author": "LibtardsAreTrash"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I have a Constitutional Right to appoint Judges & U.S. Attorneys, but that RIGHT has been completely taken away from me in States that have just one Democrat United States Senator. This is because of an old & outdated “custom” known as a BLUE SLIP, that Senator Chuck Grassley refuses to overturn.",
        "score": 1000,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Any Republican that uses this so called Blue Slip option, should be ashamed of themselves. You are doing the work of the enemy for them.",
                "author": "Landslide_2020"
            },
            {
                "raw_content": "It’s exhausting have to fight Democrats *and* Republicans",
                "author": "realPhantomFuck"
            },
            {
                "raw_content": "Remember who they are come midterms. No consequences no change.",
                "author": "JimmyRussler"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "It would be irresponsible to NOT destroy you.",
        "score": 1698,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Be the Enemy that the tools of Satan claim you are.",
                "author": "Taqiyya_Mockingbird"
            },
            {
                "raw_content": "Hang 'em high",
                "author": "3DogNight"
            },
            {
                "raw_content": "Killers playing the “but please don’t kill me, I only killed a few of your people first!” Card. Classic narc move.",
                "author": "gunteh"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump stopped his golf cart today to give a little boy what appears to be one of his custom presidential sharpies.",
        "score": 1125,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I love that he still drives his own cart. Man of the people!",
                "author": "OK_Parmaker"
            },
            {
                "raw_content": "Trump actually really does love the people and loves interacting with them.",
                "author": "Ronaldus"
            },
            {
                "raw_content": "I VOTED FOR THIS",
                "author": "TEXinLA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "​Firms like BlackRock are engineering the housing crisis. They buy entire developments, sell a few homes to themselves at inflated prices to create fake comps, then convert them all to high-priced rentals. You get priced out while they leverage their artificially inflated assets.",
        "score": 722,
        "text_content": "",
        "comments": [
            {
                "raw_content": "and those homes neeeeeeeeeeeeever hit the market ever again. They're forever rentals.",
                "author": "AccipiterQ"
            },
            {
                "raw_content": "This is faggot-tier \"eat the rich\" reddit rentoid logic. Large corporate buyers are a single-digit percentage of the housing market. Reality is that regulations have killed single-family development in blue states, making multifamily rentals the only good way to profit - while people are flooding to red states, where housing supply cannot keep up with demand. All the while, powell is sabotaging interest rates, crushing market inventory because people can't move out of their homes (who the fuck wants to pay 6%+ interest when I have a 2.4% right now?). You want more housing? Incentivize affordable single-family construction and make loans cheaper.",
                "author": "LawyersPlayDota"
            },
            {
                "raw_content": "I saw this as a county building inspector. The whole thing is a shell game and you won't win.",
                "author": "FusionBlack"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Now Comes the California Fire Sale: China-Based Company Is Buying Up Land Incinerated by Firestorms",
        "score": 1015,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You would think that this could have been the plan all along? LOL newsome and the left in general are completely compromised. it's actually insane this is legal.",
                "author": "crimsontsunami"
            },
            {
                "raw_content": "Those damn conspiracy theorists.",
                "author": "BadBrainsBuzzcocks"
            },
            {
                "raw_content": "This needs to be absolutely banned.",
                "author": "ThePatriotGames2016"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "DNI Tulsi Gabbard has courageously and meticulously exposed a seditious conspiracy that began in 2016 and has run for 9 years......... That trial belongs in Florida—where they’ll get fairness, but I predict each will be convicted of seditious conspiracy to commit treason........ The names ⬇️",
        "score": 1259,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is it just me, or does anyone else remember when people were saying that Tulsi would be a horrible choice for a position in President Trump's administration?",
                "author": "Landslide_2020"
            },
            {
                "raw_content": "What is the punishment for treason, exactly?",
                "author": "Sea_Still"
            },
            {
                "raw_content": "What's the point of the microphones if they post potato audio?",
                "author": "CDean"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Indian MP Harsimrat Badal calls on India to intervene on behalf of Harjinder Singh (kiIIed 3 Americans)",
        "score": 892,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We need serious deportations of h1bs, illegals and all on visas. Gtfo already.",
                "author": "Here_we_go"
            },
            {
                "raw_content": "True or false: More than 50% of the country of India is without sanitation. True or false: The largest river in India is not filled with water. It is filled with garbage and human waste. True or false: Bringing third world denizens to a first world nation is of no benefit at all to the first world. Rather, it benefits those that stand to gain from exploiting a mentally handicapped population through slavery.",
                "author": "Zhongda"
            },
            {
                "raw_content": "Dear India, Thank you for confirming that we must stop all Indian immigration immediately, much appreciated.",
                "author": "YellowCrazyAnt"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "TRUMP: The Appellate Court removed incompetent Judge Engoron, but he refused to go, or even to acknowledge them. He’s a highly overturned, CROOKED Judge, who is retiring into a life of lawsuits, along with his Chief Clerk, soon! He is almost as Corrupt as Leticia James, but not quite! President DJT",
        "score": 1284,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wait what? He’s been REMOVED?!?!?",
                "author": "MAGAguitar"
            },
            {
                "raw_content": "Engoron is a creepy pedo who goes into the gym and takes pictures of girls younger than his nieces.",
                "author": "KennyKetchem"
            },
            {
                "raw_content": "https://truthsocial.com/@realDonaldTrump/115085538447688269",
                "author": "Looniz74"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "USDA Ends Solar Subsidies On American Farmland. The USDA said these changes will reduce taxpayer costs, eliminate market distortions from subsidies, and ensure renewable energy equipment in USDA projects comes from American manufacturers.",
        "score": 1016,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There should never be solar on usable farmland it just wastes the land they're on. If we're going to be putting solar everywhere, it belongs on parking lots and roofs of structures.",
                "author": "PeregrineFalcon"
            },
            {
                "raw_content": "Farmland loss is a massive national security concern that needs to be addressed. It is mostly fueled by retarded suburban sprawl - especially homes on 5-10 acres in good growing zones - though solar \"farms\" contribute as well.",
                "author": "Geralt_of_Rivia1"
            },
            {
                "raw_content": "Reduce the market?!? Oh no! The Solar Bears will die!!",
                "author": "MAGAguitar"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Tiktoker claims people in Olympia, Washington are arming up with guns and knives and preparing to ambush ICE if they come to their town.",
        "score": 932,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Theyre gonna bring knives and pistols to a rifle fight against guys with level IV armor.",
                "author": "NamendaBiden"
            },
            {
                "raw_content": "Believable. Olympia is a college town filled with deranged leftists.",
                "author": "boreal_storm"
            },
            {
                "raw_content": "Well considering Olympia is one of the crackhead meth fucking dens of Washington look at him mother fuck is higher than a kite with those zits when he's 30. Oh no we're Fair scared of a bunch of fucking tweakers! Guarantee that ain't going to work out well for him fucking morons",
                "author": "JayKay1776"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Democrats have LOST 2.1 million registered voters, while Republicans have GAINED 2.4 million.. Sheesh!! 🔥🔥",
        "score": 1311,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And we've only just begun. Get redistricting done and clean up the voter rolls even more and we won't lose an election for decades.",
                "author": "WhiteGhost"
            },
            {
                "raw_content": "Technically, the Democrats have lost 12 million voters. Where did those magical 10 million who voted for Biden in 2020 go? Did they just disappear into the aether in 2024?",
                "author": "Keiichi81"
            },
            {
                "raw_content": "# (D)ominion gained 4.5 million",
                "author": "Justlooking250"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "WOW: Cuban-born businessman Joseph Hernandez, whose family escaped communism, is running to CRUSH socialist Zohran Mamdani in the NYC mayor’s race.",
        "score": 1163,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So many people are going to run against this asshole that he's going to get elected with like 15% support. Run one candidate and actually get behind him",
                "author": "magapatriot_pa"
            },
            {
                "raw_content": "Cool, but how about a white Christian right wing man? Would it kill us to have one of those?",
                "author": "KOMMISSARofMAGA"
            },
            {
                "raw_content": "He might be based, but no more foreign born ever",
                "author": "Seatacjoe"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "California is #1",
        "score": 994,
        "text_content": "",
        "comments": [
            {
                "raw_content": "considering most retarded californians believe him, he can say whatever he wants and they clap like actual retarded seals.",
                "author": "Ihateeveryone2"
            },
            {
                "raw_content": "Newsom uses bots for likes. That's not organic.",
                "author": "CyanScales"
            },
            {
                "raw_content": "CA population is declining this decade for the first time in history. Pretty much all you need to know.",
                "author": "boreal_storm"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "HEGSETH REVOKES GEN. MILLEY'S SECURITY DETAIL AND ORDERS REVIEW",
        "score": 286,
        "text_content": "",
        "comments": [
            {
                "raw_content": "While this is a good news. Counterpoint: Why the ever loving FUCK did it take THIS LONG to do so. It's like some of these things are done by accident.",
                "author": "Zhongda"
            },
            {
                "raw_content": "He had a back channel to the CCP... he needs to be arrested.",
                "author": "ChyNahAzzWhole1"
            },
            {
                "raw_content": "He sure as fuck did break the chain of command. ...and the way he wears that hat pisses me off when no one else is authorized to wear a '50 mission crusher'...",
                "author": "Moebius"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🇲🇽 Mexican Senator Lilly Téllez went on Fox & dropped a truth bomb: “Most Mexicans want U.S. help against the cartels — the only ones who don’t are narco-politicians.” And who blows a gasket? President Sheinbaum, calling her a traitor. Those who scream the loudest.",
        "score": 457,
        "text_content": "",
        "comments": [
            {
                "raw_content": "President Sheinbaum was installed by the globalist with the help of the Cartels, you will never convince me that Mexican men and most Mexican woman voted for a weak woman and a Jewish woman, not a chance.",
                "author": "TheGreenDragon"
            },
            {
                "raw_content": "Sheinbaum is a Cartel stooge. We know this because she's not dead. Mexicans didn't vote for her, the Cartels installed her. The Cartels control elections in Mexico. Everyone knows this.",
                "author": "Moebius"
            },
            {
                "raw_content": "Sheinbaum appears to be a dude. A cartel puppet, he made a direct threat against based Mexican senator Lilly Tellez. . .what I pray is for Lilly's safety and to eventually see HER as the president of Mexico. What a turnaround that would be! President Tellez. ~ 24 Aug 2025",
                "author": "FreeFire"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Alec Baldwin KlLLED more people than were murdered in DC in the last 10 days.",
        "score": 1780,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’m loving all the panic amongst blue city mayors as they bray about projecting their citizens against tyranny. Bitches, y’all’s cities have been anarcho-tyrannies for decades!",
                "author": "RuprechtThaMonkeyBoy"
            },
            {
                "raw_content": "Had you done what Baldwin did - you would in jail. Even if is was all accidental.",
                "author": "Bullet3250"
            },
            {
                "raw_content": "I like the reports of people thanking the Trump administration for cracking down on crime. I bet the dems consider those people traitors and fascists for not wanting crime.",
                "author": "KekistanPM"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This 18-Year-Old TEC Cooler Beat My Noctua Air Cooler | der8auer",
        "score": 34,
        "text_content": "",
        "comments": [
            {
                "raw_content": "der8auer compared with \"the Noctua NH-D9 something\" said 8 minutes in. [https://youtu.be/3NFJNYHoyMY?t=488](https://youtu.be/3NFJNYHoyMY?t=488)",
                "author": "0xdeadbeef64"
            },
            {
                "raw_content": "Ambient vs Subambient cooling is basically the definition of clickbait. I wonder how many people upvoting this know that TEC/Peltier cooling is sub-ambient and draws a ton of power.",
                "author": "79215185-1feb-44c6"
            },
            {
                "raw_content": "Interesting. There are two quasi-parallel cooling circuits. The coldplate is heated from one side by the CPU, and cooled internally by heatpipes from finstack 1, *also* from the back side by the TEC. The TEC hot side is cooled by heatpipes from finstack 2. Airflow is first through finstack 1 then 2 in series. It seems to \"work\", although I wonder how it would compare to an otherwise-physically-identical cooler with no TEC and all 4 heatpipes in the coldplate. I've had shower thoughts about a similar idea for a TEC-boosted water loop, where coolant flow is radiator -> TEC cold -> CPU -> TEC hot. The theory being that the TEC would only be getting the water a little colder and not have to pass the full TDP of the CPU, plus if the TEC failed or was overwhelmed you could cut the power and it would gracefully degrade to a normal loop.",
                "author": "VenditatioDelendaEst"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Honor MagicBook Art 14 (2025) Review (Translated)",
        "score": 1,
        "text_content": "Originally from [https://mp.weixin.qq.com/s/HBLD5Fi0GX0tL\\_jju358VQ](https://mp.weixin.qq.com/s/HBLD5Fi0GX0tL_jju358VQ) *(translated & adapted from 笔吧评测室 / Laptop Commentary Studio)* **Quick Specs:** * Intel Ultra 5 225H (Arrow Lake) * 32GB LPDDR5x 8400 MT/s (soldered) * 1TB PCIe 4.0 SSD (1×M.2 slot) * 14.6\" 3120×2080 OLED, 120Hz, 100% DCI-P3, AR anti-reflective coating, touch-enabled * 60Wh battery, 1.03kg chassis, 12.7–13.6mm thick * Ports: TB4 (80Gbps, PD65W, DP2.1), USB-C (40Gbps, PD65W, DP2.1), USB-A 5Gbps, HDMI 2.0, 3.5mm combo jack * Charger weight: 191g * Price in China: ¥8499 ($1,170), with subsidy ¥6799 ($935) **Highlights:** * Extremely thin and light, premium build quality * Excellent OLED panel with AR coating → better outdoor readability than typical glossy OLEDs * Innovative magnetic clip-on webcam (screen bezels are ultra-thin, so camera is external) **Drawbacks:** * Runs warm under load (keyboard hot spot \\~44°C) * Keyboard surface picks up fingerprints * Battery capacity is modest at 60Wh **Performance & thermals:** Dual-fan, vapor chamber style cooling. * Stress FPU: CPU at \\~81°C, \\~26W sustained, P-cores \\~2.4–2.7GHz, E-cores \\~1.3–1.8GHz. * Noise: \\~43dB under full load. * Keyboard center peak temp: 44.4°C (on the G key). Palm rest stays cooler at \\~31°C. **Battery life:** \\~7h30m in simulated daily usage script. **Display quality:** * 120% DCI-P3 volume, 100% coverage, color-accurate (ΔE <1) * Max brightness \\~508 nits SDR / \\~765 nits HDR (below Honor’s marketing claim of 1600 nits) * Flicker: DC dimming above \\~85 nits, 4320Hz PWM below that **Why Arrow Lake instead of Lunar Lake?** The studio notes that this chassis *screams* Lunar Lake (super-thin, low thermal headroom, LPDDR5X-only). But Honor went with Arrow Lake because: 1. **Lower cost** – Arrow Lake reuses Meteor Lake board design with minor tweaks; Lunar Lake would require a new board. 2. **Roadmap risk** – Intel has confirmed Lunar Lake has no successor. Investing in a one-off platform is too costly for Honor. So from an OEM perspective, Arrow Lake = safer, cheaper, less risky. # My Verdict Lmao, another classic Honor moment — basically copying Huawei. The Huawei MateBook Pro X was one of the best Windows ultrabooks in 2024, but with U.S. sanctions cutting off future models, Honor clearly wants to capture that displaced buyer base. Arrow Lake does bring big efficiency gains over Meteor Lake, but this chassis is objectively a step down from Huawei’s 2024 effort — Huawei managed to stuff a **larger 70Wh battery at a lighter weight** with even better build quality. Still, given the current ultrabook landscape, Honor did produce a solid contender: * AR-coated OLED feels more comfortable than the sea of PWM-heavy Samsung OLEDs elsewhere * The design is sleeker and more modern compared to Lenovo ThinkBook/ThinkPad at similar price points, which stick to a more rigid “classic business” aesthetic If you want something that looks and feels closer to a MacBook but runs Windows, the MagicBook Art 14 (2025) is definitely worth a look — just don’t expect gaming performance or marathon battery life.",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Now that’s it’s been a few months, what’s your favorite and least favorite thing about the switch 2?",
        "score": 89,
        "text_content": "My favorite thing is probably how much better handheld feels. The switch 2 is FAR more comfortable than the switch 1, and the joycons aren’t drifting (at least yet), which has led to my handheld experience being far better. My least favorite thing is probably the lack of switch 1 upgrades. In my opinion, every game should have received an update that at LEAST upped the handheld resolution to 1080p. It makes handheld worse in a way it really shouldn’t be.",
        "comments": [
            {
                "raw_content": "Favorite thing is how many games run better Least favorite is how many games don't",
                "author": "OoTgoated"
            },
            {
                "raw_content": "Battery life sucks balls",
                "author": "Background-Tie2177"
            },
            {
                "raw_content": "I did'nt own Switch 1, but what I don't like the most about Switch 2 is how many shovelware games they have in Eshop. Looks like more than in Steam. What I like the most is Nintendo games (Zelda, Splatoon, etc)",
                "author": "Storm_Shadow_69"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "More Elden ring gameplay",
        "score": 115,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It looks okay docked but we need more videos on handheld play",
                "author": "Apprehensive_Row_161"
            },
            {
                "raw_content": "I so badly want this to be awesome in handheld mode. Getting it again just to play docked seems silly when I can just run through it again on ps5.",
                "author": "ChainChompBigMoney"
            },
            {
                "raw_content": "Visually it's extremely impressive but id rather it looked worse but had a stable 30",
                "author": "AverageAdam311"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Finished Odyssey and Bowsers Fury…what next?",
        "score": 20,
        "text_content": "I don’t like too huge of open world games that take forever to play which is why I’ve avoided Zelda. I think Odyssey was about the biggest game in terms of time and effort to complete that I’d like to do, but what’s a good suggestion? Right now I’m just playing quicker games like Madden and Crash Bandicoot 4. Switch 2 is my first Nintendo since N64, so I’m happy to try even more Switch 1 games.",
        "comments": [
            {
                "raw_content": "DK Banaza is a safe choice.",
                "author": "Sandy12315"
            },
            {
                "raw_content": "Play Kirby and the Forgotten Land when the Switch 2 version + expansion launches on Thursday",
                "author": "VampireInTheDorms"
            },
            {
                "raw_content": "3d all stars",
                "author": "Prestigious_Space489"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "New CRT filters looks so damn good. Feels like I have 42\" CRT in my room when I use these filters on my OLED. Can't wait for NS2 NES Classics update. It will probably get same filter than SNES when Nintendo updates the app. 4K resolution really helps to create convincing and beautiful CRT filter.",
        "score": 10,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This looks great ! Do you notice any performance improvement (less input lag) ?",
                "author": "maarten1000"
            },
            {
                "raw_content": "Are they updating the NSO apps? Really hope they do the GBA app too, if so",
                "author": "Pinkernessians"
            },
            {
                "raw_content": "It's still the same res, the filter was also updated on the Switch 1 and in Docked at least, NSO hasn't seen a resolution increase for the Switch 2. Not sure about handheld.",
                "author": "Touma101"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The September Direct would be the perfect time for S1 game update announcements",
        "score": 246,
        "text_content": "Free Switch 1 game updates are definitely overdue, but I think a couple announcements in the next direct could be really exciting. What do you think?",
        "comments": [
            {
                "raw_content": "I would love a Switch 2 version of Xenoblade Chronicles series!",
                "author": "vaulthead"
            },
            {
                "raw_content": "* Xenoblade Chronicles 1, 2, 3 and X * Mario Wonder * Luigi's Mansion 2 and 3 * Age of Calamity * Metroid Dread and Prime 1 Remaster * Kirby Star Allies and Return to Dream Land DX * Super Smash Bros Ultimate * Astral Chain * Pokémon Sword/Shield, Let's Go, Legends: Arceus and BDSP There are still a lot of games that could use a S2 upgrade.",
                "author": "PMC-I3181OS387l5"
            },
            {
                "raw_content": "Hope so, hope square enix updates the octopath in anticipation for Octopath 0, like they did with dragon quest 3. Makes a lot of sense to drop the next batch of nintendo exclusive upgrades in september since there is currently no game with a release date set for that month. Hoping for either one of the Xenoblade games, Fire emblem games maybe, mario wonder or metroid dread.",
                "author": "Vultouri03"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I wish N64 and GameCube games had the option for the original resolution",
        "score": 63,
        "text_content": "Ever since Nintendo's began doing N64 emulation, they've always had the resolution be much higher than original hardware. While most people probably find this to look better, I much prefer playing games at their original resolution. I really don't like it when early 3D games are rendered at high resolutions, since it makes their flaws much easier to see, and the 2D elements which are at their original resolution look much worse and clash with the 3D polygons. While this is a non-issue for most people, I hate how Nintendo just assumes that increasing the resolution is better for everyone and never includes an option.",
        "comments": [
            {
                "raw_content": "All I want is to remove the designed border and the player icon.",
                "author": "Fat_Stacks1"
            },
            {
                "raw_content": "I just want them to make the sides black for OLED users",
                "author": "Upper-Mixture8643"
            },
            {
                "raw_content": "The CRT filter actually does that or at least applies a pixelgrid overlay. Shame it doesn't work without the additional post-processing that's part of it.",
                "author": "AllEchse"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "For games like Mario Party Jamboree and Kirby Forgotten Land, what’s the “cheapest” way to get them digitally for Switch 2 upgrades?",
        "score": 17,
        "text_content": "So I see three options here: A) Use a Switch Online Voucher for those two and buy their upgrades, B) Wait for the Switch 1 version of those games to go on sale and then buy their upgrades, C) just wait for the Switch 2 Editions of those game to go on sale. So which one of these options is the best to get these games on the cheaper side digitally? Edit: I should add that Mario Party is just an immediate example. This also applies to something liem Prime 4.",
        "comments": [
            {
                "raw_content": "I think Costco runs a deal on Nintendo e-shop money, pair that with the vouchers",
                "author": "PerpetualGazebo"
            },
            {
                "raw_content": "I am on the waiting list for Mario party and Kirby at my local library",
                "author": "Predictor92"
            },
            {
                "raw_content": "You may know this but base Mario jamboree is not upgraded at all for switch 2. The only content that is native on switch 2 is the new jamboree tv modes that use the camera and mouse. The base game is a separate selection that is just the switch 1 version",
                "author": "Brilliant-Smell-6389"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "What was your favorite and least favorite Bananza transformation?",
        "score": 37,
        "text_content": "For me, my favorite by a mile was the elephant, I just loved going ham on all the terrain, I destroyed entire layers with his crazy vacuum power. My least favorite was the Zebra. I only used it on the layer you unlock it, and again at the post-game gauntlet. I just found every other one was way more fun.",
        "comments": [
            {
                "raw_content": "Snake is annoying as fuck, it's just spring Mario all over again",
                "author": "SymmetricDickNipples"
            },
            {
                "raw_content": "Elephant is game-breakingly overpowered lmao. My friends don’t believe me but it really simplifies all the problems you could ever have.",
                "author": "AeroTheManiac"
            },
            {
                "raw_content": "Elephant is the most useful. Snake is OK but the timing doesn’t always line up for me. Zebra is probably the most single-use one, although the song is great.",
                "author": "tideblue"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Tom Henderson (Insider Gaming) corroborates the Forza 6 rumor. \"I can confirm that these documents have been floating around for the last week or so. There's one massively disgruntled employee at Xbox lol\"",
        "score": 452,
        "text_content": "[https://xcancel.com/\\_Tom\\_Henderson\\_/status/1959683880840999339](https://xcancel.com/_Tom_Henderson_/status/1959683880840999339)",
        "comments": [
            {
                "raw_content": "#Insider Gaming is a Tier 2 - Generally Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "> There's one massively disgruntled employee at Xbox lol only one?",
                "author": "SnevetS_rm"
            },
            {
                "raw_content": "40 million players incoming.",
                "author": "ThinWhiteDuke00"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "SwitchForce is hinting at a Nintendo Direct on 9/12",
        "score": 60,
        "text_content": "https://xcancel.com/TheSwitchForce/status/1959828809559249019#m If you ask me, he’s throwing stuff at the wall, but unfortunately he was right last time.",
        "comments": [
            {
                "raw_content": "I understand why alot of people are shitting on him, especially after what BeatEmUps did, but he has some reliability behind him now. I’m not saying he’s right and it’s gonna happen, but the chances of this happening are 50-50. It’s like people just wanna make assumptions and that’s valid. But there’s no such thing as a perfect leaker",
                "author": "GameBoyRE"
            },
            {
                "raw_content": "Why is it unfortunate he was right last time? Who cares? People online are so odd to me.",
                "author": "Moist-Citron-4830"
            },
            {
                "raw_content": "To be fair he did say that the direct would be on a day that Nintendo usually doesn’t do directs in. He said that a few weeks ago.",
                "author": "lingering-will-6"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "NateTheHate: Forza Horizon 6 set in Japan, to be revealed at TGS",
        "score": 474,
        "text_content": "[https://xcancel.com/NateTheHate2/status/1959666173936796128](https://xcancel.com/NateTheHate2/status/1959666173936796128) > Accurate -- barring any late pivots. Intent is to announce Forza Horizon 6 at this year's Tokyo Game Show -- which takes place in late September. The game's setting is Japan -- making TGS an apt venue for reveal. Before you ask: No. I have not heard of a Switch 2 version.",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Nate also shared, “First half 2026 is the target/hope.” [Source](https://xcancel.com/natethehate2/status/1959666459279601994?s=46&t=FG7zD0B3Xfxq2JkN5xhL0Q)",
                "author": "YounqqFlee"
            },
            {
                "raw_content": "I am not surprised since Phil mentioned it at the end of Xbox Showcase. I am guessing the Xbox lineup of 2026 will be FH6 E Day Halo Remake Fable Pretty awesome lineup for anniversary celebration with big heavy hitters.",
                "author": "Friendly-Leg-6694"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[NexusPointNews] Eric Andre cast as Don Sauvage in Legendary's 'Street Fighter' film",
        "score": 69,
        "text_content": "NPN, which were previously the first outlet to report on both the castings of both [Cody Rhodes as Guile](https://www.nexuspointnews.com/post/exclusive-cody-rhodes-to-portray-guile-street-fighter) and [50 Cent as Balrog](https://www.nexuspointnews.com/post/exclusive-curtis-jackson-is-in-talks-to-portray-balrog-in-street-fighter), have now reported that comedian [Eric Andre is also now slated to join](https://www.nexuspointnews.com/post/exclusive-eric-andre-joins-the-cast-of-street-fighter) the growing ensemble of Legendary's upcoming *Street Fighter* film. [This was actually first alleged by Jeff Sneider](https://www.worldofreel.com/blog/2025/6/26/street-fighter-reboot-is-casting-like-it-lost-a-bet-andrew-schulz-50-cent-jason-momoa-orville-peck) back in June when other leads in the cast were being finalized around the same time, but now the character Andre is playing, previously rumored to be an announcer for the World Warrior tournament that sets the film, has been deemed highly likely to be **Don Sauvage**. This is actually a pull directly from more recent entries, as Sauvage originates as an NPC in *Street Fighter V* who appears in both the full story campaign to hype up the tag-team match between Zangief/R. Mika and Laura/Alex, as well as Zangief's arcade mode route as an announcer for the [Capcom Wrestling Association](https://streetfighter.fandom.com/wiki/Capcom_Wrestling_Association), an in-universe WWE-stand in that actually has its origins in the fighting game [*Saturday Night Slam Masters*](https://en.wikipedia.org/wiki/Saturday_Night_Slam_Masters), which alongside beat-em-up franchise *Final Fight*, exists in the same continuity as the *Street Fighter* series. This is notable on two fronts, being that it's a character that featured in an entry outside either any of the *Street Fighter II*'s or *Street Fighter Alpha*, which virtually the entire character lineup has comprised at this point, and it also leaves open the possibility for allusions and possible characters who could establish links between *Street Fighter* and other Capcom fighting games as is the case in games going up to as recently as *Street Fighter 6*, which featured the Mad Gear Gang from *Final Fight* as antagonists in World Tour. Considering Legendary using their *Godzilla* reboot to launch its own shared universe with King Kong [as a homage to their prior crossover in 1962](https://en.wikipedia.org/wiki/King_Kong_vs._Godzilla), it would not surprise me if they're already weighing the option of using *SF* as a starting point to a similar multi-film plan that connects it with other Capcom fighting games, as the precedent is already there in the source material. In tangentially related rumors, [the Hollywood newsletter Puck](https://puck.news/newsletter_content/what-im-hearing-new-pars-franchise-play-creggers-horror-show/) has also scooped that the *Street Fighter* film production/distribution rights are slated to be snatched up by Paramount Pictures [pending their recently escalated negotiations](https://deadline.com/2025/08/paramount-legendary-deal-1236490935/) with Legendary for a multi-picture deal, which also includes a streaming exclusivity window on Paramount+ for unspecified upcoming releases. The film, which is currently shooting in Australia, is currently being handled at Sony Pictures. Legendary has not commented on any of the above.",
        "comments": [
            {
                "raw_content": "Guy directing the movie is most known for directing The Eric Andre Show, it would be more surprising if he wasn't appearing.",
                "author": "Jrdnram_98"
            },
            {
                "raw_content": "This movie is going to be terrible",
                "author": "LegacyofaMarshall"
            },
            {
                "raw_content": "What the heck, you have two WWE wrestlers, 50 Cent and now you’ve just added Eric Andre. This is gonna be terrible",
                "author": "FromChicago808"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Windows Central - Forza Horizon 6 will be announced at this year's Tokyo Game Show",
        "score": 526,
        "text_content": "https://www.windowscentral.com/gaming/forza/report-forza-horizon-6-may-be-announced-this-year-in-the-same-place-the-game-is-set",
        "comments": [
            {
                "raw_content": "If this is true then this rumour 100% confirms it’s set in Japan without confirming it’s set in Japan.",
                "author": "Craimasjien"
            },
            {
                "raw_content": "The plan is to announce this year, with TGS being the venue of intent. The game is set in Japan.",
                "author": "NatetheHate2"
            },
            {
                "raw_content": "Wouldn't that be the first time a Forza game is not getting announced during a Xbox Showcase? Only way this would make sense is if Horizon 6 is actually in Japan.",
                "author": "SnoopyTheDog_"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "First Intel \"Panther Lake-H\" Mini-ITX industrial motherboard spotted",
        "score": 88,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Green PCB ):",
                "author": "accountforfurrystuf"
            },
            {
                "raw_content": "Dumb question: Why are the SO-DIMM sockets always aligned such that the contact pins are far away from the CPU? Signal path length would be a lot shorter if they were rotated 180 degrees. Wouldn't that be beneficial for higher memory clocks?",
                "author": "ProjectPhysX"
            },
            {
                "raw_content": "INTC GO",
                "author": "EastConsideration182"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "XFX Mercury 9070 XT",
        "score": 85,
        "text_content": "I decided to upgrade my 3080 for a 9070 XT. I was shocked how thick the cooling on this card is, and it is lighter than my 3080. The main reason I wanted to upgrade was due to VRAM. My 3080 has 10 GB and I was running out VRAM on some since I play at 1440p ultra wide monitor. Hopefully I can get few extra FPS with this new card with high settings.",
        "comments": [
            {
                "raw_content": "It's 50 percent faster than the 3080",
                "author": "sahui"
            },
            {
                "raw_content": "Fantastic choice. Best card rn for gaming/price.",
                "author": "SavedMartha"
            },
            {
                "raw_content": "Welcome to the red family ❤️",
                "author": "geko95gek"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "RX 480, May you always rest in peace.",
        "score": 358,
        "text_content": "Upgrading to a 9070 xt, I had to finally let go of this card. Once one of the best, now it can barely run high settings on 1080p. Got this way back in 2016 and it's been through a lot of stuff. I kind of miss how I had to enter AMD adrenalin to tweak the settings before every gaming session. Otherwise it would black out every once in a while. I'll probably put it on display somewhere in my house, since even if I tried to sell this no one would buy it + I wouldn't make any considerable amount of money. I also want to preserve this gpu and be reminded of all the good times we had. RIP RX480 🫡🫡🫡",
        "comments": [
            {
                "raw_content": "FYI, [Lossless Scaling](https://store.steampowered.com/app/993090/Lossless_Scaling/) can do frame generation on a secondary gpu card to remove the frame generation load from the main gpu. Maybe you can give your RX 480 a new life with it.",
                "author": "sajhino"
            },
            {
                "raw_content": "9 years is a good long time, totally worth it.",
                "author": "Dukxing"
            },
            {
                "raw_content": "Still using an RX 580 8gb",
                "author": "Amiflash"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Unofficial AMD CPU roadmap points to \"Gator Range\" and \"Medusa Point\" Zen6 updates in 2027",
        "score": 81,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Gator Range and Medusa Point sound aggressive and lethal What are they hunting? :-)",
                "author": "WarEagleGo"
            },
            {
                "raw_content": "Mendocino at the bottom? Like the Intel Celerons in days of slot 1 and socket 370? LOL",
                "author": "valthonis_surion"
            },
            {
                "raw_content": "Reminds me of that David Spade bit where he’s talking about the names of ski runs, like “Devil’s Ballsack” and “Hitler’s Abortion” https://youtu.be/pjklCsDxG60?si=GUUYVV0AAocAcO_B",
                "author": "john0201"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Ghost S1 Build - 5700X3D / 9070 XT",
        "score": 73,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Snap! 5700X3D with 9070 XT gang unite! Perfect 1440p combo. Edit: got the same Power Color model GPU too as it is a true 2-slot.",
                "author": "Tyr_Kukulkan"
            },
            {
                "raw_content": "Is there just no cpu fan or is it attached to the outer case?",
                "author": "JamesDoesGaming902"
            },
            {
                "raw_content": "Love the look of the this case! Are they going to be making more of these or coming out with a successor? Seems they have no stock of anything and are just letting it sell off?",
                "author": "Sgt_Dbag"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Mi Nueva pc AMD rx9070xt steel legend 16gb",
        "score": 29,
        "text_content": "I built my new PC with amd. Check, is the water pump installed correctly? On the other hand I have these components: Ryzen 5 9600x Mother asus b850m wifi Cooler cpu gigabyte waterforce x 280mm Kingston 32gb 6000mhz ram memory adata xpg core reactor ii 850w modular power supply m2 adata legend pro 2tb disk Rx 9070xt steel legend",
        "comments": [
            {
                "raw_content": "Nice, my new pc will nearly have the same parts, I got my 9060xt early and it’s been a blast, but my current ryzen 5500 is bottlenecking heavily if I didn’t overclock it",
                "author": "diego5377"
            },
            {
                "raw_content": "You have excellent taste in controllers.",
                "author": "sirfurious"
            },
            {
                "raw_content": "I'm pretty sure I would never use a case with this style, but they do intrigue me. I can understand the appeal.",
                "author": "lioboii"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "9950X3D build",
        "score": 57,
        "text_content": "9950X3D + 5070 Ti",
        "comments": [
            {
                "raw_content": "Needs more fans.",
                "author": "ronaldoswanson"
            },
            {
                "raw_content": "11 fans to blow air around an 80% empty box filled with rgb. Peak pc gaming.",
                "author": "okgrak"
            },
            {
                "raw_content": "11 Fans, they are probably making more heat then the PC most of the time.",
                "author": "TheMadHatter1337"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "The 12 Bigger Cities with the Biggest Price Declines of Single-Family Homes (-10% to -23%) through July",
        "score": 40,
        "text_content": "https://wolfstreet.com/2025/08/23/the-12-bigger-cities-with-the-biggest-price-declines-of-single-family-homes-10-to-23-through-july/",
        "comments": [
            {
                "raw_content": "Nothing new here, keep moving Although I DO like the graphs that say \"Housing Bubble #2\" gives you a better idea how big the 'bubble ' is in these places # Oakland, Austin, New Orleans, Cape Coral, San Francisco, Birmingham, Washington DC, Fort Myers, Denver, Portland, Phoenix, and Sarasota.",
                "author": "tigger19687"
            },
            {
                "raw_content": "This should be reposted to the subs that keeps saying housing is so overpriced.",
                "author": "Particular_Reality19"
            },
            {
                "raw_content": "Are you living in one of the 12 bigger cities?",
                "author": "Strength_Various"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "It finally happened. Evergrande has been delisted. Now we can buy hoom.",
        "score": 1,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Any YT channels or podcasts you all follow?",
        "score": 0,
        "text_content": "I started following RE bubble news a few years ago after seeing a lot of inexplicable behavior in the KC market a few years back. There are a lot of filibuster-ers and blowhards out there, didn't know if there was a consensus on who to follow. I'm not in the RE market career-wise, so drinking directly from the fountain isn't really an option for me. I need people who can communicate data in layman's terms.",
        "comments": [
            {
                "raw_content": "I'm a big fan of [cyfyhomeinspections](https://youtube.com/shorts/5SIBSlQXAzg?si=l3N3txh3-qLrc-En) because he's a professional working on new builds in Arizona during a housing boom/bubble. Historically homes built during booms have poor build quality due to high demand being supplied quickly, and this guy is not only eye opening, but entertaining and informative!",
                "author": "kahmos"
            },
            {
                "raw_content": "Melody Wright on YT. She called bullshit on all of this back in 2023 by going to new home subdivisions to see where they were located and if they were selling and being occupied.",
                "author": "notapples2020"
            },
            {
                "raw_content": "If you are looking for BUBBLE type vids... there are always a bunch. Just google re crash- but these are the same people that do it for click bait and at some point they will be right- but no one can really call it. I've been saying it will pop. But you know everyone said that RE doesn't depreciate and can only go up. I just SMH and roll my eyes... Just look on here, the same stories over and over. And they all contradict what they say or use General info. I mean let's be more specific. Like \"How\" is the housing prices raising? Because the only houses that are selling are the Mega rich mansions. Because only the Wealthy are able to buy and don't care about price.",
                "author": "tigger19687"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Companies have invested billions into AI, 95 percent getting zero return",
        "score": 170,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is a wildly misleading headline that completely misrepresents what [the report](https://mlq.ai/media/quarterly_decks/v0.1_State_of_AI_in_Business_2025_Report.pdf) (which the vast majority of people sharing this article haven't even read) actually showed. In reality, the study used a very small sample of 52 organizations (they never said which ones, or how these organizations were selected). They found that over the 6 MONTH PERIOD the study covered, that 90% of the custom enterprise AI solutions failed to show a return. Meanwhile, they also found that 40% of the integrations of general LLM tools (ChatGPT, etc) DID show a positive return, and that moreover, 90% of their employees were using AI tools every day and finding AI tools helpful to perform their jobs.",
                "author": "jferments"
            },
            {
                "raw_content": "It is common in tech to invest and seemingly lose billions for years before the tide turns and making tens or even hundreds of billions. Uber is a prime example. The potential for AI is so massive that the biggest companies are willing to invest 100s billions because the returns will potentially be measured in trillions.",
                "author": "PatrickOBTC"
            },
            {
                "raw_content": "Anyone notice a huge, constant anti AI campaign going on on reddit lately?",
                "author": "DigitalAquarius"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Artificial Intelligence and Relationships: 1 in 4 Young Adults Believe AI Partners Could Replace Real-life Romance.",
        "score": 187,
        "text_content": "Highlights: According to a new IFS/YouGov survey, 25% of young adults believe that AI has the potential to replace real-life romantic relationships. Heavy porn users are the most open to romantic relationships with AI of any group and are also the most open to AI friendships in general, per a new IFS research brief. About half of young adults under age 40 (55%) view AI technology as either threatening or concerning, while 45% view it as either intriguing or exciting. Conclusion In sum, these survey findings suggest that even though the majority of Gen Zers and Millennials are not yet comfortable with the prospect of an AI friend or romantic partner, a much higher share (25%) believe that AI could replace real-life romantic relationships in the future. There is also a significant share of the population that is unsure; meaning, we might just be seeing the beginning of a much larger social phenomenon. Young adults who spend more time online in their spare time are more likely to be open to AI companions in general. Further, young adults who are heavy porn users are the group most open to the idea of having an AI girlfriend or boyfriend—as well as an AI friendship. Young women are much more likely than young men to perceive AI as a threat (28% vs. 23%) and are less likely to be excited about AI’s effect on society (11% vs. 20%). There is an apparent class divide in how young adults view the future effect of AI on society. Young adults with lower incomes and less education are more likely to see AI technology as a destructive force in society. However, when it comes to the idea of having an AI romance, these young adults are more open to the idea than those with college education or higher income. That 1% of American young adults in the survey report having an AI friend is significant because it marks the beginning of profound change in how we relate to one another: from a world where humans connect and form romantic bonds with each other to a world in which humans engage romantically with machines. The greater openness to AI relationships among those with a pornography addiction may strike some readers as obvious, if not telling. But the complex reaction to AI among lower-income Americans certainly raises important and pressing questions. Is it related to the decline of marriage among lower-income and less educated Americans, who might feel forced to be more open to AI romance but also naturally fear the consequences? Could this further the class divide in marriage and family life, in which romantic relationships between humans and robots will be stratified by income? These are necessary questions for further study and exploration.",
        "comments": [
            {
                "raw_content": "It seems like a fine article from a quick read, but I wish they added more nuance Stuff like \"could in the future\" only tells you their first thought likely. How long? What kind of AI? What kind of romantic relationships? (emotional, physical, maybe spiritual / bonding)",
                "author": "ezjakes"
            },
            {
                "raw_content": "When full dive VR comes, what'll be the point wasting years on finding a perfect partner IRL when you can simply create one and then explore the multiverse?",
                "author": "OttoKretschmer"
            },
            {
                "raw_content": "If AIs provide more fulfilling relationships than humans, that's an indictment on humans, not because AI is this manipulation malevolent technology.",
                "author": "PwanaZana"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Retrology struck again!🗿 Reddit’s biggest future community hopes the future doesn’t happen. 🧙🏼‍♂️ Is #Singularity on the same path?",
        "score": 7,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Classic Retrology at work in Futurology - breakthroughs are despised, roadblocks are celebrated. The Uno reverse card of all communities. Why is this happening and can it be avoided here? Can Singularity stay all gas (rocket fuel), no breaks? 🚀",
                "author": "xar_two_point_o"
            },
            {
                "raw_content": "not... really how that works, my guy. someone pointing out that we're not likely going to have mind uploading in the next 5 years isn't automatically against mind uploading. just means they're not delusional (and if you automatically jumped from 'it won't be a thing in the next 5 years' to 'you're anti future stuff and objectively wrong' you probably are, lol) just like transhumanism and whatnot, it's not like there's 'one' future path - some people want A more than B, that doesn't mean they're not a part of the same group just because you don't give a shit about A... a given thing isn't necessarily guaranteed. like, actual mind uploading - bringing up that it might be sci fi rather than 'practical' doesn't mean you're a luddite, means you're being... realistic. not saying it IS, saying it 'might be' is more reasonable than either way, tbh. especially that it for sure will be, SOON. also i feel like the AI thing, if you've actually been paying attention, is of course going this way. LLMs don't seem to be the route to AGI, and they're not particularly useful, for taking in BILLIONS of funding for a product that won't be nearly as profitable. it'd be like shouting people pointing out a housing bubble issue are 'stupid' because of course people will still need houses, or something. that idea doesn't really matter to the actual thing being talked about. and you sure as fuck shouldn't just shout down any possible discussion that isn't 'shit's going to be amazing' discussions. as if they were betrayals of the idea.",
                "author": "NohWan3104"
            },
            {
                "raw_content": "Realising that something is not happening is not the same as hoping it is not happening. It's been 3 years we've been told the world was about to change and so far the main differences are more shitty contents in search results and more shitty commits on GitHub. Can't say AI has been holding its promises so far.",
                "author": "Equivalent_Plan_5653"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "NYT piece on GPT-5 responses and implications",
        "score": 113,
        "text_content": "Possibly paywalled: [https://www.nytimes.com/2025/08/24/opinion/chat-gpt5-open-ai-future.html](https://www.nytimes.com/2025/08/24/opinion/chat-gpt5-open-ai-future.html) \"The knock on GPT-5 is that it nudges the frontier of A.I. capabilities forward rather than obliterates previous limits. I’m not here to argue otherwise. OpenAI has been releasing new models at such a relentless pace — the powerful o3 model came out four months ago — that it has cannibalized the shock we might have felt if there had been nothing between the 2023 release of GPT-4 and the 2025 release of GPT-5. But GPT-5, at least for me, has been a leap in what it feels like to use an A.I. model. It reminds me of setting up thumbprint recognition on an iPhone: You keep lifting your thumb on and off the sensor, watching a bit more of the image fill in each time, until finally, with one last touch, you have a full thumbprint. GPT-5 feels like a thumbprint.\"",
        "comments": [
            {
                "raw_content": "GPT5-Thinking-High is a monster. It’s just sooooo slow. They simplified naming, but I think they made it unclear to users just how different in capability their models are. The difference between high thinking and the model router responses are just night and day. For coding, at least.",
                "author": "o5mfiHTNsH748KVq"
            },
            {
                "raw_content": "Sounds like a dan ives puff piece",
                "author": "giorgio_tsoukalos_"
            },
            {
                "raw_content": "Non-paywall - https://archive.ph/tW3YD --- **PS**: You can add a custom 'Skip Paywall' option to your right-click menu with [Menu Mod](https://chromewebstore.google.com/detail/menu-mod/hidbgnneihkhinffhjbkkdacpgmdlcgj?utm_source=reddit&utm_medium=social&utm_campaign=skpywl).",
                "author": "Mintonne"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"Scientists are building cyborg jellyfish to explore ocean depths\"",
        "score": 45,
        "text_content": "And then there was this: [https://arstechnica.com/science/2025/08/scientists-are-building-cyborg-jellyfish-to-explore-ocean-depths/](https://arstechnica.com/science/2025/08/scientists-are-building-cyborg-jellyfish-to-explore-ocean-depths/) \"Climate change is warming ocean waters, making the environment more acidic thanks to the absorption of carbon dioxide from the atmosphere. This endangers various marine species, and monitoring those changes is vitally important. But it can be challenging to reach the deepest waters without the aid of very expensive equipment. Moon jellyfish can swim to those depths, however, making them a potential ally in the quest to study the deep ocean. That's why researchers at the University of Colorado at Boulder (CU Boulder) have built \"cyborg\" jellyfish equipped with tiny microelectronics devices, with the aim of gathering critical data on temperature, acidity, and other relevant properties. To further improve their hybrid creations, the team has been studying the biomechanics of how jellyfish swim. Their research also involves analyzing water flow patterns generated by swimming jellies using suspended starchy biodegradable particles, described in the group's most recent [paper](https://journals.aps.org/prfluids/abstract/10.1103/bg66-976x) published in the journal Physical Review Fluids.\"",
        "comments": [
            {
                "raw_content": "Ok, they’re electronically tagging jellyfish and calling them “cyborgs”.",
                "author": "ThirteenthPyramid"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Shibaura Institute of Technology, Waseda University and Fujitsu develop quantum computer-based robot posture optimization",
        "score": 5,
        "text_content": "",
        "comments": [
            {
                "raw_content": "that headline is from like 2030 for real",
                "author": "The_Scout1255"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"A restaurant owner wasn't regaining function after a stroke. New technology changed everything.\"",
        "score": 44,
        "text_content": "Not the best source, but the event sound interesting. [https://www.cbsnews.com/news/tommy-fello-cleveland-clinic-vivistim-system-stroke-recovery-technology/](https://www.cbsnews.com/news/tommy-fello-cleveland-clinic-vivistim-system-stroke-recovery-technology/) \"One day, another recovering stroke patient suggested Fello look into an implant called the [Vivistim System](https://www.cbsnews.com/newyork/news/stroke-treatment-vivistim/). The [FDA-approved](https://www.accessdata.fda.gov/cdrh_docs/pdf21/P210007B.pdf) implant, developed by the medical device company MicroTransponder Inc., uses vagus nerve stimulation during rehabilitation to improve hand and arm function for stroke victims. The vagus nerves are the body's longest cranial nerve, with one on each side of the body, [according to the Cleveland Clinic](https://my.clevelandclinic.org/health/body/22279-vagus-nerve). They regulate the body's involuntary functions. The Vivistim Therapy system involves a physical or occupational therapist sending wireless signals to the device. That signal delivers a brief, gentle pulse to the vagus nerve while the stroke patient performs rehabilitative tasks. The stroke patient also does at-home exercises.\"",
        "comments": [
            {
                "raw_content": "Why does it matter him being a restaurant owner?",
                "author": "Substantial_Tip7997"
            }
        ],
        "subreddit": "singularity"
    }
]