[
    {
        "post_name": "🇺🇸 Age of first-time home buyers:",
        "score": 778,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The DOJs next conspiracy investigation should be hedge funds buying up entire neighborhoods of new communities to artificially inflate prices. That is if they can complete the investigation without rando hitmen walking into buildings in NY looking for “the NFL commissioner”. I wonder if that was Wesley Lapatner’s code name when she turned states evidence.",
                "author": "Greenhills"
            },
            {
                "raw_content": "Uhhh sorry this has been deboonked. I've been reliably informed on this site that this is due to the fact that all young people are lazy, there were no cell phones in the 70s, and young people are lazy. It has nothing to do with the economy or population increase or money printing. It's that I just don't work as hard as boomers did.",
                "author": "YouEssAye"
            },
            {
                "raw_content": "All I see being built right now are endless amount of Apartments. Its straight turning into the Soviet Union everywhere. People will only be living in communist blocks soon if Trump doesn't kick out the third world.",
                "author": "invalid_data"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "THE PRICE IS WHITE",
        "score": 626,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They already do.",
                "author": "mel_to_the_core"
            },
            {
                "raw_content": "He wants all the white people to leave so he can bring in more Muslims. Just another tactic like London and Paris.",
                "author": "Billionaired"
            },
            {
                "raw_content": "Do white neighborhoods even exist in NYC anymore?",
                "author": "ManOfThePeople"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Chicago women are spending their days walking around with whistles so they can alert illegals of ICE activity in the area. They’re quite literally trying to save convicted sex offenders from being taken out of their neighborhoods.",
        "score": 611,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They need to save their brown smelly rapists from deportation so that they can virtue signal on Instagram about how they feel unsafe around men. Also note how this AWFL is sticking to the north side and won't go to the south side. Racist bitch.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Blowing a whistle to alert illegal aliens of an ICE raid is “attempting to shield from detection” under 8 U.S.C. § 1324(a)(1)(A)(iii). “knowing or in reckless disregard of the fact that an alien has come to, entered, or remains in the United States in violation of law, conceals, harbors, or shields from detection, or attempts to conceal, harbor, or shield from detection, such alien...” Up to 5 years in prison and/or fine under Title 18.",
                "author": "Spiritof2015"
            },
            {
                "raw_content": "Rape whistles? Like come and get me?",
                "author": "The_Ikonoclast"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Best job ever.",
        "score": 487,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You’re doing it right, Fren! Being a Dad (or a Mom) is the most important and fulfilling job in the world. Spend time with your kids, help them grow up and know that they’re loved and safe. This is the way!",
                "author": "Nutt_bugget"
            },
            {
                "raw_content": "The most difficult and beautiful thing I've ever done. My son gives additional layers of purpose to every action I take.",
                "author": "Zskills"
            },
            {
                "raw_content": "More dads = less crime More dads = less abuse More dads = less poverty More dads = less violence More dads = less illiteracy More dads = less dropouts More dads = less addiction More dads = less self-harm More dads = less mental illness More dads = a better world in every way",
                "author": "tpactionchasethevote"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔴Trump Truth: \"Major Health Insurance Company Stock Performance After Obamacare\"",
        "score": 468,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Obamacare was meant to be an enslavement mechanism to make everyone fully dependant on the government and thus controllable for invasion",
                "author": "Krat"
            },
            {
                "raw_content": "I made alot of liberals mad when I told them pre and post Obama-Care prices. Also lost a promotion over it too.",
                "author": "DT170x"
            },
            {
                "raw_content": "Going to the doctor is gay, I don’t know why so many people in my generation are obsessed with constantly seeing doctors.",
                "author": "SadFugeeFace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "U.S. Supreme Court allows Trump to withhold SNAP funding pending review — AP",
        "score": 934,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This headline implies that Trump has the legal and Constitutional means to fund SNAP but is choosing not to, which is a lie. The reality is that the lower courts ordered him to do something that he can't do.",
                "author": "berserkerbarrage"
            },
            {
                "raw_content": "US tax payers aren't the worlds welfare center!",
                "author": "MajorClark"
            },
            {
                "raw_content": "The Supreme Court does not **allow** the US President to do something, they merely determine if what he is doing, or is preparing to do, is constitutional.",
                "author": "CaptRied"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "West Virginia State Senator Chris Rose (@ChrisRoseWV) has introduced a resolution inviting 27 counties in Virginia and 3 in Maryland to join the State of West Virginia",
        "score": 790,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Super-West Virginia.",
                "author": "lothrop_evola"
            },
            {
                "raw_content": "This is the perfect time to remind the left that borders are just imaginary constructs anyways!",
                "author": "XxxRDTPRNxxX"
            },
            {
                "raw_content": "Please add carroll county",
                "author": "gravenspine"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Justice Ketanji Brown Jackson issued the order for an administrative stay, approving Trump's emergency appeal to withhold full funding of SNAP food aid payments amid a shutdown.",
        "score": 657,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Remember how she thought the dude was talking about Abraham Lincoln yesterday? Peperidge Farm remembers!",
                "author": "TooTrue-translation"
            },
            {
                "raw_content": "This is such a simple judicial ruling even the retard understands that Congress controls the purse and an inferior court judge with TDS that failed grade school civics, can't demand the President do something unconstitutional...",
                "author": "AllisterTwo"
            },
            {
                "raw_content": "Did I read that right?",
                "author": "MAGA_NRG"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Dear mods, please wake up...",
        "score": 607,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No more wars for foreign countries. The war is at home thanks to our allies.",
                "author": "Taqiyya_Mockingbird"
            },
            {
                "raw_content": "Update: MODS ARE AWAKE!",
                "author": "DeusVult1096"
            },
            {
                "raw_content": "The Christian Kingdom of Jerusalem, yes or no?",
                "author": "Givesgunstogrannies"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Trump administration now has at least 175 investigations into H-1B VISA ABUSE by companies seeking to replace American jobs with foreigners. Good. We need MORE!",
        "score": 1580,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Add about four more zeros",
                "author": "john9985"
            },
            {
                "raw_content": "Every H1B is fraudulent.",
                "author": "utfanx2"
            },
            {
                "raw_content": "Lol there's wayyyyy more than 175 cases of H-1B visa abuse. https://www.myvisajobs.com/reports/h1b/",
                "author": "McFatty7"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump just told ALL GOP senators what can be accomplished if the filibuster is nuked — voter ID, no mass mail-in voting and fraud, ending no cash bail, and ZERO welfare for illegals.",
        "score": 1617,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Jokes on you Mr President... they're into all that shit",
                "author": "NadlersNads"
            },
            {
                "raw_content": "Too bad \"our side\" has never been on our side",
                "author": "Sea_Still"
            },
            {
                "raw_content": "The filibuster is a made up rule that corporate-controlled politicians on both sides of the aisle rely on as an excuse for not getting anything done when they’re in power. It’s inherently anti-democratic and needs to go.",
                "author": "_fidelio"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Developer: Florida Real Estate Surges as New Yorkers ‘Nervous’ About Socialist Zohran Mamdani",
        "score": 1268,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Great, make it even harder for us young conservatives to buy a house. Fuck commies.",
                "author": "Aquamine-Amarine"
            },
            {
                "raw_content": "Great. Those idiots elect a commie and my prices go up.",
                "author": "jdovejr"
            },
            {
                "raw_content": "Great. More liberals in Florida just what the state needs",
                "author": "DeplorachuIChooseYou"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "CNBC TDS! Nasdaq came back from down 400 today! We laugh at these faggots! Dow came back from 300 down! Trump Wins the day again!",
        "score": 1250,
        "text_content": "",
        "comments": [
            {
                "raw_content": "These markets are so cooked that I don't trust any of it.",
                "author": "MickHigan2"
            },
            {
                "raw_content": "Daily stock fluctuations are dumb things to care about and only affect traders and retards.",
                "author": "AVeryNakedMan"
            },
            {
                "raw_content": "A drop and recovery of a couple percentage points is not impressive, sorry. Not worth a sticky imo",
                "author": "nonrate"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Elon Musk: The reason government programs are so inefficient is that, unlike a commercial company, the feedback loop for improvement is broken, because they have a state-mandated monopoly and can’t go out of business if customers are unhappy.",
        "score": 676,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Also, the horrific bureaucracy forces a free lunch sandwich to cost $1 to produce but $50 to get it to the student.",
                "author": "_Sully_"
            },
            {
                "raw_content": "It’s why monopolies are terrible regardless of corporate or governmental monopoly. They can become very authoritarian and inefficient.",
                "author": "Crlsniper"
            },
            {
                "raw_content": "Look at DMV’s. Classic example!",
                "author": "IAmRetard"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I'm SICK of these TRAITORS!",
        "score": 1387,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Let me guess; I will again be forced to pay insurance premiums for individuals who should not be in my country and do not pay taxes. In other words, slavery. I think not this time.",
                "author": "Be_The_Change"
            },
            {
                "raw_content": "Bet that is what they want, so when President Trump vetoes their decision, they can put the full blame on him.",
                "author": "ncswicn"
            },
            {
                "raw_content": "We the people are not represented in government, only illegals and the gibmethats",
                "author": "Magma_Biscuit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Mods are hard to please.",
        "score": 386,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You have to know their mating call to catch a mod. Just post a Gateway pundit article that’s already been posted 5 times today and it’ll be stickied within minutes…",
                "author": "Double_D"
            },
            {
                "raw_content": "The perfect meme from the last 5 hours has arrived.",
                "author": "I-am-Orlando"
            },
            {
                "raw_content": "So they sticky post about themselves.. smh.",
                "author": "schnazzmizzle"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The US Sixth Circuit Court of Appeals Just Ruled That Schools CAN NOT Force Students to use \"preferred pronouns\". The ruling states that there is \"no evidence that the use of biological pronouns would disrupt school functions or qualify as harassment under Ohio law.\" BIG WIN for Ohio Families...",
        "score": 1370,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The fact that the teacher's union will fight with all their might to defend all these weirdos but can't be bothered to do anything about abysmal test scores, rampant illiteracy, and out of control class rooms..tells you everything you need to know.",
                "author": "TheSwampThang"
            },
            {
                "raw_content": "Good, fuck that commie bullshit. Get/Fucked, leftists.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "It's time to tell the mentally ill tranny brigade: Shut up and go vent to a therapist, instead of forcing your bullshit on the rest of society.",
                "author": "AVeryNakedMan"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Islam is incompatible with civilization",
        "score": 678,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yeah the Christian asked to speak to you and spread Good News and went on their way, or spoke to you. He didn’t fucking explode.",
                "author": "PatriotSkorzeny"
            },
            {
                "raw_content": "They don’t convince. They just chop.",
                "author": "Im_RickSteves_bitch"
            },
            {
                "raw_content": "Incompatible with Western Civilization",
                "author": "hdcochran"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "💲 BREAKING: Supreme Court rules President Trump does NOT have to spend money the government does not have for SNAP during the shutdown...",
        "score": 367,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Liberals can get bent!",
                "author": "henri_derelicte"
            },
            {
                "raw_content": "whether the gubment has the money or not, who is this fucking judge to order the executive to spend money?",
                "author": "yodayoda"
            },
            {
                "raw_content": "This is what happens when communist demonrats and socialists welcome the world to nations. They become dependents & drain the system.",
                "author": "MajorClark"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Karoline Leavitt just DECIMATED a reporter so hard that Hungarian PM Orban asked Trump if he could HIRE her 🤣",
        "score": 1432,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why do we put up with it? Why don't we just end these fucking liars? I'm tired of these fucks.",
                "author": "ciaramella_is_gay"
            },
            {
                "raw_content": "I love her.",
                "author": "KuzoKevin"
            },
            {
                "raw_content": "Trump is doing a good job of long term improvement. We all knew this would be short term pain for long term prosperity. However, you can’t lie to the American people. Just flat out say hey the wheel on this ship is turning but it’s slow. Come ask us next year. Because let me tell you, the gen z boys are about out of college and they’re ready to start rebelling if there isn’t a job and a family waiting on them. We are in a very dangerous time and we’re in the run up to a massive conflict of communists vs right wingers and it needs to be full tilt on jobs income and babies for the next 12 months. No sojourns into the Middle East. No more foreign peace deals. This country first and only.",
                "author": "Viewer01"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Is Fast Charging Killing the Battery? A 2-Year Test on 40 Phones",
        "score": 480,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The biggest correlation is the number of cycles. This is another reason phones should have “longer than one day” battery life. If your phone can comfortably last two days, you’ve halved your cycle count: Shorter 1-day battery life = 1100 cycles in 3 years Longer 2-day battery life = 550 cycles in 3 years",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": "difference is negligible, fast charging FTW!",
                "author": "d4rk1"
            },
            {
                "raw_content": "TL:DW * The experiment tested both Android and iOS devices * The difference between fast and slow charging when it comes to degrading the battery is almost negligible * Charging using limiters to preserve the battery health (only charging up to 80%) has only a tiny impact on the health of the battery long term and the gains will be unnoticeable for the vast majority of users * Battery degradation doesn't directly compromise performance, but the phone will throttle at lower battery percentages when the battery is more degraded * Geekerwan helped making part of the video Finally we can put to rest a couple of myths that are still so widespread. No, fast charging is not killing your battery faster. No, charging up to 80% will not make your battery degrade slower to a degree you will notice.",
                "author": "Fisionn"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "SAMSUNG confirms LPDDR6 memory with 10.7 Gbps bandwidth at CES 2026",
        "score": 53,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is LPDDR6 for smartphones?",
                "author": "Creative_Purpose6138"
            },
            {
                "raw_content": "Original source: https://www.ces.tech/ces-innovation-awards/2026/lpddr6/ Videocardz had a better headline, so I went with it (and that’s where I found it in the first place).",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": "Isn’t 10GBps really really slow?",
                "author": "Educational_Yard_326"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Phison E28 PCIe 5.0 SSD Engineering Sample Review - Efficiency Magic",
        "score": 30,
        "text_content": "",
        "comments": [
            {
                "raw_content": "At Computex this year, Phison unveiled their new E28 controller, the successor to the E26. We had the exclusive opportunity to test this new controller on an engineering sample drive, using a significantly newer firmware than what was available in the various previews by other websites during the summer. While the E26 was fabricated on a 12 nanometer process at TSMC, the new E28 uses a 6 nanometer node, which alone greatly improves energy efficiency. Additionally, Phison has dedicated considerable effort to further improving energy efficiency, aiming to develop a high-performance SSD controller that addresses a common issue with most Gen 5 SSDs—the need for extensive cooling, including some solutions that require active fan cooling. The NAND flash on this drive is TLC from Kioxia, using the modern BiCS8 218-layer technology. A DRAM cache chip is installed as well, 2 GB LPDDR4-4266 from Hynix. With this hardware config, there is no doubt, the E28 is designed to use on new high-end flagship SSDs that make full use of the PCIe 5.0 interface. ... This energy efficiency allows the drive to run without any heatsink for virtually all workloads. With a maximum power draw of 5.7 W—more like 3-4 W during typical operation—the power profile feels much more like a Gen 4 SSD than what we've seen on other Gen 5 SSDs. Our new real-life thermal testing confirms that. In our thermal stress test we saw some throttling, but that disappeared completely as soon as we installed a small aftermarket heatsink—a first in our Gen 5 SSD testing.",
                "author": "12318532110"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "NVIDIA GeForce RTX 50 SUPER refresh faces uncertainty amid reports of 3GB GDDR7 memory shortage - VideoCardz.com",
        "score": 349,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Rumour based on a tweet and a picture with some mspaint scrawled over it. Come the fuck on lol",
                "author": "jenny_905"
            },
            {
                "raw_content": "And this is why people insisting you should wait for a Super refresh are misguided. Upgrade your GPU when you’re not happy with the performance you’re getting. Don’t wait for ‘the next thing’ except in really limited circumstances where it is *known* (not speculated) that a huge leap is around the corner, which is generally never the case.",
                "author": "Exact_Library1144"
            },
            {
                "raw_content": "They dont need to use all the 3GB GDDR7 on all SKU anyway. The one that need is 5070 Super (192bit = 18GB), 5080 Super = 256bit = 24GB. 5060 super can be make into 16GB using 2GB chips. 5050 is fine with 8GB. 5070Ti is fine with 16GB. and finally laptop 5070m need 3GB chips to be 12GB. Thats all.",
                "author": "hackenclaw"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "ServeTheHome | We used a $1M tool to test the HOT $279 Ubiquiti UCG-Fiber Gateway",
        "score": 37,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Written review: [Ubiquiti UniFi Cloud Gateway Fiber UCG-Fiber Review - ServeTheHome](https://www.servethehome.com/ubiquiti-unifi-cloud-gateway-fiber-ucg-fiber-review/) >Just as a quick note, we purchased these units thanks to our STH YouTube members. We have **refused to sign the standard NDA** with Ubiquiti that everyone else does because there is a line in there that Ubiquiti would not allow us to remove, saying that we could review the product **provided** **Ubiquiti is allowed to review the post prior to publication**, **and** **that we would incorporate that feedback if needed**. While we tour data centers, manufacturing sites, and similar locations and let people preview to ensure we are not leaking confidential information, we do not allow vendors to preview and provide substantive feedback that we would be required to incorporate into our reviews. Our readers and YouTube viewers have requested that we review this box, so we purchased it to provide an honest assessment. Ubiquiti is absolutely wild. Thank goodness some outlets like STH don't sign that shit. I don't understand why they are so afraid of commentary. If Ubiquiti *needs* to give feedback, these are **public** videos: write a comment like the rest of us lmao. Will be excited to see this Keystone switch lay down the gauntlet on other routers.",
                "author": "-protonsandneutrons-"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "3 hours in. Loving the graphics & story so far",
        "score": 575,
        "text_content": "Jumped in straight from BOTW. Never played TOTK. Really enjoying the mechanics and the graphics, such a big improvement from BOTW even when I loved that game. Also, 60 fps is CRAZY",
        "comments": [
            {
                "raw_content": "Not playing TOTK is wild to me I enjoyed it a lot more than BOTW personally",
                "author": "Jetlitheone"
            },
            {
                "raw_content": "You really should play Totk though, but I’m also having so much fun.",
                "author": "Rawkhawkjayhawk"
            },
            {
                "raw_content": "One thing I really appreciate about it is how the devs really went the extra mile to make the game look and feel like it takes place in TotK's world. The cutscenes look like they could've come straight out of TotK, they brought back the same voice actors for the important characters, even the little menu sounds really add to the experience. Age of Calamity was similar in that regard. It's easy to see that and be like \"yeah, so what?\" - but honestly, I appreciate the effort because it didn't have to be that way. When I first played the original Hyrule Warriors when it came out in 2014 I remember noticing it had an artstyle that didn't match any game in particular, characters had this weird almost plastic look in cutscenes, and some of the voices and the sounds some characters made when attacking just felt really out of place. So I really appreciate that they went the extra mile with this one.",
                "author": "flameylamey"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The real reason...",
        "score": 1245,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It’s delayed because they’re union-busting and fired many key employees.",
                "author": "Past-Weakness-5304"
            },
            {
                "raw_content": "Anyone who thinks we’re getting this on Switch 2 I have a bridge to sell you",
                "author": "SuicideSkwad"
            },
            {
                "raw_content": "If that were the case theyd just release a switch 2 version later",
                "author": "trippykitsy"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "A little over eight hours before the test opens. Are you going to play tonight, or are you going to wait for tomorrow?",
        "score": 67,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fuck that noise the first test will be available at 3am EST. I'm going to play Sunday at 10am EST when it's easier and a normal time to try this game out.",
                "author": "6Y1O3W"
            },
            {
                "raw_content": "Tomorrow night I’ll play. It’s not worth it to stay up till 5 am (est) so I can play a game early for a couple hours.",
                "author": "Pokeguy211"
            },
            {
                "raw_content": "It's in a few hours like your screenshot says, not 8",
                "author": "MrSnek123"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I just saw a TV ad for Metroid Prime 4!!!1",
        "score": 54,
        "text_content": "So hyped let's goooooo. itshappening.gif",
        "comments": [
            {
                "raw_content": "I'm super excited and I can't wait to play it.",
                "author": "Williekins"
            },
            {
                "raw_content": "This reminds me of one of my dad’s favorite sayings. He said it — well, once or twice, and it went, “Now Joe, when you meet the tip of the Metroid Prime 4 hype train spear, don’t you dare down vote them. Oh no, you up vote them and wake your sister and mother and tell them to up vote them too.” So I implore everyone here, and yes I mean you — you do not down vote and dull the tip of the MP4 hype train spear. Oh no ye lads and lasses. You smash that up arrow and you grab a-holt of something and you hang on tight while the tip of the spear leads us to the promised land.",
                "author": "Fit_Buy_889"
            },
            {
                "raw_content": "I saw one before a screening of Predator Badlands. Still looks good.",
                "author": "awnshegh"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "It’s been 5 months now. How many Switch 2 games (or Switch 2 Editions) do you have so far?",
        "score": 146,
        "text_content": "",
        "comments": [
            {
                "raw_content": "3 at the moment: Mario kart, TotK, Legends Z-A DK and MP4 are both on my wishlist.",
                "author": "CynicalDutchie"
            },
            {
                "raw_content": "2... I've caught up on a lot of switch 1 games in recent months",
                "author": "Appropriate-Treat842"
            },
            {
                "raw_content": "https://preview.redd.it/0z5kf5uxkwzf1.jpeg?width=1290&format=pjpg&auto=webp&s=0945231c3aaeac898c9968cad317d13be5287bdc",
                "author": "Bluion6275"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Samus & Vi-O-La amiibo dropped today!",
        "score": 141,
        "text_content": "And holy hell does it look nice..",
        "comments": [
            {
                "raw_content": "I aint even a Metroid fan but I can appreciate beauty, and this might be the most beautiful amiibo out there.",
                "author": "Artistic_Internet290"
            },
            {
                "raw_content": "No Metroid 4 theme Limited edition pro controller announcement yet ?",
                "author": "FaithlessnessFar1158"
            },
            {
                "raw_content": "Samus should have a transparent plexiglass boob window. That's just, like, my opinion.",
                "author": "jednatt"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Dave the diver got a switch 2 edition",
        "score": 282,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Free upgrade too!",
                "author": "klave7"
            },
            {
                "raw_content": "Was pumped that it was free!",
                "author": "Chippepa"
            },
            {
                "raw_content": "HOLY FUCK THANK YOUUUUUUU i am downloading this right now",
                "author": "UnfairWelcome794"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "If you are in the US, you can already start downloading the Kirby Air Riders trial.",
        "score": 56,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yeah I can tell because the eshop is cooked rn lol",
                "author": "Top-Comparison6397"
            },
            {
                "raw_content": "You can play it too. Test out the basic tutorials",
                "author": "complex_personas"
            },
            {
                "raw_content": "My body is ready.",
                "author": "hop3less"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Tom Henderson: GTA 6 is Content-Ready",
        "score": 760,
        "text_content": "[Source - 54:00](https://youtu.be/aiosAignxbM?t=3240) >From what I've heard, it's been content-ready for a very long time.",
        "comments": [
            {
                "raw_content": "#Tom Henderson is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "They forgot to add guns",
                "author": "JamieTimee"
            },
            {
                "raw_content": "So a year of polishing",
                "author": "A_O_J"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Silent Hill 2 Xbox Release Date Leaked",
        "score": 208,
        "text_content": "https://www.trueachievements.com/news/silent-hill-2-xbox November 21 Best leaker in the game good old Microsoft store",
        "comments": [
            {
                "raw_content": "Will the dlc release at the same time? Feels like that makes sense",
                "author": "deep_fried_cheese"
            },
            {
                "raw_content": "When will we have Partner direct?",
                "author": "Jackkk007"
            },
            {
                "raw_content": "Hopefully Born From A Wish will release alongside it. Apparently, a Bloober Team dev replied to a Twitter comment asking if it will last week, and said \"born from a what? 👀\"",
                "author": "701921225"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Nvidia May Cancel 50 Series Super Cards Due to Memory Shortages",
        "score": 535,
        "text_content": "https://videocardz.com/newz/nvidia-geforce-rtx-50-super-refresh-faces-uncertainty-amid-reports-of-3gb-gddr7-memory-shortage Original source: https://www.hkepc.com/24452/%E5%8F%B0%E5%AA%92%E7%94%B1%E6%96%BC_GDDR7_%E8%A8%98%E6%86%B6%E9%AB%94%E7%9F%AD%E7%BC%BA_%E5%82%B3_NVIDIA_%E5%8F%AF%E8%83%BD%E5%8F%96%E6%B6%88_RTX_50_SUPER",
        "comments": [
            {
                "raw_content": "Thanks to the AI bubble that Nvidia keeps inflating further",
                "author": "Granum22"
            },
            {
                "raw_content": "AMD might never miss an opportunity to miss an opportunity Intel nana rest in Heaven with b770 & 3rd gen.",
                "author": "Tango-Down766"
            },
            {
                "raw_content": "First it was the crypto era started 9 years ago back when the GTX 1060 and RX480/580 were really good for mining Ethereum and the market hasn't recovered since, later came the pandemic also raising prices and now we gonna enter the AI era with RAM prices doubling and shortages? Give me a FUCKING break.",
                "author": "Terry___Mcginnis"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[BillBill-Kun] GTA V returns to PS extra and ps premium",
        "score": 357,
        "text_content": "Avaliable from November 18th. Expected to be on it for about 6 months. Currently there is no info about any other game being added. Article: https://www.dealabs.com/magazine/ps-plus-extra-grand-theft-auto-v-revient-bientot-dans-le-catalogue-de-jeux-60766 Previous rumour: https://www.reddit.com/r/GamingLeaksAndRumours/comments/1oqczbv/billbilkun_says_tomorrows_rockstar_announcement/?utm_source=share&utm_medium=mweb3x&utm_name=mweb3xcss&utm_term=1&utm_content=share_button",
        "comments": [
            {
                "raw_content": "#BilBil-Kun is a Tier 2 - Generally Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Never heard of this game, is it any good?",
                "author": "SkywalkerRanchSauce"
            },
            {
                "raw_content": "Just incase you haven't got this rare gem yet",
                "author": "Jammyyyyyyyyyyyyy"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Consumer sentiment nears lowest level ever as worries build over shutdown",
        "score": 172,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If government reopens RIGHT NOW, and stocks resume their lift into the stratosphere, we all suddenly gonna feel better, go out shopping, buying everything we can until we run out of money, keep going on credit, then when we run out of that, start feeling bad again? Throw these \"consumer sentiment\" metrics out the same window that our jobs report we used to get, got thrown of. We flying blind now. I call that, \"keep this thing parked at the gate.\"",
                "author": "HartbrakeFL21"
            },
            {
                "raw_content": "KEY POINTS * Worries over the government shutdown surged in the early part of November, pushing consumer sentiment In to its lowest in more than three years and just off its worst level ever, according to a University of Michigan survey Friday. * The current conditions index slid to 52.3, a drop of nearly 11% from last month, while the future expectations measure fell to 49.0, down 2.6%. On a year-ago basis, the two measures respectively slumped 18.2% and 36.3%.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "The govt is not your daddy! Take care of yourself",
                "author": "Vivid_Mongoose_8964"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Shutdown means another missed jobs report Friday. Here's what it probably would have shown",
        "score": 145,
        "text_content": "",
        "comments": [
            {
                "raw_content": "KEY POINTS * Jobs Friday won’t be happening again this week as the record-long government shutdown has resulted in a lack of official data on the labor market as well as a host of other important indicators. * Had the Bureau of Labor Statistics released its monthly nonfarm payrolls report, economists surveyed by Dow Jones expect it would have shown a decline of 60,000 jobs and an unemployment rate increase to 4.5%. * Other data points collected over the past several weeks paint a broad mosaic of a weak though not collapsing labor market.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "[removed]",
                "author": "None"
            },
            {
                "raw_content": "Employers less than 3000 are dying… large employers are adding net positive jobs but at lowest levels since COVID.",
                "author": "WesternFungi"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Florida becomes home to America’s most expensive ZIP code",
        "score": 16,
        "text_content": "Miami Beach’s Fisher Island 33109 became the country’s priciest ZIP code in 2025, with a $9.5 million median sale price and dethroned Atherton, California",
        "comments": [
            {
                "raw_content": "About to get a little more pricey",
                "author": "Acceptable_String_52"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Grok Video Generation Is Now Full NSFW",
        "score": 149,
        "text_content": "This is what people are now creating with Grok: https://x.com/sexy__imagines/status/1986616337964433478?s=46&t=k1ckxYQ5OwWrvPyLSZRTTw ChatGPT's plan's to allow textual erotica in December will be very tame and underwhelming when the above is already possible with Grok.",
        "comments": [
            {
                "raw_content": "Brb gorkin my shit rn",
                "author": "Calm_Hedgehog8296"
            },
            {
                "raw_content": "Prompt pimps are going to be a thing.",
                "author": "Rubixcubelube"
            },
            {
                "raw_content": "I still just get Video Moderated.",
                "author": "Economy_Variation365"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "(Google) Introducing Nested Learning: A new ML paradigm for continual learning",
        "score": 580,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I saw the first author and realized right away it was the author of Titans and Atlas(?). This dude has been on a continual learning tear. I really like this paper. I think one important realisation I'm noting from researchers, or at least what they seem to communicate more and more frequently is - if you can have any part of the stack optimize itself, it's going to scale with compute and thus outperform anything you could do by hand eventually. The goal should just be building architecture that allows for that as much as possible. In this case, I'll share the relevant interesting model they created, and then a more... Human readable explanation: > As a proof-of-concept, we used Nested Learning principles to design Hope, a variant of the Titans architecture. Titans architectures are long-term memory modules that prioritize memories based on how surprising they are. Despite their powerful memory management, they only have two levels of parameters update, resulting in a first-order in-context learning. Hope, however, is a self-modifying recurrent architecture that can take advantage of unbounded levels of in-context learning and also is augmented with CMS blocks to scale to larger context windows. It can essentially optimize its own memory through a self-referential process, creating an architecture with infinite, looped learning levels. Very hard to understand, even for me I was struggling and I've read the previous papers - so one of the rare times an AI explainer is something I'll share: Here is a more layman-friendly breakdown of that concept: The Big Idea Imagine an AI that doesn't just learn new facts, but actively learns how to learn better... and then learns how to get better at learning how to learn better, and so on, in an infinite loop. That's the core idea. It's an AI that can upgrade its own learning process on the fly. The Old Way (Titans) * What it is: Think of \"Titans\" as an AI with a really smart to-do list for its memory. * How it works: It pays attention to everything happening. If something surprising or unexpected occurs, it flags that memory as \"important\" and stores it long-term. Less surprising stuff gets forgotten. This is a powerful way to manage memory. * The Problem: The way it decides what is \"surprising\" is fixed. It has its learning rules (Level 1) and it can update its memory based on those rules (Level 2), but it can't step back and change the rules themselves. It's called \"first-order\" learning because it can't question its own fundamental learning strategy. The New Way (Hope) * What it is: \"Hope\" is a new design that uses a concept called \"Nested Learning.\" * How it works: Hope is \"self-modifying.\" It can look at its own performance and literally rewrite its own parameters (its \"learning rules\") based on what it just learned. * The \"Infinite Loop\": This creates \"unbounded levels\" of learning: * Level 1: It learns a new fact (e.g., \"This user likes short answers\"). * Level 2: It reviews its own learning (e.g., \"I learned that fact, and it's now in my memory\"). * Level 3: It then optimizes its learning strategy (e.g., \"My process for learning user preferences is good, but it's too slow. I will change my own code to make this process faster next time.\"). * Level 4: It can then review that change... and so on, forever. It's \"self-referential\" because it's constantly looking at itself to find ways to improve its own core architecture. The Bonus Features * \"Augmented with CMS blocks...\": This is a technical add-on. * Translation: It just means it also has a special component that lets it handle and analyze much larger amounts of information at once (a \"larger context window\") without getting overwhelmed. In Short: * Titans: A static AI with a great memory system. It learns, but how it learns is fixed. * Hope: A dynamic AI that constantly rewrites itself to become a better learner. It's not just learning about the world; it's learning how to be a better brain.",
                "author": "TFenrir"
            },
            {
                "raw_content": ">As a proof-of-concept, we used Nested Learning principles to design Hope, a variant of the Titans architecture. Titans architectures are long-term memory modules that prioritize memories based on how surprising they are. Despite their powerful memory management, they only have two levels of parameters update, resulting in a first-order in-context learning. Hope, however, is a self-modifying recurrent architecture that can take advantage of unbounded levels of in-context learning and also is augmented with CMS blocks to scale to larger context windows. It can essentially optimize its own memory through a self-referential process, creating an architecture with infinite, looped learning levels. Next two years are gonna be wild",
                "author": "Mindrust"
            },
            {
                "raw_content": "This is exciting but the paper is frustratingly short on empirical results. In the past we saw that Titans and Atlas did well on traditional NLP benchmarks but fell short on a lot of long-context evaluations. So why don’t they show those evals in this paper? The fact that it can beat transformers on those benchmarks without O(n2) attention isn’t new. The limiting factor preventing mamba, etc from being adopted is massive long-context degradation.",
                "author": "jaundiced_baboon"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "No, the Chinese did not do it (yet), Kimi K2 is still second behind the 4 month old OpenAI model",
        "score": 124,
        "text_content": "Sorry for the clickbait, but this was to nullify the other highly upvoted clickbait post on this sub yesterday which showed a single benchmark. Kimi K2 is a great release but it still haven't surpassed the frontier US AI models. Based on my usage, it's nowhere near Sonnet 4.5 or GPT-5 Codex in SWE tasks. It also hallucinates wildly compared to GPT-5 thinking. It's the best model for creative writing though. And I think this is where we will see the Chinese models dominate since they have a lot of leeway in terms of what they can use in the training data. Anyway, this is all going to be moot by the end of this month with the release of Gemini 3 and GPT-5.1.",
        "comments": [
            {
                "raw_content": "it's also int 4 native, more people should be talking about this. Very impressive IMO. I found it on par to gpt 5 high with a lot of CLI tasks, I don't have access to claude sonnet 4.5.",
                "author": "Ill_Distribution8517"
            },
            {
                "raw_content": "This index is trash and does not map to real world use cases. Low hanging example – M2 beating Gemini Pro is laughable.",
                "author": "nivvis"
            },
            {
                "raw_content": "Who developes KimiK2?",
                "author": "vinokess2"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "GPT-5.1 and GPT-5.1 Pro spotted",
        "score": 231,
        "text_content": "",
        "comments": [
            {
                "raw_content": "if they are calling it 5.1 i don't expect much improvement",
                "author": "ShAfTsWoLo"
            },
            {
                "raw_content": "Longer context length please",
                "author": "schnibitz"
            },
            {
                "raw_content": "Source: [https://cdn.oaistatic.com/assets/kty6ha5wveqjgq8v.js](https://cdn.oaistatic.com/assets/kty6ha5wveqjgq8v.js)",
                "author": "Outside-Iron-8242"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Global share of compute per country",
        "score": 99,
        "text_content": "Source: https://epoch.ai/data-insights/ai-supercomputers-performance-share-by-country",
        "comments": [
            {
                "raw_content": "EU feels like 1800s China to me. Proudly and ignorantly heading towards technological and eventually economical irrelevancy.",
                "author": "Which-Travel-1426"
            },
            {
                "raw_content": "EU lol pathetic",
                "author": "DatDudeDrew"
            },
            {
                "raw_content": "China stopped reporting their super computers during Trump's 1st presidency so as to not spook the lizards > https://www.nextplatform.com/2021/11/15/why-did-china-keep-its-exascale-supercomputers-quiet/",
                "author": "Boreras"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "XPENG IRON gynoid to enter mass production in late 2026.",
        "score": 599,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Does it have toes? is that why it's gait is still not ideal?",
                "author": "RasputinXXX"
            },
            {
                "raw_content": "Cant wait to get jerked off by one of these",
                "author": "gusfromspace"
            },
            {
                "raw_content": "And they have different body types? These are going to do numbers. Invest",
                "author": "NotMyMainLoLzy"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Ran quick benchmark on new stealth model Polaris Alpha.",
        "score": 38,
        "text_content": "It outperformed Gemini 2.5 pro, gpt-5-codex, and managed to tie with Claude Sonnet 4.5 Temp 0.7. This is also the second time running this benchmark that Sonnet 4.5 performs best at 0.7 temp specifically. I suspect this model is GPT-5.1 Instant especially because openai likes to not support a temperature parameter on its models. Polaris's temp can't be modified. Also this Polaris model is as fast as Sonnet 4.5.",
        "comments": [
            {
                "raw_content": "Wait maybe a mistake on my part, it may have outperformed sonnet 4.5 temp 7 as well. edit: yes, it got 7/8, Polaris Alpha just outperformed everything.",
                "author": "Round_Ad_5832"
            },
            {
                "raw_content": "And not even reasoning model you said? Excited.",
                "author": "Freed4ever"
            },
            {
                "raw_content": "no hint to what the benchmark was? multiple programs? what sizes? nature of each?",
                "author": "JoelMahon"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"Senescence-resistant human mesenchymal progenitor cells counter aging in primates\"",
        "score": 21,
        "text_content": "[https://www.sciencedirect.com/science/article/abs/pii/S0092867425005719](https://www.sciencedirect.com/science/article/abs/pii/S0092867425005719) \"Aging is characterized by a deterioration of stem cell function, but the feasibility of replenishing these cells to counteract aging remains poorly defined. Our study addresses this gap by developing senescence (seno)-resistant human mesenchymal [progenitor cells](https://www.sciencedirect.com/topics/biochemistry-genetics-and-molecular-biology/progenitor-cell) (SRCs), genetically fortified to enhance cellular resilience. In a 44-week trial, we intravenously delivered SRCs to aged macaques, noting a systemic reduction in aging indicators, such as cellular senescence, [chronic inflammation](https://www.sciencedirect.com/topics/pharmacology-toxicology-and-pharmaceutical-science/chronic-inflammation), and [tissue degeneration](https://www.sciencedirect.com/topics/pharmacology-toxicology-and-pharmaceutical-science/tissue-degeneration), without any detected [adverse effects](https://www.sciencedirect.com/topics/pharmacology-toxicology-and-pharmaceutical-science/adverse-event). Notably, SRC treatment enhanced brain architecture and cognitive function and alleviated the reproductive system decline. The restorative effects of SRCs are partly attributed to their exosomes, which combat cellular senescence. This study provides initial evidence that genetically modified human mesenchymal progenitors can slow primate aging, highlighting the therapeutic potential of regenerative approaches in combating age-related health decline.\"",
        "comments": [],
        "subreddit": "singularity"
    }
]