[
    {
        "post_name": "Mamdani’s NYC: Residents Raising a Stink over Garbage Piling Up",
        "score": 464,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You get what you fucking deserve. Think before you vote next time, faggots.",
                "author": "IAmDisappoint"
            },
            {
                "raw_content": "Ha ha! - Nelson",
                "author": "donkeyKang"
            },
            {
                "raw_content": "Boo hoo, commies.",
                "author": "seeling0"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Amelia is getting better every day.",
        "score": 532,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ah the movie Civil War where the director claims to not take sides because he wanted to remain neutral that ends with a black chick shooting Donald Trump in the head.",
                "author": "jhewish"
            },
            {
                "raw_content": "This is a reference to the movie \"Civil War\" where Meth Damon asked the group if they're Americans. Then asked them \"What kind of Americans?\"",
                "author": "NomadicKrow2"
            },
            {
                "raw_content": "Context would be nice. From the comments here very few Americans understand the need and purpose for \"Amelia\".",
                "author": "KartoffelPuffer"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I have determined that the fastest way to bring The Trump Kennedy Center to the highest level of Success, Beauty, and Grandeur, is to cease Entertainment Operations for an approximately two year period of time",
        "score": 472,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Watch the loonies complain about him closing something they now hate and swore to never bother with again.",
                "author": "EgregiousPhilbin"
            },
            {
                "raw_content": "Who gives a shit. I didn't vote for Trump to devote his time and energy to renovating a theater.",
                "author": "BlackPilledMAGA"
            },
            {
                "raw_content": "There are significant documented underground structures, tunnels, and more underneath the Kennedy center. (And throughout DC) Not everything is as it seems. Trust Trump.",
                "author": "DemPanicAtTheDisco"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Grammy host FAFO",
        "score": 170,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good. Sue them all. It's the only way they will stop their lies.",
                "author": "duckduck"
            },
            {
                "raw_content": "Just restore the Smith-Mundt Act for the sake of America. I pretty much voted for that. Lawsuits are getting old. Shut it off because everyone knows they are fake news by now including our enemy. The enemy has weaponized it and is out of control with wild agit-prop.",
                "author": "KennyKetchem"
            },
            {
                "raw_content": "Lol this Noah ain't gonna survive the flood!",
                "author": "DemPanicAtTheDisco"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The biggest problem our Country has is that the Democrats are SOFT ON CRIME!",
        "score": 835,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Democrats are in bed with crime and making next generation criminals.",
                "author": "AlvinOfTheTrumpmunks"
            },
            {
                "raw_content": "They aren't soft on crime. They are the criminals.",
                "author": "Spawnlingman"
            },
            {
                "raw_content": "Getting real tired of nobody getting arrested",
                "author": "Cropgun"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Just think? It has just been announced that the United States of America made more Steel last year, 2025, than the Great Country of Japan, a major Steelmaker.",
        "score": 804,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The fact that we are tight with Japan is amazing.",
                "author": "Skogin"
            },
            {
                "raw_content": "Made In America Steel that is a superior quality. Less rust, more durable and no more cheaper imports.",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "We should be the #1 producer in the world, AGAIN!",
                "author": "patrioticwinning3"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "JayZ scrubs social media as he goes on the run after being named in the Epstein Docs",
        "score": 847,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He got 99 problems and this Epstein shit are all of them :p",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "Gay and pedo people are all through rap world and NBA.",
                "author": "keeponwinning"
            },
            {
                "raw_content": "So that's why Beyonce was helping Kamala Harris to get elected during her campaign 2024 tour. So her husband, Jay Z's name and info would never get released with the Epstein files.",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Washington, DC had just one murder in January, an 80+% decline from last year and one of the safest months in DC history. The collapse in crime comes after President Trump called in the national guard last fall. Extraordinarily positive outcome receiving barely any attention.",
        "score": 643,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Trump saved 4 lives? I can’t math",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "We also have the lowest murder rate in over 100 years! Proof the democrats are *letting* crime happen!",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "The above is Fake News. BREAKING: Stephen Miller just revealed that a \"massive scandal\" has been uncovered in Washington DC. The Democrat-run police department has been extensively hiding crime statistics, going so far as reporting homicides as \"accidents instead of m*rders.\" https://x.com/RightScopee/status/2017772364986007640",
                "author": "FrenOrFoe"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "An alleged ICE agent was surrounded by a mob outside a Mexican restaurant in Minneapolis and assaulted. Something must be done about this.",
        "score": 684,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Run them all over....",
                "author": "This_will_be_public"
            },
            {
                "raw_content": "Allow ICE to file restraining orders. They would have to stay within a few blocks of an ICE agent. No more up close and in their faces harassing, intimidating and bullying. No more bullying ICE agents.",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "SHOOT THEM",
                "author": "redditadminssuckit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Perfectly disguised",
        "score": 812,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Just like JEFF FUCKING EPSTEIN in the video released yesterday. Holy shit. They interrupted the interview with a fake ringing phone in the background so the bastard could change clothes and put on different glasses. Dumbass said he was \"experimenting\" with his look for the interview ON CAMERA. FUCK THIS GUY.",
                "author": "lCEisNlCE"
            },
            {
                "raw_content": "John Miller",
                "author": "EgregiousPhilbin"
            },
            {
                "raw_content": "kek",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "New Yorkers are developing buyer's remorse for Zohran Mamdani, spotted HECKLING him and yelling \"SHAME!\" after basically nothing is going according to plan \"We advocated for you, we voted for you! You get up in here and lie to us!\" 😂😂",
        "score": 1163,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They are really really retarded",
                "author": "South_Florida_Guy"
            },
            {
                "raw_content": "I'm curious as to how many of them actually voted for him though. Much like the canadian elections I suspect there was mass amounts of voter fraud and the real numbers will be lost to time.",
                "author": "IamM"
            },
            {
                "raw_content": "He's a \"Democratic Socialist\" ie Nazi, so of course he lied to the public!",
                "author": "DLane1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Third Georgia Democratic state lawmaker accused of COVID-19 unemployment fraud by Trump DOJ. Rep. Dexter L. Sharper, who represents District 177, is the latest Democratic lawmaker facing federal charges of making false statements to obtain funds administered by the U.S. Department of Labor.",
        "score": 997,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Check his computer while you're at it. There's a gold mine to be found there worth at least ten more years in prison.",
                "author": "MythArcana"
            },
            {
                "raw_content": "WOW! It's a negroe. You don't see that every day",
                "author": "Sea_Still"
            },
            {
                "raw_content": "All blacks?",
                "author": "booblitchutz"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "MOVING DAY FOR LEARING CENTER?? U-Haul truck spotted at “Quality Learing Center.”",
        "score": 1031,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There goes our suitcases of tax dollars, right through TSA and into Somalia. 💰🧳✈️",
                "author": "MythArcana"
            },
            {
                "raw_content": "Wtf does this matter? Some shit came out yesterday and today about Epstein, was posted here (scroll back through \"new\") and fucking crickets.",
                "author": "BlackPiIIedMAGA"
            },
            {
                "raw_content": "Went from a Learing Center to a Leaving Center.",
                "author": "walls4america"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Dr. Oz Explains How the Hospice Fraud Scheme Works in California “The home health care business is being decimated … because so much money is getting sucked to Los Angeles … Gov. Newsom, do your job … You know this is a real problem. People are dying. Act that way.”",
        "score": 697,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">hospice >people are dying",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "\"Gov. Newsom, do your job.\" He *is* doing his job, just not in the way you perceive it. Reminder: the source of the problem cannot also be the solution.",
                "author": "knnbccb"
            },
            {
                "raw_content": "He is acting the way he does when there is death. Look at his shoulder shrugs talking about the burned down houses",
                "author": "MemoryHoleyeO"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "LAPD Declines Gov. Gavin Newsom’s Request to Start Civil War. \"One armed agency approaching another armed agency to create conflict doesn't make sense.\"",
        "score": 1303,
        "text_content": "",
        "comments": [
            {
                "raw_content": "LAPD is well aware it's a fight they will lose that will likely result in their officers going to jail...",
                "author": "AllisterTwo"
            },
            {
                "raw_content": "Dems are so fucking desperate",
                "author": "Brownwaterboys"
            },
            {
                "raw_content": "That traitor should be arrested!",
                "author": "patrioticwinning3"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump posted a photo of this 1989 letter from legendary Yankees owner George M. Steinbrenner encouraging him to run for president one day.",
        "score": 1291,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lol Oprah said the same thing",
                "author": "josiborg"
            },
            {
                "raw_content": "What the hell did you trade Jay Buhner for?!? He had 30 home runs, over 100 RBIs last year, he's got a rocket for an arm! YOU DONT KNOW WHAT THE HELL YOU'RE DOING!",
                "author": "TheMostUselessFeeder"
            },
            {
                "raw_content": "Side note: I recently discovered Morton Downey Jr on YouTube, 80’s tv was wild. This dude was incredibly based, as he ripped cigs in studio, red in the face & tearing apart his liberal guests calling them scum buckets and pukes. All while the crowd stood up hooting and hollering like a pack of jackals I have a hunch MDJ may have played a small role in influencing Trumps political style",
                "author": "bumpman"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Meet Tracey Butler-Johnson. A middle school mental health counselor in Jefferson middle school in @APSVirginia . She says she will “get in the face” of ICE agents and she might get shot protecting students.",
        "score": 907,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nutcase = mental health counselor",
                "author": "Salty_Sailor"
            },
            {
                "raw_content": "I look forward to the tik toc video of her crying in her car about getting fired",
                "author": "Sea_Still"
            },
            {
                "raw_content": "Nobody's even showing up in schools and taking kids. This is some sort of fantasy.",
                "author": "danneskjold"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ICYMI: Even Steve Forbes says Illhan and husband are Fraudsters who mustve made their money by means other than the market. He searched for them, and found no presence in any trade markets. RUH roh raggy head",
        "score": 1218,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There is more than enough evidence to arrest that cunt and her husband yesterday. Any one of us would in a cell right now",
                "author": "Sea_Still"
            },
            {
                "raw_content": "Imprison these corrupt tools in GITMO at hard labor for 20 years. Then have them swim/walk \"home\" to somalia. Seize all of their assets.",
                "author": "2025WhatIsTrue"
            },
            {
                "raw_content": "deport them with prejudice",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Rare Pepe Arising",
        "score": 373,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He needs big balls.",
                "author": "donkeyKang"
            },
            {
                "raw_content": "does that Pepe have high-pitched ribbits?",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Someone should make a giant inflatable Pepe....",
                "author": "KungPaoMcChicken"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Catturd: Funny how Zohran Mamdani has suddenly stopped tweeting about the Epstein files.",
        "score": 1726,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Funny how he ran for election, and the files were released a month late...after he won.",
                "author": "TheRealityOfItIs"
            },
            {
                "raw_content": "I had no idea he was groomed by Epstein. This makes a lot sense about his hidden gay infatuations.",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "It's funny to think about... But Mamdani's father is not Epstein. There are much more important, and more factual, revelations in those files.",
                "author": "24601"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Intel sets a 7467 MT/s+ memory requirement for Panther Lake Arc B-series iGPU branding, slower configs show up as “Intel Graphics”",
        "score": 214,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It is really impressive what Intel were able to achieve with Arc B390, using a traditional 128-bit memory bus. Nova Lake (2027) is rumoured to keep the same memory setup same (perhaps bump up to 10700 MT/s), while [bringing a modest 25% improvement](https://www.reddit.com/r/hardware/comments/1qmk1e9/intel_nova_lake_xe3p_igpus_could_be_25_more/). Razer Lake (2028) could be the next big leap forward, if it adopts LPDDR6.",
                "author": "Forsaken_Arm5698"
            },
            {
                "raw_content": "Nice, I like this approach, stops the end user who isn't an expert when reading specs from getting screwed over by slow ram killing their igpu performance. If you see the Arc B branding on the laptop you can be rest assured you're getting the right setup",
                "author": "FreyBentos"
            },
            {
                "raw_content": "how about. Quad channel for consumers Crazy idea, I know.",
                "author": "Wrong-Historian"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Asianometry] Silicon Valley Thinks TSMC is Braking the AI Boom",
        "score": 58,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Just saying what anyone in the industry already knows; volatility is insane. A couple years from now we will probably be talking about how cheap everything is and a lot of fabs (probably Samsung and Intel) will be idle. PS: TSMC has a dozen fabs under construction now. Hell even just in the US theres 6 logic fabs under construction among the 3 leading edge companies. It's not like people aren't trying. EDIT: Also rightly points out that the real bottleneck is power. If you think it takes a long time to build a fab just look up how long it takes to build a nuclear power plant.",
                "author": "Competitive_Towel811"
            },
            {
                "raw_content": "The speculation around ai will tank the global economy for a while. I just hope I'll be able to put food on the table. But it's looking dire. At one point or another, something's gotta give. We will still have ai in a few years, but the amount of capital without any obvious return path being pumped into this is crazy.",
                "author": "the_dude_that_faps"
            },
            {
                "raw_content": "TSMC are being realistic. They know this AI boom is unsustainable",
                "author": "Flat-Character4140"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Modders beat AMD to Multi Frame Generation and FSR4 on Radeon RX 7000, via DLSS Enabler - videocardz",
        "score": 235,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Its not perfect \"The test shows visible artifacts, and 3x multi-frame generation can look worse than expected in motion. You can get similar trade-offs with other third-party tools\"",
                "author": "NeroClaudius199907"
            },
            {
                "raw_content": "Horrible artifacting at 4X, frame pacing issues and unnecessary high lattency at 3x, making only 2x viable, at this point why install it even? No disrespect to the makers of the mod, I respect your work, time and effort, but for me it doesn't make sense to use.",
                "author": "AbrocomaRegular3529"
            },
            {
                "raw_content": "Did AMD fix the broken VRR FSR redstone FG release?",
                "author": "RedIndianRobin"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Galaxy S26 Ultra may run full version of Linux Terminal",
        "score": 99,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm not too technically versed in all this, but what's the significance of this for say, your average power user? Will it facilitate sideloading when Google eventually decides they don't like that anymore? Make rooting the device easier or something? Or is this mainly just a tool for developers?",
                "author": "5160_carbon_steel"
            },
            {
                "raw_content": "I wonder if this is related to Android merging with ChromeOS, which Google has been working on for a little while now. It'd be a shame if it becomes dominant and we get into more of a locked down walled garden via the play store as Google seems to want to do.",
                "author": "zxyzyxz"
            },
            {
                "raw_content": "All that and still stuck in 5000mah hell with mid ass sensors",
                "author": "Ortana45"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "PCCooler RZ820 Display CPU Cooler Review [HWBusters]",
        "score": 9,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TL;DR: If you have the chassis space for it, it's a top dog- as in, outperforms the NH-d15 gen2 for less in the screenless SKU - in a form that doesn't require marque specific cold plates at that, so it may well age better in one aspect if the fans hold out - but you'll want to keep a firm hand on that throttle as it uses ball bearings - not that you'll need to let it go beyond 25 dba. Mind, I'd like to see this thing go toe to toe with the JF800 or Gladius; either may well beat it on simple grounds of 'greater compatibility'. edit: and if I was in that cooler segment I'd probably still go for the marque-agnostic D15 Gen2 or either of the others mentioned simply because it may be easier to fix if a fan gives up.",
                "author": "Jeep-Eep"
            },
            {
                "raw_content": "What's up with the Intel results? some weird numbers like the Be Quiet 3 having 10c higher temps than the RZ820 but the RZ820 having 100mhz lower clock speed and on both the power consumption is the same",
                "author": "Loose_Skill6641"
            },
            {
                "raw_content": "I wish someone would review the seven heatpipe dual-tower RT720 that I've seen pop up on Amazon. Edit: also, I was excited to see the (currently unavailable) Amazon page / product info ion the Taiwan site for the Scythe Magoroku. The box looks cool lol.",
                "author": "Life_Menu_4094"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Pharmaceutical Giant Eli Lilly Prepares 'Magnol.Ai Band' Ankle-Worn Wearable, New FCC Filing Reveals",
        "score": 0,
        "text_content": "Came across a super interesting FCC filing today that's way off the beaten path. Pharmaceutical giant Eli Lilly (yeah, the Mounjaro company) just got approval for a wearable called the 'Magnol.Ai Band'. But get this - it's an *ankle-worn* device. All the tech points to it being a specialized clinical tool, not a consumer gadget: BLE for efficient data sync, magnetic charging, and a focus on long-term monitoring. The name and placement scream AI-powered gait or mobility analysis for drug trials. We won't get to see photos for a while since they're confidential, but it's a fascinating piece of purpose-built hardware from a non-tech company. Source: [https://www.fccidlookup.com/report/eli-lilly-magnol-ai-band-wearable-fcc-filing-2AS69-M2025](https://www.fccidlookup.com/report/eli-lilly-magnol-ai-band-wearable-fcc-filing-2AS69-M2025)",
        "comments": [
            {
                "raw_content": "I can see one obvious obstacle to ankle worn wearables gaining popularity - they might look too much like the ankle monitors various convicts on house arrest/work release have to wear. Especially since those aren't even the cool dangerous criminals doing hard time, or the more dangerous ones who never get caught at all. But instead the lame ones who got caught doing mild crimes.",
                "author": "GenericUser1983"
            },
            {
                "raw_content": "It says photos are confidential but the article has photos of what appears to be a wearable band, user manuals, and the test setup? The whole thing feels very AI-written. Lots of flowery and structured text that doesn't seem to follow from other things in the same article. In any case, it seems Magnol.Ai is an existing Lily brand? https://www.prnewswire.com/news-releases/proofpilot-to-integrate-lillys-magnolai-sensor-cloud-into-its-clinical-trial-automation-platform-301941848.html I wasn't familiar with it until looking into this band further, but seems like a clinical study version of the same sort of concept as Apple HealthKit on the consumer side: a kind of clearinghouse database where sensors and logs can write their data for analysis by other tools or by human viewers?",
                "author": "JtheNinja"
            },
            {
                "raw_content": "Interesting. Moving aside from the medical world, it seems that wearables only really caught on in the form of watches. I can see a market for arm bracelets and maybe ankle ones as a fashion statement. The main difficulty seems to be their usecase. Medical is well and good but it's hardly going to explode in popularity amound the general public.",
                "author": "ChaosSapphire"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "FINAL FANTASY IS WORTH IT",
        "score": 245,
        "text_content": "I played this game on the ps5 and ps5 pro. But it looks amazing on the Switch 2 it was so worth it. I feel so pumped in replaying it again. This 30fps feels responsive and not like some other games. The graphics Wow. 😲 impressive for a small handheld. Even owning a Pc with RTX 5090 I am happy to have this tiny little beast. Nvidia cooked.",
        "comments": [
            {
                "raw_content": "Playing it for the first time on the switch 2. Loving it so far, just got to chapter 8.",
                "author": "Clear_Problem9590"
            },
            {
                "raw_content": "Yeah I also completed it on PS4 previously but the portability on Switch 2 is awesome 👍🏼",
                "author": "zakpat"
            },
            {
                "raw_content": "I remember playing Final Fantasy Adventure back on the OG Gameboy, so that we can play FF7R in such quality portable really blows my mind.",
                "author": "Mysticwaterfall2"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Ever since my childhood, handheld devices have held a special place in my heart.",
        "score": 308,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I think you like Miku",
                "author": "Reasonable_Car_2126"
            },
            {
                "raw_content": "Same here. The gameboy sp, Nintendo ds, 3ds, and the Sony psp were all key parts of my childhood. So many awesome times were had.",
                "author": "c_rorick"
            },
            {
                "raw_content": "The psp and vita are my favorite handhelds of all time. I love the switch and steam deck, but those two will always have my heart.",
                "author": "Shadow_Strike99"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "As somebody who prefers games on the go I'm actually hyped for next week's partner direct.",
        "score": 239,
        "text_content": "To be clear I'd much rather a general direct as well but there's also a lot of games I'd love to play on the go as well, E33, Elden ring, Indiana Jones , Halo , the gears 1 remaster , etc and while I do have a steam deck I find that the few big AAA games that have trickled out to switch 2 so far have perfomed better than they do on steam deck. Starwars outlaws being a night and day difference same with ff7 remake and while the steamdeck can run FF&re at 40fps it also has horrible stutters starting at wall market. Its the main advantage the switch 2 has over my steamdeck, a higher install base which means tailored ports optimized for the switch 2. What 3rd party game are you looking forward to.",
        "comments": [
            {
                "raw_content": "I'm fairly certain people are going to enjoy Partner Showcases a lot more during Switch 2 generation. More third party games are coming and there's a quality standard that is much higher than the potato ports we've been used to in the past 10 years. Just the thought of having Persona 4 Revival, Metaphor, Doom The Dark Ages in the showcase next week already makes it on par with any general Direct we could have had.",
                "author": "Medd-"
            },
            {
                "raw_content": "Idk I feel like they still wanna save the heavy hitters for the main directs, last partners direct was pretty ass",
                "author": "drakev6304"
            },
            {
                "raw_content": "People are weird. There's posts complaning about not having enough third party games and others saying Switch 2 is disappointing because there's a bunch of older third party games that most people played already on better systems. For a seven month console, it's light years better than any Nintendo console regarding third party support and have the potential to get even better. You played the game on your PC at 8k and 240fps? Good for you, not everyone can afford having multiple consoles or a pc.",
                "author": "kahabraham"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Final Fantasy VII Remake Demo Has Been Updated",
        "score": 56,
        "text_content": "FFVII REMAKE INTERGRADE DEMO has been updated, now it’s at version 1.1.0. Does anyone have any patch notes or information on what may have been changed? It’s slightly unusual for demos to be updated, usually once the game releases the updates all go to the main game, not the demo",
        "comments": [
            {
                "raw_content": "Square-Enix tends to be better at this than usual. There was a game-breaking glitch in the Switch version of Dragon Quest XI S that caused constant crashing, but when that was patched, the demo received the patch as well.",
                "author": "Narrator-1"
            },
            {
                "raw_content": "Did the demo previously mention the early purchase bonus? Could be just updated to remove that since the deal is over",
                "author": "Yarra10313"
            },
            {
                "raw_content": "Gonna just go with more stability. The final release of the game had more smooth camera turns and slightly better aliasing",
                "author": "Urd-ong_Shadong47"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Almost defeated by the MK World gods",
        "score": 103,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They did NOT want you winning lmao.",
                "author": "NaN-Nanashi"
            },
            {
                "raw_content": "Great finish with the Goombas charging at you like that 😆",
                "author": "gothamz77"
            },
            {
                "raw_content": "Nice finish",
                "author": "synced999"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "AttackTheBacklog hearing about another Nintendo Direct possibly happening 3rd week of Feb or around March, as told by different sources",
        "score": 142,
        "text_content": "source: https://www.youtube.com/watch?v=EZmOH4klmf4&t=10293s (2:51:33) From a AttackTheBacklog recent stream with Nash Weedle, he mentioned that his sources are apparently split on when the next Direct could happen. One source is pointing to the 3rd week of February, while another points for it to be around March, but not necessarily MAR10 Day. Also, Nash Weedle suggested that this General Direct is where we would see the next 3D Mario, which he says it's Nintendo big title for 2026, alongside the new Monolith Soft game.",
        "comments": [
            {
                "raw_content": "Those are just safe guesses conveniently avoiding State of Play week and Pokémon Presents week.",
                "author": "Medd-"
            },
            {
                "raw_content": "Nash Weedle is like tier 8 or 9",
                "author": "slingking5"
            },
            {
                "raw_content": "trying to recreate the high of last year's march 27th direct followed by the april 2nd switch 2 direct? word",
                "author": "TiocStudios"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Video of unreleased Prince of Persia Remake press kit",
        "score": 89,
        "text_content": "https://m.youtube.com/watch?v=bUDpym7hwx0",
        "comments": [
            {
                "raw_content": "The discourse surrounding this game is so weird. Ubisoft gets shit on all the time for releasing \"broken\" games so here they are, cancelling something that simply didn't come together. And now you have the usual suspects yelling about this too. There's no winning. The only games you can be sure gamers don't hate is the ones that never come out.",
                "author": "RollingDownTheHills"
            },
            {
                "raw_content": "Wish they at least release it I mean it couldn't be that bad",
                "author": "Previous_Bee6494"
            },
            {
                "raw_content": "I can’t wait for this shit to leak",
                "author": "AmberDuke05"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "YouTube could launch on Switch 2 this month",
        "score": 439,
        "text_content": "https://bsky.app/profile/mynintendonews.com/post/3mdsgevail42q",
        "comments": [
            {
                "raw_content": "this could change everything ...",
                "author": "theirlcosmokramer"
            },
            {
                "raw_content": "youtube goty 2026",
                "author": "TACO_NV"
            },
            {
                "raw_content": "The biggest shock to me about this is that the Switch 2 doesn’t currently have a YT app.",
                "author": "vashthestampede121"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "BlazBlue Entropy Effect X Rated for Switch 2",
        "score": 114,
        "text_content": "Currently the game is set to release on February 12 for PS5, Xbox Series X/S and Switch 1. [https://www.esrb.org/ratings/40983/blazblue-entropy-effect-x/](https://www.esrb.org/ratings/40983/blazblue-entropy-effect-x/)",
        "comments": [
            {
                "raw_content": "Partner Showcase coded",
                "author": "Halil-Heyman"
            },
            {
                "raw_content": "So X is the story mode? I genuinely don't know, I love ASW, Blazblue and Roguelites but the inconsistency in their sales makes me skeptical that the game will be dogshit.",
                "author": "ShhImTheRealDeadpool"
            },
            {
                "raw_content": "I read this as the game being X rated",
                "author": "markbraggs"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "ASRock motherboards are now killing Ryzen 5 9600X CPUs, four cases in two weeks",
        "score": 155,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Selection bias is a helluva drug. And all this because 2 years ago one goober installed their AM5 CPU with the system upright and it got reposted everywhere.",
                "author": "fragbait0"
            },
            {
                "raw_content": "It’s hard to say whether it’s directly the boards fault or other issues. Faulty PSU, maybe the user overclocked the living hell out of it. Maybe the cooler was incorrectly inserted resulting in improper cooling. A lot of factors Edit: yes it could definitely be AMD’s fault. Bad silicon does happen, but that isn’t to say that all of these failures are AMD’s nor the motherboards fault.",
                "author": "DisturbedFennel"
            },
            {
                "raw_content": "the problem with these articles is even though they are reported as such doesn't mean that the motherboard is actually the cause. Like i have a high suspicion that early 9800x3ds had some sort of defect or issue. The 9600x i can't say. Asrock, whether you like it or not, are more for budget conscious builds so there is going to be more of them in use. Some of these issues can be user error.",
                "author": "Cradenz"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "ACER launches Radeon RX 9070XT & RX 9070 NITRO WHITE series",
        "score": 14,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "Robot struggles to shovel snow",
        "score": 679,
        "text_content": "",
        "comments": [
            {
                "raw_content": "![gif](giphy|IZY2SE2JmPgFG) Unitree in 10 years looking for these MFers who laughed at him",
                "author": "MutinybyMuses"
            },
            {
                "raw_content": "I love robots and ai. … just need it on the record for the future",
                "author": "willBlockYouIfRude"
            },
            {
                "raw_content": "I bet it would do a lot better with some ice boots. There's no traction, you would fall too.",
                "author": "gekx"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Sonnet 5 next week?",
        "score": 347,
        "text_content": "x.com/chetaslua/status/2018048507417075794?s=46 From the post: \\> 1 million context \\> 1/2 the price of opus 4.5 < better in all area> \\> trained on TPUs \\>Faster will mogs every model in agentic coding model information from Vertex, Sonnet 5 is expected to be released as early as next week.",
        "comments": [
            {
                "raw_content": "Highly likely, been a lot of leaks recently. GPT 5.3 and Gemini 3 ga or 3.5 also coming soon.",
                "author": "Setsuiii"
            },
            {
                "raw_content": "Big if true",
                "author": "BrennusSokol"
            },
            {
                "raw_content": "Opus 4.5 is already so far ahead in my book across the board for my uses. Sonnet 5 could legitimately be a competition killer",
                "author": "Tinderfury"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Shanghai scientists create computer chip in fiber thinner than a human hair, yet can withstand crushing force of 15.6 tons",
        "score": 719,
        "text_content": "Scientists at Fudan University in Shanghai have developed a flexible **fiber chip** as thin as a human hair (approximately 50–70 micrometers) that remains functional after being crushed by a 15.6-ton container truck. **Key Features of the Fiber Chip** **Transistor Density:** The fiber integrates up to 100,000 transistors per centimeter. A one-meter strand has processing power comparable to a classic computer CPU. **\"Sushi Roll\" Design:** Unlike traditional rigid silicon chips, researchers used a multilayered spiral architecture, rolling thin circuit layers onto an elastic substrate like a sushi roll to maximize internal space. **Extreme Durability:** Beyond withstanding 15.6 tons of pressure, the fiber can **survive** 10,000 bending cycles, stretching by 30%, and temperatures up to 100°C. It is also machine-washable. **Applications:** The technology is intended for smart textiles (clothing that acts as a computer), brain-computer interfaces (BCIs) due to its softness and immersive VR gloves that provide tactile feedback. **Source:** [Tom's Hardware](https://www.tomshardware.com/tech-industry/sun-shanghai-scientists-create-computer-chip-in-fiber-thinner-than-a-human-hair-touted-as-ideal-for-brain-computer-interfaces-vr-wearables-and-smart-textiles) / [SCMP](https://www.scmp.com/news/china/science/article/3341025/chinese-scientists-shrink-semiconductor-chip-fibre-thin-human-hair)",
        "comments": [
            {
                "raw_content": "The study was published in the journal [Nature](https://www.nature.com/articles/s41586-025-09974-0) in late January 2026",
                "author": "BuildwithVignesh"
            },
            {
                "raw_content": "Someone missed a decimal point, human hair is 50 to 100 microns wide. That is easily 10 times wider.",
                "author": "KidKilobyte"
            },
            {
                "raw_content": ">A one-meter strand has processing power comparable to a classic computer CPU. I assume that's scaled up naively. Stretching out a processor die over 1 meter would introduce severe latency.",
                "author": "Practical-Hand203"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Deepmind's new Aletheia agent appears to have solved Erdős-1051 autonomously",
        "score": 41,
        "text_content": "From their \"[superhuman](https://github.com/google-deepmind/superhuman)\" repo, commits still in progress as of this writing, Aletheia is: >A reasoning agent powered by Gemini Deep Think that can iteratively generate, verify, and revise solutions. >This release includes prompts and outputs from Aletheia on research level math problems. The [Aletheia directory](https://github.com/google-deepmind/superhuman/tree/main/aletheia) doesn't contain code, just prompts and outputs from the model: >A generalization of Erdos-1051, proving irrationality of certain rapidly converging series: [tex](https://github.com/google-deepmind/superhuman/blob/main/aletheia/BKKKZ26/BKKKZ26.tex), [pdf](https://github.com/google-deepmind/superhuman/blob/main/aletheia/BKKKZ26/BKKKZ26.pdf) ([full paper](https://arxiv.org/abs/2601.21442)). >Results from a semi-autonomous case study on applying Gemini to open Erdős problems: [tex](https://github.com/google-deepmind/superhuman/blob/main/aletheia/Erdos/Erdos.tex), [pdf](https://github.com/google-deepmind/superhuman/blob/main/aletheia/Erdos/Erdos.pdf) ([full paper](https://arxiv.org/abs/2601.22401)). >Computations of eigenweights for the Arithmetic Hirzebruch Proportionality Principle of Feng--Yun--Zhang: [tex](https://github.com/google-deepmind/superhuman/blob/main/aletheia/F26/F26.tex), [pdf](https://github.com/google-deepmind/superhuman/blob/main/aletheia/F26/F26.pdf) ([full paper](https://arxiv.org/abs/2601.23245)). >An initial case of a non-trivial eigenweight computation: [tex](https://github.com/google-deepmind/superhuman/blob/main/aletheia/FYZ26/FYZ26.tex), [pdf](https://github.com/google-deepmind/superhuman/blob/main/aletheia/FYZ26/FYZ26.pdf) ([full paper](https://arxiv.org/abs/2601.18557)). >A mathematical input to the paper \"Strongly polynomial iterations for robust Markov chains\" by Asadi–Chatterjee–Goharshady– Karrabi–Montaseri–Pagano. It establishes that specific bounded combinations of numbers are in polynomially many dyadic intervals: [tex](https://github.com/google-deepmind/superhuman/blob/main/aletheia/ACGKMP/ACGKMP.tex), [pdf](https://github.com/google-deepmind/superhuman/blob/main/aletheia/ACGKMP/ACGKMP.pdf) ([full paper](https://arxiv.org/abs/2601.23229)). Erdős-1051 is currently classified as one of two Erdős problems solved fully and autonomously by AI on Terence Tao's [tracking page](https://github.com/teorth/erdosproblems/wiki/AI-contributions-to-Erd%C5%91s-problems): https://preview.redd.it/x6kxezqr61hg1.png?width=926&format=png&auto=webp&s=66611d7d73e9a6c5b1cc267004128cefffabf1d4 If you're unfamiliar with Erdős problems, that page also provides excellent context and caveats that are worth a read (and which explain why the positions of entries on the page may shift over time). I expect Deepmind will publish more about the agent itself soon.",
        "comments": [
            {
                "raw_content": "The preprint [Semi-Autonomous Mathematics Discovery with Gemini: A Case Study on the Erdős Problems](https://arxiv.org/abs/2601.22401v1) has a bit more context. The solution to 1051 was part of a larger sweep using Aletheia, which appears to have been built for that purpose: >Aletheia: a specialized math research agent. From December 2–9 (2025), we deployed a custom mathematics research agent built upon Gemini Deep Think, internally codenamed Aletheia at Google DeepMind \\[FTB+\\], on the then-700 Erdős problems still marked as ‘Open’ in Bloom’s database. Crucially, Aletheia includes a (natural language) verifier mechanism that helped narrow the pool of problems to examine: from the original 700 problem prompts, 212 responses came back as potentially correct 1051 appears to be the most promising result of the sweep, but they describe even that very conservatively: >We tentatively believe Aletheia’s solution to Erdős-1051 represents an early example of an AI system autonomously resolving a slightly non-trivial open Erdős problem of somewhat broader (mild) mathematical interest, for which there exists past literature on closely-related problems \\[KN16\\], but none fully resolve Erdős-1051. It looks like Aletheia/Deep Think was also useful in finding literature for other problems marked \"open\", which is consistent with Terence Tao's comments about how AI can help.",
                "author": "xirzon"
            },
            {
                "raw_content": "Surely this is the biggest result by autonomous AI in math so far? The other fully listed autonomous resolution was a counter-example construction and Tao commented that he was surprised Erdos & Graham missed it. From page 6 here [https://arxiv.org/pdf/2601.22401](https://arxiv.org/pdf/2601.22401) : \"We tentatively believe Aletheia’s solution to Erdős-1051 represents an early example of an AI system autonomously resolving a slightly non-trivial open Erdős problem of somewhat broader (mild) mathematical interest, for which there exists past literature on closely-related problems \\[KN16\\], but none fully resolve Erdős-1051. Moreover, it does not appear obvious to us that Aletheia’s solution is directly inspired by any previous human argument (unlike in many previously discussed cases), but it does appear to involve a classical idea of moving to the series tail and applying Mahler’s criterion. The solution to Erdős-1051 was generalized further, in a collaborative effort by Aletheia together with human mathematicians and Gemini Deep Think, to produce the research paper \\[BKK+26\\].\"",
                "author": "HeTalksInMaths"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "World’s first downward-drilling autonomous robot drills data centers 10× faster with 99.97% accuracy",
        "score": 290,
        "text_content": "Amidst a rapid **expansion** of more than 400 data centers in development around the world, US Power manufacturer DEWALT in collaboration with August Robotics has unveiled an autonomous, fleet-capable, downward-drilling robot. This innovation specifically addresses the labor shortage and high-precision requirements of constructing modern, large-scale data centers. **Source:** DEWALT",
        "comments": [
            {
                "raw_content": "When AI and autonomous technology makes that leap more from virtual/digital environments to the physical world that's when I think the real threat to human labor comes in. When robots can successfully breakdown, inspect, measure and rebuild an engine fully independently without human assistance then we are cooked. I repair machinery with tight tolerances, specific metal compositions and dozens of small parts and am curious to see how a modern robot would handle the task",
                "author": "HumbertHumbertHumber"
            },
            {
                "raw_content": "I know it is cool, but it sounds so funny. I wonder if it will get angry when you put it on its side and try to force it do sideways drilling.",
                "author": "Geritas"
            },
            {
                "raw_content": "That's badass. What kind of precision are they achieving? Also DeWalt robotics??? 😮",
                "author": "Anen-o-me"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The singularity will enable unimaginable progress—but assuming we still have a say, why would humanity keep pushing forward?",
        "score": 35,
        "text_content": "Once the singularity happens, the practical problems get solved. Scarcity, disease, maybe even death. But assuming machine intelligence doesn't just take over completely and humans still have agency in the trajectory—what's actually driving us to keep going? This video essay follows the logical advancements of the Kardashev scale, but asks a different question: what is beyond this? The thesis is that transcendence isn't a means to an end—it is the end. Curious what this community thinks. After the singularity, is there a point where humanity would just stop and enjoy itself? Or is the compulsion to transcend built into us?",
        "comments": [
            {
                "raw_content": "The point is that ASI would do things we could not. Just as the cells in your body created an ASI they called \"the brain\" that they use to gather resources and defend the colony that you call your body. The cells in your body doesn't understand what mortgage is, but you need it to be sheltered at night. Your cells don't understand what a \"job\" is, but you need it to feed yourself. You as an ASI is keeping your cells supplied and protected. You as an ASI can also abuse the cells by taking up bad sleeping habits or substance abuse. None the less the cells are better off that you exist, even though they can't control you directly. ASI would make us better off than we could do on our own. It would be outside our control, but we will be better with it than without it.",
                "author": "VallenValiant"
            },
            {
                "raw_content": "I just wanna get to type 1. Chillin in my holodeck not giving AF.",
                "author": "w1zzypooh"
            },
            {
                "raw_content": "Cause we want it to be even more betterer in perpetuity",
                "author": "cwrighky"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI is rolling out beta ads on ChatGPT with a minimum of $200k from selected advertisers",
        "score": 78,
        "text_content": "For some brands, ad testing starts as early as February 6. OpenAI is asking select advertisers to commit at least $200,000 as it rolls out beta ads on ChatGPT, the company confirmed to ADWEEK. The beta is small and tightly controlled. An OpenAI spokesperson said the limited scope of the test is deliberate, intended to see what types of ads provide value for users, with pricing at $60 CPM. The company added that it plans to introduce additional ad formats and buying models over time, once it determines how advertising can be integrated in a more additive way, but declined to provide specifics. Four clients represented by search intelligence platform Adthena were approached for $250,000. **Source:** Adweek (Exclusive)",
        "comments": [
            {
                "raw_content": "60cpm is actually crazy high",
                "author": "PewPewDiie"
            },
            {
                "raw_content": "Someone on X apparently had access to the beta and he said that they don't currently give any analytics about ads you run. You just give them 200k and trust that they are deploying the ad properly, this is insane if it's accurate.",
                "author": "BurtingOff"
            },
            {
                "raw_content": "Conflict of interest coming right up.",
                "author": "Profanion"
            }
        ],
        "subreddit": "singularity"
    }
]