[
    {
        "post_name": "DJT did it all in 6 months.",
        "score": 482,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Gas prices have only gone up where I am since January, for some reason. I filled up for $2.68 in January and it's $3.15 now. I don't get it.",
                "author": "Ronaldus"
            },
            {
                "raw_content": "If the deep state isn’t smashed it will all be undone on day one of the next presidency. /doom",
                "author": "Wexit-Delecto"
            },
            {
                "raw_content": "Everything's gone up for me because I live in a blue state but I assume people in states with low taxes and COL are doing much better than they were before. I make 6 figures doing what I like, so at the end of the day I can't complain",
                "author": "UCantStumpTheTrump"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "As men age they all get that 'receding hairline' look",
        "score": 401,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He could just shave and paste his sideburns to his hairline",
                "author": "2EyesOpen"
            },
            {
                "raw_content": "To think HW Bush knows exactly the shape and taste of this man's penis",
                "author": "HoldMyDangle"
            },
            {
                "raw_content": "Like the circle is necessary. It only detracts from the recession. It's almost a double negative",
                "author": "InterloperKO"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "AZ State Senator Wendy Rogers Fires off Letter to White House Requesting Audit of Arizona Election Systems",
        "score": 442,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TWO",
                "author": "MoreVanceMemes"
            },
            {
                "raw_content": "I hope it was sternly worded.",
                "author": "Petes_Agate_Israel"
            },
            {
                "raw_content": "will the audit be televised? 🍿",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨🚨HUGE BREAKING — Trump admin to END H1B lottery, replacing it with a MERIT BASED, HIGH SKILLED system.",
        "score": 1579,
        "text_content": "",
        "comments": [
            {
                "raw_content": "All immigration is replacement immigration.",
                "author": "Wexit-Delecto"
            },
            {
                "raw_content": "We already have this. Its called the O-1 Visa program. Its for geniuses and world-class athletes. Those are the only people we should be bringing in. There are more than enough Americans to do all the good jobs here. Trump should end H1-B and deport any currently here.",
                "author": "9999999999"
            },
            {
                "raw_content": "Eh, I'd rather H-1B be eliminated and the ones already here get deported.",
                "author": "kippo_hard"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "In a span of three hours...",
        "score": 1723,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He's the greatest Biden in a thousand generations.",
                "author": "FadingLight"
            },
            {
                "raw_content": "Guy had the full blown crack jitters the entire interview. Even had to grab hold of his chair to keep himself still.",
                "author": "inksday"
            },
            {
                "raw_content": ">claimed Israel allowed October 7 A broken cokehead is allowed to be right at least once in his lifetime I suppose.",
                "author": "IonlyReplytoBots"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The DOJ has just FIRED Carolyn Feinstein after I exposed the fact that she is married to Joshua Aaron Feinstein, the founder of the ICEBlock App, and that the app is registered to the home she lives in with her husband! Another SCALP! #LOOMERED",
        "score": 1545,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Laura Loomer should receive a salary for her work.",
                "author": "Scatter-Shot"
            },
            {
                "raw_content": "Feinstein. A fine Christian name that is.",
                "author": "Bldg_2019"
            },
            {
                "raw_content": "I know many here don't like her, but like James O'Keefe, she truly is becoming a national treasure for exposing these scumbags.",
                "author": "ImYourHuckleberry24"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Obama himself manufactured the Russia, Russia, Russia HOAX. Crooked Hillary, Sleepy Joe, and numerous others participated in this, THE CRIME OF THE CENTURY!. Irrefutable EVIDENCE. A major threat to our Country!!!",
        "score": 1321,
        "text_content": "",
        "comments": [
            {
                "raw_content": "HIT THEM BACK **TEN TIMES HARDER**",
                "author": "TEXinLA"
            },
            {
                "raw_content": "Arrest them then. Enough of the tease.",
                "author": "Ivleeeg"
            },
            {
                "raw_content": "Now arrest these vermin or nothing will change. Accountability is what all voted for. This is the scorched Earth GEOTUS we know and love. MAGA AF",
                "author": "Mulletgunning"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Victor Davis Hanson: “This was a three-year project to overturn the will of the American people—Makes Watergate look like small potatoes….”",
        "score": 844,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Then when that failed they released Covid.",
                "author": "TommyLasordasBallBag"
            },
            {
                "raw_content": "Watergate was the final act of the JFK hit.",
                "author": "BruddahIz"
            },
            {
                "raw_content": "FUCKING ARREST SOME CUNT!!",
                "author": "MAGA_KAG_2020"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Tom Homan on NYC: \"We're going to FLOOD THE ZONE of sanctuary cities. We're sending additional agents... If they don't give us access to the bad guy in Rikers Island or at the precincts, then we'll go into the neighborhood and find him. We're not going to give up on this.\"",
        "score": 917,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's good, I still want them to do better than 7k a day. They need the full support of all LEOs. 7k a day is 2.5 mil a year and we need more than that.",
                "author": "Grimarr"
            },
            {
                "raw_content": "The 2030 Census is literally what's at stake if they don't ramp up deportations. Fuck court dates, fuck immigration judges (why do we even have those, [just fire them from DOJ](https://www.perplexity.ai/search/which-branch-of-government-are-AZZodKKWRmybJuYK5mPBOg)), fuck due process for illegals. It's illegal be be an illegal immigrant.",
                "author": "McFatty7"
            },
            {
                "raw_content": "Tom is a good dude",
                "author": "YodaBannon"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Close, but no cigarillo",
        "score": 987,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ironically, this is not the first time that Dems have gotten mad about their slave labor being taken away.",
                "author": "DoucheTranslator"
            },
            {
                "raw_content": "Illegals prolly don’t want to clean my shitter either just sayin # 🐸 KEK",
                "author": "deletedandreacted"
            },
            {
                "raw_content": "Without illegals, who’s gonna cook his crack for him?",
                "author": "DJT_MFers1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Never Forget: Obama pledged to Make America Gay Again",
        "score": 908,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Be nice the see the sauce -- maybe the May 6, 2016, letter that is referenced??",
                "author": "GoldwaterVoter"
            },
            {
                "raw_content": "There is no such thing as a transgender child.",
                "author": "Taqiyya_Mockingbird"
            },
            {
                "raw_content": "America was never gay",
                "author": "jsphere256"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "CONFIRMED: Peace Talks Between Russia and Ukraine to Take Place This Week in Turkey",
        "score": 670,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So who do you think is gonna screw this up? My money is Zelenski running his mouth.",
                "author": "Just_a_Patriot"
            },
            {
                "raw_content": "Cool beans, that should be their business and our focus should be in America thinking up American solutions to American problems. We don't need to referee every dispute in the world.",
                "author": "LordKuroTheGreat"
            },
            {
                "raw_content": "I honestly forgot about this meat grinder the past month or so with all the Israel and Epstein drama.",
                "author": "NADSAQ"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "@StephenM : Can you imagine getting a lecture on public safety from the party that gleefully let child rapists and murderers into our country en masse? Do you have any idea how many little girls have been raped and killed by the illegals THEY let in? And they want to lecture US?",
        "score": 1044,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Stephen Miller is the strongest MAGA voice we have.",
                "author": "Th3Cho0sing0ne"
            },
            {
                "raw_content": "Let them lecture us. From behind bars.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "It's pretty SOP for communists.",
                "author": "ColonelKlink"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨#BREAKING: The White House has removed the Wall Street Journal from pool of reporters covering President Trump's weekend trip to Scotland",
        "score": 1615,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Kicking Mockingbird media right in the dick by excluding their access is one of my favorite things that Trump does. 99% of them are propagandist pieces of shit.",
                "author": "Bldg_2019"
            },
            {
                "raw_content": "Yup. FAFO, pricks.",
                "author": "MemeWarsVet"
            },
            {
                "raw_content": "Judge incoming to ensure they can go.",
                "author": "Hamadryad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The FAA Academy just saw the “highest number of Academy students in FAA HISTORY” for new air traffic controllers. Onsite training: +30%",
        "score": 424,
        "text_content": "",
        "comments": [
            {
                "raw_content": "But are they DEI hires? Because that has been the actual issue at the FAA",
                "author": "racer513"
            },
            {
                "raw_content": "The FAA is in a middle of a lawsuit that says hundred of people with perfect scores were turned down because of their race.",
                "author": "yukondave"
            },
            {
                "raw_content": "This is all pete buttfuckers fault, that guy had no business being in that position.He was there as a puppet to promote DEI and endanger lives",
                "author": "USNVET71"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Democrats and celebrities raised $50m for the victims of the Los Angeles fires. But where did that money actually go? Not to the victims but rather nonprofits and into the pockets of high-salary executives and staff teams.",
        "score": 1479,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Everything Leftists do involves theft.",
                "author": "ThorsonTT"
            },
            {
                "raw_content": "It’s with the victim’s money in Maui",
                "author": "KnoxVegasGirl"
            },
            {
                "raw_content": "Democrats love stealing money.",
                "author": "TrancePhreak"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "👺Soros Network Behind Lawsuit Claiming Trump Is Violating Rights of Illegal Aliens Detained at ‘Alligator Alcatraz’ 👨🏽‍👩🏽‍👧🏽‍👦🏽",
        "score": 1079,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Soros has openly stated that his goal is the destruction of the U.S.A. He and his spawn need to be arrested and deported.",
                "author": "TheAftermath"
            },
            {
                "raw_content": "Wasn't it already ruled that illegals are not protected by the constitution? They don't have rights while they are here illegally. This should be DOA.",
                "author": "Azill"
            },
            {
                "raw_content": "Rights? What rights? They have no rights. They're illegal.",
                "author": "DingleBalls"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Blood climate change",
        "score": 927,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Oh noooo, that sucks. Anyways...",
                "author": "AVeryNakedMan"
            },
            {
                "raw_content": "Refugees NOT WELCOME",
                "author": "Gunmolester"
            },
            {
                "raw_content": "Because when the town turns black, it's time to pack.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump's Recent Wins",
        "score": 379,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I picked a bad day to stop sniffing glue",
                "author": "YodaBannon"
            },
            {
                "raw_content": "can’t stop winning 🚂🏆",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Colbert doesnt get punched?",
                "author": "kwakkles"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "House Speaker Mike Johnson: No Vote on Releasing Jeffrey Epstein Documents Before Recess",
        "score": 365,
        "text_content": "",
        "comments": [
            {
                "raw_content": "they're hoping the energy dies out.",
                "author": "toast"
            },
            {
                "raw_content": "Pedos not wanting to expose themselves? At least publicly...",
                "author": "Ryanaissance"
            },
            {
                "raw_content": "is recess 2 weeks?",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "CPU/GPU Scaling: 7600X vs. 9800X3D (RTX 5090, 5080, RX 9070 & 9060 XT)",
        "score": 144,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I know they hate the setting but they need to test more games with RT because RT hammers the CPU.",
                "author": "Jellyfish_McSaveloy"
            },
            {
                "raw_content": "Are any of the games known to be particularly CPU-heavy? Would've been nice to see sims like MSFS/X-Plane or similarly taxing turn-based/builder games as those normally see the biggest benefit from a CPU upgrade vs the usual games tested.",
                "author": "Iggydang"
            },
            {
                "raw_content": "Just to note - those results might be valid for Native, but once you factor DLSS for example where you render at lower res, your CPU will matter more as well.",
                "author": "NGGKroze"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD and Stability AI Enable Local AI Image Generation on NPU-Powered Laptops",
        "score": 34,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Didn't Stability AI go bankrupt after they did a 180 on all their promises and values and shady shit they pulled?",
                "author": "StickiStickman"
            },
            {
                "raw_content": "Nobody cares. Local AI is a joke.",
                "author": "One-End1795"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Vintage computing boffin releases expansive Intel 286 test suite",
        "score": 23,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "We're saved! 👀",
        "score": 605,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/c0ubglxncbef1.jpeg?width=438&format=pjpg&auto=webp&s=ea32aeb624cf8d100a043f8604203de100afe106",
                "author": "shadow0wolf0"
            },
            {
                "raw_content": "https://preview.redd.it/6i55nm1sibef1.jpeg?width=680&format=pjpg&auto=webp&s=2209b2986cad62944c93fdcfea803f90d6267c11",
                "author": "IvyWonderer"
            },
            {
                "raw_content": "dk on his way to absolutely demolish local nations land while stealing their natural gold resources and ancient treasures",
                "author": "Jaraghan"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Why Nintendo's release schedule through the end of 2025 (likely) isn't final",
        "score": 114,
        "text_content": "Note: I also posted this to r/NintendoSwitch, but I originally planned on posting it here, and I was given the blessing to still post it here verbatim by one of the mods. https://preview.redd.it/ld4pl72oycef1.png?width=1270&format=png&auto=webp&s=0267701bc9b84ed2644c3fc16dd489ec125b403b A relatively common assumption I've seen these last few months is that Nintendo already has their entire 2025 lineup announced, with the reasoning usually amounting to \"they have a game lined up for every month\" or \"the Switch also had a monthly release cadence in 2017.\" It's certainly not impossible, but I think there are plenty of holes in that argument, as well as reasons to believe at least one more first-party title will be announced for release this year, and I wanted to break down both. And that's on top of Splatoon Raiders. However, that's partly because contrary to the initial reporting, the game doesn't appear to have actually been rated yet (the announcement video showed a combined E10+-Rating Pending label, and Splatoon 3 is E10+). The trailer was also a relatively straightforward teaser that didn't tell us much about the game at all. My money is on it being a 2026 release, still within the Switch 2's first overall year, but that could also be the case for all of the potential releases I mention later; I just think it's likely there's at least one more game that gets announced for 2025. First, why I think the argument is flawed: \\- Nintendo skipped the months of February, April, and May this year. Suppose we're holding Nintendo to a game-a-month average, which was fairly typical in the later years of the Switch. In that case, they're technically behind on at least one month, depending on if Welcome Tour and Drag x Drive meaningfully count as much smaller-scale releases than has been the norm for Nintendo lately, and if Splatoon Raiders is a 2025 release. Switch 2 Editions are essentially next-gen exclusive DLC, so they're in the same category as the physical bundles that Gen 8 and 9 of Pokemon and Mario Kart 8 Deluxe received, and they take up less resources, so I wouldn't count them toward the quota. \\- The later months of the year are when Nintendo tends to double-up on releases per month. October in particular had 2 releases every year during the Switch generation except for 2018 (when excluding The World Ends With You: Final Remix) and 2024. \\- During the Switch's first year, development resources were being split across it and the 3DS, and many of Nintendo's regular partners like Intelligent Systems, Grezzo, and Game Freak released their 2017 games solely on 3DS. Everything is now centered around the Switch family of systems, so at minimum, anything in development is going to be playable on Switch 2, even if they don't make it a formal cross-gen release for whatever reason. While there's bound to be some evening out because Switch/Switch 2 games take longer to make, the Switch's first year was held back by Nintendo's continued 3DS support, particularly in that it didn't receive a November game aside from Snipperclips getting DLC and a retail release while that system got Pokemon Ultra Sun and Moon, despite that slot usually being treated as a core part of the holiday lineup across the systems Nintendo supports. \\- As things stand now, Nintendo's holiday lineup consists solely of cross-generation releases and less proven spinoffs, which isn't ideal when trying to sell a brand-new system during its first holiday season. While the last Hyrule Warriors took the main holiday 2020 release slot, COVID messed everything up that year, and I imagine Nintendo originally wanted Bowser's Fury to fulfill that role before settling on Age of Calamity because of its ties to Breath of the Wild. And while Sakurai's involvement with Kirby Air Riders is bound to raise its profile, that's mostly going to resonate with the core Nintendo audience and overlaps with Mario Kart World among the casual crowd. And that's if it even releases this year - [as relayed by Bill Trinen, Sakurai's apparently said we won't have any news on it for \"quite a while,\" ](https://www.ign.com/articles/our-big-nintendo-switch-2-interview-with-nintendo-of-americas-bill-trinen)and considering that Super Smash Bros. Brawl and Kid Icarus Uprising were both delayed out of their original release years, it wouldn't be a shock for Air Riders to receive this treatment. I think the single most telling sign that we have more in store for this year, though, is the distinct lack of anything announced for the 40th anniversary of Super Mario Bros. Considering how they tied 4 releases to the 35th anniversary (with Super Mario Bros. 35 and Super Mario 3D All-Stars being explicit tie-ins), it would come as quite the surprise if the 40th anniversary came and went without any games being tied to it. I feel like there has to be something, even if it's as simple as Super Mario Bros. 40 or a Switch 2 Edition of Super Mario Bros. Wonder while the \"big\" release slips into 2026, much like how Bowser's Fury slipped into 2021. I hesitate to say Super Mario Maker 3 because EPD 10 launched 2 games in 2023 (Pikmin 4 and Wonder), though. There are also another 2 games that aren't formally on the release schedule, but our knowledge of them comes directly from the horse's mouth instead of dubious rumors: \\- In the Switch 2 Direct, an icon for Yoshi's Woolly World was shown slightly off-screen when backwards-compatible Switch games were being discussed. While evidently an error and likely confused for Crafted World, in the icon, one of the Poochy Pups from the 3DS cover art can be seen in a slightly different position from where it appears on there. [Here, the Poochy Pup is level with the leaves on the tree in the background.](https://preview.redd.it/40s6f5vvxcef1.png?width=1863&format=png&auto=webp&s=9a3006e8810f4aae95d8f2020cf889759f632606) [In the Switch icon, shown directly right of the \\\\\"Game Type\\\\\" arrow, this Poochy Pup can be seen moved down to be in line with the tree's branch. Other artwork for Poochy and Yoshi's Woolly World doesn't depict it there at all, from what I can tell, so this icon is unique to this image and suggests a port is indeed on the way.](https://preview.redd.it/8vcgd0s8ycef1.png?width=1080&format=png&auto=webp&s=06f4d04d9a4827d0707610b4c0376aac0c6b8fb9) I do think there's a good chance this port simply releases as a Switch 1 game that comes with the equivalent of a Switch 2 patch built in, given it's not a new release and isn't likely to implement much of the Switch 2's unique features, but it would nevertheless help fill out the release schedule and give Switch 1 owners a nice reprieve from their currently 4-month drought of first-party releases (if it comes soon). \\- The Nintendo Switch Online Playtest Program is perhaps the least likely candidate of anything I mention here, as it was only just announced that a second playtest is imminent, and I doubt its only purpose would be making sure the servers for the game can handle more players before a 2025 launch. 2026 seems more likely now. I was one of the original 10,000 playtesters, though, and having actually played it, it is very much intended as its own project and not the \"feature\" Nintendo's vaguely been calling it. I don't want to say much more because they're being stingy on people talking about it publicly, aside from the public knowledge that [both of the directors of the original Splatoon are working on it](https://www.freepatentsonline.com/20250083046.pdf), but it is their most ambitious online game/new IP since Splatoon and is very content-rich even in its pre-release state. I mean, the initial playtest datamine uncovered a 70+ song soundtrack. What I'm getting at is that it's not something they've thrown together to test something for another game, which I'm still seeing people assume (I already saw \"the next Animal Crossing will be an MMO\" come up in response to the playtest's return). Lastly, there are 5 developers I want to mention that are likely to have their next games release soon...potentially as soon as this year. \\- While EPD is largely covered, with each core team either having a game already announced/out for Switch 2 (EPD 4 appears to be behind Welcome Tour and the Playtest game, with Drag x Drive likely also being theirs; EPD 5 is presumably on Splatoon Raiders; EPD 8 did Bananza; EPD 9 made Mario Kart World) or having released games too recently to expect much for now (EPD 3 with Tears of the Kingdom and supervising Echoes of Wisdom, EPD 10 with Pikmin 4 and Mario Wonder), EPD 5 likely is deep in development on Animal Crossing. Contrary to popular belief, the Animal Crossing and Splatoon teams are not actually shared outright. It's [mostly the leadership at EPD 5 that is shared between the two, alongside some of the art and music teams](https://youtu.be/pFsyJmGj4K8?t=300), with the core programming staff being separate. So the next Animal Crossing is likely quite far along now, and it would be quite the holiday heavy-hitter this year if it happens. \\- Next Level Games has had a steady 3-year release cadence since Luigi's Mansion: Dark Moon in 2013, so as long as that holds true, they'll have a game ready to go this year. That's not to say their games have had 3-year cycles, though, as Luigi's Mansion 3 began life on the Wii U (so likely in 2014-2015). Battle League was a smaller project, and 3 did so well that Luigi's Mansion is arguably third in the pantheon of Mario spinoffs after the Party and Kart games now, so it would be an ideal second release in October if it's ready. \\- Intelligent Systems averages one game release per year. The only year they've skipped since 1997 is 2022, and even then, they released 2 games in 2023 to make up for that (and Fire Emblem Engage was seemingly done for as long as a year before it came out). If nothing else, if they miss this year, they'll probably have 2 games next year; Rhythm Heaven Groove is likely their project, since they shared a team with the WarioWare series and that was moved over to Intelligent Systems in full beginning with Gold, but that team also shares responsibility for Paper Mario (with TTYD being a remake with a lot of outsourcing, with Tose working on it extensively), meaning the Fire Emblem team is due for a game. \\- Camelot Software Planning has been quiet since Mario Golf: Super Rush launched 4 years ago, which is the longest they've ever gone without releasing anything. They're a small developer (only 40 employees right now), but we can expect to hear from them soon. I do wonder if they're doing something other than a Mario sports game, especially with many dormant Nintendo IPs getting revived as of late (e.g. Another Code, Famicom Detective Club, Tomodachi Life, Rhythm Heaven, and Endless Ocean), but I wouldn't count on Golden Sun 4. \\- Lastly, Bandai Namco's Pokemon team, which is separate from the Studio 2/Studio S group they have for Sakurai's games and development support on EPD projects (Pokken and New Snap shared leadership, I believe, with largely different staff otherwise) has been quiet since 2021. It's not likely that whatever they were working on was their Nintendo project that was ambiguously either cancelled or put on hold last year, either, as it was said to have been commissioned by Nintendo and not The Pokemon Company, who has coordinated their collaborations before. New Pokemon Snap was the most successful non-mobile spinoff for the series in quite some time, so a sequel would make sense, though another possibility might be a rhythm game drawing from Bandai Namco's work on the Taiko no Tatsujin series (and in the future, I can see them taking on the task of a successor to the Game Boy Color Trading Card Game RPGs, since Pocket's success likely has TPC wanting to cash in as they did with the Let's Go games). Again, I want to stress that I at most expect to see 1-2 more announcements for 2025, with every other potential release being slated for 2026 or later instead should they come to fruition. I just wanted to get some thoughts I've been sitting on out there (before the Pokemon Presents tomorrow) and mention everything that still has a shot at coming this year while sticking to more viable possibilities and ignoring the rumor mill. If anyone cared enough to skim through this, I appreciate it.",
        "comments": [
            {
                "raw_content": "This is the longest post I've ever seen on Reddit. Bravo for the commitment OP.",
                "author": "adamps1"
            },
            {
                "raw_content": "I’m not reading all that. Happy for you though, or sorry that happened.",
                "author": "Hugh_Jegantlers"
            },
            {
                "raw_content": "Thyere gonna announce crazy third party support at the end of the month.",
                "author": "GatheringCircle"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "…that was quick",
        "score": 532,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What’s this about and what are the perks?",
                "author": "Rent-Man"
            },
            {
                "raw_content": "Got it too guess that’s nice I got picked right away",
                "author": "NoeloDa"
            },
            {
                "raw_content": "I was like a second late and got in I saw it go red, clicked the button, it loaded for a bit then said \"you've been selected\", seems like this was much easier than last time",
                "author": "ryzenguy111"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I customized my Switch 2 case with heat transfer vinyl",
        "score": 59,
        "text_content": "I drew the vector art, cut the vinyl with my cutting machine, and applied it to a third party galaxy pattern case with a Cricket iron. It’s not perfect but for one of my first attempts with the medium I think it came out pretty well, and it’s cool to have a one of a kind case!",
        "comments": [
            {
                "raw_content": "well that's just sick as hell",
                "author": "ayyyyycrisp"
            },
            {
                "raw_content": "that's sick, I can only imagine how long it took",
                "author": "TensionZestyclose321"
            },
            {
                "raw_content": "That looks awesome!",
                "author": "WelcomeAwkward924"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "NSO PLAYTEST PROGRAM OPEN",
        "score": 324,
        "text_content": "GO GO GO",
        "comments": [
            {
                "raw_content": "Says the application period has ended for me",
                "author": "wuskis"
            },
            {
                "raw_content": "Says I’ve been selected and to wait until Thursday. Guess that’s a good thing.",
                "author": "kaminari1"
            },
            {
                "raw_content": "I got in. My friend who tried 1 minute in couldn’t get in. 😬",
                "author": "kitnb"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "PSA: The Shadow Labyrinth Switch 2 upgrade for the Switch physical card is region specific",
        "score": 15,
        "text_content": "I bought the Japanese Switch physical release, and downloaded the upgrade from the US eShop. It created a separate icon, which is what you see on the right in the photo. It did not detect the physical card, and clicking it promts that I need to buy the game. Tried it with my Hong Kong account, and it just created a third icon (which I deleted). So what I did was change the region of one of my accounts to Japan, bought the upgrade from the Japan eShop (thankfully, it costs 0), and it was automatically applied to the game. By the way, if you're having frame rate issues in docked mode, users reported that changing the TV output to 1080p fixes the issue.",
        "comments": [
            {
                "raw_content": "Guessed that this would be the case since that's how DLC works, sucks for the small subset of people who have foreign physical copies especially since Temu seems to be trying to get into the game with their Hong Kong copies. Hope nobody else gets burned by this. Sucks especially for Japanese collectors like yourself since they phased out PayPal for Japanese accounts.",
                "author": "ohmygodnewjeans"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Discussion, News, and Request Thread - week beginning 07/21/25",
        "score": 48,
        "text_content": "Discussion threads are your weekly central hub for all requests, gaming news, and any other gaming topics you want to talk about. *Please keep all content that doesn't need it's own post to this thread to de-clutter the sub for proper leaks and rumors. Thanks!* **Join our new companion sub for super secret Resident EVIL 9 and Half-Life 3 leaks** \\-- [r/OkBuddyGLAR](https://new.reddit.com/r/OkBuddyGLAR/) Hot Threads of the past week: * [ FromSoftware Deep Into Development on Unannounced Project Codenamed “FMC\"](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1m2kli4/fromsoftware_deep_into_development_on_unannounced/) * [ Mass layoffs are underway at Virtuos, the studio behind Oblivion Remastered](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1m1g17z/mass_layoffs_are_underway_at_virtuos_the_studio/) * [ Elder Scrolls VI is currently \"quite playable\"](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1m07lm0/jez_corden_says_he_has_heard_that_elder_scrolls/) * [Laid off King staff set to be replaced by the AI tools they helped build](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1m0efmp/mobilegamerbiz_laid_off_king_staff_set_to_be/) * [Leaked creator package sent by EA confirms the title of 'Battlefield 6' for the upcoming Battlefield](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1m3hnzd/tom_henderson_leaked_creator_package_sent_by_ea/) # [Want to help us improve this subreddit? ](https://forms.gle/w9JaYTjVN1Zie9e39)[Provide us with feedback here](https://forms.gle/w9JaYTjVN1Zie9e39)[!](https://forms.gle/w9JaYTjVN1Zie9e39) # [Click here to join the discord to enjoy further conversations with the community!](https://discord.gg/6jdBvCSqbj)",
        "comments": [
            {
                "raw_content": "Hoping for news on the FFIX Remake. At least a confirmation on if it's canceled or not. I worry that Nates contact got tarred and feathered. Square Enix has been such a wild card lately that even with the NVIDIA leaks, there is still a layer of uncertainty on if the project is still moving forward.",
                "author": "BuyMyBeans"
            },
            {
                "raw_content": "I really wanna know if FFIX Remake was cancelled or not",
                "author": "Spinjitsuninja"
            },
            {
                "raw_content": "In Nate we trust lol",
                "author": "LuigiWarrior"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Shpeshal Nick: Fable Won't Release in 2026",
        "score": 161,
        "text_content": "https://www.youtube.com/live/gB3q8GursaM?si=qRpGO-139OKoHWVY Timestamp 1:38:57 Nick: My information is that it's not going to be 2026 Jesse: Your Xbox information is always wrong Nick: I dunno, I've heard it from two different people now that Fable may slip to 2027, and that's not \"ah doom and gloom with the game, problems.\" Just hearing that it's taking a little bit longer than expected. I put this as Grain of Salt myself, so be civil in the comments? Thanks Internet!",
        "comments": [
            {
                "raw_content": "\"Your Xbox information is always wrong\" lmao",
                "author": "boonjun"
            },
            {
                "raw_content": "\"Yeah my info may be often wrong but this time I heard from one to two people\"",
                "author": "Jammyyyyyyyyyyyyy"
            },
            {
                "raw_content": "I love that he’s called out for always being wrong and his reply is to say “yeah so what? This time you should just trust me”",
                "author": "Automatic_Goal_5563"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Battlefield 6 beta build publication date is August 4th per the EA App. API also has \"early open beta access\" which may indicate preorders will open soon",
        "score": 373,
        "text_content": "https://preview.redd.it/ea-app-added-support-for-bf6-in-the-ea-app-client-turned-v0-uvaw2coiw7ef1.jpeg?auto=webp&s=01b6fe727500f21f12f5fcc96538f39e83dbda0b https://preview.redd.it/bf6-open-beta-build-scheduled-for-august-4th-not-v0-k1k0sfqey6ef1.png?width=640&crop=smart&auto=webp&s=73943e167e707d53ed89876f41c4459da5dc68c4 https://preview.redd.it/bf6-open-beta-build-scheduled-for-august-4th-not-v0-1pa5ppgwz6ef1.jpeg?width=1068&format=pjpg&auto=webp&s=4d9e5a032b931661166b2682542cee9eadda0bb4 https://www.reddit.com/r/Battlefield/comments/1m5dtee/comment/n4b5squ/ This doesn't exactly mean the beta will start on August 4th, this is just the build publication date",
        "comments": [
            {
                "raw_content": "Please for the love of god let the game not be a buggy mess This might be the franchise last shot and hearing crunch stories from developers isn’t strinking confidence.",
                "author": "pingas_launcher"
            },
            {
                "raw_content": "So october it is.",
                "author": "Kintraills1993"
            },
            {
                "raw_content": "I haven’t really enjoyed a Battlefield game since Battlefield 4, and I haven’t “loved” one since Battlefield 3. You really have to think that this is their last chance at delivering a BF game that isn’t a massive disappointment.",
                "author": "dynesor"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "A Lenovo manufacturing facility reportedly closed in China and now Legion Go 2 protoypes are widely circulating",
        "score": 265,
        "text_content": "https://www.reddit.com/r/LegionGo/comments/1m5dgoo/legion_go_2_is_widely_available_in_china_now/ https://videocardz.com/newz/lenovo-legion-go-2-prototypes-leak-in-china-ahead-of-official-launch https://www.bilibili.com/video/BV1t1gBzaEPK/?spm_id_from=333.337.search-card.all.click&vd_source=beb862c4f6cf54419a4474a71a228ca8",
        "comments": [
            {
                "raw_content": "Somewhat related, but do we still not have any handhelds that have an OLED and VRR panel?",
                "author": "smartazjb0y"
            },
            {
                "raw_content": "I used to pray tor times like this",
                "author": "sgiindigo2"
            },
            {
                "raw_content": "Let me know when one gets listed for sale",
                "author": "Resh_IX"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "CPU/GPU Scaling: 7600X vs. 9800X3D (RTX 5090, 5080, RX 9070 & 9060 XT)",
        "score": 64,
        "text_content": "",
        "comments": [
            {
                "raw_content": "for me the x3D pops off best when playing something like big MMOs and there are a lot of players on screen. id like to see benchmarks somehow include busy cities like in wow or ff14",
                "author": "Upset_Programmer6508"
            },
            {
                "raw_content": "Odd choice with the 9070 and not 9070XT",
                "author": "FoxBearBear"
            },
            {
                "raw_content": "what's wrong with wh40k Space Marine 2, modern non-X3D CPU bottlenecks at 1080p and 1440p at <100fps lol",
                "author": "CarelessAd6651"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD and Stability AI Enable Local AI Image Generation on NPU-Powered Laptops",
        "score": 42,
        "text_content": "",
        "comments": [
            {
                "raw_content": "linux ?",
                "author": "GreyXor"
            },
            {
                "raw_content": "Finally found an application that can max out my NPU at 100% on my Ryzen AI 300 laptop. Edit: keyword based content filter on a LOCAL generator? Really?",
                "author": "996forever"
            },
            {
                "raw_content": "Possible to run on a 1st gen XDNA (aka Ryzen 7040/8040)?",
                "author": "Aware-Bath7518"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Lenovo Legion Go 2 prototypes leak in China ahead of official launch",
        "score": 15,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Externally exactly like the previous one for all intents and purposes... Unless I'm missing something?",
                "author": "astrobarn"
            },
            {
                "raw_content": "Probably not the prototype",
                "author": "neo-the-anguisher"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Ryzen Threadripper PRO 9995WX hits 185K in Cinebench R23 at 5GHz all-core, pulling 947W",
        "score": 28,
        "text_content": "",
        "comments": [
            {
                "raw_content": "God dam",
                "author": "ComprehensiveOil6890"
            },
            {
                "raw_content": "Does anyone know the CB2024 score?",
                "author": "996forever"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "CPU/GPU Scaling: 7600X vs. 9800X3D (RTX 5090, 5080, RX 9070 & 9060 XT)",
        "score": 20,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What I get from this is that you don't really NEED that 9800X3D until you have a 5090 or 5080 at least. At any level below might as well spend the extra money on getting a better GPU.",
                "author": "ArseBurner"
            },
            {
                "raw_content": "I wish they showed upscaling differences ...",
                "author": "caiteha"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "1 in 7 Pending Home Sales Fell Through Last Month, The Highest June Level on Record",
        "score": 349,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Prices still too high. People are getting cold feet about spending 50% of their take-home on a mortgage.",
                "author": "Likely_a_bot"
            },
            {
                "raw_content": "Saw a 1.5 million dollar home at peak now at 1mm. Layoffs, RTO, high interest, high cost of living, and uncertainty. A house is still a house at the end of the day. If you can afford a nice one get one otherwise there's a risk of losing everything.",
                "author": "Intelligent-Use177"
            },
            {
                "raw_content": "It's weird, my neighbor got above their asking price within a day of listing it. Meanwhile my uncle is downsizing and just bought a house for like 10% below asking.",
                "author": "AtomicBlastCandy"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Can explain what has been going on with the market for the last 30-60 days?",
        "score": 16,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I will go ahead and add my anecdote to this. I have been a professional real estate photographer for over 10 years in the DFW metroplex. I work for one of the largest RE photography companies in the state with many different brokers and agents. Most of my business is dealing with agents listing existing home resale on the MLS. This has been the slowest July I have ever seen in over a decade, especially over the last 2-3 weeks its like someone flipped a light switch and everything just fell off a cliff. This should be prime listing season where I am so swamped I barely have time to unwind before having to go out the next day and do it all over again for months on end. Right now its about as busy as it is during winter. And I am hearing similar things from other photographers and agents I shoot for. My wife works for a brokerage office as part of a team and is saying similar thing for her team as well as the greater office overall. Although inventory is increasing (from slower sales pace attrition and longer days on market), new listings are still under where they were in 2022 so far according to redfin data and thats how I make a living. In addition looks like new listings peaked early around April this year, usually listings peak in June or July. Lots of sellers delisting as well because they are not selling for the price they could a year or two ago. I have really not experienced anything like this before in all my time doing this it really feels like the market is about to break apart. I feel like we are really going to see some significant price declines heading into the fall and winter off season. And once that happens and sellers finally get the memo hopefully listings explode back to pre 2020 levels again and build from there.",
                "author": "GreenFeather05"
            },
            {
                "raw_content": "there's nothing - and i mean nothing outside of not having a job - that'll stop crazy house people from buying. they'll miserably eat ramen noodles and forgoe every vacation or luxury and push retirement back decades for the privilege to pay the bank 5X the cost of their house over 30 years.",
                "author": "75657466151"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Will House Prices Decline Nationally in 2025?",
        "score": 64,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nationally there will be a slight price decline. I'm also going to go out on a limb here and say that lower interest rates will flood the market with inventory putting more pressure on prices. This narrative that home prices go up with every 1% change in interest rate is about to be debunked.",
                "author": "Fresh-Piglet2500"
            },
            {
                "raw_content": "Most forecasts for 2025 were for U.S. house prices to increase modestly in the 3% to 4% range. My early view was “mostly flat prices nationally in 2025” with some areas seeing price declines. I didn’t expect either a crash in prices or a surge in prices. With inventory increasing, year-over-year (YoY) price growth has slowed nationally, and declining in many areas. The following table shows the YoY price slowdown. Note that the median price is impacted by the mix of homes sold. The seasonally adjusted Case-Shiller National Index is essentially unchanged year-to-date (YTD). The index was at 327.81 in December 2024 and was at 327.90 in the April report. And the Freddie Mac HPI SA is down slightly YTD. The index was at 299.29 in December, and is now at 297.69, a decline of 0.5%. Other measures are also indicating a slowdown in the YoY growth, but not a collapse in prices. ICE reported this morning: Annual Home Price Growth Slowed to 1.3% in June * Annual home price growth slowed to 1.3% in June, from 1.6% in May, the slowest rate in two years * 27 of the 100 largest U.S. markets saw annual price declines in June, a softness not seen since the immediate aftermath of the Fed’s initial rate increases in 2022 * Home prices rose by a modest 0.03% in the month on a seasonally adjusted basis, the equivalent of a seasonally adjusted annualized rate (SAAR) of +0.36%, suggesting a propensity for further slowing **Based on the trend, the increase in inventory (and months-of-supply), it appears house prices will be unchanged or down slightly in 2025.** And that means real house prices (inflation adjusted) will be down this year. As of April, real house prices (based on the Case-Shiller National Index) are down 1.7% from the peak in 2022. Here is an updated graph I posted three years: House Price Declines: How Long for Real Prices to Recover? The real return following the ‘79 peak was 6.5 years. It took 11 years for real prices to reach the previous peak following the peak in ‘89. And it took 14.5 years to return to the real peak reached during the housing bubble. It has now been 35 months since the real peak in house prices. The key is it typically takes a long time for prices to return to the previous real price peak.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "Yup, already happening.",
                "author": "Particular_Reality19"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Boomers Are Sitting on Nearly $19 Trillion in Real Estate—Here’s Where They Hold the Most Housing Wealth",
        "score": 68,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Im so glad they're gonna be able to take all of it to the grave. There's gonna be a lot of nice-looking cemeteries very soon. Good on them :)",
                "author": "t3sl422"
            },
            {
                "raw_content": "Soon Florida will be wiped away by flooding and hurricanes while insurance claims are denied.",
                "author": "vand3lay1ndustries"
            },
            {
                "raw_content": "Florida? The current market value vs equity has to be significant. Like they bought for $100k, current value is $700k using current comps, and they have not tapped that equity. This all doubtful.",
                "author": "unsupported_user"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Greater Boston’s housing market reached new heights with the median price for a single-family home topping $1 million",
        "score": 120,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Bro where the fuck is that part of the populace getting millions of fucking dollars. I’m making a lot in salary at this point for people in my STEM field. And the most i could possibly afford is 600k, and i’d be house poor.",
                "author": "Infamous-Sea-1644"
            },
            {
                "raw_content": "This is what happens when you have a lot of dual income households making at least 300-400k/year and not enough housing stock. Boston area is still well below pre pandemic housing inventory, and even then inventory was considered too low.",
                "author": "Badtakesingeneral"
            },
            {
                "raw_content": "rAtE cUtS nOw!",
                "author": "Lojic_team"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "New Listings of U.S. Homes Fall to Lowest Level in Nearly Two Years",
        "score": 57,
        "text_content": "",
        "comments": [
            {
                "raw_content": "* Sluggish homebuying demand and a pileup of inventory are deterring prospective home sellers, some of whom are opting to rent their homes out instead of sell. * Existing-home sales hit a nine-month low as record-high home prices dissuaded buyers. * Home sales, prices and listings are holding up relatively well in the Rust Belt, which has attracted buyers because it’s affordable. New listings of U.S. homes for sale fell 3.2% in June to the lowest seasonally-adjusted level since October 2023. That’s the biggest month-over-month decline since February 2023. New listings fell 3.4% year over year, the first annual decline since October 2023. Active listings—the total number of homes for sale—fell 0.3% month over month in June. That’s the first decline since July 2023 on a seasonally-adjusted basis. Still, active listings were up 13.3% from a year earlier, sitting near the highest level in five years. “The balance of power in the housing market has shifted toward buyers because listings have piled up and demand has slowed down,” said Redfin Senior Economist Asad Khan. “Prospective sellers are feeling discouraged by this new reality. Some are reacting by staying put or renting their homes out instead of selling—especially if they’re at risk of taking a haircut.” The slowdown in listings marks a reversal from the start of the year, when the story of the U.S. housing market was rising supply; listings piled up because the mortgage rate lock-in effect eased and demand simultaneously slowed due to high housing costs and economic uncertainty. Sellers were forced to lower their prices after watching their homes linger on the market for weeks, and in some cases, months. Now, some are opting to forgo selling. “For many folks who bought at the peak of the pandemic market, selling might not be the best option right now,” said Connie Durnal, a Redfin Premier real estate agent in the Dallas area. “I have several clients who purchased their homes in early 2022 and need to move, but the math is just really, really tight. I’m advising them to lease their homes out if they can’t afford to take a loss. I think I will have a lot of clients coming back to list this time next year.” Home Sales Dipped in June as Prices Hit a Record High Pending home sales fell 2.2% month over month in June to the lowest level since November 2023 on a seasonally-adjusted basis, and dropped 2.4% year over year. Existing-home sales came in at a seasonally adjusted annual rate of 4,159,943—little changed from both a month and a year earlier, but the lowest level in nine months. Roughly 57,000 home-purchase agreements were canceled in June as high housing costs gave buyers cold feet. That’s equal to 14.9% of homes that went under contract last month—the highest June rate in records dating back to 2017.* The median home sale price hit a record high of $447,035 in June, and mortgage rates hovered near 7%—more than twice the record low hit during the pandemic. One piece of good news for buyers is that prices aren’t rising as quickly as they were in the past; the median sale price climbed 1% year over year in June—roughly on par with the prior month’s 0.7% growth, which was the slowest in roughly two years. Homes are also less likely to sell for above their asking price than in the past, a sign that buyers have bargaining power. Less than one-third (30.9%) of homes that sold in June went for over their list price, the lowest June share in five years. Redfin predicts home prices will begin falling on a year-over-year basis by the end of 2025. When demand is slow, it’s critical for sellers to make sure their homes are priced fairly and in good condition, Redfin agents say. They also advise buyers not to rule out homes that are priced beyond their budget, as sellers may be willing to come down on price or offer concessions. *Please note that homes that fell out of contract during a given month didn’t necessarily go under contract the same month. For example, a home that fell out of contract in June could have gone under contract in May. The Typical Home Takes Over a Month to Sell The typical home that went under contract in June sat on the market for 39 days, up from 33 days a year earlier and the longest span for any June since 2020. Roughly two in five (38.3%) homes that went under contract did so within two weeks, down from 43.1% a year earlier and the lowest June share since 2017. June 2025 Metro-Level Highlights: Sales, Prices and Listings Are Rising Quickly in the Rust Belt The figures below are based on a list of the 50 most populous U.S. metropolitan areas. Some metros may be removed from time to time to ensure data accuracy. Refer to our metrics definition page for explanations of metrics used in this report. Metro-level data are not seasonally adjusted. All changes below represent year-over-year changes. Sales * Pending sales rose most in Virginia Beach, VA (14.4%), Dallas (8.2%) and Warren, MI (8.1%). Six of the 10 metros where pending sales rose fastest are in the Rust Belt, which has attracted homebuyers because it’s relatively affordable. * Pending sales fell most in Florida: Fort Lauderdale, FL (-11.7%), Las Vegas (-11.3%) and Miami (-11%) saw the biggest declines. Florida is home to four of the 10 metros where pending sales fell fastest. * Closed home sales rose most in the Midwest, with the largest increases in Cincinnati (11.4%), Milwaukee (11.1%) and Virginia Beach (10.7%). Four of the 10 metros where closed sales rose fastest are in the Midwest. * Closed home sales fell most in Florida: Fort Lauderdale (-23%), Miami (-16.1%) and West Palm Beach, FL (-12.2%) saw the biggest declines. Prices * Prices rose most in Newark, NJ (8.9%), Detroit (8.6%) and Cleveland (8.1%). Six of the 10 metros where prices rose fastest are in the Rust Belt. * Prices fell most in Oakland, CA (-4.6%), West Palm Beach (-4.1%) and Jacksonville (-3.9%). Of the 12 metros where prices fell, four are in Florida and three are in Texas. Housing markets across Florida and Texas have cooled rapidly amid a surge in homebuilding, rising insurance costs and extreme weather events. Supply * New listings rose most in Warren (13%), Boston (9.8%) and Cincinnati (8.9%). Five of the 10 metros where new listings rose fastest are in the Rust Belt. * New listings fell most in San Francisco (-17.2%), Tampa, FL (-14.1%) and Nassau County, NY (-13.6%). California is home to five of the 10 metros where new listings fell fastest. * Active listings rose most in Las Vegas (34.5%), Dallas (29%) and Anaheim, CA (29.6%). Seven of the 10 metros where active listings rose fastest are in the West. * Active listings fell in three metros: Nassau County (-7.2%), San Francisco (-5.7%) and Kansas City, MO (-0.1%). Speed/Competition * Florida saw the biggest uptick in days on market: In Miami, the typical home that went under contract did so in 88 days, up 23 days from a year earlier—the biggest increase among the metros Redfin analyzed. Next came Fort Lauderdale (+17 days) and Orlando, FL (+16 days). * Days on market dropped in three metros: Kansas City, MO (-8 days), Chicago (-1 day) and New York (-1 day). * Homes were most likely to sell above their list price in Newark (69.6% of homes sold above list), Nassau County (58.2%) and San Francisco (58.1%). * Homes were least likely to sell above their list price in Florida: West Palm Beach (5.7%), Fort Lauderdale (7.6%) and Miami (7.6%) had the lowest share of homes selling above list.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "We know this. Anyone who doesn’t absolutely need to sell right now is waiting until rates drop or something else happens. Anyone still on the market into this winter is cooked. Even people who want to upgrade can’t justify doubling their mortgage for a similar or slightly better house.",
                "author": "DesignerCalendar5104"
            },
            {
                "raw_content": "Lowest since 2023 :p",
                "author": "sifl1202"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "S&P 500 posts first close above 6,300; Nasdaq hits a record ahead of big tech earnings",
        "score": 15,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The S&P 500 moved higher on Monday as optimism around earnings overshadowed any investor fears over the latest developments in trade. The broad market index rose 0.14% and closed at 6,305.60 — marking the first time it ended a session above the 6,300 threshold. The Nasdaq Composite jumped 0.38% for a closing record of 20,974.17. Both indexes hit new all-time intraday highs earlier in the session, bolstered by advances in major technology names like Meta Platforms and Amazon . The Dow Jones Industrial Average slipped 19.12 points, or 0.04%, and settled at 44,323.07. This comes as earnings season is off to a strong start. Verizon shares popped 4% following a second-quarter earnings beat, spurring excitement that other reports will come in strong. It joins 62 S&P 500 companies that have reported thus far. Of those, more than 85% have topped expectations, according to FactSet data. Earnings for the second quarter are also tracking 5% year-over-year growth following the first week of results, per Bank of America. Alphabet was a standout in the session, increasing more than 2% ahead of its quarterly results Wednesday after the bell. That name as well as Tesla — the first of the “Magnificent Seven” companies set to report — could boost the major averages if they manage to beat estimates. Shares of the electric vehicle maker ended the session marginally lower. The megacaps are expected to be a major driver of earnings growth during the second-quarter earnings season, and FactSet’s John Butters expects the “Magnificent Seven” to post earnings growth of 14% in the second quarter compared to the other 493 S&P 500 companies that are seen posting growth of just 3.4%. Confidence toward this earnings season was in focus among investors, even as the White House reiterated its position on tariffs over the weekend. On Sunday, U.S. Commerce Secretary Howard Lutnick called Aug. 1 the “hard deadline” for countries to start paying tariffs, though he also added that “nothing stops countries from talking to us after Aug. 1.” “Rarely do you injure yourself falling out of a basement window. With expectations so low in earnings, I think that the end result will end up being better than anticipated,” Sam Stovall, chief investment strategist at CFRA Research, told CNBC. “That is encouraging for the market as well.” More broadly, Stovall pointed out that the market is doing “what it normally does,” revealing that it tends to advance on average about another 10% after recovering all of its losses from a decline of up to 20%. With that, he thinks the S&P 500 could reach 6,600 before slipping into a new decline, which implies upside of about 4.7% from Monday’s closing level. “A lot of the negativity has typically been shaken out of the market during these corrections, and now we’re seeing articles about maybe the economy is not as bad as we thought it was, consumer confidence is on the mend and we’re not seeing the inflation numbers be adversely affected by tariffs,” Stovall continued. “Maybe it’s just a matter of time before those things kick in, but at least for now, I think investors are saying, ‘You know what, the market is indicating that it wants to go higher.’",
                "author": "SnortingElk"
            },
            {
                "raw_content": "This is a bubble, right?",
                "author": "Strength_Various"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Leaked Memo: Anthropic CEO Says the Company Will Pursue Gulf State Investments After All “Unfortunately, I think ‘no bad person should ever benefit from our success’ is a pretty difficult principle to run a business on.”",
        "score": 317,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Note to CEO…don’t refer to those you are sidling up to for money as Bad People. Run your memo through Claude first next time like the rest of us.",
                "author": "RunsWith80sWolves"
            },
            {
                "raw_content": "Ooo wee, look what that money make a bitch do",
                "author": "DeepBeastOakland"
            },
            {
                "raw_content": "\"Ethical AI\" = anything that makes a big corporation money is ethical.",
                "author": "AbyssianOne"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini with Deep Think achieves gold medal-level",
        "score": 1267,
        "text_content": "https://x.com/googledeepmind/status/1947333836594946337?s=46",
        "comments": [
            {
                "raw_content": "'end-to-end in natural language' - Well that's a bit of a big change. The fact that they are growing out of the need to use tools.",
                "author": "Chaos_Scribe"
            },
            {
                "raw_content": "Watch as all these systems exceed us in all ways, exactly as this sub has been predicting for years.",
                "author": "Ignate"
            },
            {
                "raw_content": "I looked at the official answers, and they are indeed very good, especially for geometry questions, where the proof process is much better. This at least shows that AI can currently generate very good answers. The next step is to find a way to gradually reduce the reliance on built-in prompts and human guidance in this process. I look forward to the next IMO, where the organizing committee will organize invigilation and marking to prevent some of the situations described by Terence Tao, especially the situation where human experts provide guidance to the model and give the model ideas.",
                "author": "MisesNHayek"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Google Had second system score gold without access to training corpus or hints, just pure natural language",
        "score": 504,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I vaguely remember a few months ago reading that llms were far away from being able to write proofs competently, and now 2 labs cracked it, this is insane. It reminds me of what happened with simple maths, when we thought they'd never be able to calculate properly.",
                "author": "Bright-Search2835"
            },
            {
                "raw_content": "https://x.com/vinayramasesh/status/1947391685245509890?s=46 “Exactly the same score” If this is true why even publish the other result?",
                "author": "kunfushion"
            },
            {
                "raw_content": "Why don’t DeepMind announce this one since it sounds better ?",
                "author": "tbl-2018-139-NARAMA"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Google and OpenAI both ranked 27th at the IMO",
        "score": 305,
        "text_content": "Someone on Twitter pointed out that there are some truly",
        "comments": [
            {
                "raw_content": "Damn these kids are cracked",
                "author": "YakFull8300"
            },
            {
                "raw_content": "Yes, the great country of C31, such a great people.",
                "author": "10b0t0mized"
            },
            {
                "raw_content": "Is C31 some censored name for Russia?",
                "author": "New_Equinox"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Wow even the standard Gemini 2.5 pro model can win a gold medal in IMO 2025 with some careful prompting. (Web search was off, paper and prompt in comments)",
        "score": 76,
        "text_content": "",
        "comments": [
            {
                "raw_content": "dang idk how to feel abt this. its cool that the current public models we have can get gold, but on the other hand sort of implies that the special internal models we're all so hyped up about might not necessarily be this giant leap forward from the ones we already have now",
                "author": "Ok-Set4662"
            },
            {
                "raw_content": "What do people mean when they say careful prompting?",
                "author": "oliveyou987"
            },
            {
                "raw_content": "\"Careful prompting\" is doing alot of carrying here, probably solving most of the logical part of the question",
                "author": "HearMeOut-13"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Demis Hassabis is a class act",
        "score": 285,
        "text_content": "Love the undertones of what he is implying..",
        "comments": [
            {
                "raw_content": "If governments ever make a Manhattan Project for ASI, Demis would be a good pick for being in charge of it, but they'll probably instead pick someone shitty who made the right political donations.",
                "author": "RLMinMaxer"
            },
            {
                "raw_content": "Demis and DeepMind are why I've gone all-in on Google.",
                "author": "Acrobatic_Dish6963"
            },
            {
                "raw_content": "The person Elon \"didn't trust with AGI\" seems to be the Mensch he just can't be",
                "author": "draconicmoniker"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "It's still pretty cool, but the details matter",
        "score": 552,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I think humans-participants do the same. They practice on problems from previous math olympiads.",
                "author": "DepartmentDapper9823"
            },
            {
                "raw_content": "https://x.com/vinayramasesh/status/1947391685245509890 GDM person responded to the claim and said that even without the context, it still got gold. Given that adding context is usually used to ensure the formatting is correct, it might be more an explanation for why the GDM proof looks a lot more natural and human",
                "author": "Calm_Bit_throwaway"
            },
            {
                "raw_content": "Humans study before tests… right? Am I the only weirdo nerd who studied?",
                "author": "FarrisAT"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini Deep Think achieved Gold at IMO",
        "score": 636,
        "text_content": "This will be soon be available to Beta users before rolling out to Ultra https://x.com/GoogleDeepMind/status/1947333836594946337?t=MFfLjXwjyDg_8p50GWlQ4g&s=19 Link to Google's press release: https://deepmind.google/discover/blog/advanced-version-of-gemini-with-deep-think-officially-achieves-gold-medal-standard-at-the-international-mathematical-olympiad/",
        "comments": [
            {
                "raw_content": "So 5 out of 6 solved just like OpenAI. Everyone was wondering if they'd solve the last problem. Still impressive nonetheless. A gold is a gold.",
                "author": "Cagnazzo82"
            },
            {
                "raw_content": "Gemini 2.5 pro is surprisingly much more human and unfiltered in the way it speaks than o3, so it getting more intelligent is definitely a welcoming sign",
                "author": "drizzyxs"
            },
            {
                "raw_content": "Before anyone gets up in arms about a week not passing before this announcement, Demis confirmed they got permission to announce this from IMO.",
                "author": "Remarkable-Register2"
            }
        ],
        "subreddit": "singularity"
    }
]