[
    {
        "post_name": "GEOTUS just posted this meme vid on X. Thank you Mr. President, I needed a little some levity to break me out my doom-scrolling.",
        "score": 895,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lmao",
                "author": "TravisRSCX"
            },
            {
                "raw_content": "The Memelord-in-Chief never fails!",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Accurate, lol.",
                "author": "Mamapedia"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "“Armed Queers SLC” is now under FBI investigation as an extended network related to Charlie’s killer.",
        "score": 855,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The deeper this goes the scarier it gets.",
                "author": "saltyviewer123"
            },
            {
                "raw_content": "Figure out who's in that cult, which other congruent Transvestite cults are out there (Zizian cult, anybody?) and how this one has been funded. Put an instant stop to all of their Death plans. Arrest, arrest, arrest. If they conspired in this assassination, then firing squads.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Pam Bondi is worried about making mean words illegal so we can turn into the UK in 3-4 years. Nothing like getting locked up because of slippery slope on attacking speech.",
                "author": "invalid_data"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Pennsylvania, you can request a mail-in ballot below. Consider it your plan B. If you still want to vote on Election Day, you may surrender & spoil your ballot. No one plans for accidents — life happens. We cannot allow democrats to win this November.",
        "score": 615,
        "text_content": "",
        "comments": [
            {
                "raw_content": "FOR CHAAAARLIEEE!! CHAAAAARGEEEEE!!!!!",
                "author": "guywholikesDjtof2024"
            },
            {
                "raw_content": "Slightly Hijacking this Thread Virginia Pede's Please Cast your vote for Winsome Earle-Sears. I don't care you do early voting. Just vote.",
                "author": "DT170x"
            },
            {
                "raw_content": "You have to request a mail-in ballot in PA and complete that application by 10/28/25, 7 days before Election Day. You can bring that mail-in ballot with you, in person on Election Day, or mail the mail-in early enough to return by 11/4/25, which I wouldn't chance that close. This is how I voted in 2024. I requested the mail-in, got verified with ID by the application process and I brought that ballot in person with my ID. They had to give me a \"day of ballot\" to cast and cancelled my mail-in ballot with a signature from The Judge of Elections at the poll location. I made sure my vote counted.",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "2015 - 2025 Donations to left wing organizations from teachers unions: Total AFT left wing donations: $68,632,299 Total NEA left wing donations: $152,437,185 Total Union dollars to left: $221,069,484 This shouldn’t be legal.",
        "score": 594,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fuck these unions.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "The biggest mistake was allowing corporations to donate like this.",
                "author": "Snek_Plissken"
            },
            {
                "raw_content": "how much from ActBlue smurfing?",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Turning Point USA is projecting that over 30,000 unregistered voters will be in attendance of the Charlie Kirk memorial at State Farm Stadium on Sunday. The County Recorder is SURGING voter registration forms that can be printed and filled out by attendees, per @tylerbowyer. THIS IS AMAZING NEWS!",
        "score": 1577,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I would almost think that this would be in bad taste except I am quite certain this is exactly what Charlie would have wanted done.",
                "author": "NADSAQ"
            },
            {
                "raw_content": "God bless you Charlie. Your assassination has unleashed a lion. We will never forget you. God bless your family.",
                "author": "SneakyWino"
            },
            {
                "raw_content": "Trump 2028",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Antifa subreddit on Reddit has made a post saying why Charlie Kirk and those like him deserve to be killed. To smear him, they reference a Media Matters hit piece and tell their comrades to arm themselves with weapons.",
        "score": 1455,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We were kicked out of Reddit to protect the platform from such rhetoric. Falsely accused, against police of all things. Will they disavow?",
                "author": "ParticleCannon"
            },
            {
                "raw_content": "How is reddit not under federal investigation?!",
                "author": "FLIBS"
            },
            {
                "raw_content": "I'm actually very concerned about the memorial to be held this Sunday. The stadium alone holds some 70,000 people and is surrounded by gigantic parking lots. Trump himself will be there and so will JD, last I heard. I have no doubt it's going to be swamped by leftist protestors who have been whipped up into a fury all week long. Buckle up.",
                "author": "Cuetardian"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Let’s Make these lunatics FAMOUS! This afternoon at UNCW, the so-called ‘tolerant’ left painted over a beautiful mural honoring Charlie Kirk. In the video, one girl can be heard bragging that ‘all her friends at Chapel Hill will be proud.’ Disgusting !!!",
        "score": 1025,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We can all see where this is heading. These 'people' just won't stop.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Who raises these evil cunts?",
                "author": "MEME-SUPREME"
            },
            {
                "raw_content": "You pussies. Just grab the fucking paint and pour it over her head like Carrie. 😑🙄",
                "author": "BuSpocky"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Why was the wonderful Turning Point under INVESTIGATION by “Deranged” Jack Smith and the Corrupt & Incompetent Biden Administration. They tried to force Charlie, and many other people and movements, out of business.",
        "score": 864,
        "text_content": "",
        "comments": [
            {
                "raw_content": "well Sir... if you get rid of that worthless bitch of an AG and put in Sen. Eric Schmitt, he take care of this in no time!!!!",
                "author": "VanillaCupCake"
            },
            {
                "raw_content": "Stop posting, Trump. Do something. We arent your chat buddies and your first year is almost up.",
                "author": "Spawnlingman"
            },
            {
                "raw_content": "Nothing will ever be done about it as long as you allow Bimbo Bondi to run the department of justice.",
                "author": "BlackPilledMAGA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "👉 THIS BY NOW SHOULD BE OBVIOUS TO EVERY NORMAL PERSON WITH AN IQ HIGHER THAN A CHIMPANZEE 👈",
        "score": 1143,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yet people fall for it every time. Can't even ask fucking questions.",
                "author": "klunniclowns2"
            },
            {
                "raw_content": "They forgot DEHUMANIZE",
                "author": "Aboveaveragebear"
            },
            {
                "raw_content": "You always knew the left appealed to the lowest common denominator NPCs. To see it spelled out on one page just makes you hate the media even more.",
                "author": "MikesDong"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This cunt 🤬",
        "score": 705,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How come nobody is beating the shit out of that trashy cunt?",
                "author": "Prandogolio"
            },
            {
                "raw_content": "They won't stop, until they're stopped.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Make Asskickings Great Again!",
                "author": "BlackJack1776"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "No unity. No dialogue. No turning down the temperature. No quarter.",
        "score": 1984,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Start vandalizing every George Floyd memorial and Tran gay shit all across your country right now",
                "author": "Nanteen"
            },
            {
                "raw_content": "In my neck of the woods, that's a good way to get your ass beaten.",
                "author": "cjcivicx"
            },
            {
                "raw_content": "The leftists are suggesting killing conservatives unless the conservatives \"turn down the temperature\".",
                "author": "conservativefrank"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "MSNBC guest blatantly lies and says leftists haven’t been cheering the asssination of Charlie Kirk. There have been countless leftists who’ve now been fired from their jobs because they were exposed on 𝕏 for cheering the asssination of Charlie Kirk.",
        "score": 1011,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You lying bitch with dried up eggs",
                "author": "-f-b-i-"
            },
            {
                "raw_content": "Leftism is the inversion of reality.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "They need to be taken off the air. The American people may need to just do it.",
                "author": "g80_patriot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "CNN’s ⁦ @secupp says workers shouldn’t be reprimanded for endorsing terrorism⁩: “We can’t punish people for being jerks & celebrating the death of someone”",
        "score": 1011,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's where you're wrong, kiddo.",
                "author": "MemeWarsVet"
            },
            {
                "raw_content": "\"We\" aren't punishing anyone, their employers are because they don't want to work with sociopaths.",
                "author": "I_Am_John_Galt"
            },
            {
                "raw_content": "These demons just don't get it. NORMAL PEOPLE and NORMAL establishments don't like associating with terrorist sympathizers!",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Every George Floyd statue should be torn down",
        "score": 2024,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Statues and Sculptures Newark, New Jersey: Bronze statue of George Floyd sitting on a bench, outside City Hall (artist: Stanley Watts; 700 pounds; permanent installation since 2021; vandalized in past but cleaned and maintained). New York City, New York: 6-foot plywood bust of George Floyd in Union Square, Manhattan (artist: Chris Carnabuci; part of \"See Injustice\" series; permanent display as of 2025). Houston, Texas (Tom Bass Regional Park): Life-size bronze statue titled \"A Conversation with George,\" depicting George Floyd seated at an outdoor table (artist: Adrienne Rison-Isom; dedicated May 2022; donated to Harris County; still on display and featured in 2025 events). Charleston, South Carolina: \"Floyd\" sculpture at the International African American Museum (artist: Dan Reisner; unveiled May 2024; tree-ring design symbolizing time of death; permanent exhibit in operational museum as of 2025). Memorial Sites and Installations Minneapolis, Minnesota (George Floyd Square): Intersection of East 38th Street and Chicago Avenue, officially renamed George Perry Floyd Square (designated September 2020); ongoing public memorials including raised-fist sculptures, tribute barricades, headstone installations for police brutality victims, community art, and evolving exhibits; curated by George Floyd Global Memorial organization; site remains a protest and reflection space with proposed pedestrian plaza plans under discussion as of 2025. Minneapolis, Minnesota (Cup Foods Site): Blue-and-yellow mural on the side of Cup Foods store (artists: Cadex Herrera, Greta McLain, Xena Goldman; created June 2020); black-and-white portrait mural \"Icon of a Revolution\" nearby (artist: Peyton Scott Russell; June 2020); both murals intact and iconic as of 2025, despite past vandalism. Ada, Ghana (Nkyinkyim Museum): Mural of George Floyd on museum wall (created 2020; part of international anti-racism exhibits; museum operational with ongoing events through 2025). Additional Currently Existing Murals from the George Floyd and Anti-Racist Street Art Database (University of St. Thomas)The database (launched June 2020 and actively maintained as of 2025) documents over 1,000 extant and historical pieces, focusing on those confirmed as still up through community submissions and updates. Below is a selection of verified, currently existing murals and installations (non-exhaustive; prioritized by global representation and confirmation of status; many are ephemeral but preserved digitally; physical survival noted where available):United States Minneapolis, Minnesota: \"Blues 4 George\" mural on plywood at Gordon Parks High School (artists: Seitu Jones and collaborators; 2020; preserved and documented as ongoing). Minneapolis, Minnesota: \"Stronger Together\" composite puzzle portrait of George Floyd (artist: @sig .natur; 2020; located near George Floyd Square; maintained). St. Paul, Minnesota: Mural on University Avenue featuring George Floyd stencil (multiple artists including @froriginals ; 2020; still visible on building facade). Kansas City, Missouri: \"Black Lives Matter\" abstract mural with MLK quote (artist unknown; 2020; at community site; confirmed extant). Denver, Colorado: Alley mural saluting George Floyd and restaurant workers (artist: Austin Zucchini-Fowler; 2020; in River North Arts District; preserved). Third Ward, Houston, Texas: Mural near Jack Yates High School (artist: Donkeeboy; 2020; surrounded by tributes; still standing as of May 2025). Rochester, Minnesota: Large-scale George Floyd portrait on building wall (community artists; 2020; maintained despite past threats). Portland, Oregon: \"I Can't Breathe\" mural with George Floyd and other victims (artist: Emma Berger; updated 2020; indoor/outdoor preservation efforts confirm existence). Richmond, Virginia: Multiple murals on former Confederate statue sites (various artists; 2020; some permanent, documented as up). Washington, D.C.: Street murals near National Mall (community-led; 2020; select pieces preserved in public art initiatives). International Vienna, Austria: George Floyd mural on urban wall (local artists; 2020; part of European BLM response; confirmed via 2025 updates). Bethlehem, Palestine: George Floyd piece on the separation wall (anonymous; 2020; documented as enduring symbol). London, United Kingdom: Mural on Brixton wall featuring George Floyd and UK victims (artists: Stik and collaborators; 2020; protected and extant). Mexico City, Mexico: Anti-racist mural with George Floyd motif (street artists; 2020; in urban alley; ongoing). Toronto, Canada: \"George Floyd\" graffiti-mural hybrid on community center (local collective; 2020; maintained). Berlin, Germany: Large mural on former East Side Gallery section (artists: ROA-inspired; 2020; tourist-protected site). Johannesburg, South Africa: Mural linking George Floyd to local injustices (community artists; 2020; on public building; active). Paris, France: Street art installation near Notre-Dame (various; 2020; some pieces formalized as public art). For the full database of over 800 global entries (many still existing), visit the University of St. Thomas Urban Art Mapping project site (https://www.urbanartmapping.org/george-floyd-and-anti-racist-street-art-archive), which continues to accept submissions and verify statuses as of 2025. Note: Many murals are community-maintained and subject to urban changes; the database prioritizes anti-racist works inspired by Floyd's death.",
                "author": "blockchain-the-vote"
            },
            {
                "raw_content": "you know who else couldn't fucking breathe? CHARLIE KIRK because these transvestite faggots shot him in the JUGULAR",
                "author": "TreeOfLibertyisfp"
            },
            {
                "raw_content": "They only know how to destroy",
                "author": "Freedomnuggs"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "'Nihilistic Violent Extremism' Spreads: FBI's Patel Confirms 1,700 Domestic Terrorism Cases Being Investigated",
        "score": 1404,
        "text_content": "",
        "comments": [
            {
                "raw_content": "ANTIFA to GITMO or BUST",
                "author": "Sunnybat2"
            },
            {
                "raw_content": "So when will the assassin's tranny accomplices and handlers be arrested, Kash? You gonna tell us soon that this is a single criminal like Thomas Crooks and Lee Harvey Oswald?",
                "author": "possibletower"
            },
            {
                "raw_content": "If J6'ers can be arrested for entering a building as police ushered them in, then leftists can be arrested for encouraging terrorist attacks against Americans.",
                "author": "AVeryNakedMan"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Tyler Robinson has just appeared in court to be officially arraigned in the kiIIing of Charlie Kirk He's just been informed the state will be seeking the DEATH PENALTY Prosecutors also filed a pre-trial protective order on behalf of Erika Kirk Judge Tony Graf is presiding, and Tyler spoke",
        "score": 1381,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Firing squad duh",
                "author": "Sunnybat2"
            },
            {
                "raw_content": "Domestic terrorism. Should go federal. Presidential national alert system for public execution",
                "author": "jbaum517"
            },
            {
                "raw_content": "The soulless, emotionless look on him the whole time. He’s fucked. Rightfully so. Any Coconspirators deserve the same",
                "author": "Wrexxis780"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔴 Charlie Kirk's pastor, Rob McCoy, called out Candace Owens today",
        "score": 930,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What did Candace say?",
                "author": "MiniMikeCoomberg"
            },
            {
                "raw_content": "Weird how he doesn’t deny any of it or call her a liar. Also fuck James Lindsay. Absolute retard.",
                "author": "Viewer01"
            },
            {
                "raw_content": "She said Charlie was in Hamptons with big donors a few weeks ago and got in big fight with bill ackman. Bill was screaming. And threatening Charlie.",
                "author": "kfunny91"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Texas Suspends over 100 teachers licenses",
        "score": 1841,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Every other red state needs to do it and those numbers need to be WAAAAY higher",
                "author": "Puncake150"
            },
            {
                "raw_content": "Good! Those freaks shouldn't be anywhere near children",
                "author": "Sea_Still"
            },
            {
                "raw_content": "Good. Fuck every one of them",
                "author": "Formerlurker92"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Turning Point USA \" For all those asking for comments following today's press conference, Turning Point is focused on celebrating and memorializing Charlie. We will have more to say in the future. Thank you to law enforcement at the local, state, and federal level and the prosecutors who",
        "score": 1239,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They are regrouping, simple as that. Best of luck TPUSA!!!",
                "author": "MagaMom69"
            },
            {
                "raw_content": "NO Ben Shapiro. Absolutely no JEW must be in charge of TPUSA. Charlie died exposing the truth.",
                "author": "simon"
            },
            {
                "raw_content": "Give them time. We haven't even had the Funeral yet.",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump: Shockingly, I have just learned, that Gavin Newscum, the Governor of California, is in final stages of approval to build Low Income Housing in Pacific Palisades. How unfair is that to the people that have suffered so much!",
        "score": 1845,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I feel really bad for those rich Hollywood-adjacent liberals who all voted for this",
                "author": "EgregiousPhilbin"
            },
            {
                "raw_content": "LMFAO rich people gonna get dindu nuffined.",
                "author": "ciaramella_is_gay"
            },
            {
                "raw_content": "I’d care more if it weren’t all limousine libs and flat out communists getting their wealth redistributed by the state.",
                "author": "Viewer01"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ASUS Gaming Laptops Have Been Broken Since 2021: A Deep Dive",
        "score": 416,
        "text_content": "ASUS ROG stutters/crackles? It’s not Windows or NVIDIA. It’s firmware. I traced ACPI.sys spikes to a GPE handler that sleeps + bad dGPU power logic. Full deep-dive: [Report](https://github.com/Zephkek/Asus-ROG-Aml-Deep-Dive)",
        "comments": [
            {
                "raw_content": "There's a lot of things broken within ASUS",
                "author": "bizude"
            },
            {
                "raw_content": ">Wtf 1: Sleeping in an Interrupt Context Random sleep calls in code was supposed to be a joke.",
                "author": "BlueGoliath"
            },
            {
                "raw_content": "This is a really impressive analysis, with great explanations and context.",
                "author": "andrewia"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "TEAMGROUP refuses to support product defect because \"we test and our products don't break\"",
        "score": 219,
        "text_content": "I've been building PCs for a few decades, and have had many tech support issues along the way, but this wins 1st prize for the worst customer support I've received. I bought TEAMGROUP's X1 Max flash drive. It's an M.2 drive on a board with USB-A and USB-C connectors on either end. I had this for around 90 days when this happened: I reached down to the front of my desktop to pull the memory stick out...and the plastic case slid off the circuit board. Apparently the glue or heat weld that bonds the plastic case to the black connector failed. This is where it gets crazy: I figured this would be a very quick resolution for what was obviously a product failure under warranty. But what actually happened is that TEAMGROUP told me, \"Once physical damage occurs, such as cosmetic damage or case removal, it is considered outside the scope of warranty coverage.\" I was confused at first, and thought I hadn't properly explained that **the case came off in my hand in the course of regular / intended use**. [https://imgur.com/a/m7dGTet](https://imgur.com/a/m7dGTet) But no; after 2 more e-mails they made their position clear. **Because I had \"removed\" the case, I had damaged the drive. 😶** They claimed that all of their products go through \"extensive testing\" and therefore if the drive failed, it must have been misuse. At first I was confused and annoyed. Now I realize that they are auto-replying to simply avoid the costs of warranty repair or replacement. It's just basic fraud.",
        "comments": [
            {
                "raw_content": "Teamgroup is what I use for a builds that require something cheap and not when I want something good. This is why.",
                "author": "militant_rainbow"
            },
            {
                "raw_content": "Man I would not want to waste this much emotional energy on a flash drive. Take a photo, attach it to an amazon/newegg review, and then tape it up, use it naked, or find a different enclosure for the M2",
                "author": "NoAirBanding"
            },
            {
                "raw_content": "Experience with Epson: Bought a printer as a gift to my aunt. Printer arrives, she opens, doesn't turn on. She brings it to me, since her city doesn't have an Epson technical support store. I take the printer and box to them. They open it and say Epson HQ denied support because the printer was missing hardware (from INSIDE the printer). They said the printer was serviced by a third party and denied warranty. The printer was new, the box was factory sealed, never even loaded with ink, 100% new. They said the printer was missing a cable, hard plastics, the connector to the main board (where the missing cable was supposed to be) was broken and solder joints were broken. All INSIDE the printer. After 2 weeks exchanging e-mails they tell me: \"the printer isn't defective, it's missing hardware\" but they are going to open an EXCEPTION for me and exchange it. It's like buying a car, they deliver it to your garage, but the engine is missing and they deny warranty because it isn't a DEFECT, the engine is missing! After some yelling, their rep says they *COULD NEVER MAKE A MISTAKE*, that the *FACTORY COULD NEVER SHIP IT LIKE THAT*, but they would exchange for a new one. Cue 2 months later and I am still in the exchange process... I feel your pain OP. I have 3 justice cases active about bad customer service and product warranties. I have won 4 cases already.",
                "author": "TenshiBR"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "\"AOMedia Announces Year-End Launch of Next Generation Video Codec AV2 on 10th Anniversary\"",
        "score": 20,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Pretty light on details, I wonder how it'll compare to h266. > 53% of AOMedia members surveyed plan to adopt AV2 within 12 months upon its finalization later this year, with 88% expecting to implement it within the next two years. This seems incredibly unlikely unless it's somehow backwards compatible with AV1 encoders and decoders, or they're using a very generous interpretation of \"adopt\" and \"implement\".",
                "author": "VastTension6022"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD reveals Ryzen 5 5600F CPU, extending AM4 platform into its 9th year - VideoCardz.com",
        "score": 132,
        "text_content": "Wild ngl",
        "comments": [
            {
                "raw_content": "Guess AMD will keep doing new am4 releases till am5 dies lmao. I wonder what happened with the whole bios problem to support new am4 releases? I have a gigabyte A520M DS3H - REV 1.3 and[ its support page doesn't even list the 5500x3D](https://www.gigabyte.com/Motherboard/A520M-DS3H-rev-1x/support#support-cpu), which is the CPU I want to upgrade to from my 4500.",
                "author": "zerinho6"
            },
            {
                "raw_content": "5600F is a terrible name. It should mean Ryzen 5600 without iGPU, but of course the 5600 already lacks one. They could've used almost any letter except X, G and F...",
                "author": "exscape"
            },
            {
                "raw_content": "the boost clock is quite a bit slower than the regular 5600 (4ghz vs 4.4ghz) i wonder why they didn't call it a 5550 or something instead",
                "author": "GumshoosMerchant"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "What happened to ATX12VO?",
        "score": 17,
        "text_content": "I remember seeing a bunch of videos on this new standard back in 2023 that was going to improve efficiency and reduce board space used on power connectors which could be greatly beneficial to SFF builds. It's been years though, and I haven't seen any ATX12VO PSUs or motherboards outside of OEM systems. What happened?",
        "comments": [
            {
                "raw_content": "Motherboard manufacturers hated it cause it lowers their margins and they refuse to support it.",
                "author": "scytheavatar"
            },
            {
                "raw_content": "ATX12VO just moves required voltages from the PSU to the motherboard, the space you’re saving on connectors gets used by converting to the different voltages you need for M.2, SATA, USB, etc. At least for custom builds a single PSU can last through multiple systems, you‘d be paying extra for the engineering work and additional components every time you upgrade your motherboard instead of just putting it in the PSU once.",
                "author": "kjm99"
            },
            {
                "raw_content": "There are zero space savings on the motherboard. There's a space loss, in fact, as the voltage conversion circuitry has to move there. You're losing functionality on the motherboard to make room for voltage conversion, which would disproportionately affect small form factor boards in a big way. There's no real increase in efficiency, either, because whether you have wires going from the PSU to a peripheral or from the motherboard to a peripheral, it's still wires running at the lower voltage that peripheral requires. You could make an argument for 5V USB power, or 3.3V PCIe slots, but it wouldn't be a very good one. It's also a cost shift. If you have the voltage conversion done on the PSU, which you can pass from PC to PC over many years (still on the same 1200W unit I bought in 2012), you're paying once every ~10 years for that functionality. If you force that to be on the motherboard, you're paying for it every time you replace that board to upgrade the CPU to a new socket. Basically, the standard hasn't made any headway into DIY, because it's a terrible idea that provides no benefits in that space.",
                "author": "RealThanny"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "S K Hynix DDR5 DIMMs Vulnerable to \"Phoenix\" Rowhammer Attack, ECC DIMMs Exposed Too",
        "score": 39,
        "text_content": "",
        "comments": [
            {
                "raw_content": "lol, 65535 tREFI here",
                "author": "demomanca"
            },
            {
                "raw_content": "What a lousy headline... The ECC referred to is on-die ECC... Which is part of regular UDIMMs... While the headline is clearly implying that it's affecting ECC UDIMM/ECC RDIMM...",
                "author": "santasnufkin"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMDVLK Linux driver has been discontinued as AMD are throwing their \"full support\" behind RADV",
        "score": 207,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The RDNA based Xclipse GPUs found in recent Exynos SoCs use AMDVLK as their Vulkan driver. They'll switch to RADV in future updates I suppose. The X960 inside the Exynos 2600 was spotted on Geekbench 6 with the AMDVLK driver that contained the Vulkan 1.4.304 header version or to be precise: [v-2024.Q4.3](https://github.com/GPUOpen-Drivers/AMDVLK/releases) according to the GitHub repo. This announcement comes to no surprise as well, if you look at when the most recent driver was released",
                "author": "excaliflop"
            },
            {
                "raw_content": "Hopefully that means that RADV can catch up with AMDVLK in RT.",
                "author": "Roadside-Strelok"
            },
            {
                "raw_content": "Better to have one good driver than two meh drivers IMO.",
                "author": "theQuandary"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Meet the Hacker Who Helped Score a $243 Million Verdict Against Tesla",
        "score": 179,
        "text_content": "“In a lab, Green dismantled the hardware through a process called \"desoldering,\" which involves heating the circuit board to just the right temperature so that high-heat tweezers can be used to extract the memory chip. …. “In mid-2023, Tesla introduced stricter security protocols, which delete the copy of the data in the circuit board.”",
        "comments": [
            {
                "raw_content": "Summarized: Tesla autopilot didn't work as expected and hit pedestrians. Tesla denied liability and said they don't have the data. Lawyers hired a guy to extract the data from the on-board memory of the car. It showed the video, Tesla vision system recognized pedestrians, and that it didn't activate forward collision warning or automatic emergency braking.",
                "author": "mungie3"
            },
            {
                "raw_content": "In mid-2023, Tesla introduced stricter security protocols, which delete **evidence**",
                "author": "callmedaddyshark"
            },
            {
                "raw_content": "Going 92mph on a smaller road anywhere near pedestrians and parked cars, then searching for a dropped phone is insanely reckless. Forget Tesla, this guy should be in jail for manslaughter and reckless driving. Can they even prove that the car could have stopped in time had it instantly locked the brakes?",
                "author": "xfvh"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Level1Techs] Testing 256GB of GSKill DDR5 6000 on AM5!",
        "score": 36,
        "text_content": "",
        "comments": [
            {
                "raw_content": "At what point does warrenting this much RAM require a crossover into dedicated server terroritory? I am running 96 giggies on am5, in two slots with two rgb stick kits to give the 4 slot appearence. Filling 4 slots is just not worth the instability and speed hit on AM5 currently.",
                "author": "SVWarrior"
            },
            {
                "raw_content": "Fortunately I currently don't need 256 GB spread over four slots with all the hassle to get that working. My dual kit 2x32 GB will do for some years for my current usage.",
                "author": "0xdeadbeef64"
            },
            {
                "raw_content": "He needs to do that on Alder Lake. I am running 48x4 at 4000cl40 and while it works I would always like faster ram",
                "author": "Lord_Muddbutter"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Enough time has passed, Welcome Tour should be in NSO + Expansion Pack",
        "score": 231,
        "text_content": "basically the title, they didn't want it as pack in fine, but any info in the \"game\" is now freely available online and I doubt its sale figures are that high, so putting it in NSO seems like a logical choice giving more value for the service even if miniscule",
        "comments": [
            {
                "raw_content": "I can’t even imagine the outrage if they started giving this away free after 3 months.",
                "author": "junglespycamp"
            },
            {
                "raw_content": "It's a top 5 best selling download-only game, so why would they make it free if they can get the money?",
                "author": "6Y1O3W"
            },
            {
                "raw_content": "Putting it free now…after barely three months would just be stupid. Can you try to have some realistic expectations?",
                "author": "Sarothias"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Who the heck is young randy?",
        "score": 24,
        "text_content": "",
        "comments": [
            {
                "raw_content": "if I didn’t have one already I would buy it again, she sold me",
                "author": "Unfair_Pear8446"
            },
            {
                "raw_content": "aww... my mee-maw always thinks of me.",
                "author": "Randi-Rabbit"
            },
            {
                "raw_content": "Was this a genuine advert for television? Brilliant if it was.",
                "author": "matto1985"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Neat little system",
        "score": 285,
        "text_content": "A great rpg machine",
        "comments": [
            {
                "raw_content": "Hell yeah",
                "author": "surrealmirror"
            },
            {
                "raw_content": "How do I get that controller? Is this it?: https://shop.8bitdo.com/products/8bitdo-sn30-wireless-gamepad-for-original-snes-sfc?variant=44554447683761 The Switch 2 will take that receiver?",
                "author": "Onre405"
            },
            {
                "raw_content": "Omg yes - I have the 8bitdo snes controller without the thumbsticks (2.4g) - i need to dig it out and play UFO50 with it",
                "author": "Low-Pop-2058"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Cant't believe we still wait for this",
        "score": 970,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Bomberman 64 is one of the most underrated games.",
                "author": "FosterIssuesJones"
            },
            {
                "raw_content": "Toy Story is never happening. DK64 is the most likely game coming and has always been a weird exclusion.",
                "author": "Mysticwaterfall2"
            },
            {
                "raw_content": "You should ask Disney on Toy Story 2. Konami owns Bomberman",
                "author": "progxdt"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Lollipop Chainsaw RePOP NS2 Edition scheduled for Nov. 2025.",
        "score": 52,
        "text_content": "[https://www.youtube.com/watch?v=khhPiMuBFH4&ab\\_channel=DragamiGames](https://www.youtube.com/watch?v=khhPiMuBFH4&ab_channel=DragamiGames) https://preview.redd.it/kow1xbajdmpf1.jpg?width=531&format=pjpg&auto=webp&s=b2d7f569c3b4a6acf00b4ac69dfb283309ddde97",
        "comments": [
            {
                "raw_content": "Will get this. Love the original, almost bought it on switch already.",
                "author": "isaymoo2"
            },
            {
                "raw_content": "Not a negative question (sorry if it sounds like one) but wasn't Re:Pop horrible compared to the first + the licensed music is not on there? I didn't play so not sure of details",
                "author": "djricekcn"
            },
            {
                "raw_content": "Bruh these Xenoblade fans about to storm the castle",
                "author": "Derv1009"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "No Man Sky 6.0 Live",
        "score": 85,
        "text_content": "It looks like Voyagers has finally hit Switch 2. Mines just updated.",
        "comments": [
            {
                "raw_content": "FYI for all interested parties: Corvettes are only in the Switch 2 version for now. If you're playing on multiple switches or only have a switch 1 (yeah, this is an S2 sub but still), it will be different. r/nms_switch has great additional info on what's going on with this update",
                "author": "DueSeesaw6053"
            },
            {
                "raw_content": "How many hotfixes is it behind every other version?",
                "author": "No_Construction2407"
            },
            {
                "raw_content": "Can confirm. Have it downloaded and version states 6.0 now.",
                "author": "6Y1O3W"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Inti Creates Card En Ciel Nintendo Switch 2 Edition coming January 29th",
        "score": 15,
        "text_content": "Supporting 4K resolution, 60-120fps and mouse controls. Upgrade pack is 10 dollars",
        "comments": [
            {
                "raw_content": "Its a nice game but 10$ upgrade is a no. There is jo graphical challenges in order this to run at 4K/60- 120 fps. And you would not understand the difference if you upgrade",
                "author": "Olak-Gr"
            },
            {
                "raw_content": "Was interested until I saw upgrade is 10$.",
                "author": "UnawareRanger"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Satisfy Grip 2 worth the wait",
        "score": 153,
        "text_content": "Ordered on launch day, finally got it. I tried two other grips waiting for this, but nothing comes close to the comfort of this thing. The same beefy hunks of rubber from the first version, excellent and comfortable ❤️",
        "comments": [
            {
                "raw_content": "I had the same thing for the original switch and I can confirm it kicks ass.",
                "author": "JobuuRumdrinker"
            },
            {
                "raw_content": "Looks cool, I’ve got the savage raven myself and it’s great. I love the button covers, are they included?",
                "author": "CheddarGorger"
            },
            {
                "raw_content": "Agreed. Got mine last week. While it does make the console feel even larger it's the only grip that truly gives me comfort for handheld play. It was definitely worth the wait.",
                "author": "reddit4leo"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "New details on the Assassin’s Creed Black Flag remake",
        "score": 1068,
        "text_content": "- The remake removes the modern day and replaces them with more content in Edward’s pirate era (a few extra hours compared to the original) - Gameplay will shift closer to the RPG-style of newer AC games - Loot and gear stats for Edward - Inventory systems and combat leaning toward the RPG style rather than the choreographed combat of the original - No loading screens when moving between ship and land - Map is not bigger, but islands will be filled with more activities and side content - Expected to include cut content from the original, like parts of Mary Read’s storyline that were dropped in 2013 - It’s not on the same “big budget remake” level as Resident Evil 2 or Silent Hill 2, but more of a faithful reimagining with updates - Uses Ubisoft’s new Anvil Pipeline engine (same as AC Shadows) - Release window: currently targeted for early 2026 (likely March), though some sources think it could slip to late 2026. - They are reusing some assets from Skull & Bones to cut costs, but it won’t be obvious to players. Source is Jeux Vidéo Magazine who have gotten few AC related things right before: [https://www.youtube.com/watch?v=qngrBQnukFc](https://www.youtube.com/watch?v=qngrBQnukFc)",
        "comments": [
            {
                "raw_content": "Not a big budget remake but everything here sounds fundamentally different to the original game? I’ll wait and see but this sounds like a big budget remake in my eyes",
                "author": "RJK26"
            },
            {
                "raw_content": "Hopefully the gameplay is a little more fluid than the other RPG games because I thought the original black flag’s gameplay was good enough for what it was",
                "author": "Johnhancock1777"
            },
            {
                "raw_content": "I kind of don't like the RPG side of new Assassins Creed's, I was hoping it would just be old game but better looking.",
                "author": "CrazyGambler"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Dusk Golem: I've been hearing multiple times in the grapevine that Leon's being revealed next week. I don't know Capcom's marketing plans from direct sources so I can't confirm, but it's LOUD behind the scenes right now.",
        "score": 243,
        "text_content": ">I've been hearing multiple times in the grapevine that Leon's being revealed next week. I don't know Capcom's marketing plans from direct sources so I can't confirm, but it's LOUD behind the scenes right now. Think several who follow me have heard the same murmurs even by now. [https://xcancel.com/AestheticGamer1/status/1967998080172867639](https://xcancel.com/AestheticGamer1/status/1967998080172867639)",
        "comments": [
            {
                "raw_content": "#DuskGolem is a Tier 3 - 50/50 as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "State of Play's more than likely next week. I wasn't counting on RE9 showing up given it just got the Nintendo Direct feature, but if it's a new trailer of fully bearded Leon jumping from a helicopter (no parachute) and making a perfect landing, sure",
                "author": "MyMouthisCancerous"
            },
            {
                "raw_content": "During the alleged PlayStation showcase maybe?",
                "author": "R0B0138"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[Dusk Golem] RE9 was originally going to continue quite directly on the corrupted BSAA plotline RE8 ended with, but that was back in the now scrapped \"8.5 Apocalypse\" version, which was an open world multiplayer game set on a fictional island around Singapore",
        "score": 237,
        "text_content": "[Source](https://xcancel.com/AestheticGamer1/status/1967993400910811570?t=PUXp0P2bPmkBqMenhX2nZg&s=19)",
        "comments": [
            {
                "raw_content": "#DuskGolem is a Tier 3 - 50/50 as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Resident Evil and dropped plot lines, name a more infamous pair!",
                "author": "MagicCancel"
            },
            {
                "raw_content": "whats capcom obsession with making RE MP games, they are ALWAYS ass, and they stop support after like a week",
                "author": "Frozetaku"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Epic Games is in talks to add \"Live and Learn\" from Sonic Adventure 2 to Fortnite",
        "score": 223,
        "text_content": "https://xcancel.com/HYPEX/status/1967955341540520223",
        "comments": [
            {
                "raw_content": "They’ll do anything except remaster sonic adventure 2",
                "author": "myretrospirit"
            },
            {
                "raw_content": "[deleted]",
                "author": "None"
            },
            {
                "raw_content": "For people who don't play but are Sonic fans - Jam Tracks are used as songs in Fortnite Festival, which is a spiritual successor to Rock Band by the same devs. You can also play them as lobby music or emote with them in other experiences",
                "author": "VolksDK"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Nate The Hate claims Sony presentation for next week",
        "score": 515,
        "text_content": "https://xcancel.com/NateTheHate2/status/1967788911180263523?t=5BAKhmwVKXMJcfkZrngzsg&s=19",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "![gif](giphy|qz94gBu7wH6xy)",
                "author": "TheBrickHog"
            },
            {
                "raw_content": "I want to believe ![gif](giphy|1aRMhW2pA2iavBh5aN)",
                "author": "Famous-Pay5201"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Wreckreation Official Release Date announcement trailer released.",
        "score": 87,
        "text_content": "[Trailer](https://youtu.be/SPQVRywa-5k?si=u1sNq24jS5o7k4-Y). Wreckreation releasing on October 28th 2025. Previous [rumour](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1nhof74/wreckreation_release_date_announcement_tomorrow).",
        "comments": [
            {
                "raw_content": "Haven't seen this game before, this looks great Will wishlist it",
                "author": "ArcWardenScrub"
            },
            {
                "raw_content": "Looks great",
                "author": "galgor_"
            },
            {
                "raw_content": "Nice to finally have a release date for it",
                "author": "ShaneTVZ"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Character possibly leaked for The Super Mario Galaxy Movie by Jakks Pacific prototype toy",
        "score": 140,
        "text_content": "https://www.reddit.com/r/WorldOfNintendo/comments/1ni11pg/bowser_jr_confirmed_new_jakks_pacific_prototypes/",
        "comments": [
            {
                "raw_content": "what makes it sure that it's for the Mario movie and not just a Jr figure?",
                "author": "LuigiWarrior"
            },
            {
                "raw_content": "\\*Joel Vargskelethor voice\\* DARK LUIGI???",
                "author": "FoxyDude915"
            },
            {
                "raw_content": "Wouldn't be much of a surprise if Bowser Jr is in the film to be fair.",
                "author": "Dalekbuster523"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "AMD reveals Ryzen 5 5600F CPU, extending AM4 platform into its 9th year",
        "score": 265,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They just keep finding silicon down the back of the couch",
                "author": "delph0r"
            },
            {
                "raw_content": "Lisa Su became CEO of AMD in 2014. Coincidence?",
                "author": "Ecredes"
            },
            {
                "raw_content": "how about you make some more 5800xds",
                "author": "Dennygreen"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD officially releases ROCm 7.0 with Instinct MI350 CDNA4 support",
        "score": 24,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD formally introduces Ryzen 7 9700F and Ryzen 5 9500F AM5 CPUs",
        "score": 36,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hey OP — /r/AMD is in manual approval mode, this means **all submissions are automatically removed and must first be approved before they are visible to others**. This is done to prevent spam, scams, excessive self-promotion and other rule-breaking posts. Your post will be approved, provided it follows the subreddit [rules](https://www.reddit.com/r/Amd/about/rules/). **Posts regarding purchase advice, PC build questions or technical support will not be approved.** If you are looking for purchasing advice, have a PC build question or technical support problem, please visit the [Q3 2025, PC Build Questions, Purchase Advice and Technical Support Megathread](https://www.reddit.com/r/Amd/comments/1lomnxt/pc_build_questions_purchase_advice_and_technical/). *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Amd) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD ROCm 7.0 Officially Released With Many Significant Improvements",
        "score": 53,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This was promised to come with Windows support. I'm not seeing that.",
                "author": "thomthehound"
            },
            {
                "raw_content": "They need to get this shit running on Windows the SAME day. Not years later.",
                "author": "ZeroZelath"
            },
            {
                "raw_content": "4-8 bit support, this is a huge step toward being a legitimate competitor. Just need a bigger GPU, looking forward to 2026.",
                "author": "john0201"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Begins Plumbing APCI C4 Support In The Linux Kernel For Greater Power Savings",
        "score": 15,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm hoping that this feature comes to devices like the ASUS ROG Flow Z13. Should boost power savings plenty.",
                "author": "Ok_Mastodon_4919"
            },
            {
                "raw_content": "Hey OP — /r/AMD is in manual approval mode, this means **all submissions are automatically removed and must first be approved before they are visible to others**. This is done to prevent spam, scams, excessive self-promotion and other rule-breaking posts. Your post will be approved, provided it follows the subreddit [rules](https://www.reddit.com/r/Amd/about/rules/). **Posts regarding purchase advice, PC build questions or technical support will not be approved.** If you are looking for purchasing advice, have a PC build question or technical support problem, please visit the [Q3 2025, PC Build Questions, Purchase Advice and Technical Support Megathread](https://www.reddit.com/r/Amd/comments/1lomnxt/pc_build_questions_purchase_advice_and_technical/). *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Amd) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "C-states are cool I guess (pun not intended) but in my measurements there is a much bigger difference between P0 and P1 than between P1 and C2. A near-idling Threadripper virtual machine host spends 2% of its time in P0 and 98% in C, and uses lots of power. If I forbid P0, it will spend 2% of its time in P1 and 98% in C, and use one-fourth of the power - at obviously no cost to performance because it's idling anyway. If *that* could happen automatically, imagine the power saving across the board... And by \"that\" I mean every wake-up from C-state should go to P1 first, and then be upgraded to P0 if it lasts long enough. What happens now is that every tiny interrupt goes to P0, and the CPU immediately goes to Precision Boost mode, ramping up voltages and clocks to maximum (especially since power budgets are overflowing) - only to go back to C0 a microsecond later. And since there is only one voltage shared between all cores, any single core's P0 makes *all* cores enjoy the high voltage, even if they are themselves sleeping. I suppose that's where most of the waste goes.",
                "author": "sysKin"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD expands availability of budget Ryzen 5 7400 and 9500F AM5 CPUs",
        "score": 54,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Budget Ryzen3 when?",
                "author": "skylinestar1986"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "I’m sure this is nothing",
        "score": 1812,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The suspense is immeasurable.",
                "author": "WayAgreeable3999"
            },
            {
                "raw_content": "Bart: “Wait, there’s some dust on here.” Help with mortgage _for third rental property_ Lisa: “Wait, there’s still some more dust.” Help with mortgage for third rental property _foreclosure_ Bart: “Wait, there’s a bit more dust” Help with mortgage for third rental property foreclosure _flip_ Lisa: “Just a little more dust.” Help with mortgage for third rental property foreclosure flip _bag holder_",
                "author": "GurProfessional9534"
            },
            {
                "raw_content": "There are a lot more people online than in 2008. I'm not even sure how you could account for it, percentage of all Internet searches for foreclosures?",
                "author": "Streiger108"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "What do we think of this one?",
        "score": 224,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Bankruptcy is another way to individually profit.",
                "author": "Chogo82"
            },
            {
                "raw_content": "[A bit more data](https://i.imgur.com/gtzGFHi.png). Uh oh... https://trends.google.com/trends/explore?date=all&geo=US&q=bankruptcy%20lawyer&hl=en-US",
                "author": "WrongThinkBadSpeak"
            },
            {
                "raw_content": "Needs to go back further in time to be of any real use/comparison. Still interesting zoomed out. https://trends.google.com/trends/explore?date=all&geo=US&q=Bankruptcy%20lawyer&hl=en",
                "author": "niftyifty"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "U.S. Population Growth Will Slow Even More, CBO Says",
        "score": 70,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Great, it can even stop at all. We already have a housing shortage, jobs shortage, we don't need rapid growth until we catch up on something.",
                "author": "Giantmeteor_we_needU"
            },
            {
                "raw_content": "If that’s true, inflation should slow unless if we bring in more migrants",
                "author": "Acceptable_String_52"
            },
            {
                "raw_content": "Good. That’ll allow builders to catch up and better meet demand for housing. Also the non-paywalled article: https://archive.ph/sBmKA > By 2055, the U.S. population will be about 367 million, up from 350 million today. In January, CBO had projected a 2055 population of 372 million. From 1975 through 2024, U.S. population growth averaged 0.9% annually. **By the early 2050s, according to the latest projections, population growth will effectively be zero.** > **The demographic shifts are being driven largely by the major changes in U.S. immigration policy** during President Trump’s second term. Since January, the Trump administration has stepped up border enforcement and emphasized deportations. In July, Trump signed a tax-and-spending law that gave immigration authorities more resources to locate and detain people who are in the country illegally.",
                "author": "ColorMonochrome"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Another big one-day drop today for mortgage rates. Down -0.12 to 6.13%",
        "score": 177,
        "text_content": "Another new low for the year for mortgage rates... it's been just over 3 yrs since we have seen rates in the 5% range for the average 30 yr.. almost there. Already there for FHA, VA. That spread keeps narrowing... * 30 yr = 6.13% * 15 yr = 5.71% * FHA = 5.91% * VA = 5.92% https://www.mortgagenewsdaily.com/mortgage-rates",
        "comments": [
            {
                "raw_content": "I was just quoted 5.8% for 30 year fixed",
                "author": "sarcago"
            },
            {
                "raw_content": "As soon as prices fall 50% these rates will be perfect.",
                "author": "mikalalnr"
            },
            {
                "raw_content": "Just got solicited today for 4.99/5.24 30yr fixed",
                "author": "LikesPez"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "'The CRE crisis is getting worse,' as commercial delinquencies break records",
        "score": 45,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They should have gone under while ago but got propped up by easy $$ and cheap loans during Covid.",
                "author": "Dmoan"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Housing markets across the US are showing signs of trouble as homes linger on the market longer in 44 out of 50 major metros",
        "score": 138,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The worst hit area is Miami, where houses are now sitting unsold for nearly three months — almost four weeks longer than a year ago.",
                "author": "dailymail"
            },
            {
                "raw_content": "It’s evident : gone are the days of the fire sale… with homes going way over asking price, dozens of bids in the short opening days, waived inspection, and tour by FaceTime (all of which I personally saw). This is what NORMAL looks like. You take the weekend to look at homes, take a few days, and make a choice. Home buying is supposed to be about options and making the right decision. Now that homes are more abundantly available, and not selling in 3 days, both the seller and the realtor need to temper their expectations, including the price being blown way WAY tf out of proportion. In my view, you can’t base market prices on “what’s sold recently” when the basis for price was rooted in hysteria to begin with. I’m looking at historic home price increases, over time, before the last 5 years of hyper home inflation and prices are at least 25% higher than they should be. No, I’m not liquidating your home for 33% more value in less than 4 years of ownership … that’s delusional. And neither are other potential home buyers. That’s why no one is buying.",
                "author": "DJDevine"
            },
            {
                "raw_content": "Shocking, list your home for less than the Almighty ZEstimate and you will get bids 😱 but nooo I knewrwhutIgawters can't fathom that",
                "author": "argofoto"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Sellers slam the brakes; new listings fall to record low for August",
        "score": 60,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"If I take my house off the market and relist it next spring at a higher price, no one will suspect a thing!\"",
                "author": "ohhellnaah"
            },
            {
                "raw_content": "Because it's August. Kids are in school and who wants to keep their house completely clean for the slight chance that someone will want to walk through your home to **maybe** consider a purchase.",
                "author": "RealisticForYou"
            },
            {
                "raw_content": "Not in SoCal, plenty of people still gobbling up $1M and up crapshack without much push back. With 30yrs mortgage dropping fast, expect full FOMO to Insanity buying very soon. Next Spring selling season will be off the hook",
                "author": "Scblacksunshine"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "This housing data is the ‘most critical economic variable’ for predicting recessions, and it’s now at the lowest level since pandemic shutdowns",
        "score": 140,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No new building permits is bad news for everyone",
                "author": "External_Koala971"
            },
            {
                "raw_content": "The housing market is long been seen as an early warning sign for recessions, and one data point in particular has caught the attention of Moody’s Analytics chief economist Mark Zandi. In a [social media post](https://x.com/markzandi/status/1967277820045865206?s=46&t=_56klavkvTXRR4AVuBlNpQ) on Sunday, he noted that Moody’s own leading economic indicator that uses machine learning has estimated the odds of a recession in the next 12 months are now at 48%. Even though it’s less than 50%, Zandi pointed out that the probability has never been that high previously without the economy eventually slipping into a downturn. A crucial component in the Moody’s indicator comes from the housing market. “The algorithm has identified building permits as the most critical economic variable for predicting recessions. And while permits had been holding up reasonably well, as builders supported sales through interest rate buydowns and other incentives, inventories of unsold homes are now high and on the rise,” Zandi warned. “In response, builders are pulling back, and permits have started to slump. They are now as low as they’ve been since the pandemic shutdowns.” Last month, the Census Bureau reported that residential building permits in July were at a seasonally adjusted annual rate of 1.35 million, down 2.8% from the prior month and down 5.7% from a year ago. In July, Zandi singled out the housing market for concern, escalating it to a “red flare” as home sales, homebuilding, and house prices were getting squeezed by elevated mortgage rates. While the 30-year fixed rate has since come down from near 7% to about 6.3%, it’s not clear yet if that’s low enough to revive builders or how much it will continue to drop. On Sunday, Zandi said all eyes should be on August permit data, which will come out on Wednesday. “They are sure to provide another reason why the Fed should and will announce a rate cut later that day,” he predicted. In fact, Federal Reserve policymakers have already started worrying about the housing market. Minutes from the central bank’s July meeting revealed concerns about weak housing demand, rising supply, and falling home prices. And not only did housing show up on the Fed’s radar, officials flagged it as a potential risk to jobs, along with artificial intelligence technology. “In addition to tariff-induced risks, potential downside risks to employment mentioned by participants included a possible tightening of financial conditions due to a rise in risk premiums, a more substantial deterioration in the housing market, and the risk that the increased use of AI in the workplace may lower employment,” the minutes said. Permits aren’t the only housing market data point to follow. The economist Ed Leamer, who passed away in February, famously published a paper in 2007 that said residential investment is the best leading indicator of an oncoming recession. On that score, the data doesn’t look good either. In the second quarter, residential investment tumbled 4.7%, accelerating from the first quarter’s 1.3% decline.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "Supply matters a lot less than people think - it's remained balanced with the population for about a decade. You know how we haven't built any houses in 15 years? Yeah, we haven't had any kids since then either. Colleges are already starting to feel that lag effect in enrollments. Interest rates also matter a lot less than people think. Higher rates are mostly useful for keeping speculators out of the market, but list prices today would still be unaffordable for workers today even with 2% mortgage rates. The big factors for affordability are \\* US workers' wages, which have been and will remain permanently pressured downwards due to globalization. Americans are simultaneously far poorer than they were 30-40 years ago, and still the richest and most expensive workers in the world. There was just that much meat on the bone in the latter 20th century. \\*and ultimately, M0 money supply. Because in the end, the Fed can inflate this sucker as much as they want. Wages are sticky going down, but don't necessarily rise with inflation heading upwards. So the govt can just print us out of sight.",
                "author": "ThisKarmaLimitSucks"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Ok should we start worrying",
        "score": 5423,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Crazy how quick it got back up at the beginning",
                "author": "LunoLux"
            },
            {
                "raw_content": "We'd be in serious trouble if they took the team that worked on the balance and get them to work on the aim.",
                "author": "ShelZuuz"
            },
            {
                "raw_content": "It looks like it doesn't like falling. That balance though, it's very impressive wow.",
                "author": "BarisSayit"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Alibaba releases Tongyi DeepResearch, the first fully open-source Web Agent to achieve performance on par with OpenAI's Deep Research with only 30B (Activated 3B) parameters",
        "score": 233,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Did not realize we’ve basically solved SimpleQA by now. How long has that been (for eg gemini/openai deepresearch)? And ~33% for HLE wow.",
                "author": "nivvis"
            },
            {
                "raw_content": "Can anyone find out how this compares with Gemini Deep Think?",
                "author": "ethotopia"
            },
            {
                "raw_content": "https://huggingface.co/Alibaba-NLP/Tongyi-DeepResearch-30B-A3B",
                "author": "Josaton"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Epoch’s new report, commissioned by Google DeepMind: What will AI look like in 2030?",
        "score": 239,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TLDR: scaling likely to continue until 2030 (then who knows), start to see scaling issues by 2027 but easily solvable, no slow downs seen yet, will have things similar to coding agents but for all fields including very difficult to automate fields.",
                "author": "Setsuiii"
            },
            {
                "raw_content": "10-20% productivity improvement doesn't seem that impressive but I guess this will be like a compounding effect",
                "author": "Bright-Search2835"
            },
            {
                "raw_content": "They're dead wrong in assuming recent advances came from scaling. Advances nowadays come from fine-tuning models, new approaches, such as CoT, agentic capabilities, etc. GPT 4.5 was an exercise in scaling, and it failed spectacularly.",
                "author": "Karegohan_and_Kameha"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "AGIBOT X2 - the wheeled/feet robot can now do Webster flips",
        "score": 368,
        "text_content": "https://x.com/XRoboHub/status/1967963381778043116",
        "comments": [
            {
                "raw_content": "there goes subway showtime jobs",
                "author": "o5mfiHTNsH748KVq"
            },
            {
                "raw_content": "I feels like we are seeing minor yet noticeable improvements in robots every week now. This is quite impressive tbh. The most impressive development is the hand of that Chinese manufacturer though. I‘d say that’s about 80 % there, being the most difficult mechanical part.",
                "author": "joeedger"
            },
            {
                "raw_content": "Breakdance robot",
                "author": "Afkbi0"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Nano Banana VS ChatGPT VS Seedream 4 - - \"Make an image of a guy on a chalkboard solving for the hypothenuse of a right triangle, full equation and notation in sight.\"",
        "score": 56,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You can sit and pick apart the minor details, but when you compare this to where things were even a year ago... now try and think about what's it's going to be next year, and the year after. We are not far from images being absolutely indistinguishable from real life. The fact that it is even remotely accurate for what is such an abstract prompt, is incredible.",
                "author": "Evipicc"
            },
            {
                "raw_content": "Here's what i think. Seedream is a really good IMAGE model. The best one imo. But it's not multi-modal. For complex instructions that requires intelligence... it's outclassed by Nano Banana by a lot. It's not intelligent at all. Nano Banana is MULTI-MODAL. It's really good at following complex instructions and editing. But in terms of image quality, it's not as good as Seedream. So if your prompt is something complicated, go Nano-Banana. If your prompt is something basic like \"cute group of women on a cruise ship on a sunny day\", go seedream 4.",
                "author": "Silver-Chipmunk7744"
            },
            {
                "raw_content": "That's actually really impressive the first two got it. Nano even looks *almost* like real chalkboard handwriting. Well, close than ChatGPT, but still fat too perfect.",
                "author": "Uninterested_Viewer"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "New arcagi 2 score (29.4%) using grok scaffold",
        "score": 128,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Crazy that these 2 guys each made huge leaps from grok 4 with just scaffolding. It sounds like they both had different approaches too. So maybe there is a lot more progress that scaffolding alone could yield.",
                "author": "Tman13073"
            },
            {
                "raw_content": "Both are open source. Jeremy Berman (`jerber888`) [repo](https://github.com/jerber/arc-lang-public) Eric Pang (`_eric_pang_`) [repo](https://github.com/epang080516/arc_agi)",
                "author": "neoneye2"
            },
            {
                "raw_content": "This is.. actually kinda wild, for that arc 2 score. 30 frigging percent?! On arc agi 2... Thats somethin.",
                "author": "Kingwolf4"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "xAI’s Colossus 2 – First Gigawatt Datacenter In The World, Unique RL Methodology, Capital Raise",
        "score": 85,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/rudlh3fsalpf1.jpeg?width=1023&format=pjpg&auto=webp&s=9ca1a4386fce1768745f05e43829db5cb0a59b98 >The first half of this report will dig into the Colossus 2 prowess. The second half will discuss Grok models, our mid-to-long term thoughts on xAI, and the **unique RL method** xAI is using that may lead them to leapfrog OpenAI, Anthropic, and Google.",
                "author": "occupyOneillrings"
            },
            {
                "raw_content": "https://preview.redd.it/vmjxs716tmpf1.png?width=2144&format=png&auto=webp&s=78c7a8a76272ab6818bea8675267f9f2b3b289a1",
                "author": "awesomedan24"
            },
            {
                "raw_content": "Isn't putting all your eggs in 1 basket a bad idea? You want distributed load across the world.",
                "author": "BreenzyENL"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Apparently at OpenAI, insiders have graduated from coding: \"we don’t program anymore we just yell at codex agents\" and \"the takeoff looks the most rapid\"",
        "score": 460,
        "text_content": "[https://x.com/tszzl/status/1967821096545382858](https://x.com/tszzl/status/1967821096545382858)",
        "comments": [
            {
                "raw_content": "Thanks to GPT, I can finally create the Malkovich social network, where everyone will be John Malkovich.",
                "author": "SSan_DDiego"
            },
            {
                "raw_content": "This isn’t just an OpenAI thing. This is how we code at my company too now just with roo code",
                "author": "fiscal_fallacy"
            },
            {
                "raw_content": "If this is true then shouldn’t it massively speed up the progress of development ?",
                "author": "drizzyxs"
            }
        ],
        "subreddit": "singularity"
    }
]