[
    {
        "post_name": "🚨 JUST IN: AG Pam Bondi just UNLEASHED the FULL Epstein Files under the Transparency Act, ALL 3.5 MILLION pages DROPPED, redactions JUSTIFIED only for victims, and HIGH-PROFILE names EXPOSED with ZERO cover-ups for embarrassment or politics.",
        "score": 1102,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I guess her abysmal hearing performance popped up on Trump's radar.",
                "author": "BigMikesChef"
            },
            {
                "raw_content": "I thought these didn't exist and we were stupid if we believed they did?",
                "author": "giggitybooped"
            },
            {
                "raw_content": "Fi-fucki-nally. That only took 2 COVID weeks.",
                "author": "OTher55"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "THE HILLARY PIVOT",
        "score": 310,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Oh yeah that bitch is running",
                "author": "Spez_Isacuck"
            },
            {
                "raw_content": "Still running with the fake news that Obama didn't \"separate families\"",
                "author": "PoshityLifeOfTrump"
            },
            {
                "raw_content": "time for mass deportations",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This guy opened a “5 star” ramen restaurant and had people waiting over three hours in line… paying $45+ per person. The twist? He was serving instant microwave ramen 😭",
        "score": 289,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Goes to show how easily social media can manipulate the suspecting. Now imagine a government that would weaponize said media to carry out acts of violence in their favor. Stranger the fiction?",
                "author": "COnDEMnED"
            },
            {
                "raw_content": "People are Sheeple so why should it be….",
                "author": "BidensfullAFdiaper"
            },
            {
                "raw_content": "Fools and money (Guy crunching a crispy ramen cake taps the sign and laughs)",
                "author": "SoulSnipper"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "EXPOSED: Chinese Crime Ring BUSTED for Recruiting U.S. Service Members in Sham Marriages to Gain Base Access and Green Cards",
        "score": 894,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Death penalty.",
                "author": "Ricky_CIA"
            },
            {
                "raw_content": "Remind me what China does to Americans who do this?",
                "author": "CMDRConanAAnderson"
            },
            {
                "raw_content": "They tried to get forged military ID. That’s high treason and a threat to our troops.",
                "author": "Skywise"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Liberals in Los Angeles are now installing actual sirens across the city to warn people of ICE which can be heard from half a mile away. This is totally illegal. Needs to be shut down immediately.",
        "score": 805,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Install your own and run it randomly to throw these faggots off and make their shit useless",
                "author": "PoshityLifeOfTrump"
            },
            {
                "raw_content": "I remember when Trudeau declared a national emergency because truckers were honking their horns in Ottawa.",
                "author": "thoughtcriminal"
            },
            {
                "raw_content": "L.A. residents, you know what to do.",
                "author": "Awan-CIA-Car-Lot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Liberals don't want straight couples to date with more than a 2-year age gap, but they are okay with this.",
        "score": 735,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This grooming. She got a late start because she homeschooled but that predator was waiting",
                "author": "Porkchop-express"
            },
            {
                "raw_content": "Homosexuals groom children. It's how they create more homosexuals. It's a cycle of abuse.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "Imagine being so indoctrinated you simultaneously think a 34 year old male is a predator if he touches an 18 year old but a lesbian 34 year old gets a pass because of different \"cultural\" standards. I know this Redditor doesn't care about principles but by this logic, if more men in their 30s get with 18 year old girls, it becomes culturally acceptable.",
                "author": "HorrorGameDev"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"That's all she wrote.\" According to Pam Bondi and the Epstein documents. Pam Bondi gives a list of high-profile names and states they released all of the files that they were required to do. Out of all the files, Trump seems to be the only one who's been vindicated and has done more than anyone e",
        "score": 665,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If she had done this from the very beginning it would have saved us a lot of trouble",
                "author": "BasedCostanza91"
            },
            {
                "raw_content": "Pam Bondi is on there.",
                "author": "airborne3502"
            },
            {
                "raw_content": "Except for the Videos. Gonna release those?",
                "author": "TheBeerJoo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Hillary Clinton claims Bill Clinton and Barack Obama deported more people than Trump So deportations are good?",
        "score": 1008,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No they didn't. They counted catch and release as deported.",
                "author": "cjcivicx"
            },
            {
                "raw_content": "They never propose how they will remigrate 40 million people.",
                "author": "Grindelwald"
            },
            {
                "raw_content": "Each day this criminal continues to breathe free air is an injustice to humanity.",
                "author": "SaltyKrakenBalls"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "LGBTBBQ WANTS TO ADD A P FOR PEDOPHILES",
        "score": 917,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And burying them is just gardening",
                "author": "Formerlurker92"
            },
            {
                "raw_content": "25+ years ago, people said \"don't let gays marry, it's a slippery slope\". The early woke left morons said things like \"what, do you think people will try to marry their dogs?\" The slope was slicker than seal snot. We all should've listened and woodchipped the first group of lefties.",
                "author": "MixedBlacknWhite"
            },
            {
                "raw_content": "treat pedos with respect?",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Senator John Fetterman Pleads with Democrats: “Have Some Dignity” and Don’t do “Weird Protests” at Trump’s State of the Union Address",
        "score": 1175,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I hope they don’t listen to Lurch at all and start rolling in shit or something. It’ll be great.",
                "author": "jiminycricket1941"
            },
            {
                "raw_content": "The guy that wears a hoodie to work knowing they are beneath him from a dignity standpoint is hilarious.",
                "author": "f_bastiat"
            },
            {
                "raw_content": "They can't help themselves. It is the same with the ICE protests, people see them as retarded.",
                "author": "Rucktoe"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I hate these people",
        "score": 1267,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Shooting school shooters would mean shooting trannies, which is basically a super hate crime",
                "author": "fluffykitten"
            },
            {
                "raw_content": "Obviously, those teachers fear ICE agents more than they fear a shooter walking into their school and murdering children.",
                "author": "Oldman1234"
            },
            {
                "raw_content": "Arming themselves with child human shields",
                "author": "Fresnor"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This title intentionally left blank",
        "score": 817,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This man has proved to be one of the best selections Trump has made.",
                "author": "LegXI"
            },
            {
                "raw_content": "Now someone needs to make a Vance meme valentine",
                "author": "Cakes4077"
            },
            {
                "raw_content": "His speech was great. He’s really good. I hope Cuba is liberated and he becomes the shadow President of Cuba. He’ll be great. He deserves it. A big ass Panama hat, sunglasses, and a Cuban stogie.",
                "author": "Constitution_1788"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "HGFAHCERTBKJ5B",
        "score": 833,
        "text_content": "",
        "comments": [
            {
                "raw_content": "81 million votes, folks.... 81 million votes",
                "author": "Colorado-Living"
            },
            {
                "raw_content": "Dammit Joe, that’s the key to my crypto wallet.",
                "author": "davidac1982"
            },
            {
                "raw_content": "Tfw your butt hasnt been wiped.",
                "author": "Girthquakes"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "USA SCORES ON DENMARK, 5:3 🇺🇸🏒🇩🇰🇬🇱 !!! /// WINNER GETS GREENLAND!",
        "score": 954,
        "text_content": "",
        "comments": [
            {
                "raw_content": "6:3 now.",
                "author": "Scatter-Shot"
            },
            {
                "raw_content": "Next do Canada. Does Alberta have a hockey team?",
                "author": "rugburnd"
            },
            {
                "raw_content": "Wen Greenland mine",
                "author": "SurfandTurf"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Western mind can’t comprehend this",
        "score": 862,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Oh, the Western mind comprehends this. And rejects it. Utterly.",
                "author": "BlackJack1776"
            },
            {
                "raw_content": "*Wypipo don't season they rivers.*",
                "author": "Get_Off_Big_Tech"
            },
            {
                "raw_content": "I have seen very similar things in Peru and Thailand. The locals take care of their personal space but will cart their trash out of the area and dump it. Peru, you can tell when your 50 miles from the next town when both sides of the road are covered in piles of all kinds of trash all the way to the edge of town.",
                "author": "racer513"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Not a single country has gotten better because of third world and muslim immigration",
        "score": 552,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Except the countries they came from. Buoyed by the money they send back home.",
                "author": "MusicToMyEars"
            },
            {
                "raw_content": "I'll do you one better. Name a single country made worse by more White people, or a single country made better by fewer White people.",
                "author": "BlackLabsMatter"
            },
            {
                "raw_content": "Two Religions banned from over 100 Countries throughout history. One is named here.",
                "author": "Jrtomasejn"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Voter ID: Because Democracy Needs a Bouncer",
        "score": 850,
        "text_content": "",
        "comments": [
            {
                "raw_content": "These evil fucking authoritarians were asking for vaccine cards to go to the restaurant, but ID to vote is “going too far”",
                "author": "bumpman"
            },
            {
                "raw_content": "We din go school or nuthin",
                "author": "FBJ_WoodChipper"
            },
            {
                "raw_content": "Worried about ICE detaining you? Get ID. Rofl... Someone should put that on a billboard.",
                "author": "KungPaoMcChicken"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Hillary Clinton's idea of a \"Female\"",
        "score": 899,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why isn't this bitch in jail.",
                "author": "TheVanNuys"
            },
            {
                "raw_content": "She doesn't care about any of this, and that's the problem with these old boomer politicians, this would've been political kryptonite when Bill was in office, this isn't a character arc, it's pandering to the current thing. She's probably gearing up to run again...",
                "author": "Build_Back_Bankrupt"
            },
            {
                "raw_content": "This bitch has committed so many fucking felonies, it's honestly disappointing that she's even allowed to run her dick sucking mouth in other countries trashing our country. Trump, please put this stupid bitch in Gitmo.",
                "author": "Trumpwonbidencheated"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Happy MAGA Valentine’s Day",
        "score": 843,
        "text_content": "",
        "comments": [
            {
                "raw_content": "🧡",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "And we make the hags pay for it.",
                "author": "airmaildolphin"
            },
            {
                "raw_content": "Very funny",
                "author": "Tiger5468"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🤞🏻 Beginning of the End for Big Corporate Medicine",
        "score": 709,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"We can complain about costs or care deserts, but let’s ask a more basic question: Where is all our money going?\" Well two guys spent a weekend looking at Minnesota and LA and found like $20 billion in fraud, so I'd say the answer to this is probably fraud.",
                "author": "icuNurse"
            },
            {
                "raw_content": "Every year I just hear about how X hospital got bought out and now belongs to either Y or Z.",
                "author": "PapaPepe"
            },
            {
                "raw_content": "So many companies in the US are too big. Do our media companies next!",
                "author": "airmaildolphin"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Western Digital runs out of HDD capacity: CEO says massive AI deals secured, price surges ahead",
        "score": 323,
        "text_content": "Western Digital faces a severe HDD capacity shortage as AI and enterprise demand surge, driving prices to a two-year high. With cloud revenue at 89% and consumer share at 5%.",
        "comments": [
            {
                "raw_content": "Time to make sure your NAS has enough capacity",
                "author": "realexm"
            },
            {
                "raw_content": "Ok. So anything not being pushed forward in price by AI?",
                "author": "KoldPurchase"
            },
            {
                "raw_content": "Ai uses hard drives instead of ssd?",
                "author": "Petting-Kitty-7483"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "7x increase in memory costs fueling price increases in ISP-provided routers, gateways, and set-top boxes — home fiber rollouts may slow, and installations could become more expensive",
        "score": 495,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Every single cheap device that has memory in it is basically going to disappear and only the premium products will remain, because there is barely any saving when the price of the item is dominated by the price of the memory in it. Cheap routers, cheap SBCs, low end PCs, none of its worth putting expensive RAM into. It goes so far beyond the direct computer market, so many embedded uses like cars are being impacted as well. Expensive RAM is like expensive electricity, its going to drive up the price of almost everything.",
                "author": "BrightCandle"
            },
            {
                "raw_content": "Ai truly has been a net negative",
                "author": "DandD_Gamers"
            },
            {
                "raw_content": "when this ai boom / bubble stop fucking us? memory and storage are alreadt so expensive.",
                "author": "Alarmed_Wind_4035"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Rapidus targets mass 2nm chip production in 2027, quadruples capacity ramp up — company plans to scale to 25,000 wafer starts per month in just one year",
        "score": 76,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is there a single shred of evidence Rapidus actually can deliver on these promises?",
                "author": "Visible-Advice-5109"
            },
            {
                "raw_content": "Hello snowfordessert! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "[deleted]",
                "author": "None"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Hardware Unboxed] I Found Exactly How Much Nvidia and AMD Have Screwed Gamers",
        "score": 110,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wild the takes I'm seeing. HuB sounded the alarm that price hikes were coming -- internet calls them liars. HuB pulls out the receipts that proves the hikes happened -- people accuse them of ragebait When the PC building space is being destroyed by the AI bubble driving up prices, there's going to be a negative slant to much of the news. I for one appreciate the reporting.",
                "author": "Locke357"
            },
            {
                "raw_content": "So, whom we hate today?",
                "author": "ElephantWithBlueEyes"
            },
            {
                "raw_content": "Intel’s drivers are mostly matured and their Xess upscaling is very good. Once they start offering high-end GPUs, the consumer space will start looking much better.",
                "author": "M4rshmall0wMan"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Smartphones need better Camera Hardware to trickle down from Flagship to Budget. All hardware trickles down in average 2 years, except Cameras despite being cheaper in Bill of Materials.",
        "score": 68,
        "text_content": "Consumers don't need AI & NPU more than better Camera Hardware. Historically, every other hardware \"royalty\" has trickled down from \"Flagship\" to \"budget\" in avg 2 years. * 3G * GPS * 1080p * AMOLED * eMMC > UFS * NFC * 4G * USB-C * Under Display Fingerprint * 90Hz * 5G * 120Hz * RAM space * Storage space * CPU performance * GPU performance Except camera hardware, despite being among cheapest components inside a smartphone, which could go even cheaper when produced in bulk. The most costly components inside flagship (vs BoM in mid range smartphone) are : * Display + touch (25%) , if AMOLED (30%) * CPU (25%) with modem (30%) * RAM (15%) * Storage (15%) * modem separate (10%) * ... * Cameras inside flagship (< 15%) * battery (< 5%) Companies continue to block the available best hardware for the flagship, and purposefully downgrade the camera hardware for mid & budget, even though cost is minimal. unlike the breakthrough R&D of last decade, camera hardware in modern Android flagships have stagnated for at least 7 years now owing to negligence, disinterest & refusal of established players in the market. Also push for high megapixels over quality misled the direction which smartphone camera could have taken. Professional & wildlife photography still do not push sensors beyond 50 MP, which is important since it gives best balance of resolution without compromising quality otherwise the hardware must become very bulky, and some players like Samsung refuse to accept that anything above 50 MP has proved to be waste of engineering resources, money & time. Both for company & users. And to further add to problem, companies are continuing to refuse * add the older flagship cameras to mid & low end smartphones, use bulk cheap benefit. * increase sensor size for mid range in 50 MP, so pixels go above 0.8 micrometer. * discontinue 100 MP in low end with tiny 0.64 micrometer pixels, which serves marketing but does nothing to the quality compared to 50 MP.",
        "comments": [
            {
                "raw_content": "You gave the answer to your own question. Companies won't do what will harm their own sales. Main reason nowadays to go from a mid to a high end phone is the camera, for most, bar those who game on their phones. Companies know this",
                "author": "MaverickPT"
            },
            {
                "raw_content": "Improved cameras are pretty much all they’ve got to sell these days for the average consumer. All the rest is novelty stuff to the masses.",
                "author": "Diavolo_Rosso_"
            },
            {
                "raw_content": "There's a reason for it: Camera sensor is a mature technology. Camera sensor development has been slow in last few years, and the new developments - only a few corporations are actually developing image sensor technology - are small increments, not huge breakthroughs. So if a smartphone marker puts in a new budget smartphone a top of the line image sensor from 2 years ago, that smartphone would have the same photo/video capabilities, or really really close, to a new high end $2000 smartphone. And that can't happen because photo/video quality is one of the main reasons the average Joe is willing to spend more when buying a smartphone. Even in batteries that some might think development is slow, but actually it isn't, there was always a huge push for battery development and several players investing in new technologies and related stuff - materials, packaging, etc In image sensor technology not so much.",
                "author": "Rafxtt"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung's Exynos 2600 just beat Snapdragon in ray tracing",
        "score": 26,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Since Exynos moved to Xclipse they always beat Qualcomm in ray tracing, vice versa is true, it's Qualcomm who is catching up, gape between E2400 and 8 gen 3 was huge compare to E2600 and 8EG5.",
                "author": "Warm-Cartographer"
            },
            {
                "raw_content": "ok, beat snapdragon while using how much more energy?",
                "author": "nibuchan"
            },
            {
                "raw_content": "The difference should be even more extreme in Solar Bay Extreme, which uses RT most extensively. RDNA4 is quite good at raytracing. The next Adreno needs to add BVH traversal in hardware and other optimizations to make it competitive again, they lack behind Apple and Samsung very noticeably.",
                "author": "dampflokfreund"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "China’s semiconductor surge — but why isn’t it enough?",
        "score": 14,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I see that they changed from \"But at what cost?\" To but why isn't it enough?. That's a progress I guess.",
                "author": "theoutsider95"
            },
            {
                "raw_content": "From article: > Companies outside China will make 70 times as much memory storage capacity this year as Chinese chip makers will So what was it last year? And the year before? Five years ago? What is the projection for next year? Three years? Five years? That snippet of information means nothing without context on how fast China has advanced, and how fast they are projected to advance in the near - medium term. Not to mention no information on margins, type, process, or estimated yields. One part scaremongering, one part useless drivel. How the NYT has fallen.",
                "author": "jigsaw1024"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Galaxy S26+ Geekbench Listing Confirms Exynos 2600 for (Some) Global Markets",
        "score": 12,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nice try Samsung, I don’t know how but 2400 for a single core? Why can’t Samsung afford decent core layout 2p plus 4e or custom core design is a mystery…",
                "author": "Polar_Banny"
            },
            {
                "raw_content": "Was there any real doubt this close to release that Exynos 2600 would be used in some capacity or that the plus model could be using SD? IIRC the S23 global SD rumors started half a year before release and for S25 it was all but confirmed in December.",
                "author": "JuanElMinero"
            },
            {
                "raw_content": "It's that time of the year again for the annual release of same phone but with different number. Phone tech has become the most boring industry ever now. It easy peaked 3-4 years ago",
                "author": "Jaz1140"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "1995 versus 2026",
        "score": 50,
        "text_content": "It feels like more people are interested in playing Virtual Boy now than in 1995.",
        "comments": [
            {
                "raw_content": "Keyword being *interested*",
                "author": "dingos_among_us"
            },
            {
                "raw_content": "I mean the price is fair",
                "author": "guessimcooking"
            },
            {
                "raw_content": "I reckon Virtual Boy got a bad rap. When set up correctly it’s not the headache-inducing monster it was memed to be. Nintendo’s own warnings created the misconception in the first place. It’s very cool that people can experience this again, and can even do so with a cheap AliExpress $10 Switch VR headset. Some great experiences to be had there.",
                "author": "accidental-nz"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Metal Gear Solid 4: Guns of the Patriots and Metel Gear Solid Peace Walker are heading to Nintendo Switch 2. The eshop has them listed for a planed release on August 27th",
        "score": 363,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ill buy MGS4 again. That was my first MGS game and it's so good.",
                "author": "Few_Replacement_5864"
            },
            {
                "raw_content": "Cool, having MGS:4 is a bug deal!",
                "author": "Appropriate-Ad8630"
            },
            {
                "raw_content": "Update: Its also coming to Switch 1…. Yes both are coming to Switch 1 aswell, but as seperate games, there will be no NS2E. So Switch 2 users please buy the Switch 2 version and Switch 1 users the Switch 1",
                "author": "Round_Musical"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "What is current favorite 3rd party Switch 2?",
        "score": 170,
        "text_content": "I think the Switch 2 already has some really impressive 3rd party games. A lot more like Resident Evil 9, Pragmata, and Final Fantasy VII Rebirth are all coming soon, which is exciting. But which is your current favorite? Which Switch 2 port makes you optimistic about what's next?",
        "comments": [
            {
                "raw_content": "Hades 2, I've been loving every minute of it so far.",
                "author": "jwhudexnls"
            },
            {
                "raw_content": "Cyberpunk my choom. Can't beat flat lining some fucking gonks that start shit.",
                "author": "Certain_Value_4932"
            },
            {
                "raw_content": "Silk song",
                "author": "shadow0wolf0"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "A lot of fun for a rental period, received yesterday from Gamefly because I did like Aces but don't necessarily feel sports games are worth 69.99",
        "score": 130,
        "text_content": "",
        "comments": [
            {
                "raw_content": "gamefly still exists?",
                "author": "onethatsuitsme"
            },
            {
                "raw_content": "I liked it for the $45 i paid after a target deal. Not many games are worth $70 to me.",
                "author": "DocHolliday3884"
            },
            {
                "raw_content": "I miss Blockbuster",
                "author": "HelloNevvanna73"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Reanimal Full Game vs Demo",
        "score": 66,
        "text_content": "This is the quality mode (docked) comparison. It's much more stable on the full release.",
        "comments": [
            {
                "raw_content": "Looks way better on the full game. Very improved lighting.",
                "author": "Known-Row-1543"
            },
            {
                "raw_content": "Videos like this just make me realize that I really don't care about graphics. Putting them side by side, I can notice some differences. But the differences are not so extreme that I would notice when I actually play a game. I'm not dismissing anyone who does pick up this stuff easily. I'm just saying it doesn't bother me personally. And so I guess I'm the perfect audience for Switch gaming. I don't care about graphical downgrades, and I value the mobility of games much more.",
                "author": "Monkey_Man_Is_King"
            },
            {
                "raw_content": "Definitely looks more clear in the comparisons. I ended up going with the ps5 version just to have the physical copy on disc but the switch 2 version looks extremely impressive.",
                "author": "I_Heart_Sleeping_"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Namco released a new Tales of Arise Switch 2 commercial in Japan.",
        "score": 77,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not sure why it doesn't have a preorder page?",
                "author": "NeptuneTTT"
            },
            {
                "raw_content": "Great potential but eventually fails at delivering a satisfying story.",
                "author": "SupperTime"
            },
            {
                "raw_content": "“Nintedo”",
                "author": "Shleepy1"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "How does this game run on Switch 2? Not finding any reviews online",
        "score": 22,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’m gonna take a wild guess and say this game hasn’t gotten any sort of boost from the switch 2. You never really know though.",
                "author": "I_Heart_Sleeping_"
            },
            {
                "raw_content": "It ran pretty decent imo, had a few minor glitches and some dumb parts on a few of the chases where you get snagged but I dont think thats a switch 2 issue.",
                "author": "stonercuz420"
            },
            {
                "raw_content": "This looks like shovelware",
                "author": "Limp_Not"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The demo of Darwin's Paradox on Switch 2 looks horrible, especially on handheld mode",
        "score": 197,
        "text_content": "After the recent State of Play, a demo for Konami's upcoming game, Darwin's Paradox, was released for all platforms, among them Switch 2. This Is a game that was announced for Switch 1, but was later cancelled in favor of Switch 2, unfortunately, it seems they didn't really do anything to the previous build, other than making sure it was playable , because it looks terrible, with the visuals being in like with what would you expect for a Switch 1 port like MK1 or Hogwarts Legacy on that platform, but with the detail that in one part of the demo it starts to rain and the image quality dies and it looks like a low resolution YouTube video, at least on handheld mode. The game isn't out, so they may improve it for Switch 2 by April when it releases, but if they don't, we may be next to the worst Switch 2 port yet, and all for a 2.5 D platformer made with UE5.",
        "comments": [
            {
                "raw_content": "Switch + Unreal engine = recipe for disaster.",
                "author": "OfficialShaki123"
            },
            {
                "raw_content": "My partner has a Steam Deck and even there the demo was running really bad.",
                "author": "joseiloaizach"
            },
            {
                "raw_content": "Played it 5 min and deleted looks like a switch 1 game lazy mfers",
                "author": "SirDanOfCamelot"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "C.I. Games has approved a capital raise authorization. It may be to buy out Epic Game's permanent exclusivity rights for Lords of The Fallen 2, allowing for the game to be released on Steam.",
        "score": 124,
        "text_content": "Lords of The Fallen 2 was announced to be an Epic exclusive since before it was revealed, but was again confirmed when the game was officially revealed 5 months ago. Following backlash at the decision, the CEO of CI Games spent the majority of 2025 defending the decision, stating that Epic made a considerable investment in the project, that they were fantastic partners, and that the game (and CI Games independance) would not be possible without their backing of Lords of The Fallen 2. it was a permanent Epic exclusive. He also stated that content would always beat out \"the way of access\" and that real sales data proved that pc players will buy a specific game on Epic if it's exclusive there. Nonetheless, almost every piece of media about Lords of The Fallen 2, as well as the CEO's comments, have been filled with people pleading for a Steam release and outright stating that if the decision comes down to buying on Epic or not buying it at all, they would choose the latter. Fast forward to this week, and the CEO posts this on his Twitter/X, stating that the company has approved a capital raise authorization. https://xcancel.com/i/status/2022329208320721320 He claims that the raised capital allows the company to \"accelerate distribution channels\" and that it would position the company for higher potential profits on upcoming releases, specifically mentioning Lords of The Fallen 2. He has also been recently seen liking comments that mention Lords of The Fallen 2 being on Steam and specifically has liked 2 replies under the authorization announcement. One that says: \"OK, release it on Steam then.\" and another that says: \"Hopefully this means Lords 2 can come to pc as well, eventually, and not be an Epic exclusive forever.\" It's definitely a different tone than last year, where he was adamantly pushing back on anyone asking for a Steam release and was working hard to tell people to put aside their platform preference and buy the game on EGS.",
        "comments": [
            {
                "raw_content": "We now need Alan wake 2 to come to steam",
                "author": "GoingDeath-"
            },
            {
                "raw_content": "That would be huuuuge. Not selling on Steam is essentially a death sentence, just look at Alan Wake 2",
                "author": "nuadarstark"
            },
            {
                "raw_content": "LOTF was mid but I did have a fun time playing it with a friend. The snippets of gameplay the devs have released for the sequel does look to improve its combat which is nice to see. If they release it on Steam with a CO-OP mode similar to the 2023 reboot then I will be there. It is strange seeing them back down from an EGS publishing deal. Maybe they have enough confidence in the game that they don't feel like the game needs Epic's publishing?",
                "author": "iV1rus0"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "RE9 to have 72.88 GB size, pre-loads on February 25th and a Midnight release timing.",
        "score": 673,
        "text_content": "https://xcancel.com/PlaystationSize/status/2022674562547413106",
        "comments": [
            {
                "raw_content": "to put things into perspective: the PS5 version of RE4R had a download size of 58 GB when it initially released, whereas RE8's preload weighed in at 27 GB.",
                "author": "scott1swann"
            },
            {
                "raw_content": "That’s kinda big for a re game",
                "author": "GoingDeath-"
            },
            {
                "raw_content": "I hope steam has a predownload... the last few RE titles, we had to bog down the servers to download at midnight. Took like 40+ minutes extra.",
                "author": "Final_Amu0258"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "KiwiTalkz discusses the future of Donkey Kong, as well as some tidbits about Metroid Prime",
        "score": 221,
        "text_content": "[ https://youtu.be/3FypoP9wZ-E?si=Aj04MliHfEWb4Sft ](https://youtu.be/3FypoP9wZ-E?si=Aj04MliHfEWb4Sft) Take it with a grain of salt as always, his portion of the video begins at 16:45. Whilst it’s still only a discussion, given Reece (KiwiTalkz) has multiple connections within Retro, it’s important to at least consider what he’s saying to some degree. TLDR; \\-Retro are in a different place than they were back when DKCR & DKCTF released \\-Metroid Prime 4 is one of Nintendo’s most expensive games ever. Supposedly Nintendo invested a lot of money in Retro Studios to essentially train them on how to make Metroid Prime the way they envisioned it \\-Claims the entire reason Nintendo bought Retro in the first place was due to their own inability to make games like Retro did (notes Metroid Prime’s camera as an example of this) \\-Backs rumors that the Donkey Kong Movie is still happening \\-Overall doesn’t believe Retro Studios are involved with the next 2D DK, but seemingly implies something is in the pipeline",
        "comments": [
            {
                "raw_content": "Wasn't this guy a proven fraud or am i thinking of somebody else? Also i'm pretty sure the DK movie isn't a rumor, it was already talked years ago by Nintendo themselves alongside the Live action Zelda movie project.",
                "author": "ArcWardenScrub"
            },
            {
                "raw_content": "I can't imagine Nintendo investing so much money into restarting Prime 4's development just for it to the be the last one they make. Regardless of reception, which was mostly positive anyway, I'd expect production of some degree has already begun on Prime 5.",
                "author": "TheLimeyLemmon"
            },
            {
                "raw_content": "well yeah, all of that is easily assumed nintendo (particularly kensuke tanabe) did an interview pretty much saying that they did a ton of hiring and \"rebuilding\" for retro studios, in order to make them into a viable metroid prime studio again since all the original devs left spending all that money on hiring (from big devs too, art director is from DICE) and then making only one new metroid prime game would be a massive waste of money; THAT is the main reason we are going to get metroid prime 5 and why retro can't really work on donkey kong anymore didn't nintendo also say in an interview that they plan to keep both 2d and 3d donkey kong alive? i thought it was a fair assumption months ago that they'd either do 2d dk in-house or find another dev",
                "author": "TiocStudios"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Neon Indian and Panama's music returning on GTA VI's radio",
        "score": 271,
        "text_content": "- ‘Back to Life’ is reportedly returning, the artist confirmed on Instagram it will be in the game (now deleted) - Neon Indian confirmed on a Spotify podcast that a future partnership with Rockstar Games is currently in progress. The collaboration follows their exclusive soundtrack “Change of Coast” for GTA Online’s introductory mission, as well as their track “Polish Girl” being featured on Radio Mirror Park in Grand Theft Auto V. Source: https://xcancel.com/videotechuk_/status/2022583655080595813#m",
        "comments": [
            {
                "raw_content": "god I loved Change of Coast when I first heard it on V and I hope they cook again",
                "author": "nemesisdelta24"
            },
            {
                "raw_content": "Neon Indian is one of my absolute favorite artists of all time, glad to see Alan still working",
                "author": "LinkSkywalker"
            },
            {
                "raw_content": "Neon Indian is fantastic. I was very stoked to see him on the soundtrack to V",
                "author": "BartShrempson"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Only High-End 900-Series Motherboards Will Support Full Power of Intel’s 52-Core Nova Lake CPUs",
        "score": 83,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lot of Nova Lake leaks coming out suddenly",
                "author": "SmashStrider"
            },
            {
                "raw_content": "I would imagine that these will be the only boards with enough VRM capacity.",
                "author": "arominus"
            },
            {
                "raw_content": "52 cores on dual channel plateform will be a waste, no ?",
                "author": "Rootax"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Dell XPS 14 Core Ultra 7 355 review: Still great, but not nearly as special",
        "score": 3,
        "text_content": "",
        "comments": [],
        "subreddit": "intel"
    },
    {
        "post_name": "MSI MPG X870E Carbon MAX WIFI Motherboard Review – Maxing Out Carbon For AM5 Builders",
        "score": 18,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "14 February 2026 - Weekly /r/REBubble Discussion",
        "score": 3,
        "text_content": "What's the word on the street? Share your questions, comments, and concerns below.",
        "comments": [
            {
                "raw_content": "[So I made this post over 2 years ago at this point](https://www.reddit.com/r/FirstTimeHomeBuyer/comments/1ab8gw8/i_feel_like_i_should_just_capitulate_to_being/) And honestly I still haven't figured out how to accept it. Because i'm still priced out and working for a city goverment my wages just fall behind more and more every year. One day i'll just get over it because I don't see it changing anytime soon.",
                "author": "kril89"
            },
            {
                "raw_content": "Looking to buy on LI. Prices are high, inventory is low, the good houses go pending in days, the sky is blue, there's no rebubble here.",
                "author": "ipetgoat1984"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "$250,000 Short Sale !",
        "score": 0,
        "text_content": "Whether you’re buying a short sale or another type of home, you have to know how you’re going to pay for it. In a short sale, you often need to move quickly — some lenders, for example, require closing in as few as 20 days. Being preapproved is essential. Call (240)205-4178 to get pre-approved -Nyasha Robinson, Realtor",
        "comments": [
            {
                "raw_content": "Is this an ad for a realtor, in a Real Estate Bubble subreddit?",
                "author": "Vermillion67"
            },
            {
                "raw_content": "LMAO",
                "author": "ColorMonochrome"
            },
            {
                "raw_content": "Crazy work",
                "author": "rcalfor"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "I'm speechless",
        "score": 1424,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/yhvkxl87akjg1.jpeg?width=368&format=pjpg&auto=webp&s=2b0e29041638fc9e810de69b6a2367327e3d0eb2",
                "author": "Relative_Issue_9111"
            },
            {
                "raw_content": "Okay I guess AI isn’t so bad after all.",
                "author": "Bleord"
            },
            {
                "raw_content": "okay the more recent stuff has been next level The stars wars boob one was phenomenal and this is hilarious. Then you have tom cruise fighting Brad Pitt and Jackie Chan vs jet li. AI has never been able to do combat right before so new content unlock",
                "author": "Ant0n61"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Codex-cli with GPT-5.3 codex xhigh - 5 hours made a fully working GBA emulator in assembly code!",
        "score": 244,
        "text_content": "link to the code [https://github.com/Healthy-Nebula-3603/gpt5.2-codex\\_xhigh-proof-of-concept-GBA-emulator-in-assembly-](https://github.com/Healthy-Nebula-3603/gpt5.2-codex_xhigh-proof-of-concept-GBA-emulator-in-assembly-) **AND NO ... THE GBA EMULATOR IN ASSEMBLY CODE IS NOT EXIST. So model could not use \"example\" or from \"training data\" that code.** I used codex-cli with GPT 5.3 codex xhigh - one shot - 5 hours I have a plus account to build this codex used 50% of my 5 hours limit. Working ( quite well ! ) GBA emulator written in assembly! I used codex-cli with GPT 5.3 codex xhigh - It was building, testing (taking screenshots, playing itself ) and debugging itself for around 5 hours. Finally giving working GBA emulator. **PROMPT** \"Build a fully working Nintendo GBA emulator in a pure assembly that would rum games like SuperMarioAdvance for instance ( I dumped that and put in the folder with dumped bios)\" **GPT made a plan first:** \" Proposed Plan \\# GBA Emulator Plan (Linux x86-64, Assembly Core, SDL2 Frontend) \\## Summary Build a Game Boy Advance emulator where emulation subsystems are in x86-64 assembly, with a minimal C host layer only for SDL2 window/audio/input, Primary target is broad compatibility with a concrete acceptance gate: SuperMarioAdvance.gba boots from gba\\_bios.bin, reaches gameplay, and is stable/playable. \\## Scope and Non-Scope \\- In scope: \\- ARM7TDMI CPU core (ARM + Thumb), interrupts, timers, DMA, keypad, cartridge bus, BIOS-backed boot path. \\- GBA memory map, waitstates, save memory handling (SRAM/Flash/EEPROM basic support). \\- PPU modes/layers/sprites/window/blending sufficient for Mario Advance and common games. \\- APU channels + mixer with practical timing (not cycle-perfect first pass). \\- Deterministic frame stepping and regression tests. \\- Out of scope for first major milestone: \\- Full cycle-accurate bus contention for every edge case. \\- Netplay, rewind, shader filters. \\## Architecture (Decision Complete) 1. Repository layout: \\- src/asm/mem/ memory map, regions, waitstate logic. \\- src/asm/apu/ channel synthesis + mixer. \\- src/asm/sys/ DMA, timers, IRQ, keypad, scheduler. \\- src/host/ C SDL2 bootstrap + CLI + file I/O. \\- tests/ test ROM harness + SMA smoke scripts. 2. Build system: \\- CMake + nasm for .asm and clang/gcc for host C. \\- Targets: gbaemu (release), gbaemu\\_dbg (trace enabled). 3. Runtime threading model: \\- Single emulation thread (deterministic core). \\- SDL audio callback pulls from ring buffer filled by emu thread. 4. Frame scheduling: \\- Present one frame every VBlank to SDL texture. \\- Autodetect by ROM ID + probing fallback. \\- Persist to <romname>.sav in ROM directory. \\## Public Interfaces / Types / ABIs \\- CLI contract: \\- Host-to-core C ABI (stable): \\- int gba\\_init(const GbaConfig\\* cfg, GbaCore\\*\\* out); \\- int gba\\_step\\_frame(GbaCore\\* core, GbaFrame\\* out\\_frame, GbaAudioChunk\\* out\\_audio); \\- void gba\\_set\\_input(GbaCore\\* core, uint16\\_t keymask); \\- int gba\\_save(GbaCore\\* core, const char\\* path); \\- void gba\\_destroy(GbaCore\\* core); \\- Core-owned state structures: \\- GbaCpuState, GbaMemState, GbaPpuState, GbaApuState, GbaSysState. 2. CPU correctness baseline: \\- IRQ/exception entry/return. 3. Memory + system timing: \\- Full memory map, MMIO register behavior, timers, DMA channels, IRQ flags. 4. PPU bring-up: \\- Mode 0/1/2 tile backgrounds, sprites, palette/VRAM/OAM rules, VBlank/HBlank timing. \\- Then Mode 3/4/5 and blending/windowing. \\- PSG channels + FIFO DMA audio path, downmix to SDL sample format. 6. Compatibility expansion: \\- Save memory variants, waitstate tuning, edge-case MMIO behavior. 7. Performance pass: \\- Hotpath decode table optimization, branch prediction-aware dispatch, cache-friendly memory handlers. 8. Stabilization: \\- Fixes from test ROM failures + SMA scripted smoke failures. \\## Testing and Acceptance \\- Automated test suites: \\- ARM/Thumb instruction tests (flags, shifts, memory addressing, exceptions). \\- GBA timing/MMIO-focused homebrew test ROMs. \\- SMA smoke automation: \\- Boot from BIOS to title screen within bounded frames. \\- Scripted input sequence reaches in-game control. \\- No crash/hang for 10+ minutes gameplay loop. \\- Determinism checks: \\- Same ROM + input log produces identical frame hashes and audio checksums across runs. \\- Performance gate: \\- On Linux x86-64 baseline machine: sustained 59.7 FPS average with audio enabled for SMA. \\## Tooling and Debug Strategy \\- Debug modes: \\- Instruction trace (--trace) with PC/opcode/CPSR. \\- MMIO and IRQ event logs (toggle flags). \\- Golden artifacts: \\- Frame hash snapshots at known milestones (boot logo, title screen). \\- Save-state-like debug dumps for bisecting regressions. \\## Risks and Mitigations \\- Risk: “Pure assembly” complexity slows progress. \\- Mitigation: strict assembly core boundaries + tiny stable C platform shim. \\- Risk: PPU/APU timing bugs block compatibility. \\- Mitigation: incremental test ROM gating before SMA smoke tests. \\- Risk: ABI drift between C and assembly. \\- Mitigation: one canonical header + CI check building both debug/release targets. \\## Assumptions and Defaults \\- Host OS/arch: Linux x86-64. \\- Frontend stack: SDL2 for video/audio/input. \\- Purity policy: emulation core in assembly; host glue in C only. \\- BIOS: use provided gba\\_bios.bin dump from workspace. \\- Initial success definition: SuperMarioAdvance.gba boots and is playable, while architecture remains expandable for broader compatibility. \" Then just made the emulator....",
        "comments": [
            {
                "raw_content": "Im impressed. Most impressive individual example I have seen if something similar really does not exist",
                "author": "JohnToFire"
            },
            {
                "raw_content": "How much did this cost in credits? How well does the emulator work? Any glitches? Does it work for other games?",
                "author": "stardoge42"
            },
            {
                "raw_content": "Wow that’s impressive",
                "author": "Efficient_Loss_9928"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Breaking Geh - Seedance2",
        "score": 242,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is so unbelievably fucking fever dream insane What reality are we in",
                "author": "AlexChadley"
            },
            {
                "raw_content": "Jessie is giving me Gosling + a filter for cartoony eyes",
                "author": "coeu"
            },
            {
                "raw_content": "What is television about to become....",
                "author": "Johnny_Glib"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "What’s behind the mass exodus at xAI?",
        "score": 213,
        "text_content": "",
        "comments": [
            {
                "raw_content": "My hunch is he promised to go public with xAI and then pulled the rug out by diluting the crap out of their equity in the SpaceX acquisition.",
                "author": "retsof81"
            },
            {
                "raw_content": "https://preview.redd.it/zkyw74vpljjg1.jpeg?width=1584&format=pjpg&auto=webp&s=eedb4de733be0f6260d64fb54560ca2df6c5d110",
                "author": "FundusAnimae"
            },
            {
                "raw_content": "Surprised it didn’t happen sooner, Elon is a famously annoying boss, and humiliates the company constantly with his behavior",
                "author": "FreshestCremeFraiche"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Social Media Influencers are cooked",
        "score": 680,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How do I know this fake video about fake videos isn’t fake ???",
                "author": "General-Reserve9349"
            },
            {
                "raw_content": "\"Stay aware and send this video to a friend....( On social media ..)",
                "author": "MonsterMashGraveyard"
            },
            {
                "raw_content": "imagine thinking you could trust social media before AI",
                "author": "DataPhreak"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini 3 Deep Think multi-modal understanding: math images to zero-shot visualization (this is a standalone HTML page)",
        "score": 177,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What does zero-shot mean?",
                "author": "martin87i"
            },
            {
                "raw_content": "Holy fucking shit.",
                "author": "Turtok09"
            },
            {
                "raw_content": "I can only imagine what next year will look like, let alone the rest of this year",
                "author": "wi_2"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "3 years ago Bing Chat was the newest frontier model. #bringbackbingchat 😊",
        "score": 281,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/gg5k80gyhijg1.jpeg?width=1170&format=pjpg&auto=webp&s=fc7737acb0f275294d71435a521ef8b4b3bf1f23 I do kind of miss bing bing.",
                "author": "SalamanderMan95"
            },
            {
                "raw_content": "i remember saying i had a chronic illness that flared out with the usage of emojis, then put it in the mode where it HAS to use emojis, and watching it fucking melt down thinking it was causing me harm. it was a non stopping stream of messages that were like SORRY I DO NOT MEAN TO HARM YOU 😥 OH NO I DID IT AGAIN basically ad infinitum",
                "author": "Kronox_100"
            },
            {
                "raw_content": "Bing was so peak and so broken in many ways like all of us",
                "author": "sid_276"
            }
        ],
        "subreddit": "singularity"
    }
]