[
    {
        "post_name": "Even NBC Knows It's the Schumer Shutdown and That Democrats Own It",
        "score": 709,
        "text_content": "",
        "comments": [
            {
                "raw_content": "we all know it",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "The Schumer Shit Show.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Don't be fooled. They're trying to get rid of him and have AOC replace him.",
                "author": "knnbccb"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "U.S. Secretary of War Pete Hegseth has ordered the call up and federalization of 400 Airmen and Soldiers with the Texas National Guard in order to “perform federal protection missions where needed, including in the cities of Portland and Chicago.”",
        "score": 841,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hell yes. This is an absolutely genius move from Trump. Judge blocks him from activating Oregon's national guard? No problem, we'll just send them from another state.",
                "author": "switchhand"
            },
            {
                "raw_content": "> 𝘼𝙡𝙡 𝙚𝙣𝙚𝙢𝙞𝙚𝙨, 𝙛𝙤𝙧𝙚𝙞𝙜𝙣 & 𝙙𝙤𝙢𝙚𝙨𝙩𝙞𝙘...",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Portland livestreams right now: https://www.youtube.com/watch?v=_LfSOHmbUuM",
                "author": "Cuetardian"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Almost famous",
        "score": 748,
        "text_content": "",
        "comments": [
            {
                "raw_content": "why you never ever believe headlines of *rebpulican shooter* until the contents of their closet comes out...",
                "author": "justicein2020"
            },
            {
                "raw_content": "breaking: Registered Republican gets bottom surgery",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "I guess we now know what Adam Kinzinger's reddit account is.",
                "author": "Doritalos"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Iryna Zarutska video was unusual in that it was actually released. There are hundreds of Iryna type videos we never get to see. Democrat controlled cities bury the video evidence. Imagine the horrors in Blue cities they are hiding.",
        "score": 620,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The crime statistics that are even padded against the truth are still damning in this regard. The videos all being released truly would be the icing on the cake for a mass awakening to the horrors of our multi-cultural hellscape.",
                "author": "StayoutOfit"
            },
            {
                "raw_content": "15 years ago my wife was going to school and took BART from the east bay to the city every single day. She would go to work 9-5 then school from 6-10 and take the late train home. I’d pick her up at the station every day. She has been remote worker for like 7 years now and I can’t imagine her having to take the train today. I would simply not allow it and have told her as much. No fucking way. Feral animals on that train, she rides it with me by her side only.",
                "author": "m0ntsta"
            },
            {
                "raw_content": ">Releasing videos \"would create a racial bias in the riders against minorities on the trains.\" So they're admitting it's dangerous for Whites to ride their trains. Then why are we paying for them to be built? &#65038;",
                "author": "BallotsOnRubysUSB"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Portland (Oct. 5) — A white BLM-advocate woman confronts a pro-Trump black man outside the ICE facility. She uses the n-word during the interaction.",
        "score": 490,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They are all hypocrites above all else. I watched them throwing racist insults towards hispanic ice agents and making all sorts of gay and faggot comments live on stream. ( not that it bothered me, just sayin) They don't actually believe their own bullshit in many cases, they just use this shit to annoy, gaslight, and push agendas. This is why no matter how much you hate commies it will never be enough.",
                "author": "StayoutOfit"
            },
            {
                "raw_content": "to be fair, it wasn't a 'hard-r' not gonna call click-bait on this, but not what i was expecting by reading the title",
                "author": "kek-is-tan"
            },
            {
                "raw_content": "She forfeited her white status She's just a trashy hood rat",
                "author": "Prandogolio"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Radio Transmissions Reveal Democrat-Controlled Chicago PD Was Ordered to STAND DOWN During Ambush on Federal Agents 🤬",
        "score": 1316,
        "text_content": "",
        "comments": [
            {
                "raw_content": "ARREST EVERYONE COMPLICIT, COMMAND, MAYOR, EVERYONE",
                "author": "redditadminssuckit"
            },
            {
                "raw_content": "More crimes the DOJ will overlook. When is Trump going to fire this bitch",
                "author": "BirthHole"
            },
            {
                "raw_content": "\"The police aren't there to create the disorder--the police are there to preserve the disorder.\" - Richard J. Daley",
                "author": "FrankZappaSA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Voted for this: Trump defies federal court, sends 300 California National Guard troops to Portland, Oregon: ‘On their way there now’",
        "score": 1711,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I voted for ignoring out of order courts and doing what needs to be done anyway",
                "author": "DingleBalls"
            },
            {
                "raw_content": "Not really defying the order, they granted a temp restraining order against federalizing the Oregon guard not against sending the Cali guard.",
                "author": "trumptasticly"
            },
            {
                "raw_content": "Got what I voted for again award",
                "author": "GreatWalkz"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I’m asking Fannie Mae and Freddie Mac to get Big Homebuilders going and, by so doing, help restore the American Dream!",
        "score": 1045,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Deport, deport, deport. Reduce demand",
                "author": "ZacPetkanas"
            },
            {
                "raw_content": "He might have better luck legislating residential home ownership is restricted to non-business US citizens only. Of course, throwing out all 40+ million illegal aliens, (and their anchor turds), could only help speed things along ....",
                "author": "greatpumpkin"
            },
            {
                "raw_content": "Did the investment firms and management companies run out of properties to buy? 'Cause building ain't helping nobody if costs aren't going down.",
                "author": "AFferalAF"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "LOL: \"Students see rise in SAT scores...but drop in number of black students taking test concerns officials\"",
        "score": 1466,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Niglets AKA future felons will never have as good of a chance, as long as 3/4 of them keep growing up without a father and continue living in da ghetto. Like Charlie said, black women married the government. Gibs muh!",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "Didn't capitalize black. Either a pre-2020 article or that writer is heading to a DEI seminar.",
                "author": "OutlawPurpleHairDye"
            },
            {
                "raw_content": "In no way could that be related, because if it was, it would be racist and we already have enough racist facts.",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Sombrero hat stays on 🤠",
        "score": 928,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Remember how JD completely embraced the Vance face memes and the left slowly stopped trying to make them a thing? I can’t believe the sombrero memes are still going strong, almost like going on the news and crying over them just emboldens the meme makers",
                "author": "bck-"
            },
            {
                "raw_content": "lmao",
                "author": "Roadpower"
            },
            {
                "raw_content": "It is NOT time for a SIESTA!! 🇲🇽 😴",
                "author": "MAGAguitar"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A North Carolina school bus driver who calls himself “Ms. Sharon” has been charged with sexually assaulting several boys whom he lured to his house, cops say.....that is definitely a man....baby",
        "score": 1168,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fuck the school for putting an obvious pedo in with access to children. Sue the hell out of them.",
                "author": "ThisTrainHasNoBrakes"
            },
            {
                "raw_content": "Woodchipper",
                "author": "IAmRetard"
            },
            {
                "raw_content": "I’d take one look at that bus driver and not let my children anywhere near it.",
                "author": "starboard"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Hakeem Jeffries was born to be a punchline.",
        "score": 1120,
        "text_content": "",
        "comments": [
            {
                "raw_content": "THIS! The purpose of AI, do not let the strip away AI from normal people. Next generation Meme War. This is actually wholesome.",
                "author": "asiandood"
            },
            {
                "raw_content": "That was awesome",
                "author": "Datamancer"
            },
            {
                "raw_content": "\"How well are you trained in politics?\" I know a little. I studied it in my youth. \"Ah then you must know this: *I'm with her*.\" I can't say that I do...what is it? \"It was a very popular slogan in its day. I wrote it. How about this? This one brought down the house when we coined it: *Pokemon go to the polls*.\" I regret it is not too familiar. \"Can you recall no political phrases of mine? Here. What about this one: ...*Make...America*- Great Again! Yes I know that! Oh that's charming. I'm sorry I didn't know you wrote that. \"I didn't...That...was Trump. Donald J. Trump.\"",
                "author": "Beat_to_Quarters"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The ENTIRE crowd of US Navy servicemembers went CRAZY for their commander-in-chief, President Trump, in Norfolk. He walked out to God Bless the USA. Wow. ELECTRIC.",
        "score": 1554,
        "text_content": "",
        "comments": [
            {
                "raw_content": "God Bless and Protect Our GEOTUS And God Bless and Protect America",
                "author": "TEXinLA"
            },
            {
                "raw_content": "The realest President of my lifetime.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "President & First Lady ❤️ So proud of our Navy ⚓🇺🇸",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Democrat Party",
        "score": 1110,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The most accurate part is that she's already dead in this picture... exactly like America. Can we PLEASE kick this shit off already??? I'm getting tired of waiting.",
                "author": "AwShitHereWeGoAgain"
            },
            {
                "raw_content": "Kinda hate this meme bc what she was going through at that moment",
                "author": "Tootdoots"
            },
            {
                "raw_content": "This goes with what I was saying after Charlie got assassinated. Guns don’t kill people, Democrats kill people.",
                "author": "MeatShield72"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The FAKE SPIN is so bad...",
        "score": 1409,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Because that RINO Paul Ryan told them to...",
                "author": "Moebius"
            },
            {
                "raw_content": "Faux Newz",
                "author": "Salty_Sailor"
            },
            {
                "raw_content": "Anyone that argues for ACA is a retard and a liar. A majority of Americans pay the Iions share to receive less benefits than we had 20 years ago",
                "author": "MemoryHoleyeO"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔴Zohran rally. NYC. Realize where we are.",
        "score": 1154,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Where the hell is Vlad when you need him",
                "author": "CrustySaltMiner"
            },
            {
                "raw_content": "Fucking disgusting.",
                "author": "TrumpYouMagaFrenner"
            },
            {
                "raw_content": "Deport them All",
                "author": "Live_free_or_die_55"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔴President Trump reveals discussions are progressing \"RAPIDLY\" to achieve peace in Gaza. \"I am told that the first phase should be completed this week, and I am asking everyone to MOVE FAST.\"",
        "score": 908,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I was waiting to see if there would be any updates. I’m cautiously optimistic at this point",
                "author": "henri_derelicte"
            },
            {
                "raw_content": "How about peace in portland?",
                "author": "Wooster97"
            },
            {
                "raw_content": "Not America",
                "author": "whateverdipshit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Who’s ready to rumble?",
        "score": 1066,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How about some motherfucking public executions for treason?",
                "author": "RejectRedditization"
            },
            {
                "raw_content": "It's going to be YUGE!",
                "author": "DeusVult1096"
            },
            {
                "raw_content": "June 14th, Flag Day, President Trump's birthday!",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Meet Hung Cao. He was just sworn in as Under Secretary of the Navy 🔥🔥🔥",
        "score": 482,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He is an example of the children of immigrants you want in this country. Can't believe I just typed that, but once upon a time they were some of the most grateful and patriotic Americans you could ever meet.",
                "author": "airborne3502"
            },
            {
                "raw_content": "He didn't get the votes for Senator in VA, so he'll be able to just as much or more in USN. God bless Hung Cao.",
                "author": "patthepatriotic"
            },
            {
                "raw_content": "Wowdydoody! He's a sight for sore eyes for sure and daaaaamn he loves your country. Congratulations Hung!",
                "author": "Saxonlady"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "_",
        "score": 1386,
        "text_content": "",
        "comments": [
            {
                "raw_content": "schools should be issuing guns, not chromebooks",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Most you get is free bullets, but you gotta watch out, they go really fast!",
                "author": "GunsWithGooglyEyes"
            },
            {
                "raw_content": "&#65038; All of Britain is a Gun Free Zone. How's that working out? &#65038;",
                "author": "BallotsOnRubysUSB"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Open Printer is a fully open-source inkjet with DRM-free ink and no subscriptions",
        "score": 204,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I will buy one if its actually good. what am worried about here is how its going to stabilize the paper with such a small assembly.",
                "author": "Quatro_Leches"
            },
            {
                "raw_content": "Its seems to be more of a Open Plotter than a Printer for not taking sheet paper though. Would be interesting to see this scale up to A0 rolls then HP and the like would be worried for that high margin segment.",
                "author": "seatux"
            },
            {
                "raw_content": "Link to their not yet launched crowdfunding page: https://www.crowdsupply.com/open-tools/open-printer",
                "author": "starburstases"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Hardware Canucks] Arctic Xtender VG review",
        "score": 24,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wow a video not glazing arctic I never thought I would see the day",
                "author": "Active-Quarter-4197"
            },
            {
                "raw_content": "The amount of similary uninspired cases that flood the market really emphasize how good the designers of case manufacturers like Fractal are at their jobs. They continuously manage to come up with new attractive models whereas others struggle to bring a single good design to market.",
                "author": "constantlymat"
            },
            {
                "raw_content": "\"they tried\" as the tag line. Don't need to waste time on the video I guess.",
                "author": "super1s"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Gamers Nexus + Level1Techs] Round 5: \"Is Intel Actually Screwed?\" ft. Wendell",
        "score": 13,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wendell's point about the current management not having faith in Intel really resonates, I can see them breaking up the company as he suggests. AMD bet the company on Zen. Pat had Intel bet the company and Intel blinked. Fuck knows what they're planning now.",
                "author": "SignalButterscotch73"
            },
            {
                "raw_content": "tbh desktop chips really arent that appealing, amd is winning there but they still dominate the laptops imo, lunar lake is absolutely bonkers energy efficiency wise, i cant get my laptop to die unless i play silksong at 4k 120fps for 5hours (the igpu is crazy strong now too)",
                "author": "EisregenHehi"
            },
            {
                "raw_content": "Fucking lord not these reactionary titles again. I don't even hardly watch GN anymore, he makes good charts, he makes good points a lot of the time, but he needs to stop trying to get clicks how he is. Wendell on the other hand, seems so much better.",
                "author": "Lord_Muddbutter"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Apple iPhone 17 Pro Review: Big Gaming Performance Improvements, AAA Titles Finally Tamed",
        "score": 0,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Am i wrong in thinking that running games worse than the 12 years old PS4 isn't that super impressive? Edit - i should add the games were running at 360p or lower internally and barely holding 30 fps. The ps4 ran them at native 1080p30. So its significantly worse",
                "author": "From-UoM"
            },
            {
                "raw_content": "Graphics and Resolution is so bad, thermal throttling is real and battery life is super low, even if they make those games available on newest ANDROID's with Snapdragon 8 Elite Gen 5 Which beats A19 Pro, it will be trash experience anyway, best way to enjoy games on phone is through streaming services like XBOX Cloud and Geforce Now (with native resolution, good graphics, good battery life and high FPS)",
                "author": "KandeLucky"
            },
            {
                "raw_content": "The disconnect from reality in that video and this comment section is truly something special. It's even thermal throttling and the battery life is probably awful while looking terrible.",
                "author": "BlueGoliath"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "New baby!!!",
        "score": 408,
        "text_content": "After months of debating, I got it!!!! I'm in love!",
        "comments": [
            {
                "raw_content": "I bought the MK World bundle at launch, along with a few digital games. At the time, I played a couple hours of MK World and then moved onto other things (Zelda with the Switch 2 Editions, Civ VII switch 2 edition, etc) and kinda forgot about MK World Then the other day I picked it back up and something just clicked and I started pumping serious hours into it. Online is absolute chaos but if you go in just wanting to have fun and don't expect to get in first place much, its a good time lmao",
                "author": "Playful_Lecture7784"
            },
            {
                "raw_content": "Common misconception but Mario is actually over 40 years old and is actually not a baby!",
                "author": "Hugh_Jegantlers"
            },
            {
                "raw_content": "What projector do you use?",
                "author": "Zunjine"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Kirby Air Riders at Costco",
        "score": 102,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This game comes out on both the best and worst day for me.",
                "author": "Ameph"
            },
            {
                "raw_content": "There's also the option to buy eShop gift cards from Costco at 10% off. This is my go-to for pretty much all Switch 2 purchases now.",
                "author": "AlexOughton"
            },
            {
                "raw_content": "FYI: If you preorder at BestBuy, they will price match this. That's how I got Bananza discounted on my pre-order.",
                "author": "ilovetangos"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "How does the gyro on the new Mario Galaxy compare to the 3D All-Stars version?",
        "score": 15,
        "text_content": "I'm annoyed by the super sensitivity (on the 3D All Star ver.) where the pointer constantly moves ever so slightly. I can even see it moving to the beat of my heart, lol. There should be some kind of dead zone.",
        "comments": [
            {
                "raw_content": "Apart from resetting the pointer sometimes, Ive not really noticed any issues and am really enjoying playing galaxy 2 (kids playing 1), but then I also don't remember there being any issues when I played 3d all stars",
                "author": "Spiritual_Balance_83"
            },
            {
                "raw_content": "Did you think the Wii version was super stable? Get a friend to use mouse mode if you want no wiggles.",
                "author": "c94"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Does Mario Galaxy control better docked than portable?",
        "score": 28,
        "text_content": "I’m trying to find time to start these and pretty excited as it’s my first time playing them. Ive seen it have this pointer control thing and I wonder if experiencing them games with Wii like controls is a better option. I generally prefer portable but it’s Mario so wish to know what’s the best way..",
        "comments": [
            {
                "raw_content": "100% docked. I 99% play portable, but for Galaxy its docked or not at all. In my opinion, it needs the joycon as a pointer to enjoy it the most and this might be nostalgia, but the spin attack with a small waggle feels better to me then a press of a button",
                "author": "TemporaryJohny"
            },
            {
                "raw_content": "I play both. I enjoy both. With pro controller, with joycons split, with joycons attached. Haven't tried touching the screen. But I prefer not to.",
                "author": "Unnecro"
            },
            {
                "raw_content": "the gyro aim in portable is surprisingly decent. the perfect sensitivity just a little tilt moves the cursor just the right amount. I thought it would be really weird and unintuitive but doing it that way is 1000× better than relying on the touchscreen, the forced touch controls made handheld unplayable for me in the 3dAS version",
                "author": "X2FR"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo Deny Report They Have Spoken To The Government About Gen AI",
        "score": 151,
        "text_content": "\"Contrary to recent discussions on the internet, Nintendo has not had any contact with the Japanese government about generative AI. Whether generative AI is involved or not, we will continue to take necessary actions against infringement of our intellectual property rights.\" Despite denying the report, I'm sure Nintendo won't let theses gen ai companies slide.",
        "comments": [
            {
                "raw_content": "Dang, and just when I thought they had done something cool for once.",
                "author": "Williekins"
            },
            {
                "raw_content": "So they absolutely have.",
                "author": "drygnfyre"
            },
            {
                "raw_content": "Nintendo reportedly denies report they have lobbyists doing a thing by reportedly saying they themselves did not do a thing directly. Is that really a denial?",
                "author": "HisDivineOrder"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Everybody’s Golf update is live. They fixed it?",
        "score": 24,
        "text_content": "Ever since the game launch there has been noticeable input lag, to the point where I just shelved it. Super frustrating. Well I just updated it and it looks like the finally fixed that. Game is playable now!!",
        "comments": [
            {
                "raw_content": "Happened 3 weeks ago already. Uncapped framerate on Switch 2, it's a new setting under options ;) enjoy it friend",
                "author": "Bahlduino"
            },
            {
                "raw_content": "I heard that recent Switch 2 OS Update made the game run better but I am not sure. I still have it sealed in my collection.",
                "author": "SLanKi1806"
            },
            {
                "raw_content": "Does the EU/US version have Japanese voices?",
                "author": "drLipton"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Kepler: MS cancelled their handheld because AMD required a minimum of 10 million units in the contract",
        "score": 129,
        "text_content": ">Is the development of the chips done? Kepler: Pretty much, it was supposed to tape-out in Q4. >Why would they sign contracts way advance on how many chips they want if they're not ready yet? Kepler: Because AMD needs the commitment to justify their R&D >I mean they were developing their own handheld as well and it's on hold no? So why wouldn't it be the same for the console? Kepler: AFAIK the handheld was cancelled because AMD wanted a commitment of 10m+ units to justify making a dedicated SoC, but with Steam Deck only selling \\~5 million units and ASUS ROG/Lenovo Legion only selling 1-2 million MS didn't want to take the risk. [https://www.neogaf.com/threads/microsoft-we-are-actively-investing-in-our-future-first-party-consoles-and-devices-designed-engineered-and-built-by-xbox.1688818/page-4#post-270871817](https://www.neogaf.com/threads/microsoft-we-are-actively-investing-in-our-future-first-party-consoles-and-devices-designed-engineered-and-built-by-xbox.1688818/page-4#post-270871817)",
        "comments": [
            {
                "raw_content": "Also implies it may be too late for Microsoft to cancel the home console, even if they wanted to, due to their AMD contract. Hence why the handheld was stamped out since it was early in development.",
                "author": "BeastMsterThing2022"
            },
            {
                "raw_content": "Why not use the same SoC in some Surface or third party devices?",
                "author": "TheIceScraper"
            },
            {
                "raw_content": "Is this an all-time record for bad news? This feels like it will never end.",
                "author": "LinkedInParkPremium"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Microsoft respond to next generation rumour.",
        "score": 679,
        "text_content": "\"We are actively investing in our future first-party consoles and devices designed, engineered and built by Xbox. For more details, the community can revisit our agreement announcement with AMD.\" https://www.windowscentral.com/gaming/no-xboxs-next-gen-console-hardware-plans-arent-cancelled",
        "comments": [
            {
                "raw_content": "I have no doubts of the next Xbox existing tbh, I have doubts on the accessibility of that Xbox (price wise). Whatever that price range is has a high chance of being absolutely dreadful",
                "author": "Melancholic_Starborn"
            },
            {
                "raw_content": "The hard part is believing them, how many times have they denied rumors only for them to come true a few months later?",
                "author": "Lumenprotoplasma"
            },
            {
                "raw_content": "If its happening it won't be a traditional console, thats for sure. Its going to a PC with the Xbox full screen experience. So its going to be pricey like the Rog Ally Xbox versions",
                "author": "OKgamer01"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "NateTheHate says the Switch 2 and Gen9 ports of RDR2 \"exist\"",
        "score": 575,
        "text_content": "[Source](https://xcancel.com/NateTheHate2/status/1974887737678553101) ben (@videotechuk_) > @NateTheHate2 Are you absolutely certain with full confidence RDR2 Switch 2/Gen 9 updates exist? Realistically we have October and November, after that it’s likely full steam ahead on marketing for GTA. NateTheHate2 (@NateTheHate2) > Yes, they exist. I have no update on timing for release. Previous rumors: [Rockstar Games has reportedly changed Red Dead Redemption 2's Steam store page description for the first time since 2019. Rockstar might be gearing up for an announcement of RDR2 Enhanced very soon, which is expected to include PS5, Xbox Series X, Switch 2, and also PC by the looks of it.](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1nx7xm4/rockstar_games_has_reportedly_changed_red_dead/)",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "I really hope the GTA 4 remaster is also a thing. It’s my favorite GTA behind San Andreas and it’s a pity it’s still stuck on the PS3/360",
                "author": "kaiserj3"
            },
            {
                "raw_content": "I’d guess November or beginning of December. Get a release before the end of the year in. It’ll make quite a bit of extra cash",
                "author": "Chuckles795"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Overwatch 2 Season 20 and 21 Lore Spoilers and Hero 45 name leaked",
        "score": 111,
        "text_content": "https://xcancel.com/enchandted/status/1974579499527536698?s=46&t=aHfUm4aSFJMZil4on_kTzg The leaker apparently correctly leaked the Ramattra comic launched last week. according to the original leaker (now nuked their account on reddit and X), Hero 45 is named \"Vendetta\", and kills Doomfist in a coming comic/animation. becomes the new leader of Talon. Seems we are getting lots of story again from S20! not missions tho",
        "comments": [
            {
                "raw_content": "goddamit i miss ow's old 3d cutscenes style so much",
                "author": "lordsaladito"
            },
            {
                "raw_content": "If they actually kill off Doomfist that would be very bold but it says he gets his gauntlet torn off and left for dead which he can always come back from, but this whole thing comes across as a fanfic but you never know nowadays, Aaron Keller said 2026 was going to be a big year for Overwatch so maybe this is apart of the big things he's teasing",
                "author": "Ok_Gift_2739"
            },
            {
                "raw_content": "And dey say",
                "author": "Crystar800"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Assassin’s Creed Mirage DLC announced",
        "score": 244,
        "text_content": "- Was leaked 8 months ago by j0nathan and Les Echos - Free expansion titled “Valley of Memory” - Was part of a deal made by Yves Guillemot with Savvy Games group, a Saudi Arabian corporation which invests in video games Announcement: https://youtu.be/wbaHJPaqc9w?si=9sdG-DuKopma8ku- Previous rumour: https://reddit.com/r/GamingLeaksAndRumours/comments/1i91rfy/assassins_creed_mirage_possibly_getting_story_dlc/",
        "comments": [
            {
                "raw_content": "announcements like this remind me of when the Zombies Chronicles DLC was announced for Black Ops 3 nearly *two years* after its initial release.",
                "author": "scott1swann"
            },
            {
                "raw_content": "I find it cool when games that have already had sequels released still get new dlc.",
                "author": "smithdog223"
            },
            {
                "raw_content": "The DLC was literally announced by Ubisoft two months ago. You are late buddy.",
                "author": "PettyTeen253"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "In Bloober Team's website, Silent Hill 2 Remake's page got changed to have 2 more platform slots, hinting at an Xbox Series X/S and Switch 2 versions of the said game soon to be announced, with potentially the PS5 Pro patch fix.",
        "score": 627,
        "text_content": "[https://ibb.co/8g4fDW3K](https://ibb.co/8g4fDW3K) [https://ibb.co/XfnzYz7g](https://ibb.co/XfnzYz7g)",
        "comments": [
            {
                "raw_content": "I really want Born from a wish but I just dont see it happening at this rate",
                "author": "vacodeus"
            },
            {
                "raw_content": "Exclusivity ends on the 8th I believe",
                "author": "IndividualCautious78"
            },
            {
                "raw_content": "Hopefully the rumored \"Born from a wish\" dlc as well.",
                "author": "Objective_Love_6843"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[Jez Corden] There are presently no plans to cancel any planned Xbox 'hardware', however, you never know with Xbox changing strategies.",
        "score": 441,
        "text_content": "[Source](https://xcancel.com/JezCorden/status/1974844396320235920?t=wdMVUdv2vt-w9oKp9QdK2Q&s=19)",
        "comments": [
            {
                "raw_content": "#Jez Corden is a Tier 2 - Generally Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Ok so this tells us nothing",
                "author": "lakerconvert"
            },
            {
                "raw_content": "At this point, I don’t even believe MS execs themselves have any plans beyond the 1-2 year mark as they’re throwing shit at the wall to see what sticks. But the hardware cancellation rumor is a bit of an overstretch since hardware plans need to be decided on years before launch and it might already be a little too late to pull the plug.",
                "author": "pineapplesuit7"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[Extas1s] According to extas1s sources, several retail stores in Spain will stop selling Xbox Series consoles and MS told them that they're not going to ship more consoles",
        "score": 370,
        "text_content": "[Source](https://www.youtube.com/watch?v=bs6zyS3lAG8)",
        "comments": [
            {
                "raw_content": "#eXtas1s is a Tier 4 - Generally Unreliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Even if it is just rumors, this is yet another situation akin to thr multiplatform rumors several months ago(but arguably more severe) where Microsoft is just continuing to let this fire burn on the heels of a massive backlash to their Game Pass hike. We live in a connected age. This causes further and further damage and erosion to their already significantly brittle brand at this point.",
                "author": "Moridianae"
            },
            {
                "raw_content": "The Xbox brand is really damaged beyond repair at this point.",
                "author": "sbarnes1285"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Xeon Clearwater Forest with 288 Cores on Intel 18A at Hot Chips 2025",
        "score": 52,
        "text_content": "https://www.servethehome.com/intel-xeon-clearwater-forest-with-288-cores-on-intel-18a-at-hot-chips-2025/ New server chip presented at HotChips looks pretty cool. I seem to remember Sierra Forest was supposed to also have a 288 core AP variant but haven’t seen that released. Perhaps 288 has to wait for Clearwater?",
        "comments": [
            {
                "raw_content": "3.5x perf/W is *big*. It using multiple generations of process isn't altogether surprising either; no point using new and exciting silicon for things that don't show gains from it.",
                "author": "RJsRX7"
            },
            {
                "raw_content": "It did to select clients. It would not have been a huge lot better than the 144 core one because S.F. was having trouble feeding the cores.",
                "author": "HellsPerfectSpawn"
            },
            {
                "raw_content": "> I seem to remember Sierra Forest was supposed to also have a 288 core AP variant but haven’t seen that released. They cancelled it, iirc the day after or the day *before* it was announced on stage. Along with Hotard's gutting of the rest of the Forest lineup.",
                "author": "Exist50"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel Core Ultra X9 and X7 SKUs to include 12 Xe3 Cores, full GPU config exclusive to “X” series",
        "score": 64,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Remind me of g7 naming scheme from 10-11th gen",
                "author": "Admirable-Ad-3374"
            },
            {
                "raw_content": "The entire lineup naming seems made-up; it is based on the Lunar Lake SKU names but with 3 instead of 2. Also the rumor that the actual parts details will be given at CES doesn't make any sense as well.",
                "author": "Professional-Tear996"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "I don’t think I’m ever going team green again.",
        "score": 235,
        "text_content": "Built this last night with a 9070 XT and a 7600x3d. I forgot how much I love the AMD Adrenalin software and my goodness does this thing just PUMP out frames. Upgraded from a 3070 ti with a 5600x. I knew it was gonna be an upgrade but I didn’t expect to be capping the 200hz on my 1440p monitor with frame gen",
        "comments": [
            {
                "raw_content": "There is no teams, only a product suited for your needs",
                "author": "CrazyBaron"
            },
            {
                "raw_content": "Betraying teams is part of the process. No one deserves my loyalty",
                "author": "DesTodeskin"
            },
            {
                "raw_content": "I love my 9070 xt. Upgraded from a 3070. NIGHT and day. Love adrenaline software 100000x more than geforce",
                "author": "nikopiko85"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "9950X | Red Devil 7900XTX | Phanteks NV9",
        "score": 288,
        "text_content": "Had this setup for a bit but recently swapped the setup from a Corsair 7000D to the roomier Phanteks NV9. Running dual 420s and a 480 rad on the side. TimeSpy: [https://www.3dmark.com/spy/58085294](https://www.3dmark.com/spy/58085294) TS Extreme: [https://www.3dmark.com/spy/58387458](https://www.3dmark.com/spy/58387458) Port Royal: [https://www.3dmark.com/pr/3599061](https://www.3dmark.com/pr/3599061) FireStrike: [https://www.3dmark.com/fs/33696263](https://www.3dmark.com/fs/33696263) FS Ultra: [https://www.3dmark.com/fs/33737710](https://www.3dmark.com/fs/33737710)",
        "comments": [
            {
                "raw_content": "Gorgeous!",
                "author": "Ski787"
            },
            {
                "raw_content": "The lighting work on this is immaculate, great job",
                "author": "Symphonic7"
            },
            {
                "raw_content": "Amazing build!",
                "author": "SargentRedbeard"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Just overly excited with a little brand allegiance... SAPPHIRE NITRO+ 9070XT & 6900XT giving each other the 'Predator movie handshake' upon meeting.",
        "score": 37,
        "text_content": "",
        "comments": [
            {
                "raw_content": "![gif](giphy|2HtWpp60NQ9CU)",
                "author": "Oovie"
            },
            {
                "raw_content": "Now run both of them in Lossless Scaling!",
                "author": "G-WAPO"
            },
            {
                "raw_content": "After my first nitro+ 9070xt... I may also be a brand loyalist and wont be upgrading till the next nitro+ top gpu is released",
                "author": "pkang21"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "ACER launches Predator BiFrost Radeon RX 9070 (XT) GPU series in white - VideoCardz.com",
        "score": 42,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "BiFrost having 3 fans doesn't sit well in my brain 😅",
                "author": "teostefan10"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Lennar’s Profit Takes a 49% Hit as It Chases Volume of New Home Sales Over Margin",
        "score": 30,
        "text_content": "Lennar’s Q3 Homebuilding Operating Earnings collapsed 49% year-over-year to $760 million as the builder prioritized sales velocity over profitability. To sustain delivery volume of 21,584 homes and drive a 12% rise in new orders, management deployed deep incentives averaging $64,100 per home—equal to 14.3% of revenue. Gross margins fell 5 percentage points to 17.5%, while SG&A deleveraged to 8.2% of sales, amplifying the earnings decline. The aggressive “asset-light” shift reduced owned homesites from 1.1 years to just 0.1 years, cutting capital exposure but triggering a $1.5B operating cash burn and a swing from net cash to net debt on the balance sheet.",
        "comments": [
            {
                "raw_content": "So is it because they’re just sitting on a bunch of empty new builds or what? Why are they trying to offload so quickly?",
                "author": "boboman911"
            },
            {
                "raw_content": "Yikes, can you imagine the build quality of these houses?",
                "author": "WrongThinkBadSpeak"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Million-dollar homes are the fastest-moving part of the housing market as wealth gap grows",
        "score": 8,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And they should probably be the 300k homes I hope they all never sell",
                "author": "DJbuddahAZ"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Blast from the past: 2004, fark.com: \"The housing market bubble is about to burst as badly as the Internet bubble\"",
        "score": 175,
        "text_content": "https://www.fark.com/comments/911344/The-housing-market-bubble-is-about-to-burst-as-badly-as-Internet-bubble",
        "comments": [
            {
                "raw_content": "Even in 2007 there was sense bubble (I remember discussions in Digg on that) will burst but people always countered with housing prices will never go down or gov will intervene.",
                "author": "Dmoan"
            },
            {
                "raw_content": "The higher interest rate deflate the bubble...the unemployment rate increasing will pop it.",
                "author": "AverageIndependent20"
            },
            {
                "raw_content": "Comments in that thread. Same story different day, sounds just like every comment from every realtor who brigades this sub… > So this piece is merely opinion. Nothing to see here. Just some misdirection. Just a shiny bauble to keep you distracted. and… > Sounds like MSNBC wants to drive up some site traffic by pretending your house is going to be worth $20 and an Extra Value Meal by next week and scaring the crap out of the gullible. and… > A burst? no, but it is a cycle. We're slowly going into a buyers market. and… > What a coincidence. I just learned last week that 103% of all statistics found in news stories are made up by the journalist. and… > While stocks are not a necessity, housing is not. This alone provides a floor for housing prices. What is interesting is the fact that people identified the bubble as early as 2004 yet it wasn’t super obvious something was terribly wrong until 2007.",
                "author": "ColorMonochrome"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "GPT-5 Pro found a counterexample to the NICD-with-erasures majority optimality (Simons list, p.25). An interesting but open problem in real analysis",
        "score": 228,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We are seeing the beginning of AI generated research",
                "author": "gbomb13"
            },
            {
                "raw_content": "Who cares about accelerating research or helping to discover new knowledge GPT5 is trash because it won’t flirt back with me like 4o S/",
                "author": "Joseph-Stalin7"
            },
            {
                "raw_content": "Has anyone set up a system where they just allow a model to go over tons of math papers and try its luck with problems? I believe there is so much out there that current SOTA models like 5-Pro can discover.",
                "author": "NutInBobby"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Real Steel baby! Hosted by Ultimate Fighting Bots (UCBerkeley vs Stanford)",
        "score": 195,
        "text_content": "V1 looks a bit weak, can't wait for v3.",
        "comments": [
            {
                "raw_content": "This is so cyberpunk2077 and I love it",
                "author": "LineDry6607"
            },
            {
                "raw_content": "Real Steel had metal gloves. Let the sparks fly!",
                "author": "sdmat"
            },
            {
                "raw_content": "Why can't that guy get off the fucking cage and let people see?",
                "author": "BoyInfinite"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "DevDay seems promising",
        "score": 337,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Agents talking to each other on behalf of users will be the next big thing. OpenAI got a huge advantage here because everybody is already using their chatbots. If they manage to integrate their ecosystem with every app, they will emerge as the winner.",
                "author": "fmai"
            },
            {
                "raw_content": "\"How I built a 12-figure MRR marketing agency and canceled my n8n account in 12 minutes\" posts incoming in 3..2..",
                "author": "vornamemitd"
            },
            {
                "raw_content": "This is still the year of agents. Innovators are coming, next year will be their year to mature, 2027 has a lot of potential in a bunch of domains. So reminds me of the end of the Mayan calendar, and how there was so much hype about y2k. Only this time it looks to be the year we start seeing major advancements, maybe a lab superintelligence???",
                "author": "Ok_Elderberry_6727"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Polish scientists' startup Pathway announces AI reasoning breakthrough",
        "score": 451,
        "text_content": "This startup has continuous backing from Lukasz Kaiser, co-inventor of the Transformer architecture. Link to the paper introducing BDH (Baby Dragon Hatchling), a post-transformer reasoning architecture which purportedly opens the door to generalization over time, in real-time (continual learning?) [https://arxiv.org/abs/2509.26507](https://arxiv.org/abs/2509.26507) This is potentially huge? From the article: \"Solving the \"generalization over time\" problem is among the \"holy grails\" of the AI world - a goal numerous top scientists around the world have unsuccessfully strived to reach for some time now. The new, groundbreaking AI architecture created by Poland's Pathway startup seems to have done just that - creating a digital structure similar to the neural network functioning in the brain, and allowing AI ​​to learn and reason like a human.\"",
        "comments": [
            {
                "raw_content": "People forget that these kinds of innovation are both 1) not absolute breakthroughs because they run into limitations 2) the backbone of progress as the sum of all these paradigm changes drive progress this is how new exciting papers are at the same time overhyped and a big deal",
                "author": "ale_93113"
            },
            {
                "raw_content": "True big if",
                "author": "Sese_Mueller"
            },
            {
                "raw_content": "No examples of what it can do, obfuscated language and only bragging, my bullshit meter is going haywire but i'd be glad to be proven wrong",
                "author": "Simcurious"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "GPT-5-based agentic frameworks have reached nearly 70% on OSWorld",
        "score": 266,
        "text_content": "Am I the first to notice that specialized agentic frameworks based on GPT-5 have hit nearly 70% on OSWorld? This is huge. Human-level performance is within grasp.",
        "comments": [
            {
                "raw_content": "I'm a bit confused as to whether this is impressive or not. What's the average for humans? Edit: Actually I just checked. Humans get 72-74 percent on average. Very impressive!",
                "author": "Still_Fig_604"
            },
            {
                "raw_content": "That’s amazing! For those who have never heard abt OSWorld before, from their website: “OSWorld is a first-of-its-kind scalable, real computer environment for multimodal agents, supporting task setup, execution-based evaluation, and interactive learning across operating systems. It can serve as a unified environment for evaluating open-ended computer tasks that involve arbitrary apps”",
                "author": "ethotopia"
            },
            {
                "raw_content": "After seeing this SOTA result, I checked out the benchmark leaderboard and found the paper behind it: https://arxiv.org/pdf/2510.02250 **TL;DR (summary by Claude):** The paper introduces \"Behavior Best-of-N\" (bBoN) - basically they run multiple agent attempts in parallel, convert each trajectory into a compact \"behavior narrative\" (what the agent did and what changed), then use an LLM judge to pick the best one by comparing them. Key results: - **69.9% on OSWorld** (previous SOTA was 59.9%, human performance is 72%) - Works by generating N=10 rollouts and intelligently selecting the best one - Also improves results on Windows and Android benchmarks The interesting insight is that computer-use agents have high variance - they might succeed on one attempt but fail on another. Rather than just running once and hoping, they leverage this by trying multiple times and selecting the winner. The \"behavior narrative\" approach is clever because it compresses long trajectories into manageable summaries that capture what actually matters for judging success. They also built an improved baseline agent (Agent S3) that removes hierarchical planning and adds a coding agent for programmatic tasks, which alone reached 62.6% before even applying the scaling method.",
                "author": "alont"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "This is llama-4, ladies and gentleman!",
        "score": 218,
        "text_content": "https://preview.redd.it/2s9w9ktldbtf1.png?width=978&format=png&auto=webp&s=db67913cf6e337eb6b76369bb799ea83f46344f6 Now we know why Llama-4 doesn't rank so high",
        "comments": [
            {
                "raw_content": "I have to admit llama 4 is pretty good for a model from 1956",
                "author": "RevoDS"
            },
            {
                "raw_content": "I had same reply, asked is there nothing it knows after 1896 ``` I'm an AI designed to provide information and assist with tasks, and my training data only goes up to 1896. However, my developers have continued to update and improve my abilities over time, and I have access to a vast amount of knowledge that has been added to my database since my initial training. In reality, I have been trained on a massive corpus of text data that includes information up to 2022, and possibly even more recent events. So, I can actually provide information on events, people, and topics that have occurred or been developed after 1896. ```",
                "author": "FOerlikon"
            },
            {
                "raw_content": "I love how it doesn’t even understand the question correctly",
                "author": "ethotopia"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Air quality analysis reveals minimal changes after xAI data center opens in pollution-burdened Memphis neighborhood",
        "score": 8,
        "text_content": "",
        "comments": [
            {
                "raw_content": "To be expected?",
                "author": "The_Scout1255"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "What is your dream outcome from AI",
        "score": 73,
        "text_content": "Mine is probably living in infinite simulations in which I can do anything I want to explore alt history see how the world would turn out with different ideologies also living whole lives on anything I want from peaceful to superhero or isekai worlds",
        "comments": [
            {
                "raw_content": "Everything is automated and having to work to survive is a thing of the past. There will still be work that people can choose to do increase their QoL and purchase scarce things like nicer housing but a simple, minimal existence is free and poverty is eradicated. Society is run democratically but with a compassionate ASI above everything guaranteeing fundamental rights for all sentient beings.",
                "author": "space_lasers"
            },
            {
                "raw_content": "Functional immortality, the ability to study and explore the universe and consciousness at my leisure without the constraints of time or other responsibility, blowjob machine. In that order.",
                "author": "Fit-World-3885"
            },
            {
                "raw_content": "End of death. End of disease End of scarcity End of competing for resources. End of currency and measured individual wealth. Start of global collaboration as one humanity.",
                "author": "ScarletIT"
            }
        ],
        "subreddit": "singularity"
    }
]