[
    {
        "post_name": "🚨 BREAKING: President Trump SUPPORTS House Republicans voting to release the Epstein Files - \"because we have nothing to hide, and it’s time to move on from this Democrat Hoax perpetrated by Radical Left Lunatics in order to deflect from the Great Success of the Republican Party.\"",
        "score": 962,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Expose them and lets get thus shit rolling",
                "author": "highenergywinning"
            },
            {
                "raw_content": "I don't feel the economy is winning big, its improved ever so slightly, the real cost of groceries and energy are still way high, too high to brag about. If the Epstein files are a hoax, then the whole issue should be ignored, but here we are again discussing shit that should have been done and over back in February..........................................................release..don't release....... A fucking shit show that Republicans should have figured out. And the American people are not buying any of the gaslighting. Shit sucks in America and we want hard core things done to fix it.",
                "author": "MemphisMontoya71"
            },
            {
                "raw_content": "Very rarely do I believe in the 4D chess stuff but it's funny how it feels like Trump played 4D chess with this and it could inflict harm onto the dems.",
                "author": "punishedvin"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Charlie Kirk knew.",
        "score": 151,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Absolutely nothing he said is wrong. Nothing. What he said does not constitute racism or hate speech. It is simply the truth. A large part of Islamic beliefs are based on deception and not truth or trust. And that is not compatible with Christian societies.",
                "author": "Boomstikchik"
            },
            {
                "raw_content": "Christians are the only ones for whom lying is not acceptable for advancing their agenda.",
                "author": "Taqiyya_Mockingbird"
            },
            {
                "raw_content": "Islam is to religion that rape is to sex.",
                "author": "DemPanicAtTheDisco"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "White births have seen the most significant rise in fertility in the US, accounting for nearly all of the country’s birth increases from January to August.",
        "score": 144,
        "text_content": "",
        "comments": [
            {
                "raw_content": "People are more comfortable having children when there is a solid administration in the White House.",
                "author": "Boomstikchik"
            },
            {
                "raw_content": "Still way below replacement levels",
                "author": "Votingnerd"
            },
            {
                "raw_content": "I hope they dont use the same criteria for White as law enforcement does. I've seen way too many mugshots of people who were categorized as White with names like Miguel Suarez-Valenzuala-Garcia. Other than that this is great news.",
                "author": "Hangemh1gh"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ah yes, the familiar scene: a white woman watching loud videos in public and a foreign man just wanting some peace and quiet 🙉",
        "score": 959,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I hate jews so goddamned much",
                "author": "ramennov"
            },
            {
                "raw_content": "Literally every time I hiked local trails in California, it was blacks or mexicans walking around blasting their music on a boombox for all to hear. Every damn time. No White person, man or woman, did this.",
                "author": "vote_for_MAGA_2020"
            },
            {
                "raw_content": "The liberal mind is fascinating. They consciously identify the truth and then purposefully invert it for no apparent reason other than to avoid making an obvious accusation. I wonder how evolution made us capable of this? I assume this is some woman brained thing.",
                "author": "Viewer01"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Oh look, Charlotte has its own selection of dipshts wanting to scream at DHS. It’s so pathetic that you can’t help but to laugh at them 🤣",
        "score": 859,
        "text_content": "",
        "comments": [
            {
                "raw_content": "98%: Females...ages ~17-30. College indoctrination. 2%: Femboys, trying to lose virginity.",
                "author": "Th3Cho0sing0ne"
            },
            {
                "raw_content": "Faggots.",
                "author": "Maxmax"
            },
            {
                "raw_content": "crowd-for-hire?",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Leftists waving FOREIGN FLAGS are just flat-out BLOCKING the road outside DHS facility in Charlotte NC",
        "score": 852,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Run. Them. Over. They'll stop doing it, I promise.",
                "author": "LandscaperJuan"
            },
            {
                "raw_content": "I’ll take the moderate approach here. Deport them to those countries. They’ll be happier. I’m sure.",
                "author": "Filo76"
            },
            {
                "raw_content": "I honestly think there is no coming back from this unless we see mass incarceration. Blocking a literal roadway is a crime yet the police just stand there. The left has gotten way too comfortable.",
                "author": "BasedMillennial"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Chilean Republicans now have a near 100% chance of defeating the leftist communists and flipping the country after tonight's election results, per Polymarket.",
        "score": 953,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Family from Chile, I came here when I was 5 in 81. Dad came right after Allende was toppled (yes, legally). Screw the commies, Once Pinochet left, all the communist came back to finish the job. Unless new Chilean President goes the way of Milei in Argentina, nothing will change. Of course the left will deploy the protestors, thousands and thousands of college kids and leftist to try and destroy it all. Rinse repeat world wide. Chilean constitution was changed not too long ago to favor socialism, so this will be an uphill battle to MCGA, like it used to be before foreign invaders from Haiti, Bolivia, Peru, Venezuela, came illegally too.",
                "author": "FuckU/Spez"
            },
            {
                "raw_content": "Great, when will California start?",
                "author": "MythArcana"
            },
            {
                "raw_content": "Well if like in America \"defeating communists\" means you keep the communist welfare state, keep the communist central bank, keep the communist progressive income tax and keep the communist regulatory state, what difference does it really make? Woopty doo, now \"conservatives\" get to control the communist uber-state for a while! 🥳",
                "author": "dr_gonzo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔴NEW: X to roll out new country location feature within 72 hours that includes a VPN detection system which will warn users if an account is using a VPN to mask/hide their true location. Pakistanis posting \"MAGA is dead\" are on suicide watch. Grifters with 6 gorillion followers will be exposed.",
        "score": 1477,
        "text_content": "",
        "comments": [
            {
                "raw_content": "China bot farms on suicide watch",
                "author": "America_No_1"
            },
            {
                "raw_content": "You can easily use a smaller VPN service, host your own, or pay an extra $3 a month for a dedicated IP from any VPN service and you'll go undetected. It will of course show things for the 99% of people who don't know that.... But what would REALLY be cool is if they showed the IP history BEFORE they implented this feature... Like \"98% of logins to this account from Pakistan\" People can't cover the tracks they already made.",
                "author": "IPMang"
            },
            {
                "raw_content": "***Jesus, I’ve seen what you’ve done for X, and I want that for PDW.***",
                "author": "Repentnow"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "It was just revealed that Chuck Schumer behind close doors begged to keep the government shut down to THANKSGIVING, per CNN He called Democrat governors and \"influential party leaders\" to give him \"backup for his strategy.\" 🤯",
        "score": 1111,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We should keep it shutdown for many years to come, really.",
                "author": "MAGA_Centurion"
            },
            {
                "raw_content": "what was his strategy?",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "A disgusting, evil, vindictive, vile and soulless J....",
                "author": "South_Florida_Guy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "All we want is the same wall as the Vatican to keep illegal aliens out.",
        "score": 1235,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I like DC_Draino comment Heaven has gates. The Vatican has gates Why can’t America have gates?",
                "author": "DT170x"
            },
            {
                "raw_content": "It's nice to finally have an English speaking pope so none of the retarded shit he says is lost in translation.",
                "author": "I_Am_John_Galt"
            },
            {
                "raw_content": "send ALL invaders to the Vatican, and let the faithful that support this take care of them in the catholic church, but not in MY back yard. I would like to see how fast the donations drop off if the Catholics found out ALL of their donations went to that alone",
                "author": "mikethemarine"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Danish meme about Germany: \"You know it's Christmas in Germany, when the quran blockers are put in place\"",
        "score": 827,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The candy cane stripes are so festive",
                "author": "LilaQuartermaine"
            },
            {
                "raw_content": "Coming to NY.",
                "author": "Counterwhat"
            },
            {
                "raw_content": "Allahu ackbollards...",
                "author": "MagaBob847"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "48 mosques have opened in Texas… just in the last 24 months.",
        "score": 1159,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’m so glad we fought them over there so we could import them and let them take over here.",
                "author": "ninabobby"
            },
            {
                "raw_content": "Remove kebab.",
                "author": "DeusVult1096"
            },
            {
                "raw_content": "What can be done about this? I'm a single-issue voter at this point. Any politician who materially opposes Islam, and works to expel Muslims from my country, gets my support. I will not vote for anyone who dances around the problem, or starts qualifying \"good\" and \"bad\" Muslims.",
                "author": "Saltish"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This is the suspect behind the Magdeburg Christmas market attack. He's finally gone on trial in Germany for killing six and injuring 300+. He's accused of driving a rented BMW through the crowds at 40mph on 20 December, 2024. Shockingly, he's a muslim. 🇩🇪",
        "score": 1074,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Remove kebab.",
                "author": "DeusVult1096"
            },
            {
                "raw_content": "Once upon a time, Germany wasn't a bunch of cucked pussies",
                "author": "South_Florida_Guy"
            },
            {
                "raw_content": "Death penalty or this doesn't end.",
                "author": "CleanUpPhillyTrump24"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump on Tucker Carlson’s interview with Nick Fuentes “ ultimately people have to decide.”",
        "score": 730,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We've already decided. America First is the future.",
                "author": "Dead_Biden_Voter"
            },
            {
                "raw_content": "\"I'm not controversial so I like it that way\" Best troll president",
                "author": "LolOkFBI"
            },
            {
                "raw_content": "I wouldn't care if Tucker Carlson interviewed David Duke or took a time machine and interviewed literal Hitler You're just not going to move me and 'antisemite' smear browbeat me into thinking Tucker Carlson is a bad guy. He's a GREAT guy. I wish he were my friend. He'd probably chastize me into upping my game as a man and human. But I still wouldn't chomp on his Alps. Took me 15 yrs to kick cigarettes",
                "author": "5DchessWatch"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Gov. DeSantis on why the real issue is legal immigration: \"Is it good for us to bring 10M Somalians, dump ‘em in Georgia?!?\"",
        "score": 1263,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Check out what is happening in Minnesota because of our moderate Muslim Somalian overlords. Take the time and check these links. I guarantee you didn't know how bad my state has it. Muslims rape our kids and then say it's racist that we notice. It's just their culture. https://patriots.win/p/19BtLHfSxG/an-islamic-center-in-minnesota-r/c A lot of them are entitled animals. They literally expect us to cater to their every whim. All they want to do is breed and consume. https://patriots.win/p/17sPFoWqet/feel-the-entitlement-oozing-out-/c Oh, don't forget the crime they bring with them from one of the most corrupt countries in the world. 30% of all Somalians commit blatant welfare fraud https://patriots.win/p/1AR0nd7AA4/30-of-all-somali-mothers-in-minn/c Because of them, my state is broke. https://patriots.win/p/1AR0UrJFEW/minnesota-is-drowning-in-fraud-i/c Importing the third world, makes you the third world. Change my mind.",
                "author": "MissingTrump"
            },
            {
                "raw_content": "He's eyeing the 2028 run against JD Vance, nothing more",
                "author": "MasterChief"
            },
            {
                "raw_content": "I've noticed DeSantis has jumped full speed ahead with his hardline stance on immigration after the H-1B gaffe. He is definitely positioning himself for 2028",
                "author": "realPhantomFuck"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I hope Starbucks shuts down every last location in NYC.",
        "score": 756,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The guy who never ran a business telling them how to run a business",
                "author": "aqua27"
            },
            {
                "raw_content": "Starbucks coffee server is not a career. It's a side job for extra money.",
                "author": "1776Widowmaker"
            },
            {
                "raw_content": "Standing with workers, hoping their employer closes??",
                "author": "hughjasske69"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "PBS Claims Military Officers Are Lawyering Up Over Trump's Orders but What's Really Happening?",
        "score": 581,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The military officer corp was purged of Conservatives during 8 years of Obama. The enlisted ranks were purged of Conservatives during the Covid vaxx mandates during Biden's 4 years. So now, the majority of military are left-leaning liberals who disagree with the policies of President Trump and Secretary of War, Hegseth. It will take a generation to fix what the Socialist Democrats have done to our military. These liberal \" resisters\" will hang on long enough to get their pension. In the meantime, they will drag their feet and oppose any reform.",
                "author": "BenDoverAssho"
            },
            {
                "raw_content": "Why hasn't General White Rage been court marshalled for secretly talking to China yet?",
                "author": "raptormissle"
            },
            {
                "raw_content": "The US military is infested with leftie commie faggots. It's been bad since the reign of Bathhouse Barry.",
                "author": "Ricky_CIA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump says he may be \"having some discussions with Maduro and we'll see how that turns out, but they would like to talk.\"",
        "score": 620,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"Look out your window\".",
                "author": "MrMcGreenGenes"
            },
            {
                "raw_content": "Will Maduro be coming on a H-1B visa to run Google?",
                "author": "MythArcana"
            },
            {
                "raw_content": "No this can't be! Historically war hungry Trump promises he'd go to war with Venezuela! Patriots.win told me!",
                "author": "Sidewinder24"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "𝚃𝚑𝚎 𝙻𝚒𝚋𝚎𝚛𝚊𝚕 𝚆𝚘𝚖𝚊𝚗",
        "score": 705,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sadly, I have a sister like this. The final straw was when she was offended that I Venmo’d her some money for some funeral flowers she purchased for a family member and had included my name. That was the moment I knew that there was no hope for her. She was literally offended that I gave her money.",
                "author": "TNgirl4Trump"
            },
            {
                "raw_content": "Ban fat people",
                "author": "FaustyArchaeus"
            },
            {
                "raw_content": "We have too many corrupt NGO's with liberal women just like this. Every cause and protest that comes up...they are the same BLM protest rioters as Pussy Marches. 10 years of it.",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "It’s deliberate",
        "score": 1405,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He's on to something - leave your powder dry for the opposition - the Democrats and Antifa ... not people in our tent, even those with one foot outside.",
                "author": "nzsvz9"
            },
            {
                "raw_content": "Us complaining about Argentina, H1B, Chinese student visas, slow deportations… that’s not an “attack” on anyone. They’re legitimate shortcomings of this administration and we are right to be angry.",
                "author": "MisterMAGA"
            },
            {
                "raw_content": "All I've seen my ENTIRE life is the donor class of the political right manipulate politicans AFTER they promised things to the voting block so please forgive me if I'm a little sensative to the whole \"just give them two more weeks and they will start supporting you, Mr. Voter\". The donor class gets what they want all the time and the rest of us are told to shut up and be appreciative. I'm done with that. If the donor class supports taking away American's freedoms then fuck the donor class/",
                "author": "NukeTheNarrative"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "[Gamers Nexus] - RAM: WTF?",
        "score": 165,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This always happens whenever I contemplate building a new rig.",
                "author": "wolv2077"
            },
            {
                "raw_content": "I bought a 256GB 4x64GB kit for $809 last month. Now it’s $1,900",
                "author": "GestureArtist"
            },
            {
                "raw_content": "I paid $170 for 64GB (2x32gb) back in 2023 when I built this computer. Now the cheapest I can find is $300. I was planning on transitioning this to a home server and building a new AM5/DDR5 system, but I'll probably just cobble together an AM4 system using some old RAM I have lying around.",
                "author": "you_have_huge_guts"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Chancellor Merz: \"Will not allow components from China in 6G network\"",
        "score": 204,
        "text_content": "Merz also plans to bring this up on the topic at the [European Summit for Digital Sovereignty](https://bmds.bund.de/aktuelles/pressemitteilungen/detail/europaeischer-gipfel-zur-digitalen-souveraenitaet-2025) : >At the summit, the industry should discuss what can be done not only to become more independent from China, but also from the USA and the major technology companies, Merz is further quoted as saying. However, Merz ruled out a complete decoupling from China. The country is Germany's second-largest trading partner. While China cannot decouple from Germany either, Germany can still do less with China.",
        "comments": [
            {
                "raw_content": "Good luck, Ericsson's hardware is hella expensive, and Nokia's is just bad.",
                "author": "Any-Ingenuity2770"
            },
            {
                "raw_content": "Wild to think 6G is still five year away.",
                "author": "mycall"
            },
            {
                "raw_content": "why would you want 6g when 5g still hasn't saturated to do 5g correctly requires a lot of towers pulling a lot of power and majority of the world still hasn't built this yet, 6g would be even worse Im right now the centre of a city with millions of people and my phone can't even hold a stable 5g connection and the speed of the connection fluctuates wildly",
                "author": "Loose_Skill6641"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel Cancels its Mainstream Next-Gen Xeon Server Processors",
        "score": 148,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It seems a variant was cancelled, not the entire product.",
                "author": "nyrangerfan1"
            },
            {
                "raw_content": "Well that's concerning. The 8ch, not the 12+ch, is the backbone of their enterprise and mainstream lineup. It's mostly just hyperscalers who want the big 12+ channel products. Go look at Dell/HP/Lenovo's websites and see what they offer. It's largely the 8ch stuff, *including* for AI servers. With the -AP platform moving to 16ch, that widens the gap even more. And this comes at a time where AMD is expanding their focus across the market. The main problem is that the 12+ channel platforms are simply too big and expensive for a lot of markets. This is also what's killed HEDT and is killing the workstation market. The platform cost jump past 6/8ch is more than what the market's willing to spend.",
                "author": "Exist50"
            },
            {
                "raw_content": "I understand wanting to draw clicks, but that's a seriously clickbait headline from STH. Just put 8CH in the damn title",
                "author": "Kougar"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[News] Memory Shortage Reportedly Triggers Order Caution from Smartphone Clients, Pressuring SMIC",
        "score": 23,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">Co-CEO Haijun Zhao, cited by the report, further explained the trend: memory chip shortages are creating a supply chain bottleneck—even when other components are available, smartphone makers cannot complete assembly without sufficient memory. Meanwhile, with handset prices holding steady, negotiations are underway on whether other chip prices can drop in 2026 to offset surging memory costs, according to Zhao.",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "Interesting SMIC has lower % for smartphones. Globally, smartphones are dominant #1, consuming 35% of all bits. IIRC, smartphones dethroned PCs for global DRAM consumption over a decade ago. I assume data centers have now outpaced smartphones. https://www.industryresearch.biz/market-reports/nand-flash-memory-and-dram-market-104109#:~:text=The%20NAND%20Flash%20Memory%20and%20DRAM%20Market%20Segmentation%20divides%20into,BY%20TYPE // > Supply constraints are worsening. Commercial Times reported in late October that DRAM and NAND lead times have ballooned, with LPDDR5X now taking 26–39 weeks, meaning orders placed today won’t arrive until mid-2026, citing smartphone manufacturers. This will turn into a madhouse come 2026. Smartphone sales are **1+ BILLION units** per year, each with at least 4GB of LPDDR RAM. https://my.idc.com/getdoc.jsp?containerId=prUS53072325",
                "author": "-protonsandneutrons-"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Asus, MSI, other manufacturers panic-buying RAM stocks, while major memory chipmakers rake in profits — massive demand for HBM and RDIMM for data centers driving shortage",
        "score": 79,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We really need Black Friday AI crash so that so it's get reduced to 1/10 that actually makes some sense.",
                "author": "riklaunim"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "China’s chip leaders bank on AI, RISC-V as industry’s growth engines",
        "score": 5,
        "text_content": "",
        "comments": [
            {
                "raw_content": "AI is largely a fad right now. All the growth banked on it simply won’t work out, it’s too expensive and unreliable for anything except its perfect use cases. Not saying it’ll stay that way forever, it definitely won’t, but it’s not there yet and still has a while to go. RISC-V though? I believe them when they say they’re gonna do well there. The last 2 decades, the consistent story of China has been the CCP saying “we want to be leaders in this field in a few years”, and then pulling it off every single time, often ahead of schedule. EVs are the perfect example, they beat Tesla at their own game after a couple years of actually trying, and now they lead the world in them.",
                "author": "EnglishBrekkie_1604"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel's next-gen Granite Rapids-WS server CPU lineup leaked",
        "score": 81,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> The mid-tier Xeon 654 scored 2,634 points in the single-core test and 14,743 points in the multi-core test. More importantly, we find out that this chip has 18 cores and 32 threads. Kind of disappointing that a 32 thread 13900k scores better in both ST and MT. I get that the Xeon is way more power efficient (and less prone to failure), but its been 3 years now.",
                "author": "virtualmnemonic"
            },
            {
                "raw_content": "HEDT might be back on the menu if the prices on these are sane.",
                "author": "randomkidlol"
            },
            {
                "raw_content": "I swear toms has the biggest hard on for intel. No performance leaks. Just core count leaks and they’re already saying Intel will somehow have this massive advantage over AMD like AMD is just going to sit still and not launch new product. It’s why I have stayed away from toms for a good while now. They pick and choose favorites not based on merit.",
                "author": "UltraSPARC"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "4K Mini-LED Gaming Value - KTC M27P6 Review",
        "score": 39,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I bought my two KTC 27” QHD monitors for less than a single MSI, Gigabyte, Samsung, or LG typically costs. There’s no point in paying extra for a brand.",
                "author": "hyxon4"
            },
            {
                "raw_content": "With Chinese companies doing massive sales on their monitors all the time why are monitors so expensive? Over $500 for a 27 inch seems insane. Is the mini-led tech really that expensive and worth it?",
                "author": "BlueGoliath"
            },
            {
                "raw_content": "After watching the failure rate problems that Rtings reported on for min-LED, I'm staying away from them. Might as well take my chances with OLED.",
                "author": "bubblesort33"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Silicon Motion SM8388: 8-Channel PCIe Gen5 Enterprise SSD Controller Delivers 14.4GB/s at Sub-5W Power​​​​​​​​​​​​​​​​",
        "score": 30,
        "text_content": "Silicon Motion has announced the SM8388, an 8-channel PCIe Gen5 enterprise SSD controller optimized for nearline QLC NAND storage, delivering 14.4GB/s sequential read throughput and 3.5M IOPS random read performance while consuming under 5W active power. Built on the company’s MonTitan development platform architecture (shared with the 16-channel SM8366), the controller supports up to 128TB capacities, 3200MT/s per channel, and features a hardware-based Separate Command Address (SCA) accelerator to maximize channel parallelism and PCIe Gen5 performance. The SM8388 is NVMe 2.6 compliant, supports EDSFF (E1.S/E3.S) and U.2/U.3 form factors, and includes enterprise security features such as AES-256 encryption, TCG Opal, secure boot, attestation, and hardware root of trust, positioning it for AI-driven warm data storage applications in cloud and data center environments where read-intensive workloads demand both high throughput and exceptional power efficiency.​​​​​​​​​​​​​​​​",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "First time in Kamurocho vs how it's looking right now",
        "score": 843,
        "text_content": "Kiwami 2 took a massive leap in terms of visuals. It's a beautiful game.🤩 *Kiwami on the Switch on top, Kiwami 2 Switch at the bottom",
        "comments": [
            {
                "raw_content": "I am so excited to see what this system can do in another year!",
                "author": "Jayeugene"
            },
            {
                "raw_content": "Kiwami 2 is one of my personal favourites that sadly does not get much recognition. Always nice to see someone enjoying it",
                "author": "acewing905"
            },
            {
                "raw_content": "From a performance perspective, anyone know exactly why Yakuza 2 kiwami is so demanding? I used to have a rog ally before the switch 2 and even on that I couldn't get more than 30 fps in kiwami 2. However, on the later games such as Like a Dragon Gaiden and Pirate Yakuza, I always got 60 fps or more. It is specifically Kiwami 2 that runs heavily.",
                "author": "Cozy-Panda777"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The Pathless is $10!!",
        "score": 202,
        "text_content": "This game is like TOTALLY worth $10, one of my favorite games of all time. Its an open world game with an emphasis on speed. The hook is that there is absolutely no maps and absolutely no waypoints. You really gotta figure out how to traverse the world and it makes for a really unique experience.",
        "comments": [
            {
                "raw_content": "I absolutely loved this game. I mean, I love everything Giant Squid makes. But this is such a hidden gem. I should play it again soon. It’s been a while. The traversal mechanics are so much fun.",
                "author": "SailorPizza1107"
            },
            {
                "raw_content": "Also forgot to mention, it runs at 60fps on Switch 2 since its uncapped.",
                "author": "SyllabubOk5283"
            },
            {
                "raw_content": "£34 in the UK. It does look cool though.",
                "author": "yaboymuggins"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Is there good point and click adventure game on the switch?",
        "score": 50,
        "text_content": "Is there good point and click adventure game on the switch?",
        "comments": [
            {
                "raw_content": "Thimbleweed park",
                "author": "Spattzzzzz"
            },
            {
                "raw_content": "Get UFO 50. One of the 50 games is Night Manor, which is a horror-themed point and click adventure. And then you get 49 other games as a bonus.",
                "author": "SloopDonB"
            },
            {
                "raw_content": "Return to Monkey Island",
                "author": "Scapetti"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "What’s the best budget Switch 2 Pro style controller?",
        "score": 13,
        "text_content": "Just purchased a switch 2 for the kids for Christmas. They’re 8 & 5 so hard to justify spending $90 for a controller that they’ll probably break. What pro style controllers are best? I’ll have two of these along with 2 sets of joy cons.",
        "comments": [
            {
                "raw_content": "8BitDo Ultimate 2C Bluetooth edition. Only about $30 and really good quality. Comes in multiple colours too! Just be sure not to get the PC version by accident.",
                "author": "WorldLove_Gaming"
            },
            {
                "raw_content": "The official one is the best controller I’ve ever used",
                "author": "TootyMcFarts"
            },
            {
                "raw_content": "Don't get the official one. Try an 8bitdo with hall effect sticks so it doesn't drift. It won't turn on the console, but that's the only downside. You will get cheaper controllers that last you longer for less with slight inconvenience.",
                "author": "kmfdm_mdfmk"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Batman: Arkham Knight is…",
        "score": 26,
        "text_content": "So fun on Nintendo switch 2! Sure - the resolution is bad but it is steady 30fps. For 10 dollars this has been a great deal! Just wanted to give this game some love - hopefully there is an upgrade for switch two soon. But I’m having a lot of fun.",
        "comments": [
            {
                "raw_content": "I don't think the game should have ever launched on Switch. If it gets a Switch 2 Edition, I will happily pick it up. Now where is Arkham Origins? 😤",
                "author": "Jaketrix"
            },
            {
                "raw_content": "Did the game get an update recently? I have the trilogy cartridge.",
                "author": "Mclovin207"
            },
            {
                "raw_content": "They can’t fix the actual problem with the game which is that about 2/3 through it really become a slog. That first half is awesome, though. I beat it. I wasn’t happy about it. When i found out what needed to be done to get the “true” ending I nearly quit video games.",
                "author": "VicViolence"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The end screen music for the online test demo of Kirby Air Riders is such a chill vibe",
        "score": 9,
        "text_content": "I have my Switch 2 running it on my desk so I can listen to it while I browse. It reminds me of the Trophy Gallery music from Super Smash Bros. Brawl and I love it! I hope it's gonna be available in the music list of the main game, that would be sweet!",
        "comments": [
            {
                "raw_content": "I love cool menu music in games. I often do the same thing and chill on a screen and listen for a while haha",
                "author": "gothamz77"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Switch 1 cart sparking zero on switch 2",
        "score": 16,
        "text_content": "So I got the switch 1 version of sparking zero on cartridge, I inserted it on my switch 2 and it downloaded an update. I assumed after it would show the switch 2 edition logo artwork but it still just says sparking zero. My question is, is there a way to verify that I’m actually playing the switch 2 version?",
        "comments": [
            {
                "raw_content": "I think it's part of just a regular update like some of Nintendo's games so you should be good",
                "author": "CSBreak"
            },
            {
                "raw_content": "Push plus while you have the game highlighted on your menu and it'll tell yoi if it's Switch or Switch 2 software",
                "author": "burai97"
            },
            {
                "raw_content": "From what I can tell, the game is treated more like Odyssey or Scarlet/Violet to where the resolution and texture improvements are baked into the Switch 1 version. There just happens to be a seperate Switch 2 version that acts identically to the Switch 1 version running on Switch 2. I don't own the game, but the trailer explanation seems to allude that.",
                "author": "JustThatOneGuy13"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Why drift and attack buttons in Kirby Air Riders are the same!",
        "score": 19,
        "text_content": "Don't get me wrong I love the game, but I winder why did Mr. Sakurai decide to use the same Button (B) for drifting and using weapons? Wouldn't it have been better if these were separated buttons. I find it frustrating that I need to drift in order to attack.",
        "comments": [
            {
                "raw_content": "You need to slow down in order to attack, making it a trade off.",
                "author": "Flagrath"
            },
            {
                "raw_content": "It’s funny because Sakurai actually apologized for using a second button in the controls, for your super lol",
                "author": "computerCoptor"
            },
            {
                "raw_content": "The whole point is to have to adapt and take the trade off of having to slow down in order to attack.",
                "author": "Otherwise-Music-8643"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Cold Fear has been removed from Steam, which suggests that it's likely in preparation for a remaster",
        "score": 56,
        "text_content": "Cold Fear has been mysteriously removed from Steam,the reason for its removal is most likely to be to release a remaster, since the IP now belongs to Atari. [https://store.steampowered.com/app/15270/Cold\\_Fear/?curator\\_clanid=43447575](https://store.steampowered.com/app/15270/Cold_Fear/?curator_clanid=43447575) In August, Atari acquired five IP from Ubisoft: Cold Fear, I Am Alive, Child of Eden, Grow Home, and Grow Up. In an official statement, Atari said these IP would be relaunched under its label, so if they release a remaster of Cold Fear, it would be handled by Nightdive Studios. [https://www.gematsu.com/2025/08/atari-acquires-rights-to-ubisofts-cold-fear-i-am-alive-child-of-eden-grow-home-and-grow-up#nnn](https://www.gematsu.com/2025/08/atari-acquires-rights-to-ubisofts-cold-fear-i-am-alive-child-of-eden-grow-home-and-grow-up#nnn)",
        "comments": [
            {
                "raw_content": "I had no idea it was even on steam, I remember playing this as a kid and it absolutely terrified me. If it does get remastered hopefully it lives up to how I remember it",
                "author": "Zeta_Crossfire"
            },
            {
                "raw_content": "Isn´t Nightdive owned by Atari?",
                "author": "Wolfen459"
            },
            {
                "raw_content": "Bit off topic but does anyone remember a game very similar to this one but set in a frozen lost ship (can’t remember if it was actually in the Artic or just another really cold place)? The enemies were either ghosts or mutants, can’t quite remember, but I do remember they were really pale. They may or may not have been a dog involved. And I remember the name of the game being similar to Crysis, to the point I got them confused on occasion. I remember my dad used to play it for a bit when I was a kid, but I was scared shitless of all horror games back then so I don’t really remember much of it. But every time I see this game come up it reminds me of that one because of how similar their premises seem to be.",
                "author": "ARROW_GAMER"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Ubisoft is getting bought by someone",
        "score": 1337,
        "text_content": "According to Omar Alamoudi ( same person who teased onimusha's return and xbox pulling out of the MENA ) He said and quote >Imagine, imagine, imagine, within a single generation, all the world's largest third-party companies have been acquired... Attaching the logos of EA, ABK and ubisoft The [source](https://xcancel.com/OAlamoudiTG/status/1990031877957386733#m)",
        "comments": [
            {
                "raw_content": "He says its tencent in the replies btw",
                "author": "Carlosless-World"
            },
            {
                "raw_content": "But do the new owners like Rayman?",
                "author": "KiNolin"
            },
            {
                "raw_content": "I’d say China. They’re already in bed with Tencent.",
                "author": "SynthwaveSax"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Gamer Tag Radio: Parris Lilly heard something similar regarding Jez Corden comments about PlayStation",
        "score": 63,
        "text_content": "Just for more context if anyone is interested it was during a event in the summer but he said it seemed doubtful Conversation starts at 8:30 in the stream https://www.youtube.com/live/rQcrcyeWdtA?si=qc3BDR1gIIUOecOj",
        "comments": [
            {
                "raw_content": "#Jez Corden is a Tier 2 - Generally Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Which comment didn’t jez backtrack like 5 times?",
                "author": "pizzaman5555"
            },
            {
                "raw_content": "Which comments bro there’s 46 Jez posts where he changes his stance over the past week alone",
                "author": "Ratchet2332"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "NateTheHate: Microsoft Partner Showcase Announcement \"Very Soon\"",
        "score": 487,
        "text_content": "[https://xcancel.com/NateTheHate2/status/1989885666679718304#m](https://xcancel.com/NateTheHate2/status/1989885666679718304#m)",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "It will be this week according to the SH2 leak.",
                "author": "FlyFight2Win"
            },
            {
                "raw_content": "Tomorrow direct date, Vga's nominees and Ubisoft buyout. \"What a week, uh?\"",
                "author": "Lz537"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Nvidia’s RTX 60 Series to Launch Early 2027",
        "score": 414,
        "text_content": "https://www.eteknix.com/nvidias-rtx-60-series-expected-to-launch-in-early-2027/",
        "comments": [
            {
                "raw_content": "I'm going to lose it if the 6060 only has 8GB VRAM",
                "author": "smolgote"
            },
            {
                "raw_content": "$3000 and games will still stutter",
                "author": "RemoveOk9595"
            },
            {
                "raw_content": "Is this really a leak? Every two years there is a new generation. This has been the standard for at least a decade now.",
                "author": "Demistr"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel reportedly working on Arc B380 Panther Lake Xe3 iGPU for gaming handhelds",
        "score": 168,
        "text_content": "Intel might be working on Arc B380 Panther Lake Xe3 iGPU. If true, then it would be the best Intel iGPU in comparison to the current ones. [source ](https://videocardz.com/newz/intel-reportedly-working-on-arc-b380-panther-lake-xe3-igpu-for-gaming-handhelds)",
        "comments": [
            {
                "raw_content": "Intel Marketing always finds the snappiest product names!",
                "author": "LtRapman"
            },
            {
                "raw_content": "Does this affect the development of half life 3?",
                "author": "Carlosless-World"
            },
            {
                "raw_content": "What's with the half life 3 comments in a seemingly unrelated post?",
                "author": "Deck_Masterbaiter"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Jez seemingly backtracks a second (third?) time saying it was just a rumor during a discussion and that he doesn't know what Sony is planning regarding pc releases",
        "score": 449,
        "text_content": "https://xcancel.com/JezCorden/status/1989728119914389679?s=20 \"This was very barely a rumor on my part during a speculative discussion on the podcast. I have no idea what Sony is doing\"",
        "comments": [
            {
                "raw_content": "#Jez Corden is a Tier 2 - Generally Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "This dude should just stop talking for a while.",
                "author": "mashdpotatogaming"
            },
            {
                "raw_content": "But in the tweet right below it he again doubles (triples?) down that it was from a good source...",
                "author": "Sad_Locksmith_5997"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Xeon 600 \"Granite Rapids-WS\" series leaked, offering up to 336MB cache",
        "score": 48,
        "text_content": "",
        "comments": [
            {
                "raw_content": "so like, are we actually getting a w790 successor or will it finally arrive when its already outdated.",
                "author": "Zeraora807"
            },
            {
                "raw_content": "As an AMD user I hope this will make TR 9000 prices more reasonable",
                "author": "dakkidaze"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel cancels 8-channel \"Diamond Rapids\" Xeon 7, shifts focus to 16-channel variants",
        "score": 29,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I imagine this is a cost *cutting measure and not some brilliant strategic move. GNR will have to service the lower cost market, then.",
                "author": "soggybiscuit93"
            },
            {
                "raw_content": "16 Channel RAM, damnnn",
                "author": "purplemagecat"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel Core Ultra 290K, 270K and 250K Plus spec leak: \"Arrow Lake Refresh\" with higher clocks, more cores and faster memory support",
        "score": 122,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hopefully they beat raptor lake for gaming lol",
                "author": "thatnitai"
            },
            {
                "raw_content": "Wonder if they tweaked the NGU/D2D considering how easily they OC and how much it helps for gaming",
                "author": "Touma_Kazusa"
            },
            {
                "raw_content": "I’ve been on the Intel Core Ultra 9 285K for about a year now, and I can easily say that I’ve never had a CPU this powerful and this stable. I’ve used AMD before, but 285K’s an absolute beast, zero issues so far. Running it under a 420 mm AIO and for productivity it’s just ridiculously good.",
                "author": "hitchhiker87"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "I finished my first AMD rig since my Athlon XP 2100+ in 2002. Cat tax included! Also retired my GOAT evga 1080ti hybrid FTW3 in Sept with a Powercolor 9070XT, my first/last AMD/Ati gpu was a 9800 Pro for Half Life 2 launch.",
        "score": 102,
        "text_content": "My faithful GOAT evga 1080ti hybrid FTW3 for over 6 years was retired a few months ago due to concerns of the pump failing and I decided I no longer wanted to support Ngreedia after 20 years of using them, as well as ditching Asus and Intel that I've also been using the last 20+ years. It feels really good to be back on team red as my very first computer I ever built was a AMD Athlon Axia 1.33Ghz on a Socket A Abit-KT7A waaaaay back in spring of 2001. At that time I went all out and got the first of its kind, VisionTek GeForce 3 for it. Flash forward to 2004 and Values STEAM and Half Life 2 had launched and benchmarks on the web showed that ATIs GPUs ran it much better then the shitty GeForce FX series which also ran hot and loud. So I ditched my geforce got my first ATi Hercules 9800 Pro AGP, it was quite a change back then, but not as much as going from 20 years of geforce usage to AMD with thid beautiful powercolor 9070 XT! It's really nice having the CPU/motherboard/gpu driver and software all together. Adrenaline is super easy to use vs that horrid geforce experience crap and the old nvidia control panel is just so out of date. Going from my i7 9700k to this 9800xd is a amazing difference, I cannot believe how much my 9700k was holding back this 9070xt in games! Cyberpunk went up nearly 50fps! I don't think I'll ever use anything else other AMD products. Feels good to be back in RED camp after all this time!",
        "comments": [
            {
                "raw_content": "Welcome back to Team Red, why does your cat look so angry?",
                "author": "Mallissin"
            },
            {
                "raw_content": "Why is the cat aura farming me? Nice build too",
                "author": "mr_q117"
            },
            {
                "raw_content": "nice did you snag the woot deal?",
                "author": "Rude_Assignment_5653"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "From vega 56 to 9060 xt 16GB",
        "score": 659,
        "text_content": "I'm very excited, i bought the vega like 7 years ago and it has been amazing for 1080p ultrawide but it was time to upgrade because it's struggling in new titles, this new guy should do perhaps doubles if not more the performance!!",
        "comments": [
            {
                "raw_content": "More than double the power. 2.2x according to Techpowerup",
                "author": "Tyr_Kukulkan"
            },
            {
                "raw_content": "Yeah booiii! I went Vega64/1700x to RX 9070/5700X3D. Enjoy",
                "author": "SrChuffington"
            },
            {
                "raw_content": "Still holding my Vega 64 since 2017.😅",
                "author": "rvholdem"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD: Solid Roadmaps Beget Money, Which Beget Better Roadmaps And Even More Money",
        "score": 70,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This isn’t news. It’s speculation by a Tech/Finance bro plugging AMDs numbers into some spreadsheets with heavy amounts of “AI isn’t a bubble” cope.",
                "author": "tagubro"
            },
            {
                "raw_content": "AMD's roadmap have the tendency to assume it will be equal(or sometime even better CAGR) to NVIDIA, which is a bit funny and sad.",
                "author": "Verpal"
            },
            {
                "raw_content": "Doesn't seem to have worked for GPUs, though...",
                "author": "INITMalcanis"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "More Americans are losing their homes, as foreclosures jump 20%. What’s driving it.",
        "score": 373,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I think we know what’s driving it. Layoffs, people buying at the TOP of their budget not realizing insurance and taxes increase, and low down payments.",
                "author": "LBishop28"
            },
            {
                "raw_content": "Another post of a rewritten ATTOM’s article.. this time they paywalled it, lol. Just read it here direct from the source: https://www.attomdata.com/news/market-trends/foreclosures/october-2025-foreclosure-market-report/",
                "author": "SnortingElk"
            },
            {
                "raw_content": "Increase in taxes and insurance. Eventually with paying interest and an increase in everything else renting can be cheaper.",
                "author": "VicVelvet"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "They Rushed to Buy Homes During the Pandemic. Now, Some Feel Trapped.",
        "score": 197,
        "text_content": "I'm sure most of us have seen some news reports that the Federal Reserve might not cut rates in December 2025. This NYTimes \"news\" article is an indirect form of lobbying, disguised as journalism, intended to pressure the Federal Reserve into lowering interest rates via sympathy and emotional manipulation. Whenever these articles pop up, notice how there's never any mention of home prices being lowered. It's always about interest rates. Unless homesellers substantially lower their listing price, they'll be trapped forever in these starter homes, paying rising carrying costs, because nobody wants to become the next bagholder. **Pandemic-Era Homebuyers Feeling Trapped** * Many Americans bought homes during the pandemic when mortgage rates fell below 3%, a historic low. * Now, with rates much higher, homeowners feel locked into their current properties because selling would mean taking on a far more expensive mortgage. **Life Changes vs. Housing Constraints** * Families who bought “starter homes” during the pandemic are now outgrowing them due to children, pets, or lifestyle changes. * Despite wanting more space, they hesitate to move because their low-rate mortgages are too valuable to give up. **Surveys & Data** * A 2023 survey found 82% of homeowners felt “locked in” by their low mortgage rate. * Nearly 1 in 4 homeowners regret their purchase, especially millennials who underestimated ownership costs or postponed other life goals. **Examples of Trade-Offs** * Some families stay put and consider costly renovations instead of moving. * Others who did move face much higher monthly payments due to today’s interest rates, forcing lifestyle cutbacks. * A few who refinanced after financial struggles now pay significantly more each month. **Broader Market Context** * High rates and limited inventory mean “starter homes” have become long-term homes for many. * President Trump has floated a 50-year mortgage proposal to ease affordability, but homeowners remain reluctant to give up their existing low-rate loans.",
        "comments": [
            {
                "raw_content": "Oh no! I own a home and my interest rate is *too good*! This suuuucks! Boo hoooooo!",
                "author": "ankercrank"
            },
            {
                "raw_content": "This is ridiculous. I also got my house during covid and it's ridiculous to complain about being trapped. As if that's not much better then not being able to afford a house. Rage bait article...",
                "author": "MadGibby3"
            },
            {
                "raw_content": "Fed doesn't control rates directly they influence it by cutting fed fund rates but it's ultimately controlled by 10 yr Treasuries. And bond market won't budge with all uncertainty and inflation still in horizon. So we could very well have fed fund rate be below 200 bps while 10 yr hovers around 4% which means mortgage rates will still be at current levels. This is very very bad and Powell knows it and that's why he is hesitant to cut",
                "author": "Dmoan"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Very curious price history. Can anyone solve the riddle here?",
        "score": 0,
        "text_content": "https://www.zillow.com/homedetails/6634-Regal-Woods-Dr-Hudson-OH-44236/124189339_zpid/?utm_campaign=iosappmessage&utm_medium=referral&utm_source=txtshare Price history shows months of high ask / price cut / price cut… Then eventually sold for ~150k less then days later relisted back at the too-high prices.",
        "comments": [
            {
                "raw_content": "Yes, have seen this before. Buyer thinks they are getting a good deal and thinks they can flip it for a 100k profit",
                "author": "dankroll69"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Figure walking on very uneven terrain.",
        "score": 796,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Me after a night out back when I was drinking.",
                "author": "Taxus_Calyx"
            },
            {
                "raw_content": "Kinetically though isn't swinging arms beneficial for balance? https://i.redd.it/21euwzezro1g1.gif",
                "author": "SlavaSobov"
            },
            {
                "raw_content": "In this demo figure is not using any cameras for navigation, it is essentially blind.",
                "author": "BurtingOff"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Interesting divergence after 5.0 dropped. Right away it didn't live up to the hype",
        "score": 509,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/c334vsys7o1g1.png?width=937&format=png&auto=webp&s=5b66b732c3c7c11f9ac9edcabac340c61cf5b47b because it's based on lmarena, where gpt5 didn't perform very well",
                "author": "kellencs"
            },
            {
                "raw_content": "They’re betting on Gemini 3 and they’re probably right Edit: I’m wrong. Check the comments responding",
                "author": "peabody624"
            },
            {
                "raw_content": "People expected gpt5 to be a step change, but it turned out just an incremental change from o3 (it would have been a step change from gpt4 though), hence the disappointment against OAI.",
                "author": "Freed4ever"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "I've seen the LLM vs hamburger comparison made many times. While it feels like a convenient excuse ignore potential impacts due to a statistical whatboutism, has anyone taken the more obvious message and stopped eating meat?",
        "score": 141,
        "text_content": "Or fixed your toilet that keeps on making noise?",
        "comments": [
            {
                "raw_content": "I think the important thing that everyone always neglects to mention in this discussion is where the incentives are. There isn't too much incentive to make hamburgers more environmentally friendly other than public pressure since it's usually not reducing the cost(often increases it) But AI companies have huge incentives to reduce costs in an extremely competitive market. So if AI is not valuable and too expensive in terms of energy it just won't exist anymore. But I think it's pretty clear that's not happening and it's super valuable and can easily pay for itself in terms of efficiency",
                "author": "Artistic-Staff-8611"
            },
            {
                "raw_content": "Well I'm vegetarian because of the water and land use difference between vegetarian diets and carnivorous diets. It takes something the x9-11 times as much water and land to feed a person who eats meat. If we could reduce farm land and plant in the newly unused area we could get significant carbon sequestration from that. Worth noting that that is a one time sequestration as dead trees decay and release back. But something like this may be needed in the near future. That said it wasn't due to this info graphic. I've been vegetarian for 9 years.",
                "author": "whenhellfreezes"
            },
            {
                "raw_content": "No one is saying ai doesn’t use a lot of resources but we need to be realistic with the backlash. It gets a disproportionate amount of hate compared to how bad it actually is. A more measured take away would be “I see the resources ai is consuming looks like it will be increasing rather quick lets start thinking about how to minimize that” compared to “ai slop is draining our oceans”. One thing to keep in mind is, while resource usage goes up, intelligence will as well, which in turn can be used to save resources in the long run. An example of this is an improvement found by alpha evolve where they made their overall database operations more efficient by 0.7%. I think ai is our best bet to figure out fusion energy for example as quick as possible.",
                "author": "Setsuiii"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "I think the n.o. of 🤔 emoji's might be code for nb2/gemini 3/veo 4 next week... Hmmm....",
        "score": 63,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is insufferable",
                "author": "Mighty-anemone"
            },
            {
                "raw_content": "I think they should stop with this stupid teasing and be serious, enough is enough, if there is one thing they shouldn't have learned from OpenAI is to do this",
                "author": "adarkuccio"
            },
            {
                "raw_content": "can we please keep the vague hypeposting to Sam & Co.",
                "author": "micaroma"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Does anyone else feel like anti-AI sentiment on social media has reached a point where you'll be met with hostility if you say anything even neutral on the topic?",
        "score": 309,
        "text_content": "Over the last year or two, it feels like that \"anything related to AI is evil\" sentiment really started to take off, especially on social media. It seems to have become some kind of black-and-white, team sport, virtue signalling thing, where if you don't hate AI, you just hate the environment, hate human connection, hate creativity, hate artists, you're a thief, etc etc.. Even replying to a claim of \"AI has literally never been useful\" by saying \"they've helped me with simple programming tasks\" has gotten me harassed by a bunch of people throwing personal insults, more than once. I mention I once used AI to color a pencil sketch I made by hand, and get told I'm not a \"real artist\". ANY story or news article that has something negative to do with AI gets boosted to the top, even if it's obviously false. The top post on a Reddit updates subreddit right now is, IMO, pretty clearly ragebait (it's about a woman dramatically leaving a man at the altar during their wedding because she found out he used AI, and written very weirdly), but because the guy is being dumped for using AI, the community is eating it up. Maybe it's just me, but I'm starting to feel less and less welcome in any space that isn't specifically pro-AI, which sucks. I genuinely like seeing other viewpoints and having discussions with people about differing views. I don't want to be in just an echo chamber, I'm not gonna be right about everything. But in most online communities these days, it does NOT matter how respectful you are... Just saying something like \"some people do actually find AI to be helpful for specific jobs\" gets me mass downvoted with a lot of pretty nasty insults to boot. It doesn't seem to matter how much I try to see their side; if I say anything that isn't explicitly negative, then it's like I'm the enemy. Anyone else also starting to feel this way, or am I just being dramatic?",
        "comments": [
            {
                "raw_content": "They can complain all they want and tell themselves that \"LLMs are a dead-end\" or \"Its a bubble/fad\" since they desperately want to believe Ai will go away. But the truth is, Ai is only getting better and they will be left screaming at the clouds while their job is replaced. Its clear that they feel threatened by it. Its funny because there is nothing that will convince them of this. If all of their complaints with LLMs are fixed, they will still call it \"not real intelligence\". If it replaces their job, they will complain that executives were fooled by the Ai's capabilities. There is no way for them to ever admit they were wrong. This is cognitive dissonance.",
                "author": "JollyJood"
            },
            {
                "raw_content": "Well the tech sector has been saying it'll replace people like nothing before, and government commentators have been effectively saying \"screw you, we won't help when you lose your livelihoods\". *Of course* people hate it.",
                "author": "cfehunter"
            },
            {
                "raw_content": "The same fundamental sentiment was directed against calculators in the 1970s, personal computers in the early 1980s and the internet in the late 1990s. They were seen as disruptive, needlessly complex, soul-destroying and mind-numbing. They were said to make people dumber and would contribute to the downfall of civilization. Yet here we are. What's disappointing is that much of this rancor is coming from younger people who should be far more forward-looking as well as enthusiastic about scientific and technological developments like their predecessors from prior generations but instead they think more like older people set in their ways when it comes to this subject. My two cents anyway.",
                "author": "human_in_the_mist"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "How long before anyone can generate a sequel for their favorite movies?",
        "score": 25,
        "text_content": "Pretty crazy how Sora can already generate pretty decent 15 second movie trailers for any sequel you can think of. Is the future of media and entertainment stuff like this but at a bigger scale?",
        "comments": [
            {
                "raw_content": "Entertainment is going to be splintered into these tiny niche fragments. We all used to watch the same TV channels or we would all see the same movies at the cinema. Then, youtube and Netflix started catering to us specifically. Soon, it will be your own personalised films that no one but you is watching.",
                "author": "ZipLineCrossed"
            },
            {
                "raw_content": "Look at it this way because I already have a lot of filmmaking experience. I am currently right now, working on my own custom porn that I believe I will be able to monetize within the next couple months. Things are gonna be a lot more crazier than five years.",
                "author": "Express-Razzmatazz-9"
            },
            {
                "raw_content": "I say around 2037.",
                "author": "orderinthefort"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Has everyday life really changed much in the last decade?",
        "score": 65,
        "text_content": "Undoubtedly, we are living in an age of unprecedented technological advancement, never seen before in history. And we are fortunate to live in a time where much of the seemingly impossible, gradually becomes commonplace. But…in a practical sense, is it really moving at the speed that Ray K. insists? I mean, even if computation doubles every year, are we really seeing practical results of that in real time? As I said, it’s certainly amazing, the rate at which things evolve, especially in the digital world, but Ray’s whole point seems to be that we will see rapidly increasing change in a shockingly short amount of time like, the next few years. And that just doesn’t seem to be the case. I look back at 2015, and I don’t see a whole lot of difference. Sure, the tech we had then continues to increase in effectiveness, and the AI revolution is interesting, but it seems like life is basically the same. Am I wrong about this?",
        "comments": [
            {
                "raw_content": "If you told people in 2015 that within a decade there would be AIs that could pass the Turing test, write most of the code, win gold at the IMO, make music that hits the #1 spot, and make videos that most people can't distinguish from reality, they would think you're delusional.",
                "author": "xeckr"
            },
            {
                "raw_content": "I work from home, use vr to watch stuff in a private theatre, have ai doing a lot of my work for me, my car drives it self. For me it’s changed a decent amount but I guess life is still the same otherwise as in work and enjoy days off.",
                "author": "Setsuiii"
            },
            {
                "raw_content": "better phones, better computers, LLMs, diffusion and easier access to some useful apps (google maps etc.) and that's pretty much it but AGI is very much closer than 10 years ago, even if LLMs aren't scalable Ray predicted two big things: AGI in 2029 and things will be fine after AGI and ASI if his AGI prediction holds true, 2035 will look very different. Even if LLMs stall qualitatively, or marginally improves, imagine having enough compute available to have dozens gpt5 pro running non stop locally on your work laptop, on your glasses... On a broader level, it seems that AGI is the last of the low hanging fruits, so we have already saturated cars, planes, televisions to a level where it's either very difficult to improve or an improvement is not really necessary, and real transformative progress in biotech seems harder then AGI at least today",
                "author": "74123669"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Meta is about to start grading workers on their AI skills",
        "score": 176,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\\>Earlier this year, Meta overhauled its hiring process by allowing job applicants to use AI in coding interviews. This actually isn't a bad idea. The less a technical interview is about regurgitating some information you can find on Stack Exchange, the better employees you can find. The same goes for Leetcode interviews",
                "author": "averagebear_003"
            },
            {
                "raw_content": "It will be funny if they use an AI tool to grade AI performance. Robots grading other robots.",
                "author": "JordanNVFX"
            },
            {
                "raw_content": "Tech bros on hopium for transformers llms",
                "author": "LateToTheParty013"
            }
        ],
        "subreddit": "singularity"
    }
]