[
    {
        "post_name": "AOC: it's YOUR fault that I'm an idiot on foreign affairs and geography!",
        "score": 735,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You do not understand foreign policy",
                "author": "DingleBalls"
            },
            {
                "raw_content": "She sounds a bit horse.",
                "author": "ThisTrainHasNoBrakes"
            },
            {
                "raw_content": "Please AOC, tell me about Taiwan and China. Tell me what America's policy has been for what 35+ years now? I'm a newbie to foreign politics, because I don't care, but I feel like I know more than the bimbo.",
                "author": "billybaldwin2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Stephen Miller : Understand this: the Democrat Party is completely and irrevocably committed to the project of making America into a third world society. If that happens, nothing else works — infrastructure, healthcare, education, public safety. Nothing. It’s just that simple.",
        "score": 622,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Then someone better start hanging them from lamp posts because time is sure running out.",
                "author": "sumnayin2"
            },
            {
                "raw_content": "They want us all dead and our country destroyed.",
                "author": "projectarcturus1"
            },
            {
                "raw_content": "Microphones talking into microphones. This dude must have a Patrick Bateman style morning routine for that afro.",
                "author": "OnceADroplet"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "HUMILIATION RITUAL! The system does what it's supposed to do. The fact IDs are being requested for volunteers to remove snow but not to vote speaks volumes.",
        "score": 100,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not many people buy the argument against voter ID. It will be interesting to see how it plays out in California if it gets on the ballot, which it should. If all Republicans vote yes on it, you would only need like 10-20% of Democrat support for it to pass, and polls show Democrat support for it usually well over 50%.",
                "author": "duckduck"
            },
            {
                "raw_content": "Libtard: \"I'm here to protest Voter ID.\" Organizer: \"Great!! Let me check your ID to make sure you're on the payroll.\"",
                "author": "WillWins84"
            },
            {
                "raw_content": "Op is right; humiliation ritual",
                "author": "Juzeza"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Israel takes out Hezbollah’s entire missile command structure. Timing seems relevant.",
        "score": 86,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We're really falling behind on sorting things out at home, but at least somebody allegedly blew up Mohammed, Mohammed, Mohammed, Mohammed, Mohammed, Mohammed, Mohammed, and Mohammed, 173,000 km away on Endor or wherever they live.",
                "author": "VoteThing"
            },
            {
                "raw_content": "inb4 ww3",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "bibi aint even a jew or jewish foreigners in command of your land and people, the khazarian way",
                "author": "Thermopylae_MMXX"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "VP JD Vance just HIT BACK HARD at Democrats demanding \"reparations\" for President Trump's tariffs. \"On behalf of the American people, I want reparations from THEM for allowing Somali fraudsters to steal BILLIONS from the American taxpayer!\"",
        "score": 976,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's good, but why are we always playing defense?",
                "author": "EgregiousPhilbin"
            },
            {
                "raw_content": "The vice president is talking about Somali fraud, and still, I can't tell that anything is happening. There is no force field stronger than the one that protects criminals in the US.",
                "author": "VoteThing"
            },
            {
                "raw_content": "Prosecute the theft",
                "author": "MeMargie"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"Mamdani blasted for requiring 5 forms of ID to shovel snow while DSA opposes voter ID.\" Anarcho-Tyranny.",
        "score": 756,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's Ma'amdani",
                "author": "Whoopies_tds"
            },
            {
                "raw_content": "In Communism, the proletariat is there only to obey the dictates of their superiors; and the dictates are always right. Mamdani’s demands are always right - just like Chairman Mao and the Rocket Man of North Korea.",
                "author": "MAGAguitar"
            },
            {
                "raw_content": "But...no proof of ID to vote right?",
                "author": "cornpop_1988"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔥 𝙔𝙊𝙐'𝙍𝙀 𝙁𝙄𝙍𝙀𝘿! A leftist professor at Coastal Carolina Community College in NC, who was reportedly caught RAGING during class, calling Trump a \"fascist dictator\" and Charlie Kirk a \"racist piece of sh*t\" has been FIRED!",
        "score": 1246,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That is the face of a child rapist.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "This is never going to stop until we restore American demographics to 70-80% White Americans. The left is emboldened by multiculturalism. I don't care what I'm called. I never consented to being replaced. Deport immigrants. Period.",
                "author": "HorrorGameDev"
            },
            {
                "raw_content": "These types of mentally ill people are all around our education system from elementary to college level... start exposing them and even on school boards... start calling them out... they're the reason our kids are dumb and stupid and manipulated by media and going out to protest and getting themselves killed as pawns... if we can't make them see they are wrong... we destroy them financially so they learn the hard way to not F with our children's future with their leftist dem ideology and anti-America lies.",
                "author": "cherbui"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Syria Asks Germany Not To Deport Its Citizens Back Home, Fearing It Would Make Country 'Unsafe'",
        "score": 1088,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yeah, because these countries are not sending their best. They're sending their rapists, their killers, and their terrorists. President Trump was right about everything.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "I thought this was a Babylon Bee headline",
                "author": "TexasDusty"
            },
            {
                "raw_content": "The Germans, historically, have a habit of suddenly correcting diversity problems.",
                "author": "blackswans"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "That's racist!",
        "score": 1348,
        "text_content": "",
        "comments": [
            {
                "raw_content": "In canada you don't have to worry, jobs been bid on by a handshake in Bangalore",
                "author": "Chachiex"
            },
            {
                "raw_content": "I remember that I might have had to show multiple ID to take a standardized test back in the day. Talk about racist.",
                "author": "26magarat"
            },
            {
                "raw_content": "I had to show ID to pick up a toilet seat I ordered at Menards",
                "author": "redwing"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING UPDATE: North Carolina professor Chris Schulte has been FIRED effective immediately following vile rant diring class slamming Trump and Charlie Kirk as “fascist, racist, POS.” FAFO.",
        "score": 795,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The American education system is completely compromised. The entire thing is a faggot lefty indoctrination camp. Kindergarten through college.",
                "author": "sw0le_patr0l"
            },
            {
                "raw_content": "Imagine sharing the exact same personality and internal dialogue with millions of other NPCs",
                "author": "TruculentGoose"
            },
            {
                "raw_content": "\"Its only democracy when we get our way!\" - the left",
                "author": "RedPillosopher1776"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Beloved New York Teacher Placed on Leave for Helping Students Launch TPUSA Chapter",
        "score": 1200,
        "text_content": "",
        "comments": [
            {
                "raw_content": "She'll win a settlement two years from now and nothing will change.",
                "author": "loooooof"
            },
            {
                "raw_content": "My kids went to that school. Was always a nice quiet town until they built section 8 housing.",
                "author": "LiberaIPussyGuy"
            },
            {
                "raw_content": "This will end up in court, and she'll win if she chooses to pursue it.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Supreme Court Justice Clarence Thomas: “In response to the media… I will absolutely leave the court when I do my job as poorly as you do yours.”",
        "score": 499,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That laugh. I remember exactly where I was during the vote to confirm his nomination to the Supreme Court. It was a day I'll never forget.",
                "author": "Landslide_2020"
            },
            {
                "raw_content": "This man should be celebrated like none other in the black community. But, they never even talk about him except to condemn him.",
                "author": "JohnN"
            },
            {
                "raw_content": "He really is The Best Judge!",
                "author": "TrumpMagaNoBama"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Liberals need to calm down.",
        "score": 398,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Link https://x.com/JaimeeUSA/status/2025050145490968688?s=20",
                "author": "I-am-Orlando"
            },
            {
                "raw_content": "Or a democrat.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "This might piss off the Woke Right too but Trump is neither Homophobic, Misogynistic or Racist. And expecting him to be will cause no end to disappointment..",
                "author": "JamesSunderland"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Don't try to kill an ICE agent and you'll be fine.",
        "score": 970,
        "text_content": "",
        "comments": [
            {
                "raw_content": "My advice is turn off your TV because it is making you retarded.",
                "author": "CleanUpPhillyTrump24"
            },
            {
                "raw_content": "White people are carjacked by blacks in broad daylight and most inner city whites don't dare go out of the house after dark because of black crime, and you're afraid to drive to work in the morning because you're a black woman? Cry me a river.",
                "author": "Oldman1234"
            },
            {
                "raw_content": "Sounds like she just hates having to work",
                "author": "StoopidAsshole69"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🎬 BREAKING - President Trump is now calling on Netflix to immediately FIRE former Obama official Susan Rice after she openly stated Democrats will weaponize the government to go after anyone who supported the President...",
        "score": 561,
        "text_content": "",
        "comments": [
            {
                "raw_content": "She's literally calling for political persecution...she should be banned from every working in or for government at a minimum. This is the \"literally Hitler\" stuff they talk about.",
                "author": "texas4ever"
            },
            {
                "raw_content": "Netflix is nothing but a money laundering service for communists. It should be shut down.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "I wonder why none of the republicans are calling out these types of remarks by these people, surely they consider themselves the targets of these remarks. Right?",
                "author": "TheRealityOfItIs"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "In Spain, a restaurant owner was threatened for staying open during the day during Ramadan. So not only did he remain open, but he also put ham on all the tables as a big middle finger!",
        "score": 603,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Spain has been at this crossroad before. Is there enough cultural memory and testicular fortitude to force them out again?",
                "author": "Pederella"
            },
            {
                "raw_content": "Spain is a powder keg.",
                "author": "FusionBlack"
            },
            {
                "raw_content": "Based. Chad 👍",
                "author": "YaharaRiver"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump Raises Global Tariff Rate to 15 Percent",
        "score": 1315,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lets go. Fuck scotus… dogs.",
                "author": "covid-6969"
            },
            {
                "raw_content": "Based. Fuck everybody but us",
                "author": "EDDIT_IS_CUCKED"
            },
            {
                "raw_content": "I have altered the deal, pray I don't alter it any further",
                "author": "PapaPepe"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "So you're telling me...",
        "score": 1272,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There it is! Illegal foreigners DO vote!",
                "author": "BenDoverAssho"
            },
            {
                "raw_content": "",
                "author": ""
            },
            {
                "raw_content": "Tell us illegals are voting without telling us illegals are voting.",
                "author": "Keiichi81"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "YES, YES, NO. Justice isn’t blind.",
        "score": 535,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He votes whatever way it takes to keep the pictures private.",
                "author": "HawkDriverMN"
            },
            {
                "raw_content": "The Obamacare one is completely insane. He took a statute which was passed on the basis of it not being a tax. The counsel for the government didn't claim it was a tax. And yet he invented the idea that it was a tax in order to find some reason to rule for it.",
                "author": "keeman"
            },
            {
                "raw_content": "Link https://x.com/themagaking/status/2025189085191573611?s=20",
                "author": "I-am-Orlando"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Percentage of 30 Year Olds Married & Own Home",
        "score": 986,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“The kids these days are just lazy”",
                "author": "wharfthrowaway"
            },
            {
                "raw_content": "Yeah, our society is dying. Our best days are behind us, in all respects.",
                "author": "stealthboy"
            },
            {
                "raw_content": "Not sure what's worse, the cost of homes and mortgage rates or being married. Talk about a double whammy of pain.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "AMD Seemingly Stops Driver Updates for Ryzen Z1 Extreme Processor",
        "score": 215,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I really hope it's a Lenovo-AMD friction issue, and not AMD just dropping support for what's like a 2yo chip or something",
                "author": "Ar0ndight"
            },
            {
                "raw_content": "This ain’t even old, this is completely unacceptable",
                "author": "gusthenewkid"
            },
            {
                "raw_content": ">Finding the \"blame\" is proving to be difficult, as it could be that AMD is not bothering with new updates, or OEMs are not eager to test their specific configurations. Was my biggest gripe with ASUS, they continued to sell Xonar sound cards for years even while not offering them active driver support.",
                "author": "Kougar"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Zen 6 and Nova Lake are probably *not* postponed to 2027",
        "score": 19,
        "text_content": "There are currently reports across the internet that Zen 6 (referring to the desktop version “Olympic Ridge”) and Nova Lake (again referring to the desktop version “NVL-S”) have been postponed until 2027, specifically CES 2027. In my opinion, these are misunderstandings and hasty assumptions. The basis for these reports is very weak in each case. In the case of **Zen 6**, the original source ([BenchLife](https://benchlife.info/amd-zen-6-olympic-ridge-might-offer-12-cores-chiplet-as-24-cores-cpu-options/)) does not report a postponement at all. Rather, BenchLife mentions the Zen 6 date “2027” without further comment or explicit emphasis in a report on the core configurations of Zen 6. This is simply a different opinion on the launch date of Zen 6, but not a report of a postponement. A report about an actual postponement of Zen 6 should always be worth an explicit article from the original source. This has not happened; articles about postponements are exclusively interpretations by this source (BenchLife) or simply rewrites of other articles. In the case of **Nova Lake**, it should be noted that CES is Intel's usual launch date for its broad product portfolio. Normally, the non-K models of the desktop portfolio and the complete mobile portfolio would be officially unveiled there. The K models of the desktop portfolio, on the other hand, would normally be launched in late fall of the previous year (i.e., 2026). Under certain circumstances, all statements from “NVL-S at CES 2027” may therefore only refer to the usual procedure – presentation of the broad portfolio at CES 2027. This does not mean that the K models will also only be launched at CES 2027, so this remains open. Until there is clear confirmation that this also refers to the K models, the matter remains open. However, it is not particularly likely that Intel will be unable to launch the K models in late fall 2026 if the broad portfolio is coming to CES 2027 anyway. This does not mean that postponements are not possible. However, the available evidence is currently too weak to be certain about this. Source: adapted from [3DCenter.org](https://www.3dcenter.org/news/news-des-20-februar-2026) (aka my website)",
        "comments": [
            {
                "raw_content": "Literally who cares? It's a few months difference. If I were in the market for either of these product lines, I would prefer them to release when they're ready than get rushed out the door with a bunch of bugs for the sake of a few months.",
                "author": "Acrobatic_Fee_6974"
            },
            {
                "raw_content": "With DDR5 prices more expensive than the actual CPU/motherboard combined I couldn’t care less about Zen 6.",
                "author": "Left-Leopard-3653"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel \"Nova Lake-S\" Coming in 2027, CES Launch Alongside AMD \"Olympic Ridge\" Likely",
        "score": 39,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> who say that a CES 2027 launch seems likely for both new CPU generations. I mean, if Nova lake launches in late 2026, Intel would still 100% use CES to promote Nova lake again.",
                "author": "EmptyVolition242"
            },
            {
                "raw_content": "I find it hard to believe that Intel wouldn't launch at least the -K series of NVL by the end of 2026, especially since not doing so would mean that they didn't meet investor promises. They have already announced, multiple times, that NVL will be out this year.",
                "author": "Geddagod"
            },
            {
                "raw_content": "If the price tiers don't shift, this actually seems to be a pretty hefty boost in multi-core performance per tier.",
                "author": "steve09089"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "surprising Intel RST benchmarks",
        "score": 4,
        "text_content": "I thought folks here might be interested in some surprising (to me) benchmark results I got when I tried disabling Intel RST in the BIOS of two PCs today. **The tl;dr is: one got faster with RST turned off, but the other got slower!** One is my desktop, an Alienware Aurora R15 with a Core i9-13900KF. It has an OEM SK Hynix PC801 and a Samsung 980 PRO that I added, both 2TB. The other is my laptop, also an Alienware, x16 R2 with a Core 9 Ultra 185H. It has an OEM WD SN740 and a Samsung 990 EVO Plus that I added, both 1TB. Neither has ever been running in RAID; RST was enabled from the factory, and I was too lazy to change it and fuss with Windows complaining about it. I kind of assumed they'd be faster with RST off, but that the difference would be negligible. In both cases, sequential throughput didn't really change. All the differences there were within what I'd consider measurement error. Random throughput and the associated IOPS, though.... On the desktop, random reads jumped over 50% with RST turned off! |random reads|RST on |RST off| |:-|:-|:-| |PC801 throughput|992 MB/s|1574 MB/s| |PC801 IOPS|242k|384k| |980PRO throughput|1014 MB/s|1650 MB/s| |980PRO IOPS|248k|403k| Meanwhile, on the laptop, it's the random *write* numbers that were most affected, and in the opposite direction: performance was *halved* with RST turned off! |random writes|RST on |RST off| |:-|:-|:-| |SN740 throughput|1851 MB/s|914 MB/s| |SN740 IOPS|428k|223k| |990EVO+ throughput|1897 MB/s|914 MB/s| |990EVO+ IOPS|443k|223k| A little bit of a caveat: for the desktop the \"RST on\" numbers are old. They're from when I first got the PC and first installed the 2nd SSD. That said, I wouldn't expect the SSD itself to get *faster* over time - in fact I just learned the PC801 is suffering from a known bug that's killing its sequential write speed. For the laptop, though, I of course went and turned it on again and retested, so these are same-day numbers. I honestly couldn't guess about the why, except maybe Intel has improved the RST implementation over the processor generations. One thing that does jump out at me is that the slower numbers (RST on for the desktop, RST off for the laptop) are nearly identical (exactly identical on the laptop!) while the faster numbers show a bit more variance, even if they're not hugely different. That sounds like a bottleneck to me. Beyond that, though, I don't have much of a guess.",
        "comments": [
            {
                "raw_content": "Always worth double-checking your RAM is seated properly first before anything else. Catches more people than you'd think.",
                "author": "Glittering_Ladder656"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Happy 40th Anniversary to a truly special franchise",
        "score": 3343,
        "text_content": "Happy 40th to my all time favourite franchise. The Legend Of Zelda 🥳",
        "comments": [
            {
                "raw_content": "I hope they bring back the Symphony of the Goddess concerts.",
                "author": "Hayterfan"
            },
            {
                "raw_content": "The greatest…",
                "author": "G_litchR_unner"
            },
            {
                "raw_content": "Honestly it’s just shocking they haven’t even mentioned it, let alone announce anything",
                "author": "jupiterjaguar"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "With RE 7, 8, and 9 releasing on Switch 2, I desperately need the REmake games on the platform",
        "score": 314,
        "text_content": "I feel like we should see these games on here soon enough.",
        "comments": [
            {
                "raw_content": "Time for RE4R to come home.",
                "author": "newcanadianjuice"
            },
            {
                "raw_content": "The rumor is that re2, 3 and 4 remake going to be released this year as well",
                "author": "xtoc1981"
            },
            {
                "raw_content": "It’s Capcom. They port everything. I’m sure they will come.",
                "author": "terran1212"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "DQ7 Reimagined truly looks wonderful on Nintendo Switch 2",
        "score": 294,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It is superb, I’m in love with this art style. The cutscenes are truly fantastic.",
                "author": "Diligent-Coat8096"
            },
            {
                "raw_content": "As soon as it goes on sale, I’m getting it.",
                "author": "Mild-Ghost"
            },
            {
                "raw_content": "Looks like a really good example of a game that isn't \"realistic\" but still looks fantastic and takes advantage of the NS2's extra processing power.",
                "author": "jessej421"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Something I don't like about Nintendo these days...",
        "score": 326,
        "text_content": "Look I love my Switch 2 and generally I really like Nintendo as a company but... Why are they charging $70 for Mario Tennis Fever when they clearly have been cutting corners on that game with reusing so many assets and the exact animations from the previous game Aces? It feels like a hack job, rushed and greedy to charge a full price for it on top. Hopefully we won't see more such examples on their IP's in the coming year, would be a let down.",
        "comments": [
            {
                "raw_content": "I'll get my popcorn",
                "author": "Alarmed-Shopping1592"
            },
            {
                "raw_content": "I’ve got no opinion about Mario Tennis so please, don’t take this to be about that game, but: Reusing assets from previous games is fine. Good even! Why fix what isn’t broken. Majora’s Mask, Fallout New Vegas, couple of the Batman Arkham games, and even Tears of the Kingdom all reuse assets. Not inherently bad to do that.",
                "author": "ChiltonGains"
            },
            {
                "raw_content": "I get the complaints about high prices for many games but there's reused assets in a shit load of games. It's extremely common and is a complete non-issue.",
                "author": "TheGreatTao"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "As someone experiencing FFVII for the first time with Remake, I'm so pleased to finally get to know these iconic characters. Already can hardly wait for Rebirth!",
        "score": 16,
        "text_content": "One of the biggest reasons I wanted to play this was just to experience one of the most famous stories in video games for myself. Of course, I expected to enjoy the game, but to be honest, I wasn't totally sure I'd *love* it - it just felt like one of those things everyone should play at least once. However, I've actually been extremely pleasantly susprised by *how much* I've enjoyed both the gameplay and getting to know these characters. I wasn't sold on either of the above at first, but I'm in the final stretch now and feel like things have really come into their own. And it's not just the bigger, more dramatic story beats, it's the goofiness and often awkwardness that makes things too. Somewhat relatedly, something I've found kind of fascinating is how uneven this game is for a big AAA experience. And I don't necessarily consider that a minus point. This isn't *as* polished as I was expecting, but that's kind of cool - you get to feel a bit more of what and who's behind it that way and it gives the game a more human feeling. I remember at the time it was considered quite controversial Squenix were splitting this up into three games, but that decision surely must be considered justified now. The fact Remake is simultaneously almost a prologue to a much grander world and narrative while also being so epic in its own right is truly impressive, and I actually really like how for this first game you're entirely constrained within one city as I'm sure it's going to make Rebirth feel like such a different thing. Also, if Rebirth really is, as the consensus seems to be, even better than this, then roll on 3rd June! (Although I've still got INTERmission to get to first.)",
        "comments": [
            {
                "raw_content": "Characters are even better in Rebirth, trust me. You’ll get to know and play almost every party members in this game. Relationship between them is one of the strenght of the sequel. Battle system will be expanded aswell with synergy abilities. You can experience that for a little bit in Intermission / Yuffie DLC. FF7R is impossible to make in one game. Too many cutscenes, locations, characters, quests. Yeah, some people will say « they could have cut some parts of each game, and make it a one title only », but personally, i’m glad to experience all of this.",
                "author": "Sparko15"
            },
            {
                "raw_content": "Don't let the final fantasy fans on reddit hear you say that They'll say you played the game wrong and that you need to play a game from 1997 bc u somehow ruined the entire series for yourself.",
                "author": "Dangerous-Pumpkin960"
            },
            {
                "raw_content": "Dude wait til you try 60 fps. This a recipe for eyestrain",
                "author": "The_Zura"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "PSA: Secure Your Nintendo Account With Two-Factor Authentication",
        "score": 85,
        "text_content": "I've been seeing an uptick in other Switch subs regarding accounts being hacked and the panic that ensues the first time you see another device show up on your Nintendo account. Please take a moment, protect your investment, and enable 2FA (Two-Factor Authentication) on your Nintendo account! https://en-americas-support.nintendo.com/app/answers/detail/a_id/27496/~/how-to-set-up-2-step-verification-for-a-nintendo-account I, personally, use Proton Pass for my passwords and 2FA codes. I've also used Authy for several years. Both (I believe) are multiplatform on iOS and Android and are good options I can attest to. The benefit is if you change phones you can take your 2FA codes with you instead of having to use your emergency passcode to get into the account and change the 2FA token out. It's worth the few minutes it'll take to set up, and you won't have to worry about whether someone will one day hack your account and all of your eShop purchases. Game on, friends!",
        "comments": [
            {
                "raw_content": "Nintendo also supports passkeys! https://accounts.nintendo.com/passkey",
                "author": "Status-Temporary"
            },
            {
                "raw_content": "Also, I recommend not leaving your credit card information saved on the eshop. I know it's annoying af to keep putting the info everytime you gonna buy something, but better safe than sorry. Especially if you constantly take your Switch outdoors.",
                "author": "kahabraham"
            },
            {
                "raw_content": "Bitwarden",
                "author": "ProfMap"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Does anyone know how to remove oil stains from a button?",
        "score": 65,
        "text_content": "I hate that it’s smooth to the touch now. But it’s manageable. I was wondering if there is a way to remove the oil from the A and B buttons?",
        "comments": [
            {
                "raw_content": "Its likely not oil, its the surface coating worn down from your fingers sliding over them",
                "author": "kaydeejay1995"
            },
            {
                "raw_content": "A soft cloth very lightly dampened by a mix of water and dish soap.",
                "author": "IllustratorOpening99"
            },
            {
                "raw_content": "This is the result of ABS interacting with Skin-Oil and changing its outer appearence. You cant remove this btw, but fret not, this is 100% normal, and every matte joycon will look like this in 2-5 years. Some people have more greasy hands others less. Do NOT use rubbing alcohol. Isopropyl alcohol has the opposite effect. It will make your joycon over prolonged use even shinier. You have to live with it. But this is completely normal",
                "author": "Round_Musical"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Resident Evil Requiem Is Already Selling Well On The Switch 2",
        "score": 119,
        "text_content": "I just checked the eShop best sellers in the USA and this game has three different editions in the top 10. The generation pack which includes 7 and 8 is at #2 (I bought this one) The standard edition is at #4 The deluxe edition is at #9. Game is out next week, but these numbers are pretty good so far.",
        "comments": [
            {
                "raw_content": "It's the first big AAA 3rd party simultaneous release It's a big deal",
                "author": "KMoosetoe"
            },
            {
                "raw_content": "I got the generation pack too",
                "author": "lingering-will-6"
            },
            {
                "raw_content": "It’s kinda crazy this is actually happening. Definitely one of the best franchises in the world.",
                "author": "RickDeckard31"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Information on next Tales of series game could be on the horizon.",
        "score": 70,
        "text_content": "Anime studio Ufotable, famed for Demon Slayers and Fate/stay night animation and films has announced a project related to the Tales of games for the 30th anniversary of the series in a video about their upcoming products. Source: [Video announcement](https://youtu.be/GDHMrGcOxA8?t=119) The studio previously worked on the promotional videos, opening and ending animations and in game cutscenes of many Tales of titles such as Symphonia, Berseria, and most recently Arise. More information will be announced on April 3rd. The new Tales of game announcement could be coming soon, in 2026. (does not mean a 2026 launch)",
        "comments": [
            {
                "raw_content": "I had no idea Ufotable did that stuff for tales, huh the more you know",
                "author": "LuigiWarrior"
            },
            {
                "raw_content": "The teaser was definitely for anime, which is in work, next to Demon Slayer Final Act and Genshin anime. But, I think new Tales game is definitely in the work, next to Remaster or Remake of some older titles. They already confirmed that last year.",
                "author": "MeCritic"
            },
            {
                "raw_content": "More likely for an anime show than a game",
                "author": "czarchasm4532"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Linux 7.0 lands more AMDGPU fixes for old Radeon hardware",
        "score": 34,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And GCN lives on, amazing.",
                "author": "Accomplished-Camp193"
            },
            {
                "raw_content": "Hey OP — /r/AMD is in manual approval mode, this means **all submissions are automatically removed and must first be approved before they are visible to others**. This is done to prevent spam, scams, excessive self-promotion and other rule-breaking posts. Your post will be approved, provided it follows the subreddit [rules](https://www.reddit.com/r/Amd/about/rules/). **Posts regarding purchase advice, PC build questions or technical support will not be approved.** If you are looking for purchasing advice, have a PC build question or technical support problem, please visit the [Q1 2026, PC Build Questions, Purchase Advice and Technical Support Megathread](https://www.reddit.com/r/Amd/comments/1q1efc5/pc_build_questions_purchase_advice_and_technical/). *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Amd) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Seemingly Stops Driver Updates for Ryzen Z1 Extreme Processor",
        "score": 1,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Lenovo reportedly ends driver updates for Legion Go based on Ryzen Z1 Extreme",
        "score": 1,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "Were We Wrong About Ryzen's Best Feature?",
        "score": 0,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Steve very briefly alluded to something that I want to bring up because I think some people have really short memories, and this certain something really bothered me. AMD initially did not want and did not allow Ryzen 5000 series cpus to work on the 300 series chipset AM4 boards. A lot of people praise AMD for the AM4 platform, but I do not think this is really deserved. AMD has to release a bios \"blob\" to the motherboard manufacturers, who use that to make bios updates for their boards. When Ryzen 5000 cpus were released they would not work on the A320, B350, and X570 boards. BIOS updates for those did not exist, and it was AMd's fault. AMD was giving the most loyal customers of theirs, the early Ryzen adopters, a big middle finger. They wanted people to upgrade motherboards instead. Ryzen 5950X review from HUB was on Nov 5, 2020 [https://www.youtube.com/watch?v=zsfvRw74h30](https://www.youtube.com/watch?v=zsfvRw74h30) BIOS updates for the 300 series chipsets was announced in March of 2022 and started being available in May 2022. [https://www.techpowerup.com/292955/amd-brings-official-ryzen-5000-support-to-300-series-chipset-motherboards-circa-2016](https://www.techpowerup.com/292955/amd-brings-official-ryzen-5000-support-to-300-series-chipset-motherboards-circa-2016) That was a huge gap in time. Was it really a technical issue? I don't think it was. AMD wanted people to upgrade boards, like what Intel does. I think AMD's reversal of their initial decision was not done out of the goodness of their hearts. The people who had 300 series chipset boards who wanted a cpu upgrade had to upgrade their board. If you had to upgrade your board, why not consider all possibilities, as in why not also consider Intel? LGA 1700 cpus were faster for gaming, so why not get one of those? I think AMD realized people were jumping ship to Intel so they finally released the bios update to manufacturers. The point is that they were not trying to do the right thing for their customers. In my opinion they don't deserve so much credit for the long lifespan of the platform as everyone gives them.",
                "author": "farmkid71"
            },
            {
                "raw_content": "It's nice, but if you bought a 1700x over an 8700k, you've just spent years with some of the worst performance possible.",
                "author": "The_Zura"
            },
            {
                "raw_content": "Soo, this is just \"Grrr AMD, everyone raise your pitchforks\" video, without admitting the reason why AM5 wont last long. PCIe. AMD admitted when they first released AM5, they didn't see the rise of NVME being important. AM5 only supports 24 PCIe lanes maximum. Thats 1 GPU and 1 NVME drive and the motherboard normally takes 4 lanes for its own useless gimmick and your done. Thats it, no more expansion. Diddly Squat. AM6 will focus on expandability again. With PCIe 6 just around the corner as well as DDR6, for AMD to support those, they will need the create new socket. Also rumours of a PCIe x32 slot going to exist. Clueless idiots feel free to comment below.",
                "author": "DrWhatNoName"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Rent price transparency",
        "score": 6,
        "text_content": "Hi everyone, Need some advice. Trying to negotiate rent and I can’t find any transparency website or resource to compare and research so I can use it as a baseline. How do you approach it? Am i missing anything?",
        "comments": [
            {
                "raw_content": "I’d just look at previous listings on Streeteasy/apartments.com",
                "author": "Meme_Pope"
            },
            {
                "raw_content": "Call nearby similar apartments (or check their websites) and get their asking rent for comparison.",
                "author": "pdoherty972"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "We built a site that aggregates home sales by US zipcode",
        "score": 3,
        "text_content": "[https://trendyzip.com/access-code/feb-21-2026](https://trendyzip.com/access-code/feb-21-2026) Hi all, we understand this community is full of market speculators. We understand that each housing market is different and therefore we built a site that computes and charts the trend. We completely understand that this data is a/v everywhere but may not be presented as such. Anyhow, happy weekend.",
        "comments": [
            {
                "raw_content": "Is this meaningfully different from the Pillr app, or are you guys rebranding?",
                "author": "ImperfectDrug"
            },
            {
                "raw_content": "Or there is: https://www.reventure.app/",
                "author": "mrktcrash"
            },
            {
                "raw_content": "Link doesn't work.",
                "author": "Gr1009"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "21 February 2026 - Weekly /r/REBubble Discussion",
        "score": 1,
        "text_content": "What's the word on the street? Share your questions, comments, and concerns below.",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Tax refunds jump 14% over last year",
        "score": 0,
        "text_content": "A higher tax refund can help thousands of first-time homebuyers have enough to make the down payment on their dream home.",
        "comments": [
            {
                "raw_content": "It can also help people buy cars, wagyu steaks, golden retriever puppies, iPhones, jewelry and anything else you can buy with dollars",
                "author": "LatiBerg"
            },
            {
                "raw_content": "This has got to be a bot account, right?",
                "author": "Bigdaddyblackdick"
            },
            {
                "raw_content": "This was posted less than a day ago",
                "author": "DumpingAI"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "SAM ALTMAN: “People talk about how much energy it takes to train an AI model … But it also takes a lot of energy to train a human. It takes like 20 years of life and all of the food you eat during that time before you get smart.”",
        "score": 3194,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm closing in on 40 years of eating and I'm still not all that smart.",
                "author": "-Rehsinup-"
            },
            {
                "raw_content": "\"So my point is, we need to get rid of the humans\".. lol",
                "author": "djamp42"
            },
            {
                "raw_content": "All that time is completely wasted not providing value to the shareholders.",
                "author": "imjustbeingreal0"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Demis Hassabis: “The kind of test I would be looking for is training an AI system with a knowledge cutoff of, say, 1911, and then seeing if it could come up with general relativity, like Einstein did in 1915. That’s the kind of test I think is a true test of whether we have a full AGI system”",
        "score": 1811,
        "text_content": "https://youtu.be/v8hPUYnMxCQ?si=hPyxkN73TLITqR\\_D",
        "comments": [
            {
                "raw_content": "ChatGPT 1911 be like….. A trip on the Titanic sounds like a great idea.",
                "author": "Federal_Necessary186"
            },
            {
                "raw_content": "There's a really shocking amount of pre-internet books and text that has never been digitized, because digitizing it is time consuming, sometimes still copyright prohibitive and expensive to do at scale. Open source things like Project Gutenberg have done some work on this but they've only been able to touched a tiny fraction of the books that are out there and don't have their text available online.",
                "author": "WrathPie"
            },
            {
                "raw_content": "Heh. I genuinely wonder how that goes. Like, OK. You trained a model with knowledge up to 1915... What does that data set look like? Does it include spatial data? Einstein lived a whole life up until he came up with General Relativity. Then, how do you goad a model into coming up with it? Do you put it into a situation where it's a problem statement away from needing to derive it?",
                "author": "Putrumpador"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "that's how it feels \"living with robots\"",
        "score": 276,
        "text_content": "New videos postet by Brett Adcock. For me it doesn't matter if its staged or not. Watching it gives me the feeling how it must be living with robots, integrated in our daily live. imagine walking down the street passing by robots left and right, amazing.",
        "comments": [
            {
                "raw_content": "After watching the Unitree and Boston Dynamics robots doing athletic feats, the robots in the video feel like being in an elderly home for robots lmao",
                "author": "Arcosim"
            },
            {
                "raw_content": "Can you imagine coming to work and having your morning coffee at that bar and casually a robot comes and starts chatting with you.",
                "author": "Light-of-Nebula"
            },
            {
                "raw_content": "I don't know why but i can see people destroying these in the streets. lol",
                "author": "arckeid"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "dont miss out on the future guys",
        "score": 1227,
        "text_content": "",
        "comments": [
            {
                "raw_content": "the AI cant find the barbershop you wanted, so it starts a mlm to raise money and buy an old barbershop, it then posts wanted positions on all the job sites for barbers needed now, you then get an email telling you its been booked for next Tuesday from your AI.",
                "author": "Background-Ad-5398"
            },
            {
                "raw_content": "I've spent all day trying to get openclaw running, and it's been the biggest pain in the ass. It has zero memory. It'll ask me a question and I'll say \"yes please, do what you just said\", and it'll say \"do what? Your message doesn't contain any context as to what I am to do\". MF you just told me!",
                "author": "ArgonWilde"
            },
            {
                "raw_content": "The barbershop was closed so my AI bought the store so it could open it. It knows I travel to random places so then it turned the barbershop into a multinational corporation with over 50,000 locations so there would always be a barbershop anywhere I go.",
                "author": "yaosio"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Audio/visual art project made with Gemini 3.1 Pro",
        "score": 192,
        "text_content": "",
        "comments": [
            {
                "raw_content": "absolutely love this",
                "author": "nugbuzzed"
            },
            {
                "raw_content": "Sorry but this is incredible.",
                "author": "StanfordV"
            },
            {
                "raw_content": "Put this up somewhere, OP. I want to play with it!",
                "author": "Recoil42"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI is messing with a Pro Lite plan which costs $100",
        "score": 62,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Now if only they introduced a $50 plan. I'd be on that immediately",
                "author": "Just_Stretch5492"
            },
            {
                "raw_content": "I don't know if I would sign up for it but I do know this: $200 is such a big jump from $20, that I find that hard to justify. I have always wanted a tier less than $200, but more than $20 to at least consider.",
                "author": "SkyHookofKsp"
            },
            {
                "raw_content": "$100 is still a lot. I'd subscribe to a $50 plan, though",
                "author": "exordin26"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Have we ever seen a consumer tech this sticky?",
        "score": 75,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That memory feature hooked a lot of users.",
                "author": "squired"
            },
            {
                "raw_content": "I think more and more people are discovering that they can be helpful as a tool when applied in the right ways",
                "author": "Leather_Area_2301"
            },
            {
                "raw_content": "What's even more interesting is that the retention stabilizes after about 2-3 months of usage. This means that as users learn to use AI, they continue to use it because they now realize how to actually use the tool. Interesting. This is a good data point when considering AI adoption in things like enterprise.",
                "author": "Izento"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Interesting benchmark drop from the ByteDance seed release",
        "score": 9,
        "text_content": "From their [evaluations](https://seed.bytedance.com/en/seed2), gpt-5.2-high seems to have a Codeforces elo of 3148. I have not seen GPT models benchmarked on codeforces until this post, so seems that they ran it on their own. This seems relevant as just a few days ago Google released Gemini 3 Deepthink with a record 3455 elo. I'm wondering if gpt-5.3-xhigh will even surpass this limit. A 300-400 elo improvement between versions is not unrealistic.",
        "comments": [
            {
                "raw_content": "IIRC didn't OpenAI say their internal model as of... February 2025 was around rank 50 in Codeforces? Which was like 3050 a year ago. They used to benchmark their models on Codeforces, wonder why they stopped. Cause they were all like, o3 is rank 175 in the world omg Note IIRC Gemini 3 DeepThink V2 is actually running Gemini 3.1 Pro per Logan, and the correct comparison should be against GPT 5.2 Pro (maybe 5.3 Pro soon?) rather than GPT 5.2 High (not even xHigh, not Codex 5.3 either)",
                "author": "FateOfMuffins"
            },
            {
                "raw_content": "It’s insane that some humans are still better at programmings than these things ngl",
                "author": "EmbarrassedRing7806"
            },
            {
                "raw_content": "codeforces or competitive programming in general is more about logic and high abstract thinking, and less about programming syntax... top people on codeforces are around 3600s... the hype from last year faded pretty quickly. the models are great at programming in general, but still not at the same level as best humans in terms of extreme logical problem solving...",
                "author": "rotelearning"
            }
        ],
        "subreddit": "singularity"
    }
]