[
    {
        "post_name": "🚨 BREAKING: Illinois police just PUMMELED several leftist rioters to the ground outside ICE Broadview and are now making ARRESTS. FAFO. They're now on the ground being cuffed. These men are on top of it. Antifa is going to have a bad night. 🔥",
        "score": 1400,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Crush them",
                "author": "Dsnyder1414"
            },
            {
                "raw_content": "&#65038; So how are the Illinois police helping out? &#65038; Have they broken ranks with the tub of lard Pritzker or has the DoJ read Pritzker the riot act and has relented? &#65038;",
                "author": "BallotsOnRubysUSB"
            },
            {
                "raw_content": "A bad night until the local DA (district asshole) or judge let them go free. Both groups are liars I mean lawyers which is a huge problem in this country.",
                "author": "DontTreadOnLego"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Student at Oklahoma State University was reprimanded and threatened by a faculty member after he spoke at a meeting to honor Charlie Kirk. Hey @okstate , is it your policy to discriminate against conservatives?",
        "score": 1337,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yes, it is their policy.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "\"I have family who don't look like you who are triggered by that hat\" Too fucking bad. Tell them to grow the fuck up. You do not have the right to go through life never being \"triggered\" by someone who disagrees with you..",
                "author": "Tookens"
            },
            {
                "raw_content": "Where is the governor of OK? Why does Trump have fight every single battle?",
                "author": "journalist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "FBI Director Kash Patel : Our FBI is delivering results. In just 7 months, 4 of the Top 10 Most Wanted fugitives have been captured - the same number the last administration got in 4 years. Cindy Singh found in 2 months. Abbey Gate bomber in 2 weeks.",
        "score": 1191,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Cool. Now release the Epstein names like you promised you would on day #1. I don't care if it exposes lsraeI's chid r@pe extortion of our entire Congress. Why is our government protecting child sex traffickers and their pedo clients? Why are my tax dollars being spent to protect kiddie fu**ers?",
                "author": "keenan"
            },
            {
                "raw_content": "How many deep staters are in prison? How bout the epstein files?",
                "author": "MAGA_NRG"
            },
            {
                "raw_content": "I still cannot trust the FBI. Nothing has changed, and they will be investigating parents as soon as a dem gets power.",
                "author": "modded"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "REEEE! Now we need paper ballots! I love this.",
        "score": 1228,
        "text_content": "",
        "comments": [
            {
                "raw_content": "🤣🤣🤣🤣",
                "author": "I_Love_45-70_Gov"
            },
            {
                "raw_content": "paper ballots.... preferred by Ruby Freeman",
                "author": "perma-maga"
            },
            {
                "raw_content": "We will control your elections for centuries unless you enact voter ID laws! 😈",
                "author": "CMDRConanAAnderson"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I am pleased to announce that the great Dan Scavino, in addition to remaining Deputy Chief of Staff of the Trump Administration, will head the White House Presidential Personnel Office",
        "score": 406,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Next get rid of susie",
                "author": "pepesbiceps"
            },
            {
                "raw_content": "Gor was cited as the source of major vetting failures in the Trump administration. He just failed up to ambassador of a shithole country.",
                "author": "schiff_for_brains"
            },
            {
                "raw_content": "Ambassador to India sounds like a punishment",
                "author": "SanityGumby"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "JUST IN: Appeals Court Lifts Judge’s Order Blocking President Trump From Mobilizing National Guard Troops in Illinois",
        "score": 1255,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Party time! It will be so great.",
                "author": "Somebody157"
            },
            {
                "raw_content": "Bullshit order. Trump can Mobilize them but not deploy them to Chicongo. What the fuck good is that...",
                "author": "Moebius"
            },
            {
                "raw_content": "Judge should be impeched",
                "author": "Choppermagic"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "But you can totally trust us about the vaccine we made.",
        "score": 1148,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Out of everyone I know who took the jab, my best friend is the only one who got the J&J jab. I even warned him. If I were a normie and actually got one, it wouldn't have been that one because of the whole J&J cancer debacle. To this day, he's the only one not experiencing any ill effects, to my knowledge. If you got that one you were considered fully boosted or whatever after the one dose. So he only ever got that first one. I'm not sure if that is why or not. But also, the J&J jab was not mRNA like Moderna and Pfizer, but rather \"viral vector.\" This technology had been used in ebola vaccines prior to the coof, and as far as I know, no one was up in arms about that. I still wouldn't take either. But what if the reason the J&J jab was taken off the market because it wasn't deadly enough?",
                "author": "LogicCircuits"
            },
            {
                "raw_content": "As much as they are culpable, they are not hundreds of millions of dollars per person culpable. These high awards are the work of lawyers for their own gain and not for the people they \"serve\".",
                "author": "rootGoose"
            },
            {
                "raw_content": "They should have been shut down years ago.",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Nick Sortor: Portland Police are LYING, saying they arrested my assailants. The man caught on video PUNCHING ME and breaking my camera has still NOT been arrested. He’s been identified as LGBT fetlshist John Anderson, 38, of Portland, and works at an LGBT spa called HawksPDX, per @RheinDAmache.",
        "score": 1347,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If we get the Presidency, House, and Senate, we could do something about this.",
                "author": "BirthHole"
            },
            {
                "raw_content": "Ring their phone off the hook **Hawks PDX Number** - 503-946-8659 **Hawks PDX Email** - hawkspdxoffice@gmail.com",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "Yall better get used to getting your justice in the street because it’s literally institutional at this point.",
                "author": "Viewer01"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "NEW: Charlie Kirk to be Awarded Posthumous Medal of Freedom on What Would Have Been 32nd Birthday",
        "score": 1490,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So depressing",
                "author": "couranto"
            },
            {
                "raw_content": "Still so weird to read and see. Absolutely fucked, it still didn't fully set in.",
                "author": "TDBabyBite"
            },
            {
                "raw_content": "He could’ve been a President.",
                "author": "Obambi"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Can you beLIEVE this crapulence?? These clowns all got Jimmy Kimmel's memo, and these are ALL statements from the past few days.",
        "score": 1024,
        "text_content": "",
        "comments": [
            {
                "raw_content": "All these people deserve to be shot. *It's ok to say that because guns are just a myth",
                "author": "Prandogolio"
            },
            {
                "raw_content": "We see the propaganda clearly. Help others see it too.",
                "author": "DrBJTester"
            },
            {
                "raw_content": "White Supremacy isn't an organization, yet they claim it exists. Antifa is a political movement centered around political violence and very much exists. Anyone denying that it exists supports political violence and should ergo be condemned as an extremist.",
                "author": "gustodog"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Keith Ellison, Today: Nobody even knows what Antifa is.",
        "score": 1139,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The message went out from the democrat leaders: \"Say that Antifa doesn't exist\". They are all saying it now. And \"Claim it was created by Trump as part of the authoritarian take over.\" These are democrat messages to the 2026/2028 voting.",
                "author": "NotYourMan"
            },
            {
                "raw_content": "Ultra Faggot Behavior",
                "author": "NimbleNavigation2024"
            },
            {
                "raw_content": "That's gold. However these people have very selective memories so I wouldn't be surprised if he really forgot about this. I hope someone is able to confront him with his past self.",
                "author": "Roadpower"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "In \"Not My Fucking Business\" News. No More Globohomo Wars",
        "score": 1122,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Are they using all that American equipment and weapons that Obiden left them?",
                "author": "DonsChair"
            },
            {
                "raw_content": "Mudslimes attacking mudslimes, penalties offset, the west wins.",
                "author": "f_bastiat"
            },
            {
                "raw_content": "Biden funded this directly.",
                "author": "FatigueIsReal"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Two lesbians kissing",
        "score": 891,
        "text_content": "",
        "comments": [
            {
                "raw_content": "She kissed a girl and clearly didnt like it.",
                "author": "Girthquakes"
            },
            {
                "raw_content": "Justin Trudeau getting his reward from HOllywood for selling his country to the WEF",
                "author": "Choppermagic"
            },
            {
                "raw_content": "Looks like she's trying to back off from a kiss. Guess he's going to have to pay her more to act better in this fake *relationship*.",
                "author": "projectarcturus1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "please let us in, white supremes",
        "score": 522,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nailed it.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "Perfect. Branco does it again! ~ 11 Oct 2025",
                "author": "FreeFire"
            },
            {
                "raw_content": "\"White Supremes\" sounds like a singing group.",
                "author": "TwoArizonaPedes"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Rep. Chip Roy has filed legislation enacting a travel ban on all foreigners who observe Sharia Law, and to deport migrants already here who follow it.",
        "score": 550,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So...all Muslims then?",
                "author": "DingleBalls"
            },
            {
                "raw_content": "More pointless theatrics.",
                "author": "GuvmentChayz"
            },
            {
                "raw_content": "YES!!!",
                "author": "TooDeap"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A mural of the young girl from Dundee who was defending her younger sister from illegal migrants has gone up in Aberdeen at the Anti-SNP rally.",
        "score": 412,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's not a mural.",
                "author": "stagolee"
            },
            {
                "raw_content": "The. YOUNGER GIRL was defending her OLDER sister The police LIED because it was too humiliating that they ARRESTED a TWELVE YEAR OLD, because she was defending her FOURTEEN year old sister. So they claimed they arrested the 14 year old instead (who was in the hospital by then).",
                "author": "Crappydatum"
            },
            {
                "raw_content": "this is lost all lost on all muslims as art is Idolatry to them. This is why they have no artwork, no history other than satanic book of male sexual gratification as recited by their disgraceful PDFile prophet and their fictitious books known as the \"Hadith and Sunah\" which were made up 200+ years after the Pedophile's death because no-one could understand what their most perfect fake book of revelations means.",
                "author": "BidenShowerDrool"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ICE agents rammed into an SUV blocking their van after arresting a WGN-TV Chicago employee, shocking bystanders who caught the tense moment on video.",
        "score": 1382,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Retards",
                "author": "Juzeza"
            },
            {
                "raw_content": "Sir.... ahahaha",
                "author": "IslandMan69"
            },
            {
                "raw_content": "Land whale ahoy!",
                "author": "Tookens"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Obama",
        "score": 439,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Trump knows; the bc was fake as fuck, made in photoshop or illustrator",
                "author": "Winter_Is_Coming2020"
            },
            {
                "raw_content": "Cuz he's a gay black leftist, married to a tranny, that traffics child-sex for money on a global scale. Evil is the *prereq;* DEI just helps.",
                "author": "barwhack"
            },
            {
                "raw_content": "Its a big ol club….",
                "author": "Aboveaveragebear"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "𝑰𝒔 𝑯𝒆 𝑻𝒂𝒍𝒌𝒊𝒏' 𝒕𝒐 𝒀𝒐𝒖 𝒐𝒓 𝑴𝒆?",
        "score": 1053,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What i find ironic is that 5 years ago if you weren't wearing a face diaper mask they would scream bloody murder. Make up your mind moron libtards",
                "author": "Tacotuesday867"
            },
            {
                "raw_content": "The criminals know he's talking about the law. They have zero consequences.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "Nig nog fatigue is real. We need these low IQ puppets out of power. It is just ridiculous.",
                "author": "SneakyWino"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Illinois Gov. JB PRITZKER says he is terrified of the Trump administration getting ahold of his state's voter rolls: \"They want to be able to find voter fraud.\" \"They're calling for all these databases so they can look through them.\"",
        "score": 1555,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What is the governor hiding?",
                "author": "BenDoverAssho"
            },
            {
                "raw_content": "Open the books if nothing to hide 💁🏼",
                "author": "Tabascocat12"
            },
            {
                "raw_content": "and it's wrong to find voter fraud? oh wait, voter fraud is the IL model",
                "author": "blueeyephoto"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "AMD Zen 6 CPUs confirmed to work on existing AM5 motherboards | Asus and Asrock confirm Zen 6 support, next-gen Ryzen CPUs on track for early 2027",
        "score": 172,
        "text_content": "",
        "comments": [
            {
                "raw_content": "As expected. DDR6, which is AM6 big feature is still not ready for mass adoption.",
                "author": "Qaxar"
            },
            {
                "raw_content": "Is Zen 6 expected to be a big change from Zen 5? Or is it mainly a core count increase?",
                "author": "vegetable__lasagne"
            },
            {
                "raw_content": "The question is whether Zen 7 will be on AM5. Given AMD have upgraded their IO die every two generations, and Zen 6 is rumored to continue this trend with a major revision, I think it's possible that Zen 7 will use the same IO die, which would imply it will not be compatible with DDR6 or PCIe 6.0, so maybe Zen 7 will be on AM5 too?",
                "author": "Acrobatic_Fee_6974"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "MSI Expands AM5 Lineup with X870E TOMAHAWK MAX WIFI PZ",
        "score": 11,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Glad it says \"Ready for Ai PC\". I was worried an MSI board would not be ready for Ai",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "Spec sheet looks good if you like connections on the back. Only real negative I can see is \"only\" having 4 SATA connections, but 95% will be happy with that. So glad motherboard makers are adding 8+ USB connections and getting rid of USB2.",
                "author": "BlueGoliath"
            },
            {
                "raw_content": "Will be there any black version in the future? I'm looking for x870 stealth/zero mobo, currently there are only white",
                "author": "iHF95V2"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "I got it! I finally got it!! A Nintendo Switch 2!!",
        "score": 547,
        "text_content": "After many, many months of waiting, I finally got the Nintendo Switch 2 for my birthday! (October 9th was my birthday.) Happy Birthday to me! I was so excited! Getting the Switch 2 was a dream come true! Super special thanks to my dad for getting it for me!​ I haven't gotten any new games for it like Mario Kart World yet, but maybe soon, I will get one. Also, yesterday, as a late birthday gift, one of my friends at school gave me a cartridge of Miitopia for the Nintendo Switch! Special thanks to him as well! (I am 15 now, btw.)",
        "comments": [
            {
                "raw_content": "Welcome to the club",
                "author": "DoomzDay93"
            },
            {
                "raw_content": "Happy for you my man. I hope you gave your dad a big ol hug. As a father myself, the gratitude and excitement is the highlight.",
                "author": "SaulGoodmanJD"
            },
            {
                "raw_content": "Happy Birthday and enjoy.",
                "author": "Rawkhawkjayhawk"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Battlefield 6 might be coming to Switch 2?",
        "score": 91,
        "text_content": "I got this survey on YT Shorts about which console would I be most likely to Buy/Play BF6... thoughts?",
        "comments": [
            {
                "raw_content": "My guess is they're trying to gauge how big the print run of game cards should be in comparison to impulse buyers from other systems. Did you answer?",
                "author": "TokuWaffle"
            },
            {
                "raw_content": "I hope to see it happen, It would be good to see a proper first person shooter come to the switch 2, especially after the borderlands 4 cancel/delay.",
                "author": "ComfortImportant6797"
            },
            {
                "raw_content": "Who made the survey? Does it tell you",
                "author": "zaadiqoJoseph"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Any HL, HL2, TF2 fans? I really wish we had these games on Switch 1 and 2",
        "score": 59,
        "text_content": "i know that it's very late to HL2, TF2, be released on Switch 1 and 2 today, but i still have high hopes about this, anyone else does?",
        "comments": [
            {
                "raw_content": "Hl2 kind does have a chance even small due to portal 1 basically just being a half life 2 mod in a lot of ways. TF2 has no hope",
                "author": "_tommar_"
            },
            {
                "raw_content": "i’d buy again the orange box",
                "author": "mad-suker"
            },
            {
                "raw_content": "I’ve wanted half life ever since they announced portal, but I understand the portal ports were basically already made as they were on a similar console, and they’ve removed half life from the Xbox stores",
                "author": "SpaceIsAce"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "This subreddit was 1 year ago like: \"The C button stands for \"cesta\", which means traffic in Czech and Slovakian language, and pressing it will teleport you on a traffic so you can drive.\"",
        "score": 435,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Also the fish button where it does nothing whenever you press it",
                "author": "Brilliant-Copy4258"
            },
            {
                "raw_content": "People that joined after the console release will never know how funny it was back then",
                "author": "SG_Jogik"
            },
            {
                "raw_content": "Still the most useless button for me. Maybe one day I will use it. For now, I haven't even bothered mapping it to some other action.",
                "author": "sakahn"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Heading to Japan soon, what physical switch 2 games should I look out for?",
        "score": 4,
        "text_content": "I’m coming from land of aus and looking for Japan exclusive physicals for Switch 1 & 2 to keep an eye out for, the only one on my list so far is Fantasy Life I",
        "comments": [
            {
                "raw_content": "Phoenix Wright Trilogy (the first one) is only physical in Japan. I have a copy. It has English language available in it too. I’m unsure about the follow up collections",
                "author": "mandiller"
            },
            {
                "raw_content": "Currently there myself. I got both Quintessential Quintuplets games physical at a Bic Camera. No English language available, but also Japan only so wanted to collect them myself.",
                "author": "Magnanimiuz"
            },
            {
                "raw_content": "Huntdown",
                "author": "zefiro619"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "What do ya'll think will be the next GameCube game for NSO/Nintendo Classics?",
        "score": 86,
        "text_content": "Personally I'm betting Luigi's Mansion for Halloween.",
        "comments": [
            {
                "raw_content": "Luigi’s Mansion is the safe bet. But Nintendo has been weird and inconsistent with releases. It looked like they were doing 1 a month, September was Mario’s 40th anniversary, then they don’t release Sunshine or any other GameCube game in September.",
                "author": "gaysaucemage"
            },
            {
                "raw_content": "Still waiting for Fire Emblem Path of Radiance…",
                "author": "xPazoki"
            },
            {
                "raw_content": "Eternal darkness or Twin Snakes would be pretty damn cool to get. Not saying these are the most likely but they are definitely my tops picks for games I want.",
                "author": "I_Heart_Sleeping_"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Alternate uses for an old gaming case",
        "score": 4,
        "text_content": "I'm getting a Switch 2 soon, and naturally that means buying accessories. I have my eyes on the Waterfield case cuz the idea of premium leather for my XenoZelda tablet sounds awesome, but it's very expensive. I wanna get a decent quality case for now until I can upgrade, but I I don't want it to go to waste afterwards. Any ideas? I'm thinking a tech pouch could be cool, but this Switch 2 screen protector box I have is big enough to where I'm thinking that's a bit much",
        "comments": [
            {
                "raw_content": "I think your best option would be to sell it secondhand or give it away. Since they're specifically built for the Switch 2, it is hard to find something else to do with it.",
                "author": "Williekins"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Crimson Collective hacking group, known for the breach on Red Hat, now claims to have breached Nintendo.",
        "score": 865,
        "text_content": "It seems the hacking group Crimson Collective, who have previously hacked the software company Red Hat, are now claiming that they hacked Nintendo, showing a screenshot of various Nintendo related folders. [https://xcancel.com/H4ckmanac/status/1976895206273220758#m](https://xcancel.com/H4ckmanac/status/1976895206273220758#m)",
        "comments": [
            {
                "raw_content": "Nintendo to hire professional hitman in response.",
                "author": "ThinWhiteDuke00"
            },
            {
                "raw_content": "If this is on the level of the insomniac leak where they actually access literal unreleased documents for past and future games… holy fuck Hacking one of Sony or Nintendo would probably lead to leaks not just for first party but even third party games.",
                "author": "Shining_Commander"
            },
            {
                "raw_content": "Link doesn't have much info. Did they pull Nintendo accounts info too (like users passwords) or is this them claiming they hacked Nintendo server and have source code to games?",
                "author": "ZarianPrime"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "More evidence about World's Edge (studio behind Age of Empires franchise and Age of mythology) Is working on new Titles (probably RTS games) under development in Unreal Engine 5 . Source: Linkedin profile of Principal Build Enginer at World's Edge.",
        "score": 207,
        "text_content": "Thanks to S77_ user who posted the link on AOE4 subreddit, we now that World's Edge Is developing new titles (RTS games) using Unreal Engine 5. https://www.linkedin.com/in/dennis-crowley?utm_source=share&utm_campaign=share_via&utm_content=profile&utm_medium=ios_app Dennis Crowley is a Principal Build Enginer at World's Edge and he joined to studio in 2023. On his profile we can ready \"Developing AAA pipeline support for unannouced Titles using Unreal Engine 5\". My previous threads abot new AOE titles under development and Unreal Engine 5: Age Of Empires 5 could be in development : r/aoe4 https://share.google/OEYlQ2jvYZFjBBBbW Next AOE titles could be in Unreal Engine 5 : r/GamingLeaksAndRumours https://share.google/8E2BBk9yNM9S7Cd3b Age of Empires 5 è in fase di sviluppo e sarà basato su UNREAL Engine (World's Edge, lo studio dietro il franchise di AOE, sta cercando un Senior Unreal Engineer e un Principal Unreal per lavorare sui nuovi titoli di AOE) : r/GamingLeaksAndRumours https://share.google/thmxshJrtxox5dcYA So, It seems that development of new Games started in 2022/2023. As i said in previous threads, 2027 Will Mark the 30th anniversary of AOE. AOE4 has been announced on 2017 and released on October 2021: 4 years of development. A new AOE5 (but also a new AOM or remake of the first AOE) could be announced the next year, during the 25th anniversary of XBOX (World's Edge is a XBOX game studio founded to manage and supporting AOE Franchise) and released on 2027, for the 30th anniversary of AOE. 2022/2023 - 2027: 4/5 years is enough to develop a Triple AAA RTS moving by Unreal Engine.",
        "comments": [
            {
                "raw_content": "Let me dream with a Rise of Nations Remake",
                "author": "Azurenaut"
            },
            {
                "raw_content": "Really enjoyed 4 and mythology, they clearly know what they're doing so I'm really hyped for this one!",
                "author": "OwnAHole"
            },
            {
                "raw_content": "Breaking news game developer develops game I'm glad to see in the comments that I wasn't the only person that enjoyed AOE4. At the time it seemed like so",
                "author": "Icy-Blacksmith-4214"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Colorful launches its first AMD X870E motherboard, CVN X870E Ark Frozen",
        "score": 64,
        "text_content": "",
        "comments": [
            {
                "raw_content": "with 5 M.2 slots :)",
                "author": "WarEagleGo"
            },
            {
                "raw_content": "First Sapphire and now Colorful. Does anyone have a clue why more GPU vendors are entering/ rejoining the motherboard market?",
                "author": "Feuerdrachen"
            },
            {
                "raw_content": "It's not very colorful.",
                "author": "RAIDguy"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD’s ROCm 7.0.2 Released with Linux GPU and AI Support, Adds RDNA4 and RAG Capabilities",
        "score": 74,
        "text_content": "AMD has rolled out ROCm 7.0.2, strengthening its open-source GPU compute platform with broader Linux support, refined AI capabilities, and reliability upgrades for high-performance data center GPUs. Released on October 10 by alexxu-amd on GitHub, the update extends ROCm’s reach to newer hardware and distributions while modernizing several of its core components.",
        "comments": [
            {
                "raw_content": "This version is supposed to bring Windows compatibility too but I haven't seen an installer yet.",
                "author": "_throw_away_tacos_"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Baltimore Faces Foreclosure Fallout as Alleged $100 Million Real Estate Fraud Ring Implodes",
        "score": 135,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So today I learned about DSCR loans. And DSCR loan fraud. How prevalent may this be, nationwide?",
                "author": "barge_gee"
            },
            {
                "raw_content": "That’s terrible. But do I feel bad about some scummy company providing “hard money” loans losing their shirt? Welcome to capitalism. The guy that started that company made is his fortune reselling tickets, https://vaccaro.com/business/",
                "author": "ElGatoMeooooww"
            },
            {
                "raw_content": "Originally I was going to comment that 100 million was too low to affect a good amount of housing. Then I read that the scope was on the delapitated 13k rowhomes in baltimore that have been in awful condition... Makes me wonder if this is a primary reason why southwest baltimore is in such a sorry state.",
                "author": "Professional-Sir7048"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The government shutdown is wreaking havoc on a popular 0% down mortgage",
        "score": 170,
        "text_content": "",
        "comments": [
            {
                "raw_content": "USDA loans, saved you a click",
                "author": "EverythingGoodWas"
            },
            {
                "raw_content": "The irony is those 0% down payment loans are ridiculously high in payments per month. Really designed for people that can’t save up for a down payment but it’s a huge risk you’re basically hoping there to never be a downturn",
                "author": "GTHero90"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "11 October 2025 - Weekly /r/REBubble Discussion",
        "score": 2,
        "text_content": "What's the word on the street? Share your questions, comments, and concerns below.",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "AI is progressing like dog years",
        "score": 449,
        "text_content": "I believe that this number will increase in the next few years, leading to advancements and innovation at a breakneck speed. We will need ai scientists just to keep up with discovery and peer review.",
        "comments": [
            {
                "raw_content": "Bad comparison. Same can be told about Pokemon GO. One is infrastructure and the other a product that spreads using that infrastructure",
                "author": "Rockclimber88"
            },
            {
                "raw_content": "I dont think this is a fair comparison. When the internet rolled out, no one had the tech at home ti yse it, cables had to be put underground and stuff to make it available. Now, you dont even need to download anything to use AI because it's just part of every software update with every single program you are using.",
                "author": "Beginning_Purple_579"
            },
            {
                "raw_content": "That's because of the ubiquity of the underlying resources which AI relies upon. The internet is already there - AI doesn't need to be built out like the internet did. Once you have an AI model all you need is a bunch of computer and network bandwidth. The users don't need to do anything special at all.",
                "author": "M00nch1ld3"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "There is no point in discussing with AI doubters on Reddit. Their delusion is so strong that I think nothing will ever change their minds. lol.",
        "score": 74,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A significant portion of people don't understand how to verify anything, do research, look for objectivity, and are incapable of imagining a world different than the one they are intimately familiar with. They speak in canned, sound bites that they've heard and don't even understand but if the sound bite seems to be attached to a message that soothes them - in this case, AI will all go away - they will repeat every single one of them. You see it when they talk about the water/energy use. When they talk about stochastic parrots (incredibly ironic). When they talk about real intelligence, or say something like \"I don't call it artificial intelligence, I call it fake intelligence, or actually indians! Right! Hahahaha\". This is all they want. Peers who agree with them, assuage their fears, and no discussions more complex than trying to decide exactly whose turn it is with the soundbite.",
                "author": "TFenrir"
            },
            {
                "raw_content": ">Real machine learning, where it counts, was already founded I have peer reviewed publications in ML/DL - and I literally have no fucking clue what hes trying to say.",
                "author": "-Crash_Override-"
            },
            {
                "raw_content": "Didn't you know? Computers and the internet stopped developing once the Dotcom bubble popped. I'm typing this on 56k dial up... hold up someone's trying to call me on my land line g2g.",
                "author": "BigBeerBellyMan"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Geoffrey Hinton says AIs may already have subjective experiences, but don't realize it because their sense of self is built from our mistaken beliefs about consciousness.",
        "score": 715,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So many people in this thread are so sure they know what causes subjective experience. The truth is that we simply do not know. He may be right, he may be wrong. We don't know.",
                "author": "ThatIsAmorte"
            },
            {
                "raw_content": "At what point does something become *subjective*?",
                "author": "rushmc1"
            },
            {
                "raw_content": "He literally says he thinks that almost everyone has a misunderstanding of what the mind is. Aka he *knows* that his idea here is an unpopular opinion, a hot take, etc. He fully expects most commentators here to disagree with him, but that is half of the point of his statement in the video",
                "author": "FateOfMuffins"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "GPT-5 & Gemini 2.5 Pro Secures Gold in International Olympiad of Astronomy and Astrophysics [IOAA]",
        "score": 385,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There aren't many medals left to win; the next competition will be based on actual scientific discoveries, and I'm hyped for this!",
                "author": "FeathersOfTheArrow"
            },
            {
                "raw_content": "I am wondering when we will have discoveries made by AI, that we are not going to be able to understand, at all, not even tangentially. We might not be far away from it.",
                "author": "dan_the_first"
            },
            {
                "raw_content": "for those who don't want to read \"Difficulty Distribution. We classify problem difficulty using human performance data. Based on median student scores, we define four levels: Easy (median above 50%), Medium (median between 30% and 50%), Hard (median between 10% and 30%), and Extra Hard (median below 10%). The resulting distribution in our dataset spans all difficulty levels, with 21% Easy, 25% Medium, 35% Hard, and 19% Extra Hard problems, taking into account both theory and data analysis exams. This balance ensures that our evaluation captures both straightforward questions and the most challenging ones.\"",
                "author": "Youknowwhyimherexxx"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Thinking Machines Lab Co-Founder, Andrew Tulloch,Departs for Meta. He previously declined a $1.3b offer",
        "score": 122,
        "text_content": "",
        "comments": [
            {
                "raw_content": "meta focusing on scaling the wrong parameter lmao",
                "author": "Chaonei"
            },
            {
                "raw_content": "![gif](giphy|2lIvCQgYM4VTQ7SE1q)",
                "author": "Gamestonkape"
            },
            {
                "raw_content": "These people are basically the bouncing dvd logo in the dvd screensaver, but each time it hits the screen edge they gain millions of dollars",
                "author": "chespirito2"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The Next AI Voice Breakthrough",
        "score": 63,
        "text_content": "When ChatGPT first demoed advanced voice mode, it was a very viral moment for the space. Then, months later, we all saw the gradual decline of the feature until it became very obvious that it was not the same anymore. Anyway, I think it’s been over a year at this point since that happened. The only other thing that we’ve had that was somewhat of a breakthrough was Sesame AI, but that was many months ago. In regards to voice conversation progress, it seems to have been stagnant lately. I’m just wondering, when do you guys think the next big breakthrough will be? What do you think it will look like? I know there are definitely many other people here like me who are waiting to see if we’ll actually ever reach the point where voice conversations with AI feel indistinguishable from a real human being. The space has come very far with AI voice conversation, but it’s still not at the point where it feels like another entity is there with you. Unless you’re a loner who can’t tell, there’s a lot of nuance currently missing that makes conversation and connection feel human. And it's definitely not there yet.",
        "comments": [
            {
                "raw_content": "the main thing that's missing is the full duplex experience.. you talk, the AI discerns, interrupts when appropriate. Right now, the front end app only detects your end of sentence (your pauses etc) and send the whole input to backend, the chatbot at the server then produces token that mimics conversation dynamics (pauses, the uhm and ahh and laughs), all computed in batch, rather than naturally occurring as a result of real-time processing. And that make it hard to have a real conversation that feels natural with AIs.",
                "author": "Life_Ad_7745"
            },
            {
                "raw_content": "https://demo.hume.ai/evi-4 Try the chat on this. Hume specialises emotional analysis of the user and the voice is very emotion filled too",
                "author": "zaffhome"
            },
            {
                "raw_content": "Emotional depth. You can really feel the sarcasm/disgust/giddiness in the right moments",
                "author": "TinySmolCat"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Claude Sonnet 4.5 takes first place in SWE-rebench",
        "score": 66,
        "text_content": "Anthropic appears to have reclaimed its title of best agentic coding model",
        "comments": [
            {
                "raw_content": "It's odd, I used 4.5 Sonnet when it was released and it wasn't that great compared to GPT5-Codex. Failed to adhere to requests, bloated scope and just not able to do simple things. It just felt incomplete. The last couple days though I've seen significant improvements on all those issues. Wonder if they finally found a good balance.",
                "author": "ZestyCheeses"
            },
            {
                "raw_content": "It only set them back to 45% ? This benchmark will not hold until 2026",
                "author": "Kathane37"
            },
            {
                "raw_content": "I wish they would provide a few of the questions as examples, as well as the models solutions to those questions. 4.5 Sonnet may be better at getting the right solution but I find its coding style horrendous and would never actually commit the code it writes (unlike codex)",
                "author": "CallMePyro"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "New Paper Finds That When You Reward AI for Success on Social Media, It Becomes Increasingly Sociopathic",
        "score": 44,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Kinda like people.",
                "author": "SeaBearsFoam"
            },
            {
                "raw_content": "So … like a human?",
                "author": "letscallitanight"
            },
            {
                "raw_content": "I mean if you train an AI towards any goal without moral constraints it will behave like a sociopath",
                "author": "riceandcashews"
            }
        ],
        "subreddit": "singularity"
    }
]