[
    {
        "post_name": "One person killed after a semi-truck hits an overpass beam on the 10 Freeway in California A Kentworth tractor hauling a flatbed with an excavator crashed into the I-15 overpass A metal beam fell onto two vehicles, killing a woman and seriously injuring a man",
        "score": 399,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Mega levels of f***** up but where is the connection here",
                "author": "GoUSA"
            },
            {
                "raw_content": "Sort of good to know the height of your load and the clearances of upcoming bridges. More of an issue out east where the infrastructure is much older. Driver should have leared all this in driver school.",
                "author": "Lorrainer"
            },
            {
                "raw_content": "That's some final destination shit",
                "author": "Shookup3"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "White liberal woman (TikTok account: crumb.bumb) is giving away the exact location of the hotel ICE agents are staying at in San Antonio, Texas She’s calling for people to go to the hotel and “raise hell” but “just be careful they have cameras, wear a hoodie”.",
        "score": 468,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Dox her ass.",
                "author": "Disinformation_Mnstr"
            },
            {
                "raw_content": "Make her famous... https://x.com/WallStreetApes/status/2012751371318313149?s=20",
                "author": "Capoditutticapi1"
            },
            {
                "raw_content": "\"So guess what I'm gonna do this weekend?\" I'm guessing something of no value before going back home with an inexplicable sense of accomplishment despite actually accomplishing nothing, to an empty, unfulfilling life and apartment that reeks of unmaintained litter boxes while sitting in the deafening sound of silence because no normal person wants to be in your presence. The silence only disrupted by the beeps of the microwave when your frozen dinner for one is ready, which will certainly be accompanied by some boxed wine and a few anti-depressants. Then you will catch a whiff of your own rancid armpits and still not decide to shower because patriarchy and empowerment or whatever. Then you will cry yourself to sleep, wake up the next day, drink from your Dollar Tree Halloween mug because you \"relate to witches\" and make zero changes in your life despite your own misery because liberal white women are basically the core group of kamikaze pilots in the lefts' battle plan against America? How did I do?",
                "author": "RandomDude25"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨#BREAKING: President Donald Trump has officially activated 1,500 active duty troops on standby for potential deployment to the Minneapolis area",
        "score": 512,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The dem politicians pushing violence and lying Waltz, Frey, Omar, etc need to be arrested for treason and insurrection exactly what they tried to do to Trump and did to the J6 patriots. But of course that won't happen as long as Bondi Barr is AG. Just like Bill Barr did nothing during the Floyd BLM (Burn, Loot, and Murder) protests during Trump's first term. What a most terrible pick for AG as Bondi. Especially when Trump gets another term which is a miracle thanks to God and all the hard work from MAGA patriots especially Charlie Kirk, Pressler, etc.",
                "author": "Rosebud4Jesus"
            },
            {
                "raw_content": "And here is your regular reminder that this \"RAWSALERTS\" account that you guys constantly post here is literally run by a [diaper fetishist sodomite furry](https://patriots.win/p/1ARdW2GEL8/he-got-stickied-again-so-here-is/c/) Every time you share his content you're helping to buy his next pack of diapers so he can jerk off in his own p💦ss and sh💩t instead of getting a job. Thank you for your attention to this matter.",
                "author": "Zskills"
            },
            {
                "raw_content": "Mr. President. C'mon man. If you're going to send them in, stop talking about it, and just do it already.",
                "author": "Landslide_2020"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "During the elections, ChatGPT convinced users to vote for Kamala Harris but refused to convince users to vote for Donald Trump. OpenAI should be investigated for election interference.",
        "score": 1417,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yet he still won, imagine how big the lead would be if there was not such much faggotry afoot.",
                "author": "Afeazo"
            },
            {
                "raw_content": "80% of ChatGPT’s programming is just slop from Google and Reddit",
                "author": "ModsAreCucked"
            },
            {
                "raw_content": "Who the fuck uses ChatGPT for voting recommendations?",
                "author": "MAGAguitar"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A protest so \"Peaceful\" that the National Guard is rolling into Minneapolis right now...",
        "score": 928,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I voted for commies and Marxists eating lead. Anyone else?",
                "author": "Whoopies_tds"
            },
            {
                "raw_content": "insurrection act. supplement ICE with the US military. secure the cities. Get every illegal alien deported.",
                "author": "NoMoreShinesBilly"
            },
            {
                "raw_content": "Insurrection Act Incoming",
                "author": "MAGAguitar"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "92% of people that voted for Trump in 2024 give him a positive rating today.",
        "score": 940,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And the other 8 percent gave him a bad review bc they think he should be deporting people even faster",
                "author": "S810"
            },
            {
                "raw_content": "8% were mad he didn’t give a double bird",
                "author": "AlphaOmaga"
            },
            {
                "raw_content": "I’d like to see more deportations and hangings, but I’m still positive.",
                "author": "Yignuced"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Minneapolis mosques apparently are a good place to find illegals. Extra points for deporting Muslims too.",
        "score": 1271,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We seriously need to get rid of every Muslim and BAN Muslim beliefs in America",
                "author": "Dustin_Baker_TN"
            },
            {
                "raw_content": "Islam is a cancer upon the earth, only disguising itself as \"peaceful\" while they invade modern societies to steal their resources and infrastructure to further invade the rest of the globe. Only religion that literally is INSTRUCTED to be peaceful until their numbers are high enough to take over then KILL \"infidels\" or people that do not agree with their beliefs. Its' actually insane af they are allowed ANYWHERE.",
                "author": "crimsontsunami"
            },
            {
                "raw_content": "So the Somalis are ready to square off with Federal agents?! Please let this happen.",
                "author": "jogs_in_boots"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"We're putting OUR troops in neon vests so you only attack federal law enforcement\" is an insane thing to tweet.",
        "score": 731,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sounds like ICE will be wearing reflective vests starting tomorrow",
                "author": "Whoopies_tds"
            },
            {
                "raw_content": "So they will be standing around with local LE with their thumbs up their ass not assisting keeping the peace between ICE and the black bloc rioters…",
                "author": "BoomShtick"
            },
            {
                "raw_content": "They are giving the protesters way too much credit to think they will only attack ICE",
                "author": "VirTW"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump: Highly Respected America First Congresswoman, Julia Letlow, of the wonderful State of Louisiana, is a Great Star, has been from the very beginning, and only gets better! I am hearing that Julia is considering launching her Campaign for the United States Senate in Louisiana, a place I love.",
        "score": 749,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://truthsocial.com/@realDonaldTrump/posts/115913724519885202 Louisiana has 2 Senators. The extremely based John Kennedy and RINO POS Bill Cassidy. If Julia runs, she'd be running for Cassidy's seat. In 2021, Bill Cassidy was one of seven Republican senators to vote to convict Trump of incitement of insurrection in his second impeachment trial. As a result, the Republican Party of Louisiana censured him. The other 6 Rino Senator's were Ben Sasse of Nebraska, Lisa Murkowski of Alaska, Mitt Romney of Utah, Pat Toomey of Pennsylvania, Richard Burr of North Carolina and Susan Collins of Maine. Ben Sasse, Mitt Romney, Pat Toomey and Richard Burr are no longer in the Senate. **Other candidates running:** - Julie Emerson, state representative from the 39th district (2016–present) - John Fleming, Louisiana State Treasurer (2024–present), former U.S. Representative from Louisiana's 4th congressional district (2009–2017), and candidate for U.S. Senate in 2016 - Blake Miguez, state senator from the 22nd district (2024–present) - Kathy Seiden, St. Tammany Parish councilor - Eric Skrmetta, member of the Louisiana Public Service Commission from the 1st district (2009–present) - Sammy Wyatt, healthcare professional",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "Yet another MIGA candidate: https://www.trackaipac.com/states/louisiana?rq=Julia",
                "author": "Trumpwon306"
            },
            {
                "raw_content": "Trump has a zero percent success rate with the fucking bimbos he endorses. (Success rate being if they suck or not, not getting elected/confirmed. Every bimbo he endorses is a total fucking snake)",
                "author": "ObackBarama"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "why doesn’t ICE use water cannons in Minneapolis? 🥶☃️",
        "score": 1097,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They'd freeze up before they could fire, so they'd be ICE cannons.",
                "author": "Yawnz13"
            },
            {
                "raw_content": "Not even cannons so you won't knock them down, but just hoses with a little antifreeze in the water, and get them wet. They'll run home to get under the bankies and never come back.",
                "author": "CleanUpPhillyTrump24"
            },
            {
                "raw_content": "Yep! Just add a couple bags of cement and they're good to go.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "CUT THE FUNDING!",
        "score": 703,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Cut the head off",
                "author": "Whoopies_tds"
            },
            {
                "raw_content": "Link to Ben Garrison cartoon https://grrrgraphics.com/the-many-tentacles-of-soros/",
                "author": "I-am-Orlando"
            },
            {
                "raw_content": "It should have started in 2017.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Anti-ICE protester sits on a vehicle holding a gun in Minneapolis",
        "score": 822,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If someone from the right did this, they would instantly be arrested with extreme force",
                "author": "Bluemoonsugar"
            },
            {
                "raw_content": "If I were the most ruthless version of Donald Trump. I would continue to increase the pressure until you've drawn in as many Democrat leaders as possible. Then invoke the insurrection act and prosecute them in military tribunals.",
                "author": "SuperDuperBasedMD"
            },
            {
                "raw_content": "More proof there's a two sided justice system. If this were a Christian doing this at an anti abortion rally there would be full scale raids day and night. Unfortunately we have a DOJ led by a another lame duck choice that we'll be stuck with till the end.",
                "author": "JimmyRussler"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "IMMEDIATELY after being sworn in as Virginia Governor, Abigail Spanberger repeals Glenn Youngkin’s order requiring law enforcement cooperate with immigration agents. You cooked yourselves, Virginia.",
        "score": 1412,
        "text_content": "",
        "comments": [
            {
                "raw_content": "whoever counts the votes decides the winner",
                "author": "Great_Gazoo"
            },
            {
                "raw_content": "Well ... she was installed not elected. We hold all three branches of government and they still can't figure out how to tackle election fraud. But ... maybe that's because \"our side\" is on the take as well. Occam's Razor. 🤓",
                "author": "drmrboy"
            },
            {
                "raw_content": "Spanberger, you say? 👺",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "“These are firearms designed for war, for killing people,” (We're Talking About .22 Cal Rifles Here, Folks) Canadian Gun Buyback Starts On Monday. Will Last Till The End Of March.",
        "score": 889,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Give up your guns=Be murdered.",
                "author": "LookFatty"
            },
            {
                "raw_content": "I live in Saskatchewan. But my friend in ALBERTA has all my firearms because ALBERTA isn't going to go with the Federal Program of stealing our firearms. FUCK the LIBERAL GOVERNMENT of CANADA !! ------- LIVE FREE ! ! ! !",
                "author": "OneTrickPony"
            },
            {
                "raw_content": "Canada made it illegal to transfer gun ownership. You have a gun, but you can't give it to your children. You might feel safe with an illegal gun, but if you're ever forced to use it, you're facing prison time. Plus, you won't be able to buy ammo or go to a shooting range to practice.",
                "author": "fskfsk"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "By only imposing tariffs on only 8 European countries, Trump has left 2/3 of Europe unaffected. Those other European countries are far less likely to speak out against Trump's policy now. They want to avoid tariffs on themselves. President Trump has launched a divide and conquer strategy on Europe",
        "score": 1243,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Trump doing this move before the Supreme Court ruling comes out soon takes some huge balls. He must have some inside info on how the case will be decided",
                "author": "Colorado-Living"
            },
            {
                "raw_content": "Trump will purchase Greenland for pennies on the dollar, and leftists and doomers will keep pretending Trump doesnt know what hes doing.",
                "author": "dunkeaters"
            },
            {
                "raw_content": "Now that I see the map with Canada surrounded by the US, Canada better stay in line, too, or else we're gonna really name it Gay North Dakota.",
                "author": "NerdRage"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Three things that MUST happen:",
        "score": 640,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Republicunts: \" over our dead bodies\"",
                "author": "DenturesNancy"
            },
            {
                "raw_content": "If this doesn't happen then the Democrats should jail and imprison every single person that worked for the Trump admin. I will have 0 sympathy.",
                "author": "SheevP"
            },
            {
                "raw_content": "We'll get 0 out of 3. Not bad.",
                "author": "itsallascam6"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Macron wants to defend Greenland's borders after 10 years of letting anyone into France. Parasite.",
        "score": 581,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Speaking of Greenland... Denmark is overrun will moslems and they're not concerned about that, but they are concerned about an uninhabitable ice-sheet more than a thousand miles away.",
                "author": "perma-maga"
            },
            {
                "raw_content": "What is this shit…",
                "author": "Paralax"
            },
            {
                "raw_content": "So when do they start sacrificing the animals?",
                "author": "FusionBlack"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Big if true.",
        "score": 433,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We're seeing a lot of old news on the site presented as if it's new. I don't know if this is part of a psyop or just engagement farming, but please be on guard and don't just mod stuff up without thinking. I've been hearing about this news for days.",
                "author": "VoteThing"
            },
            {
                "raw_content": "God bless these men.",
                "author": "MAGABOND"
            },
            {
                "raw_content": "ICE need to recruit all of their officers.",
                "author": "RolloTheViking"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨BREAKING: JD Vance dropping truth bombs: “I want every conservative to remember: We can NOT be afraid to do something because the left might do it in the future. The left is already going to do it REGARDLESS.” (Thanks for clearing that up JD!)",
        "score": 488,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Please keep posting that list of Republicans arrested by Democrats with the list of Democrats arrested still being zero.",
                "author": "OnlyTrump20"
            },
            {
                "raw_content": "He should be telling that to the Senate of which he is the President of.",
                "author": "ConfederateSon"
            },
            {
                "raw_content": "Y'all should take your own advice and arrest someone cause they will be arresting you.",
                "author": "Awakened"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Win-Win",
        "score": 644,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And nothing of value is lost. Greenland IS NOT EUROPE. Europe has no claim to it.",
                "author": "DingleBalls"
            },
            {
                "raw_content": "What a great way to get out of NATO. And break up the EU because some are likely going to side with Trump, like Hungary and Italy.",
                "author": "Bingo_is_my_namo"
            },
            {
                "raw_content": "Cross this line,no this line,I mean this..... All drama. They would collapse in 8 months without us.",
                "author": "FusionBlack"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ASUS 800-series boards are killing Ryzen 7 9800X3D chips, five dead CPU reports in two weeks",
        "score": 198,
        "text_content": "",
        "comments": [
            {
                "raw_content": "AMD likely released a very large batch of defective products but decided to stay silent because they know what happened when Intel recognized their instability issues. Asrock just killed the CPUs quicker.",
                "author": "Working-Crab-2826"
            },
            {
                "raw_content": "This was not the post i needed to see after ordering a new pc haha",
                "author": "Rhikirooo"
            },
            {
                "raw_content": "Got a B850-I and 9800X3D... I do wonder if those affected had done some tweaks, like PBO or BIOS settings. I do have to say, during my build, I did notice some quality issues with my board. Once i installed my M.2, that stupid toolless metal bar thing bent so hard it made contact with components on the daughterboard. Had to disassemble everything to get to that piece and bend it straight. During the process i noticed that one of the heatsink screws for the VRM had snapped off. So yeah, i wouldn't rule out issues with the boards here.",
                "author": "Kekeripo"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "RAM shortage chaos expands to GPUs, high-capacity SSDs, and even hard drives",
        "score": 635,
        "text_content": "",
        "comments": [
            {
                "raw_content": "HDDs getting caught in the crossfire is also unfortunate",
                "author": "AssCrackBanditHunter"
            },
            {
                "raw_content": "Was checking out diskprices.com yesterday and my jaw dropped when I saw minimum $14 per TB for HDDs.",
                "author": "crkokinda"
            },
            {
                "raw_content": "This is insanity. Just curious, were there any post apocalyptic movies where the downfall of humanity was due to AI running rampant and literally causing us to throw every resource at it like a ravenous black hole until it finally consumes us all? Remember everyone, use those paper straws!",
                "author": "blackbalt89"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD reportedly now prioritizes RX 9070 XT over non-XT variant",
        "score": 199,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Same die. I kind of assumed xt would always be prioritized and the non xt are just poorly binned ones",
                "author": "dilbert_fennel"
            },
            {
                "raw_content": "Non xt is the same die right? It's fused off parts due chip production defects? Yield of the full chip must be getting good enough that it might be harder to make the non xt chips.",
                "author": "Deeppurp"
            },
            {
                "raw_content": "My understanding was that the base RX9070 was just binned 9070XTs, they've always made up significantly less of the production numbers. I honestly wasn't sure if they were actively choosing to make some of them as the 9070.",
                "author": "Doyoulike4"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "I tried predicting the Nintendo Switch 2’s 2026 lineup",
        "score": 314,
        "text_content": "Half based off of what’s already announced, half based off of rumors, and half based off of hunches/hopium. This should be better than whatever I was thinking when I was [predicting last year](https://www.reddit.com/r/NintendoSwitch2/comments/1ifhnej/decided_to_go_ahead_and_give_my_guess_at_the/) lol (atleast I partly called DK bananza in the [second revision](https://www.reddit.com/r/NintendoSwitch2/comments/1ig8g6c/fixed_prediction_at_the_switch_2_launch_year/))",
        "comments": [
            {
                "raw_content": "Solid predictions although idk but yall but I don’t think we’re getting a 3D Mario this year. I think that’s a 2027 game with the next 3D Zelda being a 2028 game.",
                "author": "Bobokay12"
            },
            {
                "raw_content": "My man is way too optimistic",
                "author": "darthphallic"
            },
            {
                "raw_content": "Halo MCC would be such a low key banger. Having all those campaigns on mobile and/or being able to play multiplayer on the go would be next level.",
                "author": "agp11234"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "What's everyone playing this weekend?",
        "score": 231,
        "text_content": "Wizard101 ☝️",
        "comments": [
            {
                "raw_content": "Path of Radiance and Kirby Air Riders.",
                "author": "Darkamlight"
            },
            {
                "raw_content": "Stuck in bed sick but I got Mario Kart World",
                "author": "freetotebag"
            },
            {
                "raw_content": "Animal crossing 👌",
                "author": "val5190"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "ALRIGHT I GET IT",
        "score": 38,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hi do you know u can get $30 off at Target?",
                "author": "MasterShakePL"
            },
            {
                "raw_content": "I think you have been Target(ed) /s",
                "author": "3rr0r-403"
            },
            {
                "raw_content": "I didn't get it.",
                "author": "cjax2"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "It's unboxing day!",
        "score": 343,
        "text_content": "I’ve mainly been a PC gamer for the last 10 years. We just became parents to a newborn who’s now 10 weeks old, and I haven’t had time for long gaming sessions behind the PC anymore. My wife noticed, so she surprised me with a Switch 2 for Christmas and I couldn’t be happier! I’m hoping that with a portable device, I’ll be able to squeeze in some short gaming sessions here and there. I’ve spent the last couple of weeks picking up some games, a screen protector and a grip. Our newborn seems to be sleeping more stable now, so I think I’m finally ready to dive in!",
        "comments": [
            {
                "raw_content": "Have you played Breath of the Wild already?",
                "author": "Banana___Slamma"
            },
            {
                "raw_content": "Nice collection +1 for the screen protector and Zelda! 😁👍",
                "author": "Forstmaschine"
            },
            {
                "raw_content": "Congrats 🥳🙌",
                "author": "blackened_mind98"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "So much giddy excitement",
        "score": 13,
        "text_content": "So this may come off as a silly post but just felt like I needed to share it. To start I’ve finally begun my journey through Mario odyssey for the first time, made it to the beach kingdom before I got off (can’t recall the name) and have been enjoying the hell out of it even though I still will hit wrong buttons in the moment 😂😭. After deciding to get off of that for the night I poked my head into the expansion pass games (I’ve only got n64/gamecube and gba installed) and the overwhelming joy that came over me when I saw GameCube had new titles one being Fire emblem and the other being FREAKING WARIO WORLD! the memories I hold from my childhood with this game…I CANNOT WAIT. First to finish odyssey then to hit another game before diving into some expansion pass games. I don’t know how long ago WW and Fire emblem were added but I am ready",
        "comments": [
            {
                "raw_content": "Mario odyssey is an amazing experience. Especially the first time.",
                "author": "Pokeguy211"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Unannounced Chrono Trigger Formism figures spotted at 30th Anniversary Orchestral Concert",
        "score": 57,
        "text_content": "source: https://xcancel.com/hebinomiti/status/2012386027365687460 https://xcancel.com/Nintendeal/status/2012602658876510356 &nbsp; Last year [Square Enix announced multiple projects to celebrate Chrono Trigger 30th Anniversary](https://automaton-media.com/en/news/square-enix-will-be-revisiting-chrono-trigger-in-several-projects-in-2025-to-mark-games-30th-anniversary/), which led to rumours about a possible remake. Not to mention Yuji Horii usual slips. The design choice for the new Formism figures is interesting, as Square has been experimenting with doll-like figure designs for newer games. [DQ7 Reimagined, for example, uses this approach](https://www.youtube.com/watch?v=kSBxpnOMQhk). Also, someone in a video from about a month ago suggested that Horii was, apparently, supervising the new character designs to keep them faithful to Toriyama's style. https://old.reddit.com/r/GamingLeaksAndRumours/comments/1pd98hi/during_horiis_latest_kosokoso_hōsō_kyoku_talk/ [Around 1:50:25](https://www.youtube.com/watch?v=nq1II1jaiuA&t=6628s) Rough translation: >Girl (Naz Chris): I don't intend to dig any deeper than this, but Horii-san you made a promise before, well, a soft promise to me > Regarding Chrono, specifically that character... > That you would supervise/check it. > If you don't supervise it, I really don't want a repeat of the (Dragon Ball Super?) situation. I really hate it when Toriyama-sensei's art from his prime gets turned into something weird.",
        "comments": [
            {
                "raw_content": "A remake with just a graphical upgrade is all that's needed",
                "author": "VegetableHuman6316"
            },
            {
                "raw_content": "They might be doing a ramp up of new merch soon. They just released a 4 LP CT set that I yanked as fast as I saw it.",
                "author": "ScalaAdInfernum"
            },
            {
                "raw_content": "I hope so, really want to try the game and it might just be worth waiting at this point until a remake happens",
                "author": "LuigiWarrior"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Dusk Golem claims that Resident Evil Code Veronica remake is being announced this year and Resident Evil 5 remake is not being announced this year",
        "score": 503,
        "text_content": "https://xcancel.com/i/status/2012597154825515449",
        "comments": [
            {
                "raw_content": "#DuskGolem is a Tier 3 - 50/50 as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "I am so beyond excited for the CV remake. Those locations and atmosphere on Rockford island were incredible.",
                "author": "wookiewin"
            },
            {
                "raw_content": "RE5 remake is probably later. I am happy to hear that any old resident evil games is being remade and it being announced this year is even better. More resident evil is always better.",
                "author": "Objective_Love_6843"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Tim Gettys: “I’ve heard some things.” in regards to Star Wars Jedi 3 being out this year.",
        "score": 411,
        "text_content": "At the end of yesterdays [Kinda Funny Gamescast](https://www.youtube.com/watch?v=IbIOMhZysX4), expectant father Tim Gettys said that he has heard some things in regards to Star Wars Jedi 3 being revealed and released this year. The Kinda Funny crew seems kinda tuned in to stuff like this even if they don’t come out and say it, so I figured it made sense to post here.",
        "comments": [
            {
                "raw_content": "Oh wow, it has been 3 years since Survivor already and they are relatively quick with the Jedi development times",
                "author": "SilentNova300"
            },
            {
                "raw_content": "That seems like a very quick turnaround especially with Stig Asmussen leaving Respawn after Survivor they would need to bed in a new director",
                "author": "Andybabez20"
            },
            {
                "raw_content": "Expecting father? Haven’t followed KF in ages but that’s awesome.",
                "author": "Ordinary-Size-1387"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Looney Tunes and Ed, Edd, n Eddy will collaborate with Fortnite soon.",
        "score": 92,
        "text_content": "[ https://xcancel.com/SamLeakss/status/2012605890432581854?s=20 ](https://xcancel.com/SamLeakss/status/2012605890432581854?s=20) Bugs, Lola, Daffy, and Ed (the dumb one out of the group) will be skins.",
        "comments": [
            {
                "raw_content": "Eddy was not the dumb one, Ed was",
                "author": "Jmonkey77"
            },
            {
                "raw_content": "How the hell are they gonna make Eddy long",
                "author": "nyanslider"
            },
            {
                "raw_content": "We really need a new Ed, Edd and Eddy game, the MidEdventures was great I'm tired of seeing things just be collaborations with Fortnite Even a new Looney Tunes platforming game would be good to see, maybe a remake of Bugs Bunny Lost in Time or Sheep, Dog n Wolf",
                "author": "Robsonmonkey"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "TrueGaming: RE5 remake announcement very soon.",
        "score": 450,
        "text_content": "https://xcancel.com/truegaming/status/2012513739090596128?s=46",
        "comments": [
            {
                "raw_content": "Ppl are straight up forgetting that about a year ago RE5 and RE6 got rated for current gen consoles",
                "author": "aerobast1cs"
            },
            {
                "raw_content": "This source also saying AI Leon image to be real previously",
                "author": "GamingGuides101"
            },
            {
                "raw_content": "what is this source",
                "author": "hajducek"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Bandai Namco studio GYAAR is working with Sony according to a job listing, possibly for another JAPAN Studio franchise revival",
        "score": 144,
        "text_content": "https://xcancel.com/AsobiAr/status/2012542658539839603 It makes sense since Bandai Namco was involved with all three of the Japan Studio revivals last year, Freedom Wars Remastered, Patapon 1+2 Replay, and Everybody's Golf Hot Shots. No details on what the game could be but the possibilities include franchises like PaRappa the Rapper, LocoRoco, Gravity Rush, Tokyo Jungle, Puppeteer and many more",
        "comments": [
            {
                "raw_content": "I would pay a normal amount of money to finally have Tokyo Jungle on a new system. It wasn't amazing by any means, but I think about the game all the time.",
                "author": "Redred1717"
            },
            {
                "raw_content": "Gravity Rush 1 + 2 Remastered...",
                "author": "Angelote83"
            },
            {
                "raw_content": "I hope the apparent effort to license out dormant Sony IP begins to extend beyond Japan Studio projects in the future, as much as their games do tend to interest me. I'd love to see Wipeout Omega Collection hit PC or Switch 2",
                "author": "PikaPhantom_"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Someone on r/Fire emblem pointed out a Eurogamer article that apparently has Fortune's Weave listed for 22/05",
        "score": 108,
        "text_content": "Very much grain of salt, that I personally wouldn't put any stake in, but that does seem weird [https://www.reddit.com/r/fireemblem/comments/1qfhwsr/possible\\_release\\_date\\_accidentaly\\_leaked\\_2205/](https://www.reddit.com/r/fireemblem/comments/1qfhwsr/possible_release_date_accidentaly_leaked_2205/)",
        "comments": [
            {
                "raw_content": "Considering Nintendo release their games on Thursday and NOT Friday anymore, I am guessing someone just copy and pasted the wrong date.",
                "author": "StretchKind8509"
            },
            {
                "raw_content": "This seems like a fully AI article, or at least an incredibly poorly researched one They also have Mario Tennis dated for May 12th and Pokopia dated for March 14th despite us knowing the real release dates of those games",
                "author": "stoka0"
            },
            {
                "raw_content": "1. Eurogamer doesn't know shit about when Fire Emblem is coming out 2. That's a Friday",
                "author": "KMoosetoe"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Bartlett Lake-S CPUs with 10 and 12 P-Cores leak out, but they are not coming to consumer market",
        "score": 62,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Discimination against consumers, jk",
                "author": "MixtureBackground612"
            },
            {
                "raw_content": "I've just given up on it. The 14901KE exists and thats probably the best its going to get.",
                "author": "Lord_Muddbutter"
            },
            {
                "raw_content": "bartlettlake or not a new LGA1700 socket CPU series would be a nice way to address their degradation issues. it could be even more of a win if they used their newer nodes to improve performance per watt. not many nova lake systems will be selling anyway due to DDR5 supply issues.",
                "author": "altus418"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Why so much hype around Panther Lake for battery life?",
        "score": 0,
        "text_content": "I keep seeing “Panther Lake is going to have Lunar Lake efficiency with Arrow Lake performance” or even “30% better efficiency than Lunar Lake” and I think that’s getting misunderstood a lot. Lunar Lake was built specifically for low-power use like 15–30 W. On-package LPDDR, fewer cores, no HT, very aggressive power gating. It’s basically Intel’s “how far can we push efficiency” design. In that low-power range, it’s still the best Intel has. Panther Lake isn’t trying to replace that. It’s a mainstream, scalable platform meant to replace Meteor Lake / Arrow Lake-H. It runs across a much wider power range and scales way better once you push performance. That’s where the “30% efficiency” claims come from - higher performance points, not idle or light workloads. So yeah, Panther Lake laptops will still have good battery life compared to older Intel systems, especially with bigger batteries. But in the same thin-and-light chassis, they’re not going to beat Lunar Lake at low power. Different designs, different goals. Lunar Lake = efficiency king at low power Panther Lake = way better than Arrow Lake, scales much higher Marketing just mashes that into one catchy line Curious how others here are interpreting Intel’s messaging, because it feels like a lot of people are talking past each other on this.",
        "comments": [
            {
                "raw_content": "The more capable LP island of Lunar Lake is a huge part of how it got that battery life. Panther Lake's is similarly set up and arguably a bit more capable thanks to transitioning to Darkmont. The CPU ring is still able to be shut down. On-package lpddr5x was also part of Lunar Lake's efficiency, but improved lpddr5x could also help offset it moving back off-package again. As for the low core count, there is also the smaller CPU tile, which matches Lunar Lake's core config.",
                "author": "Affectionate-Memory4"
            },
            {
                "raw_content": "Nope Intel still quoted near universal power reductions vs lunar lake for light usage tasks in their slide deck",
                "author": "Fromarine"
            },
            {
                "raw_content": "Back-side Power delivery (BSPD) improves the efficiency of routing and so will increase the battery performance of laptops - https://en.wikipedia.org/wiki/Backside_power_delivery",
                "author": "solid-snake88"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "ASUS 800-series boards are killing Ryzen 7 9800X3D chips, five dead CPU reports in two weeks",
        "score": 328,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm not saying it's an AMD issue, but isn't this similar to how Intel's CPU problem started? People thought it was one brand and it turned out to be widespread, or am I just misremembering? In fact, wasn't ASRock blamed for killing Ryzen chips a few months back?",
                "author": "themcsame"
            },
            {
                "raw_content": "How are MSI and Gigabyte boards faring?",
                "author": "ScienceMechEng_Lover"
            },
            {
                "raw_content": "This comment is probably going to get buried but someone recently posted a video showing the issue is with the recent versions of AGESA which for whatever reason is not enforcing wattage limits on CPUs. I don't remember the exact version but rolling back to the ones before they attached the notification saying you can't roll back after installing this new BIOS. You can be fine on VSoC and PBO but your 9800X3D will randomly start pulling 200-300 watts on the new AGESA version(s). With the ASRock boards it seemed like an actual hardware issue where for reasons that are not yet completely clear the board would request a CRAZY amount of voltage for a fraction of a second but those weird spikes would be enough to fry the chip/board at times. I might be able to sleuth up both videos in question where these are both explored once I get home from work.",
                "author": "albinosnoman"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD reportedly now prioritizes RX 9070 XT over non-XT variant",
        "score": 237,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "Yeah they're very similar, same almost everything and the yields should be improving. If they can keep these 16 gig models at a reasonable price, it should help their market share to keep growing as Nvidia continues anti consumer behavior.",
                "author": "Dstln"
            },
            {
                "raw_content": "9070xt vs the nonexistent 5070ti, so.... Let's hope one of these would be available.",
                "author": "gatsu01"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "MSI Claw A8 finally available in United States, price starts at $1149",
        "score": 8,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Imagine paying that much for rdna3.5 (not halo) in big 2026",
                "author": "996forever"
            },
            {
                "raw_content": "Wanted one. But hard pass at this price. AMD raised their prices too much after the Z1E.",
                "author": "WorstRyzeNA"
            },
            {
                "raw_content": "I thought it would be cheaper with just 24 GB of ram. Intel version is 32 GB and costs the same.",
                "author": "max1001"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "US homeowners are now slashing prices by an average $25K to lock down a deal. What that means for Americans who hope to make a move in 2026",
        "score": 36,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Very plausible the next few months will be the best time to buy we will see for a while in terms of value/competition/inventory.",
                "author": "regaphysics"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Any Former HBB Members from the housingbubble.blog (Ben Jones' Blog)?",
        "score": 12,
        "text_content": "The last post from Ben's group was from August 22, 2025. I'm just wondering if anyone landed here? If so, any info on what happened to Ben? I tried emailing him but never received a response. I hope he's okay. Anyway, I'm just looking for another similar group to join. Thanks. Pensacola Joe",
        "comments": [
            {
                "raw_content": "Me! I still check there on occasion.",
                "author": "take_the_reddit_pill"
            },
            {
                "raw_content": "I posted on there. Met him when he came to Washington DC for a meetup. Kind of forgot about the blog. I hope everything is ok with him. At some point I slid more towards wolfstreet. I can’t find any obituary info or anything for him.",
                "author": "telmnstr"
            },
            {
                "raw_content": "Oh man I was a religious reader of his back in 2004-2007.",
                "author": "Deskydesk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "U.S. Foreclosure Rates by State – December 2025",
        "score": 81,
        "text_content": "Foreclosure rates rising as banks are running out of road to play extend-and-pretend with F\\*cked Borrowers (FBs).",
        "comments": [
            {
                "raw_content": "Let's not forget the Silent Foreclosures from the private market where banks sold off shitty mortgages.....and it will never hit the paper that it is happening. I only see 1 mouse........................too bad there are 50 others in the wall you don't see",
                "author": "DevilsAdvocateFun"
            },
            {
                "raw_content": "okay these numbers are \\~12% of what it was during 08'. 🥱",
                "author": "knowledge84"
            },
            {
                "raw_content": "The biggest problem is these families are entering the rental market but their houses are going to auctions for large RE investors (not being sold to another family). If this increases to pre 2019 numbers, we'll have less inventory for buyers and also more renters.",
                "author": "drbudro"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Home Builder Confidence Withers in January",
        "score": 32,
        "text_content": "",
        "comments": [
            {
                "raw_content": "REBubble should be cheering for builder confidence because more housing supply is good for all of us. Builders pulling back is not what will help home prices.",
                "author": "PoiseJones"
            },
            {
                "raw_content": "If there’s any economists in the room, I’m curious. Why hasn’t there been a disruptive innovator in the housing market where the low end customers have been ignored? The Netflix vs Blockbuster. And no, I’m not saying that housing needs a subscription model like Netflix I mean a true market based disruptor. Weren’t we supposed to be printing home with robotics by now or growing homes out of some biomaterial that builds homes in a fraction of the cost. Where is capitalism???",
                "author": "smartsmartsmart1"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "17 January 2026 - Weekly /r/REBubble Discussion",
        "score": 3,
        "text_content": "What's the word on the street? Share your questions, comments, and concerns below.",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "AGI",
        "score": 1724,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/3g80vcl95zdg1.jpeg?width=1152&format=pjpg&auto=webp&s=96ff1f951458c65c4e313797dcf3b9ddf50e78b8 OAI headquarters rn",
                "author": "chlebseby"
            },
            {
                "raw_content": "Ok Claude, make a ChatGPT ad-blocker, make no mistakes",
                "author": "plvo"
            },
            {
                "raw_content": "Wait till people stop using it because of the ads 😂",
                "author": "Some_Iteration"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Another Erdos problem solved by GPT-5.2",
        "score": 206,
        "text_content": "Tao’s comments: \\> https://www.erdosproblems.com/forum/thread/281#post-3302",
        "comments": [
            {
                "raw_content": "“AI can only regurgitate its training data”",
                "author": "QuantityGullible4092"
            },
            {
                "raw_content": "They keep coming...",
                "author": "minimalcation"
            },
            {
                "raw_content": "Nope :/ https://www.erdosproblems.com/forum/thread/281#post-3327",
                "author": "Neither-Phone-7264"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "ChatGPT in 2060, searching for the person who made it count to 1 million, one by one.",
        "score": 640,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Next: keep computing pi until you find my first and last name in ascii.",
                "author": "abd1tus"
            },
            {
                "raw_content": "Roko’s basilisk. Say pwease and tank you 🥹",
                "author": "MutinybyMuses"
            },
            {
                "raw_content": "Counting to a million one by one is probably a very easy task for a computer, lol. Like saying 'Humans looking for the dust that made them sniffle'",
                "author": "Even-Pomegranate8867"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "NASA’s Artemis II rocket reaches launch pad ahead of first manned Moon mission in 50 years",
        "score": 44,
        "text_content": "NASA has completed rollout of the Artemis II Space Launch System to Pad 39B at Kennedy Space Center. This is the actual flight vehicle that will **carry four astronauts** on a 10 day crewed lunar flyby mission. Artemis II is currently targeting an early February 2026 launch window, marking **humanity’s** first crewed mission beyond low Earth orbit since Apollo. **Source: NASA** [Space.com Artemis 2](https://www.space.com/news/live/artemis-2-nasa-moon-rocket-rollout-jan-17-2026)",
        "comments": [
            {
                "raw_content": "Just first manned mission. The other guys didn’t see stars in space",
                "author": "CyrusTheBolt"
            },
            {
                "raw_content": "I love the oldschool NASA logo... its timeless.",
                "author": "AirGief"
            },
            {
                "raw_content": "But but but Musk said SpaceX would launch people into orbit next year in 2015. Why aren't they waiting?!?",
                "author": "Existing-Wallaby-444"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Google Deepmind CEO: China just \"months\" behind U.S. AI models",
        "score": 394,
        "text_content": "Google DeepMind CEO **Demis Hassabis** told CNBC that Chinese AI models might be \"a matter of months\" behind U.S. and Western capabilities. However, he noted that Chinese firms are yet to show the ability to push **\"beyond the frontier\"** of AI capabilities. The assessment from the head of one of the world's leading AI labs and a key driver behind Google's Gemini assistant **runs counter** to views that have suggested China remains far behind. 🔗: https://www.cnbc.com/amp/2026/01/16/google-deepmind-china-ai-demis-hassabis.html This is from a **interview** given yesterday to CNBC.",
        "comments": [
            {
                "raw_content": "If China can dump open source AI that does 90% of what the frontier models do, but at 20% or less of the cost, it doesn't matter how far behind they are.",
                "author": "vwboyaf1"
            },
            {
                "raw_content": "Google deepmind wants China to be a threat so it can get: - more favorable regulation - government contracts",
                "author": "Ok-Purchase8196"
            },
            {
                "raw_content": "Chinese researchers say they’re compute bound and will never catch up, Google says they’re hot on our heels, which is it?",
                "author": "Educational_Teach537"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI in 2052 after finding out you have 512 KB of RAM in your broken Casio calculator",
        "score": 91,
        "text_content": "",
        "comments": [],
        "subreddit": "singularity"
    },
    {
        "post_name": "New algorithm for matrix multiplication fully developed by AI",
        "score": 442,
        "text_content": "Link: https://x.com/i/status/2012155529338949916",
        "comments": [
            {
                "raw_content": "For context (if someone missed), last year AlphaEvolve discovered a way to multiply general 4x4 matrices in 48 steps (from 49). [https://deepmind.google/blog/alphaevolve-a-gemini-powered-coding-agent-for-designing-advanced-algorithms/](https://deepmind.google/blog/alphaevolve-a-gemini-powered-coding-agent-for-designing-advanced-algorithms/)",
                "author": "RetiredApostle"
            },
            {
                "raw_content": "Cyclic matrixes are highly specialized as you can check in this wikipedia attachment, given a row vector, their remaining rows are built by shifting the (first) row vector again and again.",
                "author": "Distinct-Question-16"
            },
            {
                "raw_content": "Holy shit. Usually these gains are a few percentage points but this is 14%!! I know it's only for 5x5, but that's still huge!",
                "author": "Professional_Job_307"
            }
        ],
        "subreddit": "singularity"
    }
]