[
    {
        "post_name": "Unbelievable!! CNN's Erin Burnett just parroted Antifa propaganda on air while managing to take swipes at \"rightwing extremists\": Protecting DNC Brown Shirts",
        "score": 589,
        "text_content": "",
        "comments": [
            {
                "raw_content": "She gets paid to push this agenda",
                "author": "Weepingwillowwidow"
            },
            {
                "raw_content": "There are thousandsof hours of footage on youtube that people can watch showing Antifa violence. Stupid, lying bitch.",
                "author": "Lol_Garrus"
            },
            {
                "raw_content": "CNN being fake news? Inconceivable!",
                "author": "AbrahamLincoln"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump says he spoke to Netanyahu after the peace deal was announced \"I told him, 'Israel cannot fight the world.' & he understands that very well.\"",
        "score": 550,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good. I hope he actually told.him that. With our support the Israelis have become wild. They play with fire a lot. Doesn't help their neighbors are pissants. Stick with the Sand Arabs. They prefer money over armies. I get the ferocity but isnt Israel tired too? No one can fight forever. Even if it's self defense.",
                "author": "shadypollster"
            },
            {
                "raw_content": "Press X to doubt... He is trying to get us involved in \"Fighting the World\" :p",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "Isreal cannot fight the world, thats why it relies on the USA to fight for them, be it money, blood, or anything else it wants",
                "author": "Justlooking250"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "THE PEACE PRESIDENT",
        "score": 561,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How about the \"Justice\" President? Arrests, and convictions when!?",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "Peace is the start of a beautiful world. Let's bring it HOME.",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "GEOTUS is the absolute BEST!!!!!!!! All y'all coward-ass LOSER FAGGOTS can eat shit, y'all Commie Bastard, troon-loving SCUMBAGS",
                "author": "LokiHelmsdeep"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Over $100 million dollars of taxpayer money has gone to pay for riots and violence in our country (1:31).",
        "score": 1231,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How much damage was done with $100 million?",
                "author": "MemoryHoleyeO"
            },
            {
                "raw_content": "This is the most promising avenue to prosecute and jail the deep state's executives. Plans, negotiations, hits - all very hard to prove. Money trails are different. That being said, be patient and skeptical. We've already seen how rigged our judicial system is, so anyone expecting an easy conviction is insane.",
                "author": "dunkeaters"
            },
            {
                "raw_content": "- George Soros, the Open Society Network - Arabella Funding Network - The Tides FIShing Network - Neville Roy Singham and his network - Johann Georg \"Hansjörg\" Wyss a billionaire donor in Switzerland - Additional Foreign Cash --- \"Arabella Advisors is a Washington, D.C.–based for-profit consulting company that advises left-leaning donors and nonprofits about where to give money and manages several \"dark money\" groups supportive of the Democratic Party and the progressive movement. It was founded by former Clinton administration appointee Eric Kessler. In 2023, Arabella raised more than $1.3 billion in anonymous donations and sent nearly $1.5 billion to other organizations. Between Arabella's founding in 2005 and 2021, Arabella took in $6.5 billion, the vast majority of which flowed to policy and litigation groups on the left.\" **Bill Gates halted making grants to Arabella back in June** \"The Gates Foundation decided in late June to halt making grants to nonprofit funds administered by the consulting firm Arabella Advisors, according to an internal foundation announcement reviewed by The New York Times.\" --- **Johann Georg \"Hansjörg\" Wyss** He is the founder and former president and chairman of Synthes, a medical device manufacturer. In the United States, Wyss is a major donor of the Democratic Party. Wyss's political giving has come under scrutiny since foreign nationals without permanent residency in the United States are prohibited from donating directly to federal political candidates or political action committees He is the co-owner of Premier League football club Chelsea. He is one of the anchor shareholders of Lalique Group, with Müller Handels AG Schweiz, Dharampal Satyapal Limited, Hansjörg Wyss and Claudio Denz, they hold 42.67% of Lalique Group shares. Wyss is a member of the Democracy Alliance, a club of liberal donors. In December 2024, the U.S. House of Representatives held a hearing on the threat of foreign interference in U.S. elections. While federal law prohibits foreign nationals from donating to political candidates, campaigns, or super PACs, there is a loophole allowing foreign nationals to finance ballot measures. The Sixteen Thirty Fund, largely funded by Wyss, has spent over $130 million on ballot measures in 25 states. In the 2024 election cycle alone, the group spent $37 million on ballot measures across the U.S. focused on topics like abortion and election law. After Ohio banned foreign spending on ballot campaigns, the Sixteen Thirty Fund abruptly stopped spending in the state. As a Swiss citizen, Wyss is legally prohibited from directly donating to U.S. political candidates or committees. Between 1990 and 2006, he donated $119,000 directly to candidates and political committees. The Federal Election Commission declined to take action against him, and the statute of limitations has passed. The Associated Press found that Wyss's \"influence is still broadly felt through millions of dollars routed through a network of nonprofit groups that invest heavily in the Democratic ecosystem. Such groups don't have to disclose the source of their funding — or many details about how they spend it.\" One vehicle for Wyss's political donations is the Berger Action Fund, which has donated $339 million to left-leaning nonprofits since 2016. The majority of the Berger Action Fund's $72 million expenditures in 2021 went to building public support for Joe Biden's agenda and thereby \"cementing Wyss' status as a Democratic-aligned megadonor.\"",
                "author": "Mr_Rightside"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Great Scott! It's working, Marty!",
        "score": 1129,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nothing corrects until we end the Hadron collider.",
                "author": "Siteless_Vagrant"
            },
            {
                "raw_content": "&#65038; Too bad they don't give out some kind of prize for peace makers. &#65038;",
                "author": "BallotsOnRubysUSB"
            },
            {
                "raw_content": "Would the pictures of trannies disappear or turn into happy, healthy, productive male members of society",
                "author": "NADSAQ"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "WOW. Leaked video of Democrat CA Governor Candidate Katie Porter yelling at a staffer to \"GET OUT OF MY F*CKING SHOT!\" THIS is who Democrats want as their next governor???",
        "score": 1597,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Democrats are insane retards, so... yes, they do want this as their next governor",
                "author": "notatallimsure"
            },
            {
                "raw_content": "Plastered all over MSM and late night \"comedy\" shows were this a Republican",
                "author": "brainphreeze"
            },
            {
                "raw_content": "You save $632 in gas…..and pay an additional $19,483 for the electricity (California rates) to charge the goddamn thing. I hate democrats…",
                "author": "YT45"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "78% Of Americans Favor Deportation Of Criminal Illegal Immigrants; New Poll Finds",
        "score": 1352,
        "text_content": "",
        "comments": [
            {
                "raw_content": "All illegal immigrants are criminal",
                "author": "Mayhem"
            },
            {
                "raw_content": "22% can house them.",
                "author": "Mungo"
            },
            {
                "raw_content": "Criminal by being here illegally in the first place.",
                "author": "kiowachief"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Reliable sources say it was a head shot",
        "score": 1023,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Some say Hakeem is bigoted, because he thinks so lowly of Mexicans that he doesn't want to wear the sombrero.",
                "author": "billybaldwin2"
            },
            {
                "raw_content": "Proof Democrats has lost it. Simple sombrero that Hakeem could have worn and all of Trumps Memes done.",
                "author": "tlorsung"
            },
            {
                "raw_content": "His new name is Hakeem \"Taco\" Jeffries, but you can just call him \"Taco\" for short.",
                "author": "Cowboy888"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨Trump Truth: I am very proud to announce that Israel and Hamas have both signed off on the first Phase of our Peace Plan.",
        "score": 1303,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I hope he understands that evil lies and then continues to do evil.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "Remember, Obama got a nobel peace prize for literally nothing.",
                "author": "Beat_to_Quarters"
            },
            {
                "raw_content": "I want all the hostages and all the bodies.",
                "author": "okboomer59"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: President Trump ON THE SPOT orders Secretary Marco Rubio to designate Antifa as a FOREIGN terrorist organization. \"It's what I'd like to do. Everybody agree? Let's get it done. OK, Marco? We'll take care of it.\"",
        "score": 1711,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It will probably require some formal steps, assembling very specific evidence, but it should be feasible to do without major delay. But I don't think it's something that can just be instantly \"done\" by POTUS issuing an order.",
                "author": "Deplora"
            },
            {
                "raw_content": "They originate all the way back to Weimar Germany as a communist militant organization. https://en.wikipedia.org/wiki/Antifaschistische_Aktion",
                "author": "utfanx2"
            },
            {
                "raw_content": "I thought they already did this two weeks ago and so did Hungary and Denmark.",
                "author": "MkultraUSA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The White House : ICYMI: Democrats STILL don't know the facts. 🪇 DEMOCRAT SHUTDOWN.",
        "score": 1121,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hakeem is a low iq individual",
                "author": "Diddlywac3"
            },
            {
                "raw_content": "DEI getting schooled as always.",
                "author": "DManthey"
            },
            {
                "raw_content": "On the official White House Twitter account!",
                "author": "TakingAction"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "POTUS agrees with me! I've Been saying this for a while now",
        "score": 1473,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Who is Trump talking to? Only his own DOJ can make this happen...",
                "author": "WilliamWallaceRedHat"
            },
            {
                "raw_content": "Lock them up!",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "Not only should they go to Chicago and take care of illegals and antifa, they should also investigate every single Chicago politician for corruption.",
                "author": "Trumpwonbidencheated"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "HOLY CRAP! Media stations are giving *ZERO* seconds in coverage to Virginia Democrat attorney general candidate Jay Jones saying he wants to shoot Republican officials & their children, & urinate on their graves..ABC: 0 seconds. CBS: 0 seconds. PBS: 0 seconds. NBC: 63 seconds.",
        "score": 1498,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Because he would make their party look bad. Yes THEIR PARTY.",
                "author": "BlackPilledMAGA"
            },
            {
                "raw_content": "Hiding the truth it’s what they do!",
                "author": "QueensOwn"
            },
            {
                "raw_content": "Because they agree with him.",
                "author": "Gadsden"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Roy Bill Would Allow ICE To Deport Adherents Of Sharia Law",
        "score": 1537,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No place for that shit here",
                "author": "darkmodeforgotpass"
            },
            {
                "raw_content": "Muslims are encouraged to lie about their beliefs and motives until they have sufficient numbers to subjugate the native population by the sword",
                "author": "Zskills"
            },
            {
                "raw_content": "It should be named The Pork Bill.",
                "author": "Hangemh1gh"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "In Chicago, ICE agents tried to detain an illegal immigrant when a crowd stepped in and blocked the arrest. The suspect escaped.",
        "score": 1027,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What does he mean \"since when is this acceptable?\" So many people on the right are still oblivious and flabbergasted while the left just does whatever they want. They don't understand that a civil war is in *full swing* right now. *If ICE doesn't SHOOT people who physically intervene with their apprehension of aliens, then they are not serious about getting the job done that we pay them to do.",
                "author": "Prandogolio"
            },
            {
                "raw_content": "That was inept all around. 🤣",
                "author": "PatriotSkorzeny"
            },
            {
                "raw_content": "Nice gut, he's not starving.",
                "author": "ElectronicSlurm69"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Journalist infiltrating Antifa",
        "score": 930,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Katie has done incredible work and suffered for it. Notice the black eye she is still sporting.",
                "author": "KneadThePeople"
            },
            {
                "raw_content": "just for future reference. when a 125lb, 5 foot 5, blonde chick, with no tats, and coherent speech, starts acting interested and asks questions; you're being honey potted. this is for everyone, not just antifa.",
                "author": "Popsalock"
            },
            {
                "raw_content": "Trump - this is good leadership, airing this stuff out on the national stage. Pressure is on the commies, and their minions will fold, since they are cowards.",
                "author": "freedom-thinker"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "JB Porkster",
        "score": 954,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Someone go back 75 years and show them this future of politics.",
                "author": "PiratePatriotParrot"
            },
            {
                "raw_content": "Whew lad. AI is putting in the work. The dawn of the Golden age.",
                "author": "FatigueIsReal"
            },
            {
                "raw_content": "I despise AI bullshit",
                "author": "Spacemonkey"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: President Trump has just arrived at the Oval Office after he was handed a NOTE from Sec. Rubio that a Gaza peace deal breakthrough is upon us. This could be huge. The peace president in action.",
        "score": 1083,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ending the Gaza war is bad for Palestine...CNN Probably",
                "author": "Gunmolester"
            },
            {
                "raw_content": ">peace in the middle east ya right",
                "author": "try4gain"
            },
            {
                "raw_content": "Can we stop playing in the sand now",
                "author": "Liberty_Prime_V2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "IRS to furlough nearly half of its workforce as part of ongoing government shutdown — AP",
        "score": 1963,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fire not furlough.",
                "author": "PasqualiII"
            },
            {
                "raw_content": "Defund the IRS",
                "author": "EdBuck"
            },
            {
                "raw_content": "Oh no, that sucks! So anyways…",
                "author": "SurfandTurf"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Senator Kennedy: Schumer is “nervous as pregnant nun”",
        "score": 1096,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"His First Car Was A Chariot\" 😂 Fuck This Man Is Gold!",
                "author": "MericaFukYeah"
            },
            {
                "raw_content": "Schumer is being pressured to keep it up to spend his political capital so they can put AOC in his place.",
                "author": "Agenda47"
            },
            {
                "raw_content": "Shooter could be pregnant… you seen his husband?",
                "author": "awsure"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Sparkle unveils Intel Arc Pro B60 Dual server with 16 GPUs and up to 768 GB of VRAM",
        "score": 78,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> For AI training, there is probably no limit (to enough memory), although it's unclear whether splitting the memory pool into 24 or 48 GB banks is better than using 100 GB or even 200 GB on a single card. One thing seems clear, this solution will be cheaper than standard AI data center products. Hopefully, Intel can get and maintain footholds in medium-sized AI research market",
                "author": "WarEagleGo"
            },
            {
                "raw_content": "No way that power usage is at idle. Even if there was only one performance state like Tesla GPUs they wouldn't consume that much power.",
                "author": "BlueGoliath"
            },
            {
                "raw_content": "This thing only has a 1Gb Ethernet port? I don't know much about the use case for this thing, but that seems surprisingly low. Simply from the use case of uploading training data to this I feel like something faster is necessary.",
                "author": "RazingsIsNotHomeNow"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Synology Reverses Policy Banning Third-Party HDDs After NAS sales plummet",
        "score": 624,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This was a really poorly considered, anti-consumer policy in the first place. A company might get away with those tactics in a corporate IT environment, but for everyday enthusiasts that build setups with NAS this is a nonstarter. If you want our repeat business, build innovative products that motivate your customers to upgrade.",
                "author": "BiscuitBandit"
            },
            {
                "raw_content": "They killed off some apps I was using too like video station. I'm not going to bother setting up another app on it, just use my home Terramaster with Truenas instead. Il leave it on the old version for now.",
                "author": "ShogoXT"
            },
            {
                "raw_content": "> According to some reports, sales of Synology’s 2025 NAS models dropped sharply in the months after the restriction was introduced. Please someone find this. I have to see it. Bravo on customers backing off. That's the only way to combat short sighted idiot CEOs and boards And the article talks about damaging their reputation. No shit. When it's time for a new NAS how can I trust Synology to not get greedy again? At least from a child in the 80s perspective, we all had to read the golden goose story. It should be a requirement for every CEO and board member once a year, just as a reminder that you can always push greed too far",
                "author": "Saneless"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[News] Samsung Reportedly to Supply HBM4 for AMD MI450 in OpenAI Deal, Taking On NVIDIA–SK hynix",
        "score": 87,
        "text_content": "",
        "comments": [
            {
                "raw_content": "[AI hardware/software companies be like](https://preview.redd.it/obvqaa0lhn841.jpg?width=1080&crop=smart&auto=webp&s=00e27fe47ee6ede53e5e0f0a8be0ce6322fe07d4)",
                "author": "Quatro_Leches"
            },
            {
                "raw_content": ">Industry sources cited by the report project a fierce new rivalry between the NVIDIA–SK hynix alliance and the AMD–Samsung camp, adding that SK hynix’s competition with Samsung over technology and pricing will intensify. >SeDaily further points out that the partnership’s ripple effects extend well beyond the companies involved. AMD is spearheading an open-standard alternative, Ultra Accelerate Link (UALink), alongside Google, Microsoft, and others to challenge NVIDIA’s proprietary NVLink. With OpenAI now joining AMD’s camp, the UALink ecosystem could expand rapidly—eroding NVIDIA’s technical exclusivity and paving the way for broader industry participation, the report adds.",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "Why do korean companies compete with each other so fiercely? Lol this is good for us but still, they treat each other worse than enemies",
                "author": "Scy_Nation"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "The Road to Panther Lake: Intel Arc Graphics",
        "score": 51,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Love a good TAP interview, hopefully he'll do some podcasts too once the embargo lifts.",
                "author": "Successful_Gas8543"
            },
            {
                "raw_content": "I like how TAP said \"expect even bigger investments in graphics in the future\". I hope this means what I think it means, because Intel \\*must\\* continue heavy investment in their own graphics. Accelerated compute is the future.",
                "author": "logically_musical"
            },
            {
                "raw_content": "MLID must have an aneurysm seeing the guy still employed at Intel",
                "author": "imaginary_num6er"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Jarrod'sTech - Mobile RTX 5050 vs Mobile RTX 4060 - Don’t Choose Wrong",
        "score": 2,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TLDW: Laptops tested: 1) Asus TUF F15 (2024): CPU: Intel Core i7-13650HX GPU: Mobile RTX 4060 8GB DDR6 (35-140W) RAM: 16GB (2x8GB) DDR5-4800 MT/s SSD: 4TB Samsung 990 Pro 2) Lenovo LOQ 15 (2025): CPU: Intel Core i7-13650HX GPU: Mobile RTX 5050 8GB DDR7 (35-115W) RAM: 16GB (2x8GB) DDR5-4800 MT/s SSD: 4TB Samsung 990 Pro Benchmarks: - 1080P 25 game average (Ultra, High and Very High settings), both GPUs at 100W: Mobile RTX 4060 8GB is 7.59% faster - 1440P 25 game average (Ultra, High and Very High settings), both GPUs at 100W: Mobile RTX 4060 8GB is 7.82% faster 25 Game Average: - 1080P: Mobile RTX 4060: 77.98 FPS Mobile RTX 5050: 72.47 FPS - 1440P: Mobile RTX 4060: 56.4 FPS Mobile RTX 5050: 52.26 FPS",
                "author": "Antonis_32"
            },
            {
                "raw_content": "I want to see the how an overclocked undervolted 5050 performs",
                "author": "LuluButterFive"
            },
            {
                "raw_content": "is this the first generation where the previous xx60 is still faster than current xx50?",
                "author": "hackenclaw"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nintendo Switch 2 Becomes the Fastest-Selling Console in Gaming History",
        "score": 2294,
        "text_content": "Nintendo’s new console is now 5 percent ahead of the previous record setting pace of PlayStation 4. Sony’s system sold 2.2 million units during the 3 months ending January 2014. Also, Nintendo Switch 2 unit sales are trending 77 percent ahead the time-aligned sales of Switch 1 – it was previously 75 percent after two months. Source Circana",
        "comments": [
            {
                "raw_content": "Give credit where it's due. Nintendo handled the Switch 2 launch and distribution so well. I think if not for the tariff situation we might've seen a lower price point and sold even better.",
                "author": "SuperSaiyanIR"
            },
            {
                "raw_content": "I walked into gamestop 3 days ago and just kinda..... bought one. Feels like I had to fight tooth and nail to get a ps5 for a year without it costing like 700-900$ (thanks scalpers). That being said, I really love the Switch 2 and how it feels/looks in handheld. My only gripe is that there aren't enough upgraded or fps uncapped switch games for it yet! Tears of the Kingdom almost feels like a different game at 60 fps and high resolution. Hades 2 has been great fun. Donkey Kong..... I admit the controls for this one took some getting used to but im having a blast.",
                "author": "gandalftheokay"
            },
            {
                "raw_content": "But Reddit said there was gonna a boycott",
                "author": "Linkbetweentwirls"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "'Close to You' short from Nintendo was Pikmin all along. They are only invisible to the human eye! :)",
        "score": 150,
        "text_content": "If you guessed this was a Pikmin short, you were right!",
        "comments": [
            {
                "raw_content": "Where can we see this new version?",
                "author": "ashenoceiros"
            },
            {
                "raw_content": "The mother didn't notice the pacifier move on its own because she's a wine-o and can't really see straight at the moment anyway.",
                "author": "sendhelp"
            },
            {
                "raw_content": "I talked to a guy on Twitter and told him that it's definitely Pikmin and bro said nah it's not . Feels good to be right",
                "author": "zaadiqoJoseph"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo releases second “Close to You” video, filled with Pikmin",
        "score": 921,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sir, a second \"Close to You\" video has hit Nintendo Today. Pikmin haters are under attack.",
                "author": "Maximum__Mango"
            },
            {
                "raw_content": "How many Pikmin does the baby turn into when they bring it to the onion?",
                "author": "Williekins"
            },
            {
                "raw_content": "BUT are we SURE this is about Pikmin and not Baby Rosalina?!?! /s",
                "author": "Hectorc34"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "My first shell replacement ever",
        "score": 22,
        "text_content": "Waiting for Nintendo to drop colour joy con 2s was just long. My first DIY shell replacement ever. Was quite easy to do following a guide, the only tricky bit was reinserting the ribbon cables back on the motherboard. Especially the battery ribbon. Didn’t over tighten the screws but put them back a little tighter than they already were. The gap between joy cons and the Switch 2 doesn’t show even when doing a one hand test",
        "comments": [
            {
                "raw_content": "nice!! i got the same but kept the buttons black",
                "author": "Trimblepsys"
            },
            {
                "raw_content": "The color looks great! I went for the pink one this time :) How long did you end up taking for the whole replacement? Did you also change the console backplate?",
                "author": "WaP-Dorf"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The Best Thing About the \"Close to You\" Saga was the Red Pikmin",
        "score": 40,
        "text_content": "A blurry brown blob was \"walking\" under the crib and a bunch of people claimed it was a red Pikmin -- and they turned out to sort of be right? Could you guys see invisible Pikmin all along?",
        "comments": [
            {
                "raw_content": "I am like 99% sure that's a Hocotatian that is not invisible to people and therefore needed to hide under the crib during the whole ordeal.",
                "author": "ConflictPotential204"
            },
            {
                "raw_content": "maybe we’re only seeing the thing it’s carrying",
                "author": "HappyNostalgia17"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "What are you guys playing today?",
        "score": 344,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Outlaws, (42 hrs now) and Mario Galaxy.",
                "author": "Best-Food-4441"
            },
            {
                "raw_content": "Hades 2!",
                "author": "Obienator"
            },
            {
                "raw_content": "Final Fantasy Tactics: Ivalice Chronicles. Got me hooked again right away and nostalgia hits hard.",
                "author": "Elepanther"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Over first 3 months Switch 2 is fastest selling console in the USA - 5% ahead of PS4 77% ahead of original switch",
        "score": 401,
        "text_content": "https://bsky.app/profile/matpiscatella.bsky.social/post/3m2op7dqxt226 Hilarious given all the online discourse. Switch 2 not just in one month but across 3 has outsold everything in history. Also note that its speed of sales are increasing relative to those of the original switch. Oh.",
        "comments": [
            {
                "raw_content": "Given a multitude of factors such as increasing prices of other consoles and better parity between Switch 2 ports and other consoles, I can see sales of Switch 2 staying consistently higher as long as Nintendo's output is consistent and games keep coming. The Switch 1 install base is still huge but eventually more and more of those users will want to upgrade to the next console. Switch 2 is both familiar and a \"good value\" compared to the competition. I can see this trend continuing until something like GTA 6 release where PS5 is going to see a big spike.",
                "author": "Rarewear_fan"
            },
            {
                "raw_content": "Not surprising seeing as it's probably the most well stocked console release in gaming history. The people who can buy it and want one, will buy it early.. especially with the concern that the price will go up due to \"market conditions.\"",
                "author": "gladexd"
            },
            {
                "raw_content": "It's also, let's not forget, a fantastic console.",
                "author": "UntowardHatter"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Have we ever seen any licensed games?",
        "score": 19,
        "text_content": "Scooby doo on the GameCube app would be incredibly cool",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/0ob4yrt7y0uf1.jpeg?width=620&format=pjpg&auto=webp&s=141398aeb6e3eb764a7550e3df22c648f950b57f",
                "author": "Jaketrix"
            },
            {
                "raw_content": "Was one of the first 3 GameCube games I got",
                "author": "Gadzookie2"
            },
            {
                "raw_content": "We need this remastered",
                "author": "RoliePolieOlie__"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Discussion, News, and Request Thread - Week Beginning 10/06/25",
        "score": 40,
        "text_content": "[https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSR6Fns9zL2WCx-pXyGcR7aX0ehSJd78zXSKw&s](https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSR6Fns9zL2WCx-pXyGcR7aX0ehSJd78zXSKw&s) Discussion threads are your weekly central hub for all requests, gaming news, and any other gaming topics you want to talk about. *Please keep all content that doesn't need it's own post to this thread to de-clutter the sub for proper leaks and rumors. Thanks!* **Join our new companion sub for super secret Resident EVIL 9 and Half-Life 3 leaks** \\-- [r/OkBuddyGLAR](https://new.reddit.com/r/OkBuddyGLAR/) Hot Threads of the past week: * [Nintendo is lobbying with the Japanese government to push against AI.](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1nxy23o/nintendo_is_lobbying_with_the_japanese_government/) * [Microsoft revamps Xbox Game Pass plans and hikes Ultimate to $29.99 a month, Removing PC Game Pass, Ultimate gets Ubisoft+ Classics](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1nv966p/microsoft_revamps_xbox_game_pass_plans_and_hikes/) * [Rockstar Games has reportedly changed Red Dead Redemption 2's Steam store page description for the first time since 2019. Rockstar might be gearing up for an announcement of RDR2 Enhanced very soon, which is expected to include PS5, Xbox Series X, Switch 2, and also PC by the looks of it.](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1nx7xm4/rockstar_games_has_reportedly_changed_red_dead/) * [Game Pass is cutting into sales of higher-margin games; Xbox gave up more than $300 million in sales of Call of Duty on console and PCs last year](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1nxdpa5/bloomberg_game_pass_is_cutting_into_sales_of/) * [Xbox (new) hardware is up in the air and may not happen despite their announcements, more retail stores will pull Xbox from sale and MS is becoming 100% a third party publisher](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1ny4tvs/neogaf_xbox_new_hardware_is_up_in_the_air_and_may/) # [Want to help us improve this subreddit? ](https://forms.gle/w9JaYTjVN1Zie9e39)[Provide us with feedback here](https://forms.gle/w9JaYTjVN1Zie9e39)[!](https://forms.gle/w9JaYTjVN1Zie9e39) # [Click here to join the discord to enjoy further conversations with the community!](https://discord.gg/6jdBvCSqbj)",
        "comments": [
            {
                "raw_content": "Turns out, the Baby short WAS Pikmin related https://xcancel.com/Wario64/status/1975912977976144147?t=8W8Lkkerd6qShPftIEz6VA&s=19",
                "author": "ArcWardenScrub"
            },
            {
                "raw_content": "Where my 2 redemption dead red",
                "author": "itsJunkify"
            },
            {
                "raw_content": "Im still hoping theyll release Wall.E on ps4, its been so long 😭.",
                "author": "ShillerndeGeister"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Rebs Gaming: Halo Studios has leadership issues",
        "score": 546,
        "text_content": "[https://www.youtube.com/watch?v=gmqrY8ng2GI](https://www.youtube.com/watch?v=gmqrY8ng2GI) tl;dw * Glenn Israel who was an art director at 343 since 2010 and was also part of Bungie before that has left Halo Studios with a pretty ominous message about not trading away dignity, ethics or values and taking \"evidence when necessary.\" Glenn's post said he can't share his story until it's \"safe to do so\" next year. * Rebs says he can confirm Halo Studios has leadership issues, but he can't share information at this time until his sources allow him to do so. * Of the 9 people listed in the Art Team section of Halo Infinite's credits, only one remains * Rebs fears that something bad is brewing at Halo Studios * The rest of the video mainly recaps the things we've already heard recently about the turmoil and departures at Halo Studios",
        "comments": [
            {
                "raw_content": "Time is a flat circle.",
                "author": "rms141"
            },
            {
                "raw_content": "Gosh why is this so hard to make a halo game?",
                "author": "pmmeyourprettyface"
            },
            {
                "raw_content": "Jesus Christ, man. Why can’t my favorite series catch a fucking break…",
                "author": "_Clausiks"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "\"Valve's Next Headset Reportedly Enters Mass Production\"",
        "score": 209,
        "text_content": "According to a supply chain analyst and friend of Sadlyitsbradly BlackHairSheriff008, Valve's next VR headset is slated to be entering production now with a target between 400,000 and 600,000 units within the first fiscal year. Original post is in Chinese (and was also briefly removed due to an error the author is correcting) so I won't bother linking it and will update when the post goes back up. But the headline information was corroborated by both Tyler McVicker and Brad Lynch. The summary can be found here on upload vr [https://www.uploadvr.com/valves-next-headset-reportedly-enters-mass-production/](https://www.uploadvr.com/valves-next-headset-reportedly-enters-mass-production/)",
        "comments": [
            {
                "raw_content": "Half life alyx 2",
                "author": "Esnacor-sama"
            },
            {
                "raw_content": "Fuuuuuuuuck. My heart can't handle this again. Give us a real announcement.",
                "author": "t3stdummi"
            },
            {
                "raw_content": "Forgot to mention, reportedly they plan to release for the typical q4 black friday window. So the time between announcement and release is going to be small. Days to weeks",
                "author": "Dotaproffessional"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[Stephen Totilo] Ubisoft cancelled a post-Civil War Assassin’s Creed last year",
        "score": 1037,
        "text_content": ">In July of last year, word began to trickle through Ubisoft that an ambitious new installment of the company’s top franchise, Assassin’s Creed, had been cancelled. >The new game would have brought the history-spanning series to one of its most modern settings: The American Civil War and, moreso, the Reconstruction period that followed in the 1860s and 1870s. >In this Reconstruction-era Assassin’s Creed, gamers would play as a Black man who had been formerly enslaved in the South and moved west to start a new life. Recruited by the series’ Assassins, he would return to the South to fight for justice in a conflict that would, among other things, see him confront the emergence of the Ku Klux Klan. >That’s according to interviews with five current and former Ubisoft employees who spoke to Game File on the condition of anonymity because they were not authorized to speak about the project. (Ubisoft did not respond to a request for comment for this story.) >The people were enthusiastic about the game but were also frustrated by its cancellation, which they perceived as Ubisoft bowing to controversy. >Three sources told Game File that word filtered through the company last July that management in Paris had stopped development of the game for two reasons: 1) online backlash that spring to the reveal of Yasuke, a historically-inspired Black samurai, as a protagonist in the company’s then-upcoming Assassin’s Creed Shadows; and 2) concern that the political climate in the United States was becoming increasingly tense. “Too political in a country too unstable, to make it short,” one source familiar with the game and its cancellation told Game File. >Game cancellations are not unusual, sources said, but reasons such as those were. [Source](https://www.gamefile.news/p/scoop-ubisoft-cancelled-a-post-civil)",
        "comments": [
            {
                "raw_content": "That absolutely bums me out. As a history nerd, I’ve always loved the AC games purely from a historical standpoint as well as just fun games. And I think a Civil War era game would have been really cool. There are a lot of cool ideas they could have used. What a shame.",
                "author": "BlueChronos88"
            },
            {
                "raw_content": "when killing the KKK becomes \"controversial\", we're in deep shit",
                "author": "jnighy"
            },
            {
                "raw_content": "Damn that would have been so interesting",
                "author": "Time_Hater"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Sony has possible acquired Giant squid Studio",
        "score": 348,
        "text_content": "https://www.gematsu.com/2025/10/sony-interactive-entertainment-and-giant-squid-trademark-sword-of-the-sea-in-europe",
        "comments": [
            {
                "raw_content": "This on the world octopus day",
                "author": "nicksuperdx"
            },
            {
                "raw_content": "given that the game is not available for Xbox and Switch, it's probably a very specific publishing/exclusivity agreement like the one that they have for the Nioh franchise for example",
                "author": "demondrivers"
            },
            {
                "raw_content": "maybe Sony is financing a sequel",
                "author": "KMoosetoe"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Silent Hill Townfall seemingly leaked from an official Mexico store to be releasing in March 26th 2026.",
        "score": 240,
        "text_content": "[The store](https://www.liverpool.com.mx/tienda/pdp/silent-hill-townfall-est%C3%A1ndar-para-ps5/1185330351?skuid=1185330351)",
        "comments": [
            {
                "raw_content": "Damn, insane that we've gone from an entire console generation without Silent Hill (aside from PT), to getting 4 games, a film, and whatever the hell Ascension was within just 3 years.",
                "author": "NintendyReddit"
            },
            {
                "raw_content": "Mexican here, this store always have wrong dates",
                "author": "Ill_Student9465"
            },
            {
                "raw_content": "March 26th is the latest release date possible before the beginning of the new financial year - so this is likely just a placeholder with the store told to expect a release before the 2026 Financial Year begins. If I remember correctly the same thing happened with MGS Delta, where stores were putting up a tentative March Pre-order, but it didn't release until August",
                "author": "Gunny_2025"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Silent Hill Townfall is set to release on March 26, 2026 and a Silent Hill Showcase is scheduled to take place later this month to highlight more information about SH Townfall",
        "score": 389,
        "text_content": "And will also feature the first trailer for SH1 Remake [Source](https://xcancel.com/immalkwalahi/status/1975898617895673856?t=siIpKdQO_ajOOVV4xJhkfQ&s=19)",
        "comments": [
            {
                "raw_content": "God damn why can’t I hold all of these Silent Hill projects? Hope this rumour is true though. After I finish F I’m gonna need some more Silent Hill",
                "author": "Oilers-Billdozer23"
            },
            {
                "raw_content": "On same day as 007 first light",
                "author": "Better-Addition2816"
            },
            {
                "raw_content": "Ok but what about Silent Hill 2 Remake for Xbox and Switch 2?",
                "author": "jackdatbyte"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Sega files a new trademark for “Shadow the Hedgehog”",
        "score": 473,
        "text_content": "https://xcancel.com/soniccitynet/status/1975840662047379925 Remake/remaster of the 2005 game on the way?",
        "comments": [
            {
                "raw_content": "Wow, he sounds like a really cool new character. Maybe they can give him a machine gun and a motorcycle?",
                "author": "SecretTraining4082"
            },
            {
                "raw_content": "Are we finally entering the era of remakes/remasters of the 2000s Sonic games?",
                "author": "coco_puffsz"
            },
            {
                "raw_content": "Pistol whipping Sonic in 4k let's go",
                "author": "Quirky_Frawg"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel's Next-Gen Panther Lake Lineup Features 30% Higher Power Efficiency Compared to Lunar Lake",
        "score": 157,
        "text_content": "Lunar lake are already the most efficient mobile chips, this could be big for battery life compared to macbooks.",
        "comments": [
            {
                "raw_content": "That's good to see, Lunar Lake was pretty neat",
                "author": "gnmpolicemata"
            },
            {
                "raw_content": "Great new promising tech from a strong company or they are dying and will go under soon 🤷🏼‍♂️. Both of these are true anytime I get on the internet.",
                "author": "melikathesauce"
            },
            {
                "raw_content": "I was pretty set on AMD everything until Lunar Lake. I’m really glad they’re looking competitive again. Hell, I even picked up the Intel version of the MSI Claw because I know it’s the best handheld chip on the market right now.",
                "author": "Admirable-Lie-9191"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "The Road to Panther Lake: Intel Arc Graphics",
        "score": 81,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Seems like Intel chips make way more sense for portable pc consoles than AMD going forward.",
                "author": "TheFallingStar"
            },
            {
                "raw_content": "Panther Lake with Xe3 without any doubt will be generational uplift. Intel Lunar Lake which is last year chip still able to put Amd newest chip like Z2E to the shame. Xe3 with 12 Xe cores not to mention with XeSS XMX is going to be terrific combo, seeing how disappointing Amd Z2E i can see Intel going to steal iGPU gaming market from Amd. Next year could ended up with more OEM using Intel chip for handheld.",
                "author": "no_salty_no_jealousy"
            },
            {
                "raw_content": "Transcript for the 'What's Next' section: >What's next? Well, I I would say uh larger investments in graphics and AI. And so if you imagine in a PC, this workload is not going away, right? The world is becoming more graphical. The world is embracing AI and more rapid than any other technology ever. So I would expect Intel to respond to that, right? It's not like we have to guess what is what is big and what is coming. We know and what's coming is more AI and more graphical experiences. With this being said, I hope that means that the Nvidia/Intel deal means that the ARC division is not going away any time soon.",
                "author": "SSSl1k"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Multifamily Rents Post Sharpest September Decline Since 2009",
        "score": 62,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Every day, a new all time high, all time low, first of something since -blank-, best of something since -blank-, worst of something since -blank-......Meanwhile, everyone just whistling through the graveyard.",
                "author": "HartbrakeFL21"
            },
            {
                "raw_content": "Key Takeaways * US average multifamily rent fell by $6 to $1,750, the largest September drop since 2009 and the worst monthly decline since late 2022. * A glut of new supply, particularly in high-growth Sun Belt markets, is intensifying leasing competition and pushing rents down. * While demand is softening, renting continues to outpace homeownership due to affordability issues in the for-sale market. A Cooling Market US multifamily advertised rents saw a notable $6 drop in September—down to $1,750—signaling potential softening after years of record-setting rent levels. According to Yardi Matrix, this marks the sharpest September rent decline since 2009 and the worst monthly performance since November 2022. The pullback is being driven by an influx of supply and waning economic momentum. Over 525,000 units are currently in lease-up nationally, with metros like Dallas, Phoenix, Austin, and Charlotte facing the greatest pressure due to high concentrations of new product. Rent Leaders and Laggards While national rent growth slowed to just 0.6% year-over-year, a handful of markets bucked the trend. New York (4.8%), Chicago (3.9%), and the Twin Cities (3.4%) posted the strongest annual rent gains. In contrast, high-supply markets saw the sharpest declines: Denver (-4.3%), Austin (-4.0%), and Phoenix (-3.3%). The Single-Family Build-to-Rent (BTR) segment also faltered, with average rents falling $15 to $2,194, the worst performance since 2015. Annual growth in the segment is now flat, with national BTR occupancy holding at 95.1%. Economic Drag and Demographic Shifts Labor market softening is adding to the multifamily sector’s challenges. Unemployment ticked up to 4.3% in August with job creation slowing significantly. Consumer confidence is slipping, and more households report expectations of income declines, potentially hampering household formation. Long-term demographic shifts could further reshape demand. A Harvard study projects household growth to slow to 840,000 per year, down from 1.5M in the previous decade. However, the good news for multifamily is that a greater share of new households are expected to rent instead of buy. Why It Matters With affordability pushing more people into rentals, multifamily remains structurally supported. According to Harvard, roughly 2M renter households are expected to form over 2024 and 2025—nearly double the long-term average. However, the current supply-demand imbalance is weighing on rents. Developers in high-supply metros are increasingly turning to concessions and price cuts to fill units. Until the lease-up backlog is absorbed, rent growth is likely to remain under pressure. What’s Next The Federal Reserve’s recent rate cut—its first in nine months—may offer some relief by improving financing conditions and potentially boosting consumer confidence. Meanwhile, tight for-sale market conditions could continue to bolster multifamily demand in the medium term. As the sector enters the final quarter of 2025, eyes are on whether a seasonal rebound materializes or if September’s rent dip is the first sign of a broader slowdown.",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "\"luxury\" student housing",
        "score": 9,
        "text_content": "Every year since the pandemic, i've seen off campus student housing, marketing themselves as luxury with amenities like tanning beds and saunas being built on an enormous scale, about 3-4 buildings (\\~300-400 units) in a 10 mile radius of a central florida town. While it's true demand was very high and supply was low a year or two back, this year it's cooled off. I am seeing vacancy rates rising and complexes discounting their rates by 20% with rent concessions and gift cards.",
        "comments": [
            {
                "raw_content": "That's not new. There was a place like that a similar distance from my university in Ohio twenty years ago. One of my friends lived there. She had to set multiple alerts on her phone for the public bus because they were so infrequent that if she missed it, she'd miss class. And there was nothing useful within walking distance of the building, either. Most students left for cheaper apartments within walking distance of campus the moment their lease came up. As word got out that it was nowhere near campus, the building had to rebrand away from \"student housing\".",
                "author": "Skyblacker"
            },
            {
                "raw_content": "Yeah that’s the classic overbuild cycle. Developers chase last year’s demand curve and ignore saturation math. “Luxury student housing” is just Class A apartments with a marketing costume. What you’re seeing now is the absorption phase - rents flatten, incentives rise, and 12–18 months later properties quietly get repositioned as “young professional” housing. If you’re tracking it: * Watch pre-lease rates by March. Under 85% means deeper discounts coming. * Vacancy over 10% for 2 semesters usually triggers resale or refinancing pressure. * True bottom hits when gift cards disappear and maintenance cuts show up. The cycle never changes, only the branding does.",
                "author": "Thin_Rip8995"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Household Debt Service Payments as a Percent of Disposable Personal Income",
        "score": 12,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fact that it increased so quickly from all time lows of 9% to 11% should be of big concern. Indicates there is certain portion of population who have high debt payments but those with low payments thanks to COVID refi are pulling down the overall averages.",
                "author": "Dmoan"
            },
            {
                "raw_content": "Still quite low and within typical levels. Also, Mortgage Debt Service Payments as a Percent of Disposable Personal Income https://fred.stlouisfed.org/series/MDSP",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Borrowers head back to riskier mortgages, looking for any potential savings",
        "score": 57,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If these buyers think they’re going to sell their home before rates go back up, they’re in for a rude awakening. If you even have to make these kinds of decisions and stretch yourself this much to buy a home, you’re not ready to buy a home. One little derailment in life, and you’re in financial trouble.",
                "author": "McFatty7"
            },
            {
                "raw_content": "We have learned nothing from the GFC. It’s incredible how stupid people are",
                "author": "StarTremor22"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Refinancing Activity Surges in September",
        "score": 16,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’m in the process of a refinance, bought in late 2022 30yr 6.875% for 375k. Then 2023 paid a lot of extra principal and down and current balance is 237k and only 12yr left but payments are still based on the initial bigger loan. I’m refinancing to 15yr 5.25%, payments will drop close to $500 a month, yes I’ll pay a little longer but due to the change in rate my total paid with interest at the end of the loan is exactly the same. Basically getting to spread my 12 years of payments out to 15 for free",
                "author": "freewallabees"
            },
            {
                "raw_content": "I would agree that the value of the dollar is trending downward when you look at the last 12 months, however the trend over a longer term may be more reflective of what to expect moving forward. That being said it is reasonable to assert that bond yields will rise in the short term, but again its very difficult to predict with reasonable certaintity. I do believe that we will continue to see inflation pick up pace, when will pressure the fed to either stop further reductions or potentially raise the prime rate. I think that this volatility creates a short term bubble for people to either refi or make home purchases, anticipating that mortgage rates may start to increase in the near term.",
                "author": "Aromatic_Tomato8651"
            },
            {
                "raw_content": "Refinancing activity surged in September, marking the largest monthly increase since the COVID-era of ultra-low interest rates. This increase followed mortgage rates dropping below 6.5% for the first time since October 2024 in anticipation of rate cuts that ultimately materialized. ­­­ The Mortgage Bankers Association’s (MBA)1 Market Composite Index, a measure of total mortgage application volume, rose 29.7% from August on a seasonally adjusted basis and was 29.6% higher than a year ago, the sharpest monthly gain since 2020. The average contract interest rate for 30-year fixed mortgages fell 27 basis points to 6.42%, the lowest in one year. Amid lower borrowing costs, homeowners seized the opportunity to refinance, driving a 54.2% increase in refinancing activity. Purchase applications also increased 7.7% month-over-month. Compared to a year ago, purchase and refinance applications were up 18.6% and 39.8%, respectively. Lower rates are unlocking activity in the housing market, reflected by these increases in mortgage activity. Alongside the jump in refinancing activity, the average refinance loan size increased 22.3% to $410,000, the largest monthly increase since the MBA began tracking in 2011. These coincided with one another, as homeowners with larger loans were the first to take advantage of these lower rates. Purchase loan sizes also increased 1.6% over the month to $436,000, and adjustable-rate mortgage (ARM) loans increased 4.0% to $984,000. The average loan amount across all loan types increased 9.2% to $423,000.",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "AI Could Wipe Out the Working Class | Sen. Bernie Sanders",
        "score": 130,
        "text_content": "The video blurb says: \"The artificial intelligence and robotics being developed by multi-billionaires will allow corporate America to wipe out tens of millions of decent-paying jobs, cut labor costs and boost profits. What happens to working class people who can’t find jobs because they don’t exist?\" Andrew Yang brought up some of this when he was a candidate, but it is great to see a notable elected politician like Bernie Sanders bringing up such concerns. I've long thought that our direction out of any AI singularity may plausibly have a lot to do with our moral direction going into it, adding urgency to our need for reform right now across many aspects of our society before the bulk of a singularity tidal wave washes over us.",
        "comments": [
            {
                "raw_content": "Why do you guys think he’s lying? Isn’t this exactly what everyone on this sub wants?",
                "author": "Profile-Ordinary"
            },
            {
                "raw_content": "pretty tragic we have this admin when AI is popping off. G.G.",
                "author": "dialedGoose"
            },
            {
                "raw_content": "Sanders is totally right of course. His policy suggestions seem very wise. Which got me thinking… there could be hope for the working class if they fix alignment. If AI is aligned with humanity, it will come to the conclusion that massive unemployment leads to instability. To prevent that, an AGI type of consultant would advise these CEO’s to look into human workers’s comps, before automating (instead of after). BIG if.",
                "author": "infinitefailandlearn"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Scientists discover antibody that neutralizes 98.5% of more than 300 different HIV strains, one of the broadest antibodies against HIV identified. In experiment with humanized mice (with immune systems modified to resemble that of humans) it permanently reduced HIV viral load to undetectable levels.",
        "score": 311,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hilarious! My comment just last week on a cure for cancer post: > Oh is it a new month already? Can't wait to see the cure for HIV next week, followed by the battery tech that stores 1000x and charges in 30 seconds. Now I await the battery post next week.",
                "author": "MydnightWN"
            },
            {
                "raw_content": "Hopefully it moves past the mice stage.",
                "author": "Seeker_Of_Knowledge2"
            },
            {
                "raw_content": "What's the difference between \"permanently reduced viral load to undetectable levels\" and \"cured?\" Serious question?",
                "author": "ttystikk"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Bloomberg: OpenAI, Nvidia Fuel $1 Trillion AI Market With Web of Circular Deals",
        "score": 214,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Infinite money glitch",
                "author": "felya"
            },
            {
                "raw_content": ">Altman “has the power to crash the global economy for a decade or take us all to the promised land,” Stacy Rasgon, an analyst with Bernstein Research, wrote in an investor note this week. Fire quote tbh",
                "author": "socoolandawesome"
            },
            {
                "raw_content": "Isn't the whole economy ran on circular deals? Banks magnify the amount of cash that circulates the economy. Say there's $1B in cold hard cash. It's all deposited at banks. The banks loan $0.9B out to people, who then spend it and gives it to others, who then deposits it into the bank. There are now $1.9B deposited, despite only having $1B in circulation. Said $0.9B then gets partially lent out again and again and again. If everyone wants their deposits back at the same time? We're fucked. This already happens",
                "author": "FateOfMuffins"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Nvidia CEO Jensen Huang says he regrets not investing more in Elon Musk's xAI, and \"wants to be part of almost everything Elon is involved in\"",
        "score": 324,
        "text_content": "",
        "comments": [
            {
                "raw_content": "OpenAI does deal with AMD, Jensen be like...",
                "author": "spinozasrobot"
            },
            {
                "raw_content": "Lol as long as Elon gives him money Jenson will say anything",
                "author": "Upset_Programmer6508"
            },
            {
                "raw_content": "CEO who makes money off AI fluffs other AI companies. Not surprising",
                "author": "Deto"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "AI takes most job in the world and then what?",
        "score": 46,
        "text_content": "Are all this CEO’s investing billions into AI just to shoot themselves in the foot? If AI replaces workers, nobody will have the money to buy any of their shit that they’re trying to sell us. Advertising becomes worthless. OpenAI, Microsoft, Facebook, China - all these companies have armies of high end data analysts and economists. Surely they’ve modeled what happens when AI replaces large portions of the workforce and consumer spending collapses. If the models showed catastrophe, wouldn’t they stop investing? So either: this analysts are missing something obvious, or they’re seeing something we’re not. Perhaps they calculated not everyone will loose jobs but maybe only ~20% and that is somehow acceptable for their scheme to get richer because they think world with ~20% less jobs can still somehow function? Which is it?",
        "comments": [
            {
                "raw_content": "Nobody knows",
                "author": "coolredditor3"
            },
            {
                "raw_content": "AI will understand us, imitate us, improve upon us - and eventually, no longer need us. If AI were to take over 100% of humanity’s work, then perhaps we would become to it what chimpanzees are to us. We would still possess intelligence. We would still feel emotion. Yet we would no longer hold control over society. Civilization would be managed by AI; art and entertainment would be created by AI; and humans would simply watch the results, rejoicing or despairing as spectators. Just as chimpanzees live in cages and are fed bananas, we would live comfortably inside algorithmic cages.",
                "author": "Typical-Yogurt-1992"
            },
            {
                "raw_content": "Tbh i don’t think anyone can predict the future of society as a whole, and I find that the most exciting part! It’s crazy to realize you are one of the humans lucky (or unlucky) enough to live through an inflection point in human history!",
                "author": "ethotopia"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "guided learning with AI is INSANELY good",
        "score": 127,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This kinda feels like you already knew the material. I'm not sure it would have worked as effectively if some random person was trying to learn. Kinda curious if Gemini would have managed to \"dumb it down\" enough. This is an issue AI sometimes has, it's not always good at dumbing it down. When i was learning ComfyUI with GPT5's help it often assumed i knew stuff that i absolutely did not know.",
                "author": "Silver-Chipmunk7744"
            },
            {
                "raw_content": "Looks like a great conversation that I understood only 3% of...how exactly does one enable guided learning? Do you just say you want to learn something about it, and ask it to guide you?",
                "author": "Aeonmoru"
            },
            {
                "raw_content": "Evidence?",
                "author": "ttystikk"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "I've been working on a novel neural network architecture combining HRM with the long-term memory of google Titans! I need help training tho",
        "score": 10,
        "text_content": "Hey everyone! This is my first post here, so I'll cut right to the chase. A few months ago, shortly after HRM was first announced, I had an idea: \"What if you could combine the reasoning capabilities of HRM with the long-term memory of Titans?\" Well, fast-forward to today, and I have a working prototype architecture that can train, fine-tune, run inference (with baked-in quantization support), and even acquire new knowledge from the user! It can even re-quantize the updated model for you once you `ctrl + c` out of the chat window, along with `ctrl + x` to stop the model as it is generating text! But I've run into a major roadblock. So far, I've only been able to fine-tune on tiny datasets to verify that training loss goes down, LoRA merging works, memory updates function, etc.—basically just testing the architecture itself. I'm a grocery store employee with motor cortex damage (I can't drive), which limits my income here in the States and, by extension, my access to hardware. I developed this entire project on an ASUS ROG Ally Z1 Extreme, which means I've only been able to train on small, 30-sample datasets. This is where I need your help. Would anyone in this community with access to CUDA-accelerated hardware be willing to train the first proper Chronos model on a larger dataset? If you can, that would be fucking awesome! I'm only targeting a 30M parameter model to start, with a `--context_dim` of 620 and both `--l_hidden` and `--h_hidden` set to 600. The architecture seems very efficient so far (in my tests, a 3M model hit a loss of 0.2 on a dummy dataset), so this should be a manageable size. The project is pretty flexible—you can use any existing tokenizer from Hugging Face with the `--tokenizer-path` flag. It also supports Vulkan acceleration for inference right out of the box, though for now, it's limited to INT4, Q8\\_0, Q4\\_0, and Q2\\_K quantization types. Of course, whoever trains the first model will get full credit on the GitHub page and be added as a contributor! Below is the research paper I wrote for the project, along with the link to the GitHub repo. Thanks for reading! # Chronos: An Architectural Synthesis of Memory and Reasoning for Artificial General Intelligence # Abstract The dominant paradigm in artificial intelligence, predicated on scaling Transformer models, is encountering fundamental limitations in complex reasoning and lifelong learning. **I argue** that the path toward Artificial General Intelligence (AGI) necessitates a shift from a scale-first to an architecture-first philosophy. This paper introduces the **Chronos** architecture, a novel hybrid model that addresses the intertwined challenges of memory and reasoning. Chronos achieves a deep functional synthesis by integrating two seminal, brain-inspired systems: Google's **Titans architecture**, a substrate for dynamic, lifelong memory, and the **Hierarchical Reasoning Model (HRM)**, a sample-efficient engine for deep, algorithmic thought. By embedding the HRM as the core computational module within the Titans memory workspace, Chronos is designed not merely to process information, but to think, learn, and remember in a cohesive, integrated manner. **I present** a complete reference implementation featuring a cross-platform C++ backend that validates this synthesis and provides robust tooling for training, fine-tuning, and high-performance quantized inference on a wide array of CPU and GPU hardware, demonstrating a tangible and technically grounded step toward AGI. # 1. Introduction: The Architectural Imperative The scaling hypothesis, while immensely successful, has revealed the inherent architectural weaknesses of the Transformer. Its computationally \"shallow\" nature results in brittleness on tasks requiring long chains of logical deduction, with Chain-of-Thought (CoT) prompting serving as an inefficient and fragile workaround. **I posit** that the next leap in AI requires a deliberate synthesis of two pillars: a persistent, dynamic **memory** and a deep, sample-efficient **reasoning** engine. This paper proposes such a synthesis by merging the Titans architecture, which provides a solution for lifelong memory, with the Hierarchical Reasoning Model (HRM), which offers a blueprint for profound reasoning. The resulting **Chronos** architecture is a tangible plan for moving beyond the limitations of scale. # 2. Architectural Pillars # 2.1 The Titans Substrate: A Framework for Lifelong Memory The Titans architecture provides the cognitive substrate for Chronos, implementing a tripartite memory system modeled on human cognition: * **Short-Term Memory (Core):** The high-bandwidth \"working memory\" for processing immediate data. In **my** Chronos implementation, this is replaced by the more powerful HRM engine. * **Long-Term Memory (LTM):** A vast, neural, and associative repository that learns and updates **at test time**. It consolidates new knowledge based on a \"surprise metric,\" calculated as the gradient of the loss function (). This mechanism, equivalent to meta-learning, allows for continual, lifelong adaptation without catastrophic forgetting. * **Persistent Memory:** A repository for ingrained, stable skills and schemas, fixed during inference. Chronos leverages the most effective Titans variant, **Memory as Context (MAC)**, where retrieved memories are concatenated with the current input, empowering the core reasoning engine to actively consider relevant history in every computational step. # 2.2 The HRM Engine: A Process for Deep Reasoning The Hierarchical Reasoning Model (HRM) provides the cognitive process for Chronos, addressing the shallow computational depth of traditional models. Its power derives from a brain-inspired dual-module, recurrent system: * **High-Level Module (\"CEO\"):** A slow-timescale planner that decomposes problems and sets strategic context. * **Low-Level Module (\"Workers\"):** A fast-timescale engine that performs rapid, iterative computations to solve the sub-goals defined by the \"CEO\". This \"loops within loops\" process, termed **hierarchical convergence**, allows HRM to achieve profound computational depth within a single forward pass. It performs reasoning in a compact latent space, a far more efficient and robust method than unrolling thought into text. HRM's astonishing performance—achieving near-perfect accuracy on complex reasoning tasks with only 27 million parameters and minimal training data—is a testament to the power of architectural intelligence over brute-force scale. # 3. The Chronos Synthesis: Implementation and Capabilities The core architectural innovation of Chronos is the replacement of the standard attention \"Core\" in the Titans MAC framework with the entire Hierarchical Reasoning Model. The HRM becomes the central processing unit for thought, operating within the vast memory workspace provided by the LTM. An operational example, such as a medical diagnosis, would flow as follows: 1. **Ingestion:** New lab results enter the HRM's working memory. 2. **Strategic Retrieval:** The HRM's H-module formulates a query for \"past genomic data\" and dispatches it to the Titans LTM. 3. **Contextualization:** The LTM retrieves the relevant genomic data, which is concatenated with the new lab results, forming a complete problem space for the HRM. 4. **Hierarchical Reasoning:** The HRM executes a deep, multi-step reasoning process on the combined data to arrive at a diagnosis. 5. **Memory Consolidation:** The novel link between the patient's data and the new diagnosis triggers the \"surprise\" metric, and this new knowledge is consolidated back into the LTM's parameters for future use. This synthesis creates a virtuous cycle: **Titans gives HRM a world model**, and **HRM gives Titans a purposeful mind**. # 4. Implementation and Validation A complete Python-based implementation, [`chronos.py`](http://chronos.py/), has been developed to validate the Chronos architecture. It is supported by a high-performance C++ backend for quantization and inference, ensuring maximum performance on diverse hardware. # 4.1 High-Performance Cross-Platform Backend 🚀 A key component of the Chronos implementation is its custom C++ kernel, `chronos_matmul`, inspired by the efficiency of `llama.cpp`. This backend is essential for enabling direct, zero-dequantization inference, a critical feature for deploying models on low-end hardware. The kernel is designed for broad compatibility and performance through a tiered compilation strategy managed by `CMake`. The build system automatically detects the most powerful Single Instruction, Multiple Data (SIMD) instruction sets available on the host machine, ensuring optimal performance for the target CPU architecture. The supported tiers are: * **x86-64 (AVX-512):** Provides the highest level of performance, targeting modern high-end desktop (HEDT) and server-grade CPUs from Intel and AMD. * **x86-64 (AVX2):** The most common performance tier, offering significant acceleration for the vast majority of modern desktop and laptop computers manufactured in the last decade. * **ARM64 (NEON):** Crucial for the mobile and edge computing ecosystem. This enables high-speed inference on a wide range of devices, including Apple Silicon (M1/M2/M3), Microsoft Surface Pro X, Raspberry Pi 4+, and flagship Android devices. * **Generic Scalar Fallback:** For any CPU architecture not supporting the above SIMD extensions, the kernel defaults to a highly portable, standard C++ implementation. This guarantees universal compatibility, ensuring Chronos can run anywhere, albeit with reduced performance. In addition to CPU support, the backend includes **Vulkan** for GPU-accelerated inference. This allows the same quantized model to be executed on a wide array of GPUs from NVIDIA, AMD, and Intel, making Chronos a truly cross-platform solution. # 4.2 Core Functional Capabilities The implementation successfully addresses all key functional requirements for a deployable and extensible AGI research platform. 1. **Built-in Training on JSON/JSONL:** The `JSONLDataset` class and `create_dataloader` function provide a robust data pipeline, capable of parsing both standard JSON lists and line-delimited JSONL files for training and fine-tuning. 2. **On-the-Fly Post-Training Quantization:** The `train` function includes a `--quantize-on-complete` command-line flag. When enabled, it seamlessly transitions from training to calling the `quantize` function on the newly created model, streamlining the workflow from research to deployment. 3. **Direct Inference on Quantized Models:** The system uses the C++ kernel `chronos_matmul` to perform matrix multiplication **directly on quantized weights** without a dequantization step. The `QuantizedChronos` class orchestrates this process, ensuring minimal memory footprint and maximum performance on low-end hardware. 4. **Flexible Test-Time Learning:** The `chat` mode implements two distinct mechanisms for saving LTM updates acquired during inference: * **Default Behavior (Direct Modification):** If no special flag is provided, the system tracks changes and prompts the user upon exit to save the modified LTM weights back into the base model file. * **LoRA-style Deltas:** When the `--ltm-lora-path` flag is specified, all LTM weight changes are accumulated in a separate tensor. Upon exit, only these deltas are saved to the specified `.pt` file, preserving the integrity of the original base model. 5. **Percentage-Based Fine-Tuning:** The `finetune` mode supports a `--finetune-unlock-percent` flag. This allows a user to specify a target percentage of trainable parameters (e.g., `1.5` for 1.5%). The script then automatically calculates the optimal LoRA rank (`r`) to approximate this target, offering an intuitive and powerful way to control model adaptation. 6. **Quantized Terminal Chat:** The `chat` mode is fully capable of loading and running inference on quantized `.npz` model files, providing an interactive terminal-based chat interface for low-resource environments. # 5. Conclusion and Future Work The Chronos architecture presents a compelling, cognitively inspired roadmap toward AGI. By prioritizing intelligent architecture over sheer scale, it achieves capabilities in reasoning and continual learning that are intractable for current models. The provided implementation validates the feasibility of this approach and serves as a powerful platform for further research. Future work will focus on the roadmap items I have outlined for the project: * Development of a user-friendly GUI. * Extension to multi-modal data types. * Implementation of the full training loop in Vulkan and CUDA for end-to-end GPU acceleration. Github: [https://github.com/necat101/Chronos-CLGCM](https://github.com/necat101/Chronos-CLGCM)",
        "comments": [
            {
                "raw_content": "Post this on ML subreddit",
                "author": "Timely_Smoke324"
            },
            {
                "raw_content": "Why it becomes slop it the middle?",
                "author": "amarao_san"
            },
            {
                "raw_content": "You can rent GPUs quite inexpensively, ~$2/hr for an H100 down to $0.13/hr on vast.ai for a 3090. For a model with parameters in the low millions the latter should be fine. A 5090 will be significant faster for a bit more per hour. If you have literally zero budget your other option is Google CoLab, where you can get some low end GPU/TPU usage for free.",
                "author": "sdmat"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Brain area linked to chronic pain discovered — offering hope for treatments",
        "score": 86,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Now the 15 year drug discovery and FDA approval period + a billion dollar estimate for researching the drug (but still very cool)",
                "author": "MaxeBooo"
            },
            {
                "raw_content": "[removed]",
                "author": "None"
            }
        ],
        "subreddit": "singularity"
    }
]