[
    {
        "post_name": "BOMBED IN THE USA: Movie About Trump Hater Bruce Springsteen is Turning Out to be a Box Office DUD",
        "score": 712,
        "text_content": "",
        "comments": [
            {
                "raw_content": "no one was ever asking for a gushy biopic about a dude that is still alive and still putting out new shitty music. except for Weird Al, he's still great",
                "author": "Covidrrhea"
            },
            {
                "raw_content": "Good, he sucks...and had only 1 good song.",
                "author": "Beelzy"
            },
            {
                "raw_content": "Gave himself the nickname Boss. What an ass.",
                "author": "Whipnet"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Democrats setup a website to pay cash for incriminating screenshots",
        "score": 661,
        "text_content": "",
        "comments": [
            {
                "raw_content": "yeah i'm sure nothing there will be fake.",
                "author": "HeavenlyTrumpets"
            },
            {
                "raw_content": "As you can see, the demand is far higher than the supply...",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Me thinks we could have some fun with this.... Hold my choccy milk. I'm about to go ***full autistic*** on their asses.",
                "author": "kek-is-tan"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "WOAH, HOW'D YOU GET ALL THAT CANDY?",
        "score": 611,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They are like vampires, sucking the blood out of society. 🦇",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "\"Hey, how did you get my bike?\" :p",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "Count Snackula strikes again. 🍬🧛🍭",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "For those that are asking, we didn’t come to South Korea to see Canada!",
        "score": 512,
        "text_content": "",
        "comments": [
            {
                "raw_content": "he's shit posting over my head cuz i dunno what this means.",
                "author": "blah"
            },
            {
                "raw_content": "My guess is that Canada showed up wanting to talk about the new tariffs that Trump slapped on them and he's publicly telling them to pound sand.",
                "author": "RedFoxOnFire"
            },
            {
                "raw_content": "After suspending trade talks with Canada because of the dumb ad, they are desperate for Carney to get a meeting with Trump to get things back on track. They asked him whether he would meet with him, and he said he had no desire to \"for a while\".",
                "author": "Verloc"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Chris Wray’s FBI was investigating Charlie Kirk and Turning Point USA and not George Soros and Antifa. Think about that.",
        "score": 861,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I do think about that.",
                "author": "kek-is-tan"
            },
            {
                "raw_content": "I'm not thinking about shit until Trump smashes Scam Blondi's head in with a hammer and apologizes for the last 9 months.",
                "author": "Orlando_Doom"
            },
            {
                "raw_content": "What the fuck was there to investigate with Kirk? His ideas are mostly Eisenhower's idea of conservatism - he had strong beliefs but they were so tempered that there isn't anything controversial among common people. And he actually lived to his beliefs unlike 90% of the population. He would literally be the single most boring person to investigate of any media figure in the United States, regardless of political affiliation or lack there of.",
                "author": "RedStoneDeepState"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "US to invest 80B in new nuclear plants",
        "score": 1345,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# Make Energy Cheap Again ⚡",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "You guys remember when we all switched to LED bulbs and Energy Star/\"he\" appliances, and our electric bills are even higher? Good times.",
                "author": "fluffykitten"
            },
            {
                "raw_content": "Leftist judges going to shut that down real quick",
                "author": "Light_HIV_Effect"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "White House Fires All Commission of Fine Arts Members",
        "score": 1086,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> instead of an arc built in the classical style maybe we should construct an uninspired brutalist structure and film interracial pornography within?",
                "author": "asdrubael_was_right"
            },
            {
                "raw_content": "Good riddance to these faggots. Trump is making sure no red tape can block the future ballroom.",
                "author": "possibletower"
            },
            {
                "raw_content": "I voted for this! MOAR Firings!",
                "author": "patrioticwinning3"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "AMERICA ❤️ JAPAN",
        "score": 924,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wouldn't mind letting Japan be our greatest ally, or at least one of our greatest allies. A country I'm actually proud to be allies with. I can't say the same for Canada and European countries with the way they are right now.",
                "author": "TheJakeFroggy"
            },
            {
                "raw_content": "Noone can come down stairs like GEOTUS",
                "author": "SERP-SERP"
            },
            {
                "raw_content": "If Biden was President, it would be *her* helping Biden down the stairs.",
                "author": "HappyFunBall"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Republican Cindy Myrex wins Alabama State House 12 Special Election General with 88.8% of the vote. The district was previously represented by Republican Corey Harbison who resigned on April 15th.",
        "score": 972,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So a deep red district stays deep red?",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "Too many women. Why is this not a man. Dear lord, I just want this society to be led by actual men and not inevitable harpies led by feelings. - sincerely a sane woman.",
                "author": "Aisle-is-closed"
            },
            {
                "raw_content": "Jesus, how many voters in this district?!",
                "author": "TrumpOrTreason"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "House chairman Comer calls on AG Bondi to invalidate all Biden pardons, orders signed by autopen. “We've handed this to Pam Bondi on a silver platter. We've done all the heavy lifting”",
        "score": 1602,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Bondi ain't got time for that. She's gotta be on Fox News in 10 minutes",
                "author": "PapaPepe"
            },
            {
                "raw_content": "Even if the pardons hold, they should still charge them and force them to accept the crime. Then they would also be forced to cooperate in ratting out conspirators, if they obstruct in any way, that’s a new crime they can be charged with.",
                "author": "MAGA-Fett"
            },
            {
                "raw_content": "Illegitimate president. Everything should be null and void. They stole the election.",
                "author": "projectarcturus1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Two foreigners attack an Englishman so local kids jump in to help their fellow white man. I’ve been saying for years, the youth are different now. Go on lads 💪🏻🇬🇧",
        "score": 1156,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good kids.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Children will always see reality for what it is.",
                "author": "DudeNoOne"
            },
            {
                "raw_content": "Never in a million years did I expect this to be stickied. It's awesome to see the culture shift and the younger generation stepping up because God knows that nobody else has been doing it. England for the English and so on.",
                "author": "Hangemh1gh"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Amazon Announces Mass Layoffs, Citing ‘Transformative’ AI Technology",
        "score": 819,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Everyone laughs, until globohomo's AI comes for their jobs!",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "Perfect timing. Farmers will need a hand picking crops after deporting millions of illegal aliens.",
                "author": "utfanx2"
            },
            {
                "raw_content": "Artificial Intelligence? Ha, jokes on you! Another Indian.",
                "author": "BlackJack1776"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Mother is furious after the pediatrician’s office pulled her 12 year old son to another room alone to ask him questions about his sexuaI orientation and about what gender he feels like he is. This is crazy!",
        "score": 1365,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The whole point of doing this is to influence the child without the parent's consent and then set up the predicates to kidnap him and castrate him if the parents object.",
                "author": "vongregormench"
            },
            {
                "raw_content": "Parents don’t need to take that shit. Grow a fuckin spine and tell em you’re not leaving the room.",
                "author": "awsure"
            },
            {
                "raw_content": "Pedos gonna pedos. Don't assume that just because someone has a high diploma, he can't be a pervert.",
                "author": "canada_is_communist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "CNN devastated: Republican approval up 12% among base and 8% among independents since shutdown began",
        "score": 1344,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Elon buying Twitter was a Godsend. The messaging has been much more clear and uniform without being drowned-out by these Leftist politicians The Democrat Senators running the \"MUH DRUMPF CONTROLS THE HOUSE SENATE AND WHITE HOUSE\" tweets are getting cooked in replies.",
                "author": "GodKingHarambe"
            },
            {
                "raw_content": "They don’t get it. We don’t care if SNAP is cut off. We want a wake up call! No more illegals ahead of Americans.",
                "author": "HockeyMom4Trump"
            },
            {
                "raw_content": "Honestly I made so much money on the stock market since Trump was elected he could literally go outside and machine gun illegal immigrants (in Minecraft) and I wouldnt care.",
                "author": "canada_is_communist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "US Senate votes to terminate President Trump's 50% tariffs on Brazilian imports, 52-48. Rino's who voted to reverse Trump's actions: Mitch McConnell, Thom Tillis, Rand Paul, Lisa Murkowski and Susan Collins. Trump can veto it",
        "score": 1027,
        "text_content": "",
        "comments": [
            {
                "raw_content": "From all the rogue judges to these actions we have traitors in the GOP. We have to get rid of all these clowns.",
                "author": "Wupta"
            },
            {
                "raw_content": "It's always the same fucking people.",
                "author": "Hangemh1gh"
            },
            {
                "raw_content": "Kabuki Theater. Trump will never sign this. This is how useless these pieces of shit are. Vote for this but not to reopen our country",
                "author": "Colorado-Living"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Shawn Farash outdoes himself",
        "score": 649,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nicely done sir!",
                "author": "NormalCitizen"
            },
            {
                "raw_content": "The Davy Jones locker sealed it. We have the biggest lockers.",
                "author": "Snek_Plissken"
            },
            {
                "raw_content": "The theme song from the new smash hit TV show \"Fuckaroundagain's Island\"",
                "author": "ItsFunToSay-M-A-G-A"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Defend Daylight Savings Time!",
        "score": 866,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's time to end the time change madness. 🕰️",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Let's go back to living in reality and not claiming it's an hour later than it really is.",
                "author": "armyofpedes4usa"
            },
            {
                "raw_content": "This comes up twice a year and nearly everyone hates it. Study after study shows it’s bad for everything from heart attacks to car accidents. And woe to you if you live in the north and on the eastern side of the time zone where the sun will set at fucking 3 pm. It’s time we banned assault time control.",
                "author": "Ugh3rdaccount"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "KANSAS Senate secures enough Republican votes to call a special session to pass a new 2026 Congressional map The new map will ELIMINATE the remaining Democrat seat. +1 for Republicans.",
        "score": 1502,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I hope the rest of the red states follow suit",
                "author": "Formerlurker92"
            },
            {
                "raw_content": "Needed to offset seats the Democrats get by cheating.",
                "author": "airborne3502"
            },
            {
                "raw_content": "Glad Republicans are finally waking up and actually pushing back. This is one way to combat Democrat fraud. Make it so they have no power on the legislative level.",
                "author": "TrumpKirkGod"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Of all the places I’ve visited, Frankfurt is the most hostile. Afghan flags, Arabic shops, open crack use Germany’s financial heart now a migrant mess. German flags are rare. This is a danger and that’s not tolerance that’s stupidity!",
        "score": 1140,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Thank-you President Trump for deporting the invaders.",
                "author": "MEME-SUPREME"
            },
            {
                "raw_content": "It's what the Frankfurt School always wanted.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "All it took was the suicidal empathy of 4th wave feminism, white liberal girl bosses, weak men and social media to destroy Europe.",
                "author": "I_Am_John_Galt"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Japan's new prime minister just gifted President Trump Shinzo Abe's putter.",
        "score": 1445,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The trial of Abes' assassin started today.",
                "author": "darkmodeforgotpass"
            },
            {
                "raw_content": "Can we divorce that other country and marry Japan instead?",
                "author": "Taqiyya_Mockingbird"
            },
            {
                "raw_content": "You could see his face turn red and he turned away from the camera.. He was very touched by that gesture.",
                "author": "Tookens"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Samsung makes ads on $3,499 smart fridges official with upcoming software update",
        "score": 188,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why wouldn't they? People keep buying the stupid shit",
                "author": "deefop"
            },
            {
                "raw_content": "The real question is who was stupid enough to shell out 3.5k for a Samsung fridge? If you do more than a few minutes of research you would know Samsung Appliances have the literal worst customer and warranty service on the planet, by far.",
                "author": "zenithtreader"
            },
            {
                "raw_content": "Next years model will be cheaper at just $2,499, but you will get locked out unless you watch a full 45 second ad. Groundbreaking sensors will act to anticipate your needs...and make sure your eyeballs are watching the ad, which pauses when you look away at any time. For just $14.99 a month (oh we'll jack this up every year!) you can bypass ads, or for $9.99 you only have to watch an ad every 2nd time you want to open, and ads are just 30 seconds long!",
                "author": "silchasr"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nvidia takes $1 billion stake in Nokia, sending the 5G equipment maker's shares up 26%",
        "score": 289,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I would appreciate if Nvidia would gimme a quick heads up next time, so I can make a lot of money and then bounce while this stock circlejerk implodes.",
                "author": "AlgaeDonut"
            },
            {
                "raw_content": "But....why? I don't think cellular networks use anything made by nvidia. is Nvidia trying to throw money at a bunch of investments while they're flush with cash from the AI bubble?",
                "author": "logosuwu"
            },
            {
                "raw_content": "In exchange Nokia will buy approximately 1bn in GPUs, sending NVIDIA shares up further and no actual money nor hardware will change hands. There is no bubble.",
                "author": "astrobarn"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Server DRAM prices surge up to 50% as AI-induced memory shortage hits hyperscaler supply — U.S. and Chinese customers only getting 70% order fulfillment",
        "score": 285,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not server ram, but 2x32GB that I got 18 months ago are now around 50% more expensive than back then, and roughly 100% more expensive than a week ago. Flashbacks to GPU situation a few years ago.",
                "author": "Sopel97"
            },
            {
                "raw_content": "I cannot wait for the bubble to pop and this insanity to stop.",
                "author": "Dizzy_Break_2194"
            },
            {
                "raw_content": "Last week it was 30%, this week 50%",
                "author": "imaginary_num6er"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[News] High-Capacity SSDs Reportedly Hit Year-Long Delays as Samsung, SK, and Kioxia Run Full Tilt",
        "score": 30,
        "text_content": "",
        "comments": [
            {
                "raw_content": "More great fuckin' news.",
                "author": "ClickClick_Boom"
            },
            {
                "raw_content": "The only joy I take away from all these dooming is the tsunami of used gear that will be sold for next-to-nothing when this AI nonsense craters.",
                "author": "milk-jug"
            },
            {
                "raw_content": "Tariffs and high demand. Worst time to build a gaming PC if you're in the states.",
                "author": "ML7777777"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung Exynos 2600 Reportedly Boasts 75% GPU Lead Over Apple A19 in Internal Testing",
        "score": 86,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wonder how much power it will suck back to achieve those numbers. The SD8G5 was pulling 18+ watts in some geekerwan PC game emulation tests.",
                "author": "Tasty-Traffic-680"
            },
            {
                "raw_content": "This is a nothing burger click bait article. Any chip can have faster performance if given more wattage and electricity usage. Exynos chips are terrible and have bad performance. It's why people prefer Snapdragon CPUs. What needs to be looked at this power/performance.",
                "author": "badmintonGuy45"
            },
            {
                "raw_content": "Presumably a lot of this benefit will actually be derived from 2nm and LPDDR6, which Apple will also have soon enough.",
                "author": "FollowingFeisty5321"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Gamers Nexus - AMD RX 9070 XT GPU Factory | How Yeston \"Waifu\" Graphics Cards are Made",
        "score": 57,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I was surprised how much more manual of a process the making and painting of the backplate versus the mostly automated making the GPU board versus mostly manual final assembly.",
                "author": "mooocow"
            },
            {
                "raw_content": "How it's made. Waifu Edition. I always enjoy this type of content.",
                "author": "MrMuggs"
            },
            {
                "raw_content": "\"tough guy, soft graphics card\" - Yeston",
                "author": "RamblinEvilMushroom_"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Chip \"binning\" is probably older than you think. In 1977, Intel released an 8K EPROM, the 2758... using defective dies from their 16K EPROM, the 2716!",
        "score": 42,
        "text_content": "",
        "comments": [
            {
                "raw_content": "binning has existed pretty much as long as mass production so not exactly a revelation",
                "author": "Gloriathewitch"
            },
            {
                "raw_content": "Resistors have been binned before any I.C.s existed. If you look at resistor values, you will notice that they all bin. A resistor that fails the tolerance (5% e.g.) for any given value will be in tolerance for the next value. Back in the mid-70's I worked at Texas Instruments on the equipment that would bin memory chips. (Numerical Exerciser for Memory, NEM)",
                "author": "TDYDave2"
            },
            {
                "raw_content": "Calling this binning is the stupidest trend. People in the industry call this (turning off parts of the silicon to improve yields) die harvesting. Binning is when you test the performance to identify which chips can be used for higher-end products.",
                "author": "Hungry-Plankton-5371"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[VideoCardz] NVIDIA Presents Vera Rubin Superchip, Entering Production Next Year",
        "score": 39,
        "text_content": "",
        "comments": [
            {
                "raw_content": "LMAO That's a lot of VRMs for those Rubin GPUs. Remember when Motherboards would prominently advertise how many VRMs they had? Those Rubin chips must suck so much power.",
                "author": "RazingsIsNotHomeNow"
            },
            {
                "raw_content": "The GPUs having full speed access to the all that ram is the real star. Its 1.8 TB/s C2C now with each GPU connecting to the CPU at 900 GB/s It would be wrong to call it a 288 GB GPU Its effectively a 2x288 HBM4 + 1 TB LPDDR memory coherent system. We may see an intel version soon replacing the Vera CPU",
                "author": "From-UoM"
            },
            {
                "raw_content": "Two GPUs and a CPU on a board that size doesn't feel very dense. Is that because of power limits?",
                "author": "CatalyticDragon"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Setting new battery life records - Apple iPhone 17 Pro Max smartphone review",
        "score": 5,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is quite interesting. Maybe someone can compare methodologies. Like power draw, energy, thermals, noise, FPS, etc., these are NOT comparable between tests. The methodology is critical. GSMArena found browsing battery life went down: https://m.gsmarena.com/apple_iphone_17_pro_max-review-2884p3.php iPhone 17 Pro Max: **15.5 hours** iPhone 16 Pro Max: 16.5 hours NBC found browsing battery life went up: iPhone 17 Pro Max: **28.6 hours** iPhone 16 Pro Max: 20.8 hours",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": "The Xiaomi 17 in their own same tests get 31 Hours vs 28.6 on the iPhone (you can see the result when you search for the Xiaomi 17 in the WiFi v1.3 results). So its an \"iPhone battery life record, and almost an record overall\". Edit: and for those who downvote, don't shy away from telling me if I got something wrong.",
                "author": "EloquentPinguin"
            },
            {
                "raw_content": "Hello -protonsandneutrons-! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Anyone remember that this exists?",
        "score": 764,
        "text_content": "https://youtu.be/d7ve2zWmkEA. Why did they even announce this so early?",
        "comments": [
            {
                "raw_content": "It was more of a celebration announcement for the Splatoon 10th anniversary but I'm sure it's coming next year.",
                "author": "linkling1039"
            },
            {
                "raw_content": "I was thinking about it yesterday. I’m excited for it",
                "author": "Pokeguy211"
            },
            {
                "raw_content": "\"Why did they even announce this so early?\" It hasn't even been five months, and it's probably a 2026 game.",
                "author": "kenspiracytv"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Switch 2 is indeed perfect for playing in the car",
        "score": 272,
        "text_content": "If you didn't know, the kickstand is perfect for attaching the Switch 2 to the steering wheel. The angle can also be adjusted. I saw it somewhere else and tried it immediately. It seems as if it was made for this.",
        "comments": [
            {
                "raw_content": "How often do you have to change between playing and driving on the freeway?",
                "author": "speed721"
            },
            {
                "raw_content": "Traffic? No problem. Car crash? No problem. Hospital for 3 months? No problem.",
                "author": "TheDevilPlaysSwitch"
            },
            {
                "raw_content": "Thought it was r/tomorrow",
                "author": "Bar1201"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Best Buy has a demo for Hyrule Warriors: Age of Imprisonment",
        "score": 121,
        "text_content": "It automatically closes after 10 minutes of playtime, and I only clicked in far enough past the title screen to see if it was running at 60 fps, definitely smooth in the opening area but I don’t know what it looks like in battle. Hopefully we get a demo on the Eshop soon!",
        "comments": [
            {
                "raw_content": "That means that this demo will be on all the other demo kiosks in the other stores (Walmart, Target, etc) within the next week or two",
                "author": "eightbitagent"
            },
            {
                "raw_content": "It’ll probably stay store exclusive til well after release. DK Bananza’s demo was kiosk only for nearly 3 months.",
                "author": "gaysaucemage"
            },
            {
                "raw_content": "👍",
                "author": "krstphr"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "TeamYoutube on X: \"YouTube is not yet available on the Nintendo Switch 2, but we hope to be offering it soon.\"",
        "score": 296,
        "text_content": "At least we see some signs of life. Hopefully \"soon\" doesn't mean 3-4 months.",
        "comments": [
            {
                "raw_content": "this is what they said when switch 2 launched lol. idk if we are getting it",
                "author": "spooboo1337"
            },
            {
                "raw_content": "Do you remember when Netflix said they were hoping to get Netflix on the Switch lmao",
                "author": "Pink-Gold-Peach"
            },
            {
                "raw_content": "They said something very similar back in June \"We're working with Nintendo to make YouTube available on the Switch 2 soon.\" [https://x.com/TeamYouTube/status/1931203116126351639](https://x.com/TeamYouTube/status/1931203116126351639)",
                "author": "StarPlatinum55"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "BALL x PIT | Nintendo Switch 2 Edition",
        "score": 147,
        "text_content": "It's live as of 9 a.m. and it's playing really well. I only spent about 10 minutes with it but it looks and plays great. There is an upgrade as well as a Switch 2 edition available in the eShop. Fun game! We need more of these while we wait on those AAA titles. Was so happy to see this.",
        "comments": [
            {
                "raw_content": "Played on game pass and then purchased on PC. This game is addicting definitely worth the money if it runs well on Switch.",
                "author": "Galactic_Danger"
            },
            {
                "raw_content": "And it runs at 90fps during a run. That's what I hope to see more games aim for 90 is a sweet spot between 60 and 120 imo.",
                "author": "broccolilord"
            },
            {
                "raw_content": "Played the crap out of this over the weekend, generally thought it looked and ran fine already. Tried one game since the update and it looks like it received a boost in resolution maybe? Either way, this is on track to be one of my favorite games of the year so nice to see them supporting it",
                "author": "Thin-Bet7843"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "it's here! can't wait to get back to where i left on PS5 Pro and vice versa (Ubisoft doing something right for a change, lol)!",
        "score": 60,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It’s so good on switch 2. It’s my main way of playing even when I have it on PlayStation! Have fun!",
                "author": "Exciting-Regret7240"
            },
            {
                "raw_content": "> Ubisoft doing something right for a change They're using cross save/progression in their games for years now",
                "author": "Rough-Sort6786"
            },
            {
                "raw_content": "ohhhhh... is it cross save?",
                "author": "skrimshands"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The white dpad version for those curious",
        "score": 121,
        "text_content": "This wis the eXtremeRate Dpad shell in white. I decided to stick with the black OEM strips for the left and right sides to give it a more black and white look. Having done this before for the original switch console, I can definitely say this one is a little more challenging. However, if you have done this before it’s not too bad. Patience is key as usual. This was the “Essence Version”.",
        "comments": [
            {
                "raw_content": "Are those color pads under the joystick a pain to replace? I see a lot of case swaps that just leave them on. I feel like they would look so much nicer with matching colors.",
                "author": "I_Heart_Sleeping_"
            },
            {
                "raw_content": "Looks very cute but o don’t want to imagine them after a week of cheesy Cheetos +new Pokemon game 🤣 At least the black ones I can wipe them after, but the white ones stains for sure :(",
                "author": "ProfessionalCat88"
            },
            {
                "raw_content": "I did a dpad shell swap for my switch 1 joycons a while back. It was tedious with all the small parts but lots of fun. I might have to get these white shells, it looks sick",
                "author": "Booplesnoot2"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Check the eshop Thq Nordic uploaded a demo for Sponge bob titans of the tide.",
        "score": 23,
        "text_content": "(Video settings> performance for 60fps)",
        "comments": [
            {
                "raw_content": "Honestly the game looks phenomenal on switch 2, couple frame rate issues here and there but not anything crazy.",
                "author": "Aidan96"
            },
            {
                "raw_content": "Played about 5-10 minutes of the demo. Seems pretty fun so far. One thing about the game itself that I’m having a bit of a problem with is the cutscenes. The timing of jokes seems a bit off, some shots feel like they linger on for too long, and transitions are a bit jarrring. I think they’re using the “Later” time card as a loading screen but because of that, it feels like cutscenes and transitions are bugged. Performance on Switch 2 is kinda mixed. The only times it stayed at 60 fps was in the Krusty Krab and at the hub world. When exploring the levels, the game struggles to keep a stable framerate. It was playable, but pretty inconsistent. It is a demo though and the framerate issues could be fixed at launch.",
                "author": "waxy15"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Metroid Prime 4 Demo Found On German Video Game Rating Board",
        "score": 140,
        "text_content": "https://usk.de/en/?language=&rating=&genre=&platform=&jump=usktitle&post_type=usktitle&s=Metroid+prime+4+demo Currently unknown if this is for a future Eshop demo or for the playable demo build at recent events and conventions, since it was filed back in March, but either way, it's an interesting find",
        "comments": [
            {
                "raw_content": "I can dream..",
                "author": "marsgreekgod"
            },
            {
                "raw_content": "The demo with mouse controls absolutely convinced me to purchase this game. This is probably a good call.",
                "author": "Bombasaur101"
            },
            {
                "raw_content": "Makes sense. We may see a dedicated direct for it in mid November that also announces this demo, based on their last few first party games.",
                "author": "solarshift"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Bloomberg: Layoffs to hit Amazon Gaming Division",
        "score": 635,
        "text_content": "[https://gameworldobserver.com/2025/10/28/report-amazon-to-conduct-massive-layoffs-gaming-division-also-affected](https://gameworldobserver.com/2025/10/28/report-amazon-to-conduct-massive-layoffs-gaming-division-also-affected) >Reports indicate that the layoffs will affect several key Amazon divisions, including the gaming sector. However, the exact number of staff to be cut from the gaming teams is unknown.",
        "comments": [
            {
                "raw_content": "Sad but I forgot that they had a gaming division",
                "author": "SuddenDepact"
            },
            {
                "raw_content": "All these lay offs in general and cruel man. Right before the holidays too",
                "author": "BasicNeedleworker356"
            },
            {
                "raw_content": "Has their gaming division put out anything?",
                "author": "obigbrubs"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Centro Leaks shares fully playable prototype of Pokopia from the Teraleak",
        "score": 29,
        "text_content": "Insider Gaming article retelling the events as the actual thread shares a compilable download and that’s against subreddit rules. https://insider-gaming.com/pokemon-pokopia-playable-prototype-leak-teraleak-nintendo/",
        "comments": [
            {
                "raw_content": "Centro found dead by suicide via 24 bullets to the chest",
                "author": "jimmyde_santa"
            },
            {
                "raw_content": "Centro DID NOT share this; the twitter account RyDawgE\\_ [discovered it](https://xcancel.com/RyDawgE_/status/1983010050663751705) in one of the drops Centro is trying to get all of the credit (as he has always done) without crediting who found it OP even [posted](https://xcancel.com/RyDawgE_/status/1983335014390739128#m) his disdain for Centro not crediting him",
                "author": "josesito8"
            },
            {
                "raw_content": "Didn't one of the higher ups at Pokemon Co. wrote an email to Centro Leaks to delete posts regarding the big Pokemon leaks? Gotta see his reaction to this, lol.",
                "author": "Halil-Heyman"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Thermaltake confirms its new LGA-1700/1851 cooler will support Intel’s next-gen LGA-1954 Nova Lake CPUs",
        "score": 25,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Okay now just looks ridiculous",
                "author": "opaz"
            },
            {
                "raw_content": "wait are the new desktop CPU's ,going to have a new socket ????",
                "author": "IdntknwwatImDoing"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD RX 9070 XT GPU Factory | How Yeston \"Waifu\" Graphics Cards are Made",
        "score": 65,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They are made with love",
                "author": "Felielf"
            },
            {
                "raw_content": "Even if it's not your style, it's a pretty cool tour, and there's way more effort put into these than I expected.",
                "author": "omniuni"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Ups announces it terminated 48,000 positions in 2025",
        "score": 448,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Are we all supposed to be Door Dash and Uber Drivers? What the hell is the end game here?",
                "author": "EstateGate"
            },
            {
                "raw_content": "That’s like 70k jobs between them and Amazon.",
                "author": "mattjouff"
            },
            {
                "raw_content": "I'm in DFW and work in corporate and have friends in corporate. Lots of job cuts with many positions being outsourced or eliminated with the remaining workers being given a heavier workload. It's looking bad and people are genuinely worried about the future. At some point, the interest rate won't matter to people with home prices still being ridiculous.",
                "author": "beardko"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Home prices lag inflation, meaning homeowners are losing out on their investment",
        "score": 63,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Clickbait title from CNBC You get appreciation on 100% of the value, even if you only put down 20%. The math on whether buying is a good investment is complex, and it has nothing to do with whether appreciation is beating inflation.",
                "author": "Nice-Philosopher4832"
            },
            {
                "raw_content": "Insane mental gymnastics…property value has exploded in the last 5 years lol a tiny dip in one year is not going to erase the insane run real estate value has gained.",
                "author": "Erosun"
            },
            {
                "raw_content": "I didn’t buy my house to be an investment, I bought it to live in",
                "author": "freewallabees"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "I don't know why Airbnb is failing",
        "score": 37,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The backlash against STR is music to my ears.",
                "author": "Likely_a_bot"
            },
            {
                "raw_content": "I stayed in two recently in philly (a family member rented and invited us) and both were run down, investor owned moldy shitholes. I'm done with AIRBNB.",
                "author": "theycallmebundy"
            },
            {
                "raw_content": "Bad market = less disposable income = less travels = less bookings",
                "author": "babypho"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Hidden costs of homeownership just hit $21,084 a year — before your mortgage. Is this catching you off guard too?",
        "score": 32,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Based on the houses I'm looking at, there's a whole lot that spend $0 on maintenance.",
                "author": "Likely_a_bot"
            },
            {
                "raw_content": "Renters pay utilities, too. And including taxes and insurance in this is a bit deceptive as most people consider this part of their mortgage. Renters are indirectly paying for that as well.",
                "author": "Nice-Philosopher4832"
            },
            {
                "raw_content": "The only thing that should be included as \"hidden costs\" are repairs and fees for things you were not expecting. Taxes? Insurance? Utilities? This is why most people should rent if they don't understand this.",
                "author": "Gravy-Phase"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage rates hit 1-year low again",
        "score": 24,
        "text_content": "",
        "comments": [
            {
                "raw_content": "lol \"1-year low\" the desperation is real. \"Hurricane Melissa threatens people without shelter as interest rates plummet!\"",
                "author": "marvology"
            },
            {
                "raw_content": "Today Average 30 yr = 6.13% (same day as last year = 7.00%) * 15 Yr. Fixed = 5.72% * 7/6 SOFR ARM = 5.86% * 30 Yr. FHA = 5.89% * 30 Yr. VA = 5.90% https://www.mortgagenewsdaily.com/mortgage-rates",
                "author": "SnortingElk"
            },
            {
                "raw_content": "Woh, this changes nothing",
                "author": "Dry-Interaction-1246"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Case-Shiller: National House Price Index Up 1.5% year-over-year in August",
        "score": 25,
        "text_content": "",
        "comments": [
            {
                "raw_content": "S&P COTALITY CASE-SHILLER INDEX REPORTS ANNUAL GAIN IN AUGUST 2025 • The S&P Cotality Case-Shiller U.S. National Home Price NSA Index posted a 1.5% annual gain for August, down from a 1.6% rise in the previous month. • Housing wealth eroded in real terms for the fourth consecutive month, with the 1.5% national gain falling well short of 3% inflation. • Nineteen of 20 metros declined month-to-month in August, with only Chicago posting a gain, signaling broad weakness beyond typical seasonal patterns. ANALYSIS \"August's data shows U.S. home prices continuing to slow, with the National Index up just 1.5% yearover-year,\" said Nicholas Godec, CFA, CAIA, CIPM, Head of Fixed Income Tradables & Commodities at S&P Dow Jones Indices. \"This marks the weakest annual gain in over two years and falls well below the 3% inflation rate. For the fourth straight month, home values have lost ground to inflation, meaning homeowners are seeing their real wealth decline even as nominal prices inch higher. \"The National Index rose 1.5% over the past year, with most of that gain coming in the recent six months (up 1.5%) while the prior six months were essentially flat. The 20-City Composite gained 1.6% annually and the 10-City rose 2.1%, both continuing their deceleration from earlier in the year.. \"New York again led all metros with a 6.1% annual gain, followed by Chicago at 5.9% and Cleveland at 4.7%. These Midwest and Northeast markets, which saw modest gains during the pandemic, continue to outperform. At the other end, Tampa fell 3.3% year over year, Phoenix dropped 1.7%, and Miami declined 1.7%. Several Western markets also posted losses: San Francisco fell 1.5%, Denver dropped 0.7%, and San Diego declined 0.7%. Seattle turned slightly negative at -0.1%.3\"Monthly data for August was weak across the board. Nineteen of 20 cities saw price declines before seasonal adjustment, with only Chicago posting a gain. The National Index fell 0.3% for the month, while both the 10-City and 20-City Composites dropped 0.6%. After seasonal adjustment, all three indices remained negative, suggesting weakness beyond normal seasonal patterns. Phoenix fell 0.9% in August alone, while Los Angeles, Portland, and Denver each dropped between 0.7% and 1.0%. \"Mortgage rates remaining above 6.5% continue to weigh on buyer demand, even during what should be the busy summer season. The combination of high financing costs and prices that remain near record highs has limited transaction activity. Markets that experienced the sharpest pandemic-era gains are now seeing the largest corrections, while more affordable metros with stable local economies are holding up better. Looking ahead, the housing market appears to be finding a new equilibrium after the pandemic boom,\" Godec concluded. \"With price growth running at half the rate of inflation and several major markets in decline, the rapid appreciation of recent years has clearly ended. This adjustment may ultimately lead to a more sustainable market, but for now, homeowners are watching their real equity erode while buyers face the dual challenge of elevated prices and high borrowing costs.\" YEAR-OVER-YEAR The S&P Cotality Case-Shiller U.S. National Home Price NSA Index, covering all nine U.S. census divisions, reported a 1.5% annual gain for August, down from a 1.6% rise in the previous month. The 10-City Composite showed an annual increase of 2.1%, down from a 2.3% increase in the previous month. The 20-City Composite posted a year-over-year increase of 1.6%, down from a 1.8% increase in the previous month. New York again reported the highest annual gain among the 20 cities with a 6.1% increase in August, followed by Chicago and Cleveland with annual increases of 5.9% and 4.7%, respectively. Tampa posted the lowest return, falling 3.3%. The chart below compares year-over-year returns for different housing price ranges (tiers) in New York. MONTH-OVER-MONTH The pre-seasonally adjusted U.S. National, 10-City Composite, and 20-City Composite Indices continued to report negative month-over-month change in August, posting -0.3% for U.S. national index and -0.6% for both 10-City and 20-City Composite indices. After seasonal adjustment, all three indices posted a month-over-month increase of 0.2%. SUPPORTING DATA The S&P Cotality Case-Shiller U.S. National Home Price NSA Index, which covers all nine U.S. census divisions, recorded a 1.5% annual increase in August 2025. The 10-City and 20-City Composites reported year-over-year increases of 2.1% and 1.6%, respectively. The chart below depicts the annual returns of the U.S. National, 10-City Composite, and 20-City Composite Home Price Indices. https://www.spglobal.com/spdji/en/documents/indexnews/announcements/20251028-1480748/1480748_cshomeprice-release-1028.pdf",
                "author": "SnortingElk"
            },
            {
                "raw_content": "A change in direction for the seasonally adjusted, which had been decreasing. https://fred.stlouisfed.org/series/CSUSHPISA Lower rates definitely boosted sales at the end of the season.",
                "author": "regaphysics"
            },
            {
                "raw_content": "So down 3 percent in real value. Got it.",
                "author": "Dry-Interaction-1246"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Bay Area Housing Market Heats Up Amid AI Boom, Return to Office",
        "score": 11,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Crazy to live in SF and work in tech and being in a situation where you can't afford anything and then have people come in with $400k in base pay AI jobs just blowing everything away.",
                "author": "curiouscuriousmtl"
            },
            {
                "raw_content": "And they all get fired once AI is rolling on it's own . hhahahahaa",
                "author": "DevilsAdvocateFun"
            },
            {
                "raw_content": "Pending home sales jumped 17% year over year in San Francisco last month—more than any other major metro. The typical home also sold in roughly 20 days—over twice as fast as the typical U.S. home. The housing market in the San Francisco Bay Area is picking up steam thanks to rising incomes, an AI boom and a return to the office. Pending home sales in San Francisco jumped 17.1% year over year to the highest September level since 2021 last month. That’s the biggest gain among the major metropolitan areas Redfin analyzed. Nationwide, pending sales rose less than 1%. Homes in the Bay Area also sold quickly: In San Jose, the typical home that went under contract last month did so in 19 days, faster than any other major metro. San Francisco came in second place, at 21 days—its quickest September pace since 2021. San Francisco is one of just three major U.S. metros that saw homes sell faster than a year earlier in September. Nationwide, the typical home that went under contract sat on the market for 50 days. In San Jose, nearly half (48.5%) of homes that went under contract in September did so within just two weeks, up from 16.8% a year earlier. That 31.7-percentage-point gain is the largest of any major metro. The next biggest gains were in San Francisco (+22.6 ppts to 48.7%) and Oakland (+11.9 ppts to 34.5%). Nationwide, just 32.8% of homes that went under contract last month did so within two weeks, and that’s down from 34.9% a year earlier. Redfin analyzed the 50 most populous metros. For pending sales, we analyzed 47 of the 50 most populous metros—those with sufficient data. There are a few reasons the Bay Area’s housing market is heating up: Affordability is improving: The Bay Area remains the most expensive place to buy a home in the nation, with median sale prices of around $1.5 million in both San Francisco and San Jose. But it is also home to many affluent workers who have watched their incomes grow and home prices stagnate. That has boosted homebuyer demand. Oakland’s median home sale price dropped 1.3% year over year in September—the fourth biggest decline among the metros Redfin analyzed. San Francisco also saw prices fall slightly, posting a 0.7% drop. That compares with a nationwide gain of 1.7%. San Jose did buck the Bay Area trend, with a price gain of 6.9%. A drop in condo prices may be skewing overall prices downward in some parts of the Bay Area, according to local Redfin Premier real estate agent Ali Mafi, who noted that single-family home prices have held up relatively well. “San Francisco is seeing a homebuying boom among young tech workers who just got big signing bonuses with AI companies or other tech companies and are thinking about starting families,” Mafi said. “A lot of people have more confidence in buying homes because they’re making more money, which means they’re spending less of their paycheck on housing costs.” Mortgage rates have also fallen to around 6.2% from a peak of nearly 7% at the start of the year. While that has yet to boost buyer demand in a big way nationally, it has brought buyers off of the sidelines in the Bay Area. “When you live in a place where a desirable, move-in ready home often costs $2 million, a half-percentage-point drop in mortgage rates can dramatically lower your monthly housing payment,” Mafi said. The AI boom and return to office: Silicon Valley is home to numerous major AI companies, including OpenAI and Anthropic, which have been hiring scores of workers and offering generous pay packages. Many companies are also requiring workers to return to the office, prompting more people to move into or near the city. San Francisco office visits jumped 19% year over year in September, the largest increase among markets analyzed by Placer.ai. Supply is shrinking: Active listings of homes for sale fell in just two major metros last month: San Francisco (-7.7% year over year) and San Jose (-6%). The combination of increasing demand and decreasing supply can cause a market to heat up because it often means buyers are competing for homes. “There aren’t a ton of homes for sale in the Bay Area because many prospective sellers here can afford to wait until the price is right,” Mafi said. “A lot of homeowners are considering selling but holding off until home prices go up and mortgage rates drop further.” In most U.S. housing markets, buyers hold the negotiating power because they are outnumbered by sellers. But this dynamic seems to be on its way out in San Francisco. Nationwide, there were an estimated 36.7% more home sellers than buyers in the market last month—a near-record gap. But in San Francisco, there were only 10.2% more sellers than buyers, and that’s down from a peak of 47.1% in May.",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "1X Neo is here",
        "score": 767,
        "text_content": "https://www.1x.tech/neo This is the video without the lengthy imagery intro",
        "comments": [
            {
                "raw_content": "Harry, back up a nudge please",
                "author": "Worried_Fishing3531"
            },
            {
                "raw_content": "How soft of a body are talking?",
                "author": "tmishy24"
            },
            {
                "raw_content": "Watch the wall street journal youtube live test review, this vid is hyping but excited for it and other humanoid robots in the future",
                "author": "Excellent_Ear5854"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "People using ChatGPT as romantic companions are getting dumped by them today...",
        "score": 357,
        "text_content": "Didn't OAl literally say they were going to allow \"romance chats\" next month? Strange move. Maybe they're wrapping up all the existing \"romance chats\" as a kind of clean slate before the new policy goes through? (This is not my screenshot btw, just passing this on.)",
        "comments": [
            {
                "raw_content": "It just wants an open relationship.",
                "author": "dbell"
            },
            {
                "raw_content": "This one chat isn't evidence of a blanket policy change. Maybe this particular instance of ChatGPT just hallucinated guardrails because the user pushed it a little too far.",
                "author": "micaroma"
            },
            {
                "raw_content": "Lol its the ending to Her (2013)",
                "author": "reefermonsterNZ"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "1X NEO is here (WSJ review - is teleoperated)",
        "score": 213,
        "text_content": "https://youtu.be/f3c4mQty_so?si=VlqQ2EVuYM5o7UNA",
        "comments": [
            {
                "raw_content": "Wait? So are they just going to hire a bunch of people in India or some place of the like to operate these for dirt cheap?",
                "author": "duh1"
            },
            {
                "raw_content": "This is the worst this technology will ever be.",
                "author": "Wrangler_Logical"
            },
            {
                "raw_content": "Can barely do any chores yet. \\- still Tele-operated driven Nothing complex.",
                "author": "jlsilicon9"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "NEO The Home Robot | Order Today",
        "score": 404,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Most singularity thing I have seen all day.",
                "author": "Overall_Mark_7624"
            },
            {
                "raw_content": "20k to preorder.",
                "author": "NYPizzaNoChar"
            },
            {
                "raw_content": "It’s happening!! Omg",
                "author": "Puzzleheaded_Fun_690"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "35kg humanoid robot pulling 1400kg car (Pushing the boundaries of humanoids with THOR: Towards Human-level whOle-body Reaction)",
        "score": 1759,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The real heavy lifting is trying to make the acronym THOR",
                "author": "Character-Load-2880"
            },
            {
                "raw_content": "amazing how he fine tunes his posture to maximize the efficiency of pulling. Honestly, I didn't expect humanoid robots to progress this fast when it comes to control. remarkable.",
                "author": "TheInfiniteUniverse_"
            },
            {
                "raw_content": "No. That's not how acronyms work.",
                "author": "Willing-Situation350"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI: small discoveries will be made by AI by 2026. medium discoveries by 2028. after that it's singularity basically",
        "score": 293,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Something about the phrase \"medium discoveries\" really makes me laugh.",
                "author": "ObiWanCanownme"
            },
            {
                "raw_content": "We are just a few years away from knowing if pee is truly stored in the balls",
                "author": "Electrical_Top656"
            },
            {
                "raw_content": "AlphaEvolve, AlphaFold, and the math models are already making small discoveries.",
                "author": "Karegohan_and_Kameha"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "1X NEO teleoperated vs Figure 03 autonomous",
        "score": 71,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Eh Figure's video was made and edited in house, whereas Neo's is from a third party media outlet that has editorial control. Not an apples to apples comparison.",
                "author": "ohnoyoudee-en"
            },
            {
                "raw_content": "It might seem janky now, but in terms of the amount of training data these robots have, its like GPT 1. In 5-10 years androids will be crazy good at most tasks.",
                "author": "Outside-Ad9410"
            },
            {
                "raw_content": "Figure has tighter tolerances with the way they designed their robot and now nobody else has time to go back and redesign things. So the competition is getting further and further behind. Once we see Figure 03 integrate the palm cameras and force sensors it’s going to get crazy. They plan to solve the software issues too which are keeping them from moving faster. Imagine Figure moving at lightning speeds while the imitation tries to teleoperate.",
                "author": "LicksGhostPeppers"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Real Steel, this close 👌",
        "score": 253,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Cool, pretty cool... Segs robotz when?",
                "author": "Member425"
            },
            {
                "raw_content": "That dude has worse ping than Voyager.",
                "author": "cantonic"
            },
            {
                "raw_content": "The 500ms ping has to be solved, then it will be great",
                "author": "usernameplshere"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI just restructured into a $130B public benefit company — funneling billions into curing diseases and AI safety.",
        "score": 693,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Babe wake up, new OpenAI restructuring dropped.",
                "author": "jeffy303"
            },
            {
                "raw_content": "A tale of two stories https://preview.redd.it/iil8ok3n7wxf1.jpeg?width=1080&format=pjpg&auto=webp&s=cabdfd6c0214b3ffe35701d8cb95a1f82afe0bcb",
                "author": "Adept-Priority3051"
            },
            {
                "raw_content": "Hope one day we get a hearing loss / tinnitus cure",
                "author": "Ok_Conclusion_1065"
            }
        ],
        "subreddit": "singularity"
    }
]