[
    {
        "post_name": "📆 Trump ANNOUNCEMENT at Quantico at 11AM ET tomorrow...",
        "score": 671,
        "text_content": "",
        "comments": [
            {
                "raw_content": "80% of these generals are Leftist, woke, DEI- hire, Communist careerists. Re-assign, retire, and fire them. Then re-build the leadership with true warriors who know how to fight.",
                "author": "BenDoverAssho"
            },
            {
                "raw_content": "fire them all please. And court martial traitor Milley.",
                "author": "Choppermagic"
            },
            {
                "raw_content": "Someone's getting laid off.... There are approximately 900 Active-duty general/flag officers (GO/FOs) today of 1.3 million troops. This is a ratio of 1 GO/FO for every 1,400 troops. During World War II, an admittedly different era, there were more than 2,000 GO/FOs for a little more than 12 million Active troops (1:6,000). This development represents “rank creep” that does not enhance mission success but clutters the chain of command, adds bureaucratic layers to decisions, and costs taxpayers additional money from funding higher paygrades to fill positions. https://ndupress.ndu.edu/Media/News/News-Article-View/Article/1325984/are-there-too-many-general-officers-for-todays-military/",
                "author": "USMC6541E5"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING - The EU is mandating that Americans visiting nearly 30 countries, including France, Germany, Spain, and Italy, must surrender fingerprints, biometric data, and photographs for government storage under their new “Entry Exit System.”",
        "score": 641,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Do they do the same with invaders?",
                "author": "MeMargie"
            },
            {
                "raw_content": "The EU can GO POUND SAND ...who the hell wants to be in their I.D. \"data bank\"...WTH ??? 👹...they can (& SHOULD) expect DRASTIC CUTS TO \"tourism\" to E.U. henceforth😡Their new “Entry Exit System” IS A PRELUDE TO any tyrannical goof-balls THAT WANT TO ROUND UP THOSE THEY DON'T LIKE😡 #SerialNumberTatoos 2.0 👿😱",
                "author": "PatriotLady1"
            },
            {
                "raw_content": "FYI, all these Euro trash countries have ALWAYS been this way. They tried to act like they were quasi free speech for a bit. THEY ARE NOT. These are all totalitarian governments. The votes do not count. The next phase is a war with Russia. They must do this or their counties implode and attack them internally. They must lock up speech and send millions to to meat grinder.",
                "author": "FlyinHeadlock"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump: Mamdani Will Be ‘One of the Best Things to Ever Happen to Our Great Republican Party’",
        "score": 534,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There’s that losing is winning again",
                "author": "NotMyGovernor"
            },
            {
                "raw_content": "Trump ain't wrong. Come 2028 NYC will be so cooked with Muslamification and Murder.",
                "author": "BidenShowerDrool"
            },
            {
                "raw_content": "Move The Statue of Liberty to Florida. There's no place for her under that dirty bastard.",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Gavin Newsom Escalates Rhetoric That Makes Political Violence Inevitable",
        "score": 481,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Because no repercussions. Why stop?",
                "author": "Here_we_go"
            },
            {
                "raw_content": "Born & raised Californian here. I can’t wait to read this asshole’s obituary.",
                "author": "YT45"
            },
            {
                "raw_content": "They talk like this because they know it gets them the results they are looking for. They know exactly what they are doing.",
                "author": "bringbackthe80s"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "An Antifa thug threatened to “smoke” reporter Nick Shirley in Portland, so a DHS sniper aimed a laser sight directly at the thug’s chest",
        "score": 1358,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why I would never be law enforcement today. I would have took the shot",
                "author": "snakeoil"
            },
            {
                "raw_content": "We are at war",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "He didn't get spooked at all. His fellow terrorist members came and got him to stop.",
                "author": "Landslide_2020"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Just in — The FBI raided a home near the Portland ICE facility as part of an investigation involving an individual shining a high-powered laser at a military helicopter performing lawful duties. Turns out the suspect was an illegal alien who is now in ICE custody.",
        "score": 1278,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Get him up in helicopter and then blind him mid flight. See how he likes it",
                "author": "Wrexxis780"
            },
            {
                "raw_content": "That is attempted murder of our servicemen.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Retarded faggots.",
                "author": "AwShitHereWeGoAgain"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "MASSIVE: Over 100,000 FEDERAL WORKERS are set to formally resign tomorrow, perhaps the largest resignation in US history from the US government, as part of President Trump's workforce reduction. Goodbye!",
        "score": 1720,
        "text_content": "",
        "comments": [
            {
                "raw_content": "MORE!",
                "author": "blackswans"
            },
            {
                "raw_content": "god i hope its all the Shaniquas",
                "author": "Gunmolester"
            },
            {
                "raw_content": "This is misleading. This is the remains of the people who took early retirement. The media is pretending this is some mass resignation to hurt Trump.",
                "author": "Emodius"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The founder of Wikipedia shares that Wikipedia has BLACKLISTED conservative news sources such as: Breitbart, Daily Caller, Epoch Times, FOX News, The Federalist, Blaze Media, The NY Post, Counter Punch, Daily Caller, and Daily Mail, Sputnik News, UNZ Review, News Nation, Newsmax, etc.",
        "score": 906,
        "text_content": "",
        "comments": [
            {
                "raw_content": "BLACKLISTED. That's appropriation. Time to sue that cuck Jimbo Wales. He's the whiny looking faggot in the popups on that site.",
                "author": "USMC1234O10"
            },
            {
                "raw_content": "We already knew wikipedia isn't a credible source of information.",
                "author": "Wrexxis780"
            },
            {
                "raw_content": "There are 64 God Tier Moderators of which only 7 have names which can be traced to actual people. The remaining 57 are all Anonymous. It was implied from the interview that these moderators can be influenced with money and favors etc. Wikipedia is a shitshow which hasn't been a relevant resource for political/philosophical/theological/ideological and other such contentious issues for the better part of 15 years. The site,much like Reddit has been hijacked by the moderators for personal gains either financially or ideologically or both.",
                "author": "BidenShowerDrool"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: YouTube Agrees to Pay President Trump $24.5 Million Settlement Over 2021 Suspension of His Account",
        "score": 2112,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Now you know why YouTube recently admitted that they were pressured into censorship by the Biden Administration. They were trying to lower the amount of the settlement.",
                "author": "McFatty7"
            },
            {
                "raw_content": "Now force Youtube to pay 24.5million to all the other accounts they shut down for the same political agenda.",
                "author": "FiresideRant"
            },
            {
                "raw_content": "Go after Reddit for banning the largest Pro-Trump forum on the internet, which interfered with the 2020 election.",
                "author": "TrumpyMadeThemGrumpy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔥🔥🔥",
        "score": 1155,
        "text_content": "",
        "comments": [
            {
                "raw_content": "lol",
                "author": "YodaBannon"
            },
            {
                "raw_content": "This is non fiction",
                "author": "Colorado-Living"
            },
            {
                "raw_content": "That's the most presidential thing I've seen all day!",
                "author": "f_bastiat"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Commies",
        "score": 728,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not paying even more money to take care of deadbeats, especially not illegal alien criminals. How about getting a fucking job, or if you're an illegal, going back to your country?",
                "author": "magapatriot_pa"
            },
            {
                "raw_content": "Typical Northeastern US ivory tower retard",
                "author": "OTher55"
            },
            {
                "raw_content": "I hate these people so much. I have no words.",
                "author": "Somebody157"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ICE helped to remove 130 truck drivers from the road last week as part of three-day enforcement operation in Oklahoma. This was one port of entry in one small town in Oklahoma. THIS IS A NATIONAL EMERGENCY!",
        "score": 1488,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Go after the employers for the love of god",
                "author": "Formerlurker92"
            },
            {
                "raw_content": "Arrest every treasonous FUCK who put these sacks of shit behind 18 wheels on our roads.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "At what point do we hold the employers accountable? They’re saving money at the cost of our safety.",
                "author": "For_All_Mankind"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "⚔️ Happening NOW Outside of the White House: Anti-Trump, pro-Hamas protesters are currently threatening President Trump’s life outside the White House by chanting, “Long live the intifada! Globalize the intifada. Donald Trump, we are at your gate.”",
        "score": 1199,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sounds like the SS should shoot them",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Im getting protest fatigue at this point",
                "author": "Colorado-Living"
            },
            {
                "raw_content": "> Long live the enchilada! > Globalize the enchilada! Mexicans?",
                "author": "kek-is-tan"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Former DOGE Worker Edward Coristine, AKA “Big Balls” Speaks Out For the First Time Since Being Beaten by DC ‘Teens’",
        "score": 927,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"Pack of teens\".",
                "author": "MrMcGreenGenes"
            },
            {
                "raw_content": "Nignogs ruin everything. Trump should really get him back onboard doing exactly what he was doing for Elon.",
                "author": "mmmpillsaregood"
            },
            {
                "raw_content": "He's got the biggest balls of them all!",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Joint Statement by Pakistan, Qatar, Jordan, UAE, Indonesia, Turkey, Saudi Arabia, and Egypt welcome US President Trump's sincere efforts to end the war in Gaza",
        "score": 878,
        "text_content": "",
        "comments": [
            {
                "raw_content": "None of the fake news channels will be reporting on this.",
                "author": "Apersonofinterest"
            },
            {
                "raw_content": "Interesting that India is not in this group.",
                "author": "duehuckleberry"
            },
            {
                "raw_content": "END all tax dollars in the litterbox of perpetual woe",
                "author": "JoeDapper"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Robinhood refuses to hire MAGA candidates",
        "score": 1190,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wow that seems like a slam dunk EEO violation and pay day for the rejected candidates.",
                "author": "GhostOfTheRepublic"
            },
            {
                "raw_content": "Shouldn't even be using that criminal app in the first place.",
                "author": "Fresnor"
            },
            {
                "raw_content": "Remember when Robinhood and others conspired in the start of 2021 to commit fraud of stock price manipulation for GameStop? Pepperidge Farms remembers.",
                "author": "DontTreadOnLego"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: JD Vance tells Democrats to SHOVE IT, says a shutdown is coming.",
        "score": 1729,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Shut it all down.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Shut it down… the country will be fine",
                "author": "awsure"
            },
            {
                "raw_content": "Not only should Trump lay off whatever federal workers he wants, but he should also make it impossible for some judge to force them back in. Sell the buildings they worked in. Delete their work flow. Deactivate and delete their email. Sell their data servers. Sell all their vehicles and equipment. Make it like their job never existed.",
                "author": "least_counties_ever"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "For those who might be depressed...",
        "score": 661,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">any can confirm. even my non-stickyworthy posts get sticky’d",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Needs more sticky spiderman thread jizz",
                "author": "YakBak"
            },
            {
                "raw_content": "I am going to steal this image and exact post and see that get sticky as well. BRB Edit: https://patriots.win/p/1AR0ivJo1u/for-those-who-might-be-depressed/c",
                "author": "DT170x"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Suspect takes off running after a Texas officer jokes about a “narcotics-smelling” horse",
        "score": 1056,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Damn that's funny",
                "author": "Stlpoolguy"
            },
            {
                "raw_content": "I was half expecting the cop to lasso the perp and hog tie him.",
                "author": "Colorado-Living"
            },
            {
                "raw_content": "Trump, as usual, was right. They aren't sending their best.",
                "author": "BlackJack1776"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Yup! https://truthsocial.com/@CitizenFreePress/posts/115289558372203429",
        "score": 1615,
        "text_content": "",
        "comments": [
            {
                "raw_content": "AOC is a worthless CUNT. A stooge for the retards with zero morality",
                "author": "SaltyKrakenBalls"
            },
            {
                "raw_content": "Whenever a Democrat says something about safety or white men. Just add, “for criminals.” “White men are bad, for criminals.” “White men are violent, against criminals.”",
                "author": "Viewer01"
            },
            {
                "raw_content": "We all wish Daniel Penny was on that subway car.",
                "author": "airborne3502"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Nvidia GeForce RTX Super GPUs will reportedly launch much later than expected",
        "score": 78,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fyi, this speculation comes entirely based on the fact the Taiwanese OEMs have not gotten any indication that the Super line exists from Nvidia, and they need about a 6-month lead time to ramp up products.",
                "author": "PastaPandaSimon"
            },
            {
                "raw_content": "I'm wondering if this will make the 5000 series Nvidia's longest lasting generation ever. Could this mean no RTX 6000 series until mid to late 2027? I'm suspecting they are trying to distance the node in use for server chips, from gaming. So they are making gaming lag behind in node advancement to create that gap to have more server supply at disgusting profit margins. 3nm for gaming, and 2nm for server? Rubin is coming out on the N3P node, and I'd imagine they want every wafer they can get a hold of to go to a data center for the next 18 months.",
                "author": "bubblesort33"
            },
            {
                "raw_content": "They could always go with the 5070Ti 16GB, 5070Ti 24GB route instead of supers",
                "author": "imaginary_num6er"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Huawei to Double Output of Top AI Chip as Nvidia Wavers in China",
        "score": 122,
        "text_content": "The Chinese company plans to make about 600,000 of its marquee 910C Ascend chips next year, roughly double this year’s level, people familiar with the matter said, asking for anonymity to discuss private information. Huawei had struggled to get those products out the door for much of 2025 because of US sanctions. Overall, the Shenzhen-based company will raise output for its Ascend product line in 2026 to as many as 1.6 million dies, the people said, describing the basic silicon components that house chip circuitry.",
        "comments": [
            {
                "raw_content": ">The upcoming Ascend 950 can only offer 6% the performance of Nvidia’s next-generation VR200 superchip, Bernstein estimates.",
                "author": "BowlCutKing"
            },
            {
                "raw_content": "[removed]",
                "author": "None"
            },
            {
                "raw_content": "I want to know how much of a hurtle software is in comparison. Even if they could make a 3nm chip today, that was like 800mm2, in real life usage, how competitive is it at AI training compared to Nvidia's ecosystem?",
                "author": "bubblesort33"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[PCGH] 180 GPUs in 16 years: HUGE benchmark comparison 2009-2025",
        "score": 134,
        "text_content": "The crazy Germans again: PCGH tested 180 graphics cards. This must be the most comprehensive 'real' comparison EVER (not just some arithmetic numbers). :O Some bullet points: \\- 180 GPUs from 2009 to 2025 (HD 5450 to RTX 5090) \\- Starting point: DirectX 11/Windows 7 \\- 4 benchmarks: 3DMark, Bioshock Infinite, Tomb Raider, The Witcher 3 The text is in German, but the benchmarks are held in English for international comprehensibility (I guess). Just use your browser's translator to get the surrounding information.",
        "comments": [
            {
                "raw_content": "This is awesome since it's hard to find comparisons for the 1070 I have to the latest releases. Wish they had more games and resolutions from the contemporary era. Although I'm an oddball playing at 2.5K144 or 5K60.",
                "author": "mduell"
            },
            {
                "raw_content": "that's.. a lot of work, very cool.",
                "author": "Flimsy_Swordfish_415"
            },
            {
                "raw_content": "Memory bandwidth stagnation is so evident. Here is ~220 different GPUs and ~70 CPUs since 2008 benchnarked in the same software, in a single bar chart: https://github.com/ProjectPhysX/FluidX3D?tab=readme-ov-file#single-gpucpu-benchmarks",
                "author": "ProjectPhysX"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "First Tests: Qualcomm's Snapdragon X2 Elite Extreme Shows Some Serious Speed",
        "score": 127,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The price and software will remain an issue. Give this drivers as good as AMD and I would give up my Macbook M4.",
                "author": "funny_lyfe"
            },
            {
                "raw_content": "Lol, first party-mediated benchmarks. Most likely the things they're comparing against are nerfed. There is no way a Zen 5-based CPU can score 18.4 in Speedometer 3.1 under normal circumstances. My quad-core Tiger Lake laptop scores more than that, and that too using Firefox, which gives \\~5% lower scores than Chromium-based browsers.",
                "author": "Professional-Tear996"
            },
            {
                "raw_content": "Are these tests plugged in or on battery? Just run the Browser Bench Speedometer 3.1 on my base M4 Macbook Pro 10 core (using Vivaldi)... got 53.4 on second run with a battery of 46%..",
                "author": "joeyat"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nvidia RTX 50 SUPER series given Late Q1 to Q2 release timeframe",
        "score": 128,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So a few months before the 60 series launches?",
                "author": "jenesuispasbavard"
            },
            {
                "raw_content": "Was there any reason to believe that Supers will come early other than notoriously unreliable MLID?",
                "author": "dedoha"
            },
            {
                "raw_content": "Im waiting for a deal to get a 5070Ti. Hopefully, this helps me get a good 16GB card",
                "author": "WJMazepas"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "LG UltraFine 32U990A: Release details and launch discount revealed for new Thunderbolt 5 and 6K professional monitor",
        "score": 43,
        "text_content": "Pre-orders for the UltraFine 32U990A are finally set to open in some markets. While US pre-orders will commence on September 30, the Eurozone will not receive LG's new 6K and Thunderbolt 5-equipped monitor until mid-October, albeit with a healthy launch discount thrown in for good measure. Resembling an Apple Studio Display (curr. $1,699 on Amazon), the UltraFine 32U990A outputs at 6,144 x 3,456 pixels across its 31.5-inch IPS panel to deliver a 224 PPI pixel density. Additionally, the monitor delivers 98% DCI-P3 and 99.5% AdobeRGB colour space coverages with 450 nits peak SDR and 600 nits HDR brightness.",
        "comments": [
            {
                "raw_content": "224 PPI.. Good but need more.",
                "author": "Vb_33"
            },
            {
                "raw_content": "Hello Balance-! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "I'd like to see my photos and timelapses (and soon full-frame 8k videos) on this thing.",
                "author": "zghr"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AncientGameplays - Does RAM REALLY matter?? DDR5 5600 vs 6000 vs 6200 vs 6400MHz (X3D CPUs Included)",
        "score": 5,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TLDW: 16 Games Average (DDR5 RAM Frequency & Timings) A) Ryzen 7 9700X: 1080P: DDR5 6200 CL32 (IS) + FCLK 2167 --> Average 218.1 FPS, 1% lows 130.5 FPS (108.8%) DDR5 6200 CL32 (IS) --> Average 216.5 FPS, 1% lows 129.3 FPS (108%) DDR5 6200 CL32 --> Average 206.5 FPS, 1% lows 121.2 FPS (103%) DDR5 6000 CL30 (IS) --> Average 215.7 FPS, 1% lows 129.6 FPS (107.6%) DDR5 6000 CL30 --> Average 204.7 FPS, 1% lows 119 FPS (102.1%) DDR5 5600 CL32 --> Average 200.4 FPS, 1% lows 116.2 FPS (100%) 1440P: DDR5 6200 CL32 (IS) + FCLK 2167 --> Average 188.1 FPS, 1% lows 122.6 FPS (105.3%) DDR5 6200 CL32 (IS) --> Average 187.9 FPS, 1% lows 121.6 FPS (105.2%) DDR5 6200 CL32 --> Average 182.1 FPS, 1% lows 115.9 FPS (101.9%) DDR5 6000 CL30 (IS) --> Average 186.8 FPS, 1% lows 121 FPS (104.5%) DDR5 6000 CL30 --> Average 180.9 FPS, 1% lows 114.4 FPS (101.2%) DDR5 5600 CL32 --> Average 178.6 FPS, 1% lows 111.1 FPS (100%) B) Ryzen 9 7900X3D: 1080P: DDR5 6400 CL32 (IS) + FCLK 2133 --> Average 219.2 FPS, 1% lows 135.3 FPS (102.1%) DDR5 6400 CL32 (IS) --> Average 217.9 FPS, 1% lows 133 FPS (101.4%) DDR5 6400 CL32 --> Average 215.2 FPS, 1% lows 128.4 FPS (100.2%) DDR5 6200 CL30 --> Average 215.1 FPS, 1% lows 127.9 FPS (100.1%) DDR5 6000 CL30 --> Average 215.1 FPS, 1% lows 128.3 FPS (100.1%) DDR5 5600 CL32 --> Average 214.7 FPS, 1% lows 127.7 FPS (100%) 1440P: DDR5 6400 CL32 (IS) + FCLK 2133 --> Average 190.9 FPS, 1% lows 125.6 FPS (100.9%) DDR5 6400 CL32 (IS) --> Average 191 FPS, 1% lows 124.9 FPS (101%) DDR5 6400 CL32 --> Average 189.2 FPS, 1% lows 123.7 FPS (100%) DDR5 6200 CL30 --> Average 188.4 FPS, 1% lows 123.2 FPS (99.6%) DDR5 6000 CL30 --> Average 189.3 FPS, 1% lows 122.4 FPS (100.1%) DDR5 5600 CL32 --> Average 189.1 FPS, 1% lows 122 FPS (100%)",
                "author": "Antonis_32"
            },
            {
                "raw_content": "This is an age old question that's been asked since the dawn of computers, and judging from the TLDW the answer is always the same; It depends. The more appropriate question is and always has been: Is better RAM Worth the cost? (And again, the answer is still a sound \"It depends\")",
                "author": "ps5cfw"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "\"Sony Semiconductor Solutions to Release the Industry-Leading Global Shutter CMOS Image Sensor [IMX927] for Industrial Use That Achieves Both Approximately 105-Effective-Megapixels and High-Speed 100 FPS Output\"",
        "score": 28,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is maybe the only division of Sony which is still innovating and exciting to watch ...but I'm still waiting for a damn stacked apsc sensor Sony!",
                "author": "surf_greatriver_v4"
            },
            {
                "raw_content": "they'll put that in their new xperia and it'll still somehow take worse pictures than iphones, pixels, and galaxies from 5 years ago",
                "author": "betcho"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Thunderbolt 5 is here! But is it better than Oculink?",
        "score": 61,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Was a good time to align naming with USB and call it Thunderbolt 4 2.0",
                "author": "SERIVUBSEV"
            },
            {
                "raw_content": "Depends what you mean by better... Thunderbolt will always have a huge advantage in being hot-pluggable. Thunderbolt 5 definitely looks great and is very slowly appearing on more devices, hopefully it becomes as common as TB3 and 4 did.",
                "author": "jenny_905"
            },
            {
                "raw_content": "Not sure if using a 5070ti is the best choice to measure bandwidth limitations of a dock. I imagine a 5090 would showcase the bottleneck much better.",
                "author": "Sylanthra"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "A simple size comparison between my Switch 2, Switch 1 (2017 version) and Wii U Gamepad.",
        "score": 1415,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"What if the Wii U gamepad was the CONSOLE?\"",
                "author": "mostcursedposter"
            },
            {
                "raw_content": "After using my switch 2 for almost two weeks and then grabbing my OG switch, it felt like weak plastic.",
                "author": "AntzAttacks"
            },
            {
                "raw_content": "I love the Wii U Gamepad ergonomics",
                "author": "Bl0CKDragon"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Patch 20.5.0 - Hyped for even more stability!",
        "score": 130,
        "text_content": "They should really give us a flair option for stability at this point.",
        "comments": [
            {
                "raw_content": "Folks, I'm concerned about how much stability this system can take.",
                "author": "jokingsammy"
            },
            {
                "raw_content": "Nintendo halts all entropy in the universe.",
                "author": "tman2damax11"
            },
            {
                "raw_content": "Nintendo is the most stable",
                "author": "KalElReturns89"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Warframe native build for Nintendo Switch 2 is under development",
        "score": 126,
        "text_content": "[https://www.twitch.tv/videos/2575538613?t=0h28m20s](https://www.twitch.tv/videos/2575538613?t=0h28m20s)",
        "comments": [
            {
                "raw_content": "Wouldn’t call that news https://www.nintendolife.com/news/2025/09/warframe-devs-on-switch-2-version-thanks-to-our-friends-at-nintendo-we-are-on-it",
                "author": "PoorLittleGoat"
            },
            {
                "raw_content": "I’ll get it as it’s free no reason not too. However, I tried playing the game on switch 1 many times and it’s just too busy. Too much going on and I find it hard to understand.",
                "author": "GronWarface"
            },
            {
                "raw_content": "This was one of the first games I played on my Xbox One back in the day. Most of the people in the guild I was in were PC guys talking about a upcoming game called Fortnite. 😄",
                "author": "AnavelGato2020"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "It took me 29 attempts and 20 hours but I finally got my first win against Chronos in Hades 2! It’s feeling like this will top DK Bananza as my game of the year",
        "score": 117,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hades II is on my list for later, but I really need to do some backlog work before I pick it up lol. Way too many games coming out to grab them all, and while I liked Hades, I’m not in a rush.",
                "author": "twili-midna"
            },
            {
                "raw_content": "I’ve been getting him down to like 10% health consistently and dying. Need to not panic and calmly see it through. Think I need a few more buffs as well",
                "author": "QuestionAxer"
            },
            {
                "raw_content": "Niiiice the first win in a rogue is always so satisfying ! Congrats ! One of many to come",
                "author": "Lussarc"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo Singapore Pte. Ltd., a new local entity in the Republic of Singapore with the aim of accelerating Nintendo’s business in Southeast Asia, has been established. Nintendo is also considering establishing a local entity in the Kingdom of Thailand to accelerate its business.",
        "score": 9,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Business expansion is always good. 💪🏻",
                "author": "blackicebaby"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo has officially confirmed that the game \"Donkey Kong Bananza\", a game exclusively for Nintendo Switch 2, will support Thai language.",
        "score": 7,
        "text_content": "",
        "comments": [
            {
                "raw_content": "OMG yes",
                "author": "Papabearbuddy"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Resident Evil Requiem Switch 2 Gameplay via Nintendo Life",
        "score": 152,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Between this, Cyberpunk and Outlaws I am incredibly impressed with what the NS2 is capable of. It seems to really come down to the developer",
                "author": "Salt-Analysis1319"
            },
            {
                "raw_content": "ATLUS HELLO???!!!!",
                "author": "kolt437"
            },
            {
                "raw_content": "Good to see another big game running well on the Switch 2.",
                "author": "Dren7"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Savage Raven Grip Case",
        "score": 4,
        "text_content": "Just curious if anyone had purchased the bundle that came with the grip and the travel case and its quality? If anyone can speak to it or against it I would just love to know first hand because all the reviews are super vague. Thank you!",
        "comments": [
            {
                "raw_content": "I have the grip for Switch 2and had the case and grip for the Switch 1. It's quality. Improves the handling alot and has 3 different choices. The smallest grip isn't that comfortable but its easy to carry in a thin case. The 2 larger grips are really comfortable but to carry them you need the big case and its kind of bulky, but very well made. Thats my 2 cents.",
                "author": "Emergency_Star_5858"
            },
            {
                "raw_content": "I have the Neogrip and the max carry case. The gripcase uses the same grip system though. I like the 3 different sizes, I tend to use the trigger grips more often, as the plus grips were too big to be comfortable for me, (they remind me of the ps5 controller size.) at least on the right side. When on the right it made it hard to reach the face buttons. I will use the plus grip on the left for more coverage of the left joystick though. I appreciate being able to have different sizes. They are a hard plastic, but have a texture on them and they feel comfortable to hold. I am a huge fan of the maxcarry case. It holds the switch with whichever grips or grip combination you use on it and provides plenty of room below for the other grips and some accessories. I really like that not only is the storage below the Switch, something I haven’t see much of, but that there is a protective flap that the Switch sits on that covers the storage compartment as well as one that covers the screen. I have a battery pack, its cable, a 12 card game case, and the other grips there and it fits fine. I also like that’s it is very strong feeling. You even have storage for 12 cards on the top flap. There is a slight internal indent to match the Joystock on the top cover as well. I think the mesh pouch on the top of the cover is a waste as it doesn’t hold much of anything. I use it to hold the included microfiber cloth. It is removable though but anything you put into it makes the case seem more tight. I don’t t think you would go wrong with the grip case as its grip system is excellent. Just remember that with the grip case you lose access to the built in stand completely.",
                "author": "derekallthumbs"
            },
            {
                "raw_content": "Messaged you",
                "author": "SoonerDoc68"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Four empty posts have been mistakenly shared in the Events and Announcements Steam page of Half Life 2",
        "score": 502,
        "text_content": "It could mean nothing as it usually does, but sharing just in case. [source](https://steamcommunity.com/app/220/eventcomments)",
        "comments": [
            {
                "raw_content": "Valve could get people to actually read terms and conditions if they shoved a HL3 reference in there somewhere.",
                "author": "Electronic-Pie-6352"
            },
            {
                "raw_content": "It's most likely just testing, but it could be related to a Raising The Bar release announcement which we're hopefully getting close to hearing more about. Raising the Bar should have more kernels of knowledge about HL3 Episode 3 at bare minimum so if HLX/HL3 isn't announced this year we hopefully will get some scraps of something we haven't seen before.",
                "author": "industrialmoose"
            },
            {
                "raw_content": "HL4 confirmed",
                "author": "MetalHeartGR"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "New The Lord of the Rings Game In Development - Insider Gaming",
        "score": 441,
        "text_content": "\"Sources close to the game tell Insider Gaming that a new title is set to be, at least partially, funded by the Abu Dhabi Investment Office (ADIO). This funding should roughly equate to $100 million, give or take, the sources say.\" FULL STORY: [https://insider-gaming.com/exclusive-new-the-lord-of-the-rings-game-in-development](https://insider-gaming.com/exclusive-new-the-lord-of-the-rings-game-in-development)",
        "comments": [
            {
                "raw_content": "#Insider-Gaming is a Tier 2 - Generally Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "“…will be a third-person action game that is designed, in a way, to ‘compete with Hogwarts Legacy.’” You have my attention",
                "author": "NoPersonKnowsWhoIAm"
            },
            {
                "raw_content": "I'm going to cry, I've been waiting for news like this for quite some time. Edit: It has nothing to do with Gollum, they are a different developer!",
                "author": "TheSpanishUnknownOne"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "EA Announces Agreement to be Acquired by PIF, Silver Lake, and Affinity Partners for $55 Billion",
        "score": 661,
        "text_content": "- This is the biggest leverage buyout ever, insane times Source: https://www.businesswire.com/news/home/20250929186526/en/EA-Announces-Agreement-to-be-Acquired-by-PIF-Silver-Lake-and-Affinity-Partners-for-%2455-Billion Previous rumour: https://reddit.com/r/GamingLeaksAndRumours/comments/1nr9e1c/wsj_videogame_giant_electronic_arts_near_roughly/",
        "comments": [
            {
                "raw_content": "Rip BioWare",
                "author": "SuddenDepact"
            },
            {
                "raw_content": "Someone explain it to me in Batman terms.",
                "author": "Kreeth12"
            },
            {
                "raw_content": "Sportswashing go brrrrrrrrr.",
                "author": "ThinWhiteDuke00"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Financial Times: EA leveraged buyout investors are betting on AI will cut costs and boost profits",
        "score": 426,
        "text_content": "The investors being Saudi, Jared Kushner, and Silver Lake. \"The deal is a huge bet that artificial intelligence can significantly cut EA’s operating costs, allowing the equity consortium to manage a large debt load on a company that historically carried limited net debt. AI is already widely used across Silicon Valley to accelerate many kinds of computer programming. In games development, it can be used to replace voice actors and create backdrops and other assets, as well as automating play testing to avoid bugs before release.\" \"The investors are betting that AI-based cost cuts will significantly boost EA’s profits in coming years, people involved in the transaction told the Financial Times.\" More on the deal: \"Kushner, the son-in-law of US President Donald Trump, played an instrumental role in getting the deal over the line. He and Egon Durban, co chief of Silver Lake, began studying a possible takeover earlier this year, according to two people briefed on the talks. The people said Kushner was key to getting Saudi Arabia’s Public Investment Fund interested in participating in the takeover at a time when it is retrenching from some private investments. He set up investment firm Affinity Partners after leaving the White House following Trump’s first term, and PIF is a large investor in Kushner’s fund. People close to the discussions said Kushner’s involvement would also ease the deal’s path through the Committee on Foreign Investment in the US, which adjudicates on deals involving foreign buyers.\" Source: https://www.ft.com/content/be980240-13ec-498c-ba79-71eada30d133",
        "comments": [
            {
                "raw_content": "I will never find it not baffling that people who know nothing about video game development make decisions how games should be made.",
                "author": "Clopokus900"
            },
            {
                "raw_content": "\"it can be used to replace voice actors\" Yeah, how about no?",
                "author": "OwnAHole"
            },
            {
                "raw_content": "Everyone, start saying goodbye to EA in a few years.",
                "author": "TheSpanishUnknownOne"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "New PS5 Pro and new DualSense V3",
        "score": 553,
        "text_content": "Source: [https://www.ppe.pl/news/384532/nowe-ps5-pro-i-kontrolery-dualsense-z-pozadana-funkcja-zdradzamy-szczegoly.html](https://www.ppe.pl/news/384532/nowe-ps5-pro-i-kontrolery-dualsense-z-pozadana-funkcja-zdradzamy-szczegoly.html) We just got some new details from Graczdari - the same person who recently leaked the boxed version of TES IV Oblivion Remastered and the PS5 port of Microsoft Flight Simulator 2024 - about upcoming Sony products. According to someone familiar with Sony’s plans, the company is working on a new version of the PlayStation 5 Pro. We don’t know all the changes yet, but the updated PS5 Pro is said to use about 3% less power than the current model. The more interesting news is about a new DualSense controller, referred to behind the scenes as the DualSense V3. It’s expected to launch in November, replacing the current models in stores and also being bundled with the new PS5 Pro. Our sources say the DualSense V3 will feature a removable battery. We’ll update when we know more.",
        "comments": [
            {
                "raw_content": "Removable battery seems cool.",
                "author": "Ornery-Tonight1694"
            },
            {
                "raw_content": "Was there ever a dualsense v2?",
                "author": "account_for_gaming"
            },
            {
                "raw_content": "Basically what Billbil-kun said a few days ago",
                "author": "Mdm_Thomas"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Tech Tour 2025 leak: Panther Lake set to be announced on October 9th",
        "score": 77,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hope they can unveil a PTL Gaming Handheld or even a launch of it like late November/early December.",
                "author": "Dangerman1337"
            },
            {
                "raw_content": "So does this mean that intel is actually succeeding with their 18A node? If so, that's an exciting development!",
                "author": "wankerbanker85"
            },
            {
                "raw_content": "[deleted]",
                "author": "None"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel subnotebook regains ground — Asus ZenBook 14 OLED UX3405CA review",
        "score": 7,
        "text_content": "",
        "comments": [],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD Fluid Motion Frames 3 (AFMF3) has been spotted in drivers files",
        "score": 124,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "This is really exciting, especially for the 9060xt. Driver level frame gen isn't perfect, but for some games like Helldivers 2 it works wonders.",
                "author": "Stereo-Zebra"
            },
            {
                "raw_content": "Please include support for borderless windowed 🙏🏻",
                "author": "SnootDoctor"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD subnotebook in a tight three-way battle – Asus ZenBook 14 OLED UM3406K Review",
        "score": 16,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "Boomers keep buying, young Americans keep waiting: The housing ladder is broken",
        "score": 39,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The solution is property ownership caps. No reason for any person or organisation to own more than 10 properties. Of course, that would trigger the onset of the 2 words most feared by landlords: \"affordable housing\".",
                "author": "MarketCrache"
            },
            {
                "raw_content": "Neighbor’s house is for sale. Nice ranch with a great yard. 3 bedroom 2 bathroom. Needs some updates. 1600 sqft. We’re in a great school district. Parks nearby. Would be a perfect home for a young family. Great first home. My wife and I figure a boomer couple will buy it. That’s what’s happened to the last few like it in our area. It’s frustrating.",
                "author": "Big-Calligrapher-250"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "UBS has named Miami world’s most vulnerable real estate bubble",
        "score": 207,
        "text_content": "**Miami Tops UBS Global Real Estate Bubble Index** * UBS ranks Miami as the most vulnerable housing market globally, surpassing 20 major cities. * The city’s bubble risk score is 1.73, well above the “high risk” threshold of 1.5. **Market Cooling After Pandemic Boom** * Once a magnet for remote workers, Miami’s housing market is now softening: * Median sale prices dropped from $640K to $595K in one year. * Homes are lingering on the market for nearly three months. * Many properties are closing below asking price. **Rising Costs and Structural Issues** * Ownership is becoming more expensive due to: * Skyrocketing insurance premiums linked to climate risks * Ballooning HOA fees * Regulatory crackdowns on aging condo towers * The price-to-rent ratio has exceeded even the extremes of the 2006 housing bubble. **Long-Term Outlook** * UBS doesn’t predict an abrupt collapse but warns of deep affordability issues. * Florida has lost over $100 billion in housing market value in the past year. * Despite risks, Miami retains appeal as a tax-friendly coastal city. **Global Context** * Other cities in the “high risk” category include Tokyo and Zurich. * Los Angeles, Dubai, and Amsterdam are in the “elevated risk” zone.",
        "comments": [
            {
                "raw_content": "I live here. All the people purchasing pre construction are expecting to flip it for a 30% profit like the ones they bought in 2018 and sold in 2020 at peak.",
                "author": "marketsonlygodown"
            },
            {
                "raw_content": ">climate risks Miami's elevation is a whopping 6ft. I just don't see how people who remotely believe in the effects of climate change could warrant investing there.",
                "author": "Packrat1010"
            },
            {
                "raw_content": "Seeing how all the property in Miami is speculative now, given the hurricanes and flooding and all, uhhhhh yeah, I'd say Miami is in shit soup with no ladle.",
                "author": "Kriznick"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Share of Mortgages with Rates Above 6% Climbs to 10-Year High as Americans Adapt to New Normal",
        "score": 120,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This has been reality for the last 3 years at least.",
                "author": "Trust_The_System1981"
            },
            {
                "raw_content": "The percentage over 6 percent will continue to climb. Rates below 6 percent are nowhere in sight",
                "author": "KevinDean4599"
            },
            {
                "raw_content": "To be clear. This is bullish for the housing market. Asset prices to the moon baby.",
                "author": "Guilty-Beyond9223"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "What happened to the Housing Bubble Blog?",
        "score": 24,
        "text_content": "[http://housingbubble.blog/](http://housingbubble.blog/) I've been following this blog for about 20 years! Comments were closed on the last thread from August 22nd. Does anyone know what's going on?",
        "comments": [
            {
                "raw_content": "The last few years it got rabidly rightwing, like, froth flying everywhere, so I gave it up.",
                "author": "WildfellHallX"
            },
            {
                "raw_content": "The Housing Bubble Blog bubble burst",
                "author": "nageV_oG_"
            },
            {
                "raw_content": "What a throwback, I used to read that all the time leading up to and during the GFC. It was a great compilation of housing related news.",
                "author": "captain_stoobie"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Miami Suburb’s Once-Vibrant Housing Scene Is Hit by Exodus of Migrants",
        "score": 6,
        "text_content": "",
        "comments": [
            {
                "raw_content": "miami is due for a crash",
                "author": "Historical-Many9869"
            },
            {
                "raw_content": "So much for your “housing shortage”. > DORAL, Fla.—The two-story, terracotta-roof home in a gated community known as Doral Landings East seemed ideal for the Venezuelan family of four who moved in two years ago. Neighbors were surprised when one day the family disappeared, skipping out on rent, their landlord said, and leaving much of their furniture behind. > One by one, Venezuelans and other immigrants are starting to disappear from Doral, a Miami suburb on the doorstep of the Everglades known for a Trump resort where President Trump plans to host the G-20 summit next year. > Many Venezuelans are here with temporary legal permission to live and work in the U.S., part of a series of immigration programs expanded under the Biden administration. The Trump administration is trying to revoke that permission, leaving more than one million foreigners from various countries in some kind of legal limbo, depending on their type of status. > Few, if any, places in the U.S. are feeling the effects of the immigration-policy change more acutely than Doral, where about 40% of its 80,000 residents were born in Venezuela or are of Venezuelan descent.",
                "author": "ColorMonochrome"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "NAR Pending Home Sales Report Shows 4.0% Increase in August",
        "score": 20,
        "text_content": "",
        "comments": [
            {
                "raw_content": "As prices come down we should expect for sales to increase.",
                "author": "Admirable_Nothing"
            },
            {
                "raw_content": "4% sales increase. Crash canceled guys. Let's all buy a house. 😂 On a serious note, I love how they're still pushing old news of lower mortgage rates when it reality, mortgage rates are back up. NAR is such a propaganda machine. Anyone remember the 2006 report crafted by the chief economist trying to convince everyone there was no bubble?",
                "author": "ohhellnaah"
            },
            {
                "raw_content": "Month-Over-Month * 4.0% increase in pending home sales * Gains in the Midwest, South, and West; Decline in the Northeast Year-Over-Year * 3.8% increase in pending home sales * Gains across all regions WASHINGTON (September 29, 2025) – Pending home sales in August increased by 4.0% from the prior month and rose 3.8% year-over-year, according to the National Association of REALTORS® Pending Home Sales Report. The Report provides the real estate ecosystem, including agents and home buyers and sellers, with data on the level of home sales under contract. Pending sales rose month-over-month in the Midwest, South, and West, and declined in the Northeast. Year-over-year, sales increased in all regions. August’s REALTORS® Confidence Index survey shows that 19% of NAR members expect an increase in buyer traffic over the next three months, up from 16% last month and unchanged from one year ago. Meanwhile, 19% expect an increase in seller traffic, down from 21% last month and up from 18% in August 2024. \"Lower mortgage rates are enabling more home buyers to go under contract,\" said NAR Chief Economist Lawrence Yun. \"In the Midwest, low mortgage rates combined with high levels of affordability are attracting more buyers compared to other regions.\"",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Housing September 29th Weekly Update: Inventory Unchanged Week-over-week",
        "score": 7,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Week over week? That's way too long! Give me the day to day or hour to hour numbers. **\"Inventory was up 18.0% compared to the same week in 2024 (last week it was up 19.0%), and down 9.6% compared to the same week in 2019 (last week it was down 9.5%).\"**",
                "author": "beardko"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Zipcode home trends based on sales",
        "score": 1,
        "text_content": "Put in a zipcode to get an idea of the trend. Also put an address and get comps. Overall gives you an idea of the current market",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Claude 4.5 Sonnet is here",
        "score": 1170,
        "text_content": "[https://www.anthropic.com/news/claude-sonnet-4-5](https://www.anthropic.com/news/claude-sonnet-4-5)",
        "comments": [
            {
                "raw_content": "> Enhanced tool usage: The model more effectively uses parallel tool calls, firing off multiple speculative searches simultaneously during research and reading several files at once to build context faster. Improved coordination across multiple tools and information sources enables the model to effectively leverage a wide range of capabilities in agentic search and coding workflows. three weeks ago amidst all the claude inference issues, [i made a comment about sonnet feeling way faster like it was doing parallel tool calls](https://www.reddit.com/r/ClaudeAI/comments/1ndafeq/3month_claude_code_max_user_review_considering/ndgevtn/?context=3), now i'm thinking i was A/B tested on. i'd never seen sonnet perform that well before",
                "author": "pdantix06"
            },
            {
                "raw_content": "Am I tripping or is this actually a pretty nice upgrade",
                "author": "THE--GRINCH"
            },
            {
                "raw_content": "So that guy really did have friends at Anthropic lol",
                "author": "Funkahontas"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Prominent computer science professor sounds alarm, says graduates can't find work: 'Something is brewing'",
        "score": 279,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Doesn’t need to be a prominent CS professor to sound an alarm that’s been going off for a year now. The white collar job market, tech-adjacent verticals specifically are in the midst of a major job recession.",
                "author": "This_Wolverine4691"
            },
            {
                "raw_content": "The professor is at UC Berkeley. From the article: >Hany Farid, a world-renowned expert in digital forensics and image analysis, told Nova’s “Particles of Thought” podcast that computer science is no longer the future-proof career that it once was. >Farid was discussing the reasons that podcast host Hakeem Oluseyi’s son, a college senior who is studying computer science, is struggling to find work. >“For people like your son, by the way, who four years ago were promised, *Go study computer science, it’s going to be a great career. It is future-proof* — that changed in four years,” Farid said. From a [*Business Insider*](https://www.businessinsider.com/computer-science-students-job-search-ai-hany-farid-2025-9) article on the same subject: >\"Our students typically had five internship offers throughout their first four years of college,\" Farid said. \"They would graduate with exceedingly high salaries, multiple offers. They had the run of the place. That is not happening today. They're happy to get one job offer.\" [Hacker News discussion](https://news.ycombinator.com/item?id=45412946)",
                "author": "TMWNN"
            },
            {
                "raw_content": "I regret doing a masters Can’t even find a help desk role it’s that grim where I am",
                "author": "farahhappiness"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Comparing Sonnet 4.5 and GPT-5 Pro for 3D simulations",
        "score": 292,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I mean, these are both incredible, but one obviously outshines the other.",
                "author": "o5mfiHTNsH748KVq"
            },
            {
                "raw_content": "Can someone explain to me what I am seeing?",
                "author": "TacoTitos"
            },
            {
                "raw_content": "Interesting, but GPT-5 Pro is $200 month, should compare to GPT-5 High I think",
                "author": "Digitalzuzel"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Claude 4.5 does 30 hours of autonomous coding",
        "score": 573,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wonder how much they are benefiting from Claude produced code already.",
                "author": "The_Scout1255"
            },
            {
                "raw_content": "30h autonomous coding and the result is a project that can be trashed whenever you need to add a new feature",
                "author": "dmaare"
            },
            {
                "raw_content": "Just like Claude 4 did 8+ hours or whatever… Anthropic need to stop advertising this lmao",
                "author": "Howdareme9"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "no Gemini 3.0 updates yet?",
        "score": 56,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Rumor has it that it will be released on October 9.",
                "author": "FeathersOfTheArrow"
            },
            {
                "raw_content": "expecting to be absolutely crushing",
                "author": "osemec"
            },
            {
                "raw_content": "https://preview.redd.it/fq1mqalz89sf1.jpeg?width=1080&format=pjpg&auto=webp&s=1af76289a9b1f2a4ab6e47e40e6f6a7be0e35ec3",
                "author": "iBreatheBSB"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Anthropic: A video of all versions of Claude, from the original to 4.5, trying to recreate claude.ai",
        "score": 410,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"Breaks it, then can't fix it again\" Sounds familiar!",
                "author": "Greenei"
            },
            {
                "raw_content": "The speed of evolution is getting crazy.",
                "author": "JustBrowsinAndVibin"
            },
            {
                "raw_content": "![gif](giphy|l3q2XhfQ8oCkm1Ts4)",
                "author": "Able-Necessary-6048"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI new video model coming soon",
        "score": 237,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://www.wired.com/story/openai-launches-sora-2-tiktok-like-app/ If they’re making an entirely separate app for this new video model, hopefully that means it’ll be better than Veo 3",
                "author": "MassiveWasabi"
            },
            {
                "raw_content": "codename: **Brainrot**",
                "author": "FlamaVadim"
            },
            {
                "raw_content": "I suspect a big motivation is to get free user feedback on good generations. Increasingly feel like relying on user feedback is a mistake though",
                "author": "TFenrir"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "ChatGPT sub complete meltdown in the past 48 hours",
        "score": 530,
        "text_content": "It’s been two months since gpt5 came out, and this sub still can’t let go of gpt4. Honestly, it’s kind of scary how many people seem completely unhinged about it.",
        "comments": [
            {
                "raw_content": "What the heck is going on over there I wonder. Every time I scroll past I see something unhinged. Is it still about gpt-4?",
                "author": "lovesdogsguy"
            },
            {
                "raw_content": "Early days, that sub was so cool and fun. A bunch of people discussing this cutting edge tech and pushing its boundaries while most people still haven’t really heard about it. Then at some point a year or so ago, I had to unsub because it was just flooded with the dumbest takes. Like somehow it shifted from posts from interesting techies talking about how it works to a bunch of morons sharing screenshots about how they got their chat to reveal the meaning of life.",
                "author": "vwin90"
            },
            {
                "raw_content": "The ChatGPT subreddit is a dumpster fire. It's blatantly getting brigaded by a small percentage of users who are pissed that they lost the disturbingly sycophantic 4o, and honestly their reactions to losing it are proof that it's a very good thing they don't have it anymore.",
                "author": "Gubzs"
            }
        ],
        "subreddit": "singularity"
    }
]