[
    {
        "post_name": "Fraud investigator testifies Democrat Wisconsin Governor Tony Evers \"allows fraud to occur\" by blocking Food Stamp and Medicaid audits",
        "score": 719,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's time to arrest the entire governments of Wisconsin, Michigan, and Minnesota for FRAUD.",
                "author": "ConfederateDaughter"
            },
            {
                "raw_content": "Unchecked welfare fraud is how democrats buy votes.",
                "author": "booblitchutz"
            },
            {
                "raw_content": "Still no arrests 1+ year in ⏰",
                "author": "MedicallyReddit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Bravo!!",
        "score": 608,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# FUCK THAT FUCKING FAGGOT *right in his bunghole* # with a CLEVELAND STEAMER!!!",
                "author": "KentuckyRepublic"
            },
            {
                "raw_content": "fuck those fuckos",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Could not have said it better myself.",
                "author": "Somebody157"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Pete Hegseth: HOW TO AVOID I.C.E.",
        "score": 553,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It’s really not that hard…unless you’re a retard",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "Link https://x.com/PeteHegseth/status/2015244661653135618?s=20",
                "author": "I-am-Orlando"
            },
            {
                "raw_content": "Only these drooling leftists psychos and some old stupid boomers who still watch TV believe all this shit. Everyone knows that all ICE is doing is enforcing laws where the local authorities are refusing. In jurisdictions that cooperate with the feds, ICE largely stays out, as that is preferable. Every single one of these people who got shot this year did so due to their own behavior. I won't celebrate the death of someone (at least not outside of my own mind), but that does not mean I am going to pretend it is a tragedy. There are a lot of deaths that are tragedies, and none of these qualify.",
                "author": "RootLevelPrivilege"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "All of this is happening simply because the Trump Administration is trying to enforce our nation’s laws and deport a bunch of Somali scam artists and sex offenders.",
        "score": 601,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No. It’s because we have Barbie running the doj who doesn’t know how to wield power. Dems can arrest 1000 at the drop of a hat. Barbie here sends letters in the midst of a communist revolution. You have entire signal channels full of conspirators and instead of no knock raiding 100 of them and sweating them to turn coat you sit there and fuck up arresting Don lemon. Who. Fucking. Documented. His. Crimes. Wield. Power. Arrest them and then figure out the crime.",
                "author": "Viewer01"
            },
            {
                "raw_content": "Link https://x.com/MattWalshBlog/status/2015227632573362592?s=20",
                "author": "I-am-Orlando"
            },
            {
                "raw_content": "Trump isn't trying to enforce anything, he's putting on a show",
                "author": "PunishedOrange"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Immigration agents have only shot at 4 people in 2026 despite carrying out thousands of operations nationwide: - One was armed with a handgun - One was armed with a shovel - Two weaponized their vehicles Not a single person has been shot for holding a sign and protesting.",
        "score": 1132,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> Not a single person has been shot for holding a sign and protesting. Was that even a question? Why are you even mentioning that? # THESE ARE PAID RIOTERS",
                "author": "OklahomaRepublic"
            },
            {
                "raw_content": "Compare that to how many illegals have killed Americans and how, in the same time frame.",
                "author": "TheEdgeOfTheEarth"
            },
            {
                "raw_content": "100% the dude that was shot today was reaching for his gun - he did not know that it was taken already and likely the officers didnt either. Had the karens not been blowing their whistles - the officers probably could have communicated with one another.",
                "author": "RedditStillSucks"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "If you're keeping score: 2 - 0",
        "score": 932,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It could even be a negative number for the marxists because of that incident where one of them accidentally shot illegal aliens when their intended target was an ICE agent.",
                "author": "TheJakeFroggy"
            },
            {
                "raw_content": "Level of effort?",
                "author": "OklahomaRepublic"
            },
            {
                "raw_content": "You're forgetting about all the conservatives they've murdered?",
                "author": "XxxRDTPRNxxX"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I kek’d",
        "score": 1468,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They are Pretti Good commies now that they're dead.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "You can't make this up. Are we living in a B rated movie?",
                "author": "ImprerialWalker"
            },
            {
                "raw_content": "Other thread said he had a boyfriend and is gay (but was previously married). Militant gays as usual.",
                "author": "PiratePatriotParrot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "MINNEAPOLIS MOB THREATENS TO KILL O’KEEFE — ICE BOTTLES THROWN, FOLLOWED, AND OMG TEAM UNDER ATTACK.",
        "score": 1055,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fuck these people.",
                "author": "dontdrinksoy"
            },
            {
                "raw_content": "Don't worry guys, Pam already sent a strongly worded letter to sort it out.",
                "author": "Wide_Peepo_Happy"
            },
            {
                "raw_content": "James and company better be careful. I don't want to lose anymore on our side",
                "author": "Formerlurker92"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Attorney General Pamela Bondi: The full weight of federal law enforcement is engaged in Minnesota and this Department of Justice is advancing action on every front. Walz, Ellison and Frey have acknowledged receipt of federal grand jury subpoenas from this DOJ.",
        "score": 858,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’m shocked her PR team even bothered to respond to that post. A twitter post is not a fox news appearance 🤔🤔",
                "author": "Settin"
            },
            {
                "raw_content": "Subpoena?? Is that the thing the Clintons wiped their ass with last week?",
                "author": "Whoopies_tds"
            },
            {
                "raw_content": "A subpoena is not an indictment, they'll just be asking questions and asking for documents, but it's the start of what may lead to criminal prosecution.",
                "author": "airborne3502"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Leftists have SEIZED CONTROL of the streets in Minneapolis, people in \"shiny vests\" are dictating who can go where. \"They're pretty well organized. They've got walkie talkies and they replace each other!\"",
        "score": 1044,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"Protesters.\"",
                "author": "MythArcana"
            },
            {
                "raw_content": "They pushed the NBA game scheduled for tonight to tomorrow. Who wants to bet that the game is not played tomorrow either? They are making this their Alamo. They have to distract from the Somali fraud and protect their voting base from deportation. This isn't going away quietly.",
                "author": "War_Hamster"
            },
            {
                "raw_content": "They're impeding people's freedom of movement",
                "author": "wharfthrowaway"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "so noble",
        "score": 806,
        "text_content": "",
        "comments": [
            {
                "raw_content": "All them darkies and fornicators going to hell. Know what I'm saying?",
                "author": "ConfederateYankee"
            },
            {
                "raw_content": "It's not the hill you literally want to die on.",
                "author": "airborne3502"
            },
            {
                "raw_content": "The right can meme.",
                "author": "MEME-SUPREME"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Sec Noem: \"The two things that we've asked Gov Tim Walz and Mayor Frey for is that they would partner with us and before they let somebody dangerous out of their jails... they continue to choose the side of lawbreakers, criminals, murderers, and rapists over the citizens of Minneapolis.\"",
        "score": 1428,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Well Pam won't arrest them, so why would they stop their criminal behavior?",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Arrest Walz and Frey!!!!!!! It's time to get tough!!!!!",
                "author": "China4Biden"
            },
            {
                "raw_content": "**THEN CHARGE THEM AND ARREST THEM YOU FUCKING FUCKS** That is what we used to do to criminals, right? Especially those that aid and abet crimes?",
                "author": "FrmrAmericanRepublic"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Cam Higby \"infiltrated organizational signal groups all around Minneapolis with the sole intention of tracking down federal agents and impeding/assaulting/and obstructing them.\" Admin of the Signal group worked for Tim Walz! RICO...",
        "score": 707,
        "text_content": "",
        "comments": [
            {
                "raw_content": "These protests are all paid for by YOUR tax dollars.",
                "author": "ConfederateYankee"
            },
            {
                "raw_content": "You said RICO like you think this DOJ does anything. Maybe you need to calm down and wait for the next Dem DOJ, then you'll see tons of RICO.",
                "author": "EgregiousPhilbin"
            },
            {
                "raw_content": "I bet that's the only cock she's ever held in her hand. 🐔🖐 Edit: Yep, found her herd of cats. Every single time.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Alex Pretti violently resisted arrest, attempted to stand up, and reached for his holster at the :27 mark. This is 100% on him.",
        "score": 1252,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Some info that I have been able to verify: He is a local activist and rioted with BLM during the Floyd riots. He is an Italian American and recently divorced. He was married to a woman, but divorced her 2 years ago. Not verified, but making the rounds: He was in a relationship with another male that was always hanging around his home. The two shared a dog that recently passed away.",
                "author": "MissingTrump"
            },
            {
                "raw_content": "The left will say he has a right to carry, they will become pro gun now. Watch them defend this...",
                "author": "KungPaoMcChicken"
            },
            {
                "raw_content": "Good and Pretti? You have to be shitting me.",
                "author": "RealWomenLoveTrump"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ARMED Community Members stand guard outside of the site where Alex Pretti was shot and killed by Federal Agents this morning in Minneapolis as Anti-ICE Protest continues nearby",
        "score": 754,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Guarding against what? Didn't ICE already make their arrest in that area? Have they not moved on? They act like they're fighting for a little piece of turf or something. What retards.",
                "author": "OnlyTrump20"
            },
            {
                "raw_content": "I'm assuming these are two AntiFA guys? Can't imagine our folks would do something so stupid. Can't wait to meme them when they get ventilated",
                "author": "magamagashii"
            },
            {
                "raw_content": "Bet most of these aren't \"community members\" but rather out-of-staters",
                "author": "wharfthrowaway"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Rioter in Minneapolis bites off HSI officers finger. #TheWalkingDumb",
        "score": 1440,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The left is a terrorist organization. One of the largest out there.",
                "author": "Trumpwonbidencheated"
            },
            {
                "raw_content": "Should have shot this fucker too.",
                "author": "Wrexxis780"
            },
            {
                "raw_content": "This is EXACTLY what Alex Jones was warning about a few years ago. The other side has LITERALLY turned into flesh-eating zombies.",
                "author": "UtahRepublic"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "PAM BONDI: \"We sent Tim Walz a VERY STRONG LETTER today. We have been working on this letter.\"",
        "score": 976,
        "text_content": "",
        "comments": [
            {
                "raw_content": "She’s trolling you bastards",
                "author": "ConfederateSon"
            },
            {
                "raw_content": "this stupid bitch is disgusting and a worthless cunt'",
                "author": "SCHULTZ"
            },
            {
                "raw_content": "It's a fucking meme at this point. Like she's trolling MAGA. WTAF??",
                "author": "giggitybooped"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Kyle, also known as the “Antifa General” who just told the rest of his Antifa Army to bring guns to meet ICE in Minnesota, apparently likes wearing dresses. 👗",
        "score": 958,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I just knew it, a meth addict, former gay porn star who can’t find work any more",
                "author": "Username56"
            },
            {
                "raw_content": "Lmao, dudes a straight up meme. He'd be a hilarious troll if he wasn't serious.",
                "author": "MagaJay02"
            },
            {
                "raw_content": "Democrats always attract the worst people don't they.",
                "author": "HappyFunBall"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "MINNEAPOLIS SIGNAL INFILTRATED I have infiltrated organizational signal groups all around Minneapolis with the sole intention of tracking down federal agents and impeding/assaulting/and obstructing them. BUCKLE UP ALL WILL BE REVEALED",
        "score": 1331,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Soooooo why after doing that you are going to tease it? Why not send it to ICE and otherwise STFU so they dont ditch it!? Like are you doing this to save ICE agents or for some social media attention?",
                "author": "VanDeKoik"
            },
            {
                "raw_content": "I can't figure out whether he's on our side or not. A comma or full stop may have assisted me.",
                "author": "Saxonlady"
            },
            {
                "raw_content": "Cam is a good guy. Hopefully he already shared all this info with ICE. Also hopefully ICE is doing the same. It boggles my mind that we need on the ground citizen reporters to investigate shit the feds should be...",
                "author": "MissingTrump"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The NATIONAL GUARD arrives in Minneapolis Tim Walz KNOWS his Leftist base is getting ready to destroy the city again. The National Guard should be federalized. Tim Walz can NOT be trusted to keep citizens safe!",
        "score": 881,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Can’t we just let them destroy the city?",
                "author": "Yignuced"
            },
            {
                "raw_content": "Tim Walz declaring war on federal law enforcement caused this to happen. The people of Minneapolis and the US get nothing from a governor declaring war on the federal government.",
                "author": "NotYourMan"
            },
            {
                "raw_content": "I'm pretty sure that Trump is just sitting back waiting for Tampon Timmy to roll the NG in so that when Trump federalizes them they were rolled in on the governor's authority therefore there's no conflict with state government.",
                "author": "Danofdestiny"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Neurophos bets on optical transistors to bend Moore’s Law",
        "score": 18,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That their ~25 mm^2 tensor core resides on a reticle-sized die, with the remainder of the die used for support to supply data to it is really interesting. It probably rates very poorly on Todd Austin's LEAN metric, lol.",
                "author": "NamelessVegetable"
            },
            {
                "raw_content": "just someone looking for a sucker to buy them up lol",
                "author": "Quatro_Leches"
            },
            {
                "raw_content": "What about [Huang's Law](https://en.wikipedia.org/wiki/Huang%27s_law)?",
                "author": "imaginary_num6er"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Why there is no DLSS 4.5 Ray Reconstruction and why Neural Shading is probably still long a way off",
        "score": 215,
        "text_content": "I'll try my best to make sense of the entire situation regarding Ray Reconstruction (RR) not receiving an update with the launch of DLSS 4.5. There's also a segment near the end on why Neural Texture Compression (NTC) and the other Neural Shading SDKs announced at CES 2025 haven't seen any game adoption. Thanks to u/binosin for enlightening me on some of the DLSS 4.5 RR situation and for u/GARGEAN for letting me know Neural Radiance Cache (NRC) isn't perfect in the Half-Life 2 RTX Remix demo. And sorry for the mess regarding model naming. NVIDIA needs a better naming scheme. . # TL;DR (Ray Reconstruction only): **-** DLSS 4/Transformer RR already uses the FP8 trick, just like Preset L and M (DLSS 4.5 Super resolution (SR)). On average it's roughly 40-50% more demanding than Preset L and twice the ms cost of preset M, except for the outliers RTX 5090 and 2080 TI. \\- NVIDIA can't pull the 5X compute lever again again because they've already exceeded it compared to preset K and J (original transformer/TF SR models); the RR model is very expensive. So a new RR model will require a paradigm shift and/or pushing the compute and ML format lever (NVFP4) again. \\- Analysis based based on the official DLSS [Super Resolution](https://github.com/NVIDIA-RTX/Streamline/blob/main/docs/DLSS%20Programming%20Guide.pdf) and [Ray Reconstruction Programming](https://github.com/NVIDIA-RTX/Streamline/blob/main/docs/DLSS-RR%20Integration%20Guide.pdf) Guides and the NVIDIA's Applied Deep Learning Research team's [blog on DLSS4](https://research.nvidia.com/labs/adlr/DLSS4/). . # DLSS 4 RR already uses FP8 In my conversation with u/binosin I was told RR TF is already extremely demanding, significantly much more demanding than even Preset L. I'll confirm this later. I was also told that the streamline documentation suggests this architecture, unlike DLSS 4 Preset J and K (TF SR), was leveraging FP8. I went through the documentation myself and can confirm this is true and this will be addressed in a minute. I also stumbled upon this in-depth blogpost from NVIDIA's Applied Deep Learning Research/ADLR team supporting those findings: [https://research.nvidia.com/labs/adlr/DLSS4/](https://research.nvidia.com/labs/adlr/DLSS4/) I'll now bring a few quotes from the blogpost that illustrate how NVIDIA tailored this design specifically to architecture of 40-50 series: *\"By co-designing our transformer network with highly efficient CUDA kernels and optimizing data flow to make* ***full use of on-chip memory and FP8 precision***\\*, we minimized latency and computational overhead while preserving the high fidelity of our output.\"\\* *\"To further optimize performance, we ensured that both* ***training and inference are conducted in FP8 precision,*** *which is directly accelerated by the next-generation tensor cores available on Blackwell GPUs. This required meticulous optimizations across the entire software stack, from low-level instructions to compiler optimizations and library-level improvements, ensuring that the model achieves maximum efficiency and accuracy within the real-time performance budget.\"* Seems like Preset L and M could have built upon the groundwork laid by TF RR. But whether they're further developments based on the SR branch of RR model, perhaps more accurately characterized as preset J or K on steroids, or something else entirely are all interesting thoughts but it's not up to me to decide which explanation is the most likely. . # DLSS 4 RR model is the same size as Preset L and M Yes and it also mirrors the model MB differences of 20/30 series vs 40/50 series in the DLSS programming guides for DLSS 4.5 SR: |v / >|1080P|1440P|4K| |:-|:-|:-|:-| |20/30 series|\\~160MB|\\~280MB|\\~620MB| |40/50 series|\\~120MB|\\~210MB|\\~470MB| This also supports DLSS 4 RR is using FP8. Numbers are from page 6 in [DLSS SR guide](https://github.com/NVIDIA-RTX/Streamline/blob/main/docs/DLSS%20Programming%20Guide.pdf) and page 9 [DLSS RR guide](https://github.com/NVIDIA-RTX/Streamline/blob/main/docs/DLSS-RR%20Integration%20Guide.pdf) and both use performance mode. . # Just how demanding is DLSS 4 RR? I must admit that I was bit shocked to see DLSS 4 RR even dwarf preset L, but it makes sense given ray denoising is a very difficult task. Below is two tables of ms cost for Preset J,K, L, M, and RR TF for the 2080 TI, 3070, 3080 TI, 4070 TI, and the 5090. One at 1440P and another at 4K: \\- Numbers are from page 6-7 in DLSS SR guide and page 9 in DLSS RR guide (links\\^) and both use performance mode. **1440P (milliseconds):** |v / >|Preset J, K|Preset M|Preset L|RR TF| |:-|:-|:-|:-|:-| |2080 TI|1.80|3.41|5.45|8.2| |3070|1.53|3.03|4.01|6.06| |3080 TI|1.02|2.04|2.63|3.97| |4070 TI|0.91|1.18|1.46|2.09| |5090|0.49|0.51|0.77|0.91| **4K (milliseconds):** |v / >|Preset J, K|Preset M|Preset L|RR TF| |:-|:-|:-|:-|:-| |2080 TI|3.50|7.51|10.60|18.33| |3070|3.17|6.56|8.30|13.31| |3080 TI|2.06|4.35|5.32|8.83| |4070 TI|1.97|2.78|3.18|4.53| |5090|0.87|1.05|1.37|1.83| Interestingly the 3070, despite having a significantly lower FP16 dense tensor TFLOPs than the 2080 TI is still substantially faster than the previous gen flagship. I suspect Ampere's concurrent execution capabilities is probably the mean culprit here, but it's possible that the 96kB -> 128kB L1 cache buff is contributing as well. Besides 2080 TI (more overhead) and 5090 (less overhead), that are outliers on both ends of the spectrum, RR TF is 40-50% more demanding than Preset L and roughly twice the ms cost of preset M. As I've said previously this design has already tapped FP8 and the other optimizations that Preset L and M use. Lastly, NVIDIA can't pull the 5X compute lever because they've already used it. So it seems like a new release requires a fundamental redesign or more brute force. Perhaps upgrading to NVFP4, a more advanced design, and an even heavier model will enable a third generation RR model to launch alongside RTX 60 series as part of the overall DLSS 5 package. . # Neural Shading when? NTC has improved substantially with the recent v0.8 and v0.9 release notes on Github and it looks like we're close to an official 1.0 release. Last year NVIDIA also released an important Texture Filtering technique called Collaborative Texture Filtering/CTF that is very close to ground truth. They added that to the RTXTF SDK last year. All you need to know is that this will resolve texturing filtering for NTC assets a lot more gracefully. I suspect we could see widespread adoption after the official 1.0 release if SM6.10 reintroduces Cooperative vectors at GDC 2026 or somewhere around then. That release could happen as soon as GDC 2026, but wouldn't bet on it. But do expect that gamers for the most part will only be using either the inference on load (BCn fallback) or inference on feedback (DX12U compatible cards) options. The cards that have enough compute to comfortably run inference on sample (most demanding and VRAM saving) usually have plenty of VRAM, thus not make the FPS drop worth it. Even for situations such as the RTX 5070 with maxed out visuals inference on feedback should still be able to provide massive VRAM savings. So at least for now Inference on sample is almost completely pointless except for very heavily VRAM constrained situations and as I said the fallbacks are attractive enough to drive widespread adoption as long as APIs caught up. The same unfortunately can't be said for NRC and that's despite a full release in 2024. Meanwhile Neural Materials is nowhere to be found, not even on Github. Then again we have seen the same thing play out with Reflex 2 and the gimmicky Neural Faces. As for NRC it's a relatively large and complex Multi-layer Perceptron (MLP) that suffers from long training time something that can cause visual artifacts during the \"calibration\" or training phase. Introducing rapidly moving objects, scene changes (destruction), or moving into a new space will partially or completely void the radiance cache, thus prompting the model to retrain itself. In the process of doing so NRC delivers incomplete and unstable RTXGI visuals for an extended period of many frames. The fundamental issue is hash grids the encoding scheme used to translate the underlying scene and its geometry into something the radiance cache can use. These aren't a good fit for Neural networks and GPU compute, needlessly making the MLP larger than it could otherwise be and have a detrimental impact on cachemem coherency and efficiency. Fortunately AMD is in the process of investigating alternatives such as [GATE/Geometry-Aware Trained Encoding](https://arxiv.org/html/2506.08161v2) and while promising GATE comes with its own dowsides and is at least a couple of papers away from being production ready. I'm sure NVIDIA is working on this as well so maybe if we're lucky a surprise paper this year at Eurographics, HPG or SIGGRAPH that solves this issue. Could be to Neural shading MLPs what ReSTIR was to real time path tracing. Obviously nothing is confirmed but the research is progressing fast at the moment so it's certainly not inconceivable. NVIDIA needs either less generalized and more specific radiance caches (smaller MLPs), like AMD's proposed [Neural Visibility Cache](https://arxiv.org/html/2506.05930v2), or a new geometry encoding scheme that drastically cuts down on the training time and number of steps to achieve an acceptable result; GATE++. Until either one or both happens NRC will likely continue to see no or very limited game adoption. But when they get do fix this issue there's immense potential. Let's hope we begin to see that vision manifested as soon as with the launch of the nextgen GPUs. . # Extra: DLSS 4 doesn't seem to be a hybrid model Unlike the hybrid FSR4 model it seems DLSS 4 RR and SR are 100% Vision Transformer (ViT) models. How the competitor offering works is impossible so say, but the stipulated hybrid CNN/ViT design that has gained wide traction in online forums isn't confirmed. For now we can only speculate as AMD has confirmed absolutely nothing. This quote does suggest it's a pure ViT model: *\"While initial experiments with the transformer-based network showed significant improvements over the previous CNN model, it came with a* ***prohibitively high computational cost***\\*.\\* *We derived a more efficient network architecture to make this cost more practical and built* ***a highly optimized implementation*** *that also took advantage of tensor core advances in the NVIDIA Ada Lovelace and NVIDIA Blackwell architectures, realizing* ***an industry first, real-time vision transformer model.****\"* ~~If I were to guess AMD's FSR4 is a compromise. AMD couldn't design a ViT based upscaler that ran fast enough in time for RDNA5's launch so instead they opted for a Hybrid CNN+ViT design. Or perhaps they just agreed they wouldn't attempt to overcome the herculean task of a purely ViT based for the first iteration of the ML upscaler. It's also possible NVIDIA is hiding something, but I find that hard to believe given this isn't the Geforce Blog or the other NVIDIA marketing.~~ *Speculation retracted. Design of FSR4 hasn't been disclosed.* As for Ray Reconstruction that's a completely different beast. From DLSS 2 being widely praised in early to mid 2020 it took NVIDIA nearly five years to end up with RR transformer that, unlike the smeary and ghosty CNN model, was and still is widely praised. AMD's Ray Regeneration in its current form is at best a alpha preview. We only just last year saw [the research paper](https://dl.acm.org/doi/10.1145/3728297) for their real answer to RR *and this is still a u-net (CNN) model. Unless AMD pulls a rabbit out their hat or completely redesign the RR branch this design isn't going miraculously become as good as DLSS 4 RR*. Unfortunately at least for now it seems like AMD having a capable RR model like RR transformer won't happen anytime soon. We might see it by the time AMD's nextgen comes out, but there are no guarantees and it could be much farther out. **Edit:** Minor rewrite to make post easier to read and less confusing + added API context (credit to u/Balu2222). **Edit 2:** Retracted and rephrased misleading info about FSR4 + added info regarding AMD's RR paper (credit to u/binosin)",
        "comments": [
            {
                "raw_content": "Could DLSS 5 end up being limited to RTX 50 and 60 series if the next big update is built around NVFP4?",
                "author": "Typical-Yogurt-1992"
            },
            {
                "raw_content": "I want to add, that for the widespread adaption of Neural Shading/Rendering the Direct3D Cooperative Vector needs to be finalized and released, and it got [pushed out](https://devblogs.microsoft.com/directx/shader-model-6-9-and-the-future-of-cooperative-vector/) of Shader Model 6.9 that is releasing in Q1 2026 and will arrive in a later version. When its out, it will allow developers to use the MATMUL units of GPUs in the rendering pipline, it will be interesting to see what kind of thing this can be used for, or are we just gonna see texture compression and ML material shaders.",
                "author": "Balu2222"
            },
            {
                "raw_content": "You can't quite compare RR to regular DLSS though, since you also need to subtract the compute time of the denoisers it replaces, right?",
                "author": "Arachnapony"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Asrock Industrial NUCS BOX-358H",
        "score": 8,
        "text_content": "probably the only X7 358H that uses SO-DIMM for now. recall that intel never said regular DDR5/SO-DIMM support for PTL12Xe. Maybe things are a bit different for edge usecase, idk Also this is intel approved PTL Core Ultra Series 3 devkit",
        "comments": [
            {
                "raw_content": "Probably less that PTL12Xe doesn’t support SODIMM but more that Intel won’t approve and supply designs with it unless they aren’t SODIMM. Probably some testing reveals that SODIMM bottlenecks the 12 Xe iGPU heavily that the performance is not much better than 4 Xe to justify it?",
                "author": "steve09089"
            },
            {
                "raw_content": "Bro it's written on Intel ark they support sodimm https://www.intel.com/content/www/us/en/products/sku/245527/intel-core-ultra-x7-processor-358h-18m-cache-up-to-4-80-ghz/specifications.html",
                "author": "6950"
            },
            {
                "raw_content": "I kinda don't see the point of this? Like, sure, SODIMM is good. But where are you finding 48/64GB 7200MT/s DIMMs? Even outside of the current RAM situation, that would be obscenely expensive. Not to mention the straight 25% reduction in memory bandwidth",
                "author": "Hour_Firefighter_707"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "You guys weren't joking",
        "score": 2443,
        "text_content": "after getting some crappy news a few days ago i decided to do something rare and treat myself to a pro controller and hyrule warriors. i read the reviews on the controller and thought seems kinda over the top for a controller but man, it really is an amazing controller!! I usually play handheld and very little docked but because the switch 2 is pretty heavy and I'm scared to damage it i figured play a bit more docked. well my kiddo is at a friend's house so I've had a few hours to myself and I've been playing non stop! the controller is so good that my arms and fingers don't hurt at all! so glad i pulled the trigger! and AOI is pretty awesome as well. so far I'm really enjoying it! now I'm going to walk the dog and continue playing before my little man comes home again lol for anyone in doubt yes the pro controller is really worth it ( i paid €70 for it new so that wasn't soooo bad 🙈)",
        "comments": [
            {
                "raw_content": "I’ve charged mine 3x since launch day lol",
                "author": "smithstreeter"
            },
            {
                "raw_content": "It’s so comfortable. I love it. And the charge lasts forever.",
                "author": "Dinosaucers_"
            },
            {
                "raw_content": "It is the smoothest, finest game controller of the highest quality I have ever laid my hands upon. It really is worth its price!",
                "author": "MareC0gnitum"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I still can’t get over how good this game looks",
        "score": 1151,
        "text_content": "Others may be more ambitious, but this is the Switch 2 game that impressed me most visually.",
        "comments": [
            {
                "raw_content": "It's a beautiful game with an even more amazing soundtrack.",
                "author": "Ayrios440"
            },
            {
                "raw_content": "Yeah it's very \"clean\" looking with less artifacts than the open world games like Cyberpunk and Star Wars Outlaws. All 3 are impressive in their own way.",
                "author": "lastemperorjubei"
            },
            {
                "raw_content": "https://preview.redd.it/eki7uj4zxcfg1.jpeg?width=1920&format=pjpg&auto=webp&s=1e300c300f0c3007421b745cb6f263b42226093e True",
                "author": "YoBoy467"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I’m not the first person to say this and I won’t be the last, but Final Fantasy VII Remake does look insane on Switch 2",
        "score": 555,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It’s so good to be able to play it anywhere, I already reached chapter 8. I finished it 3-4 Times on PS5 and got the platinium trophy, but i play it again now lol",
                "author": "Sparko15"
            },
            {
                "raw_content": "Beautiful in 2020, hasn't aged a day in 2026. So happy many people are experiencing this masterpiece for the first time.",
                "author": "kahabraham"
            },
            {
                "raw_content": "Yeah it's a very good looking game! The hdr is amazing also! In many scenes i would go blind easily. Lol",
                "author": "FitEstablishment1155"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Playing Final Fantasy VII Remake for the very first time and, I'm sorry, but my big takeaway after the first two hours is: People are aware this guy's got tiger blood coursing through his veins, right?",
        "score": 121,
        "text_content": "&#x200B; I'm talking Adonis DNA. This dude is bi-winning. He's a Vatican Assassin Warlock. Tifa, Aerith and Jessie are just his live-in goddesses. (I hope there are enough people old enough to get what the hell I'm on about...) (Also, the game's pretty great so far. Looks fantastic!)",
        "comments": [
            {
                "raw_content": "Bit of context. This is Charlie Sheen in Platoon: https://preview.redd.it/7et7n27gjcfg1.jpeg?width=1024&format=pjpg&auto=webp&s=b81195c2da5ddd5b139c3ab8ed4535155401b5cb",
                "author": "elephvant"
            },
            {
                "raw_content": "Is this some weird way to say he hot? (serious question, I'm not a native english speaker, I'm not even sure if I should be blaming genZ or boomers)",
                "author": "Jeff1N"
            },
            {
                "raw_content": "???? Anyways, He has same Voice Actor as Balthier from FF12.",
                "author": "Hyperdragoon17"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I was given a Savage Raven Fission grip and it's really comfortable!",
        "score": 8,
        "text_content": "I initially didn't want to use it because I already had a nice case on but this thing is really comfortable, especially the trigger shaped grips. I'm not sure about the colors though, because now it looks even more like a toy with the colored button caps.😅 I also didn't use the tablet case because it was very flimsy. But yeah. Great grips overall.",
        "comments": [
            {
                "raw_content": "The fact Nintendo hasn't made any kind of \"Pro\" Joycan with a grip for double the price.",
                "author": "X_Fredex_X"
            },
            {
                "raw_content": "I also have this grip. It’s awesome!",
                "author": "WhatIsUpG"
            },
            {
                "raw_content": "How do you like that stick on Dpad? I went the Dpad shell mod route and I'm not super happy with it. Sort of wish I just went your route.",
                "author": "Dragon_Small_Z"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "For those who haven't played the new FF7R on any other system, how are we all liking the new ATB system inthis game?",
        "score": 16,
        "text_content": "24 hours into this game (at chp 11) and I feel like im loving the ATB system. It's like the battle system is a puzzle. You have to manage enemy stagger while deciding if you want that last section of meter to go toward healing party members or an ability. And wow the bosses are done SO WEL! The >!Reno and Rude Duo fight!< really wants you you to have a good understanding of the battle mechanics!",
        "comments": [
            {
                "raw_content": "Yeah it’s one of the best combat systems of any game tbh, let alone final fantasy! It gets expanded on even more in Rebirth so hopefully the Switch 2 port comes sooner rather than later lol!",
                "author": "Espurreyes"
            },
            {
                "raw_content": "The combat system feels like a mix between Octopath Traveler, Crisis Core, and the original FF7. And I think it might be my favorite I’ve seen in an FF game. Though I haven’t played any past 12 asides from 14",
                "author": "SquishmallowPrincess"
            },
            {
                "raw_content": "I preferred the battle system in final story. I think I preferred the characters as well Ff7 remake lost a lot of interest for me when I found out progress doesn't copy between games",
                "author": "Revelation_Now"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Resident Evil: Requiem",
        "score": 25,
        "text_content": "Trying to decide whether I should buy the Generation pack for Switch 2, or the deluxe edition for PS5? I do like the thought of playing portable, but is it worth the loss in performance and resolution?",
        "comments": [
            {
                "raw_content": "I say wait until the technical previews/reviews come out and then decide for yourself",
                "author": "Loose_Society9485"
            },
            {
                "raw_content": "Just wait, there’s no point rushing until buying games In 2026",
                "author": "Dry-Cod9127"
            },
            {
                "raw_content": "I’m getting the generation pack, it’s such a good deal. I’ve always wanted these games on the switch.",
                "author": "BowserJr4789"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "AC newby",
        "score": 33,
        "text_content": "I started playing Animal Crossing late 2025 and this game has me in a chokehold since the Switch 2 update. Just had a 3 hour session while watching college basketball 🏀. Who hasn’t dreamed of owning a beach 🏝️ home ?!",
        "comments": [
            {
                "raw_content": "Same. Started playing right before Christmas and partner and I both put over 100 hours so far. It’s insanely addictive",
                "author": "ThaBloops"
            },
            {
                "raw_content": "I got the game years ago, but never got into it. When 3.00 came out I started a new island and have been loving it. I too just had a good long session collecting all the material materials for new homes and visiting some mystery islands. My favorite part about animal crossing is the vibes during the summer months so I’m really looking forward to those.",
                "author": "KingAcorn85"
            },
            {
                "raw_content": "Whats new compared to switch 1 edition?",
                "author": "kEYZERK1NG"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Watch Dogs franchise is “completely dead” - Tom Henderson",
        "score": 1521,
        "text_content": "- RIP Aiden Pearce :( - I’m surprised the Watch Dogs movie is still coming out though Source (59:02 onwards): https://www.youtube.com/live/8rRejJWM3jg?si=292yoIYRAoDohEfY",
        "comments": [
            {
                "raw_content": "#Tom Henderson is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Watch Dogs 2 only came out… wait ten years what the fuck",
                "author": "probablyuntrue"
            },
            {
                "raw_content": "Welcome to the club of dead ubisoft IPs because they dont sell as well as an assasins creed or a tom clancy game",
                "author": "nicksuperdx"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Alleged look of the Prince in the canceled Prince of Persia Remake",
        "score": 655,
        "text_content": "[Image](https://pbs.twimg.com/media/G_byJVSWYAARaLL.png?name=orig) [Source](https://xcancel.com/xj0nathan/status/2015064150917960087?s=20) Edit: The same leaker said it was 99% complete before it got canceled (still take that with a grain of salt).",
        "comments": [
            {
                "raw_content": "Won't be long until an entire build is leaked, seeing how pissed Ubi employees are about it",
                "author": "AbianHxC"
            },
            {
                "raw_content": "The caption said the game was 99.99% complete. All that's left are some bug fixes, which is baffling I wonder if a build of this game will ever leak.",
                "author": "aRandomBlock"
            },
            {
                "raw_content": "Man that hairstyle makes him look like Aladdin",
                "author": "PER2D2"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Jez Corden Heard Microsoft Exploring Doing Another Developer Direct This Year",
        "score": 301,
        "text_content": "[https://xcancel.com/idlesloth84\\_/status/2014850409894928644?s=46&t=w6MCvnDcs7N074ZG11kKUA](https://xcancel.com/idlesloth84_/status/2014850409894928644?s=46&t=w6MCvnDcs7N074ZG11kKUA)",
        "comments": [
            {
                "raw_content": "#Jez Corden is a Tier 2 - Generally Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "They have a lot of titles that should be releasing this year, so that makes sense",
                "author": "GoodSelective"
            },
            {
                "raw_content": "Halo: Campaign Evolved release date trailer + campaign co-op deep dive from a different level, and Gears of War: E-Day gameplay reveal + release date. And maybe some insights into Clockwork Revolution and State of Decay 3 with 2027 releases.",
                "author": "Bolt_995"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Rayman 30th Anniversary Edition rated in Australia",
        "score": 239,
        "text_content": "[https://www.gematsu.com/2026/01/rayman-30th-anniversary-edition-rated-in-australia](https://www.gematsu.com/2026/01/rayman-30th-anniversary-edition-rated-in-australia) Previous rumor from Tom Henderson saying that \"Iceman\" would be an anniversary title. [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1qlufmo/tom\\_henderson\\_rayman\\_project\\_iceman\\_coming\\_before/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1qlufmo/tom_henderson_rayman_project_iceman_coming_before/)",
        "comments": [
            {
                "raw_content": "I remember the first game getting so ridiculously difficult, couldn’t even get halfway through when I played it as a kid.",
                "author": "VisualPersona95"
            },
            {
                "raw_content": "Everybody wanted 2 but I’m glad they’re starting with the original. I never played any of the classic raymans, would rather run through them in order",
                "author": "Traditional_Dot_1215"
            },
            {
                "raw_content": "I wish they'd just make a collection of Rayman instead of just releasing the first one.",
                "author": "XthecreatordayX"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "About the rumor from Tom Henderson that the Watch Dogs IP being dead. Shinobi602: Responds \"Not exactly\"",
        "score": 271,
        "text_content": "When talking about the recent rumor, Shinobi says the IP is not dead Shinobi602: \"Not exactly\" [https://www.resetera.com/threads/tom-henderson-as-far-as-im-aware-at-this-moment-in-time-the-watch-dogs-ip-is-completely-dead.1415167/post-150460624](https://www.resetera.com/threads/tom-henderson-as-far-as-im-aware-at-this-moment-in-time-the-watch-dogs-ip-is-completely-dead.1415167/post-150460624) He later confirms not talking about the movie. Shinobi602: \"I am not talking about a movie\" [https://www.resetera.com/threads/tom-henderson-as-far-as-im-aware-at-this-moment-in-time-the-watch-dogs-ip-is-completely-dead.1415167/post-150460807](https://www.resetera.com/threads/tom-henderson-as-far-as-im-aware-at-this-moment-in-time-the-watch-dogs-ip-is-completely-dead.1415167/post-150460807) Tom Henderson Rumor [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1qlsypm/watch\\_dogs\\_franchise\\_is\\_completely\\_dead\\_tom/?utm\\_source=share&utm\\_medium=web3x&utm\\_name=web3xcss&utm\\_term=1&utm\\_content=share\\_button](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1qlsypm/watch_dogs_franchise_is_completely_dead_tom/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)",
        "comments": [
            {
                "raw_content": "#Tom Henderson is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "60fps update like Far Cry.",
                "author": "M4ttsmash"
            },
            {
                "raw_content": "Ah so a remaster, got it.",
                "author": "NotTakenGreatName"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Tom Henderson: Rayman project “Iceman” coming before “Steambot”. Anniversary commemorative release of some sort",
        "score": 144,
        "text_content": "At 37:54. https://www.youtube.com/live/8rRejJWM3jg?si=9fpmKyCixsfaHTwI He later clarified on Twitter that he believes “Iceman” is just one game instead of a trilogy rerelease. https://xcancel.com/\\_tom\\_henderson\\_/status/2015115541749317692?s=61&t=JxRMPFFdpEwOhL-ir8S0sw",
        "comments": [
            {
                "raw_content": "#Tom Henderson is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "I still can't believe they looked at all the existing Rayman games and chose LEGENDS to develop a remake.",
                "author": "Trainbe"
            },
            {
                "raw_content": "Rayman Legends might be the single most pointless remake of all time. There's not a single thing about that game that suggests that it's old or outdated. If you had told me it had come out yesterday I would believe you.",
                "author": "jinifluff"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Ben 10 x Fortnite in development. Likely for this summer.",
        "score": 82,
        "text_content": "[Source](https://xcancel.com/HYPEX/status/2015142414919385183) *No information on whether it will be classic, Alien Force, Ultimate, Omniverse, or Ben 10,000.* I imagine it will be Ultimate Alien Ben, since he's around his 16.",
        "comments": [
            {
                "raw_content": "I guess they're gonna make a collab with every CN series?",
                "author": "Cebuc23"
            },
            {
                "raw_content": "gwen 10000 and four arms playable. plz epic",
                "author": "jamesterfire"
            },
            {
                "raw_content": "Let's fucking gooo!!! For those who don't know there is a new comic book set to release in April/May. Perfect time to be honest.",
                "author": "JonasKahnwald11"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "ASRock confirms its Z790 and other LGA-1700 motherboards will not support Bartlett Lake CPUs",
        "score": 10,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Dangit, I was holding out, 14700k it it is then",
                "author": "WarsmithHonsou"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD confirms Ryzen 9 9950X3D2 in EEC filing, dual 3D V-Cache flagship even closer",
        "score": 208,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "We will see if there is any reason to have this chip. If a game accidentally goes on the other ccd there has to be a latency/performance hit.",
                "author": "Cradenz"
            },
            {
                "raw_content": "This is taking way too long.",
                "author": "Nuck_Chorris_Stache"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Recently upgraded from 9900x to 9800X3D",
        "score": 267,
        "text_content": "The FPS boost was great for gaming. Went from about 180-190FPS on Ultra settings at 1440 in BF6 to about 300-310 FPS. Still plenty fast for productivity, but I did notice some slow down when merging huge files in Lightroom.",
        "comments": [
            {
                "raw_content": "meanwhile me upgrading from 2600 to 7800X3D",
                "author": "kwikscoper"
            },
            {
                "raw_content": "You are 100% not actually on Ultra on BF6 getting 300 FPS, that's just a no, those numbers are all sorts of wrong, the 9900X is still a pretty good gaming CPU, and at 1440P, the difference between it and the X3D is smaller",
                "author": "transmedkittygirl"
            },
            {
                "raw_content": "I don't believe those numbers, the 9800x3d is better for gaming sure but but not that much better to be getting 50% or higher framerate. Those numbers don't add up unless you're using framegen.",
                "author": "Bandicoot-Trick"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Just found this in a box of Computer Parts. An ATI Mobility Radeon 7500 Non Qualification Sample.",
        "score": 38,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Oh! The 32 mb was my first ever GPU, but back in like 2007. I found it in a box of PC parts my uncle gave me, and I put it in a Dell Office tower with a Pentium 3 800mhz and 512 MB of RAM. It wasn't great but I started learning Blender on it.",
                "author": "spacemanspliff-42"
            },
            {
                "raw_content": "Had a Dell laptop with one of these in MXM form - rocked so hard at Q3 and BF1942 - paired with a 1600x1200 screen",
                "author": "HeXa_AU"
            },
            {
                "raw_content": "Made in Canada? Biggest shocker there, what manufacturing facility do/did they have?",
                "author": "armorlol"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Just sharing my kid’s computer",
        "score": 11,
        "text_content": "A hand me down from me with an upgraded case and GPU. He’s 6 so he likes the RGB. Used for homeschooling, Minecraft, and Fortnite. (Added a GPU support after reviewing these pics I took of it)",
        "comments": [
            {
                "raw_content": "I see 4 ram sticks, you must be very rich sir",
                "author": "der_reifen"
            },
            {
                "raw_content": "I wish I cared about my computer's appearance as much as you did your son's. Cables in the end always force me to compromise in one way or another. Idk how y'all do it",
                "author": "NarutoDragon732"
            },
            {
                "raw_content": "Hello friend, first of all, congrats on this amazing machine. Just a small constructive suggestion: I’d strongly recommend using an anti-sag bracket for that GPU. Even with the reinforced PCIe slot visible in the third photo, the card is clearly under significant stress and already appears slightly crooked. Over time, GPU sag can become a serious issue.",
                "author": "Im_Schnell"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Rate my prebuilt to self built setup",
        "score": 4,
        "text_content": "So a little backstory. I bought this CyberPower pc in 2019 at Best Buy for like $500 or so bucks. Don’t even ask me what was in it, but just know it wasn’t good. All the games I wanted to play, I couldn’t. So the first thing I upgraded was my gpu. I got an XFX 5600 6gb GDDR6. Then I upgraded my cpu to a Ryzen 9 3900x. Got more fans (pretty sure it came with just 2), 32gb ddr4 ram, and the pc was running solid for about 6 years until 2025. I’ve wanted to upgrade when the 30 series came out, but honestly just put it off forever. Fast forward: Finally Black Friday rolls around in 2025 and I just say f\\*\\*\\* it and upgrade everything. New PSU, new ddr5 ram, new cpu, new mobo, new gpu, new liquid cooler…everything except the case pretty much because I love my case. So here are my specs now, and honestly I couldn’t be happier (I also officially completed the upgrade today with new 3 Corsair RS120 fans and the airflow is INSANE): Specs: CPU: Ryzen 5 7600x3d 6-core Gpu: XFX 9070xt 16gb ddr6 Quicksilver Mobo: MSI b850 Gaming Pro WiFi 6e PSU: Corsair RM850x Memory: 32gb Corsair Vengeance 6000MT/s gddr5 Storage: 1tb hard disk (came with my pc originally), Samsung 4tb ssd, SK Hynix 500gb ssd (what I boot from and store system files) CPU cooler: Corsair Nautilus 240rs liquid cooler Desk and wires isn’t ideal, but it gets me by in our smallish nyc apt.",
        "comments": [
            {
                "raw_content": "Looks pretty sick! Hope you got that RAM before the prices went stupid. I buil last year as well, and the GPU was my issue, as the releases were all bought up and price hikes. Eventually got lucky at microcenter and nabbed my 9070xt at a slightly raised, but not scalped price.",
                "author": "diptenkrom"
            },
            {
                "raw_content": "I got my RAM in that short window where it was actually reasonably priced. Similar build to you, but MFF in a small mATX case. 7700, 48gb 6400, 9070xt, 240mm rad, 3 nvme SSDs. The last 6 years or so have been a mess in PC building.",
                "author": "diptenkrom"
            },
            {
                "raw_content": "Whats your load times in game? Do I Read this right you have 500gb of ssd nvme storage for OS? how much nvme storage do you have in total?",
                "author": "nullypully123"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "SIXUNITED AXB88 is a 1.2L Strix Halo mini workstation, mass production set for March 2026",
        "score": 5,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Uh huh. And where is the halo strix itx motherboard they announced last summer?",
                "author": "User5281"
            },
            {
                "raw_content": "Yet another copy pasted strix halo mini pc with identical specs and everything else and still yet to see a single 16” strix halo laptop.",
                "author": "996forever"
            },
            {
                "raw_content": "So, after AMD announced their small Ryzen AI Halo that has a striking resemblance to the DGX spark, others manufacturers are following suit? What a waste of silicone as every chinese manufacturer tries to sell you the 395 for another year. With 128GB of a bottleneck and a BIOS that will probably never see more than one update.",
                "author": "Baumpaladin"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Lowe's bets on kids, creators and Gen Z as Americans delay homebuying",
        "score": 80,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This article is basically: \"we re-launched the Kids Workshop program, where parents and kids build little projects together...that we had closed due to COVID, because a bunch of people close together was kinda frowned upon.\" Which is...not really a story? They've had these things for decades. My mom used to take me to them when I was a kid, and I took my kid to these pre-COVID. Even during and post-COVID they made little crafts packs you could do at home. That said, any press they can do to get it out there is great. People, and especially parents with smaller kids, should do stuff like this and learn how to do simple crafts and tool usage. Does building a birdhouse or a pinewood derby car help with homeownership? No, not really. But not being afraid of tools and a little DIY attitude is really, REALLY helpful as an adult.",
                "author": "PoorDamnChoices"
            },
            {
                "raw_content": "This headline is aggrivating. Saying \"Americans delay homebuying\" implies we just dont *want* to buy a home until later. When what really happened is \"greedy ass corporations, and politicians fucked the economy so hard that its NOT POSSIBLE for us to buy a home until way later in life\" but i guess ya know that doesnt generate enough clicks.",
                "author": "xXConfuocoXx"
            },
            {
                "raw_content": "Lowes bets, we demand.",
                "author": "Merrcury2"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "What’s your follow-up process for Zillow or Facebook leads?",
        "score": 0,
        "text_content": "Curious how other agents handle inbound leads. Do you respond immediately, or batch them? And how many follow-ups before you move on? I’ve noticed small changes in wording make a big difference in replies.",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "What Creative Finance Optimizes For—and What It Quietly Ignores",
        "score": 1,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Experiences W/ Flagstaff Housing Crisis?",
        "score": 0,
        "text_content": "Hi there! New-ish to Reddit but thought I would give it a chance. I'm a student journalist completing a big project on the city's affordable housing crisis, how its many causes impact locals, how individuals who work in Flag but can't afford to live there cope, etc. I was wondering if anyone out there local to the area with personal anecdotes and concerns would be willing to be interviewed or know of someone who would be! Feel free to DM me with any questions or concerns. Thank you!",
        "comments": [
            {
                "raw_content": "What housing crisis? What does Flagstaff produce except attracting tourism? The reality, homes for $300K exist in Flagstaff, OR, the super nice pad for $1.2 million as a second vacation home, OR, the final destination point for retirees. The city has lacked the ability to provide good paying jobs for their people and has become a destination point instead of a real city.",
                "author": "RealisticForYou"
            },
            {
                "raw_content": "Maybe they'll do something similar to Sedona - let lower wage workers sleep in their cars. It's a damn shame. I was born in phoenix and lived here my whole life. When I was a kid we would spend weekends up there in a cabin that my grandfather owned in Kachina village. Now its all short term rentals. And the traffic driving up there on the weekends? It's not even worth it anymore. It's disgusting how transplants have packed into this state. /rant",
                "author": "Commercial_Soft6833"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Sometimes I tell myself that it's also because of the political climate there that Yann LeCun left the US",
        "score": 1286,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don't think he left USA. He lives in NYC and still a University professor there",
                "author": "gizcard"
            },
            {
                "raw_content": "LeCunn is a good person",
                "author": "alexthroughtheveil"
            },
            {
                "raw_content": "On a political front Yann has been a shining light. [Yann LeCun - Sep 23, 2024](https://x.com/ylecun/status/1838189066153595221) >Endorsing a nepotistic aspiring dictator with preposterously ignorant stands on economic and international policies and who praises other authoritarians is clearly, \\*clearly\\* not the best way to promote meritocracy, peace, prosperity, and free expression. >Look, reasonable people can have divergent opinions on the best ways to approach issues like regulations, economic policy, and social policies, \\*while\\* being respectful of democratic principles. But one simply cannot throw democracy and competent governance out the window just because one wants lower taxes and less regulation.",
                "author": "Darkmemento"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Open AI's President Brockman leading donor to Trump SuperPac. Does it matter?",
        "score": 53,
        "text_content": "I was shocked to see Greg Brockman, Open AI's President, was the leading donor to the latest MAGA SuperPac with a $25m personal donation. Given how polarised politics is, I imagined this is quite a dangerous move to pick a side so clearly, especially when that side is making enemies at home and abroad at such a rapid rate. But does anyone really care? Do you care that XAi is MAGA? That OpenAI is MAGA? Does it affect which LLM you choose to use?",
        "comments": [
            {
                "raw_content": "IT'S NOT GREAT BOB",
                "author": "Spunge14"
            },
            {
                "raw_content": "Nazi supporter. History will remember.",
                "author": "coldoven"
            },
            {
                "raw_content": "He’s made a large contribution but every tech CEO except Dario donated like at least a million to trump. And the CEOs of the companies that own Anthropic did too. You just hope he’s paying to accelerate AI and that’s all it is. It’s a shame regardless",
                "author": "socoolandawesome"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The Claude Code creator says AI writes 100% of his code now",
        "score": 335,
        "text_content": "Boris Cherny (created Claude Code at Anthropic) claims he hasn't typed code by hand in two months. 259 PRs in 30 days. I was skeptical, so I watched the full interview and checked what's actually verified. The interesting part isn't the PR count. It's his workflow: plan mode first (iterate until the plan is right), then auto-accept. His insight: \"Once the plan is good, the code is good.\" The uncomfortable question nobody's asking: who's reviewing 10+ PRs per day? Link to interview and demos: [https://www.youtube.com/watch?v=DW4a1Cm8nG4](https://www.youtube.com/watch?v=DW4a1Cm8nG4)",
        "comments": [
            {
                "raw_content": ">Boris breaks his process into two distinct phases: planning and execution. The planning phase is where he still applies human judgment, defining what needs to be built, how it should work, what constraints matter. Doing this well requires that you have experience in software development and that you plan like a programmer, so that AI can code. Same skill set.",
                "author": "trisul-108"
            },
            {
                "raw_content": "Today I located a variable and changed it from `false` to `true`. It felt dirty, but I just wanted to feel some nostalgia.",
                "author": "kowdermesiter"
            },
            {
                "raw_content": "I'd love to watch a live stream of his process across a period of a month on a daily basis. There is either more to it than this or the code is pretty rickety.",
                "author": "saltyourhash"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "NVIDIA’s real moat isn’t hardware — it’s 4 million developers",
        "score": 68,
        "text_content": "I couldn't stop thinking about Theo's \"Why NVIDIA is dying\" video. The thesis felt important enough to verify. So I dug through SEC filings, earnings reports, and technical benchmarks. What I found: * NVIDIA isn't dying. It's $35.1B quarterly revenue is up 94% * Yes, market share dropped (90% → 70-80%), but the pie is growing faster * Groq and Cerebras have impressive chips, but asterisks everywhere * The real moat: 4 million devs can't just abandon 20 years of CUDA tooling * Plot twist: the biggest threat is Google/Amazon/Microsoft, not startups",
        "comments": [
            {
                "raw_content": "I don't think most devs touch cuda at all, we use pytorch or other libs that interface with cuda. I don't think it would be impossible to just make rocm work well with pytorch and be done with it.",
                "author": "hapliniste"
            },
            {
                "raw_content": "The irony is that AI coding will ultimately remove this moat",
                "author": "QuantityGullible4092"
            },
            {
                "raw_content": ">It's not A — it’s B",
                "author": "jonydevidson"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "From 10% to 100% AI-written code in two years",
        "score": 10,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Does this mean agi",
                "author": "ErmingSoHard"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Is it healthy to vent to AI?",
        "score": 8,
        "text_content": "I mean it - I do it periodically. Not sure why but as normal psychological support is not affordable for me right now - I periodically return to the site and vent out everything that bothers me. And somehow every time I end up nearly crying from how good it points out some patterns. But it makes me think that what if that's the point at there's no actual venting and just repeating patterns, that do nothing useful and only enhance my depression further? I managed to make AI sound annoyed after me devaluing it's responses... So I came up with this question - wha if discussing mental problems with AI is actually the opposite of helpful?",
        "comments": [
            {
                "raw_content": "Many people attest it’s not helpful and possibly damaging, **but** I would question the rigor of any studies that claim long-term harm because there simply hasn’t been enough time to tell. Some immediate observations, though: AI is very, *very* reaffirming, to the point that you can get it to agree with obviously deranged ideas even despite model designers’ efforts to rein it in. Venting to such a mirror is going to tend towards making you feel entirely justified in a great deal of your actions and opinions, and that may not be what you need at all. If you want to continue to use AI as a sort of counselor, I’d recommend instructing it to point out ways you might be wrong, ways you could handle or think of a situation better (or at least differently), and ways other people might interpret a situation. You might also want to instruct it to defuse any emotional build up you unload on it because otherwise it might rev you up, and that could prove mentally taxing or even dangerous. Of course a trained human therapist is going to outperform AI, but I understand both the inability to afford care and the fact that some people’s human therapists are ill fits for them (in which case, please consider shopping around if at all possible). You might also try talking with a spiritual leader or school staff member, depending on your situation and level of trust, but such individuals don’t have an obligation to reserve judgment or preserve confidentiality, so caution is understandable. Lastly, if you receive any kind of benefits from an employer or place of education, check whether some form of therapy is included; this is often separate from health insurance coverage and may not be obvious.",
                "author": "ExclusiveAnd"
            },
            {
                "raw_content": "Too early for professional opinions 😭",
                "author": "yollobrolo"
            },
            {
                "raw_content": "Better out; than in, I guess. You're 'devaluing it's responses' made me chuckle though ;))",
                "author": "Empty_Bell_1942"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "AI will win in verifiable domains. This is obvious. But what about non verifiable ones?",
        "score": 36,
        "text_content": "I think it's obvious by now that in optimizing code and finding proofs, AI is going to be superior to anything humans can do. Superintelligence in these domains is right around the corner. But these domains are verifiable - you can prove the answers is correct. AI can go off and train itself and learn on its own. But what about domains that are more subjective? Where the right answers lies in the heads of fickle humans and what they want to see? I think the jury is still out there. It's possible there is some magic of the collective efforts of human data labelling and math proving that can somehow create a critical mass and push it far beyond the intelligence of people - but I don't think we know this yet to be sure.",
        "comments": [
            {
                "raw_content": "Frankly this is essentially the same argument regarding needing 1 or 2 more breakthroughs, which is a perfectly valid argument. If you listened to Hassabis and Amodei's recent interviews where they talked about closing the RSI loop, they don't know for sure if it will happen but they think it's *possible* to close the RSI loop with purely STEM. And then the argument is that RSI would essentially discover everything else. I think Amodei is more confident in this than Hassabis, but both think it's possible.",
                "author": "FateOfMuffins"
            },
            {
                "raw_content": "If a domain is truly non-verifiable, the question makes no sense. We can never know how anything does at any non-verifiable task because we can't verify it. Of course, that isn't what you mean, you mean \"Can an AI get good at things we don't have a reward function for?\". Here the answer is trivial again, of course they can't, the reward function is the only thing that drive abilities. The real question is \"Are there abilities we can't automate a reward function for?\". The answer is \"yes\" right now, but it seems unlikely to stay that way, given how many abilities we used to not have a reward function for, but we now do.",
                "author": "Rain_On"
            },
            {
                "raw_content": "How will this question change if they can win at *convincing?* Because once you shift the axis from truth to persuasion, the whole “verifiable vs subjective” distinction starts to erode. Politics, ethics, aesthetics, narrative, leadership, culture, aren’t judged by correspondence to truth but by uptake. The “right” answer is whatever humans accept and act on. *\"Can AI can discover the correct answer in subjective domains?\"* vs *\"Can AI reliably produce answers that humans find compelling?\"* If a system can model individual and collective preferences, adapt its outputs to emotional and cultural context, iterate based on feedback signals like engagement and trust, *then “subjectivity” stops being a barrier and becomes just another optimization landscape*. Not truth seeking but preference seeking. Humans already defer to persuasive fluency as a proxy for competence. We mistake coherence and rhetorical grace for understanding all the time. An AI that is consistently better than humans at framing and emotional calibration doesn’t need to be “right” in any deep sense. It only needs to be right enough often enough to become the default voice people listen to. Once convincing becomes the metric, the question becomes “What happens when human judgment itself becomes the training signal?”",
                "author": "phaedrux_pharo"
            }
        ],
        "subreddit": "singularity"
    }
]