[
    {
        "post_name": "AI companies to be subsidized by our government to NOT run data centers the same way farmers are subsidized to not grow crops!!",
        "score": 155,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This has more to do with slowing development down so China can catch up. Then we have this big race where everybody is hyped about \"The AI Race\" and congress can spend their fucking pants off to shower AI devs with tax money, only for us to win. And then China has a sudden breakthrough a month later (because we gave them the missing parts. Like we always do).",
                "author": "NomadicKrow2"
            },
            {
                "raw_content": "Put a windmill on the roof. Boom energy! Our taxes pay for our grid. These mega drains of electricity and energy need to find their own way ON THEIR OWN GRID.",
                "author": "EdBuck"
            },
            {
                "raw_content": "Who is the dumbass who built data centers in Santa Clara. There is a reason they are always located where there is cheap power and land.",
                "author": "Snek_Plissken"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Ford CEO Jim Farley laments he can’t fill 5,000 mechanic jobs paying $120K per year: ‘We are in trouble in our country’",
        "score": 175,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They just want cheap imported labor",
                "author": "Alldayeveryday"
            },
            {
                "raw_content": "Boohoohoo. Find a way. Alternatively this is just a way to advertise then try to negotiate down applicants to 30k a year.",
                "author": "julianReyes"
            },
            {
                "raw_content": "120 my ass….. they don’t pay techs shit anymore",
                "author": "42rle"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BOMBSHELL ADMISSION: In a jaw-dropping CNN interview, Lis Smith, a high-ranking 'Democratic consultant', confessed that the 34 felony charges against President Trump were not the result of legitimate legal proceedings, but part of the Democratic Party's 'resistance strategy'.",
        "score": 204,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is news only to the retards in her own party!",
                "author": "AgnesDomini"
            },
            {
                "raw_content": "A set of integrated multivalent extensions of Strzok's \"insurance policy\".",
                "author": "linereddit"
            },
            {
                "raw_content": "I mean didn’t Bragg admit on tv that New Yorkers don’t have to worry about being charged for what trump was and it’s a special case they are moving forward with them. Edit: it was Kathy Hochul. I’d post a video but it’s amazingly gone from the internet, can only find articles with snippet quotes.",
                "author": "Hydris"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: U.S. Border Commander Greg Bovino just posted this and liberals are about to lose their MINDS",
        "score": 806,
        "text_content": "",
        "comments": [
            {
                "raw_content": "HIT THEM BACK **TEN TIMES HARDER**",
                "author": "TEXinLA"
            },
            {
                "raw_content": "More of this please.",
                "author": "USAUSA"
            },
            {
                "raw_content": "Literally voted for this",
                "author": "DingleBalls"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "TESLA TO CHINA: THANKS, BUT WE DON’T NEED YOUR PARTS ANYMORE Tesla is officially cutting China-made parts from its U.S. cars",
        "score": 1150,
        "text_content": "",
        "comments": [
            {
                "raw_content": "wow, that's actually amazing news. the sooner we can move all production to america, the better. well done elon & president trump.",
                "author": "-Evspra"
            },
            {
                "raw_content": "Now make a solid naturally aspirated gasoline engine with a carburetor and put it in a steel International Harvester Scout Style body with modern suspension/brakes etc. and sell them for $25K MADE IN AMERICA...whoever does that will own the world.",
                "author": "BOHICA2021"
            },
            {
                "raw_content": "Elon doing more to protect America from China than Trump and his half a million Chinese spies. The future is grim.",
                "author": "MajJamesMcFarlane"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "YouTube streamer known for harassing strangers and hiding behind his security was arrested in the Miami on drug-related charges. Jack Doherty was charged with possession of a controlled substance, possession of marijuana, and resisting an officer without violence.",
        "score": 699,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He's the moron who crashed a super expensive car because he was speeding on a rain-slick highway, if I recall correctly.",
                "author": "MinnieWhittaker"
            },
            {
                "raw_content": "imagine how much you have pissed off the cops that you get charged for weed in miami beach",
                "author": "NADSAQ"
            },
            {
                "raw_content": "Oh nooooo that sucks Couldn't have happened to a more deserving douchebag",
                "author": "MinneMAGA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Epic Backire from Epstein Email Release",
        "score": 808,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Looks like... Lucy is setting up Charlie Brown with the football *again*... but we can dream.",
                "author": "MehNahMehNah"
            },
            {
                "raw_content": "So ... absolutely no Republicans were involved huh? What do you think we are ... retarded fuckwads? I'm sure Trump is in the files, but that doesn't mean he did anything nefarious. What *IS* the issue (and no one is posting about) is the possibility Trump is delaying this because he is holding cover for who is responsible for the honeypot operation and who was involved. Inviduals in the corporate world, media, entertainment, elites ... and politicians. That's the problem. If half our government and people in power are being blackmailed ... that's a problem with what we vote for. If not, that's great ... but ... \"Epstein\" was a government operation for the purposes of blackmail and we all know that. 🤓",
                "author": "drmrboy"
            },
            {
                "raw_content": "https://www.axios.com/2025/11/14/democrats-shutdown-blame-focus-group Hmm, easy explanation for all the shills here pushing false narratives. > **Seven of the 13 Biden-to-Trump Georgia swing voters** in this week's panels said **Democrats came out of the shutdown looking worse than Republicans. Two said Republicans look worse and four said both parties look equally bad** > **Eight of the 13 said they still approve of the administration's actions on balance since Trump's return to office in January.** These false narratives are based *straight off* the polls, eerily so. **And Georgia too.**",
                "author": "julianReyes"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Socialist Mayor Clown Show Is Truly Something To Behold. Socialist mayors like Zohran Mamdani in New York and Katie Wilson in Seattle are failing at their jobs before they even get into office...",
        "score": 611,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm in WA State and it's pretty Red outside the Puget Sound Area. Seattle is easy to isolate, they could wind up eating sawdust and each other.",
                "author": "GaryWA"
            },
            {
                "raw_content": "And the lesson is: if you wanna win, promise more free stuff and amazing new things than your opponents! Remember Andrew Cuomo and Curtis Sliwa? Those are the names of the two guys who were running against this guy. MORON SCAMDUMMY! 50.4% is as much a winning result as 100%! or 50.0001%!",
                "author": "Tellman125"
            },
            {
                "raw_content": "they’re already failing? let’s recall them with a nationwide referendum",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "EXCLUSIVE: Tina Peters Is Very Sick – Her Prison Cell Is Kept at Near Freezing Temperatures – All for Telling the Truth",
        "score": 1200,
        "text_content": "",
        "comments": [
            {
                "raw_content": "She gets this shithole while Ghislane Maxwell sits in a cushy prison. Things that make you go hm",
                "author": "BidenSniffsLittleKid"
            },
            {
                "raw_content": "Trump needs to pardon Tina ASAP. Democrats are trying to make an example out of this brave woman.",
                "author": "MissingTrump"
            },
            {
                "raw_content": "\"When exposing a crime is treated as committing a crime, you are being ruled by criminals.\" ~ Edward Snowden",
                "author": "HappyFunBall"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 LMFAO! KAMALA HARRIS: \"I was playing 3D chess against Donald Trump.\" GREG GUTFELD: \"She says 3D chess — chess is already 3D! She probably meant 4D, but she probably had already DRANK a 40!\" 🤣",
        "score": 779,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nope. Chess is 2D. There is one plane, X and Y axis There is no Z",
                "author": "5DchessWatch"
            },
            {
                "raw_content": "Chess is a 2D game and you all know it. Just because the pieces exist in a 3D reality doesn't make the game 3D.",
                "author": "HuggableBear"
            },
            {
                "raw_content": "Uh no chess is 2d game, the fact you're playing it in the 3d world doesn't make it 3d",
                "author": "ParadigmShift2070"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Bold Move-Leaders of New York City’s “Forgotten Borough” — and most conservative enclave — are re-introducing stalled legislation for Staten Island to secede from the People’s Republic of Mamdani.",
        "score": 1117,
        "text_content": "",
        "comments": [
            {
                "raw_content": "build the wall!",
                "author": "cyberwar"
            },
            {
                "raw_content": "From the article, \"State approval is required for secession to happen.\" I am sure the dem super majority in the NY legislature and Hochul are ready to do GOP voters a favor!",
                "author": "Praetor_Sean"
            },
            {
                "raw_content": "Fake and gay. They have a less than 0 chance. Same goes for the Virginia counties. Toast, live with it.",
                "author": "clearasabell"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: DoorDash driver who was fired for sharing a video of a customer and falsely claiming she was sexually assaulted has been arrested and now faces felony charges.",
        "score": 631,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"BREAKING: DoorDash driver who was fired for sharing a video of a customer and falsely claiming she was sexually assaulted has been arrested and now faces felony charges. Livie Rose Henderson, instead of leaving the customer’s meal at the door as instructed, entered his home, found him asleep on the couch with his pants down, and recorded him. After posting the video all over the internet, she claimed she had been sexually assaulted and even filed a police report. The customer reported the incident, which led to an investigation and the deactivation of Henderson’s DoorDash account for violating privacy policies. Henderson now faces two felony charges: unlawful surveillance for amusement or profit, and unlawful dissemination of a surveillance image to sell or publish.\" https://www.tiktok.com/@irlmonsterhighdoll She also claims to be lesbian haha \"Note: the man provided the police with his ring camera video where it shows her opening the door.\"",
                "author": "PiratePatriotParrot"
            },
            {
                "raw_content": "people dug into her profile on tiktok and she's super woke Here's her dumb tiktok https://www.tiktok.com/@irlmonsterhighdoll",
                "author": "PiratePatriotParrot"
            },
            {
                "raw_content": "Posts video in her robe with hard nipples",
                "author": "RhodesianRidgeback"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "eVEn ePsTeiN hAtEd hIM!!!!!",
        "score": 969,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Guys Epstein hated Trump but we can’t release the files",
                "author": "BidenSniffsLittleKid"
            },
            {
                "raw_content": "Trump worked with Virginia's lawyer to bring the whole thing down. He is the reason Epstein is in jail.",
                "author": "MissingTrump"
            },
            {
                "raw_content": "Part of being a leftist is not only believing literally anything, but believing contradictory things at the same time due to general lack of self-awareness",
                "author": "jsphere256"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"Healing\" ❤️‍🩹",
        "score": 1255,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Gaming culture never fell ill to begin with.",
                "author": "sneak"
            },
            {
                "raw_content": "It won’t be healed until I can drop n bombs at the top of my lungs because a 14 year old choked on capping C.",
                "author": "Viewer01"
            },
            {
                "raw_content": "They’re sick of weirdos trying to take over their hobbies. I can relate because the trannies and other alphabets have ruined many of my former crochet/knitting communities.",
                "author": "Winter_bow_huntress"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔴How to lose a presidential campaign endorsement in less than 6 months: - lie and freak out about war in Iran that never happened. - stand in front of a bunch of psychotic boomer leftists carrying signs calling Trump a sex trafficking pedophile.",
        "score": 876,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is this an MTG reference?",
                "author": "Calumet57"
            },
            {
                "raw_content": "I can make one of these entitled “how to lose your entire base in 2 weeks” Step 1) call for more H1B visas",
                "author": "BidenSniffsLittleKid"
            },
            {
                "raw_content": "Is this seriously what MTG did?! WTF did I miss the past couple of days?!",
                "author": "CerebralPimp"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🧸🐸🌙🇺🇸",
        "score": 465,
        "text_content": "",
        "comments": [
            {
                "raw_content": "LOVE YOU FRENDS",
                "author": "jeb_is_a_mess"
            },
            {
                "raw_content": "And smart men love smart women who love Trump. 🙏🙌😇👍🇺🇸✊️",
                "author": "Landslide_2020"
            },
            {
                "raw_content": "TY SWLT! Pure Love for MAGA! DJT Foreva!",
                "author": "LightBeacons"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Be_Less_Retar(D)ed",
        "score": 1001,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Trump has broken them, completely and truly.",
                "author": "auntjemima"
            },
            {
                "raw_content": "Ha, wait till they find out how times Bill Clinton is mentioned. Democrats know Bill Clinton is a rapist.",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "If Trump did anything wrong then TDS patient Michael Wolff would have released it on 10/31/2024 during his podcast in an attempt to influence an election. What Wolff failed to disclose is he himself was an Epstein buddy, even going as far as trying to coach Epstein how to improve his image in the public. They got nothing.",
                "author": "PresidentAutopen"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Psychotherapist says 'Trump Derangement Syndrome' is the defining pathology of our time",
        "score": 976,
        "text_content": "",
        "comments": [
            {
                "raw_content": "they live in an echo chamber and believe the media",
                "author": "SHILL_DETECTOR"
            },
            {
                "raw_content": "We can thank the media's 24/7/365 never ending deluge of lies and slander for that. It's one thing to have Democrats talking shit about Trump, that's expected from an opposing party. It's another thing to have all of MSM constantly pushing their TDS bullshit.",
                "author": "cosmos411"
            },
            {
                "raw_content": "Imagine letting someone live rent free in your head lol",
                "author": "Jsmitty112"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Well wellllll welllllllllllllllll 🤨",
        "score": 1274,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There are two Epstein stories. One is the crimes against children by pedo elites the other is this bullshit after the fact. Trump’s approach to this is like none of the former ever happened and it’s all about this shit later in the timeline where the Dems tried flipping it on him. Sorry Trump but not everything is about you and this is where you royally fucked up. He should have made it 100% about the kids and saving future victims. He’s so concerned about bringing the people together. Sorry, a strong economy is not bring people together. Solving foreign conflicts is not bringing people together. You know what would? Going on a crusade against the pedo elites. Taking down real names. Big names. Saving the children should always be the number one goal. It’s the only thing most sane people can agree on.",
                "author": "JoeMcCarthyWasRight"
            },
            {
                "raw_content": "Arrests? Anyone?",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "Democrats cheat at everything. Kamala Harris had hearing earrings on during the Presidential debate.",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "HOOVER BUILDING IS A \"BLACK HOLE.\"",
        "score": 324,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Awan brothers laptop also",
                "author": "FakeNametag"
            },
            {
                "raw_content": "Weiners laptop with insurance files also. Worthless fucks. FBI is asshoe and needs to be abolished. Still waiting Kash. MAGA AF",
                "author": "Mulletgunning"
            },
            {
                "raw_content": "All safely buried in the Neverdence Locker",
                "author": "Braujager"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "VRAM Cost Is About To Make GPUs Way More Expensive",
        "score": 39,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I bought a gaming pc like two years ago, and it's beginning to look like it was my last one.",
                "author": "PeksyTiger"
            },
            {
                "raw_content": "Oh. Like they aren't already.",
                "author": "oscitancy"
            },
            {
                "raw_content": "A short while ago vram was way cheaper than ever before and gpus did not become cheaper they became more expensive Now vram is a bit more expensive than it was a few years ago and gpus should become even more expensive? Tech channels doing their part anchoring consumers price expectations ever higher.",
                "author": "Cheap-Plane2796"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Overclocker uses camping freezer to push RTX 5050 to nearly 3.5 GHz, smashes world records — smallest Blackwell GPU gets 23% clock boost",
        "score": 340,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nvidias smallest dies are interesting. Higher yields cause they're tiny, and they're usually made on a different node than the bigger x04+ dies. I had TU11(small die) chips gets 30%+ gains. Sadly that was the last uarch I fucked with.",
                "author": "electronic-retard69"
            },
            {
                "raw_content": "Ah yes, a reddit post turned into article, then reposted back to reddit. The cycle is completed.",
                "author": "mrheosuper"
            },
            {
                "raw_content": "Saw the original post very nice shuntmod",
                "author": "ComfortableUpbeat309"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Reuters] Samsung hikes memory chip prices by up to 60% as shortage worsens, sources say - The South Korean firm's contract prices for 32 gigabyte(GB) DDR5 memory chip modules jumped to $239 in November, up from $149 in September",
        "score": 149,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Didn't expect my pc to appreciate because of the memory in it. This is insane.",
                "author": "upbeatchief"
            },
            {
                "raw_content": "Eh, memory is always really boom or bust. Just like a year ago we had articles about how Samsung was going to close plants because of how much DDR5 was flooded into the market at the time. Really sucks for people who need to build/buy at the moment, but yeah....I got caught with my pants down during a DDR4 boom and overpaid on my build back in the day, so I feel the pain :/ shit sucks dudes and I hope things level off soon.",
                "author": "Logical-Database4510"
            },
            {
                "raw_content": "Ah well so much for AI HBM not having any impact on DRAM prices.",
                "author": "BlueGoliath"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "How Smartphones Are Made in China",
        "score": 21,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Oppo's sta, now I really wonder if laptops could also stack motherboards to conserve space have the CPU (and dGPU) and all its associated components face down, then have the rest of the laptop's sockets facing up",
                "author": "LastChancellor"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "New laptop battery life record for the ThinkPad T14 series: this CPU [Intel 258V] makes the best known business laptop more efficient",
        "score": 6,
        "text_content": "",
        "comments": [
            {
                "raw_content": "how on earth is this the best battery life laptop they have tested? The laptop has a 57 Whr battery which is pretty small compared to some other 258v and the lower power 226v laptops which come is 70+ Whr laptops. not to mention the more efficent ARM chips like the snapdragon and apple stuff nvm I cant read it says the most efficent t14 which doesn't really mean much",
                "author": "Open_Map_2540"
            },
            {
                "raw_content": "Hello -protonsandneutrons-! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "No upgradable memory ☹️",
                "author": "SecretTraining4082"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Branch Education] How do CPUs Work? Exploring the 💻🧬 DNA of the Digital World",
        "score": 31,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Branch Education, what a GOAT.",
                "author": "zxyzyxz"
            },
            {
                "raw_content": "It's one of those videos, where it feels like each CPU subsection could get its own video series of 'branches'. Still summarized the key issues very well for an introduction. Carrying the weight of >50 years IC development plus most ISAs and programming languages, there's only so much half an hour can explain.",
                "author": "JuanElMinero"
            },
            {
                "raw_content": "30mins is way too short to explain even an old CPU. modern ones would take hours upon hours to go through each functional block.",
                "author": "randomkidlol"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Gamers Nexus] Valve Steam Deck Secrets: Engineering & Design of Memory, PCB Layout, and Thermals",
        "score": 17,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Machenike intros new affordable configuration for AMD-powered GTR mini PC",
        "score": 4,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hello TheAppropriateBoop! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "New wave of Nintendo Switch backwards compatibility fixes live on Switch 2 - Xenoblade X, Batman: Arkham Knight, Tokyo Xanadu, more",
        "score": 450,
        "text_content": "",
        "comments": [
            {
                "raw_content": "nier automata soon please i said before that I'd give my left nut for it but now im willing to give both just fix the damn game im not even asking for 60fps just make it playable at least dear god",
                "author": "Gladiolus_00"
            },
            {
                "raw_content": "This article doesn’t explain anything that changed lol",
                "author": "_lemon_hope"
            },
            {
                "raw_content": "I hope they fix Borderlands 3 soon.",
                "author": "TTBurger88"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "After dying 300+ times at Champions Road, I am finally done with Super Mario 3D World!",
        "score": 126,
        "text_content": "What a fantastic game. The only 5 stamps left are for clearing all leves with all characters, which I will leave for when I have friends to play with. Next stop, Bowser’s Fury 🚂",
        "comments": [
            {
                "raw_content": "Is this after beating the game? I'm about to go into the World 5 castle",
                "author": "cloudlocke_OG"
            },
            {
                "raw_content": "If you have extra controllers, just activate them and you can get at least 3 of them on the flagpole if you’re quick. Obviously not a very fun way to do it but it’s an option.",
                "author": "munchyslacks"
            },
            {
                "raw_content": "I want a full, big, actual sequel to 3D World.",
                "author": "FontFanatic"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Metroid Prime 4, Disingenuous Ragebait, and Rude Nintendo Fan Behaviors?",
        "score": 40,
        "text_content": "The entire discussion around Metroid Prime 4 and the new character seems completely fabricated. IGN immediately started out with a large hit-piece against the game over this single character. Nintendo fans who have defended and up roared for the continuation and support for niche and somewhat hard-to-get-into games have nothing but disgust for Metroid Prime 4 attempting to do anything. I will not name the obvious Youtuber, but I think it's fair to say that if you're a Metroid fan and a fan of other sci-fi games, you'd also feel like me. Very VERY sad. Every internet space is a hellhole making fun of Mackenzie when his presence is not even large, and in fact - a great addition. I didn't see any of the reactions yet, just watched the overview trailer and the 20 minute gameplay segment from \"Press Start Australia,\" and thought \"wow. What a colorful cast. Reminds me of Aliens.\" The game looks like it has so much charm and life into it. From the world, the music, even the cutscene production looks so fantastic. Better than one's I have seen in other AAA games like God of War or Horizon. Yet, this game introduces a comic character, who only has so many lines until you leave, and that is enough for Youtubers to create entire \"crash-outs\" against this game. What about the few Metroid fans? This is already a niche sci-fi series, unlike other Nintendo IPs, yet other Nintendo fans are also ripping this game to shreds without a single thought of \"maybe this isn't for me.\" I find the entire behavior extremely rude and disingenuous. This character absolutely did not cause this much pain. We have already seen the game. It is colorful, big, open, and less \"scarily isolating\" than past entries. No one could possibly think this is surprising. Even during the treehouse footage, there was such a highlight on the Federation troopers with their unique dialogues and voice lines. If you wanted to indulge in the \"isolated experience,\" you are free to play the prior games. Metroid Dread is brilliant and it's right there, with a likely chance of a sequel coming soon. Games like this used to be extremely celebratory. To have Samus be more stoic than ever, escaping a planet to actually save people, rather than killing an entire planet's life, is extremely noble and reminds me of the best of sci-fi gaming, Halo. These stories mean so much to people and it's extremely rare to have these sci-fi stories come out today. Finally, this reminds of Aliens, and while Ripley may not have saved the team, it might be wonderful to see a character like Samus, heroically save the team and potentially save the planet (a different outcome compared to each game before). I am disappointed in all the hit-pieces, and rage baiting journalists / YouTubers. I can't wait to play this game, and I hope Retro Studios, and all the new developers feel proud about themselves for what may be such a fantastic experience and new perspective for the Metroid franchise. The studio has inspired my life so much and I thank them for all their work. Thanks https://preview.redd.it/jyfo3vg7oi1g1.png?width=1798&format=png&auto=webp&s=ad66cfc893321daa72fa6b00401dc0cf0b1f04bb",
        "comments": [
            {
                "raw_content": "This is the most I've seen Metroid fans talking since......well ever, not even during Dread or Prime Remastered.",
                "author": "KelvinBelmont"
            },
            {
                "raw_content": "I'll reserve judgement until I play the game. But my bet is that this is just the first hour or so. Metroid Prime 3 was also quite talkative in the beginning before it settled into a pace similar to its predecessors.",
                "author": "DSMidna"
            },
            {
                "raw_content": "If my favorite thing about Metroid prime was the lonely atmosphere I'd be pretty concerned if I had a partner yapping in my ear to describe everything I do and see in the early previews. The ign piece isn't a hit piece, it's one reviewers impression. I'm not making a decision on it yet as I'll wait for the reviews",
                "author": "spacepizza24"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "As a kid who grew up with the PSP, Tenkaichi was my main game back then. This feels so nostalgic (yes, back then I was blown away by the graphics 😭).",
        "score": 142,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Tenkaichi 3 graphics on PS2 were wild",
                "author": "SenpaiSwanky"
            },
            {
                "raw_content": "I have it on PC so the graphics didn't impress me, yes I bought twice now it is just that fun, but I do like the portability and that the game feels like a was actually made to work perfectly on the S2 and not just a half-assed port. I only miss the mods from PC. No more Winnie the Pooh, Kermit, Actually Black Goku Black, Lego Ninjago Old man, Kefla SSJ3, Moro, Blaziken, Android 21, Ultra Ego Vegeta, Black Frieza, Gojo, Olaf the snowman, Xenomorph and Among Us.",
                "author": "Lord_Snaps"
            },
            {
                "raw_content": "I’m waiting on Xenoverse 3… I have collected all these characters 10 times over before on other games, and played through the events of the shows and movies as many times… it’s kinda lost its appeal. However I really enjoyed making and upgrading my own custom characters in Xenoverse 1/2 and the unique alternate timeline stories in those games feel fresh to me. Sparking Zero looks like a great game ngl, but Im gonna reserve my Dragon Ball monies for Xenoverse 3.",
                "author": "Ok_Artichoke_2274"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I don’t know if this question has been asked before, but what do you all do with your Switch 2 boxes after unboxing the console?",
        "score": 219,
        "text_content": "(I keep mine on display)",
        "comments": [
            {
                "raw_content": "Place in closet to collect dust for years until we decide to move and then realize we had no use for keeping. Then toss as we don’t want to take it with us to move",
                "author": "Suspicious-Screen-43"
            },
            {
                "raw_content": "Mine I threw it away, I have no space for boxes.",
                "author": "Vinidesigner"
            },
            {
                "raw_content": "I kept mine, if for example I move, I can put everything in one box or decide to sell it (which is really unlikely)",
                "author": "jukkimo1"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Mike Straw: “It’s happening soon enough. Just be ready.”",
        "score": 891,
        "text_content": "https://xcancel.com/mikestrawmedia/status/1989713848924876952?s=46 Is it finally time? Half-Life 3? Edit: should have stated. This guy is a senior editor for Insider Gaming and works with Tom Henderson",
        "comments": [
            {
                "raw_content": "Time, Dr. Freeman? Is it really that time again? It seems as if you only just arrived. You've done a great deal in a small time span. You've done so well, in fact, that I've received some interesting offers for your services. Ordinarily I wouldn't contemplate them, but these are extraordinary times. Rather than offer you the illusion of free choice, I will take the liberty of choosing for you if and when your time comes round again. I do apologize for what must seem to you an arbitrary imposition, Dr. Freeman. I trust it will all make sense to you in the course of… well, I'm really not at liberty to say. In the meantime, this is where I get off.",
                "author": "F35_Mogs_China"
            },
            {
                "raw_content": "Knack 3... BY BALVE!!!!!!",
                "author": "FransD98"
            },
            {
                "raw_content": "Clearly teasing Doctor Who: The Eternity Clock Part 2 - it's been a 13 year wait but our patience has worn off guys.",
                "author": "Barden_1996"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Switched to AMD",
        "score": 109,
        "text_content": "I have been intel/Nvidia for the last 15 years and finally decided to switch teams. 9800x3d+9070xt on an msi x870e. Coming from a 14700kf+3080ti it finally doesn't feel like I'm next to a space heater while gaming!",
        "comments": [
            {
                "raw_content": "Awesome rig! Enjoy them frames!",
                "author": "SouthsideRapGod"
            },
            {
                "raw_content": "That's not a computer... it's a desk lamp that runs windows.",
                "author": "Tricky_Fun_4701"
            },
            {
                "raw_content": "Welcome to the Red Team. We have cookies (the nice kind, not the annoying internet ones haha) seriously lush rig OP!",
                "author": "locutuscub86"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "A recession is ALREADY here for 23 states - laying bare the cracks in the US economy",
        "score": 361,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Here in red Michigan, definitely feels like recession. Stores are closing everywhere, houses sitting for months, construction projects being cancelled. Unfortunately, prices continue to rise (for now).",
                "author": "almighty_gourd"
            },
            {
                "raw_content": "My friends in Texas say things are bad. I don't believe they are growing.",
                "author": "NotClayDabbler"
            },
            {
                "raw_content": "It’s been this way for 18mo… most anticipated recession, drop, collapse, whatever you want to call it, in years",
                "author": "DocMicStuffeens"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Story Checks Out…",
        "score": 295,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That’s another cruise around the world at least",
                "author": "VendettaKarma"
            },
            {
                "raw_content": "Boomers truly are. .the most selfish generation. Nobody else comes close.",
                "author": "Skilletmasterx"
            },
            {
                "raw_content": "Don't forget portable mortgagees so housing prices double because people are bringing 2% rates with them.",
                "author": "ShotBuilder6774"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Best Rebar Coupler Manufacturer In India - https://suryaengineering.net/product.php?product=94",
        "score": 0,
        "text_content": "# ISO Standards (Worldwide) # ISO 15835 – Mechanical Splices for Reinforcing Bars Two parts: * **ISO 15835-1**: Requirements for couplers * **ISO 15835-2**: Test methods **Key points:** * Verifies tensile strength, slip, fatigue, and ductility * Requires the splice to maintain at least the full tensile capacity of the bar * Very commonly used in international projects",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "15 November 2025 - Weekly /r/REBubble Discussion",
        "score": 2,
        "text_content": "What's the word on the street? Share your questions, comments, and concerns below.",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "A robot tries golf and ... it's a hole in one",
        "score": 794,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is an old video though. Years old.",
                "author": "Anen-o-me"
            },
            {
                "raw_content": "I wonder how accurate it is, like how often does it hit a hole-in-one? Interesting to think that absolute perfection in golf may be attainable if all variables are dialed in. It could possibly be used to be an extremely advantageous aid to golf coaches... It could be like chess where all the past players moves (and variables at the time the ball was hit) are documented and fed into the system, leading to virtual perfection.",
                "author": "duh1"
            },
            {
                "raw_content": "9 years old btw",
                "author": "Moriffic"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "More Nano Banana 2 images (We are cooked, for real this time)",
        "score": 789,
        "text_content": "",
        "comments": [
            {
                "raw_content": "woohoo... just in time for the Epstein files disclosure, so Trump can claim the photo of him blowing Bill Clinton is an AI fake...",
                "author": "Superduperbals"
            },
            {
                "raw_content": "That second image... I'm not going to lie the game looks tough. It's never easy when you have to fight two bosses at the same time.",
                "author": "Equivalent_Buy_6629"
            },
            {
                "raw_content": "https://preview.redd.it/74drdqb1hg1g1.png?width=1376&format=png&auto=webp&s=18c2f6f496392e05efdb1e3255d1cba0db7193bc",
                "author": "OmegaGogeta"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Turning sand into minds and sending them into space",
        "score": 82,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Houses are made of trees, and we have plenty of places to put houses. Therefore, everyone should own multiple houses.",
                "author": "endless_sea_of_stars"
            },
            {
                "raw_content": "What even is the point of posting this",
                "author": "Purusha120"
            },
            {
                "raw_content": "Twitter should stay on twitter.",
                "author": "WhenRomeIn"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Algorithmic DJ feels futuristic, @ switch angel using Strudel",
        "score": 421,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"Increase the duck attack to 160 ms\" A glorious phrase.",
                "author": "Bipogram"
            },
            {
                "raw_content": "Sick boss fight music",
                "author": "garymo1"
            },
            {
                "raw_content": "Fascinating stuff",
                "author": "Random-Squid"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Has anyone claiming \"access to Gemini 3\" tested it for something meaningful?",
        "score": 30,
        "text_content": "All I've seen so far are bs frontend designs and couple of toy games. You have supposed access to the next \"frontier\" and all you're testing it for are some slop frontend design? Who gives a flying f\\*ck about frontend? How is it in real world programming in harder languages like C/C++/Rust etc and system programming? How is it in hard math and science problems that are not from some competition set that's easily available on web? How long can it work autonomously?",
        "comments": [
            {
                "raw_content": "I told it my neighbor's dog was too loud. About 30 minutes later I heard a sharp squeal and some screaming and then total silence. I can finally go to sleep now",
                "author": "tondollari"
            },
            {
                "raw_content": "Gemini 3 access was inside of Canvas, which only supports a single html file and nothing else. And the AB tests which were all single-prompt only",
                "author": "LightVelox"
            },
            {
                "raw_content": "Yes, there have been instances, like the recent story of the historian for parsing old documents. There are people who are under NDA who have more access. Most likely, we will know more Tuesday. Also front end is huge - being good at front end design means that Gemini will be the most used model. But more than all that, posts like this seem immature and fanboyish, are you aware?",
                "author": "TFenrir"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Anthropic Update: The free \"Sonnet 4.5\" access has ended.",
        "score": 90,
        "text_content": "Anthropic Update: The free \"Sonnet 4.5\" access has ended. • Free Plan: Now \"Everyday Claude\" (Haiku 4.5). • Paid Plan: \"Smarter Claude\" (Sonnet 4.5) now requires an upgrade and is labeled \"PRO\" on mobile.",
        "comments": [
            {
                "raw_content": "I still have Sonnet 4.5 on desktop. Are you in the US?",
                "author": "TheHunter920"
            },
            {
                "raw_content": "I think it varies, depending on how overloaded they are",
                "author": "Sunifred"
            },
            {
                "raw_content": "https://preview.redd.it/tn0tqp99dh1g1.jpeg?width=1080&format=pjpg&auto=webp&s=0f62b1fe728566bbc5c84e0d2e9da59d025b9bb4 Yep ...only haiku 4.5 for free",
                "author": "Healthy-Nebula-3603"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Live Chat with Gemini has improved so much I was surprised.",
        "score": 73,
        "text_content": "Couldn't even tell you how shocked I was to hear the live voice in Gemini after like 4 months. It's changed totally in a very good way. Way better than Chatgpt in every regard. Nuanced speech is there, with everything from sarcasm to excitement. Honestly kinda shocked how real it sounded. Maybe Im just not updated on the SOTA model for voice but holy shit the live voice is good.",
        "comments": [
            {
                "raw_content": "I’m eagerly waiting for voice mode to be actually helpful and couldn’t find it anywhere months ago. Are you using the app or aistudio?",
                "author": "DatDudeDrew"
            },
            {
                "raw_content": "It is the first model I've used that can speak Burmese! All previous voice models speak gibberish when asked to speak that language.",
                "author": "leakime"
            },
            {
                "raw_content": "I've been using it off and on since it was released. It has gotten better. I really like it's adaptation capabilities. If I fuck up what I'm saying or pause for a second to long, where it'll start up, and then I resume what I was saying - it doesn't matter how messy the incident was, it ultimately delivers what I was asking/talking about. That's amazing imo",
                "author": "emteedub"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Anil Seth, Can AI Be Conscious? | Natural Philosophy Symposium 2025",
        "score": 42,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Interesting talk, but to me, it's not very convincing as a reason that AI cannot be conscious. It's just classic biological chauvinism: >\"Perhaps life, rather than computation, breathes fire into the equations of consciousness\" Also, he said that: >\"My view is definitely a minority among consciousness researchers\" I've never met someone who believes in Biological Naturalism (as opposed to Computational Functionalism) who is seemingly, **also** a materialist. Interesting perspective - but I fail to see what aspects of physics/biology could not be simulated by a Turing machine. Just because computers are base 2 doesn't mean that they can't simulate arbitrarily precise continuous, real world functions. Also, I'm not even sure that there's a concensus among physicists that the universe **isn't** discrete.",
                "author": "Inevitable_Tea_5841"
            },
            {
                "raw_content": "If you can't define and explain consciousness (which no one can, and if you think they can you're wrong and are far less intelligent than you think), this debate is pointless. And it is.",
                "author": "AirGief"
            },
            {
                "raw_content": "Anil Seth is mystifying the biological substrate. It's a form of carbon chauvinism. It's better to listen to Michael Levin on this topic. There's a discussion of them on YouTube.",
                "author": "DepartmentDapper9823"
            }
        ],
        "subreddit": "singularity"
    }
]