[
    {
        "post_name": "The Shadow Of Terror: Zohran Mamdani's Radical Islam Problem",
        "score": 799,
        "text_content": "",
        "comments": [
            {
                "raw_content": "deport him so I can stop reading his annoying name",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Its not a problem. Dems love evil. These people dont have God. Its a dishonest playing field.",
                "author": "America_No_1"
            },
            {
                "raw_content": "Remove kebab.",
                "author": "DeusVult1096"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 WATCH: I took advantage of leftist militants being distracted by yelling at each other to walk through their newly-rebuilt camp outside ICE Portland! THOUSANDS of dollars worth of supplies, food, and equipment—INCLUDING gas masks—are nicely organized in bins",
        "score": 824,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It is a Foreign Terrorist Organization.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Why is Nick the one having to do this? Where are the authorities?",
                "author": "deletedandreacted"
            },
            {
                "raw_content": "They about to catch 3-4 inches of rain between now and Tuesday morning, lol. Nothing smells worse than soggy antifa.",
                "author": "GhostOfMyFormerSelf"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ALL TRADE NEGOTIATIONS WITH CANADA ARE HEREBY TERMINATED",
        "score": 940,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Get fucked, Commie Canadians. 🍁 I like Vermont maple syrup better anyway, eh",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Canada be like: Durrka durrka Mohammed jihad, eh!",
                "author": "JoeBidensDementia1"
            },
            {
                "raw_content": "Voted for this. Saw thay commercial last night and was like WTF? Its was this Ontario commercial, same ones where they try to appeal to \"friendship\" and \"collaboration\" with \"friends across the bridge\". Fuck off Canucks",
                "author": "DingleBalls"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Pam Bondi tell Nancy Pelosi to preserve her emails",
        "score": 720,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You dumb cunt. You just gave her a warning to DELETE her emails! And you don't have the balls to arrest her anyway and Nancy knows this. Fucking unbelievable!",
                "author": "JoeBidensDementia1"
            },
            {
                "raw_content": "Get off Fox News, shut the fuck up, and do something.",
                "author": "ScarlettOMaga"
            },
            {
                "raw_content": "Damn I thought the whole Pam bondi Fox News thing was just a meme. She’s really on there all the time, huh? Arrest some traitors you dumb bitch",
                "author": "Spuck_Fez"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This is insane -",
        "score": 1265,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don't know how families of the recent people killed in that horrific crash in California can't sue the fucking state. Holy shit there is just no fucking way they can't be held liable.",
                "author": "_Sully_"
            },
            {
                "raw_content": "This a huge scandal. We need to know the full severity of the impact this negligence has caused for Americans. We need to investigate all cases. California will not investigate or report matters involving illegal immigration. We will never know what is going on if we lead it up to California politicians and media.",
                "author": "RiffFantastic"
            },
            {
                "raw_content": "These democrat shit hole states are just completely lawless. We cannot live with these criminals.",
                "author": "raptormissle"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Secretary Sean Duffy : I’m bringing together the greatest minds in architecture, engineering, and design to answer a simple question: How can America get back to making BEAUTIFUL infrastructure that MOVES us all?",
        "score": 757,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Pro Tip - Don't hire any architects from the Obama Dildo Library.",
                "author": "MAGAguitar"
            },
            {
                "raw_content": "The only architecture I like is Neo Classical and Art Deco. Please more of them not this soul crushing Brutalist architecture. Edit: Whoever downvotes me apparently like that Obama Library of Dildos.",
                "author": "DT170x"
            },
            {
                "raw_content": "not by importing mud hut architects",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Admiral Crackbar is back and doxxing ICE",
        "score": 1107,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is what happens WHEN YOU DONT FUCKING ARREST MOTHERFUCKERS PRESIDENT TRUMP",
                "author": "Jakylangelo"
            },
            {
                "raw_content": "Why does this bitch look like a fish looking at you when you tap on the tank? Shit's not normal",
                "author": "holyshit420"
            },
            {
                "raw_content": "IF the CIA and FBI actually cared about this country even remotely, they'd still be blackmailing commies like this. If we're going to have these secretive departments, they may as well be weaponized against leftists. They tracked MLK's infidelity and drug habit. Keep doing it.",
                "author": "MasterChief08"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Whoever did this is the greatest troll on earth 😂",
        "score": 678,
        "text_content": "",
        "comments": [
            {
                "raw_content": "When he took off his sombrero, there should've been a small one underneath",
                "author": "Sythen"
            },
            {
                "raw_content": "People who submit vertical videos of proper landscape videos aren't doing this whole being alive thing very well. Do better.",
                "author": "ERIC_CIARAMELLA"
            },
            {
                "raw_content": "One sees such policies and what can one say but \"Dollar Store Obama\"! ﹩🏪 🕋",
                "author": "MAGAguitar"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Things go off the rails after Democratic strategist Julie Roginsky says Trump is not \"mentally well\" on Piers Morgan.",
        "score": 1060,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Way to back up your claims you stupid bitch",
                "author": "Spuck_Fez"
            },
            {
                "raw_content": "They have got to ban propaganda again in news agencies. It’s just entirely so exhausting having to listen to people endlessly try and gas light you. I just want to go back to low stakes politics where if a democrat won it meant a 2% tax hike and some poors getting more food stamps. Now a Democrat wins and I wonder if I’ll be shooting antifa fags for getting doxxed after a spicy take.",
                "author": "Viewer01"
            },
            {
                "raw_content": "The \"I know you are, but what am I?\" defense. Classic. As an aside, I'm still waiting for that beta Dave Smith to admit he was wrong about Trump's Iran actions being Iraq 2.0. He was the poster boy for the weak right abandoning Trump, crying that the sky is falling, and since then he's been indistinguishable on foreign policy from AOC.",
                "author": "dunkeaters"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump on cartel strikes",
        "score": 1475,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I didn't vote for this, but I would have if I had known. Let's pump those numbers up",
                "author": "gillonba"
            },
            {
                "raw_content": "Using military assests to actually benefit the American people? What an odd concept...",
                "author": "austford"
            },
            {
                "raw_content": "Better than bombing civilians and hospitals like a certain closeted Kenyan I know of.",
                "author": "Mayhem"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Just don't bring your brain-dead 'liberal values' to FL!",
        "score": 1253,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If you move from a blue state to a red started (or the other way) you should be barred from voting for a full presidential cycle. Soak in the local culture before you try to subvert it",
                "author": "Formerlurker92"
            },
            {
                "raw_content": "That's a car bomb.",
                "author": "DeusVult1096"
            },
            {
                "raw_content": "Traffic is awful in Florida now thanks to so many people fleeing Democrat communism. For their character development ex democrats should have to be settlers in the wilderness and build up the land instead of invading.",
                "author": "TrumpAndGodWin"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Merrick Garland, Chris Wray signed off on ‘Arctic Frost’ probe that targeted GOP groups, ‘spied’ on senators, documents show",
        "score": 1266,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm shocked. Shocked I tell you Ok not that shocked",
                "author": "Formerlurker92"
            },
            {
                "raw_content": "When do the arrests start?",
                "author": "sumnayin2"
            },
            {
                "raw_content": "Of all the commie cocksucking Bo1sheviks from the last admin, Garland is tied with Mayorkas for the being worst. Theyd fit right in in Lenin's regime with helping instantly genocide 10 million with joyful glee. Then bask in pleasure as another 30 million suffer and starve to death.",
                "author": "MAG-n-KAG"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Never forget they said",
        "score": 1807,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Remove Kebabs",
                "author": "shialecuck007"
            },
            {
                "raw_content": "Remember that it was RINO fucks like Bush who started mass-importing Muslims - Obama and Biden just followed the leader.",
                "author": "Ghostphaez"
            },
            {
                "raw_content": "It turns out that was a fucking lie",
                "author": "Formerlurker92"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔥 The Boss 🔥",
        "score": 1192,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The absolute joy I get knowing leftists are miserable every day Trump is president is immeasurable.",
                "author": "devilspawn"
            },
            {
                "raw_content": "Unique photo. Really captures the \"me vs the world\" vibe",
                "author": "Formerlurker92"
            },
            {
                "raw_content": "Charlie was meant to sit in that chair one day.",
                "author": "MedicallyReddit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Swedish court rules Muslim migrant who raped teen girl won't be deported because rape didn't last long enough",
        "score": 1275,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Did the Swedish judges agree to be raped for the same amount of time to make sure they were adjudicating correctly?",
                "author": "MAGAguitar"
            },
            {
                "raw_content": "The good old \"just the tip\" defense! The next logical step for them will be the \"anal doesn't count\" defense since that's what all the Arab girls do to \"remain virgins\"",
                "author": "UsernameChexOut"
            },
            {
                "raw_content": "Whites have done themselves in. It’s unbelievable. At least the Plains Indians fought a little bit.",
                "author": "Ugh3rdaccount"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Three ICE Agents seriously injured after another vehicle ramming attack. The suspect, an illegal alien from Kuwait was being harbored by sanctuary Gov. Gavin Newsom in San Diego.",
        "score": 1222,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I will feel relieved when they finally start shooting these attackers dead.",
                "author": "Prandogolio"
            },
            {
                "raw_content": "Arrest Gavin Newsom",
                "author": "Wupta"
            },
            {
                "raw_content": "If he gets criminally charged here he doesn't get sent back to his desert shithole, instead he stays here to face the charges, possibly do time here too. All at our expense of course. Probably gets let out on bail by some DEI appointee judge too",
                "author": "RINO_fatigue"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Yep. Dems acting more and more like a labor union when they go on strike. Blocking ALL ways to keep the business going while they try to hold it hostage.",
        "score": 1482,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We now have Schumer on RECORD voting to not pay federal workers. Good job GOP.",
                "author": "USDMaga"
            },
            {
                "raw_content": "Pinochet threw union leadership out of helicopters.",
                "author": "RedStoneDeepState"
            },
            {
                "raw_content": "Give it a little over a week and Dem voters will lose their food stamps",
                "author": "henri_derelicte"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Unhinged Democrat Strategist James Carville Fantasizes About Trump “Collaborators” Being Shaved, Forced Into Orange Jumpsuits, Paraded Down Pennsylvania Avenue, and Spat On by the Public - Jim Hᴏft",
        "score": 988,
        "text_content": "",
        "comments": [
            {
                "raw_content": "When they say this, it isn't hyperbole. They mean it",
                "author": "Formerlurker92"
            },
            {
                "raw_content": "Sounds very fascist of him.",
                "author": "BurtMcGirt"
            },
            {
                "raw_content": "James Carville the Uneducated Arkansas Gremlin.",
                "author": "WanderingStar"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "James Woods ~ \"𝑵𝒐𝒕𝒉𝒊𝒏𝒈 𝑴𝒐𝒓𝒆 𝑵𝒆𝒆𝒅 𝑩𝒆 𝑺𝒂𝒊𝒅. 𝑻𝒉𝒆 𝑺𝒕𝒐𝒓𝒎 𝑰𝒔 𝑪𝒐𝒎𝒊𝒏𝒈.\"",
        "score": 1499,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The storm arrived last January 20th and Pam Bondi is in the way.",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "There is no storm James. It was supposed to have arrived in 2018 but blew over and fizzled out. Trump isn’t serious about justice. Look at his AG. Maybe if miller could somehow become president we might see some shit but until that point it’s mostly cloudy with a chance of a sternly worded letter.",
                "author": "Thomm"
            },
            {
                "raw_content": "We may only have like 1/3rd of Jews supporting MAGA, but they are the only 1/3rd worth having. Id know. Im one. Like Stephen. HE SPEAKS FOR ME TOO. Get them Stephen. Not for revenge. Its a Reckoning and Justice.",
                "author": "Mhmm2MoreWeeks"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The White House actually posted this about the renovations. 😂 Genius",
        "score": 494,
        "text_content": "",
        "comments": [
            {
                "raw_content": "HAHAHAHAHA HOLY SHIT ITS ACTUALLY ALL THERE!🤣🤣🤣",
                "author": "DingleBalls"
            },
            {
                "raw_content": "The WH now has a wicked sense of humor.",
                "author": "BidenShowerDrool"
            },
            {
                "raw_content": "Moslem Brotherhood visit!!!",
                "author": "SummTingWong"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "OK, the Xe3 GPU in Intel's Panther Lake chip officially isn't Celestial, it's really just Xe2 'Plus Plus,' but even Intel itself doesn't yet understand how it all relates to its shock new deal with Nvidia",
        "score": 20,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">even Intel itself doesn't yet understand how it all relates to its shock new deal with Nvidia. Tbh the deal was just agreed. We can expect roadmap changes from next year. But yeah knowing Intel, that change isn't likely.",
                "author": "IBM296"
            },
            {
                "raw_content": "The Celestial name was only ever used for a next-gen dGPU, of an unspecified Xe architecture. Even in the interview pcgamer links *claiming* to be about Celestial, that name is never once uttered. They seem to be blurring the line here a bit, but that's not how their official material uses the terms, at minimum. That aside, calling Xe3 a derivative of Xe2, but Xe3p somehow not (despite being a far more minor change than Xe3) is just lunacy. There's still no sense to this naming.",
                "author": "Exist50"
            },
            {
                "raw_content": "Chaos at Intel, in other news that isn't news, space is big and stars are hot.",
                "author": "SignalButterscotch73"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Arstechnica: AWS outage reminds us why $2,449 Internet-dependent beds are a bad idea",
        "score": 592,
        "text_content": "",
        "comments": [
            {
                "raw_content": "At some point I was very interested in eight sleep because my bedroom is so hot compared to the rest of my house. Then I saw it had a fucking SUBSCRIPTION for a fucking BED FAN and closed the tab. The desire to make everything a subscription is a sickness",
                "author": "leeharris100"
            },
            {
                "raw_content": "These were the same beds with the hard coded AWS credentials stored in plaintext from back in February, in addition to previously paywalling existing features. [https://trufflesecurity.com/blog/removing-jeff-bezos-from-my-bed](https://trufflesecurity.com/blog/removing-jeff-bezos-from-my-bed) Offline mode for anyone still running them who now wants to factory reset and firewall their... mattress: [https://github.com/throwaway31265/free-sleep](https://github.com/throwaway31265/free-sleep)",
                "author": "AK-Brian"
            },
            {
                "raw_content": "> As of this writing, the Pods’ MSRPs range from $2,449 to $3,249, and the base has a $1,950 MSRP. Eight Sleep also sells its Autopilot feature through an annual subscription that starts at $199. Autopilot is supposed to help automatically set Eight Sleep devices to users’ optimal sleeping conditions. Pod purchases require a one-year subscription to Autopilot. At that point of the article, I just lost all my ability to can.",
                "author": "77ilham77"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[News] Samsung, SK hynix Reportedly Lift Memory Prices Up to 30%; Long-Term Supply Deals in Play",
        "score": 24,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lift prices up? Lift prices up?!?",
                "author": "liebesapfel"
            },
            {
                "raw_content": "No wonder DDR5 prices went ballistic about a month ago",
                "author": "HundredBillionStars"
            },
            {
                "raw_content": ">This is reportedly driven by several overlapping factors: new investments in AI servers worth ***hundreds of trillions of won***, ongoing memory upgrades for general-purpose servers, and rising demand for on-device AI. Yes, because the world totally needs a gazillion LLMs.",
                "author": "GenZia"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel (NASDAQ:INTC) Q3: Beats On Revenue, Stock Soars",
        "score": 47,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I dont think Intel is executing greatly in many ways right now, but I'm still gonna cheer any financial success they have now, cuz we desperately need them to stay in the fight. I also really hope they can make their foundry business attractive, even if just at a Samsung level. We need more foundry competition so badly. I'm not sure I'd be interested in buying an Intel product anytime soon, though. I just think they're all over the place and making a mess of the chiplet strategy and focusing far too much on packaging instead of architecture.",
                "author": "Seanspeed"
            },
            {
                "raw_content": "More positive news on Intel turnaround as financial results greatly exceed expectations*. *Bear in mind expectations were super low so exceeding them still doesn't mean Intel is a thriving business again.",
                "author": "Visible-Advice-5109"
            },
            {
                "raw_content": "I'm very surprised Intel went up so much after the market closed on these results. Yes, this quarter looks pretty good, and DCAI margins improving significantly is a great sign. But wasn't Q4 outlook not good? Server revenue not increasing much doesn't bode too well for how much unit/revenue share AMD might take, admitting 18A on PTL isn't going to help their margins much till the end of next year, no update on their AI roadmap (despite claiming they would), brushing off DMR launch dates after *already previously having claimed it's a 26' part,* and no signs that they would get an ~~eternal~~ edit: external haha foundry customer soon? Maybe the market really thought *that* little of Intel before, but still...",
                "author": "Geddagod"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "China releases 'UBIOS' standard to replace UEFI — Huawei-backed BIOS firmware replacement charges China's domestic computing goals",
        "score": 282,
        "text_content": "Support for chiplets, heterogeneous computing, and a step away from U.S.-based standards are key features of China's BIOS replacement.",
        "comments": [
            {
                "raw_content": ">UBIOS's unique features over UEFI include increased support for chiplets and other heterogeneous computing use-cases, such as multi-CPU motherboards with mismatching CPUs, something UEFI struggles with or does not support. It will also better support non-x86 CPU architectures such as ARM, RISC-V, and LoongArch, the first major Chinese operating system. Personally I don't expect to see much changes to the x86/x64 world as that is tied to the very few vendors that makes the CPU and chipset. Having a standardized BIOS backed by the country that make a lot of the non-x86/x64 architectures SBC would help a lot. Unlike a PC, the onboard peripherals are all over the place as they were initially designed for embedded. Hence there is a need for Device Tree for describing the hardware configuration and to decouple the board from the drivers. There is also a mess of different ways of booting up a non-x86 SBC (Single Board Computer) as they don't all use the same standard BIOS. These problems makes installing Linux difficult.",
                "author": "Wait_for_BM"
            },
            {
                "raw_content": "\"Begun, the balkanization of tech has\"",
                "author": "cambeiu"
            },
            {
                "raw_content": "UEFI is pretty terrible to write support for. It was originally created by Intel, HP, and Microsoft for Itanium x64 and ported to AMD64 and ARM64. Lots of legacy decisions and limitations. Plus it's coding standard is some weird Windows format. It's only won out because it is better than a traditional BIOS and pushed by Microsoft and Intel. Not surprised China is creating a replacement. It's just sad they're not going for Open firmware.",
                "author": "nukem996"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Tenstorreent's TT-Ascalon RiscV CPU",
        "score": 24,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Did they update the page or add anything new? Seems the same from the last time I checked it a couple months ago tbh.",
                "author": "Geddagod"
            },
            {
                "raw_content": "According to [discussion on the presentation in RISC-V subreddit](https://www.reddit.com/r/RISCV/comments/1oeey5v/tenstorrent_atlantis_silicon_dev_platform/), development boards were announced TBA Q2 2026. Finally, high performance RISC-V CPUs.",
                "author": "3G6A5W338E"
            },
            {
                "raw_content": "This looks cool, and considering the people involved, it has a lot of potential. But sadly, this is just a design. It needs a customer to build it and ultimately the silicon will be constrained to the realities of that customer. I'm so looking forward to high performance SOCs rivaling arm and hopefully making a dent in hobbyist spaces so that hopefully, we may break into higher performance segments in the very stagnant consumer space.",
                "author": "the_dude_that_faps"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel Nova Lake might come without AVX10 (AVX512) aupport",
        "score": 168,
        "text_content": "https://www.techpowerup.com/342147/intel-nova-lake-could-arrive-without-avx10-apx-and-amx-support Meanwhile I was secretly hoping Intel would bring AVX512(VNNI) back to socket 1700 with bartlett lake (all P-core). My 12700k had it for a short while if you disabled the E-cores.... But noooo, Intel even needs to lobotomise their next gen consumer product. AMD will solve their memory controller latency issues with the fan-out interconnect for Zen6, and then Intel can go bankrupt for all I care (which they probably will)",
        "comments": [
            {
                "raw_content": "It's likely because of the small core again. Diamond rapids should have the same P core and that has all the new stuff. For nova lake the only new thing seems to be prefetchi. I don't so much care about wider AVX now but I would have liked to see APX. Not that there would have been many applications that support it but experimenting would have been fun.",
                "author": "jaaval"
            },
            {
                "raw_content": "Very sad. This means this chip is not futureproof with an outdated instruction set. Even AMD supports AVX 512, and there might be a time where you need AVX 512 or games and applications won't run just many require AVX2 now. For me this is a dealbreaker. I would only look at AMD CPUs now. Shame, because Nova Lake was shaping up to be really amazing.",
                "author": "dampflokfreund"
            },
            {
                "raw_content": "Avx512 is no joke. It’s difficult to implement and it takes a lot of die space. They should have just incrementally implemented it like AMD did ..",
                "author": "Keljian52"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "RTX Neural Texture Compression Tested in a Scene That Is More Representative of a Real Workload",
        "score": 25,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"Uncompressed\" vs \"Neural compression\" is not a very useful comparison. No game is going to use fully uncompressed textures for everything- that's just a waste of VRAM. A better comparison would be nerual compression vs. a hardware-supported block-compressed format like BC7.",
                "author": "hanotak"
            },
            {
                "raw_content": "What's the point if the texture looks horrible when ntc is used?",
                "author": "IgnorantGenius"
            },
            {
                "raw_content": "TL;DW: ***NTC 101:*** * Uncompressed (top) vs NTC decode to BCn (middle)/on load vs NTC inference/on sample (most compressed) * MLP based texture compression * NTC decode/on load benefits disk space and IO throughput * NTC inference/on sample \\^ and massive VRAM texture MB reduction ***Perf stats*** * Overhead larger on 4060 laptop vs 5090: * Perf 4K TAA - 5090: 1.14 ms vs 1.27 ms vs 1.76 ms * Perf 4K DLSS - 5090: 1.74 ms vs 1.77 ms vs 2.57 ms * Perf 1080p TAA - 4060 laptop: 2.48 ms vs 2.55 ms vs 3.55 ms * Perf 1080p TAA - 4060 laptop: 3.56 ms vs 3.62 ms vs 4.61 ms * 5090 it seems like DLSS + NTC competes for ressources worsening overhead (+0.49 ms -> +0.80 ms for 5090) * \\^not the case for 4060. NTC on sample ms overhead doubled vs 5090 despite lower res. ***Image quality*** * NTC destroys fine detail on the hanging fabrics patterns + overall. Rest seems unaffected ***Caveats*** * Seems like NTC on sample/inference decompresses all textures at full version (likely no mipmaps) * Inference on Feedback mode (SF) not used to cut work for inference on sample pipeline. * Uses the old Crytek Sponza sample from 2010. * \\^Not representative of modern games which can easily require 5 to +10GB of BCn texture allocation at 4K. GBs used for each frame likely well above the 2GB Sponza uses. Seems like the only way to really address this is Inference on Feedback mode. * Early days of tech, still in beta so not how shipped implementations will be: [https://github.com/NVIDIA-RTX/RTXNTC](https://github.com/NVIDIA-RTX/RTXNTC) * Significant new performance optimizations from v0.8.0 not leveraged it seems: [https://github.com/NVIDIA-RTX/RTXNTC/releases/tag/v0.8.0-beta](https://github.com/NVIDIA-RTX/RTXNTC/releases/tag/v0.8.0-beta)",
                "author": "MrMPFR"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Exclusive: US mulls curbs on exports to China made with US software,",
        "score": 43,
        "text_content": "* Trump administration considers potential escalation in China trade war * Measure could restrict shipments to China of goods containing or made with U.S. software",
        "comments": [
            {
                "raw_content": "How are they planning on enforcing this? which is basically everything?",
                "author": "LinusDuckTips"
            },
            {
                "raw_content": "That is almost... everything? This would force China to build their own software ecosystem and dump US software providers forever. Even if this doesn't happen, China would still want to take that US card off the board now that it has been revealed.",
                "author": "lovely_sombrero"
            },
            {
                "raw_content": "How does this work as the majority of devices made with US software...are made in China?",
                "author": "Agloe_Dreams"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Fallout 4 Is Releasing on Switch 2 In 2026",
        "score": 1152,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is the first Fallout on Nintendo, right?",
                "author": "RudeViking"
            },
            {
                "raw_content": "Were we supposed to have a partners direct or something? Because that’s a lot of announcements all of a sudden in a few hours now that Pokemon ZA came out.",
                "author": "Medd-"
            },
            {
                "raw_content": "This isn't even on the official Nintendo youtube. What the heck.",
                "author": "ChiTownDog"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Now that Assassin's Creed Shadows has been officially announced for Switch 2, what's the next big game you want to see?",
        "score": 242,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Red Dead Redemption 2. We know it exists. Where is it?",
                "author": "TerminatorJ"
            },
            {
                "raw_content": "Fallout 4 👀",
                "author": "WeightAround"
            },
            {
                "raw_content": "Baldur's gate 3 Genuinely curious how they'd make it work considering it was a nightmare on series S and caused some troubles with Xbox",
                "author": "soyuz_enjoyer2"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Elden Ring for Switch2 has been postponed to 2026",
        "score": 981,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good decision. Take as long as needed to get it running well. No need to rush this.",
                "author": "ConsciousClue3883"
            },
            {
                "raw_content": "We hadn't heard about a date this late in the year so a delay felt inevitable. I'd rather a delay than a rushed port like P3R.",
                "author": "StarPlatinum55"
            },
            {
                "raw_content": "I love FromSoft but I hope this finally gets them on a path of thinking about performance throughout their development phases instead of after releasing a game.",
                "author": "dbr3000"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Resident Evil 9: Requiem price has been revealed on the eShop.",
        "score": 66,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Seems about right.",
                "author": "j_b_1983"
            },
            {
                "raw_content": "Somebody screwed up lol. Preorders don't go up until the 29th.",
                "author": "lattjeful"
            },
            {
                "raw_content": "Seems about right. Yeah I'm hoping the RE 7 & RE 8 Gold Editions are $50 I'd take $60 tbh (maybe $50 for VII since it's older but I doubt they'd do different prices for each on the same release day to avoid confusion lol) I remember renting a copy of VII to play on my base Xbox One back in the day. Crazy to think I'll be able to play that, and its 2 follow-ups in the palm of my hands, portably. And that it'll probably look even better than it did on my old TV lol. Side note as well, just thinking out loud, it would be legendary and so wickedly cool if they dropped 2, 3, and 4 Remake on the same day at the end of 2026, right before the holidays and right on time for Halloween. 6 fancy big RE games on Switch 2 in a single year would be a dream come true. I'd have the whole collection up on my shelf in the span of the year. That'd be fantastic.",
                "author": "PikachuIsReallyCute"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Pokemon, but directed by Masahiro Sakurai",
        "score": 63,
        "text_content": "what would that look like?",
        "comments": [
            {
                "raw_content": "I dunno, but we definitely can’t get new Pokemon every 3-4 years. Sakurai is the Quality over quantity type, after all, you won’t see Super Smash Bros. pumping out like call of duty does.",
                "author": "Brilliant-Copy4258"
            },
            {
                "raw_content": "So much better More time, more money, more peak",
                "author": "BoughtSquash665"
            },
            {
                "raw_content": "Please!!!!",
                "author": "Archer_7"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "AC Shadows confirmed 🥷",
        "score": 380,
        "text_content": "with cross progression 🙌 Ubisoft is cooking with there ports. Enjoying Outlaws so much and cross progression is awesome",
        "comments": [
            {
                "raw_content": "Only in Nintendo circles will one find \"Ubisoft is cooking\" 😭",
                "author": "SpiritualRabbit2050"
            },
            {
                "raw_content": "Cross progression is the key factor here. I wouldn't consider the purchase without it. I'm already so far into it on PS5, id hate to have to start over. But being able to take my save portable is amazing.",
                "author": "BelBivDaHoe"
            },
            {
                "raw_content": "VINDICATION MFS WHOO HOOO 🔥🔥🔥 https://preview.redd.it/dp6mm225lxwf1.jpeg?width=904&format=pjpg&auto=webp&s=75e89639884f36006803e619d50073b75ef11636",
                "author": "OVO_ZORRO"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Anyone hyped for Kirby air Riders?",
        "score": 571,
        "text_content": "I was skeptical at first but man, Skaurai can just make me hyped for something I though I would never play (I mean, he is dropping quote after quote: \"This is a Kirby shaped sensor\", \"You'll be a gummyllionaire\" etc. etc.). Definitely going to get this game if critics say it's good. Anyone else?",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/doak6fcahvwf1.jpeg?width=2532&format=pjpg&auto=webp&s=db3b7de89b3c7fe8be087528e9f12664c7be42b8 How can I not be hyped?!",
                "author": "Eevee-Fan"
            },
            {
                "raw_content": "1st Direct: \"I dunno, Sakurai... I don't think this is worth $70...\" 2nd Direct: https://preview.redd.it/gfjwya5divwf1.png?width=500&format=png&auto=webp&s=83d4c3233d9077c5f04439061c056b4522a60769",
                "author": "Ordinal43NotFound"
            },
            {
                "raw_content": "After Direct 2 I'm convinced that this game was made specifically for me",
                "author": "calmlightdrifter"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "THANK FREAKIN' GOD!! If there's one thing I hated about first party some of the Nintendo games during the Switch 1, it was THIS BS they've been doing for those with online multiplayer!",
        "score": 100,
        "text_content": "",
        "comments": [
            {
                "raw_content": "i wasn't aware any of their games did this.",
                "author": "atlasdtalos"
            },
            {
                "raw_content": "Sorry but which games does that? Legit question.",
                "author": "linkling1039"
            },
            {
                "raw_content": "I don't recall any Nintendo games that require you to play online to unlock base game contents; just about everything can be unlocked offline.",
                "author": "MnSG"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "🎮💥 Discussion, News, and Request Thread - Week Beginning 10/26/25 💥🎮",
        "score": 24,
        "text_content": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSR6Fns9zL2WCx-pXyGcR7aX0ehSJd78zXSKw&s # GLAR Discussion This thread is your weekly **central hub** for: - 📰 Gaming news - 📝 Requests - 💬 Random rumors, spicy drama, or just vibes *Keep all non-post-worthy content here so we can keep the front page clean and focused on actual leaks. We love ya, but help us help you.* --- ### P.S. There’s some drama poppin’ off over at r/OkBuddyGLAR 😉 ### 💌 Want to help improve this sub? Drop us some feedback 👉 [Right here!](https://forms.gle/w9JaYTjVN1Zie9e39) ### 💬 Join the **Discord** and vibe with the community even more — we’ve got memes, theories, and occasional existential dread 👉 [*Click here to join!*](https://discord.gg/6jdBvCSqbj) --- ## 🔥 Hot threads of the past MONTH!: - [Nintendo is lobbying with the Japanese government to push against AI.](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1nxy23o/nintendo_is_lobbying_with_the_japanese_government/) - [Microsoft revamps Xbox Game Pass plans and hikes Ultimate to $29.99 a month, Removing PC Game Pass, Ultimate gets Ubisoft+ Classics ](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1nv966p/microsoft_revamps_xbox_game_pass_plans_and_hikes/) - [Gamefreak's plans up to 2030 just leaked](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1o5qz6r/gamefreaks_plans_up_to_2030_just_leaked/)",
        "comments": [
            {
                "raw_content": "KOTOR",
                "author": "UnlimitedMeatwad"
            },
            {
                "raw_content": "Kirby looks damn great. It's uncalled for, but i wonder if Nintendo will do any more events for the rest of the year, or we now wait for the January direct.",
                "author": "ArcWardenScrub"
            },
            {
                "raw_content": "Yo, I'm back. Sorry, we're lackin here; us mods have all been a bit busy as of late. But don't sweat it. We're still very active and reading every post and every report. Also last time I posted y'all roasted me for my post 😂. I toned it down this time",
                "author": "0ctobogs"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Jeff Grubb and NateTheHate seemingly confirming that tomorrow's Halo reveal will be a Halo Combat Evolved remake",
        "score": 559,
        "text_content": "Jeff Grub hinting at tomorrow's reveal being a Halo Combat Evolved remake https://xcancel.com/JeffGrubb/status/1981475431871041771 and NateTheHate confirming this https://xcancel.com/NateTheHate2/status/1981478219011268756 Not only they hint at it being a Halo: Combat Evolved remake but also it being campaign only IMO.",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Hoping for new campaign content",
                "author": "Ok_Organization1507"
            },
            {
                "raw_content": "It being campaign only is fine,I guess? Dont know how a campaign only remake would rejuvenate the franchise though",
                "author": "Emergionx"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "NateTheHate has heard about Baldur's Gate III for Switch 2 (but not ready to confirm)",
        "score": 135,
        "text_content": "https://xcancel.com/NateTheHate2/status/1980357667035181154#m *No update on RDR2. Have heard something on BG3 for SW2 but need more verification on it before I can share.*",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "I heard something; but I give no indication what that something is. This doesn't need to be treated as a rumor nor a leak, honestly.",
                "author": "NatetheHate2"
            },
            {
                "raw_content": "I'm still a little annoyed that they never released a physical version other than the deluxe PS5 version that costs $100 (with shipping). I imagine that the physical version of switch 2 it will a game key card. Also I wonder if you can use the PC version's UI knowing that you can use mouse mode?",
                "author": "Midnight_M_"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Simpsons Fortnite skins have leaked - Bart, Marge, Homer, Krusty, Moe and Simpsons style Peely and Fishstick",
        "score": 202,
        "text_content": "[Also Lisa, Flanders and Scratchy. The Battle Bus is a Duff blimp and the Simpsons car is a skin](https://xcancel.com/ShiinaBR/status/1981479839564537972?t=9th4XWB1V0_TXj1El2PI_g&s=19)",
        "comments": [
            {
                "raw_content": "But what about Radioactive Man? I want to Up and At Them",
                "author": "Hayterfan"
            },
            {
                "raw_content": "Was hoping for groundskeeper Willie",
                "author": "VoidedGreen047"
            },
            {
                "raw_content": "Why is it always peely or fish stick...",
                "author": "Xeallexx"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Jason Schreier: \"Later this week, Microsoft will announce a new Halo release in an attempt to resuscitate the franchise.\"",
        "score": 1217,
        "text_content": "\"Xbox’s best hope for a blockbuster game in recent years was 2021’s *Halo Infinite*, the latest entry in its most vital franchise. Despite some early accolades the game was ultimately seen as a failure and led to a complete overhaul of the studio behind it. Later this week, Microsoft will announce a new *Halo* release in an attempt to resuscitate the franchise.\" Source: [Microsoft Pushes Xbox Studios to Hit Higher Profit Margins - Bloomberg](https://www.bloomberg.com/news/articles/2025-10-23/microsoft-pushes-xbox-studios-to-hit-higher-profit-margins?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc2MTIxNzIzNiwiZXhwIjoxNzYxODIyMDM2LCJhcnRpY2xlSWQiOiJUNEtaV0FHUTdMMTAwMCIsImJjb25uZWN0SWQiOiJCMUVBQkI5NjQ2QUM0REZFQTJBRkI4MjI1MzgyQTJFQSJ9.bf1wS0et59C0q96ZZnfBqLTX_eTIqjZTmQbk_j6Pwok&leadSource=uverify%20wall) I saw a post earlier covering this article, but no one seems to be mentioning this part.",
        "comments": [
            {
                "raw_content": "#Jason Schreier is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Soo tomorrow?",
                "author": "UnlimitedMeatwad"
            },
            {
                "raw_content": "it’s been confirmed for a while that they will reveal it at the Halo world championship which is tomorrow. They even have it in their [event schedule](https://www.halowaypoint.com/news/halowc2025 ). 1PM PT “Halo Studios Project Update”",
                "author": "MrFOrzum"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Jason Schreier: For the last two years, Microsoft has pushed Xbox to hit profit margins of 30%, an ambitious target that's far higher than the industry average.",
        "score": 1406,
        "text_content": "\"Microsoft Corp. is asking its Xbox gaming division to produce profit margins that are well above the industry average, ratcheting up pressure on its video-game makers during a difficult time for the field at large. Over the past two years, executives at the Seattle-based software giant have set an across-the-board goal of 30% \"accountability margins,\" a term Microsoft uses in lieu of profit margins, according to people familiar with the business. The gaming division, which includes dozens of studios, has responded by canceling products, raising prices and slashing thousands of jobs, said the people, who asked not to be identified discussing nonpublic information.\" \"The new goal, which hasn't been previously reported, is at the outer range of what a gaming studio can typically reach in a boom year, said Neil Barbour, an analyst with S&P Global. \"A 30% or better margin is usually reserved for a publisher that is really nailing it,\" Barbour said. In the past, game makers at Xbox weren't asked to hit specific numerical targets, said the people, and were largely told to focus on making the best games possible without worrying too much about finances. The new target was implemented in fall 2023 by Microsoft Chief Financial Officer Amy Hood, whose team has taken a larger role in the gaming business in recent years.\" \"The change has impacted strategies under Microsoft gaming chief Phil Spencer as the division has looked for new ways to cut costs and boost profits. In 2024, Xbox announced that it would begin releasing the majority of its games on consoles from rivals Nintendo Co. and Sony Group Corp. for the first time. Earlier this year, Xbox decided to cancel a number of costly projects, including Everwild, Perfect Dark and Project Blackbird, all of which had been in development for more than seven years. Not every project is expected to hit the 30% profit threshold, said the people, but many Xbox developers and groups have been presented with the new target. Moving forward, games that are either cheap to make or deemed more likely to generate significant revenue windfalls may take priority over riskier bets, said the people, while Xbox's floundering hardware division may face a significant rethinking. In a recent interview with Mashable, Xbox President Sarah Bond said the company's next console will be \"a very premium, very high-end curated experience,\" suggesting a departure from previous Xbox iterations.\" Read more at the source for information: https://www.bloomberg.com/news/articles/2025-10-23/microsoft-pushes-xbox-studios-to-hit-higher-profit-margins?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc2MTIxNzIzNiwiZXhwIjoxNzYxODIyMDM2LCJhcnRpY2xlSWQiOiJUNEtaV0FHUTdMMTAwMCIsImJjb25uZWN0SWQiOiJCMUVBQkI5NjQ2QUM0REZFQTJBRkI4MjI1MzgyQTJFQSJ9.bf1wS0et59C0q96ZZnfBqLTX_eTIqjZTmQbk_j6Pwok&leadSource=uverify%20wall",
        "comments": [
            {
                "raw_content": "#Jason Schreier is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "This is a fascinating case study about how not to run a company division.",
                "author": "Heiminator"
            },
            {
                "raw_content": "Microsoft is genuinely trying to kill Xbox as a brand. Wild times to live in.",
                "author": "Im_So_Sinsational"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Nexus Mods was prototyping an episodic TPP RPG surrounding Alexander the Great",
        "score": 81,
        "text_content": "Hello, I recently came into some information that folks might find interesting. This happened about \\~5 years ago (pre-COVID) and I believe did not make it far into production. But yes, as the title says, Nexus Mods was hiring for and prototyping ideas for an RPG in which you played as an associate of Alexander the Great (one of his generals and childhood friends - not sure if it was Hephaestion or a custom player-created character). The intention was to release it episodically over a period (year or two) for a 20ish hour game. I don't know what ended up happening to it, but I can confirm with 100% certainty that it was a real thing they were prototyping for and had hired at least two positions specifically for. F2P and modding were said to be focuses early on. EDIT: Actually... I don't know if this counts as a leak. [https://x.com/ElegosGame](https://x.com/ElegosGame) is almost certainly what it ended up becoming and they are pretty public there.",
        "comments": [
            {
                "raw_content": "This is the most random rumor/leak that I heard... And I wish it was true...",
                "author": "Educational-Arm-7384"
            },
            {
                "raw_content": "Nexus Mod as *the* Nexus Mod where everyone and their grandmas go to download Elder Scrolls and Fallout mods?",
                "author": "giulianosse"
            },
            {
                "raw_content": "You got any source or record at all for this to be labeled a leak?",
                "author": "AkelaHardware"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Luke Roberts and Salóme Gunnarsdottir (James and Maria in Silent Hill 2 Remake) hint that they'll work together in something for Bloober Team soon. Dusk Golem theorizes the Born from a Wish DLC might have evolved and changed shape/name, and says he'll be able to check in November.",
        "score": 200,
        "text_content": "Luke's comment: [https://xcancel.com/morimedemo/status/1981366420953764108](https://xcancel.com/morimedemo/status/1981366420953764108) >(Bloober Team) are amazing, I'd work with them all day every day. I think it's on the horizon though, I think we'll work again soon. I think you'll find us soon. I don't wanna say too much but I think you will Dusk's comment: [https://xcancel.com/AestheticGamer1/status/1981413529258512786](https://xcancel.com/AestheticGamer1/status/1981413529258512786) >There is something I'm lightly considering. I know for a fact Born From A Wish was worked on last year, but I wonder if the Silent Hill 2 Remake DLC changed shape/name due to how different it was becoming to be given its own identity. Just speculation on my side, won't have a chance until November to dig into it >",
        "comments": [
            {
                "raw_content": "#DuskGolem is a Tier 3 - 50/50 as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "More Silent Hill 2 will make me happy",
                "author": "Crimsonclaw111"
            },
            {
                "raw_content": "They are probably adding to it significantly so they can charge money for the DLC and have it be fair OG born from a wish is like 30 minutes long",
                "author": "invisbleHand-"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Report: EA's internal AI is causing issues with games development",
        "score": 756,
        "text_content": ">TL;DR: Electronic Arts is aggressively integrating AI, including its generative chatbot ReefGPT, to automate game development and reduce costs. However, experimental AI tools cause coding errors and \"hallucinations,\" increasing workload and employee anxiety amid industry layoffs. AI's full impact on gaming remains uncertain despite ongoing investments. >New reports from Business Insider say that EA is also using AI behind the scenes in the hopes of shaving off costs and automating specific workloads. But the tech is still experimental, and the limits in what it can and can't do haven't properly been tested. New reports suggest that this testing is happening in real-time on active business hours, and is costing the company extra time and money as workers have to solve the problems that AI creates for them. [https://www.tweaktown.com/news/108403/report-eas-internal-ai-is-causing-issues-with-games-development/index.html](https://www.tweaktown.com/news/108403/report-eas-internal-ai-is-causing-issues-with-games-development/index.html)",
        "comments": [
            {
                "raw_content": "You just know that EA's solution will be to invest in more AI to help the current AI.",
                "author": "MuptonBossman"
            },
            {
                "raw_content": "As a Dead Space fan I'm glad EA has finally decided to offer their developers and playerbase the real life Marker hallucination experience.",
                "author": "abca98"
            },
            {
                "raw_content": "In a surprise to absolutely nobody",
                "author": "WondernutsWizard"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Reports Third-Quarter 2025 Financial Results",
        "score": 47,
        "text_content": "",
        "comments": [
            {
                "raw_content": "For NANA!",
                "author": "llluminus"
            },
            {
                "raw_content": "Did it hit 40? Help a foo out",
                "author": "quantum3ntanglement"
            },
            {
                "raw_content": "We are back",
                "author": "SlamedCards"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Trump's Investment in Intel Is Paying Off",
        "score": 0,
        "text_content": "",
        "comments": [],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD Radeon AI PRO R9700 officially launches October 27 for $1,299 retail",
        "score": 67,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Let's see how many cards are actually in stock. Because the Intel B60 was a super attractive price and you couldn't buy it for less than double.",
                "author": "420osrs"
            },
            {
                "raw_content": "32gb vram noice. Too bad it's a blower design though.",
                "author": "Celcius_87"
            },
            {
                "raw_content": "[deleted]",
                "author": "None"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD \"Strix Point\" spotted in new AGESA update, hinting at stronger Ryzen 9000G lineup after all",
        "score": 37,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "I guess it means we will finally have an APU that can compete with the ancient GTX1070. Yippee...",
                "author": "GenZia"
            },
            {
                "raw_content": "Just hope AMD doesn't axe the PCIe lanes like they did on the 8000G series.",
                "author": "Gkirmathal"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AYANEO teases new AM03 Mini PC with a refreshed retro-inspired design and 'flagship performance'",
        "score": 6,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "The U.S. housing market is in spooky season: 15% of home sellers are getting ghosted by buyers | Fortune",
        "score": 186,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Just backed out during negotiations because the seller relisted the house for lower than our written offer but were playing games with trying to start a bidding war for a house that has been listed over 6 months.",
                "author": "rectifryer"
            },
            {
                "raw_content": "So? It’s typically about 14%…",
                "author": "fuckofakaboom"
            },
            {
                "raw_content": "the buyers should just go away and stop bidding",
                "author": "Helisent"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Most potential homebuyers expect mortgage rates to drop. That's why they're waiting",
        "score": 74,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not one of the people polled would prefer a 400k loan at 5% to a 300k loan at 6%. Because theyre waiting for prices to come back to reality, not waiting for bankers to charge them slightly less interest. Getting a .5% rate drop is unimportant if youre buying a product at a 20-40% markup. You're still ovepaying even if its a \"more affordable\" form of scam.",
                "author": "Hot_Ambition_6457"
            },
            {
                "raw_content": "No they’re waiting for *prices to drop*",
                "author": "VendettaKarma"
            },
            {
                "raw_content": "And when the rates drop everybody will be out of a job.",
                "author": "ExtremeComplex"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage Rates Drop Near 3-Year Low, Opening Door For Homebuyers–But Few Are Walking Through",
        "score": 21,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Rates are still trending above the 5.5% I got last October. Target for me a 15 year at 4% to refi again",
                "author": "HerefortheTuna"
            },
            {
                "raw_content": "A .2% decrease on a mortgage doesn't negate 50-100% appreciation in prices over the last five years. Im not funding youre retirement. No i don't care that red fin and zillow say it's worth that.",
                "author": "shyvananana"
            },
            {
                "raw_content": "Most of the homes in my area increased in price by 100% in the last 5-6 years. Interest rates coming down won’t push first time home buyers into the market. That dream is dead for most people.",
                "author": "World_2"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "US existing home sales rise to seven-month high in September",
        "score": 11,
        "text_content": "https://www.reuters.com/business/us-existing-home-sales-rise-seven-month-high-september-2025-10-23/",
        "comments": [
            {
                "raw_content": "Waiting for someone to tell me this doesn't matter because condos in Florida are still sitting on the market longer than 60 days.",
                "author": "sharktoothscavenger"
            },
            {
                "raw_content": "7 month high! Thought there would be more excitement. … do you not see how this is great news?! This means the bubble is over, sales picking up, now is finally time for you all to buy! Your patience in waiting out the bubble has seemingly paid off … lol",
                "author": "zorg-18082"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Lower mortgage rates push home sales up in September, but prices still stubbornly high",
        "score": 10,
        "text_content": "",
        "comments": [
            {
                "raw_content": "KEY POINTS * The average rate on the 30-year fixed started July at 6.67% and is now at 6.17% * Inventory rose 14% from September 2024. * The median price of a home sold in September was $415,200, up 2.1% year over year. Sales of previously owned homes rose 1.5% in September from August to a seasonally adjusted, annualized rate of 4.06 million units, according to the National Association of Realtors. That is slightly less than the analysts were forecasting, but the highest pace in seven months. Sales were 4.1% higher compared with September of last year. Regionally, on an annual basis, sales were strongest in the South and Northeast. From August, sales were strongest in the West and actually fell slightly in the Midwest, the only region to see a monthly decline. This count is based on closings, so people signing contracts likely in July and August, when mortgage rates were coming down but were not as low as they are now. The average rate on the 30-year fixed started July at 6.67% and is now at 6.17%, according to Mortgage News Daily. “As anticipated, falling mortgage rates are lifting home sales,” said Lawrence Yun, NAR’s chief economist. “Improving housing affordability is also contributing to the increase in sales.” Inventory continued to make gains, up 14% from a year ago to 1.55 million units for sale at the end of September. That is still lean historically. At the current sales pace, there is a 4.6-month supply of homes for sale. A six-month supply is considered balanced between buyer and seller. “Inventory is matching a five-year high, though it remains below pre-Covid levels,” Yun added. “Many homeowners are financially comfortable, resulting in very few distressed properties and forced sales. Home prices continue to rise in most parts of the country, further contributing to overall household wealth.” Still tight supply continues to pressure prices. The median price of a home sold in September was $415,200, up 2.1% year over year and the 27th consecutive month of annual gains. Prices are 53% higher than pre-Covid levels. Sales continue to see the biggest gains on the high end of the market, likely because of more supply in those tiers. Sales of home priced above $1 million rose 20% from the year before, while sales of homes priced below $100,000 were up just under 3%. First-time homebuyers are making some gains, likely due to falling mortgage rates. They made up 30% of September sales, up from 26% the year before. About 30% of sales were made all in cash. Homes are sitting on the market longer, an average 33 days, up from 28 a year ago.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "Another front-page propaganda headline by the mainstream media pushing the narrative that lower mortgage rates increase home sales. Anyone who’s even moderately financially literate knows mortgage rates are not the problem. It’s the overpriced homes that need to go down in price. The carrying costs are too high, and there’s too much uncertainty nowadays to confidently buy a home. Nobody wants to become a bagholder.",
                "author": "McFatty7"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The Court Finally Approved the $39M Settlement Between Opendoor ($OPEN) and Its Investors over Misleading Statements About Its Pricing Algorithm and Profit Margins",
        "score": 17,
        "text_content": "Hey guys, if you missed it, the court finally approved the **$39 million** settlement between **Opendoor ($OPEN)** and its investors over claims that the company **misled them about its pricing algorithm, profit margins, and ability to operate profitably during a market downturn**. Here’s a quick recap. In **2022**, Opendoor was accused of **overstating the accuracy of its iBuying technology** and **concealing that much of its pricing was still done manually**. The company also allegedly failed to warn that its profit margins were heavily dependent on favorable housing conditions. After this news came out and reports revealed financial losses and regulatory issues, **$OPEN dropped nearly 90%**, and investors filed a lawsuit for their losses. The good news is that the company recently agreed to settle **$39 million** with them, and the **court has already approved this settlement**. So, if you invested in **$OPEN** when all of this happened, you can check the details and file your claim [here](https://11th.com/cases/opendoor-investor-settlement). Anyway, has anyone here invested in **$OPEN** at that time? How much were your losses, if so?",
        "comments": [
            {
                "raw_content": "And do any of the renters affected see any of it?",
                "author": "Buttercup501"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Home Sales Rose in September, Boosted by Falling Mortgage Rates [Wall Street Journal]",
        "score": 0,
        "text_content": "",
        "comments": [
            {
                "raw_content": "rebubble did NOT like that!",
                "author": "sharktoothscavenger"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Amazon Delivery Smart Glasses",
        "score": 829,
        "text_content": "",
        "comments": [
            {
                "raw_content": "For collecting data for humanoids training for delivery. Right?",
                "author": "Emotional_Law_2823"
            },
            {
                "raw_content": "Amazon ain't doing this to help their drivers. As others have noted, they are doing this to a) gather data to train future automated delivery drivers and to remove the costly humans from their bottom line b) watch and monitor their drivers to ensure that no one is taking one second more on a break We're going to be living in a prison in the future, monitored all the time and with greatly reduced ways to earn a livelihood. That is the road we are on, and pretty models spewing bullshit on stage are the signs by the side of this road.",
                "author": "gripto"
            },
            {
                "raw_content": "Shades of Mr. Lee's Greater Hong Kong franchises from Neal Stephenson \"Snow Crash\".",
                "author": "Economy-Fee5830"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Anthropic: Expanding our use of Google Cloud TPUs and Services - 10s of Billions of dollars of worth, including to to 1 million TPUs, > 1 Gigawatt of Capacity for 2026",
        "score": 148,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Could someone confirm if this story lends more credence to the rumors that TPUs are the more efficient way to deploy the models? I understand that they have other chips, too. But this is a big deal for one kind of chips.",
                "author": "ahneedtogetbetter"
            },
            {
                "raw_content": "So Google probably has several million TPUs or planned TPUs then.",
                "author": "FatPsychopathicWives"
            },
            {
                "raw_content": "all these companies better start making more cash, because the amount of spending is a lil' scary compared to the revenue. Crashing the world economy is not something we need right now.",
                "author": "PwanaZana"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Genie's experimental launch is imminent",
        "score": 576,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Looks like it’ll initially only be text to world? Not seeing image upload. Would love to see some of my worlds come to life",
                "author": "llkj11"
            },
            {
                "raw_content": "![gif](giphy|MZocLC5dJprPTcrm65)",
                "author": "Setsuiii"
            },
            {
                "raw_content": "Oh my god google please, gemini 3 and genie are both really hype",
                "author": "Anxious-Yoghurt-9207"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Google Earth AI is here",
        "score": 390,
        "text_content": "https://x.com/Google/status/1981403118803046686",
        "comments": [
            {
                "raw_content": "My first thought was Genie 3 × Street View ... maybe one day",
                "author": "piggledy"
            },
            {
                "raw_content": "So what data are they making available to people? And what AI tools to interact with this data?",
                "author": "spreadlove5683"
            },
            {
                "raw_content": "google is bringing all their data and tech front. openAI building tools to replace traditional google services but google is stepping up the game.",
                "author": "kvothe5688"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "New 'Markovian Thinking' technique unlocks a path to million-token AI reasoning",
        "score": 95,
        "text_content": "**TL;DR:** A new “Markovian Thinking” approach helps AI models handle much longer reasoning by breaking their thinking into small, linked steps. This makes advanced AI tasks faster, cheaper, and more powerful - potentially enabling a big leap in what large language models can do.",
        "comments": [
            {
                "raw_content": "(off topic) People in physics probably should be joining AI, nothing to do in physics, everything to do in AI (with physics). Heck lot of complex stuff in AI too maybe not as complex as physics.",
                "author": "mightythunderman"
            },
            {
                "raw_content": "What the heck?, I was waiting for 10 years, and now this seems like even hair dressing and plumbing will be automated at this point soon. The advancement is good.",
                "author": "mightythunderman"
            },
            {
                "raw_content": "Having done a lot of work on markov and hidden markov models, I need someone to explain to me why this is markovian. Is the presumption that hidden states are revealed more cleanly by simple problem decomposition?",
                "author": "BrewAllTheThings"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "AI alignment is going well <3",
        "score": 64,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So cute",
                "author": "mightythunderman"
            },
            {
                "raw_content": "Klara and the Sun head ahh",
                "author": "RealAggressiveNooby"
            },
            {
                "raw_content": "\"As a colony of ants, you cannot build a Nether portal in the game Minecraft, because you lack the physical ability to use a diamond pickaxe to mine obsidian, a water bucket, and a flint and steel to light the porta\"",
                "author": "qustrolabe"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Either a permanent solution to baldness or AGI",
        "score": 606,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is from like a week ago. And if you can’t tell from the yellow ribbon, he’s obviously talking about the hostage deal that happened.",
                "author": "Lopsided-Director-26"
            },
            {
                "raw_content": "It's about israeli hostages release since ilya is israeli.",
                "author": "Emotional_Law_2823"
            },
            {
                "raw_content": "please be solution to baldness",
                "author": "agi_2026"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Microsoft - Meet Copilot Mode in Edge: Your AI browser",
        "score": 151,
        "text_content": "",
        "comments": [
            {
                "raw_content": "These ai companies are just waiting to shit on each other with product launches. It's entertaining.",
                "author": "bucky133"
            },
            {
                "raw_content": "Microsoft has such an opportunity to build great things. They have the numbers and the talent but not the culture or compensation to motivate. It’s a shame.",
                "author": "o5mfiHTNsH748KVq"
            },
            {
                "raw_content": "Why are examples always about things that people never fucking use.",
                "author": "anonthatisopen"
            }
        ],
        "subreddit": "singularity"
    }
]