[
    {
        "post_name": "We’re getting close now. Trump is going to tariff the foreign call centers. He’s going to end the spam calls forever",
        "score": 874,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Please also get rid of *\"Press 1 for English.\"* # Make Telecommunications Great Again 📞",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "There is no functional difference between calling a company and getting Indian tech support and being called by an Indian trying to scam you for gift cards. Both guaranteed to piss you off the same amount.",
                "author": "Zskills"
            },
            {
                "raw_content": "My Grandparents were nearly scammed by a dude that called them, claimed he was a friend of mine and that I was in the hospital. I can't wait to see this end.",
                "author": "Noxide"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "❗JUDICIAL COUP: The NYC woman busted for threatening to KILL (and disembowel) President Trump has just been quietly released by an Obama-appointed judge...",
        "score": 655,
        "text_content": "",
        "comments": [
            {
                "raw_content": "James Boasberg..... Again",
                "author": "Sea_Still"
            },
            {
                "raw_content": "OH CMON, NOT JUDGE BOZO?!!? THIS TRUMP DERANGED EGGHEADED SCUMBAG AGAIN?",
                "author": "Dispatch911"
            },
            {
                "raw_content": "So at this point it's clear that he's not getting every single Trump related case by chance, and that he's also not \"judging\" in good faith, so... Where are all those \"checks and balances\" that I keep hearing about?",
                "author": "dogofwar"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Pressure on, Pedes. We all know the power our memes have. Fire the meme cannons.. NOW.",
        "score": 685,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The Deep State is doing anything they can to stall for as long as they can, and meanwhile the trannies are gunning down our children and judges usurp Executive power. We're not out of the woods yet. Be vigilant and always carry.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "They’re not lazy. They’re greedy corrupt obstructionist grifters. They built the graft machine, and sure as hell aren’t going to let some outsider real-estate developer mess it all up!",
                "author": "10MeV"
            },
            {
                "raw_content": "Itd be a lot easier if we just shot all the traitors and imposed our will by force.",
                "author": "RedPillosopher1776"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Ilhan Omar reported a negative net worth of -$45,000 when she was first elected to Congress in 2019. Her latest financial disclosure from May 2025 shows a net worth of up to $30 Million. That’s a 66,676% increase in 6 years.",
        "score": 1060,
        "text_content": "",
        "comments": [
            {
                "raw_content": "that’s a lot of 6s",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Just deport this retarded rag-head already.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "That not stock trading, that's (maybe) legal kickbacks and self dealing. Would your NGO provide a speaking fee?",
                "author": "rivetjoint2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "There it is. Dem's Project 2029: 1. 52 states (DC and Puerto Rico) 2. Abolish the Electoral College 3. Pack the Supreme Court 4. \"Do whatever we want\"",
        "score": 997,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Democrats are so amazingly retarded. DC was carved out of two other states because the whole point of it is to not be in a state.",
                "author": "AbrahamLincoln"
            },
            {
                "raw_content": "trump should just cut them off at the knees and give pr and hawaii jones act waivers and win those islands loyalty forever dc is a nonstarter without amendment",
                "author": "newnewnewnew"
            },
            {
                "raw_content": "Can you imagine Thomas Jefferson and George Washington watching this video with the smug dude, drink in hand, and baby girl sayin, \"Thats right, uh huh , lets pack the supreme court\"",
                "author": "deltaforcestrike"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "socialism explained ☕️🫖",
        "score": 943,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Socialism/Communism is a ruse. It’s sold under false pretenses of economic equity and social justice when it’s just another power grab. The Bolsheviks at the top of the pyramid secretly have genocidal intentions but they enlist naive gentile (and other) ideologues who they convince that it’s all for a noble cause to form a utopia where everyone gets a seat at the table. The people behind it don’t increase their numbers the same way other groups do, by converting outsiders to their way of life. So they have to mass murder their competition to the tune of tens of millions to further their conquest of world domination. It’s a death trap for the naive.",
                "author": "Made_in_America"
            },
            {
                "raw_content": "You work I get the rewards.",
                "author": "Aggrieved03"
            },
            {
                "raw_content": "What happens when something is free? You create unlimited demand. What happens with unlimited demand? You have to start rationing. Healthcare",
                "author": "BetterNameUnfound"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Jerry Nadler is retiring. He’ll shuffle off the political stage for the last time in 2026.",
        "score": 903,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It’s my understanding that he’s gonna be the new spokesperson for Depends.",
                "author": "Trump454748"
            },
            {
                "raw_content": "Hes a disgusting slob. They also say he stinks and I believe it.",
                "author": "crimsonfancy"
            },
            {
                "raw_content": "There goes the Egg Man 🥚",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Good. So much better than statehood. Cut 'em loose.",
        "score": 1438,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Bye Felicia",
                "author": "togger"
            },
            {
                "raw_content": "Let him have their independence then it's like that's probably one of the stupidest things you can do but hey let's see how this plays out cotton. Fucking retards",
                "author": "JayKay1776"
            },
            {
                "raw_content": "Fake article. Fake news. I live in PR. This is rage bait and you all lap it up",
                "author": "As1487"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "As President of the United States of America, I am pleased to announce that Rudy Giuliani, the greatest Mayor in the history of New York City, and an equally great American Patriot, will receive THE PRESIDENTIAL MEDAL OF FREEDOM",
        "score": 1792,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Want to help him? Get his reputation and money back to him",
                "author": "KernalMustard"
            },
            {
                "raw_content": "&#65038; Ruby Freeman allegedly STOLE Rudy's extensive watch collection, plus 100s of $1,000s, if not more, from him. &#65038; President Trump should sent the U.S. Marshals to Ruby's house and demand the President Medal of Freedom back, and give it to Rudy. &#65038;",
                "author": "BallotsOnRubysUSB"
            },
            {
                "raw_content": "Award it to Tina Peters too. She did her job to expose the criminal Democrats for their election fraud. This will trigger all of the liberals too.",
                "author": "DJT4MoreYears"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Some FEMA staff are put on leave after signing dissent letter",
        "score": 1164,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good riddance.",
                "author": "LegendFang"
            },
            {
                "raw_content": "You don't sign a letter of dissent when you don't like what your employer is doing, you sign a letter of **resignation**. The entitlement of government 'workers' is boundless. They want to tell the organization **paying** them what to do, while at the same time refusing to do what they are being paid to do. Clown World indeed.",
                "author": "CaptRied"
            },
            {
                "raw_content": "Good. Bitch out your employer in public and you get fired.",
                "author": "Prof_Smith"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Footage shows swarms of Somalians shutting down roads to pray in Somalia jk… It’s Philadelphia",
        "score": 1159,
        "text_content": "",
        "comments": [
            {
                "raw_content": "if they were Christians praying to God they would have sent in the goon squad faster than you can say Amen.",
                "author": "DogFart_"
            },
            {
                "raw_content": "Death Race 2025",
                "author": "MEME-SUPREME"
            },
            {
                "raw_content": "FUCK THIS ABSOLUTE BULLSHIT",
                "author": "PRMan"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Robert F Kennedy Jr announces ALL research and data will be published and released to the public so you can make up your own mind instead of “trusting the experts”",
        "score": 1595,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Research we paid for should always be free and open to the public",
                "author": "MemoryHoleyeO"
            },
            {
                "raw_content": "Experts aka Fags.",
                "author": "Liberals_R_Idiots"
            },
            {
                "raw_content": "Amen. About time!",
                "author": "KuzoKevin"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: President Donald Trump told the Daily Caller that the Israel lobby is losing influence over US Congress",
        "score": 1332,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They should have zero influence.",
                "author": "projectarcturus1"
            },
            {
                "raw_content": "Still waiting for one shill to explain to us all exactly what Israel has ever done for us.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Without the US subsidizing their lifestyle via housing and other things, Isreal would face the same inflationary cost-of-living crisis that the rest of the world (minus China) is facing. They're the only country with an above-average fertility rate, because we make it affordable for them to do so.",
                "author": "McFatty7"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Benny Johnson : The New York Times just wrote a hit piece targeting my wife and children. The angle was that there is no “proof”that my newborn child was in any danger when our home in DC was severely damaged by an arsonist. So I’m posting the proof here…",
        "score": 1161,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The New York Times just wrote a hit piece targeting my wife and children. The angle was that there is no “proof”that my newborn child was in any danger when our home in DC was severely damaged by an arsonist. So I’m posting the proof here… Watch my security cameras capture DC Police Officers using a crowbar to rip my front door open as neighbors scream “There’s a baby inside!” Black smoke from the inferno fills my child’s nursery. Moments later, my terrified wife runs out of the home with our newborn in her arms. We lived in a row house and the house next to us was a total loss. Both their dogs were burned alive in the arson. Our home was rendered completely uninhabitable due to damage from the fire. We had to live in a hotel for months afterwards. This was the worst day of my life. I almost lost everything. I moved my family to Florida swiftly afterwards. In spite of all of this hard evidence and the police reports, The New York Times still does not think my wife or newborn were in danger that day. This is the kind of dehumanizing propaganda that actually gets people killed. From the celebration of the Trump assassination to the refusal to pray for the child victims of the Minneapolis Mass shooting, the Left’s goal is to never grant sympathy to regular Americans, even if they’re innocent children. Evil bastards. You should judge a man by his enemies. I’m proud to have the New York Times work so hard on a hit piece about me. It’s a badge of honor and a rite of passage in this industry, but leave my children and wife out of it. My attorneys have notified the New York Times that we will not suffer defamation or libel against my family. Tread lightly. Florida juries don’t take kindly to New York left-wing political assassins attacking innocent Floridian children. Finally, I’m Proud to fight with the Trump Administration for the security of *every* American parent, no matter your background or politics. You have a right to security in your homeland, and especially in America’s Capital City. Stunningly, there are those who think otherwise. Remember: This is what we’re fighting for 🇺🇸",
                "author": "PiratePatriotParrot"
            },
            {
                "raw_content": "They won't stop. Until they're stopped. And buried (this part optional).",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Wow. We really don't hate the media enough, it's impossible to hate them as much as they deserve.",
                "author": "Fangerang"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Please contact your Reps in D. C. and ask them to reinstate The McCarran-Walter Act of 1952 which bans immigrants of ANY nationality to hold office in the United States.",
        "score": 635,
        "text_content": "",
        "comments": [
            {
                "raw_content": "McCarran Airport enters the chat",
                "author": "Crappydatum"
            },
            {
                "raw_content": "Would need a constitutional amendment at the federal level. 10th amendment means you would have to pass it in each state as well.",
                "author": "RocksCanOnlyWait"
            },
            {
                "raw_content": "🤣🤣🤣 my reps are a bunch of criminal cuntwads that want more illegals here. Not going to even waste my time.",
                "author": "SaltyLandscaper"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "he/him-man.",
        "score": 1530,
        "text_content": "",
        "comments": [
            {
                "raw_content": "By the power of numbskull!",
                "author": "MrMcGreenGenes"
            },
            {
                "raw_content": "Why does she look like she's aged 20 years in 5 years? Is that really a pic of her?",
                "author": "Reassess_Reevaluate"
            },
            {
                "raw_content": "Greta Transbird.",
                "author": "Spiritof2015"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "TOP KEK 🐸",
        "score": 1204,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Kek",
                "author": "kek-is-tan"
            },
            {
                "raw_content": "Kek <--- This one Kek Kek Kek Kek",
                "author": "duehuckleberry"
            },
            {
                "raw_content": "Welcome to Kekistan. Don’t worry, your goats are safe here.",
                "author": "MedicallyReddit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"My husband is a US citizen, software engineer with about 30 years of experience. He was unemployed for over a year. In that time he had multiple interviews every week, but no job offers. HR and interviewers are gatekeepers. Only American citizens should be in charge of hiring decisions.\"",
        "score": 375,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ageism and racism are real.",
                "author": "TwoArizonaPedes"
            },
            {
                "raw_content": "30 years of experience puts him in or at least close to his 50s, it's like an employment death sentence as most HR departments are now staffed by millennials that consider him too old for the job... I just went through this, I couldn't even get a fucking warehouse job!!! But, I was not surprised as when I went for interviews, I didn't see anyone over 40 in the entire warehouse, mostly mid 20s employees same age as the HR people doing the interview...",
                "author": "Allister"
            },
            {
                "raw_content": "Same here. U.S. companies are discriminating against older white males. Every interview I’ve had has been with a woman and/or a hindu. My profession used to be 98% male. They’ve stacked the deck against us. White women, you’re next.",
                "author": "GeorgeBailey"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "⏰ Loomer: Recess is OVER tonight. I don’t want to hear anymore excuses tomorrow about why President Trump’s nominees haven’t been confirmed 8 months into his administration.—Time to get off your lazy asses & WORK to approve Trump’s nominees.",
        "score": 462,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Imagine what President Trump could accomplish if he actually had a political party backing him.",
                "author": "BenjaminLWillard"
            },
            {
                "raw_content": "# Link: *https://x.com/LauraLoomer/status/1962676771075031236*",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Hey! They did their jobs during vakay by making damn sure President Trump couldn’t make any appointments while they were away. Fuckers.",
                "author": "Nellie_the_Beaut"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump is floating REOPENING the insane asylums. DAILY CALLER: Would you be open to the government reopening insane asylums for people with serious mental illness? TRUMP: Yeah I would...you can’t have these people walking around.",
        "score": 1301,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You need asylums and prisons operating to make the country safe again. Undesirables need to be on the correct side of WALLS.",
                "author": "TooBright"
            },
            {
                "raw_content": "The mental institutions were shut down in the 1960s for \"compassion.\" The mentally-ill were then forced to the streets as homeless. Many then became criminals out of necessity, or directly because of their mental illness. Democrats then let them out of the prisons. That's not compassion. We have millions of mentally-ill people that need help, and need to be taken off the streets. And millions more that are truly criminals. Do I even need to get into the millions of illegals? This is where we are today, compared to 65 years ago.",
                "author": "duehuckleberry"
            },
            {
                "raw_content": "As long as they're run by conservatives and not commies. Otherwise, the commies will use them to program people to later set loose as assassins and/or terrorists.",
                "author": "boredrandomguy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Steam Hardware & Software Survey: August 2025",
        "score": 72,
        "text_content": "Steam just dropped their August 2025 Hardware & Software Survey, and there are some interesting shifts this month. RTX 5070 has officially become the most popular Blackwell (50 series) GPU on Steam. It now sits in the Top 20 most used GPUs according to the survey. RDNA 4 Radeon GPUs are still missing from this survey showing that AMD’s newest generation hasn’t yet gained measurable adoption among Steam users. https://store.steampowered.com/hwsurvey/videocard/",
        "comments": [
            {
                "raw_content": "As we closely approach the alleged 50 Super with more VRAM, my guess is Radeon won't appear at all this gen (maybe down the line when prices drop further). AMD trick in its sleave is that 9070 has 16GB of VRAM and its a bit faster than 5070. But that its just not enough to overcome Nvidia ecosystem of ML goodies. A potential 18GB 5070 at 549$ will absolutely kill anything AMD wise (I also don't think AMD will do refreshes).",
                "author": "NGGKroze"
            },
            {
                "raw_content": "make sense. just look at both Nvidia and AMD Q2 revenue. Nvidia gaming revenue was 4.3 billion (10% of Nvidia’s total revenue) while AMD gaming revenue was 1.1 billion (14% of AMD’s total revenue). Q1 gaming revenue was 3.7 billion (nvidia) and 0.6 billion (AMD)",
                "author": "Quiet_Try5111"
            },
            {
                "raw_content": "An RTX 4060 an 8GB GPU is now officially the most popular GPU in the whole world. Even when you go to internet and the vast of Tech YouTubers hates it and doesn't recommend their audiences on buying it. It just clearly shows us how the pc hardware enthusiast community is such a small fraction compared to your average joe PC Gamer who doesn't need more than 8GB of Vram.",
                "author": "ShadowRomeo"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "FSR4 is VERY beneficial on RDNA3, even with the very hacky solution on Linux.",
        "score": 106,
        "text_content": "This is really something that's just bugged me for a while whenever this topic comes up: people consistently saying that FSR4 on RDNA3 is slower than native rendering and thus it's usefulness is very limited. In reality, things are a _little_ bit more nuanced, but first: # Actual performance figures To show off a reasonably extreme example, here's the optiscaler overlay for FSR3, FSR4 and XeSS (DP4a) running on my 7800XT. In it you'll see that all of these are taken at 1440p output resolution, 76% render scale (Clair Obscur Expedition 33's DLSS Ultra Quality preset is providing the inputs for all 3 upscaling methods here). And as an additional comparison point, the last screenshot will be TSR running at native. [FSR3 Ultra Quality](https://imgur.com/a/TnJ6KPI) [FSR4 Ultra Quality](https://imgur.com/a/sHlRet1) [XeSS Ultra Quality](https://imgur.com/a/WXIcbch) [Native TSR](https://imgur.com/a/Fx8hPKW) If you're wondering about quality, refer to [RPCS3 dev kd-11's video from a month ago](https://www.youtube.com/watch?v=yeD6gF9eTjU). I lack the editing skills and the patience to figure out why all my screenshots and recorded video taken on Linux looks like crap when both software and hardware encoded. But to my eye, I would consider FSR3 Quality to be a clear downgrade over TSR native and honestly look worse than FSR4 performance in some regards - namely image stability. FSR3 looks sharper thanks to the higher base resolution, but is easier to see artifacts in. XeSS sits somewhere in the middle, but closer to FSR3 than FSR4 once some motion is introduced. As a reminder, the aforementioned results are at the ultra quality preset. This is also at a relatively high starting framerate - and I specifically opted for the low quality preset to take them. If you wanted an experience close to native, you'd stick to quality or balanced preset instead - I chose these settings to present FSR4 a close to worst-case scenario. Which leads me very nicely onto the next topic: # The Caveats. I'm not going to sit here and tell you that ~2.3ms upscaler time is low or normal. It's not. It's very high for an upscaler, and if you're aware of the high frametime cost of DLSS3 framegen and issues with that, then yes it's a very similar situation. The benefits of FSR4 rapidly decrease as you enter high framerate (>150fps) territory or you run higher resolutions. Lets run through the issues with both: 1. Framerate: As your native framerate increases, then the improved frametimes you get from running a lower base resolution are lower. That's where your extra performance when upscaling comes from. On my 7800XT at 1440p, I'd likely stop seeing performance increases with FSR4 around 150fps before upscaling. Which I personally think is fine as anything over like 120fps is past the point I can tell the difference, but that won't apply for everyone. 2. Higher output resolutions will be the main driver for increased upscaler time. My 7800XT is great at 1440p, but at 4K it would struggle to provide a meaningful benefit above probably around 80fps. # Well what about lower end RDNA3 products? I'm not going to sugar coat this, from my testing 7840U doesn't benefit much from FSR4. Even at 720p, upscaler time is around ~6ms. I would expect HX370 to be in the same ballpark, if maybe a little better. That's probably _just_ about enough to be able to reasonably not be a performance downgrade at 60fps, but that's it. Admittedly in newer titles this hardware can struggle to hit 720p60 native, but even still... That being said, everything above the small APUs should be _signifcantly_ better. Strix Halo is the next lowest end hardware, and that sees upscaler time of around 2.6ms at 1080p - which means like my 7800XT should be able to use FSR4 reasonably well at that resolution, and probably even usable at ~1440p for middling framerates. The 7600XT falls in the same performance ballpark. Outside of the base APUs that's kind of the key takeaway when it comes to performance really - when run at the resolutions each RDNA3 GPU is best suited at anyway, FSR4 ends up rather useful. My personal hope is AMD actually does extend support for FSR4 to RDNA3 with a proper native FP16 implementation. In order to get FSR4 working on RDNA3 on Linux, the WMMA calls are essentially being converted from FP8 to FP16, then back to FP8 again so that the FSR4 SDK understands them. Which is also why performance of FSR4 on RDNA3 is basically 1/4 that of the performance of RDNA4 (7800XT vs 9070XT, or 60CUs vs 64CUs). A true native FP16 implementation could achieve the same thing without the conversions both ways, so theoretically perform a little bit faster, but more importantly FSR4 is just so much better looking than FSR3 that FSR3's performance advantage means very little in the grand scheme of things.",
        "comments": [
            {
                "raw_content": "Seems really dumb to me that AMD doesn't officially support this.",
                "author": "DYMAXIONman"
            },
            {
                "raw_content": "It's been so interesting to follow along with all of this. I don't have much need for it myself, but it's cool to know my 7900XTX can technically do it. I definitely agree that a native FP16 version would be nice to have, and probably run a lot better. Also, really cool to hear about some APU results. I can't say I expected anything better, but good to know. I'd be curious to see the 8050S and 7600XT compared, along with the 890M and 8040S.",
                "author": "Affectionate-Memory4"
            },
            {
                "raw_content": "Please don’t use Discord to host images, use Reddit or Imgur instead. Discord is fine for private use but not for hotlinking, as links will expire after 24 hours.",
                "author": "Big_Refrigerator1233"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Ancient Gameplays - Windows vs Linux (CachyOS, Bazzite & Nobara) - AMD & NVIDIA Benchmarks",
        "score": 75,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TLDW: **16 games average (1080P):** R7 9700X + RTX 9070XT: Win11 24H2 (25.8.1): 152.5 FPS (Avg), 104.4 FPS (1%) --> **100%** CachyOS (Default Drivers): 147.3 FPS (Avg), 104.4 FPS (1%) --> **96.5%** Nobara 42 (Mesa Git): 147.3 FPS (Avg), 107 FPS (1%) --> **96.5%** Bazzite 42 (Mesa Git): 143.7 FPS (Avg), 97.1 FPS (1%) --> **94.2%** R7 9700X + RTX 5080: Win11 24H2 (25.8.1): 158.4 FPS (Avg), 108.8 FPS (1%) --> **100%** CachyOS (Default Drivers): 136.1 FPS (Avg), 95.6 FPS (1%) --> **85.9%** Nobara 42 (Mesa Git): 133.3 FPS (Avg), 90.1 FPS (1%) --> **84.1%** Bazzite 42 (Mesa Git): 133.8 FPS (Avg), 81.2 FPS (1%) --> **84.4%** **16 games average (1440P UW 3440x1440):** R7 9700X + RTX 9070XT: Win11 24H2 (25.8.1): 97 FPS (Avg), 71.9 FPS (1%) --> **100%** CachyOS (Default Drivers): 90.5 FPS (Avg), 68.4 FPS (1%) --> **93.2%** Nobara 42 (Mesa Git): 90 FPS (Avg), 70.1 FPS (1%) --> **92.7%** Bazzite 42 (Mesa Git): 89.2 FPS (Avg), 69.3 FPS (1%) --> **91.9%** R7 9700X + RTX 5080: Win11 24H2 (25.8.1): 108.7 FPS (Avg), 79.7 FPS (1%) --> **100%** CachyOS (Default Drivers): 93.6 FPS (Avg), 69.6 FPS (1%) --> **86.1%** Nobara 42 (Mesa Git): 91.2 FPS (Avg), 63.7 FPS (1%) --> **83.9%** Bazzite 42 (Mesa Git): 91.8 FPS (Avg), 59.3 FPS (1%) --> **84.4%**",
                "author": "Antonis_32"
            },
            {
                "raw_content": "That’s amazing taking into account how little effort is put on Linux drivers, plus compatibility layers. A real alternative for those fed up with Windows (or not having a TPM)",
                "author": "TRKlausss"
            },
            {
                "raw_content": "I have my hope in Nvidia finally fixing DX12 performance and I'll be happy for now.",
                "author": "Clean_Experience1394"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[News] Memory Giant, Fragile Link: Korea’s Reliance on Japan in HBM Supply Chain",
        "score": 16,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">The report notes that in SK hynix’s HBM value chain, the ultra-fine TSV (Through-Silicon Via) stacking structure relies on key materials and equipment largely monopolized by Japanese firms. It highlights underfill — essential for HBM stacking — as being supplied almost exclusively by Japan’s NAMICS. With few alternatives available, localization has been slow, the report adds. >In addition, SK hynix sources a large share of silicon wafer from Shin-Etsu Chemical, which today controls about 30% of the global semiconductor wafer market, the largest share worldwide, as the report indicates. According to the report, combined with SUMCO, Japan’s share in this sector is estimated to reach as much as 70% of the global market. >Japan remains central to HBM production, with SK hynix sourcing most of its photoresists (PR) from Tokyo Ohka Kogyo (TOK) and relying on JSR and Asahi Kasei for encapsulation materials (EMC), all critical to making HBM, the report notes.",
                "author": "imaginary_num6er"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "(High Yield) How AI Datacenters Eat the World",
        "score": 90,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There has yet to be a profitable use of AI once you remove VC subsidies. This is the cap of a what will be the darkest period of our ecological history.",
                "author": "jhenryscott"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Financial Times] US chipmaking curbs hit Samsung and SK Hynix",
        "score": 82,
        "text_content": "",
        "comments": [
            {
                "raw_content": "[removed]",
                "author": "None"
            },
            {
                "raw_content": "What does South Korean companies need permission from Washington to be able to sell to China?",
                "author": "SevenNites"
            },
            {
                "raw_content": "Advanced wafer fabrication equipment (WFE) is USA technology.",
                "author": "No-Side-5121"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Will Intel make any desktop APUs?",
        "score": 0,
        "text_content": "Consumer desktop APUs are one of the most disappointing segments right now. While Mini-PCs are exploding in popularity, there's not a desktop chip which takes advantage of improved cooling and increased power limits. AMD does sell their mobile iGPUs on desktop chips with their 8000G \"Phoenix\" series APUs. However, these are using RDNA3 technology which is quite old. The updated chips come out this year, but are RDNA 3.5 instead of the significantly-upgraded RDNA4. There's also not a desktop variation of strix-halo technology. On the other hand, we have Intel who leapfrogged AMD on iGPU tech recently. AMD's graphically dedicated 8500g is roughly on par with the baseline arrow lake iGPU. Despite that, they seem unwilling to release a configuration with improved core counts. Arrow lake refresh rumors suggest they will retain the alchemist graphics instead of the upgraded Battlemage. My questions are as follows: 1. Why do AMD & Intel not release an iGPU on their latest technology? 2. Will Intel release products in the APU market while they have an iGPU lead? 3. Do you think the APU market can supplement the miniPC market if it was not a generation behind?",
        "comments": [
            {
                "raw_content": "APU is just AMD's marketing for an SOC with integrated GPU. intel, AMD, Qualcomm, Apple, et al have had \"APUs\" for ages now.",
                "author": "xternocleidomastoide"
            },
            {
                "raw_content": "Because it has to have a market. Is anyone going to spend a bunch of money for a desktop with a high power integrated GPU when it would be cheaper and faster to get an old used GPU instead? Businesses aren't, they are either going to go laptop, basic desktop, or more powerful system with a dedicated card if needed. Enthusiasts aren't going to bother outside of niche small form factor stuff, and in those you already can get the strix halo chips. And mobile already has the high power igpus. You have to remember that anything past roughly what exists now in the 8700g tier of GPU is going to be extremely memory starved on desktop with 2 memory channels. Laptop can use high speed soldered lpddr5, but are you going to spend the extra money on ddr5 8000 and a good board to run a bit of a faster igpu? And if you don't want to do that, then the CPU would need quad channel memory like halo, which is also expensive in its own way.",
                "author": "Bluedot55"
            },
            {
                "raw_content": "That's what Nova lake-AX is for.",
                "author": "Hytht"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nintendo Switch 2 Firmware Update Version 20.4.0 is out now",
        "score": 285,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/g4nlmbn2rnmf1.jpeg?width=500&format=pjpg&auto=webp&s=411bcaedfb8185dbaca9204b23dba18a4d969f67",
                "author": "DrSussBurner"
            },
            {
                "raw_content": "stabler than my parents relationship",
                "author": "3LapRacer"
            },
            {
                "raw_content": "ITS SO STABLE OH MY GOD",
                "author": "a355231"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "What is this brilliant strategy called?",
        "score": 1400,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's called, trying to see if this mostly unsuccessful game can possibly be more successful launching on a brand new console",
                "author": "WeAreNephilim"
            },
            {
                "raw_content": "It's called *'bringing a game that underperformed to a new audience on a popular console that is lacking games.'* and It's a pretty obvious strategy for a third party studio, i'm not sure why you're questioning just because it's a game you don't want. Why would they spend time and resources porting games that already exceeded targets to a new platform when they can risk an underperforming one in the hope it'll break target and recoup more of the cost of development? It's simple economics.",
                "author": "Sjknight413"
            },
            {
                "raw_content": "Lol imagine porting unity over a Star Wars game I’m sure that’s a good move before the holiday season for a new console",
                "author": "No_Description3310"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "🎮📅 It's a new month of Nintendo Switch 2 and Nintendo Switch releases. What's on your wishlist for September?",
        "score": 405,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Silksong, trails in the sky 1rt, and maaaaybe final fantasy tactics",
                "author": "Infinite-Road-8970"
            },
            {
                "raw_content": "Silksong. Playing hollow knight right now",
                "author": "Justos"
            },
            {
                "raw_content": "Just Final Fantasy Tactics for me. Got it preordered.",
                "author": "Nintendo60sWhore"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "They won't announce Microsoft Flight Simulator 2024 on the September 11th direct... right?",
        "score": 39,
        "text_content": "Nintendo really doesn't want America to give them tarrif exceptions, huh Edit: half of you belong in r/whooosh",
        "comments": [
            {
                "raw_content": "I can’t believe the joke flew right over so many people’s heads",
                "author": "MrMunday"
            },
            {
                "raw_content": "itt: people who forgot",
                "author": "barfboy710"
            },
            {
                "raw_content": "sorry why do you think they’d announce Microsoft Flight Simulator for a Nintendo cons… oh ok nvm I get it",
                "author": "KestrelQuillPen"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Star Wars Outlaws HANDHELD gameplay",
        "score": 223,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lol the more I see of third party on switch the more I realize that a lot of the press are just rage baiting for clicks",
                "author": "Time_Substance_7829"
            },
            {
                "raw_content": "Definitely a game I’ll pick up on a Black Friday sale",
                "author": "TOYOTA-IRAQ"
            },
            {
                "raw_content": "Not always easy to judge by videos, but this appears to be running better than on the Steam Deck. (It's not optimized for it, either, so maybe this isn't a fair comparison to make.)",
                "author": "mrmivo"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Star Wars Outlaws Switch 2 vs PS5 side by side comparison",
        "score": 153,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It looks okay considering the difference in raw power between the two devices. Definitely doesn’t look like a disaster to me.",
                "author": "Sandy12315"
            },
            {
                "raw_content": "I think the Switch 2 port looks fantastic actually 👍🏼 I played the game on PS5 in performance mode and it couldn’t hold a steady 60fps there. Lots of stuttering which really annoyed me. For some reason the game gets a lot of hate (as a Star Wars game) I thought it was excellent and had a blast while playing it. The game is perfect as a handheld game (pick up and play anytime anywhere without being tied to your TV). If you haven’t played it before and want the handheld experience. Then this port looks a pretty good option 👍🏼",
                "author": "IKEAboy_2006"
            },
            {
                "raw_content": "Is there difference time of days in this game? The switch 2 looks very orange compared to ps5, but maybe it's because it's evening?",
                "author": "Beautiful-Jacket-260"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Mouse controls in the sky",
        "score": 148,
        "text_content": "First time flying with the Nintendo Switch 2 using my DM² case with the magnetic mouse pad attachment - anyone else using mouse controls for Cyber punk? Or know any other Good games that uses mouse controls ? )",
        "comments": [
            {
                "raw_content": "The charger position bothers me. Use the top one...",
                "author": "OkMathematician6638"
            },
            {
                "raw_content": "Honestly, as someone who's flown often with their Switch, that looks really awkward and uncomfortable. Looks like you're playing with your right arm coming across the front of the screen? I'd just play handheld.",
                "author": "elephvant"
            },
            {
                "raw_content": "Wouldnt be way more comfortable playing handled rather than trying to use mouse control in such an small space? Or at the very least, having each joy con as a mouse on each side, not both at the same side You also have the screen more far away this way. It doesnt seem to be very comfy tbh",
                "author": "Morvisius"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Someone please help me choose next game",
        "score": 15,
        "text_content": "I recently got a switch 2 and never had a switch 1. So far I’ve played Stardew Valley (100hours), BOTW (55hours), and Bananza. I own TOTK, fantasy life i, hogwarts, hollow knight, no mans sky, and golf story. Can someone help me decide what to play next",
        "comments": [
            {
                "raw_content": "I think it’s the perfect time to play Hollow Knight, with the sequel coming out soon",
                "author": "guicampara"
            },
            {
                "raw_content": "Kirby and the Forgotten Land Switch 2 Edtion. Great game.",
                "author": "Rawkhawkjayhawk"
            },
            {
                "raw_content": "I think you should beat bananza and botw if you haven’t already and then play totk. After you beat that recommend getting mario odyssey",
                "author": "Silent_Anxiety4828"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Discussion, News, and Request Thread - Week Beginning 09/01/25",
        "score": 31,
        "text_content": "[https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTWjNwfWTr--DgxLija\\_Edmlxy4z2VRAMD7vA&s](https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTWjNwfWTr--DgxLija_Edmlxy4z2VRAMD7vA&s) Discussion threads are your weekly central hub for all requests, gaming news, and any other gaming topics you want to talk about. *Please keep all content that doesn't need it's own post to this thread to de-clutter the sub for proper leaks and rumors. Thanks!* **Join our new companion sub for super secret Resident EVIL 9 and Half-Life 3 leaks** \\-- [r/OkBuddyGLAR](https://new.reddit.com/r/OkBuddyGLAR/) Hot Threads of the past week: * [Microsoft is reportedly mandating that every single employee at King (Candy Crush) has to use AI on a daily basis](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1n0w38k/microsoft_is_reportedly_mandating_that_every/) * [Billbil-Kun: Hollow Knight Silksong price is $19.99](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1n496oj/billbilkun_hollow_knight_silksong_price_is_1999/) * [GameStop appears to have leaked Silksong's price. ($20)](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1n3ifyc/gamestop_appears_to_have_leaked_silksongs_price_20/) * [SwitchForce states the direct he has been teasing for Friday, September 12th, is a general/\"the big one\".](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1n0gw2e/switchforce_states_the_direct_he_has_been_teasing/) * [Kingdom Hearts IV: Possible Worlds List Leak](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1n2cp85/kingdom_hearts_iv_possible_worlds_list_leak/) # [Want to help us improve this subreddit? ](https://forms.gle/w9JaYTjVN1Zie9e39)[Provide us with feedback here](https://forms.gle/w9JaYTjVN1Zie9e39)[!](https://forms.gle/w9JaYTjVN1Zie9e39) # [Click here to join the discord to enjoy further conversations with the community!](https://discord.gg/6jdBvCSqbj)",
        "comments": [
            {
                "raw_content": "I wonder if MGS Collection Vol 2 is in our near future, I need to play MGS 4 again.",
                "author": "KingMan753"
            },
            {
                "raw_content": "I want something tomb raider soon pretty please, I feel like it could be at the game awards",
                "author": "Desperate-Response75"
            },
            {
                "raw_content": "I need RDR2 PS5 news. I'm dying here. Please.",
                "author": "drumjolter01"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Nintendo accidentally leaked the file track names for Mario Kart World, revealing Faraway Oasis used to be DK Jungle Parkway, and Starview Peak was Rosalina’s Ice World",
        "score": 413,
        "text_content": "https://xcancel.com/kremlinglady1/status/1962443285999256063?s=46 https://xcancel.com/ralsrags/status/1961212110983024980?s=46",
        "comments": [
            {
                "raw_content": "Makes sense. All of the \"retro\" tracks are more modified than ever, so it makes sense that some of the \"new\" tracks started as retro but evolved too far beyond their original designs.",
                "author": "ThatGuyinYourCereal"
            },
            {
                "raw_content": "I’m guessing those were placeholders. They probably knew they wanted an animal level and a comet observatory level and used those existing ones as a base.",
                "author": "LemonStains"
            },
            {
                "raw_content": "Really like Mario Kart World, but I’ve recently been considering buying Mario Kart 8 Deluxe just to journey across the god-tier atmosphere of Toad’s Turnpike once again, a race track I have not experienced since the strange days of the Wii U. What does this have to do with this leak? Nothing. I’m simply releasing a thought from my brain like a butterfly from a bottle. It wants to be free.",
                "author": "AfraidoftheLark"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "BF6’s Season 1 map (Badlands) video leaked",
        "score": 51,
        "text_content": "- “Blackwell Field” or Blackwell Farm” - Set in Kern County, CA - The second potential map for Season 1 could be Eastwood which is also set in CA 10min map showcase: https://streamable.com/x4cj0v Source: Misaka_Mikoto_01 on bilibili",
        "comments": [
            {
                "raw_content": "Did the player snort a line of cocaine before playing? What an annoying way to show off a map.",
                "author": "IplaygamesNude87"
            },
            {
                "raw_content": "Seems pretty damn big with some enclosed objective areas (like the small town and base). Should be fun for some combined warfare goodness. As an addendum: this Misaka Mikoto dude absolutely sucks making videos. We don't give a flying shit about your slide canceling skills and twitch aim. Stop jumping around like a crack fiend in 200 FOV and let us look at the damn map for a second.",
                "author": "giulianosse"
            },
            {
                "raw_content": "I hope people slide running like that doesn't become normal meta in the final release",
                "author": "AkelaHardware"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Marvel Rivals is coming to PS4, spotted on PSN database (via @PlaystationSize)",
        "score": 236,
        "text_content": "https://xcancel.com/PlaystationSize/status/1962496976731214040#m",
        "comments": [
            {
                "raw_content": "Footage of me running the game ![gif](giphy|XWMVGROfcV9KfPm5Pt|downsized)",
                "author": "Christopher_Nolan-"
            },
            {
                "raw_content": "Your PS4 after you try to open a portal with Doctor Strange ![gif](giphy|l0IxYWDltdHEqujnO)",
                "author": "Spider-Fan77"
            },
            {
                "raw_content": "at this point in 2-3 years PlayStation YouTube channel gonna share video game trailers with \" | PS6 & PS5 & PS4 Games\" on the title",
                "author": "MrBeyonde"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "State of Play September 3rd with 007 First Light gameplay confirmed",
        "score": 554,
        "text_content": "Source https://xcancel.com/PlayStation/status/1962500749033623681?t=wUqOHdn0FR1n2oBHZJXRLQ&s=19 Previous rumour https://www.reddit.com/r/GamingLeaksAndRumours/s/sRQRqQccvJ",
        "comments": [
            {
                "raw_content": "![gif](giphy|3oFzm9r8nz1CmqYtmU) The Reddit user who leaked this with the source being himself",
                "author": "Soufiane040"
            },
            {
                "raw_content": "Promote u/minimAlswag to tier 1",
                "author": "ForcadoUALG"
            },
            {
                "raw_content": "To be clear this is a State of Play dedicated to 007 First Light, nothing else will be shown Anyway u/minimAlswag to Tier 1",
                "author": "m1n3c7afty"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "SwitchForce doubles down on the Friday, September 12th direct, and states he will give further details on game appearances closer to the direct's date.",
        "score": 340,
        "text_content": "Source: [https://www.youtube.com/watch?v=ajeIMs7U\\_ew](https://www.youtube.com/watch?v=ajeIMs7U_ew) \"And I've already started to see some things about what games are going to be there, what games aren't going to be there. I'll give you the lowdown as we approach \\[the direct\\].\" He also says that the strange Friday date is \"probably\" because Mario's anniversary is on the 13th.",
        "comments": [
            {
                "raw_content": "Bro is flying so close to the sun... ...Kid Icarus confirmed!",
                "author": "KMoosetoe"
            },
            {
                "raw_content": "Strangely enough, I'm going to completely believe this guy. Never thought this day would come.",
                "author": "TEoSaT"
            },
            {
                "raw_content": "Hopefully Mario stuff at this direct for the anniversary.",
                "author": "QuantumProtector"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Rocksteady Hires Former Assassin’s Creed Director Possibly For New Batman Game",
        "score": 336,
        "text_content": "Bill Money, a veteran of the Assassin’s Creed series and known for his work on Arkham Origins, has joined Rocksteady as a game director. This move comes as speculation grows about a new Batman game from Rocksteady, fueled by a now-closed job listing for a game director role that hinted at a new title in the franchise. [Source](https://tech4gamers.com/ex-assassins-creed-director-hired-by-rocksteady/)",
        "comments": [
            {
                "raw_content": "I like how his name is \"Bill Money\".",
                "author": "MAJ_Starman"
            },
            {
                "raw_content": "I like how he also worked on Arkham Origins, but everyone puts \"Assassin's Creed veteran\" in the headline because that's what's gonna draw controversy.",
                "author": "Spider-Fan77"
            },
            {
                "raw_content": "We might finally get Arkham World",
                "author": "BeansWereHere"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Rayman X account changes icon for 30th anniversary (which is today), news incoming?",
        "score": 208,
        "text_content": "https://xcancel.com/RaymanGame",
        "comments": [
            {
                "raw_content": "Capcom made a poster for DMC's 20th anniversary and updated the DMC socials and we got literally nothing from it other than a sale. Stuff like this doesn't equate to a new announcement all the time.",
                "author": "xAVATAR-AANGx"
            },
            {
                "raw_content": "Don't do this to me. Don't give me hope. **Edit: the profile description now reads \"Rayman turns 30! Let's celebrate Rayman's Anniversary together with concept art, behind-the-scenes developer interviews, giveaways, fan creations, and more.\"** So I guess storm in a teacup.",
                "author": "Craimasjien"
            },
            {
                "raw_content": "Everyone puts way too much stock in anniversaries anymore. Disappointing as it may be, they are not obligated to have some kind substantial announcement of a new game or a remaster collection. Always expect a blurb from the devs or publishers at the least, maybe with some interviews or possibly concept art and a sale on prior games (where applicable). Or if they're Japanese, expect some pop up shops or an art exhibit that is irrelevant to the rest of the world.",
                "author": "Coolman_Rosso"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Borderlands 4 Achievements",
        "score": 118,
        "text_content": "The full list of Borderlands 4 achievements has been posted via Insider Gaming. The game has 35 total achievements, and none of them feel all too surprising. I listed a few below Achievements: * **Catch-A-Ride**: Collect all personal vehicles. * **I Earned This**: Equip legendary gear in every slot. * **Area of Expertise**: Complete any Gear Challenge category. * **Ruler of Everything**: Complete all activities. * **Shoot the Moon**: Complete the Creep Impact world event. * **Freelance, but Not for Free**: Complete 80 contracts. Source: [https://insider-gaming.com/borderlands-4-trophies-achievements](https://insider-gaming.com/borderlands-4-trophies-achievements)",
        "comments": [
            {
                "raw_content": "Yep, that's a Borderlands trophy list alright.",
                "author": "No_Tr4geD1es"
            },
            {
                "raw_content": "The really referenced One Piece in the achievement list lmao. At least it wasn't a dated meme this time",
                "author": "smolgote"
            },
            {
                "raw_content": "I can’t read “Good Hunter” without it being in The Doll’s voice",
                "author": "Plus-Preference-8538"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Switching From i915 To Xe Linux Drivers Can Yield Some Big Gains For Intel Arc A-Series",
        "score": 40,
        "text_content": "",
        "comments": [],
        "subreddit": "intel"
    },
    {
        "post_name": "Install the latest BIOS update if you have an ASRock motherboard to reduce AM5 burn risk",
        "score": 212,
        "text_content": "We are making this thread as in recent weeks, there has been renewed interest in ASRock motherboards burning AM5 CPUs, this seems to have primarily affected those with Zen 5 X3D CPUs, like the AMD Ryzen 7 9800X3D. The /r/ASRock subreddit has multiple posts per day about this issue, so we are making the post here to reach a wider audience. If you have an ASRock AM5 motherboard, please ensure you check the support page for your model and install the latest available BIOS update, it would be advisable to check the page regularly for newer BIOS releases. --- **Helpful Links** [List of ASRock AM5 Motherboards](https://www.asrock.com/mb/index.asp#AM5) [ASRock Motherboard BIOS Update Tutorial](https://www.youtube.com/watch?v=ngyni0nnTXA) **News Articles** VideoCardZ: [Same user loses another Ryzen 7 9800X3D on ASRock motherboard](https://videocardz.com/newz/same-user-loses-another-ryzen-7-9800x3d-on-asrock-motherboard) WCCFTECH: [AMD Clarifies AM5 Socket Burnout Concerns; Blames ODM BIOS Non-Compliance And Recommends Upgrading To Latest BIOS Versions](https://wccftech.com/amd-clarifies-am5-socket-burnout-concerns/) TechPowerUP: [ASRock BIOS 3.40 Improves CPU Stability and Reduces AM5 Burn Risk](https://www.techpowerup.com/340447/asrock-bios-3-40-improves-cpu-stability-and-reduces-am5-burn-risk) --- At this stage, this issue is not believed to impact other motherboard vendors, such as MSI, Gigabyte or ASUS, however if you have an AM5 motherboard from one of these vendors, a vendor not listed, or an AM5 system from an OEM like Dell or HP, it's always advisable to install the latest available BIOS update or firmware available for your board or system.",
        "comments": [
            {
                "raw_content": "As an AsRock owner, I'll believe it when I see it, these ass clowns said it was resolved with BIOS versions 3.20, 3.25, AND THEN 3.30. I'm starting to believe there's some intrinsic design fuck up that they are just desperately trying to cover up with firmware.",
                "author": "Koopa777"
            },
            {
                "raw_content": "Man, ASRock really dug themselves into a hole with this one. Think ill be skipping their products for the foreseeable future.",
                "author": "Cipher-IX"
            },
            {
                "raw_content": "https://www.reddit.com/r/buildapcsales/s/clRF0x4mH3 I got this bundle and im waiting for it to come to my country, which should be around the 20th or so. What kind of voltages should it report on HWInfo?, it's a asus board but i just wanna make sure it's fine.",
                "author": "NeutralGamer881"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Same user loses another Ryzen 7 9800X3D on ASRock motherboard",
        "score": 286,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It’s not inherently user error since it is the board’s doing, but like, why on earth would you see your motherboard blow up your CPU, then get a replacement and plug it into the SAME motherboard??",
                "author": "CMDR_omnicognate"
            },
            {
                "raw_content": "Lightning seems to strike twice 😵‍💫",
                "author": "mrniel007"
            },
            {
                "raw_content": "My 9800X3D has been rock solid on my Asrock X670E Steel Legend for over 9 months. I’m assuming these issues are almost exclusive to the Asrock 800 series chipset mobos? I’ve seen next to no Asrock 600 series mobos reporting these issues.",
                "author": "eXMomoj"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD’s upcoming Ryzen 7 9700F and Ryzen 5 9600F spotted at retailer",
        "score": 81,
        "text_content": "",
        "comments": [
            {
                "raw_content": "future steam console apparently is also going to be using silicon with the iGPU removed. I guess they may have plenty of die salvage stock where the iGPU's don't make the cuttoff mark for their normal SoC (APU) models.",
                "author": "am6502"
            },
            {
                "raw_content": "Nothing beats the goold ol' Aliexpress 7500F for $120",
                "author": "Homewra"
            },
            {
                "raw_content": "I’d like to buy a “G”, please. Preferably with RDNA 3.5 or later.",
                "author": "CatoMulligan"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Epyc 4585PX AM5 Review - Tuning | Benchmark | Productivity and Games",
        "score": 18,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Question for you, if you have time could you post some screenshots of HWInfo64 with the 47K CBR23 benchmark during the run, so you can catch the average All-Core clocks and also the CPU voltage? I have seen a decent amount of 9950X(3Ds) doing \\~240-260W at 1.125V for 5.15GHz I afaik. Can you confirm the avg Idle (everything but say Browser closed?) and then SingleThread (I guess Cinebench R23 Single, or some older games that use 2 threads at most) peak voltage? For reference on my 9800X3D: \\~24.5K score, 5.545GHz via ECLK + PBO (+100PBO, -15 avg UV, and 102ECLK) with 5.4GHz avg allcore needing \\~1.18-1.21v for said clocks at 148W. On my Asus X670E-E, my peak single core boost voltage is 1.25v to 1.31v. with 1.19-1.21v idle desktop (Win10)",
                "author": "HyenaDae"
            },
            {
                "raw_content": "[removed]",
                "author": "None"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "ASUS launches Radeon RX 9070 XT PRIME in white",
        "score": 54,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Cool but a little late in the life cycle to drop this now.",
                "author": "GiddyNinja"
            },
            {
                "raw_content": "Lol. I went full black just because I really wanted to be this model and no other. I wonder if price will be the same tho..",
                "author": "Head_Percentage_546"
            },
            {
                "raw_content": "Msrp: $599 actul price $850",
                "author": "Stereo-Zebra"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Alarming signal proves house prices are poised to PLUMMET, as experts say nationwide crisis is already underway",
        "score": 220,
        "text_content": "",
        "comments": [
            {
                "raw_content": "bro posting a daily mail article lol",
                "author": "Sufficient-Flower775"
            },
            {
                "raw_content": "Am I the only one here who raises an eyebrow when other countries are writing about the US real estate market? Like the daily mail UK, India Times, etc...",
                "author": "HumbleBumble77"
            },
            {
                "raw_content": "Good ole Daily Mail handing out the truth bombs as usual.",
                "author": "rydan"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Taylor Swift ‘tax’ goes mainstream: US states target luxury second homes",
        "score": 142,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Great idea, but the amounts are absolutely pathetic. Only 5K annually on a 2 mil second home?",
                "author": "musluvowls"
            },
            {
                "raw_content": "Good, fuck em.",
                "author": "00001000U"
            },
            {
                "raw_content": "It’s an interesting concept, however my first thought is that it gives incentive to higher earners to buy housing under the value threshold to avoid the tax, further exasperating housing affordability. Just tax their income.",
                "author": "rustyscooter"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Young people locked out of the housing market are turning to the stock market to start building wealth",
        "score": 336,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Look, that is actually a fantastic idea.",
                "author": "GurProfessional9534"
            },
            {
                "raw_content": "Boomers: \"If no one buys my overpriced, outdated shitshack, how can I use my home as my retirement bailout, while leaving the buyer behind as the bagholder?\"",
                "author": "McFatty7"
            },
            {
                "raw_content": "It’s absolutely part of the problem that houses were treated as wealth building strategy in the first place.",
                "author": "Crazyboreddeveloper"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "When will the housing market crash? Economists don't foresee it in 2025",
        "score": 27,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Right after you finally give in and put a down payment on a house",
                "author": "Responsible_Knee7632"
            },
            {
                "raw_content": "It’s hard for markets to really and truly crash when this many people are talking about it, because it prices in that downward pressure. True crashes require irrational exuberance that isn’t met with the level of skepticism that we are seeing commonplace today in the housing market. That doesn’t mean that it can’t correct, but most people I know these days are skeptical of housing growing much past inflation any time soon.",
                "author": "Substantial_River943"
            },
            {
                "raw_content": "2025 is almost over",
                "author": "Hir0Brotagonist"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Dear Miami home sellers, Your home does not appreciate by 100k just because a year went by.",
        "score": 251,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’m house hunting in Seattle area. What I’ve seen is that if a house sold in the pandemic (2020-2021). It’s automatically listed at double the last sold price was. No major updates. I’ve seen 3 homes in the last week where the owners think they’re entitled to $750,000+ appreciation in 4 years. Simply just living there. The norm seems to be sold within 5 years for $6-700k. Now they’re listed for $1.2-$1.5. Also- out agent said most of her buyers are Chinese nationals looking for investment properties to turn into rentals. She was so enthusiastic saying it. Doesn’t understand the overall impact of this whole situation on society. But it’s got great natural light and fresh paint! Agents can be really stupid.",
                "author": "Alarmed-Emergency-72"
            },
            {
                "raw_content": "I know what I have!!!",
                "author": "Express_Jellyfish_28"
            },
            {
                "raw_content": "If people are willing to pay that extra 100k then the market says otherwise.",
                "author": "Jordan_1424"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Housing Wealth Engine Stalls as Prices Slip Behind Inflation",
        "score": 72,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is what happens when people become house poor when they buy homes beyond their means , if house prices stall or go down it has huge financial Repercussions for so many home owners..",
                "author": "Dmoan"
            },
            {
                "raw_content": "Housing normalizing after huge gains, expected.",
                "author": "regaphysics"
            },
            {
                "raw_content": "This sub wont accept this but this is actually the \"crash\" you've been waiting for. Home values rising slower against inflation. Note that this type of correction does not help people locked out of the market today",
                "author": "InThePipe5x5_"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Buying house in Orange County to sell in few years",
        "score": 1,
        "text_content": "Looks like housing market is shifting towards the buyer side these days in OC. Prices are down around 10% and it is a big deal for a prime location like OC. So we started thinking about to buy our first home mainly for investment and the ones we are interested in are in the $1.1M price range (We specifically look in Irvine for good schools and better appreciation). Very happy with current neighborhood and the house we are renting (1200sq ft townhouse, 3.5k) but for diversifying few hundreds of our investments in stocks, and benefiting from tax advantages (marginal tax rates are 35% and 9.3%, as federal and state) buying to sell in few years looks like making sense as an investment. Yes the total cost of buying such a house will be around 7k a month after 20% DP but after deducting the interest and property tax (plus there are few more items that I can deduct after doing itemized return) monthly payments effectively become like a 4-5k a month as far as I see and we can manage that. Selling is not only for selling btw. We may need to move out of state, that’s why I presume we may need to sell it in few years. Renting out is also an option but dunno if that makes sense to manage a rental remotely for the sake of more appreciation and keep paying the extra on top of the rent to cover mortgage. I would love to get your advice on that. Thanks in advance",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Google is now officially calling \"Gemini 2.5 Flash image preview\", \"Nano Banana\"",
        "score": 232,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nano Banana turned out to be a much catchier name.",
                "author": "FakeTunaFromSubway"
            },
            {
                "raw_content": "surprising W by their marketing and/or product teams to capitalize on the virality of the name by adding the codename to the public interface",
                "author": "HunterVacui"
            },
            {
                "raw_content": "Smart move",
                "author": "williamtkelley"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Anthropic’s Jack Clark says AI is not slowing down, thinks “things are pretty well on track” for the powerful AI systems defined in Machines of Loving Grace to be buildable by the end of 2026",
        "score": 458,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's not that I don't believe in lines on a graph, it's just near impossible for me to grasp how we go from today's models to systems exhibiting the qualities described in those bullet points in such a short time. But then again...if the scaling hypothesis is correct, that's what's predicted to happen.",
                "author": "Mindrust"
            },
            {
                "raw_content": "Yeah just like how Dario said in March that we were on track for 90% of code being written by AI in 3-6 months.",
                "author": "orderinthefort"
            },
            {
                "raw_content": "Link to tweet thread: https://x.com/jackclarkSF/status/1962238672704803096 I included the definitions of powerful AI from Dario Amodei’s Machines of Loving Grace essay from October 2024 that is being referenced, as the last screenshot in this post. Link to essay: https://www.darioamodei.com/essay/machines-of-loving-grace",
                "author": "socoolandawesome"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "You don’t work with great people enough if you keep saying AI is going to replace people - Logan",
        "score": 480,
        "text_content": "https://x.com/officiallogank/status/1962538296015269992?s=46",
        "comments": [
            {
                "raw_content": "99% of our work doesn't require \"greatness\" but repititiveness and time",
                "author": "Sierra123x3"
            },
            {
                "raw_content": "what an asshole. no shit most people don’t work with great people; most jobs don’t require greatness and most people aren’t great. a taxi driver didn’t need to be “great”, he just needed to be available and good enough… and once uber came along, no level of “greatness” would’ve saved him anyway. you could be the world’s greatest cashier and still get replaced by a self-checkout stand.",
                "author": "FistLampjaw"
            },
            {
                "raw_content": "If future super intelligent AIs are not better than these great people to replace them then something is genuinely wrong.",
                "author": "Pro_RazE"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Nano Banana is fantastic, but significantly over-hyped. Here's the reality:d",
        "score": 33,
        "text_content": "I work in graphic design and have been using AI image editing as a major part of what I do for a few years now, regularly since Midjourney v 3 came out. I saw the hype posts and videos when Nano Banana came out this past week and expected it to really be groundbreaking - in the ways that the hype posts have been suggesting. Having tested it for several days now, my honest feedback is that it is top of the line at certain tasks - like changing the clothes of characters - but overall the quality & consistency is more or less the same as Midjourney and other top competitors, and the text-to-image editing capabilities are not noticeably better than current ChatGPT capabilities. This is of course just my personal anecdotal experience and opinion, and I have not tested everything it can do. My experience is only based on my own image editing goals, so it may be much more advanced in other ways. Take this review with a grain of salt and test it yourself. The purpose of my feedback is not to trash Nano Banana, but to urge people to view it realistically: it continues pushing the limits of current text-to-image editing, but we are still very far from making Photoshop and human editing unnecessary. I was propelled to test it after seeing this top [post on /r/singularity from earlier in the week](https://www.reddit.com/r/singularity/comments/1n2fxjn/photoshop_is_cooked_nano_bananas_manipulation_is/). When trying out the various examples from that post I found: - the quality of the output significantly breaks down when certain aspects of the input images change from what is shown. For example, if the character is not clearly the central subject of the image, if the background is not solid white, if there is more than one character, if the other reference image has more than one object or more than a solid white background. - the face of the reference character will usually change significantly more than is shown in that post from output to output. - AI artifacts like deformed hands and feet, or physical anomalies (like an arm going both behind & in front of an object) are still very common in outputs and difficult to resolve through further prompting. - texture quality can be very low on solid color surfaces - for example, a grey concrete floor may look pixelated or obviously AI generated. Most of these notes aren't regressions from other models, but continuations of the same issues AI image generator/editors have always had that necessitate human quality control. My overall point is not that Nano Banana is bad or to give it a negative review. I would give it a 5/5 *compared to existing tools*, some of which are also 5/5. My point is only to suggest that the extreme hype of the past few days online (\"Nano Banana is going to destroy Adobe! Photoshop is cooked!\") is just that - hype, probably heavily influenced by Google guerrilla marketing. I do not see any HUGE improvements over other top AI image editing already available, and I definitely don't see enough quality to get rid of Photoshop or not to require human editing as a final step. Every single image that I've produced would require additional tweaks to fix minor errors, and resolution is naturally limited as with other existing tools. The biggest problem I keep running into - one that has me continuing to use other AI tools for the moment - is that almost 50% of the time it will not make any edits whatsoever and it simply gives me back the same original image unchanged. I don't know if this is an issue with Nano Banana's processing or with Gemini's prompt translation. Either way, it is extremely frustrating and time consuming. Half the time it seems the prompted edit will 'short circuit' something and the output is exactly the same as before while Gemini claims the edit was made. When you point out no edit was made, Gemini quickly admits the error and tries again, but cannot seem to correct the mistake, forcing you to try something different. Despite prompt crafting to work around the issue, sometimes I had to simply give up on that particular edit because Gemini/Nano Banana just wouldn't make the edit at all. This seems more common when editing the overall image (like changing the styles, etc) and less when editing a specific object (changing a character's clothing, removing a chair, etc), but there was really no way to tell when it would happen. **TL;DR:** Nano Banana is a fantastic AI image editor, but the online hype of the past few days is overblown. It is not a game changer, and Photoshop is **definitely** not becoming obsolete, but I will confirm Nano Banana is one of the best AI text-to-image editors out there, if not currently the best. Google has some fantastic marketing, and you may have been led to believe that Nano Banana leaves all competitors in the dust. While it's a great tool, it doesn't leave top competitors in the dust. It's roughly on their same level, if perhaps a little better in some ways or a little worse in others. If Google can figure out how to stop it from returning the same original image unchanged half the time, I might choose it as my primary AI editor while still jumping back to others for specific tasks.",
        "comments": [
            {
                "raw_content": "​I think you're judging this tool by the wrong standard. The hype isn't coming from graphic designers thinking it will replace Photoshop; it's coming from the 99% of people who have never used Photoshop and now have a powerful tool at their fingertips. ​For that huge audience, the minor artifacts and texture issues you mentioned are a total non-issue. They don't need a final edit, professional-grade output; they just want to be able to make quick, easy changes with a few words. The one valid point you raised is the 50% failure rate, which is a huge bug that needs to be addressed. ​But the hype is justified not because the tool is perfect, but because it's a game changer for a massive, underserved market. It doesn't have to destroy Adobe to be revolutionary.",
                "author": "npquanh30402"
            },
            {
                "raw_content": "I've tried using it and it is extremely scattershot. It is utterly incapable of doing some of the most basic tasks imagineable but one shots some complex ones. I spent 6 hours trying to get it to change the position of eyes on a character. It could not ever once do it. Restarting new threads, simple prompts, complex prompts, no image reference, a dozen image references, nothing. Moving a few pixels to the left *defeated* and *devastated* this SOTA image tool. The plus side is that image gen is pissing me off so badly with its incompetence that my own artistic skills are improving more than they have in years; I gave up and did that task myself in 3 minutes, and even did the shading well. It bewildered me how a task even a 1st grader could do in MS Paint is beyond an image editor.... But then it one-shots style transfer + pose reference + complex background requests",
                "author": "Yuli-Ban"
            },
            {
                "raw_content": "Yeah i was wondering if i was using it wrong. I used it on my photos, and while it does what i ask it to do, my facial features are significantly worsened. It cannot reproduce my face clearly even with one iteration, and after multiple iterations, it just deteriorates into some random face. Idk if it handles black people’s texture differently, but i am not able to replicate the examples i have been seeing around",
                "author": "entwickle"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "People Are Furious That OpenAI Is Reporting ChatGPT Conversations to Law Enforcement",
        "score": 621,
        "text_content": "[Futurism reports](https://futurism.com/people-furious-openai-reporting-police): Earlier this week, buried in the middle of a [lengthy blog post](https://openai.com/index/helping-people-when-they-need-it-most/) addressing ChatGPT's propensity for [severe mental health harms](https://tech.slashdot.org/story/25/08/29/1116218/a-troubled-man-his-chatbot-and-a-murder-suicide-in-old-greenwich), OpenAI admitted that it's scanning users' conversations and [reporting to police](https://futurism.com/lawsuit-parents-son-suicide-chatgpt) any interactions that a human reviewer deems sufficiently threatening. *\"When we detect users who are planning to harm others, we route their conversations to specialized pipelines where they are reviewed by a small team trained on our usage policies and who are authorized to take action, including banning accounts,\" it wrote. \"If human reviewers determine that a case involves an imminent threat of serious physical harm to others, we may refer it to law enforcement.\"* The announcement raised immediate questions. Don't human moderators judging tone, for instance, undercut the entire premise of an AI system that its creators say can solve broad, complex problems? How is OpenAI even figuring out users' precise locations in order to provide them to emergency responders? How is it protecting against abuse by [so-called swatters](https://www.wired.com/story/purgatory-gores-swatting-us-universities/), who could pretend to be someone else and then make violent threats to ChatGPT in order to get their targets raided by the cops...? The admission also seems to contradict remarks by OpenAI CEO Sam Altman, who [recently called for privacy](https://techcrunch.com/2025/07/25/sam-altman-warns-theres-no-legal-confidentiality-when-using-chatgpt-as-a-therapist/) akin to a \"therapist or a lawyer or a doctor\" for users talking to ChatGPT. *\"Others argued that the AI industry is hastily pushing poorly-understood products to market, using real people as guinea pigs, and adopting increasingly haphazard solutions to real-world problems as they arise...\"* Source: [Slashdot.org](http://Slashdot.org)",
        "comments": [
            {
                "raw_content": "Download open source models and run them locally if you want true privacy.",
                "author": "lolwut778"
            },
            {
                "raw_content": "Not saying this is justified, but I have a pro tip. If there’s something you’re thinking about posting online (or anywhere) and it makes you think “This might get me an uncomfortable conversation with the police.”, don’t post it.",
                "author": "Kaje26"
            },
            {
                "raw_content": "AI is going to enable surveillance beyond anything that has ever been possible in human history. In the past dictators had to choose important targets to spy on, because they didn't have infinite man power. With AI they can spy on every single citizen, every single minute of the day, forever. One might argue that these cases are justified, but the bottom line is that they have the ability and they will use that ability if they can get away with it. We need a counter movement, decentralized internet infrastructure, decentralized money, decentralized models, or the future is going to be scary.",
                "author": "10b0t0mized"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "If aging is solved, then what? Any good fiction examples?",
        "score": 56,
        "text_content": "If AI or whatever helps solve aging. Then what happens? How might society change? I'm also wondering if anyone knows of fictional media that might show realistic views of society post-aging.",
        "comments": [
            {
                "raw_content": "The culture series kinda? If you ignore banks when he says almost everyone chooses to age and die after a few hundred years at least. I’m trying my hand at sketching a different vision of a world, but it may not be very good: [here](https://nanoobot.substack.com/p/full-dive-virtual-reality-41-cultures)",
                "author": "nanoobot"
            },
            {
                "raw_content": "I admit, I havent read it myself but ive heard Scythe is a decent fiction series that touches on it. \"death, disease, and unhappiness have been virtually eliminated due to advances in technology, and a benevolent artificial intelligence known as the Thunderhead peacefully governs a united Earth. The notable exception to the Thunderhead's rule is the Scythedom, a group of humans whose sole purpose is to replicate mortal death in order to keep the population growth in check.\" https://en.m.wikipedia.org/wiki/Scythe_(novel) Altered Carbon is a book/netflix show also lightly touches on it - immortality for those that can afford it. Guy is hired/resurrected to solve a murder. Show is decent, haven't read the book. https://en.m.wikipedia.org/wiki/Altered_Carbon",
                "author": "Sangumancer"
            },
            {
                "raw_content": "Read 'The Post Mortal' by Drew Magary.",
                "author": "TheViking1991"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "15‑Qubit Entanglement Shows Feasibility of Neutral‑Atom Processors",
        "score": 13,
        "text_content": "",
        "comments": [],
        "subreddit": "singularity"
    },
    {
        "post_name": "GPT-5 vs o3 in my Visual Connect 4 Benchmark",
        "score": 34,
        "text_content": "https://i.redd.it/1084hnpy6mmf1.gif https://i.redd.it/pdavhypy6mmf1.gif https://i.redd.it/8wfbn1qy6mmf1.gif Inspired by Kaggle's LLM chess tournament, I decided to create my own LLM visual connect 4 benchmark. Unlike Kaggle's tournament where text representations are used, the LLMs receive an image of the current board state as input (same as shown in the gif but with the the title \"Connect 4 Game Board\". I think Connect 4 is a good benchmark for a several reasons: 1. As shown by the gameplay, the models are still have not achieved peak performance 2. It tests pure visual reasoning unlike stuff like MMMU and CharXiv Reasoning which focus more on OCR and reading graphs 3. It's probably not being targeted by major labs meaning differences in performance are likely reflective of stronger general reasoning abilities 4. It tests models' ability to plan and maintain coherence in a multi-turn setting (kind of like vending bench). Since I was too lazy to configure other company's APIs the only models I've tested for now are o3 and GPT-5 (both on medium reasoning effort). In their ten game match GPT-5 won 7-3 with no draws between the models. Shown above are 3 of the most interesting games. I don't have the code on Github currently, since it was very poorly written and not maintainable. However I plan to do a refactor and upload the code when I have the time.",
        "comments": [
            {
                "raw_content": "it looks random. they don't even know they can win or lose. gpt has wins extremely early on, multiple times in the same games and ignores it.",
                "author": "BriefImplement9843"
            }
        ],
        "subreddit": "singularity"
    }
]