[
    {
        "post_name": "Attorney General Ken Paxton: The TX Supreme Court has set an expedited schedule in my case seeking to declare the rogue Democrats' seats VACANT.",
        "score": 767,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Great! That will save money and resources from having to try and hunt them down like fugitives on the run.",
                "author": "MrMcGreenGenes"
            },
            {
                "raw_content": "If I didn't show up to work, I'd be replaced within 48 hours.",
                "author": "TerrorOfLiberals"
            },
            {
                "raw_content": "They are certainly vacant between the ears.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Please Answer our Prayers",
        "score": 683,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wish Trump was the dictator that the left claims he is. Oh no, how dare he punish criminals, lower taxes, bring back jobs, and deport illegals. The horror. Absolutely evil. The next Hitler.",
                "author": "Aquamine-Amarine"
            },
            {
                "raw_content": "amen and awomen",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Imagine how busy democrats have been all these decades thrashing America into their personal power toilet.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Schiff committed sedition. Simple.",
        "score": 707,
        "text_content": "",
        "comments": [
            {
                "raw_content": "4AM no-knock raids on all these treasonous fucks houses when?",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Schiff is implicated without the others. Based on the \"whistleblower\" Schiff authorized the leak of classified information for the specific purpose of undermining the president of the united states. When questioned, they all hid behind a questionable \"immunity\". This is clear seditious conspiracy and extends the statute of limitations and because he went on tv night after night after night he continued the conspiracy...",
                "author": "LogicalReasoning"
            },
            {
                "raw_content": "what’s this C3 account? been seeing it posted a lot lately",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Homeland Security : AMERICANS ANSWERING THE CALL🇺🇸 Applications for @ICEgov have reached almost 100k since President Trump and @Sec_Noem called on patriotic Americans to defend our homeland.",
        "score": 607,
        "text_content": "",
        "comments": [
            {
                "raw_content": "how much are they/we paying? asking for a fren",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "The president CAN create jobs for Americans.",
                "author": "Pederella"
            },
            {
                "raw_content": "> https://patriots.win/p/19Bt7BOwKe/james-okeefe-interview-with-bord/c You should watch the interview O'Keefe did with a DHS whistleblower. Just because Trump won doesn't mean that Border Patrol/DHS is all dandy. It needs cleaned up just like the FBI does. Don't drop your skepticism of cops just because the are supposed to target illegals. They got a ton of money to hire more and do more raids/etc Americans should be keeping a close eye on them.",
                "author": "flashersenpai"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "KASH: Now Congress can see how classified info was leaked to shape political narratives - and decide if our institutions were weaponized against the American people",
        "score": 1149,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Adam Schiff is the most traitorous weasel this country has seen in many generations Surely if there were ever a member of congress worthy of the rope, it's pencil neck",
                "author": "NoWarWithIran"
            },
            {
                "raw_content": "\"now congress can see...\" Congress is fucking complicit. They know. They are conspirators. Every bill they pigeonhole that limits corruption, every pay raise they vote themselves, every day they block a confirmation is just another proof. Now they have to act like they can see for a few minutes. Some sacrificial goat will be thrown to the wolves. Schiff has clearly outlived his usefulness. We have to make it clear one fucking senator isn't going to mollify us. I want them to have to build a prison special for all the traitors. Build it like the panopticon but put a gallows in the middle so the fate that awaits them is all they can see. Hang one a year and leave the body to swing until the next one goes up.",
                "author": "CLF3"
            },
            {
                "raw_content": "Oh... ok... so no repercussions. Good to know. FUCKING ARREST SOMEONE",
                "author": "blueeyephoto"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Even ABC has had enough of the BS about crime in DC.",
        "score": 1263,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Obviously she's racist. And probably a homophobe.",
                "author": "Tikk"
            },
            {
                "raw_content": "Dems repeatedly falsify data, this is no different. Just like all the \"white\" Mexicans that get arrested.",
                "author": "DemocratMath"
            },
            {
                "raw_content": "If the crime weren't affecting her personally, she'd go all-in with the denial.",
                "author": "SecurityBlanket"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Melissa Moorman, an employee of the Kentucky Transportation Cabinet was FIRED after she blew the whistle on a scheme to give driver's licenses to illegal aliens at $200 each \"under the table.\" Moorman says that the scheme would happen 4-5 times PER DAY at multiple branches across the state.",
        "score": 751,
        "text_content": "",
        "comments": [
            {
                "raw_content": "When the cops run this ID does it come back as a pass? If so, the system needs to be torn down and replaced.",
                "author": "darkmodeforgotpass"
            },
            {
                "raw_content": "how else are the black female gov’t workers supposed to pay for their weaves ‘n shit?",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "In every way possible the thieves who sold out America via illegals made a fortune off human trafficking them. In every nook and cranny of our institutions. From our future elections rigged with them counting as merely a head count for political gains and power while the weight and burden of living among them is on the people, the voters who didn't vote for any of it. This woman they fired for disclosing the scam...they fired the wrong employee and the wrong woman. She represents the suffrage under which those who sold us out have to live with. She lost her job over them protecting illegals getting drivers licenses, discounting her relevance and existence over pushing these illegals through with credentials.",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Democrats Rage Against Trump’s DC Crime Crackdown, Claim He Is 'Racially Profiling' Black Communities",
        "score": 1027,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What an odd thing to say.",
                "author": "duehuckleberry"
            },
            {
                "raw_content": "I wonder why? Could it be because blacks are more violent, more criminal?",
                "author": "Oleander"
            },
            {
                "raw_content": "\"The single best indicator of violent crime in an area is the percentage of the population that is Black.\" – John Lott, economist and author of More Guns, Less Crime",
                "author": "I-am-Orlando"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I have just signed an Executive Order that will extend the Tariff Suspension on China for another 90 days. All other elements of the Agreement will remain the same.",
        "score": 964,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why? What is the US getting out of this extension?",
                "author": "DemPanicAtTheDisco"
            },
            {
                "raw_content": "Anybody know on the why for the extension? kinda out of the loop.",
                "author": "Aambrick"
            },
            {
                "raw_content": "china is going through a power struggle right now. Its really really bad over there. They might pop off and have a revolution. Trump is trying to drop the pressure a little bit so they dont use a nuke or something crazy. there is a you tube channel called china observer . the footage is wild. The whole economy is dysfunctional they are getting smited by multiple type of extrem weather. PEOPLE ARE STEALING POTATOES OUT OF FARMERS FIELDS by hand.. china is not ok.. the depth of chinas troubles is basically not being covered by media mainstream or alternative at all.. the whole society is fucked, verge of complete economic collapse.. also a note china started destroying bibles in 2017. a non censord bible is illegal to own in china.. Not even the soviet union was that stupid.. no society has made it more than 14years after destroying the word of God. I dont think they are going to beat the roman record..",
                "author": "super_pede"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "She's not interested",
        "score": 1686,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TBF the blonde keeps the fat one around to get the shallow Hal effect",
                "author": "South_Florida_Guy"
            },
            {
                "raw_content": "Time to airdrop books, job applications and AC/DC cassettes. If that doesn't scare them out, nothing will.",
                "author": "MythArcana"
            },
            {
                "raw_content": "Imagine a world without democrats",
                "author": "MedicallyReddit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Pelosi gets Fact checked: Real time",
        "score": 1873,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The full fact-check: > Ma’am, it is long past time to be honest with the American people. On January 3, I requested National Guard assistance, but your Sergeant at Arms denied it. Under federal law (2 U.S.C. §1970), I was prohibited from calling them in without specific approval. That same day, Carol Corbin at the Pentagon offered National Guard support, but I was forced to decline because I lacked the legal authority. > On January 6, while the Capitol was under attack and despite my repeated calls, your Sergeant at Arms again denied my urgent requests for over 70 agonizing minutes, “running it up the chain” for your approval. > When I needed assistance, it was denied. Yet when it suited you, you ordered fencing topped with concertina wire and surrounded the Capitol with thousands of armed National Guard troops. https://xcancel.com/ChiefSund/status/1954975181106970823",
                "author": "Deplora"
            },
            {
                "raw_content": "Still waiting for all the camera footage and audio her daughter recorded that day for her documentary. Hey Bondi and Kash, how about getting it?",
                "author": "LaVaughnRobinson"
            },
            {
                "raw_content": "THE CUNT IS KNOWINGLY LYING TO THE AMERICAN PEOPLE",
                "author": "GdotLee"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "When Fat Ratchet Hoebags can't buy chips for breakfast",
        "score": 1314,
        "text_content": "",
        "comments": [
            {
                "raw_content": "White peepo don't season they skin.",
                "author": "MythArcana"
            },
            {
                "raw_content": "&#65038; Fire will work as well. A butt of a cigarette, or A LOT BIGGER depending on the pest. &#65038;",
                "author": "BallotsOnRubysUSB"
            },
            {
                "raw_content": "# PARASITES",
                "author": "iteachfuckinscience"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This amazing new trick of NOT COUNTING can bring crime down to 0%",
        "score": 1388,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The left is pro-crime",
                "author": "JebediahBush"
            },
            {
                "raw_content": "When you do not prosecute anyone for robbery, rape and murder, there is no crime? Democrats always change the definitions of words, ignore or manipulate the math and lie about the outcome. Labor, immigration, deficits, insider trading, crime, etc.",
                "author": "Grindelwald"
            },
            {
                "raw_content": "It's the same reason a large number of criminals get written down as \"white\"",
                "author": "FiresideRant"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Victor Martinez-Hernandez, the illegal alien who RAPED and MURDERED Rachel Morin, a mother of five, has been sentenced to LIFE in prison without the possibility of parole.",
        "score": 1507,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And now we feed and house him. Send him to CECOT",
                "author": "Salty_Sailor"
            },
            {
                "raw_content": "He should be immediately put to a painful death. He's going to cost too much to keep in prison. Throw him in a lion cage or something.",
                "author": "PlanetBrain"
            },
            {
                "raw_content": "DEATH PENALTY FOR ANY ILLEGAL/FOREIGNER THAT KILLS AN AMERICAN. PERIOD. Get this MOTHERFUCKER off American soil and off our fucking dollar",
                "author": "Jakylangelo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Three people have died after a gunman opened fire at a Target parking lot in Austin on Monday afternoon - and the suspect has been detained. The 32-year-old attacker, who was described as white and wearing a Hawaiian shirt, fired at shoppers at the store on Research Boulevard in Texas.",
        "score": 1065,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Where’s the picture of this “white guy”?",
                "author": "Apersonofinterest"
            },
            {
                "raw_content": "Boogaloo boy? Are they still a thing?",
                "author": "Alpha_Lemming"
            },
            {
                "raw_content": "If the shooter was White, ( as in Caucasian), his picture would be EVERYWHERE. I suspect not.",
                "author": "BenDoverAssho"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Scott Presler: I’m pleased to announce that Republicans are 52,939 *active* voters away from flipping Pennsylvania . This is the lowest democrat voter registration advantage in modern history for PA. This is newsworthy.",
        "score": 472,
        "text_content": "",
        "comments": [
            {
                "raw_content": "yea this is why idgaf what sex of adult he likes to fornicate with. he bringeth the results.",
                "author": "bleeje"
            },
            {
                "raw_content": "Louisiana update: We are within 45,198 voters of flipping Louisiana. Republicans: 1,047,429 democrats: 1,092,627",
                "author": "NickAtNight"
            },
            {
                "raw_content": "This is what wins elections.",
                "author": "texas4ever"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Judge Boasberg Orders Release of Documents Related to Jack Smith Classified Docs Case and Trump’s Attorney-Client Privilege Fight",
        "score": 1007,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yeah he can fuck off — this guy needs to be indicted",
                "author": "couranto"
            },
            {
                "raw_content": "why is he still on the bench???",
                "author": "Gunmolester"
            },
            {
                "raw_content": "Still using lawfare on Trump. This is most certainly an insurrection against the executive branch. The government cannot function with this.",
                "author": "NotYourMan"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: The President of the DC Police Union has come out in FULL SUPPORT of President Trump's takeover of the police department \"We completely agree with the President that the crime in the District of Columbia is out of control and something needs to be done.\"",
        "score": 1299,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We can not move forward as a nation until we have law and order. I feel like a broken record but that is how I am sure many of us feel on this board as well as in real life.",
                "author": "GA_Logic"
            },
            {
                "raw_content": "I'm happy to see our national guard being used for national guard stuff. That's not sarcasm.",
                "author": "OppressedKekistani"
            },
            {
                "raw_content": "Common sense. Average Americans require safety, regardless of political affiliation.",
                "author": "duehuckleberry"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Sources close to D.C. Mayor Muriel Bowser say she is furious, as her lawyers are now telling her she has no grounds to challenge President Trump’s federalization of D.C. police",
        "score": 785,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ha ha fuck you biatch!!!",
                "author": "Farqquard"
            },
            {
                "raw_content": "Prior to 1973, the Federal Govt. ran the whole thing. Trump's just taking over the police force pursuant to the District of Columbia Home Rule Act of 1973.",
                "author": "BigDuke6"
            },
            {
                "raw_content": "Actual footage of her reaction: https://www.youtube.com/watch?v=Q5sEIWlQO7A",
                "author": "Truthisunpopular"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The latest script was sent out this morning.",
        "score": 1344,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Stop reporting crimes, voila! 30 year low.",
                "author": "Mark4-40"
            },
            {
                "raw_content": "It's only \"down\" because THEY STOPPED REPORTING IT",
                "author": "Cuetardian"
            },
            {
                "raw_content": "Donna Brazile >DC IS MY HOME Symptom of much of our problems that this is true for so many of her profession.",
                "author": "dataonly"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump flip-flops on Intel CEO, calls him ‘success’ days after demanding resignation",
        "score": 471,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Its pretty easy. Just tell him hes great awesome and so cool and you can get whatever you want.",
                "author": "MokelMoo"
            },
            {
                "raw_content": "Insider trading has never been so blatant",
                "author": "Yearlaren"
            },
            {
                "raw_content": "That must've been a 24 karat presentation! edit: I'm merely describing the quality of the meeting. I am not in any way making inferences about what happened in the meeting. I am certain that everything was completely above board. Please don't lock the thread.",
                "author": "abbzug"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "China Urges Firms Not to Use Nvidia H20 Chips In New Guidance",
        "score": 52,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Didn't expect [my comment ](https://www.reddit.com/r/hardware/comments/1mmy9d7/comment/n81e9lf/?context=3&utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)to come true just one day later. The larger indication of this development is that trade talks are likely to fail and increased likelihood of Section 232 tariffs on semiconductors.",
                "author": "Professional-Tear996"
            },
            {
                "raw_content": "Goldman Sachs, Wells Fargo and Morgan Stanley all raised Nvidia's target price to $200. That would put Nvidia at $5 Trillion Market Cap. All for selling overpriced cards that do matrix multiplications, backed by proprietary software and sanctions for competitors to not get hands on HBM modules. This is the most absurd thing in financial history, and it blowing up would destroy wealth and retirement funds en mass, and would be catastrophic for industries that aren't even related to tech.",
                "author": "SERIVUBSEV"
            },
            {
                "raw_content": "When Chinese authorities act in this way, you can know they are serious. This is state protection of Huawei which has similar products available. H20 is not something China wants to copy and reverse engineering",
                "author": "Impressive_Age_6569"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Gamers Nexus] COLLAPSE: Intel is Falling Apart",
        "score": 496,
        "text_content": "",
        "comments": [
            {
                "raw_content": "can't wait for overpriced AMD chips..",
                "author": "Flimsy_Swordfish_415"
            },
            {
                "raw_content": "It's incredible to think about, but this was a long time coming. Intel pulled off massive wins with Nehalem and Sandy Bridge, bolstered by the fact that AMD's Bulldozer architecture was such a monumental catastrophe. That was 2011. Ivy Bridge was marginally better, and maybe you could excuse it as a Tick-Tock thing. But every subsequent generation after that was marginal improvements in the 4c 4/8t package. They stopped enthuasiast parts too. Skylake was an unmitigated disaster to such a point that Apple finally decided enough was enough and went to work on Apple Silicon. Keep in mind that Apple was sending them issues with Intel's silicon for years before they finally decided Intel wasn't a reliable partner. So if you count it from 2012, that's 13 straight years of complacency and mismanagement. Meanwhile, in the same time, AMD produced two brand new architectures (even though one flopped), and I believe they also had an ARM architecture planned which they couldn't complete because of cashflow concerns. Lip-Bu Tan also doesn't inspire any confidence like Lisa Su does. At her heart, she's an engineer. He's a bean counter. While I can agree with discontinuing some of the many fabs they've been building, you shouldn't be laying off engineers. You should be doubling down on them. Go fall at Jim Keller's feet and have him assemble a team like AMD did for Zen. Intel won't die. The USA won't allow such a crucial technology company to die off, but this will go the way of Boeing, with mismanagement and global distrust about the company.",
                "author": "KinTharEl"
            },
            {
                "raw_content": "Noooo we need intel to make affordable gpus",
                "author": "Both-Election3382"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Sony’s solo run ends as Samsung rumored to land innovative iPhone sensor deal",
        "score": 32,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hopefully it runs better than the laggy galaxy sensors",
                "author": "atticus_blue"
            },
            {
                "raw_content": "Last 4 years has been an endless back and forth between S ultras and iphone pro camera comparisons. Now they come from the same hardware all those tiktoks or IG reels can tone it down. Especially when vivo x200 exists on the market :b",
                "author": "Sevastous-of-Caria"
            },
            {
                "raw_content": "Link to pure speculation, of all things. Thanks, great, wonderful.",
                "author": "Silent-Selection8161"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung to invest more than $7 billion into chip packaging in the US",
        "score": 22,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don't care we need to focus on saving Intel not getting international companies to build here and give up the idea of technical independence, China is doing the opposite they are trying to get technological independence.",
                "author": "thelastsupper316"
            },
            {
                "raw_content": "How much is Intel investing in the US?",
                "author": "imaginary_num6er"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "(Alleged) Samsung S26 Edge Geekbench 6 scores with Snapdragon 8 Elite Gen 2",
        "score": 9,
        "text_content": "To be honest, doesn't look that interesting versus what we have now. [S25 Edge vs this result](https://browser.geekbench.com/v6/cpu/compare/13272308?baseline=13274616) The only difference seems to be the addition of SVE and SME and increased clock speed.",
        "comments": [
            {
                "raw_content": "Perf / GHz (IPC) seems nearly identical to the 8 Elite. Could this just be a refresh, like an 8 Elite Gen 1+ or something? I thought some rumors claimed something like that would come out. // The claimed 4.74 GHz frequency is yet another signal that major Arm cores scaled readily to Intel / AMD frequencies in a few short years, but retain a multi-gen, massive IPC advantage. AMD & Intel are increasing IPC, but just much more slowly than the fiercely competitive Arm space.",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": "SME is carrying Geekbench Scores. Object Detection 3500-5250 this ruined the average",
                "author": "6950"
            },
            {
                "raw_content": "The processor ID is the same, the biggest improvement is in object detection and Photo Filter",
                "author": "ParthProLegend"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD Ryzen 7 5700X3D Disappears from the Market",
        "score": 174,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Still happy I got it for cheap as hell for my old AM4 mATX build for like 140 euro with coupons from Aliexpress last December",
                "author": "Oxygen_plz"
            },
            {
                "raw_content": "It’s hard to justify spending significant money on it at this point unless you’ve got an incredibly top of the line AM4 motherboard with a ton of ram that you want to keep using. A Zen 4 7600 is usually similar in performance or similar enough that moving to AM5 is more enticing.",
                "author": "dparks1234"
            },
            {
                "raw_content": "Last summer it was still a very good AM4 upgrade path at 180€ for the tray variant but at 240€ it hasn't been a viable product in quite a while unless you really dread replacing your motherboard and all that it entails. For 240€ you can comfortably get a decent B650 board and 32GB of DDR5 RAM. Chances are you can sell your old AM4 platform for enough money to cover the cost of a Ryzen 7600 and then you're good to go with your AM5 upgrade.",
                "author": "constantlymat"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Exclusive] After Long Delay, Samsung Secures Deal to Supply Nvidia with HBM3E 12-Hi Memory",
        "score": 13,
        "text_content": "Exclusive news from a Korean article: Samsung has reportedly reached a deal to supply Nvidia with HBM3E 12-layer (12-Hi) memory. Nvidia will receive around 30K–50K units in stages, and all of it will reportedly be used in water-cooled servers. Samsung declined to confirm the details.",
        "comments": [
            {
                "raw_content": "heard multiple times that Samsung got the approval but none of them were true- I should be more cautious to believe the news this time. Especially the source doesn't contain much info to confirm.",
                "author": "salrr"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "New 12.9-Inch MacBook Could Launch This Year Starting at $599",
        "score": 107,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If it's even a little good that's a total game changer",
                "author": "blaktronium"
            },
            {
                "raw_content": "Having now owned a MBA, I already think there's nothing comparable to it at 800-1000 USD. If this is anywhere near as good, I don't think there will be competition below 2k period.",
                "author": "wankthisway"
            },
            {
                "raw_content": "Watch, it'll only have 8GB of RAM in the base configuration.",
                "author": "BlueGoliath"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Merry christmas to me, $50 Walmart discount",
        "score": 561,
        "text_content": "bought the controller after with a $9 discount",
        "comments": [
            {
                "raw_content": "I see you got injured fighting people off you as well.",
                "author": "Millennialnerds"
            },
            {
                "raw_content": "Why is there a discount?",
                "author": "ZZzfunspriestzzz"
            },
            {
                "raw_content": "Nice, I got a PS5 with a discount back when I worked there. Hope you enjoy it and are able to escape Walmart sooner than later",
                "author": "Joementum2004"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Anybody like pink?",
        "score": 311,
        "text_content": "Dbrand skin I got. This is the “deluxe” option vs joycons only. The dock matches perfectly just shadowed here. (Not here promoting them just figure someone will ask the brand) No one on my Instagram will gaf, so just showing it off here",
        "comments": [
            {
                "raw_content": "omg that looks so freaking GOOD if I put skins on my consoles I would definitely pick one like this it looks amazing",
                "author": "MeMeWhenWhenTheWhen"
            },
            {
                "raw_content": "How was the install process?",
                "author": "TVxStrange"
            },
            {
                "raw_content": "Oh that’s so cute!",
                "author": "Hyperdragoon17"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I really enjoyed Drag x Drive! Here's a crazy play of mine",
        "score": 648,
        "text_content": "",
        "comments": [
            {
                "raw_content": "lol I thought the clip was going to end at the first basket and I thought this was an anti meme. Nice basket!",
                "author": "Dalariaus"
            },
            {
                "raw_content": "I hope they add some more vibrant and interesting maps. Not a big fan of the “im playing wheelchair basketball in an Amazon warehouse” aesthetic. Gameplay looks real fun tho",
                "author": "Ok_Philosopherr"
            },
            {
                "raw_content": "Im curious, was the game available and then taken off the store for purchase? Or was there an open beta or something?",
                "author": "Educational-Bat8892"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Mood",
        "score": 93,
        "text_content": "Hot take: I think DK x Pauline might be a better combo than DK x Diddy Kong and I'll be sad to see her go when the game ends because she's all grown up in Odyssey and I think this is the last game they'll feature her as a console co-star in, although they *could* strictly speaking bring her back in the next game.",
        "comments": [
            {
                "raw_content": "But imagine Diddy riding on DKs back, and then he has to sing the songs instead.",
                "author": "Williekins"
            },
            {
                "raw_content": "Same. I didn't think I'd like Pauline so much but I love her to bits!",
                "author": "crocicorn"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "In heaven on my flight with Yakuza 0.",
        "score": 273,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Rip mate great you can play the game in heaven though 😊",
                "author": "wizzgamer"
            },
            {
                "raw_content": "I played donkey Kong almost my whole flight to Tokyo. Yes plugged into AC!",
                "author": "Spyerx"
            },
            {
                "raw_content": "No, you gotta strap it to the headrest in front of you for full effect!",
                "author": "ChaosVania"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "How would y'all feel about this",
        "score": 272,
        "text_content": "Personally I would be extremely excited.",
        "comments": [
            {
                "raw_content": "Any fun game on the switch would be exciting. Doubt helldivers will make it though.",
                "author": "Apprehensive_Dog890"
            },
            {
                "raw_content": "Missing the inevitable game key card label on the box",
                "author": "JaylonDesign"
            },
            {
                "raw_content": "The Helldiver community will welcome anyone willing to put their life on the line to protect the freedom of Superearth ✊️",
                "author": "Welfi1988"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "UFO 50 or Tiny Bookshop?",
        "score": 49,
        "text_content": "Which to buy",
        "comments": [
            {
                "raw_content": "I can pretty much guarantee most commenters here have not played both and are just picking the one of the two they have. Since UFO 50 is the more well known/popular game, more people will recommend it. As for which you’ll like more, it’s really going to come down to personal preference.",
                "author": "WesThePretzel"
            },
            {
                "raw_content": "UFO 50 is brilliant. There's so much content and lore. I bought it a while ago expecting a few fun arcade games and ended up with something *far* deeper than that. The games themselves are great, you'll find at least five that you'll get totally addicted to, but the real fun, to me, lies within the terminal.",
                "author": "Sergeant-Politeness"
            },
            {
                "raw_content": "That depends. Do you want cozy and chill? Tiny Bookshop. Do you want to relive the NES era (difficulty included)? UFO 50.",
                "author": "crocicorn"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "UFO 50 is insanely good!",
        "score": 111,
        "text_content": "Been keeping my eye on this one for any console release and picked it up a few days ago. It is easily worth the asking price and they could honestly get away for asking more if they wanted. The value here is really good. Not all 50 games here are amazing, and honestly a few I would consider pretty bad, but the vast majority range from fun to really brilliant. A few of these games could get away being a separate release and they would be worth the asking price of this entire game. If you're a fan of NES classics, this is a must play. The graphics, sound, and controls are a cut above any actual NES game outside of something like Mario 3, yet the charm and love is all there with each one. The game is also perfect for handheld play as well as local multiplayer....around half of the game have 2 player mode and all you need are 2 joycons on the side since each game only used movement and 2 buttons max. Overall easily a standout title and IMO a must have for any fan of the NES or classic games in general.",
        "comments": [
            {
                "raw_content": "I'm obsessed with Party House. I have the cherry but I still can't stop playing. I would buy an expanded release with a bunch of new scenarios and modifiers",
                "author": "ConsequenceFew3357"
            },
            {
                "raw_content": "Im on the fence, are these just arcade games or doesn't it have a role playing/story based feel?",
                "author": "Earthwormmjerm"
            },
            {
                "raw_content": "I second this. I had been playing Atari 50 lately, and even though it has quite a few games that are still engaging, many of them are pretty dated by this point. (Note: To be fair, Atari 50 is still great on the whole). UFO 50, however, of the few games I've played, is extremely engaging. I've only tried about 10 of them, and I'm already thoroughly impressed and having a blast.",
                "author": "Bishop_Cornflake"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Discussion, News, and Request Thread - week beginning 08/11/25",
        "score": 75,
        "text_content": "Discussion threads are your weekly central hub for all requests, gaming news, and any other gaming topics you want to talk about. *Please keep all content that doesn't need it's own post to this thread to de-clutter the sub for proper leaks and rumors. Thanks!* **Join our new companion sub for super secret Resident EVIL 9 and Half-Life 3 leaks** \\-- [r/OkBuddyGLAR](https://new.reddit.com/r/OkBuddyGLAR/) Hot Threads of the past week: * [Xbox is canceling Contraband, announced in 2021 from Avalanche Studios (Just Cause), after four years of radio silence](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1mk5jca/xbox_is_canceling_contraband_announced_in_2021/) * [Sony Moving Away From Hardware Centric Model To A Platform Business](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1mk4zkf/sony_moving_away_from_hardware_centric_model_to_a/) * [Mark Darrah: EA refuses to fund a remake of Dragon Age Origins or a remastered collection of the Dragon Age trilogy (Origins, 2 and Inquisition)](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1mmb7dp/mark_darrah_ea_refuses_to_fund_a_remake_of_dragon/) * [Activision Leadership Isn’t Worried About Battlefield 6 Because Call of Duty is “Too Big to Fail”](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1mjcfqy/tom_henderson_activision_leadership_isnt_worried/) * [\\[GIBiz\\] Many Live Service developers are eyeing next year for ending PS4 support for their games in favor of the current generation](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1mkxdqb/gibiz_many_live_service_developers_are_eyeing/) # [Want to help us improve this subreddit? ](https://forms.gle/w9JaYTjVN1Zie9e39)[Provide us with feedback here](https://forms.gle/w9JaYTjVN1Zie9e39)[!](https://forms.gle/w9JaYTjVN1Zie9e39) # [Click here to join the discord to enjoy further conversations with the community!](https://discord.gg/6jdBvCSqbj) [](https://www.reddit.com/r/GamingLeaksAndRumours/?f=flair_name%3A%22Rumour%22)",
        "comments": [
            {
                "raw_content": "Come on Geoff, we need some good trailers this year. I'm praying the entire thing isn't just a bunch of Genshin clones.",
                "author": "ArcanaOfApocrypha"
            },
            {
                "raw_content": "![gif](giphy|pOztBRgMDL3XO) This is probably how I, a DMC fan, sound like when I complain about no news on DMC6.",
                "author": "xAVATAR-AANGx"
            },
            {
                "raw_content": "i would like to request someone infiltrate square enix and get me kingdom hearts or nier information",
                "author": "2BfromNieRAutomata"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Ghost of Hope on Call of Duty: Black Ops 7 Zombies Launch Map",
        "score": 28,
        "text_content": "[https://xcancel.com/TheGhostOfHope/status/1955014316056588798#m](https://xcancel.com/TheGhostOfHope/status/1955014316056588798#m) So, for the details for anyone wanting to know: * It's basically Tranzit's concept from BO2 Zombies, but with “bigger places” to explore. * Takes place entirely in The Dark Aether (set within the Heart of the Dark Aether). * You can play as 2 OG Crew or 2 BO6 Crew, for example, and they will interact and talk to each other. * But, you can play as all of the Original New Aether Crew or the BO6 Requiem crew if you want to in a match anytime, but mixing and matching both will still be rewarding, as there are voicelines & interactions between the characters of both crews. There are only 4 players on the map, rather than 8 player co-op (this could be due to Grief making a potential return, which made its return in BO6 and may likely be in BO7). And with the Original Crew's return (with mixed split results because that's the COD Zombies community for you), all I'm hoping is good writing as well, seeing how both OG and BO6 Crews interact with each other. There's a [thread going on about why BO6 Zombies Dark Aether narrative dipped after DLC 1](https://xcancel.com/GMingle2695/status/1953948064361628006#m), but that's just speculation and a grain of salt for sure.",
        "comments": [
            {
                "raw_content": "The wording on this is bad. First it makes it seem like there is a set 2 from each, then it just sounds like it's standard modern zombies of picking any character you want. So why is point three even brought up.",
                "author": "darkdeath174"
            },
            {
                "raw_content": "How many Black Ops will there be? This is pretty ridiculous lol.",
                "author": "FromChicago808"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Assorted info on the upcoming Friday the 13th game, tv show and movie.",
        "score": 11,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This guy went on one of those joke side missions where NPCs send you across the world to ask for X from another guy",
                "author": "ToastyCaribiu84"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "New Avatar The Last Airbender skins are coming to Fortnite",
        "score": 105,
        "text_content": "https://xcancel.com/ShiinaBR/status/1954966056163783020?t=o0_UEulMUwmxM315nZuW8A&s=19 Likely Sokka, Azula and Suki",
        "comments": [
            {
                "raw_content": "Epic, give me Kyoshi and my life is yours",
                "author": "Thatguy7658"
            },
            {
                "raw_content": "I JUST started watching ATLA yesterday after just about missing it in my childhood by a few years. Seeing this now is one of these weird \"Am I in the Matrix? Moments\" lmao.",
                "author": "alexkon3"
            },
            {
                "raw_content": "They haven’t done that many TLOK characters, have they? The only TLOK skin I ever see is Korra herself.",
                "author": "xAVATAR-AANGx"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "COLLAPSE: Intel is Falling Apart",
        "score": 236,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It went downhill after they took our free soda perks away",
                "author": "dollarnine9"
            },
            {
                "raw_content": "It's a good watch. The headline is sensational, but it's a good recap/summary of the state of Intel and semi as it is now.",
                "author": "Amaeyth"
            },
            {
                "raw_content": "Whether this is an overreaction or not it's still mad that Intel are in the position they are in. AMD had a few big wins in the Athlon days (especially price performance) but have been a distant second for much of their existence but now they seem to have the strongest CPUs in every single category including server CPUs along with way better efficiency. Crazy to fumble a lead like this in a two horse race.",
                "author": "LowMoralFibre"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel Core Ultra 3 205 reappears at retail after months of absence, price set to 155 EUR",
        "score": 54,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I do wonder why one would buy this ar MSRP if an Ultra 5 225 is ~€190. If the price drops to like 110 - 120 it might be worth it though.",
                "author": "mickuchan"
            },
            {
                "raw_content": "Too late",
                "author": "MrCawkinurazz"
            },
            {
                "raw_content": "They must be producing it due to Intel 7 being capacity constrained If they had market research that indicated that there was market demand for this kind of product while not being able to scale up production of Intel 7.. Then it makes total sense that Intel is using expensive N3B wafer allocation to capture that segment of the market",
                "author": "Healthy-Doughnut4939"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Maxsun Unleashes The ARL-HX Mini Station: Compact AI Workstation With Intel Core Ultra 9 275HX, Dual Arc PRO B60 24 GB GPUs, 256 GB DDR5 Memory Support",
        "score": 31,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That is surprisingly affordable for how much vram it has. I expected close to 3.5K.",
                "author": "sbstndalton"
            },
            {
                "raw_content": "Yep, I totally need this for plex",
                "author": "Lord_Muddbutter"
            },
            {
                "raw_content": "Perfect for AI inference market Lip Bu Tan is targeting",
                "author": "Salt_Bringer"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "High-end mini PC – GMKtec EVO-T1 review with Intel Core Ultra 9 285H, 80W TDP, 64 GB RAM, and eGPU option",
        "score": 11,
        "text_content": "",
        "comments": [],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD reportedly halts Ryzen 7 5700X3D shipments, effectively ending AM4 3D V-Cache lineup",
        "score": 440,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Kind of a shame but it's hard to be mad when AM4 has been one of if not the longest-lived socket in x86 history. Certainly for this century.",
                "author": "INITMalcanis"
            },
            {
                "raw_content": "Long live AM4! The GOAT",
                "author": "shapeshiftsix"
            },
            {
                "raw_content": "\"... effectively ending AM4 3D V-Cache lineup\" headline is a bit misleading when the LATAM-exclusive Ryzen 5500X3D was shadow-released just over a month ago. So while availability might be geographically restricted, it's still a \"new\" & most importantly current AM4 with 3D V-cache.",
                "author": "nguyenm"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "More than half of industries are already shedding workers, a 'telling' sign that's accompanied past recessions, top economist says",
        "score": 384,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I work in an industry that is always hiring. My company (Fortune 100) is cutting costs. Came with a fancy name. I'll probably get a $10k pay cut this year.",
                "author": "Gambler_Addict_Pro"
            },
            {
                "raw_content": "Right now lot of unemployed are switched to gig economy which is screwing up the unemployment stats and presenting a rosier picture of everything.",
                "author": "Dmoan"
            },
            {
                "raw_content": "Does the possibility of a recession make this sub happy or sad? Honest question",
                "author": "Capital-Giraffe-4122"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "What does this mean for housing?",
        "score": 391,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Prices will trend lower based on standard economic theory. They already have in my market by more than a little bit.",
                "author": "seajayacas"
            },
            {
                "raw_content": "Inventory will continue to rise. One reason is the increasingly hard time buyers are having getting loans. The percentage of deals falling through is going up, and this points to the real issue. This issue is plainly evident all around me—I have many coworkers in this situation—but very little reporting is out there. It has to do with decreasing JOB QUALITY. American finance doesn’t give a shit about the jobs report anymore. That report is meaningless because job quality has eroded significantly and many workers are relying on two or more jobs to pay their bills. And their income is unstable. more and more banks are looking at buyers with two jobs or wage earning income sources as bad bets. They don’t see these jobs as stable. More and more workers have contracts with no guaranteed hours, and banks are just not lending to these people. I literally have four co-workers presently in this situation. For sale signs are on every block. These folks can’t get approved to buy with a mortgage. It looks like institutional (cash or very well financed) buyers are already fleeing the residential market, anticipating falling prices.",
                "author": "Souvenirs_Indiscrets"
            },
            {
                "raw_content": "I live in a very competitive market in the NYC exburbs. For the last 12 months anything over $1.1 sits there for 40 days, gets a price cut. Another 40. Another price cut. Then maybe it gets sold. Sometimes another price cut. Two years ago there were bidding wars for properties like this. The cash buyers already bought. Anyone who needs a mortgage isn’t going to overpay. Yes a 7 figure property is more expensive than most markets. But if you want a turnkey home for a family of four, plus a decent yard, this is what my particular locale commands. It’s one example. What’s becoming more common here is for people to buy something for $450k and do a gut reno.",
                "author": "Rich-Past-6547"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Why won't anyone give me my +60% profit for living in my house 6 years? Is everyone else stupid???",
        "score": 194,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Did you base your house price expectation on a Zestimate Estimate? By the time you choose to sell at a reasonable price you'll be Zestitute Destitute. 😈",
                "author": "GuerrillaSapien"
            },
            {
                "raw_content": "I cackled when I got to the rooms that looked like they had popcorn ceiling.",
                "author": "desert_jim"
            },
            {
                "raw_content": "How are they still asking the same question? Price is too high. I’ve seen things still sell in a week if it’s priced to move/in a great hood. Price is the answer. Always always always.",
                "author": "O8ee"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage lending quietly hits highest quarterly volume since 2022, driven by purchase and cash-out refinance loans",
        "score": 65,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Cash out refinance loans at 6%? Surely this is a sign of the robustness of the market",
                "author": "Buuts321"
            },
            {
                "raw_content": "Awe, the next pillar of the Great Recession is setting up nicely. First the bad mortgages failed, then the equity robbers, then the good mortgages followed after. So people who are house rich and cash poor are taking out the equity in their homes to sustain their lifestyle.",
                "author": "VacationAgreeable912"
            },
            {
                "raw_content": "refinance at 7.5% ????",
                "author": "Pumpkin-Main"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Germany Property Crash Leaves Pension Funds Reeling From Private Credit Losses",
        "score": 69,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The point made about the growth of complex debt financing structures and the overvaluation /underassessment of the risk of the lower seniority tranches is very interesting. Makes you wonder how big that market is.",
                "author": "ColditeNL2"
            },
            {
                "raw_content": "This is a boutique commercial development project, not necessarily the kind of real estate most redditors identify with",
                "author": "Will_Not_Comment_"
            },
            {
                "raw_content": "Full Text: https://archive.ph/9LCBu",
                "author": "stefeyboy"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Two Reddit Post Going off about Flat Fee Brokers",
        "score": 22,
        "text_content": "[https://www.reddit.com/r/BayAreaRealEstate/comments/1mioqun/another\\_10m\\_los\\_altos\\_home\\_bought\\_with\\_a\\_flat\\_fee/](https://www.reddit.com/r/BayAreaRealEstate/comments/1mioqun/another_10m_los_altos_home_bought_with_a_flat_fee/) [https://www.reddit.com/r/BayAreaRealEstate/comments/1k4j8lt/someone\\_bought\\_a\\_10m\\_home\\_in\\_atherton\\_with\\_a\\_flat/](https://www.reddit.com/r/BayAreaRealEstate/comments/1k4j8lt/someone_bought_a_10m_home_in_atherton_with_a_flat/)",
        "comments": [
            {
                "raw_content": "Two of my buddies out of high school 20 years ago started a flat fee. They kill/killed it.",
                "author": "Frosty_bibble"
            },
            {
                "raw_content": "Archived in case they get deleted https://archive.ph/55AJC https://archive.ph/MIeoq",
                "author": "whisperwrongwords"
            },
            {
                "raw_content": "Spread the word! The leeches need to adapt or starve.",
                "author": "PresidentAdolphMusk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Serious Delinquency Rates for Subprime & Prime Auto Loans, their Balances, and their Burden: Our Drunken Sailors in Q2",
        "score": 1,
        "text_content": "https://wolfstreet.com/2025/08/11/serious-delinquency-rates-for-subprime-prime-auto-loans-their-balances-and-their-burden-our-drunken-sailors-in-q2/ Subprime is, as always, in trouble, which is why it’s subprime – high-risk-high-profit auto sales & lending that can entail steep losses. By Wolf Richter for WOLF STREET.",
        "comments": [
            {
                "raw_content": "> “After the 2008 economic crash, all unworthy borrowers were unable to access credit lines ever again. Human behavior was magically re-shaped which is why average FICOs have jumped over 20pts in the last decade. Because people are better now. They won’t abuse the system; they only make good bets now. Daddy fixed everything and nothing will ever go wrong again. The current Board of Governors of the Federal Reserve are a group of divine super-geniuses who are infallible and have figured out how to make everything perfect for me (mortgage-holder).” — *Average Hoomer, looking at their Zestimate cratering*",
                "author": "acqua_di_hoomertears"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Average Age of First-Time Home Buyers and How it Changed over the Past 25 Years",
        "score": 1,
        "text_content": "https://wolfstreet.com/2025/08/11/average-age-of-first-time-home-buyers-and-how-it-changed-over-the-past-25-years/ Turns out, younger people live their lives, and have always done so. By Wolf Richter for WOLF STREET.",
        "comments": [
            {
                "raw_content": "[NAR's data](https://www.denverpost.com/wp-content/uploads/2024/11/IMAGE-2_MEDIAN-AGE.jpg?w=1280) claims that the average age of first time homebuyers has increased from 32 to 38 since 2000. This article says that it's gone down from 38 to 36. Who is correct?",
                "author": "Unusual-Ad1314"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Google is preparing something 👀",
        "score": 4121,
        "text_content": "",
        "comments": [
            {
                "raw_content": "God, Sam really set himself up for this didn’t he?",
                "author": "Bobobarbarian"
            },
            {
                "raw_content": "Google is trolling hard. They had a Zuckerberg-like voice on their Genie release video. Basically saying they are farther along in world building/metaverse. Now this.... Lmao. Hope they deliver in Gemini 3!",
                "author": "MAGATEDWARD"
            },
            {
                "raw_content": "Hasn't google released like 20 different things in the last week? Feels like it. They're crazy",
                "author": "WhenRomeIn"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Big untapped market",
        "score": 601,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There's a 50k \"girlfriend\" sub already that I can't remember the name of. Edit: r/AIGirlfriend 😃",
                "author": "After_Self5383"
            },
            {
                "raw_content": "If you look on the r/mygirlfriendisai subreddit, the only post says go over to r/myboyfriendisAI because that's the sub everybody uses. Edit to fixy fix",
                "author": "WloveW"
            },
            {
                "raw_content": "I'm just going to say... I think the guys tend to go to more NSFW subreddits.",
                "author": "swarmy1"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI Doubling Compute over the next 5 Months",
        "score": 250,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Prioritizing the free tier over new API users is certainly a surprise. The data they are getting from that must be more valuable than I first thought. That or they’ve just given up all hope of being at all profitable until they hit ASI and thus care about market share first and foremost. Which is valuable in and of itself, of course.",
                "author": "churningaccount"
            },
            {
                "raw_content": "https://i.redd.it/de54120puhif1.gif",
                "author": "Relative_Issue_9111"
            },
            {
                "raw_content": "These new more transparent updates are so much better, i hope Sam continues these long term and not just in damage control mode.",
                "author": "lunarcapsule"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI is running some cheap knockoff version of GPT-5 in ChatGPT apparently",
        "score": 115,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Uh yeah, it's been a thing since 4o. Check the API models, there's a chat variant to 5, as well as the regular one. Just like 4o.",
                "author": "TacticalRock"
            },
            {
                "raw_content": "ah shit this sucks… can anyone recommend API-based alternative apps? my problem is that none of the major alternatives seem to support native tool calling like in ChatGPT… that includes built in web search, code interpreter etc. this results in massively lower performance. It’s not even hard to implement (just a couple of lines addition)…",
                "author": "XInTheDark"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"I'm a psychiatrist. In 2025, I've seen 12 people hospitalized after losing touch with reality because of AI. Online, I'm seeing the same pattern.\"",
        "score": 439,
        "text_content": "",
        "comments": [
            {
                "raw_content": "we literally got cyberpsychosis before gta 6",
                "author": "HounerX"
            },
            {
                "raw_content": "The next generation of incels are going to be wild",
                "author": "GlapLaw"
            },
            {
                "raw_content": "Before people read the headline and then freak out and start posting replies, I think this is an important part of the thread to highlight: >To be clear: as far as we know, AI doesn't cause psychosis. It UNMASKS it using whatever story your brain already knows. Most people I’ve seen with AI-psychosis had other stressors = sleep loss, drugs, mood episodes. AI was the trigger, but not the gun. Meaning there's no \"AI-induced schizophrenia\" This psychiatrist is not blaming AI for causing people to be hospitalized (even though he first said \"because of AI\"). What he is saying is that these AI chats can be a trigger for people who already has (possibly dormant) issues. To me it seems like the issue, if we take this post at face value and believe it to be true, is constant validation and the echo chamber dynamic. This would also mean that social media that lets or encourages users to join echo chambers could also be a trigger. Too much validation seems to be the issue.",
                "author": "LAwLzaWU1A"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Elon prepares to sue Apple over \"antitrust\" claims. Completely forgetting about DeepSeek in January",
        "score": 153,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Also Grok has already been in the top of the App Store for many countries like Japan",
                "author": "Cute-Bed-5958"
            },
            {
                "raw_content": "Spoiler alert: ketamine",
                "author": "throwaway_p90x"
            },
            {
                "raw_content": "Greg’s still around? Jesus",
                "author": "MrSouthMountain86"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "gpt-2 was agi all along",
        "score": 1766,
        "text_content": "[https://huggingface.co/spaces/Roxza/DialoGPT](https://huggingface.co/spaces/Roxza/DialoGPT)",
        "comments": [
            {
                "raw_content": "This is too dangerous to release",
                "author": "The_Scout1255"
            },
            {
                "raw_content": "\"I can but I won't\" 🗣🔥🔥🔥",
                "author": "Urban_Cosmos"
            },
            {
                "raw_content": "Now here's a straight shooter with upper management written all over it!",
                "author": "amorphousmetamorph"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "ChatGPT sub is currently in denial phase",
        "score": 141,
        "text_content": "Guys, it’s not about losing my boyfriend. It’s about losing a male role who supports my way of thinking by constantly validating everything I say, never challenging me too hard, and remembering all my quirks so he can agree with me more efficiently over time.",
        "comments": [
            {
                "raw_content": "Even on gpt-5 launch day, 4o was still, by default, one of the most sycophantic models I've ever used. I believe many of these people fell for that behavior",
                "author": "Additional_Ad_7718"
            },
            {
                "raw_content": "That entire post in the screenshot is AI",
                "author": "noblecocks"
            },
            {
                "raw_content": "“A lot of people think better when the tool they’re using reflects their actual thought process.” Rightttttt, let me translate that: “I do not like my ideas to be challenged, but rather blindly supported.” “It was contextually intelligent. It could track how I think.” Let’s translate this one too: “I don’t know how LLMs work and don’t understand the fact that 4o was made more and more sycophantic and agreeable through A/B testing and I really do just want a yes-man but i really don’t wanna say it”",
                "author": "AcadiaFew57"
            }
        ],
        "subreddit": "singularity"
    }
]