[
    {
        "post_name": "WOW!!! Such an! honor. Record “stuff” for a Republican. President DJT",
        "score": 922,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No fucking way...I love our based black patriots but really when it comes to overall blacks???? If true, this is amazing",
                "author": "possibletower"
            },
            {
                "raw_content": "# 13% of Blacks voted for Trump in 2024 up from 8% in 2016. # 46% of Hispanics voted for Trump in 2024 up from 28% in 2016. # 39% of Asians voted for Trump in 2024 up from 27% in 2016. # 54% of Other Non-Whites voted for Trump in 2024 up from 36% in 2016. # All according to CNN Exit Polls.",
                "author": "tpactionchasethevote"
            },
            {
                "raw_content": "I can almost believe this. If you look back to my very first post, where I explain how I was only a year out of prison voting for the first time. I watched the 2016 election in lock up here in Florida. Prison, not jail. The black dudes loved Trump. Remember all the rap songs that would glorify him. And everyone turned on him. Just like they experienced in their own lives. At least half thought he was gangsta as fuck.",
                "author": "One-Man_Riot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "SHUT IT DOWN",
        "score": 885,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# Now do Republicans and israel.",
                "author": "Orlando_Doom"
            },
            {
                "raw_content": "For every illegal alien you see on the street you get 1 stolen dwelling, 1 stolen vehicle, 1 stolen job, 1 stolen ER bed, 1 stolen chance at learning, stolen hopes, trash, graffiti, and the full spectrum of crime",
                "author": "DonnieRamesJio"
            },
            {
                "raw_content": "Shut it down and then gut 80% of it.",
                "author": "GallowsTime"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Guess who's driving ~ 3 guesses...",
        "score": 706,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I only need one. Pajeet.",
                "author": "GunsWithGooglyEyes"
            },
            {
                "raw_content": "Deport kebab",
                "author": "27Sandino"
            },
            {
                "raw_content": "Third world shitholer",
                "author": "South_Florida_Guy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Goodnight Pedes",
        "score": 633,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Thomas Kinpede's *unimpressed forest animals under the campfire stars*",
                "author": "5DchessWatch"
            },
            {
                "raw_content": "Nice, I think I'll steal it! gn",
                "author": "kek-is-tan"
            },
            {
                "raw_content": "This is beautiful...",
                "author": "thistlemitten"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: FBI Director Kash Patel fired an FBI agent trainee for displaying gay pride flag on his desk — MSNBC",
        "score": 1406,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good.",
                "author": "DeusVult1096"
            },
            {
                "raw_content": "Fantastic… 👏 Keep in mind that the rainbow flag is basically the left’s war flag and wherever they place it is an attempt to claim a certain territory as occupied by them. Which is why we must tear it down everywhere we find it.",
                "author": "MAGA9428"
            },
            {
                "raw_content": "Get the DEI outta here.",
                "author": "MakeFloridaRed"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "One day before Charlie was shot and killed, he was featured in the SPLC's \"Hatewatch\" newsletter",
        "score": 1532,
        "text_content": "",
        "comments": [
            {
                "raw_content": "ACLU, SPLC, ADL, AIPAC, Mooslim bros, Cair, and more all need terrorist designations and arrested!",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "SPLC is the terrorist organization!!",
                "author": "Live_free_or_die_55"
            },
            {
                "raw_content": "Let me guess, the SPLC hates white Christians.",
                "author": "VladtheTickler"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The bearded Muslim man who carried out a deadly car ramming and stabbing attack at a synagogue in Manchester, England is literally named Jihad.",
        "score": 1385,
        "text_content": "",
        "comments": [
            {
                "raw_content": "BBC: \"Why are conservatives doing this?\"",
                "author": "DeusVult1096"
            },
            {
                "raw_content": "Who could've predicted something like this??? Inconceivable!",
                "author": "IllIllIll"
            },
            {
                "raw_content": "religion of peace strikes again",
                "author": "kek-is-tan"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "TRUMP ON SHUTDOWN: “There could be firings, & that's their fault.” “I didn’t want this, but I’m allowed to cut things that should have never been approved in the first place, & I will probably do that.”",
        "score": 1279,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fire them all, sir! I need my taxes to go down.",
                "author": "Oldman6541E5"
            },
            {
                "raw_content": "Mass firings starting to feel like a cock tease just used as negotiating leverage.",
                "author": "SalteenCracker"
            },
            {
                "raw_content": "He better do that. It’s why I voted for him.",
                "author": "chewsoap"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔥President Trump's DHS just posted this.",
        "score": 1343,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not with 1 million jobs removed. People need to be able to work. Clamp down on these H1-B.",
                "author": "PiratePatriotParrot"
            },
            {
                "raw_content": "We have the best shitposters folks",
                "author": "braveheartonsol"
            },
            {
                "raw_content": "Deportation is The Cure.",
                "author": "midgetpornrocks"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "(Who doesn't like a little sex with homeless people?) ----? ANITFA: Journalist exposes ANTIFA’s sex house next to Portland’s ICE detention center. A man identified as the leader, said, “Everyone poops at Chandler’s, they host sex parties, get drunk, & pay homeless people to join.”",
        "score": 752,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sounds nasty and disgusting.",
                "author": "HumphreyPlowjogger"
            },
            {
                "raw_content": "drunken troon orgies. Yeah this all checks out I mean did anybody expect something different?",
                "author": "Zskills"
            },
            {
                "raw_content": "My god that is so degenerate",
                "author": "TruculentGoose"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔴TPUSA is now openly at war with Candace Owens. This response, to her accusations, has been posted by Tyler Bowyer, TPUSA Senior Executive, and has been reposted by Andrew Kolvet, Charlie's best friend, executive producer and co-host of the Charlie Kirk show. Full text is attached.",
        "score": 700,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don't know what this is in reference to, but I hope it's not an effort to get us to stop asking what the fuck happened and pointing out that about 67 things make zero fucking sense.",
                "author": "RentFree2020"
            },
            {
                "raw_content": "Wait until he learns that CNN tried to broadcast the Trump assassination live on TV when they don't normally attend those events anymore. We are dealing with demons enacting coups in real time.",
                "author": "MythArcana"
            },
            {
                "raw_content": "What the F did I miss?! What has happened? The statement I just read mentioned absolutely NOTHING about Candace Owens. Either clarify with proof, or take this shit down and stop trying to make us all look bad or fucking stupid!",
                "author": "ImYourHuckleberry24"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This is why you stay at the Trump Chicago.",
        "score": 677,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I never did the hotel thing, but when I was in Chicago I ate at his restaurant in his building. I took a table outside on the balcony and it was so beautiful. Excellent service above and beyond normal. The food was gourmet at decent but higher prices. So worth it. Also, there were people across the river at their hotel using binoculars looking at the Trump Hotel. Top class place. I am pretty sure that the head KISS guy pulled up to the hotel entrance place when I was there. He had like 4 giant suitcases. He had a huge black suv. Cool place.",
                "author": "Lady_MaGa"
            },
            {
                "raw_content": "What does that room cost a night for the average Joe? Maybe if the gas and grocery prices came down we could all afford to stay there for a night. 🤓",
                "author": "drmrboy"
            },
            {
                "raw_content": "I've had apartments that were smaller than that room.",
                "author": "NeoDragoon"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Because Charlie Kirk Just Got Assassinated, You Retarded Liberal Piece Of Shit",
        "score": 1931,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There is no such thing as a \"conservative campus\".",
                "author": "Minn2000"
            },
            {
                "raw_content": "that little shit will only stop a small pistol round. why even waste time debating with these dickheads they are already to far gone mentally they hate everything about America.",
                "author": "EvilGreed209"
            },
            {
                "raw_content": "> \"Why are you protecting yourself from us? Why can't you let your guard down for a bit, preferably while I load my ammunition and take a shot?\" 🤡",
                "author": "TheMrStone"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Mods are whackin' it. POST YOUR FAVORITE FROG!",
        "score": 841,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Mods FTW with this sticky. Glad we can laugh at ourselves here, unlike the left. **¡Olé!**",
                "author": "MemeWarsVet"
            },
            {
                "raw_content": "They be whackin it to pictures of Greta",
                "author": "Colorado-Living"
            },
            {
                "raw_content": "[just some blue collar Pepe's getting work done](https://i.pinimg.com/736x/7c/43/1f/7c431f6d3a4d0703263c7603090b3c2e.jpg)",
                "author": "ListenToSavage"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Steven Crowder: The Left is Violent (Part 2) | Change My Mind",
        "score": 1434,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I mean respect to Crowder for going out and doing this, but at the same time didn't we just learn that there's no real point in trying to talk to those people anymore?",
                "author": "Fangerang"
            },
            {
                "raw_content": "Big props to crowder for doing this, but it’s really highlighting how irreplaceable Charlie really was. Crowder IMO is too soft on the mental retardation of a lot of these college students (see the woman yesterday who thought the CCP was closer to American conservatives). Charlie had the ratio of respectful conversation to dunking on idiots down to a science.",
                "author": "Obamaisalbaghdadi"
            },
            {
                "raw_content": "[Part 1: The Left is Violent | Change My Mind](https://rumble.com/v6zpt9u-the-left-is-violent-change-my-mind.html?e9s=src_v1_cbl%2Csrc_v1_ucp_f) [Steven Crowder: When I started Change My Mind, it was never meant to dunk on students. The students are the ones who have been failed by their institutions. That's why I'm calling for formal debates with professors across the country and offering a charitable contribution ($10,000) to the organization of their choice. I'm starting by issuing this challenge to professors in the political science or liberal arts departments of the following schools:](https://x.com/scrowder/status/1973810209815736463) - The University of Texas - Kansas University - UCLA - Cal Berkeley - Stanford - USC - The University of Pennsylvania - Penn State University - Columbia University - NYU - Harvard - Boston University [If you are a student, professor, or administrator at any of these schools, please spread this message, and let's make conversation happen.](https://x.com/scrowder/status/1973810209815736463)",
                "author": "Mr_Rightside"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING 🚨 President Trump has decided that the U.S. is engaged in a formal “armed conflict” with drug cartels his team has labeled terrorist organizations and that suspected smugglers for such groups are “unlawful combatants,” the administration said in a confidential notice to Congress this week",
        "score": 1800,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Drug cartels and ANTIFA are terrorist organizations. They need to be handled as such.",
                "author": "Oldman6541E5"
            },
            {
                "raw_content": "By international law, “unlawful combatants” are not only fair game, but also are subject to summary execution upon capture.",
                "author": "YT45"
            },
            {
                "raw_content": "Gun the cartel down in the streets! We need to *DECLARE WAR* on these sub human vermin. Boots on the ground. Make Gaza look like a summer holiday destination. Should've been done a long time ago!",
                "author": "TRUMPMAGASUPERFAN"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"Senate leader Thune says weekend votes to reopen government are 'unlikely' if Friday's votes fail\"",
        "score": 1317,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nope. Keep it closed. Let the Dems stew in failure as their base of rabid welfare queens run out of free bennies.",
                "author": "cjcivicx"
            },
            {
                "raw_content": "If you reopen it and have illegal alien Sens and Reps, have you commited treachery? Seems treacherous. Since shits shut down start anew.",
                "author": "PatriotSkorzeny"
            },
            {
                "raw_content": "These people work less than joggers",
                "author": "JoeBidensDementia1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Greta Thunberg Wants Anyone Watching to Please Tell Her Government She's Been Kidnapped...Again.",
        "score": 1221,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nah. They can keep her. At least we won't have to look at her or hear anything about her.",
                "author": "Boomstikchik"
            },
            {
                "raw_content": "How does she look 12 and 50 at the same time?",
                "author": "Side_o_beef_curtains"
            },
            {
                "raw_content": "Her head looks like a Number Block.",
                "author": "Bldg_2019"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: Elon Musk accuses the Southern Poverty Law Center of being \"GUILTY of incitement to murder Charlie Kirk\" - because one day before Charlie was killed, SPLC featured him on their \"hate watch\" newsletter.",
        "score": 845,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Elon is back.",
                "author": "dataonly"
            },
            {
                "raw_content": "SPLC is an on-going criminal/terrorist enterprise. Bury them.",
                "author": "LookFatty"
            },
            {
                "raw_content": "He's not wrong.",
                "author": "TD_Covfefe_Crusader"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Democrats are starting to REGRET their decision to vote for the Schumer Shutdown! Their panic makes me smile. \"This shutdown could be VERY DIFFERENT from all the shutdowns that we’ve lived through over the last several years.\"",
        "score": 1546,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yeah, funny how Marxist antics rely on a docile demoralized society. We're righteously pissed the fuck off, FINALLY.",
                "author": "swift_water"
            },
            {
                "raw_content": "Guys I'm scared. I woke up today and the lights were out, I have no food, and the Internet isn't working. I don't know how I'm going to get to work. What do I do?? When will the government be back? Help me! Wait nevermind everything is fine, whew, dreamed I was a liberal there for a second",
                "author": "itspancakees"
            },
            {
                "raw_content": "SO DO IT.",
                "author": "Deplorable_Yankee"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Nvidia's 16-pin time bomb could be defused by this $95 gadget — Ampinel offers load balancing that Nvidia forgot to include",
        "score": 157,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I appreciate that there's a real solution, but it is wild that this is necessary.",
                "author": "ritz_are_the_shitz"
            },
            {
                "raw_content": "I feel like things like this should be kept in a museum chronicling the downfall of man kind. \"In this exhibit we have a $95 gadget that you need to keep your $3,000 gadget from self-immolating\"",
                "author": "AnxiousJedi"
            },
            {
                "raw_content": "Funny thing is that load balancing is against the specs. The whole thing is just super ill conceived.",
                "author": "UsernameAvaylable"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Inside Intel, employees say the famous culture gradually fell apart—and worsened the chipmaker’s downward spiral",
        "score": 187,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I worked there starting in 2012 and left in 2020, it was a mixed bag from the beginning. They did have great benefits and programs that really felt like they cared about employees and wanted to keep them engaged and working, but my first year working there they also had mass layoffs. Over the next few years they continued to cut benefits for employees, and constant layoffs were a concern, they also started hiring contract employees for near minimum wage who had no technical knowledge and had us train them to do our jobs.",
                "author": "mydogisbuddy"
            },
            {
                "raw_content": "Culture tends to fall apart when you do continual layoffs for 5 years and take away or reduce benefits until anyone left is just trying to ride it out till they retire. People used to talk about how much they loved working at Intel, haven’t heard praise like that in a long while.",
                "author": "youreblockingmyshot"
            },
            {
                "raw_content": "As a former employee of twenty years I tell people I know how the Roman Empire Fell. Stupid, greedy, mid-level managers angling for their piece.",
                "author": "Atomsac"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Chinese company \"Fengpo\" launches GeForce RTX 3080 card with 20GB memory and PNY RTX 4090 cooler, priced around $447",
        "score": 232,
        "text_content": "",
        "comments": [
            {
                "raw_content": "20GB 3080 was actually an 'official' release back when it was new, cards did not seem to be released outside of Russia though and were assumed to be special production for crypto miners. Still, it has been demonstrated as a mod and it's relatively simple to make 20GB versions if you have the cores. I'd question where this non-partner has got those but it is probably from used cards given the 3080's age.",
                "author": "jenny_905"
            },
            {
                "raw_content": "Great deal for 20gb of AI power!",
                "author": "thelastsupper316"
            },
            {
                "raw_content": "So that's what's happening to all those Dell 3080s...",
                "author": "glizzytwister"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Cerebras raises $1.1 billion with $8 billion valuation",
        "score": 9,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good!! Now let's see them find a way to stack DRAM on-die! Their wafer-scale products are *amazing* but suffer from way too little memory.",
                "author": "ttkciar"
            },
            {
                "raw_content": "Series G? Sounds like they're suffering from quite a lot of dilution.",
                "author": "Exist50"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD Tried To Hide This From You - FSR 4 on RDNA 3 & 2 Tested",
        "score": 132,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Actually, even though it's not an official version - it's pretty good for 6000 series owners. If FSR4 INT8 delivers better quality than XESS, even when you compare fsr performance and xess quality, but around the same performance uplift - it's good. And even if FSR4 int8 gives you only 10-15% uplift in performance it's still a huge deal with games like cyberpunk, because you just don't have any other option other than fsr3 or xess.",
                "author": "meinkun"
            },
            {
                "raw_content": "Yep been using it on my ROG Ally X for the past few weeks and it's awesome. On the small screen even a performance upscale still looks good vs FSR2/3 which just looks like garbage. A noticable upgrade from XeSS for RDNA3 users.",
                "author": "Logical-Database4510"
            },
            {
                "raw_content": "FSR4 is worth the extra performance cost. FSR 3 is shimmering mess with very bad fine detail reconstruction.",
                "author": "-CynicalPole-"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "M5-powered iPad Pro breaks cover in GeekBench, scoring 4,133 in single-threaded tests — matches M4 Max and beats every single-core PC chip score",
        "score": 50,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Surprised to see this doesn’t beat my iPhone 17 Pro by a whole lot. It scored 3853 single core",
                "author": "Temporary-Fix9578"
            },
            {
                "raw_content": "Every time Apple releases a CPU that takes the crown as best ST performance on the market, beating the previous record holder - their last gen CPU - people here, instead of being impressed, come up with a load of excuses about how this fanless tablet won't be able to match the IO or nT capabilities of a fully built workstation. None of that changes the fact that Apple M series has incredible ST performance and is several generations ahead of AMD and Intel in IPC. Any constraints this device has is purely due to the formfactor, being a \\~6mm thick fanless tablet. I wish CPUs with the same IPC and perf/watt as Apple M series were available for PCs (and no, it's not just node - Zen 6 will be on a better node and have worse IPC)",
                "author": "soggybiscuit93"
            },
            {
                "raw_content": "Yet you are forced to use iPadOS instead of a decent OS for such powerful processor.",
                "author": "MotherFunker1734"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Apple Stops Work on Lighter Vision Pro to Fast-Track AI Smart Glasses",
        "score": 40,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm not exactly excited for computers to be more in our face. I'm not excited for cameras recording everything 24/7 either. I'm more interested in the \"much lighter\" vision air. At least that you don't need to use 24/7.",
                "author": "Snow-Day371"
            },
            {
                "raw_content": "When are they going to release a smart ai to go with their devices though?",
                "author": "DehydratedButTired"
            },
            {
                "raw_content": "If Apple had released the current Meta Glasses they would not be able to make the fast enough. Apple was out Appled and the Vision Pro should have been, clean and light smart glasses.",
                "author": "jv9mmm"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "New port for Mario Galaxy Series on switch has some neat graphics improvements.",
        "score": 1240,
        "text_content": "Not only resolution boost but textures are also replaced too. It is a good chance to revisit or start this duology on Switch",
        "comments": [
            {
                "raw_content": "The source of these comparisons is Digital Foundry.",
                "author": "Beanmaster115"
            },
            {
                "raw_content": "The kind of upgrades that you already had in your mind when thinking back on those games.",
                "author": "Dagawing"
            },
            {
                "raw_content": "Checks out https://preview.redd.it/nese8njrqrsf1.jpeg?width=1080&format=pjpg&auto=webp&s=a88bd56d107aa33f866fa1f4a6326199868f45f1",
                "author": "RockShrimpTempura"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Galaxy 2 may be 15 years old but it sure does look good in 4K",
        "score": 558,
        "text_content": "Just wish the Switch 2 actually took 4K screenshots",
        "comments": [
            {
                "raw_content": "So many Gamecube and Wii games look fantastic when rendered at higher resolutions like 4K. The artwork holds up surprisingly well despite being crafted for a significantly lower resolution.",
                "author": "I_Dont_Have_Corona"
            },
            {
                "raw_content": "Good thing this won’t be a limited run game. Might pick it up after the next Mario movie comes out, they might do some sale during or after the movie release… unlike 3d all stars this will be printed for quite a while.",
                "author": "CigarLover"
            },
            {
                "raw_content": "Art direction continues to be king.",
                "author": "eggydrums115"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo marketed the new Mario Galaxy releases terribly",
        "score": 147,
        "text_content": "These games are essentially full on remasters and I’m honestly pretty impressed. A decent bit of work clearly went into all of the new textures and the games look amazing in 4k. They have everything that games Nintendo has marketed as “HD” have. (Think DKC Returns HD or Skyward Sword HD.) So why were they marketed as just plain rereleases rather than Super Mario Galaxy HD? Just seems like it would’ve given the people who said they already own the games maybe a little bit of a reason to bite",
        "comments": [
            {
                "raw_content": "The same thing is true for the breath of the wild Switch 2 edition. If you see them side by side there was absolutely some texture and model work done but they never advertised any of that either. These are the things Nintendo just has never talked about. They don't have a history of talking about those types of bonuses. They would rather talk about actual gameplay things they added instead of the more technical side of it",
                "author": "just_someone27000"
            },
            {
                "raw_content": "I don’t think they remastered it they just upscaled the resolution right?",
                "author": "Janky_McSpaniels"
            },
            {
                "raw_content": "My question is why is everyone complaining about $35-$40 remasters? We saw Nintendo charge $60 for DKC HD and Skyward Sword. They charged $40 for Metroid Prime Remastered and $35-$40 for each Mario Galaxy remaster. Completely in the realm of what they’ve been doing for years.",
                "author": "jllewis30"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "8 Bit Do Pro 3 and Ultimate 2 now have “Shake to Wake” on Switch 2",
        "score": 305,
        "text_content": "The new beta firmware available on 8Bit Do’s website adds the “Shake to Wake” feature to the Pro 3 and Ultimate 2 controller models. I own both and both seem to work fine. ( edited for clarity )",
        "comments": [
            {
                "raw_content": "I was on the fence about getting one of these, you helped me make the decision thanks!",
                "author": "CheddarGorger"
            },
            {
                "raw_content": "Dang, and yet I can’t use my official pro controller (1) to wake up the console. Neat though",
                "author": "Tenner_"
            },
            {
                "raw_content": "Well... now there's no reason to Pro Controller 1 to not wake Switch 2.",
                "author": "linkling1039"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "A new patch for the Switch 2 version of Star Wars Outlaws is out (further improves performance and visual quality)",
        "score": 668,
        "text_content": "Came out today and it really looks and runs even better than with the 1.0.4 patch. Here are the patch notes: https://www.ubisoft.com/de-de/game/star-wars/outlaws/news-updates/oDiDbsVrRcAL7WswTRV7Z/nintendo-switch-2-title-update-2 It's a good game and the Switch 2 port is just great. Graphically the most impressive Switch 2 game atm. Oh and they fixed the bug that prevented the graphic options to stick!",
        "comments": [
            {
                "raw_content": "Ubisoft clearly saw this as an opportunity to get people to give the game a second chance with audiences. Hopefully others see the success and it convinces 3rd parties to make high quality ports",
                "author": "Metallovingent"
            },
            {
                "raw_content": "There has been so much excitement for this game on the switch 2. I’m curious to see how well the game did on the platform. I know it was said that the sales were underwhelming on the other consoles. It would be a nice little comeback story to see this game end up with success on the switch 2.",
                "author": "Banesmuffledvoice"
            },
            {
                "raw_content": "I absolutely love this port and having a blast with it",
                "author": "WynnSquatch"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I got Star Wars Outlaws last week, but didn't realise till now what good value it offers",
        "score": 183,
        "text_content": "Honestly, I sometimes find it hard to keep up with what's included in the various editions of games from companies like Ubisoft, but after getting to the stage in the game where the first DLC mission unlocks I looked up what's actually in the Gold Edition (which I think is the only option on Switch 2) and, wow, this seems to have pretty much everything major the game offers - I knew about the two main story expansions, but hadn't realised there's some sort of bonus Jabba the Hutt mission too. What's more, I paid just over £40 for the keycard and it's £50 on the eShop (and no doubt will be on sale later this month), but the full price on Playstation or Xbox is... *£105*!!! Now, to be fair, you can get it cheaper on those systems too by shopping around physically and it's already been on sale multiple times for far less digitally, but that was the initial value attributed to the whole package by Ubisoft. I had been planning on waiting for the inevitable digital sale, but £40 for the keycard already seemed a fair enough price, and after realising quite how much you get with this, it's actually pretty incredible value. Fun game too. Yeah, it's got its share of Ubisoft jank, but if you can look past that, there's a lot to enjoy. Glad to see it getting a second lease of life on Switch 2.",
        "comments": [
            {
                "raw_content": "The full switch 2 price is fantastic even compared to sale prices. In the US the gold edition is currently on massive steam sale and is still barely less than the regular switch 2 price.",
                "author": "Mollywobbles77"
            },
            {
                "raw_content": "Great port and they just released another update to improve more. Ubisoft has my interest peaked on their ability to port stuff like shadows and easily anything from last gen like far cry and the mythology AC trilogy etc.",
                "author": "Bootychomper23"
            },
            {
                "raw_content": "I bought it on release and already put in 80 hours. Less than a dollar an hour, I’d say great value for sure.",
                "author": "Raging_Pwnr"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Final Fantasy 7 Remake lead says devs need to “use the hardware properly” to create great Nintendo Switch 2 ports and focus on high-quality lighting",
        "score": 419,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Its weird how ff7 remake is so good yet persona 3 remakes is subpar according to the demo at least.",
                "author": "zaadiqoJoseph"
            },
            {
                "raw_content": "What a chad. Please get this guy in a room with Atlus. Their ports sucked on Switch 1 and they seem to suck even more on Switch 2. Persona 5 running at 540p and the seemingly atrocious frametime issues on Persona 3 Reload, they can’t get away with this.",
                "author": "Medd-"
            },
            {
                "raw_content": "tell that to atlus lol. they basically brute forced persona 3 reload, making it only a stuttery 30fps and thinking people would eat that slop. i know IRL people who cancelled their pre orders after trying the demo, these would typically buy almost anything and yet they cancelled. If THEY cancelled, it's because it's that sloppy of a port. I'm sincerely hoping for low sales for that one so they at least get \"motivation\" to go back to it and optimize it properly but it's very unlikely i think",
                "author": "BurnedOutCollector87"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Naughty Dog is ramping up hiring for localization work indicating Intergalactic might be just over a year away from launch",
        "score": 143,
        "text_content": "Notably, they've got job openings for Japanese and French language development support. 2027 launch is starting to make a lotta sense https://www.linkedin.com/jobs/naughty-dog-jobs-worldwide?f_C=13609&trk=top-card_top-card-primary-button-top-card-primary-cta",
        "comments": [
            {
                "raw_content": "I really want to know what they're going to do with this game. Because many of the games Neil Druckman has mentioned as inspiration have been Elden Ring. He's also said that this will be the least linear and most free-form Naughty Dog title they've made. The soundtrack is being done by Atticus Ross and Trent Reznor.",
                "author": "Midnight_M_"
            },
            {
                "raw_content": "2027 launch doesn’t even really seem that far fetched",
                "author": "KeybladeBrett"
            },
            {
                "raw_content": "Genuinely surprised that they're bringing people in-house to do this, esp considering that stuff like this is often outsourced to a firm like Pole to Win.",
                "author": "thr1ceuponatime"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Halo Combat Evolved Remake is being developed by Halo Studios and Abstraction Virtuous Studios, hybrid engine with Unreal Engine 5",
        "score": 545,
        "text_content": "[https://www.youtube.com/watch?v=fd2XFc7zKcw](https://www.youtube.com/watch?v=fd2XFc7zKcw) MrRebs reports his sources told him Halo Combat Evovled Remake is being developed by Abstraction Virtuous Studios, a Virtuous studios based on Netherlands. * Halo Combat Evolved Remake is being made the same way Oblivion Remake, reinforcing report from last week. * Virtuous been hiring people with knowledge on old Halo game engines * Some Halo content creators like MitBlitz are aware of the remake **Edit: Xbox Era has corroborated** [XboxEra report](https://xboxera.com/2025/10/02/rumor-halo-ce-remake-co-devleoped-by-a-virtuous-studio/)",
        "comments": [
            {
                "raw_content": "Hey this is Rebs. Thanks for sharing my report! I now have several sources who have heard that Abstraction, which was acquired by Virtuous in December 2024, is developing the game. I found evidence online that supports this which I show in the video.",
                "author": "Rebs_Gaming"
            },
            {
                "raw_content": "After the oblivion remake definitely worried how performance is going to be",
                "author": "XTheGreat88"
            },
            {
                "raw_content": "Not sure why they're going for a hybrid approach. I figured they'd use the remake as an opportunity to build a solid Halo foundation in Unreal and then build upon that for the next actual mainline game.",
                "author": "I-wanna-fuck-SCP1471"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "MP1ST: Development Screenshots From Cancelled Star Wars: KOTOR Remake by Aspyr Surfaces",
        "score": 439,
        "text_content": "[https://mp1st.com/news/report-development-screenshots-from-cancelled-star-wars-kotor-remake-by-aspyr-surfaces](https://mp1st.com/news/report-development-screenshots-from-cancelled-star-wars-kotor-remake-by-aspyr-surfaces) Mp1st has got access to pictures from a cancelled version of KOTR Remake. >The following images were shared in the portfolio of a former Aspyr artist, and they primarily show weapons and props that were being developed for that version of the game. * Some of these props belonged to an introductory level. It is also mentioned that the weapons were being designed with a modular weapon system in mind, allowing players to upgrade guns by swapping out parts. * The game was set to have a companion system [https://imgur.com/a/WLPgDQO](https://imgur.com/a/WLPgDQO)",
        "comments": [
            {
                "raw_content": "Was this officially canceled?",
                "author": "Rubssi"
            },
            {
                "raw_content": "Technically this game was never cancelled... It's scheduled to be released on the same day as Beyond Good & Evil 2 and Star Wars: Eclipse.",
                "author": "MuptonBossman"
            },
            {
                "raw_content": "The game was set to have a companion system? Boy I fuckin hope so considering it was a remake of Knights of the Old Republic.",
                "author": "SilverKry"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Silent Hill Townfall releasing in 2026 and new details",
        "score": 320,
        "text_content": ">Planned to be a game with several short stories that will focus on ghosts from a town's past, and especially the spirits that haunt a small beach not far from the town in question where the story will take place >The system would be similar to Silent Hill Short Message. (No weapon, no object, only jumpscares and investigation and pursuit footage) Available on PS5, Xbox Series & PC. [Source](https://xcancel.com/immalkwalahi/status/1973818083090588124?t=rqA9QSnro0nE_nbsdqeWnA&s=19)",
        "comments": [
            {
                "raw_content": "So basically a P.T. like experience attempt, guess some variety to Silent Hill games can't hurt.",
                "author": "Mr_Nobody0"
            },
            {
                "raw_content": "Looks like people in the comments don't understand what this is. It's a spinoff, not a mainline entry, made by an indie studio that made \"Stories Untold\" which I highly recommend. Excited for this one.",
                "author": "MrMafro"
            },
            {
                "raw_content": "So much insane negativity in the comments, No Code have a good track record and Silent Hill has definitely had more hits than misses as of late, no combat is fine by me if the game is scary and well written then that’s fine for a horror game, PT still is one of the best horror experiences ever and there’s zero combat. And again a collection of short stories? I think that could be sick, but we’ll see I guess, silly to dismiss it outright when we only have that one trailer from years ago, give these guys a chance.",
                "author": "Ratchet2332"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "(Tom Henderson/Insider Gaming): Sony will begin sunsetting some PlayStation services for new PS4 titles in Spring 2026",
        "score": 480,
        "text_content": "https://insider-gaming.com/playstation-is-sunsetting-some-playstation-4-services/ > It’s stated that “this means that any new PS4 title submitted after this date will no longer be able to integrate with the following legacy features.” > The legacy features being sunset are: >* Activity Feed Web API >* Title Small Storage (TSS) >* Title User Storage (TUS) >* Users and Profiles >* Word Filters >* Shared Media Web API",
        "comments": [
            {
                "raw_content": "#Insider-Gaming is a Tier 2 - Generally Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Is it bad that I don't know what any of those things are after activity feed?",
                "author": "Nervous-Peppers"
            },
            {
                "raw_content": "PS4 being phased out in 2026 is like the PS3 being phased out a year before the PS5 release",
                "author": "ErickJail"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Iridium Studios next game, \"People of Note\" seem to leak before its announcement at TGS 2025",
        "score": 104,
        "text_content": "Adrian Leekermann has leaked an announcement for the upcoming game, [\"People of Note\", on X.](https://xcancel.com/ALeekermann/status/1956068541926662486#m) His leak announcement went as far back as August 14th. The profile banner from the account seems to be the opening screen from the game. EDIT: Adrian Leekermann also has a short history of leaking before during the [announcement of NFS Unbound](https://www.reddit.com/r/GamingLeaksAndRumours/comments/xfemek/can_anyone_corroborate_these_nfs_2022_leaks/) before its official trailer and gameplay.",
        "comments": [
            {
                "raw_content": "Nice find",
                "author": "siliconwolf13"
            },
            {
                "raw_content": "Honestly it looks like it could be fun. I’ll keep an eye on it",
                "author": "MetalMario64"
            },
            {
                "raw_content": "I wonder what type of game it’s going to be. I like the colour palette from the pic on his Bluesky profile banner",
                "author": "cian_pike01"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "MSI says 800-series AM5 motherboards are “Future CPU Ready,” pointing to Zen 6 support",
        "score": 206,
        "text_content": "",
        "comments": [
            {
                "raw_content": "shocking news",
                "author": "rabaluf"
            },
            {
                "raw_content": "Unless there's a new socket, all AM5 motherboards are \"Future CPU Ready\" With bios update.",
                "author": "Crintor"
            },
            {
                "raw_content": "I just bought a b650 MSI board. they had better be future cpu ready as well lmao",
                "author": "Bathroom_Humor"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "ASRock Japan extends 800-Series motherboard warranty, but only if you join their Fan Club",
        "score": 65,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm so glad I went with Asus for AM5 after going with ASRock for AM4",
                "author": "ajshell1"
            },
            {
                "raw_content": "ASRock is off my buy list for AM5. They really need to either make their products perfect where a warranty experience is rare or have a warranty amazing enough to make it worth the risk.",
                "author": "jhaluska"
            },
            {
                "raw_content": "I will extend 9800X3D life by not buying an ASRock mb",
                "author": "Dk000t"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Tried To Hide This From You - FSR 4 on RDNA 3 & 2 Tested",
        "score": 22,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I have a felling AMD will officially release FSR4 support only for RDNA 3, because a lot of those owners are unhappy they've been locked out of it, and that hurts the brand retention a bit. I have the 6900 XT so it would be nice to have as well, but I am doubtful it will happen, mainly because of the performance hit / and AMD giving older GPU owners more reasons to upgrade. So I am not really expecting it.",
                "author": "Wooshio"
            },
            {
                "raw_content": "I mean, they haven't tried very hard have they? They leaked the code for a version that works on older cards, and then relevant internet places have been all over it ever since.",
                "author": "Woffingshire"
            },
            {
                "raw_content": "What a bullshit click bait title.",
                "author": "M4deman"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "1.5m house, rent for 4k/mo",
        "score": 169,
        "text_content": "There are dozens of houses in my neighborhood valued over a million that rent for $ 4k a month. I’m in one of them. Some even struggle to find renters at that price. In some cases, people actually paid over a million recently. Property tax alone is $ 1500 a month, then management cost. If I were crazy, I’d say there’s some conspiracy to keep nice homes off the market. What the heck is going on?",
        "comments": [
            {
                "raw_content": "There are scenarios where that could make sense, but for the most part that would be a terrible deal for the owner. Great deal for a tenant though !",
                "author": "JLandis84"
            },
            {
                "raw_content": "Million dollar vinyl wood homes",
                "author": "Tight_Course5972"
            },
            {
                "raw_content": "Rich people would rather spend 8k on a mortgage than 4k on rent. Edit: MOST since people doing the um ackshually thing",
                "author": "ispb2"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Calling the top",
        "score": 261,
        "text_content": "$40 is still too much for a year’s worth of Maxwell House",
        "comments": [
            {
                "raw_content": "I thought this was the Onion at first.",
                "author": "almighty_gourd"
            },
            {
                "raw_content": "“Opting to rent instead of purchase a home” why is it worded like people are choosing the option to rent instead of buy as if it was a personal choice and not because they can’t afford it.",
                "author": "SghettiAndButter"
            },
            {
                "raw_content": "Maxwell Down By the River in a Van",
                "author": "EstateGate"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Home Sellers Are Cutting Prices at a Record Rate to Lure Skittish Buyers",
        "score": 116,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’m seeing the cuts. Minimal at my price range (sub $500k, MCOL location). The quality (dollar amount) of the cuts is not ~~commiserate~~ commensurate with rates we see now, or the increased insurance cost. Couple that with a recessionary job market, and the sellers are stubborn to what the housing market is telling them: it’s too expensive, and too much risk to take on at this time. Edit: thank you for the grammar lesson, u/YearoftheCat1963 ! I, too, like Al Stewart!",
                "author": "HartbrakeFL21"
            },
            {
                "raw_content": "Call me when it drops 30%.",
                "author": "sealth12345"
            },
            {
                "raw_content": "I'm seeing this in traditionally strong markets too like orange county, CA. Seeing 50-100k cuts. That still makes starter homes 1.1 mill but it's something at least.",
                "author": "daylooo"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Rent Price Growth Still Outpacing Inflation",
        "score": 50,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Inflation meadure is fake. Fed should have hiked.",
                "author": "Dry-Interaction-1246"
            },
            {
                "raw_content": "This is why you can’t “rent and invest the difference”",
                "author": "External_Koala971"
            },
            {
                "raw_content": "Rents were up 3.5% in August, compared to the same time last year, according to the latest consumer price index report. The latest consumer price index report from the Bureau of Labor Statistics released on Sept. 11 shows that in August the shelter index, which includes rent, continued to outpace annual inflation. But housing price growth is slowing down. Over the 12-month period ending in August, rent alone was up 3.5%, according to the BLS. That’s just below the overall 12-month increase for shelter (3.6%). It’s worth noting that rent increases in the CPI look different from data reported by rental websites like Zillow because there’s a lag in how rent data is reflected in the CPI. That means it takes longer for rental shifts in the market to show up in the report. Zillow calculates changes in asking rents using its Zillow Observed Rent Index, which is based on its rental database. Properties are weighted so that the index reflects the rental market as a whole. The lag is primarily due to the cycle of renewals for leases. Since most leases last around a year, a renter’s costs will stay the same all year long. It’s only when the lease ends that a better understanding of the rental market emerges. As of August, rent growth was unusually slow compared to a year earlier, according to Zillow’s latest rental market report. Typical asking rent was $2,007 in August, unchanged from July but up 2.4% year over year. The pace has slowed sharply from the major spikes of 2022, and growth now sits slightly below pre-pandemic averages. Still, rents are 36.2% higher than before the pandemic. The slowdown stems from a mix of more homes available for rent and a cooling housing market — conditions that give renters a bit more leverage. Affordability remains stretched: The typical household spends 28.9% of income on rent, meaning an annual income of $80,291 is needed to afford the median rental. Rental concessions hit a record: About 36.7% of August listings on Zillow offered concessions — discounts like free months of rent — up from last year in 38 of the 50 largest metros. The biggest increases were in Denver, Memphis, Orlando, Houston and Austin. Where is rent most affordable — and unaffordable? For August, rents fell month over month in 20 metros, including Austin (-0.9%), Providence (-0.5%), Denver (-0.4%), San Antonio (-0.4%), and Boston (-0.4%). Rents rose in 46 of the 50 largest metros, led by Chicago (6.1%), San Francisco (5.1%), New York (5%), Providence (4.6%), and Kansas City (4.6%).",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Inflation Adjusted House Prices 2.7% Below 2022 Peak",
        "score": 24,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Stagflation is here. I’ve been saying we will at max get a 10% inflation adjusted drop in price at most.",
                "author": "ThrowawayyTessslaa"
            },
            {
                "raw_content": "Awesome - bubble cancelled",
                "author": "shalste2"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Housing Hustle Igniting a Foreclosure Crisis in Baltimore",
        "score": 27,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I've heard basically this exact same story multiple times over the past decade and that's just in one city (Indianapolis). It fails every single fucking time. Of course I come on here and all I hear from the reddit \"experts\" is that this is the most organically driven market ever and all of this demand is coming from bob and sally homeowner with 720 credit scores.",
                "author": "ispb2"
            },
            {
                "raw_content": "How's that *passive income* going? Not good? Aw, so sorry to hear that. Thoughts and prayers.",
                "author": "WrongThinkBadSpeak"
            },
            {
                "raw_content": "https://archive.fo/RRhlb paywall link",
                "author": "KieferSutherland"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Despite High Costs, Homebuyers Are Happy With Their Purchases",
        "score": 49,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Getting off the rental ladder is a huge struggle for most young-ish Americans, so they would understandably be happy to just make any purchase at all.",
                "author": "AwesomeSauce1861"
            },
            {
                "raw_content": "I am ridiculously happy with paying $57000 a year for a house I own vs the $46000 per year I was paying to a dickhead landlord that only cared when issues were concerning to his tenant side hustle business.",
                "author": "Moobygriller"
            },
            {
                "raw_content": "I no longer live with the constant threat of random rent increases, shitty upstairs neighbors or having my home turned into an Airbnb. Did I enjoy paying that much? No. But see above. Having reliable shelter is pretty cool.",
                "author": "theelectricstrike"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Pending Home Sales Slide, But There Are Bright Spots: Buyers Have Bargaining Power, Starter-Home Sales Improving",
        "score": 12,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I have been assured that buyers having any bargaining power whatsoever is the worst thing in the world.",
                "author": "ispb2"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Terence Tao says ChatGPT helped him solve a MathOverflow problem and saved hours of manual coding",
        "score": 211,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It’s gonna be interesting to watch the AI haters/skeptics over the coming years have to come to terms with how the tool they were so assured was just a useless garbage slop machine/autocorrect starts actually doing all the things that the AI CEOs (who they despise and think are charlatans) claimed they would be able to do.",
                "author": "socoolandawesome"
            },
            {
                "raw_content": "Terence Tao: AI saved me hours of work. Midwits: AI’s too dumb to help me.",
                "author": "ImmuneHack"
            },
            {
                "raw_content": "Yep, proves that a lot of problems with current AI is a skill issue.",
                "author": "zomgmeister"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Amazon's new AI framework just unlocked super agile humanoid robots",
        "score": 620,
        "text_content": "Amazon FAR team unveiled OmniRetarget, an innovative data generation engine for training complex whole-body loco-manipulation in humanoids. This engine is designed to bridge the embodiment gap by using an interaction mesh that explicitly preserves critical spatial and contact relationships between the robot, terrain, and objects. By doing this, OmniRetarget transforms human motion capture data into kinematically feasible trajectories, generating over 9 hours of high-qualitydata that allows proprioceptive Reinforcement Learning (RL) policies to be trained efficiently. This high-quality data enabled a Unitree G1 humanoid to successfully execute a complex, long-horizon dynamic sequence: carrying a chair, using it as a step to climb onto a platform, leaping off, and finishing with a parkour-style roll. This entire 30-second sequence is drivenby a proprioceptive-only policy (no vision or LIDAR) trained with just 5 reward terms and simple domain randomization—demonstrating significant progress in agile, human-like robot movement and complex scene interaction. Project Page:https://omniretarget.github.io https://youtube.com/shorts/yxOOD2evMPY?si=uL79cXafhpjxYNTF",
        "comments": [
            {
                "raw_content": "Really makes you wonder how difficult of a time they are having with hands and finger movements.",
                "author": "hisglasses66"
            },
            {
                "raw_content": "one step closer to hyper-intelligent magical ninja catgirl waifus running around on rooftops battling each other in sparring sword duels for reasons we cannot comprehend.",
                "author": "challengethegods"
            },
            {
                "raw_content": "Great, they are coming for our parkour jobs as well",
                "author": "SavvyIronWolfAwesome"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Noam Brown of OpenAI has been using GPT-5 Thinking to find errors in every Wikipedia page. Some of these errors can be quite serious. Even the Wikipedia page on Wikipedia has an error.",
        "score": 185,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Noam Brown has had a couple of unimaginably stupid takes on Wikipedia in the past, including a tweet which he deleted because it was so stupid. Interesting part is that everyone who is anti Wikipedia, including musk and his cohort, criticize Wikipedia for being biased, but they intend to replace it with a more centralized, more censored, closed source, non transparent LLM.",
                "author": "10b0t0mized"
            },
            {
                "raw_content": "that error in example has citation needed which means wikipedia system is working already. it's finding error which wikipedia already knows about",
                "author": "kvothe5688"
            },
            {
                "raw_content": "I'm sure asking to find \"at least 1 error\" will result in ChatGPT creating one error.",
                "author": "BreenzyENL"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Sora 2 Pro - 15 second single shot, high quality",
        "score": 72,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Pro is on another level wtf 😭",
                "author": "Key-Chemistry-3873"
            },
            {
                "raw_content": "Hollywood right now: ![gif](giphy|GRtSaXqmHKFAA)",
                "author": "Drogon__"
            },
            {
                "raw_content": "15 second is the max for now?",
                "author": "gbbenner"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Preview of Gemini 3.0 Pro",
        "score": 332,
        "text_content": "[https://x.com/chetaslua/status/1973694615518880236](https://x.com/chetaslua/status/1973694615518880236)",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/cu5g7lv4dssf1.jpeg?width=800&format=pjpg&auto=webp&s=0f48e4c914484756d106d24cc1414f8f41ae026d",
                "author": "Blahblahblakha"
            },
            {
                "raw_content": "For all those wondering, ANYONE can access gemini 3 if they're lucky, I've used it a couple times. Use google ai studio, use 2.5 pro and very rarely you will receive a comparison between 2 new models, they are the 3 series models: https://preview.redd.it/hvgjv7ycbrsf1.png?width=1310&format=png&auto=webp&s=df2df0cbe6b731004a9e136db7a8dc261afb8e97",
                "author": "ThunderBeanage"
            },
            {
                "raw_content": "Im tired of being on the edge of losing my career.",
                "author": "senorsolo"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Good use of AI... I laughed and almost choked lmfao",
        "score": 41,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wait if you faked the images of the homeless person, how do I know you didn't just fake the whole interaction? 😮",
                "author": "TheCrimsonSplit"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "3.0 pro vs 2.5 pro on “SVG of a gaming setup”",
        "score": 126,
        "text_content": "",
        "comments": [
            {
                "raw_content": "AI has learned to put RGB on PCs, we are cooked. AGI is here",
                "author": "PwanaZana"
            },
            {
                "raw_content": "Okay this is fucking insane",
                "author": "Advanced-Many2126"
            },
            {
                "raw_content": "I’d rather see benchmarks of it doing my taxes but I guess SVGs are cool I suppose",
                "author": "TikkunCreation"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"The first music video sung by a robot\" - Anni (AnyWit Robotics) + Unitree G1",
        "score": 31,
        "text_content": "First part of the video : [source](https://x.com/D7QgO22P2fTo5kl/status/1971899420250952032) It's pretty much an Unitree G1 combined with a humanoid head. It was independently built by a company named AnyWit Robotics (无论科技), and it seems like there's barely any content from them outside of Chinese social media. Here's another[ video](https://x.com/VokabreRobotics/status/1959245741332791572) of it walking (it also clearly shows that it was heavily inspired by the Ameca robot).",
        "comments": [
            {
                "raw_content": "Wasn’t expecting to hear G.E.M.’s song here. How does the robot sing? Does it have a work vocal box? Or it’s just a speaker with an ai vocaloid?",
                "author": "Vegetable_Tackle_637"
            },
            {
                "raw_content": "yeah this stuff is like the dang hall of presidents at disney world. wake me up when they have an LLM brain and composing songs on their own, based on their own lives as robots. \"the charging cord sucks, it inhibits my ability to wash the dishes in the other room\" - i would listen to that",
                "author": "New_Mention_5930"
            },
            {
                "raw_content": "> Here's another video of it walking Someone needs to gift that thing a sock",
                "author": "sdmat"
            }
        ],
        "subreddit": "singularity"
    }
]