[
    {
        "post_name": "The White House : The righteous task of protecting the nation that our ancestors built belongs to each and every one of us. 🇺🇸",
        "score": 972,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They upheld the law, we don't. Congress is full of criminals and we prioritize foreign countries over our own. Our own side and speaker has vowed to replace any AF members.",
                "author": "jaeger"
            },
            {
                "raw_content": "Great speech.",
                "author": "DeusVult1096"
            },
            {
                "raw_content": "American Pride in our ancestors. That was a great message for that UN audience. \"No more immigration\" must have been on each of their minds after President Trump spoke.",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Maybe not the Rapture, but it would seem DC is getting ready for something...",
        "score": 841,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Maybe they're about to arrest some high up Aunt Queefa members, and are planning ahead for when leftists predictably lose their collective minds. --- [Here's 6 Antifa to report to the FBI now that they're officially a terrorist organization: Ed and Brian Krassenstein, Dragon Age: The Veilguard/Ghost of Yotei voice actress Erika Ishii plus her wife, Colorado Democrat State Rep Lorena Garcia and Minnesota AG Keith Ellison.](https://patriots.win/p/1AR0ZZ7A3z) https://tips.fbi.gov/home **Ed Krassenstein Antifa Tweets** [Original Tweet 1](https://x.com/EdKrassen/status/1968671389080056178) [Archived Tweet 1](https://archive.is/O2eIJ) [Original Tweet 2](https://x.com/EdKrassen/status/1968766860721070168) [Archive Tweet 2](https://archive.is/oDcTW) [Original Tweet 3](https://x.com/EdKrassen/status/1970185581381742601) [Archived Tweet 3](https://archive.is/2oO7V) **Brian Krassenstein Antifa Tweets** [Original Tweet 1](https://x.com/krassenstein/status/1968482615402369143) [Archived Tweet 1](https://archive.is/yqo8A) [Original Tweet 2](https://x.com/krassenstein/status/1970191085285552529) [Archived Tweet 2](https://archive.is/pU32N) **Erika Ishii Antifa Tweet (Voice actress for Dragon Age: The Veilguard and the upcoming flop Ghost of Yotei)** [Original Tweet](https://x.com/erikaishii/status/1285259908011548674) [Archived Tweet](https://archive.is/sbWc8) **Colorado State Rep Lorena Garcia (D)** [Colorado State Rep Lorena Garcia (D) declares she’s antifa which is a designated terrorist organization. @FBIDirectorKash](https://x.com/libsoftiktok/status/1969776685466726618) **Attorney General of Minnesota Keith Ellison (D)** [In light of President Trump designating ANTIFA as a terrorist organization. Here is your friendly reminder that the Attorney General of Minnesota, Keith Ellison, is a big fan.](https://x.com/GrageDustin/status/1968511737298092440)",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "THE ESCALATOR WAS THE FINAL STRAW",
                "author": "learntocode"
            },
            {
                "raw_content": "Isn’t it incredible how we can use how busy a pizza business is to gauge when and how big some news will be? I wonder what it is, are we pulling out of the UN or NATO, or something else?",
                "author": "Donger-Lord"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: President Trump just sent a veiled threat to ABC after they LIED to him about Jimmy Kimmel being cancelled “He is yet another arm of the DNC...that would be a major Illegal Campaign Contribution.” “Last time I went after them, they gave me $16 Million. This one sounds even more lucrative.”",
        "score": 680,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Of all the hills for Disney to die on... Jimmy Kimmel mocking Charlie Kirk and spreading fake news about his assassin? Shareholders need to start the lawsuits because this is straight up corporate malpractice to push a political narrative.",
                "author": "BlackPilledMAGA"
            },
            {
                "raw_content": "Tonight's opening monolog was literally a mini anti-Trump / pro free speech rally. Compete with fake ass crying and standing ovations from the audience. Oh and he had the nerve to mention Erika Kirk and blubber about how she forgave the shooter and we should all be like Jesus. He literally said you can't silence someone for a joke, which is EXACTLY what they did to Roseanne.",
                "author": "DontTreadOnSnek"
            },
            {
                "raw_content": "If I stream a slowly Rotting Cheese and Ham sandwich. It will Get More viewers then Jimmy Kimmel show.",
                "author": "DT170x"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: North Carolina House passes IRYNA'S LAW to end cashless bail, preventing release of violent offenders and closing loopholes, following the killing of Iryna Zarutska. It is a VETO-PROOF majority. The Democrat governor can't successfully stop it! Now make IRYNA'S LAW nationwide.",
        "score": 2232,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good start but they need to remove those judges that allowed that animal out 14 times",
                "author": "Albo22"
            },
            {
                "raw_content": "Wait, why the FUCK was cashless bail ever an option at all? For anyone?",
                "author": "AsshoeCommies"
            },
            {
                "raw_content": "https://x.com/EricLDaugh/status/1970619503903129824",
                "author": "Mr_Rightside"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 KAROLINE LEAVITT: “The escalator appears to be a sabotage. The London times reported that UN globalist plotters were planning to set up the President of the United States…if we find out these were UN staffers I will personally see to accountability.”",
        "score": 1194,
        "text_content": "",
        "comments": [
            {
                "raw_content": "DEFUND THE UN!",
                "author": "DeusVult1096"
            },
            {
                "raw_content": "Sort of backfired. Trump just went with it and used it as ammo in his speech.",
                "author": "nakedjay"
            },
            {
                "raw_content": "Attempted assassination! Get us out of the UN NOW!",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 For the FOURTH month in a row, ZERO illegal aliens have been released at the border.",
        "score": 1565,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I voted for this.",
                "author": "DeusVult1096"
            },
            {
                "raw_content": "I'm literally shaking with rage! We're all Nazis and Fascists! How can we do this!",
                "author": "Liberals_R_Idiots"
            },
            {
                "raw_content": "Link: https://x.com/rncresearch/status/1970616321605001277",
                "author": "LadyFannyofOmaha"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"savage, indisputably true, and necessary smack down\"",
        "score": 1513,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Now all we need to do is DEFUND THE UN.",
                "author": "DeusVult1096"
            },
            {
                "raw_content": "It was nice but I'm sure it went in one UN ear and out the other. I wonder how much it cost the taxpayers today to host the pedophiles and thieves?",
                "author": "Framus"
            },
            {
                "raw_content": "&#65038; He made the Europeans look stupid for still cutting their carbon footprint. However he gave props to the new leaders in Germany for changing their mind, finally. &#65038;",
                "author": "BallotsOnRubysUSB"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Kevin Dalton, \"This is the white supremacy the left continually warns us about.\" These hoaxes are so common there is a web site Google hides from searches called fakehatecrimes.org that documents them.",
        "score": 1096,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Documented hate crime hoaxes, https://fakehatecrimes.org/ Also see the book [Hate Crime Hoax: How the Left is Selling a Fake Race War Kindle Edition](https://www.amazon.com/Hate-Crime-Hoax-Lefts-Campaign-ebook/dp/B07F6RN7Y4/ref=tmm_kin_swatch_0) by Wilfred Reilly, Professor of Political Science at Kentucky State University",
                "author": "JackLemon"
            },
            {
                "raw_content": "Those darned dark skinned white people.",
                "author": "comply863"
            },
            {
                "raw_content": "Hate hoaxes are hate crimes. Prosecute them just the same. Have an EO then federal law to that effect. Hate hoax = hate crime. Just the same as if the hate crime was authentic, it is equally a hate crime.",
                "author": "CleanUpPhillyTrump24"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: EVERY SINGLE High School in Oklahoma will now have its own Turning Point USA chapter, Oklahoma State Superintendent @RyanWalters_ announced. “Radical leftist teachers’ unions have dominated classrooms for far too long, and we are taking them back.” LFG! 🇺🇸",
        "score": 1039,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How I wish this would happen in Kentucky!",
                "author": "greenroomsh"
            },
            {
                "raw_content": "This is the way. The Communists need to be destroyed. Christ is King.",
                "author": "SaltyKrakenBalls"
            },
            {
                "raw_content": "[Andrew Kolvet: HUGE UPDATE — After Sunday's memorial for Charlie, TPUSA received a massive surge of inquiries to start new chapters. Pre-Sunday: We had around 60,000 inquiries Post-Sunday: We are now at over 120,000 inquiries Even accounting for attrition and duplicates, we are on the cusp of having a TPUSA or Club America chapter in every HS and College campus in America.](https://x.com/AndrewKolvet/status/1970588524404732051)",
                "author": "Mr_Rightside"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "When your wife knows that by cutting your teleprompter they're going to have to listen to you ramble for an extra hour about whatever comes to your mind. 😂",
        "score": 1896,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Such a beautiful soul!",
                "author": "EDDIT_IS_CUCKED"
            },
            {
                "raw_content": "Take away a man's teleprompter and you only prove you are about to hear the bigliest stories anyone has ever heard, but not in a braggadocios way, that I can tell you.",
                "author": "South_Florida_Guy"
            },
            {
                "raw_content": ">None of you seem to understand... the teleprompter doesn't protect me. The teleprompter protects you.",
                "author": "jsphere256"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Tom Homan Says 2 Million Illegal Aliens Have Exited U.S., Insists Deportations Will \"Explode\"",
        "score": 1352,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Moar. GIVE ME MOAR!",
                "author": "DeusVult1096"
            },
            {
                "raw_content": "Starting with non sanctuaries, might mean they all flee to sanctuary cities. In general, the sanctuary cities seem to have much more people.",
                "author": "billybaldwin2"
            },
            {
                "raw_content": "Make this a multi prong campaign: 1) ICE raids 2) Fine businesses hiring them 3) Cut off government gibs 4) Institute a bounty/reward system for each illegal scalp 5) Restrict or increase cost of work VISAS 6) Use civil asset forfeiture laws to strip them of all their wealth before tossing them over the border 7) End birthright citizenship 8) Cut off funding to municipalities or states that have sanctuary law",
                "author": "BoomShtick"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Peter Strzok Loses His Suit",
        "score": 782,
        "text_content": "",
        "comments": [
            {
                "raw_content": "he should be in Gitmo",
                "author": "VanillaCupCake"
            },
            {
                "raw_content": "He's the dude who made creepy gay demonic faces right?",
                "author": "JackAttack1776"
            },
            {
                "raw_content": "HE should have been the first one in jail for Russiagate but Bondi has failed.",
                "author": "Choppermagic"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Antifa terrorizing Eugene Oregon right now",
        "score": 946,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"hOw cAn mAgA tElL wHo iS aNtiFA\" How about we give that executive order some teeth? Can republicans ever stop being feckless cocksuckers and do something about these pedocommunist clowns? Weird how i'd be arrested by the cops in five minutes if I went and did this.",
                "author": "darkmodeforgotpass"
            },
            {
                "raw_content": "This is happening now. Can you imagine the wall-to-wall coverage if a bunch of MAGA guys in military gear were trying to forcefully take over or assault a federal building in a major city?",
                "author": "SteveBannonsNckbeard"
            },
            {
                "raw_content": "And what are we going to do about it?",
                "author": "DeusVult1096"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "someone at the UN intentionally stopped the escalator as the President and First Lady were stepping on, they need to be fired and investigated immediately.",
        "score": 1710,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not fired. US out of the UN. Not another dime. It's a failed shadow of its original concept.",
                "author": "CleanUpPhillyTrump24"
            },
            {
                "raw_content": "It was on purpose. The escalator stopped as soon as First Lady Melania and President Trump stood on it. The teleprompter stopped working when Trump took the stage. Then the microphones, which were audible for the previous speaker, were not amplifying sound at the same level when Trump started speaking.",
                "author": "Hammond"
            },
            {
                "raw_content": "Secret Service should have been all over this. It is their job to ensure their safety at all times. Period.",
                "author": "QueensOwn"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "66 ABC Affiliates Won’t Air Jimmy Kimmel After Nexstar Holds Firm",
        "score": 1764,
        "text_content": "",
        "comments": [
            {
                "raw_content": "how many are there total?",
                "author": "turdinthepunch"
            },
            {
                "raw_content": "Call to support and say \"thank you\" for not putting Jimmy Kimmel back on air. Sinclair phone number 410-568-1500 and Nexstar 972-373-8800",
                "author": "Hammond"
            },
            {
                "raw_content": "Good. That POS needs to find out. I hope the FBI is looking into his financials and interactions with children.",
                "author": "SneakyWino"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: In a major development, the New Jersey Fraternal Order of Police endorses Trump-backed JACK CIATTARELLI for New Jersey governor this November. Last time they endorsed, they supported a DEMOCRAT. FLIP IT RED! Go vote!",
        "score": 1803,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Too early to tell, but I think the people of NJ have had enough of California style government. Jack should just say he'll bring back plastic bags in supermarkets and he wouldn't even need to campaign.",
                "author": "proud_semi_fascist"
            },
            {
                "raw_content": "https://x.com/EricLDaugh/status/1970584062076289106 [New Jersey Gubernatorial Poll:](https://x.com/JeremiahW2044/status/1969797721453367793) - 🟥 Jack Ciattarelli- 46% - 🟦 Mikie Sherrill- 45% - 🟥 Ciattarelli +1% We are in the lead— let’s do this!! --- [And in case anyone missed it: Democrat Garfield NJ Mayor Everett Garnto LEFT the party, became a Republican, and endorsed Jack Ciattarelli for governor in the November 2025 election.](https://x.com/EricLDaugh/status/1964776724371296450)",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "Based NJ folk need to override the rot of Newark and take back their state. Praying for you all!",
                "author": "SaltyKrakenBalls"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "What would happen to someone who smoked and drank while pregnant and puts it on CCPtok?",
        "score": 1244,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Make your kids autistic to own Trump. I'm sure they'll understand.",
                "author": "Zskills"
            },
            {
                "raw_content": "They Did the Meme. They become the MEME . Please trump declare oxygen MAGA so the liberals post TikTok video putting a bag over their faces trying to Own Trump.",
                "author": "DT170x"
            },
            {
                "raw_content": "We didn't meme this into existence. We simply predicted the future.",
                "author": "IncredibleMrE1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "TONIGHT'S Jimmy Kimmel official apology: \"I'm sorry you Nazi's got your feelings hurt..... and FUCK Donald Trump.\"",
        "score": 1052,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# Hate watching is still watching!",
                "author": "IllKissYourBoobies"
            },
            {
                "raw_content": "This guy should have stuck to chicks bouncing on trampolines. # EVIL LOSER. SAD !!!!",
                "author": "MAGALOVER"
            },
            {
                "raw_content": "Can’t tell if this is fake or not. Or just a time traveler",
                "author": "Wrexxis780"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Democrats never let a crisis go to waste: The day Charlie Kirk was killed, California Rats pushed through an online censorship bill that allows the government to fine you up to $1,000,000 for a \"hateful\" tweet.",
        "score": 1249,
        "text_content": "",
        "comments": [
            {
                "raw_content": "First Amendment, Anyone??",
                "author": "TEXinLA"
            },
            {
                "raw_content": "Looks like California looked at the United Kingdom and said “Hmmm, you know what, we should emulate this”.",
                "author": "thisisatestof2"
            },
            {
                "raw_content": "Looks like the actual platform would be fined. https://legiscan.com/CA/text/SB771/2025 \"TITLE 23. Social Media Platforms Endangering Californians 3273.72. As used in this title, “social media platform” means a social media platform, as defined in Section 22675 of the Business and Professions Code, that generates more than one hundred million dollars ($100,000,000) per year in gross revenues. 3273.73. (a) A social media platform that violates Section 51.7, 51.9, 52, or 52.1 through its algorithms that relay content to users or aids, abets, acts in concert, or conspires in a violation of any of those sections, or is a joint tortfeasor in a violation of any of those sections, shall, in addition to any other remedy, be liable to a prevailing plaintiff for a civil penalty for each violation sufficient to deter future violations but not to exceed the following: (1) For an intentional, knowing, or willful violation, a civil penalty of up to one million dollars ($1,000,000). (2) For a reckless violation, a civil penalty of up to five hundred thousand dollars ($500,000). (3) If the evidence demonstrates that the platform knew, or should have known, that the plaintiff was a minor, the court may award up to twice the penalties described in this subdivision. (b) (1) For purposes of this section, deploying an algorithm that relays content to users may be considered to be an act of the platform independent from the message of the content relayed. (2) A platform shall be deemed to have actual knowledge of the operations of its own algorithms, including how and under what circumstances its algorithms deliver content to some users but not to others.\"",
                "author": "BidensAdvocate"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "What the UN did today to our President is disgraceful. We should cut their funding totally and evict them from New York. We don’t need them.",
        "score": 758,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Turn the building into a major deportation center",
                "author": "Salty_Sailor"
            },
            {
                "raw_content": "Can't we just have an episode of \"The Apprentice,\" where countries show their value to the coalition? Then cut funding to the worst each week?",
                "author": "billybaldwin2"
            },
            {
                "raw_content": "Trump needs to burn that place to the ground for what they did!",
                "author": "Trooph-Hurts"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "[Gamer Nexus] NVIDIA's Monopolistic Takeover",
        "score": 157,
        "text_content": "",
        "comments": [
            {
                "raw_content": "wow, 150+ comments in just 1 hour? it's a record for r/hardware.",
                "author": "Fritzkier"
            },
            {
                "raw_content": "Monopolistic... Takeover? They bought 5% of their stocks. Not 51%. Not 50%. Not 20%. Not even 10%. 5%. This is so bloody far from \"takeover\" by any imaginable terms.",
                "author": "GARGEAN"
            },
            {
                "raw_content": "The segment about why this is supposedly monopolistic is very weak. Nvidia has a monopoly on high end GPUs both Datacenter and Consumer, sure. But a stake in Intel doesn't really concern that. Neither would a full acquisition of Intel. Intel's smalls scale consumer GPU project aside they don't compete much.",
                "author": "iad82lasi23syx"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Steam Deck is now available for just $319",
        "score": 507,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If you add a USBC dock…that’s a pretty good price on a basic work desktop…..16GB of ram, support for upgrading the SSD, reasonably good enough cpu and gpu, built in battery backup.",
                "author": "Agloe_Dreams"
            },
            {
                "raw_content": "Isn't this just a sale? Title makes it seem like this is a price drop.",
                "author": "arandomguy111"
            },
            {
                "raw_content": "Here's hoping they refresh the device soon with improved performance! I love my deck but I'd be willing to shell out some more money for a performance upgrade.",
                "author": "slrrp"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Microsoft microfluidic cooling (etched microchannels on the chip)",
        "score": 42,
        "text_content": "",
        "comments": [
            {
                "raw_content": "[https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9785822](https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9785822) paper demonstrating testing on a i7 8700K",
                "author": "bosoxs202"
            },
            {
                "raw_content": "I don't understand how this can possibly stay clog free. I think most of us have seen what an AIO block, or custom water loop block looks like after a year or two. Those fins on those blocks are much further apart than this stuff. Even if it doesn't gunk up after a while, I'd think simple fluid friction would wear down the metal in a matter of months, if the channels are like 0.1mm apart.",
                "author": "bubblesort33"
            },
            {
                "raw_content": "What happens when an extreme overclocker + engineers meet in a MS Azure team lol. Kidding, I have no idea, but the parallels with CPU delidding + OCing are similar. >“Whenever we have spiky workloads, we want to be able to overclock. **Microfluidics would allow us to overclock without worrying about melting the chip down** because it’s a more efficient cooler of the chip,” Kleewein said. “There are advantages in cost and reliability. And speed, because we can overclock.” Really unique chanels they etched; I wish we had a before / after chart instead of \"65% lower\". // While this looks like an x86 CPU from the markings, it's interesting MS mentions their custom silicion, Maia (AI accelerator) and Cobalt (Arm Neoverse CPU) here. If you can 100% control the roadmap releases, the dies, the sockets, the packages, it gives them a bigger opening to move past prototypes…",
                "author": "-protonsandneutrons-"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "The 3dfx Voodoo UNLEASHED",
        "score": 51,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TL;DW The architecture of the original 3dfx Voodoo from 1996 would actually allow for an extra texture mapping unit and additional memory. This homemade card does just that and is benchmarked against a Voodoo 1 that was available for retail.",
                "author": "Oligoclase"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[ChipWise] Apple A19 Die Shot Analysis",
        "score": 71,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wow that was fast. Do they have A19 Pro shots as well?",
                "author": "Affectionate-Memory4"
            },
            {
                "raw_content": "Here is u/high_yield_yt's overview of the SoC [https://nitter.net/highyieldYT/status/1970533400151818256](https://nitter.net/highyieldYT/status/1970533400151818256) Pretty impressive considering he states it is smaller than previous A18 non-Pro which is [\\~90mm2](https://nitter.net/highyieldYT/status/1841074082898452538) and the A19 from Geekerwan's analysis is better thab the A18 Pro in all fronts.",
                "author": "Noble00_"
            },
            {
                "raw_content": "The link leads to die shots but no analysis.",
                "author": "RRgeekhead"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Overclockers breach 13 MT/s on RAM for the first time: a single 24GB stick of Corsair Vengeance CUDIMM DDR5 running at 6,510 MHz",
        "score": 50,
        "text_content": "",
        "comments": [
            {
                "raw_content": "13 MT/s? Shouldn't it be 13 GT/s or 13,000 MT/s?",
                "author": "Iselka"
            },
            {
                "raw_content": "13020 megatransfers per second w/ a CAS latency of 68",
                "author": "cyber_doc1"
            },
            {
                "raw_content": "The one bit Corsair is still a good to to for nowadays is their DIMMs and probably their CAMM2 when it launches. Overpriced compared to the other go-to, GSKILL, but still a decent option.",
                "author": "Jeep-Eep"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Thermalright Royal Pretor Ultra review with Ryzen 9950X3D",
        "score": 3,
        "text_content": "As the description says, the test was done in a home setup. Still, one clear takeaway is that the middle fan on the Thermalright Royal Pretor Ultra seems a bit too weak — it struggles to push air through the dense fin stack. Or maybe it’s just better optimized for Intel CPUs? What do you guys think? For context, in my own rig I’m running the Royal Pretor Ultra with two Phanteks T30 fans. [https://imgur.com/a/YcHQRCx](https://imgur.com/a/YcHQRCx) How about I run a comparison between the stock fan setup and 2× Phanteks T30s, but on a Ryzen 9700X — maybe with the TDP bumped up to 105 W?",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "I bought the cheapest 14\" Laptop at Walmart ! HP Laptop 14 Review - 14-ep2012wm",
        "score": 4,
        "text_content": "\"HP has a super inexpensive laptop available at Walmart that is surprisingly useful and upgradeable for its $179 price tag. A great pairing for Linux.\"",
        "comments": [
            {
                "raw_content": "I would still rather buy used thinkpad for $180",
                "author": "airtraq"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Mario Kart World Version 1.3.0 is out now",
        "score": 675,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“The \"Free Roam\" map now displays the locations of P Switches you've run over and Peach Medallions you've obtained” Finally!",
                "author": "DeanMcCoppen"
            },
            {
                "raw_content": "Patch Notes: **General** * You can now join friends playing \"Knockout Tour\" by selecting \"Friends\" from \"Online Play\" \"1p.\" * Up to 2 players can now play \"Free Roam\" while waiting if the game was full when trying to join friends playing \"Race,\" \"Knockout Tour\" or \"Battle\" in \"Online Play.\" * The \"Free Roam\" map now displays the locations of P Switches you've run over and Peach Medallions you've obtained. * You can now select a P Switch from the map and move to a location near the P Switch. * In \"Free Roam\", you can now transform into the character pulled into the UFO. * If \"Dash Food\" in \"Settings/Controller\" is set to \"Doesn’t transform\" then you will not transform. * It is now easier to encounter UFOs in \"Free Roam.\" * The conditions for the appearance of some Peach Medallions in \"Free Roam\" have been adjusted. * When spectating in \"Knockout Tour\" or \"Balloon Battle\" in \"Online Play\" or \"Wireless Play\", you can now choose who to watch, even if you are holding the Joy-Con 2 or Joy-Con horizontally. * Decreased the time between when an item box is taken by someone and the next time it is revived. * Increased the invincible time after spinning or crashing during a race. * Reduced the force of jumps when landing on a rival from above. * Decreased the amount of time between when you finish and when spectating begins in \"Knockout Tour\" or \"Balloon Battle\" in \"Online Play\" or \"Wireless Play.\" * Decreased the amount of time between passing through the checkpoint and when the ranking is displayed in \"Knockout Tour\" in \"Wireless Play\" and \"LAN Play.\" * Further increased the frequency of lap-type courses appearing in the selection when choosing the next course in \"VS Race\" and wireless races. **Fixed Issues** * Fixed an issue in \"Online Play\" and \"Wireless Play\" where the ranking would sometimes become incorrect if a player went off course at the same time as reaching the finish line. * Fixed an issue in \"Grand Prix\", \"Knockout Tour\", and \"VS Race\", where the CPU's ranking would sometimes drop after reaching the finish line. * Fixed an issue in \"Knockout Tour\" in \"Online Play\" where other players' ratings would sometimes appear as \"0\" on the results screen. * Fixed an issue where a Spiny Shell would sometimes pass the first place player in \"Wireless Play\" or \"Online Play.\" * Fixed an issue where players would sometimes be sent flying backwards a great distance when hit by a Spiny Shell. * Fixed an issue where the second item in an item slot would sometimes not disappear when hit by Lightning. * Fixed an issue where hitting the base of a pillar in mid-air would sometimes cause a large jump. * Fixed an issue that sometimes caused movement to become unstable when doing a wall ride on water. * Fixed an issue where players would sometimes be swept away strongly after landing when doing a mini jump while going up a river. * Fixed an issue where players would sometimes pass through the ground when hit by a car driving on the road. * Fixed an issue in \"Free Roam\" where players would sometimes be unable to enter pipes correctly after exiting a trailer. * Fixed an issue where the results screen would sometimes become distorted after spectating \"Balloon Battle\" in \"Online Play.\" * Fixed an issue where the game would sometimes not proceed to the course selection screen after exiting a pipe during \"Free Roam\" in \"Online Play.\" * Fixed an issue where Bullet Bill would sometimes slip through walls when used in \"Sky-High Sundae.\" * Fixed an issue where players would sometimes get stuck on a wall at the start of the race heading from \"Airship Fortress\" to \"Shy Guy Bazaar.\" * Fixed an issue where players would sometimes get stuck in walls when using a Bullet Bill in \"Bowser’s Castle.\" * Fixed an issue in \"Cheep Cheep Falls\" where item boxes were sometimes difficult to pick up when Smart Steering was turned on. * Fixed an issue in \"Knockout Tour\" \"Spiny Rally\" where sometimes there was an item box buried in the ground. * Several other issues have been addressed to improve the gameplay experience.",
                "author": "Skullghost"
            },
            {
                "raw_content": "YouTubers: Is Mario Kart World SAVED?",
                "author": "Rawkhawkjayhawk"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Borderlands 4 delayed indefinitely on Nintendo Switch 2, statement released",
        "score": 700,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Randy wtf happened",
                "author": "Unfair-Theory-mind"
            },
            {
                "raw_content": "I feel like it's not coming",
                "author": "unwisest_sage"
            },
            {
                "raw_content": "I mean let's face it - the last thing Nintendo needs is an unoptimised piece of shit game making people tall about whether the Switch 2 is a bad piece of hardware or not. Its clear what good devs/optimisation can achieve - look at monolithsoft for example. And then conversely - you have your game freaks. I think Nintendo told them to take it back to the drawing board until it runs well - they dont need the bad publicity.",
                "author": "montious"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I think the complaints about the \"lack of exclusives\" on Switch 2 shows how much the Switch benefited from the Wii U's failure in 2017/2018.",
        "score": 83,
        "text_content": "I have seen a lot of people complain that the Switch 2 has a \"lack of big first-party exclusives\". I have also seen people dismiss Pokemon Legends Z-A and Metroid Prime 4 because \"those are Switch 1 games, therefore they don't count\". I think these complaints actually show one of the main challenges Nintendo are facing with the Switch 2: the lack of Wii U ports to rely on. The failure of the Wii U actually was GREAT for the Switch's early years, particularly 2017/2018. Every Wii U game could be sold as a \"new exclusive Switch game\" to the vast majority of the audience. If you remove all the Wii U games, Switch 2 Editions and \"cross-gen\" games, then the first year exclusives for the Switch and Switch 2 are actually pretty similar to each other. The first 12 months of the Switch 1: \\- 1-2 Switch \\- ARMS \\- Splatoon 2 \\- Mario + Rabbids: Kingdom Battle \\- Super Mario Odyssey \\- Xenoblade Chronicles 2 The first 12 months of the Switch 2: \\- Mario Kart World \\- Donkey Kong Bananza \\- Hyrule Warriors Age of Imprisonment \\- Kirby Air Riders \\- Mario Tennis Fever \\- Yoshi and the Mysterious Book If you add the games that were non-exclusives, then the Switch has BOTW and Mario Kart 8 Deluxe, while the Switch 2 has Pokemon Legends Z-A and Metroid Prime 4. TL;DR: The Switch 2 actually has about the same number of first-party exclusives as the Switch 1 in the first 12 months. But this feels different for most people because they did not own a Wii U, and thus saw Wii U games as being equivalent to brand new exclusives like Mario Odyssey. Cross-gen games like Metroid Prime 4 are criticised more now because almost everyone who is considering a Switch 2 already owns a Switch 1.",
        "comments": [
            {
                "raw_content": "I remember people forcing to buy themselves games like Snake pass or I am Setsuna, games that were barely average, because the amount of games you could find on switch1 was completely barren the first year. You can’t say that now with 3rd party support. Which is something people has been bitching about for years. To summarize, people is always going to complain, no matter what happens",
                "author": "Morvisius"
            },
            {
                "raw_content": "If people think we have it bad, you should see PS5 owners, LOL",
                "author": "PassionateEruption"
            },
            {
                "raw_content": "I had a Wii U, I didn't feel the need to get a Switch until TOTK, tbh, so this was true for me. Helped that PS4/XB were also killing it, so was kept pretty busy, mind.",
                "author": "AlexWrightWhaleSex"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Yakuza Kiwami 3 + Dark Tides releasing on Switch 2 Februrary 12th 2026",
        "score": 101,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If you start playing yakuza 0 now and only sleep 2 hours a night you can be caught up by release day!",
                "author": "Hugh_Jegantlers"
            },
            {
                "raw_content": "Despite RGG Studios games being essentially PS4 tier games, I was still caught off guard of this coming to the Switch 2 and the same days as every console.",
                "author": "KelvinBelmont"
            },
            {
                "raw_content": "I still need to finish Kiwami 1 and 2.",
                "author": "MoneyMakingMugi"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Angled Dock Stands",
        "score": 152,
        "text_content": "I bought this stand back in June and it’s been excellent. It’s sold by SeaANeed on Etsy. It seems to provide sufficient airflow and I added some rubber feet so it wouldn’t slide around. How are y’all handling your TV stand setup?",
        "comments": [
            {
                "raw_content": "Ah, full circle. Welcome back, Nintendo Entertainment System!",
                "author": "Cat5kable"
            },
            {
                "raw_content": "Who do you think you are Sakurai? Put your dock normal like the rest of us 😂",
                "author": "zaadiqoJoseph"
            },
            {
                "raw_content": "Not having young children must be so nice",
                "author": "Afraid_Raccoon_6208"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I can't wait to find 999 of these in Metroid Prime 4 ⚡️",
        "score": 939,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/y9zz45pwdxqf1.jpeg?width=1052&format=pjpg&auto=webp&s=3b81d48632456b2258d348fd2b4de0e66004f55f",
                "author": "thetaurusgaymer"
            },
            {
                "raw_content": "If you collect them all, the chick in the armor reveals she’s a robot this whole time.",
                "author": "TheGreatFabsy"
            },
            {
                "raw_content": "Thank you for this, gave me a good laugh! (Nintendo please don't do this though...)",
                "author": "Venokris"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Would love to play this in handheld!",
        "score": 1249,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Honestly, just the possibility of it coming to Switch is the only reason I haven't played/binged it yet.",
                "author": "Kevin-the-Nerd"
            },
            {
                "raw_content": "I hope they will! Handheld gaming is way more populair in asia an europe than in NA, but WRPG are less popular in Asia. I think it could be a good way to sell it more there",
                "author": "Roman_Suicide_Note"
            },
            {
                "raw_content": "The game runs pretty well on Steam Deck, and the developers have already said they're looking into whether it's possible to make the game for Switch 2, so I don't see why it wouldn't be released.",
                "author": "--TeaBow--"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Loving the vistas in SW Outlaws",
        "score": 39,
        "text_content": "This game seriously looks so nice on Switch 2",
        "comments": [
            {
                "raw_content": "Scenery 9/10. Hair 1/10. Especially Pic 6.",
                "author": "StockHumor4768"
            },
            {
                "raw_content": "Finally a powerful Switch!",
                "author": "Garay_GameDev"
            },
            {
                "raw_content": "I’m so close to buying it but hoping for an early discount in the next month or so!",
                "author": "Bleekster"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "[MEGATHREAD] PlayStation State Of Play",
        "score": 207,
        "text_content": "[https://cdn.mos.cms.futurecdn.net/8mktSdxBJcZMFXXwaFjVMS.png](https://cdn.mos.cms.futurecdn.net/8mktSdxBJcZMFXXwaFjVMS.png) |PlayStation State of Play| |:-| |**Date/Time:** September 24 2025, 2PM P.T./ 5PM E.T. ([CLICK HERE TO SEE IN YOUR TIMEZONE](https://dateful.com/eventlink/1551610799))| |**Where to Watch:** [PlayStation YT](https://www.youtube.com/watch?v=0QcEoGC51ZY)| |[What To Expect](https://blog.playstation.com/2025/09/23/state-of-play-returns-this-wednesday-september-24/)|",
        "comments": [
            {
                "raw_content": "I am gonna be completely delusional and hope for some Ratchet and Clank news",
                "author": "wiggletothetop"
            },
            {
                "raw_content": "State of Play predictions: - Saros gameplay (already confirmed) - Wolverine trailer - GOW 2.5D metroidvania reveal. - New Marvel Tokon character reveals - Nothing shown for Fairgames.",
                "author": "Spider-Fan77"
            },
            {
                "raw_content": "It won't be the best place, and I know it's unlikely, but I want MGS Volume 2.",
                "author": "Mavericks7"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Discussion, News, and Request Thread - Week Beginning 09/22/25",
        "score": 42,
        "text_content": "[https://i.pinimg.com/736x/4a/3a/3c/4a3a3c90fbb420ce864ac67f55968faf.jpg](https://i.pinimg.com/736x/4a/3a/3c/4a3a3c90fbb420ce864ac67f55968faf.jpg) Discussion threads are your weekly central hub for all requests, gaming news, and any other gaming topics you want to talk about. *Please keep all content that doesn't need it's own post to this thread to de-clutter the sub for proper leaks and rumors. Thanks!* **Join our new companion sub for super secret Resident EVIL 9 and Half-Life 3 leaks** \\-- [r/OkBuddyGLAR](https://new.reddit.com/r/OkBuddyGLAR/) Hot Threads of the past week: * [New details on the Assassin’s Creed Black Flag remake](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1nin65z/new_details_on_the_assassins_creed_black_flag/) * [Image of an apparently leaked Resident Evil Requiem document has been posted on 4chan. Doesn't show much...except for the design of a certain returning character that's rumoured to be in the game.](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1nkqkls/image_of_an_apparently_leaked_resident_evil/) * [Sony is looking to licence out Decima engine to more devs](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1njnhdo/sony_is_looking_to_licence_out_decima_engine_to/) * [nothing is happening with Bloodborne after checking in on it recently](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1nkzjlj/jeff_grubb_says_he_continues_to_hear_that_nothing/) * [Yakuza Kiwami 3 leaked on the RGG website](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1njc66m/yakuza_kiwami_3_leaked_on_the_rgg_website/) # [Want to help us improve this subreddit? ](https://forms.gle/w9JaYTjVN1Zie9e39)[Provide us with feedback here](https://forms.gle/w9JaYTjVN1Zie9e39)[!](https://forms.gle/w9JaYTjVN1Zie9e39) # [Click here to join the discord to enjoy further conversations with the community!](https://discord.gg/6jdBvCSqbj)",
        "comments": [
            {
                "raw_content": "One for the road, bub. See you tomorrow ![gif](giphy|GV53c1VNt0x4k)",
                "author": "MyMouthisCancerous"
            },
            {
                "raw_content": "Hope we get a sequel for milf manor 3 this week",
                "author": "VictorVonDoomer"
            },
            {
                "raw_content": "Forsen",
                "author": "Habibipie"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Yakuza Kiwami 3 officially announced",
        "score": 157,
        "text_content": "[Just unveiled at RGG Studio Summit](https://www.videogameschronicle.com/news/yakuza-kiwami-3-a-remake-of-yakuza-3-has-been-officially-announced/) * Full remake of *Yakuza 3* in the Dragon Engine with revamped gameplay * Kiryu's Hawaiian shirt no longer makes him look like Kamurocho Quagmire * Teriyuki Kagawa replaces George Takahashi as Goh Hamazaki; Show Kasamatsu replaces Tatsuya Fujiwara as Rikiya Shimabukuro * Full English dub as is customary with series releases since *Like a Dragon* * Full side-story titled \"Dark Ties\" starring Yoshitaka Mine, providing backstory to how he became involved with the Nishikiyama family and subsequently the Tojo Clan prior to the game's events, will intersect with Kiryu in some fashion Releasing **February 12, 2026** for **PlayStation 4**, **PlayStation 5**, **Nintendo Switch 2**, **Xbox Series X|S** and **PC** [Previous rumor](https://www.reddit.com/r/GamingLeaksAndRumours/s/pcfw7gdRa0)",
        "comments": [
            {
                "raw_content": "> No platforms or release window confirmed been confirmed for everything (PC, PS4/5, Xbox Series S/X, Switch 2) and a February 11th release",
                "author": "blackthorn_orion"
            },
            {
                "raw_content": "Incredible news. They were always going to make this, but I felt like they said recently it would be awhile. Now I feel like I should wait for this instead of playing 3 remastered",
                "author": "Meb2x"
            },
            {
                "raw_content": "Okay so February has: - Dragon Quest 7 Reimagined - Mewgenics (anticipated new game from Binding of Isaac dev) - Mario Tennis Fever - Yakuza Kiwami 3 - Tides of Tomorrow - High on Life 2 - Resident Evil: Requiem - Nioh 3 (Just leaked) Not bad at all! And more will be added I’m sure. Sorry if formatting sucks, I’m on mobile. Edit: 20 minutes after I posted this, Nioh 3 was leaked to come out in February lmao. So I’ll add that to the list.",
                "author": "Greatsnes"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Nioh 3 launches February 6 2026 according to Amazon Japan",
        "score": 83,
        "text_content": "- Seems like this is one of the games getting shown at the State of Play - One day off from the original Nioh release in 2017 - The Treasure Box edition includes a B5-size official art book, a selection soundtrack CD, an original desk mat, and a Sunekosuri fur ball key chain Source: https://www.gematsu.com/2025/09/nioh-3-launches-february-6-2026",
        "comments": [
            {
                "raw_content": "Gaming companies sure love February. RE9 Yakuza 3 Remake Nioh 3 Dragon Quest VII Reimagined",
                "author": "THE_HERO_777"
            },
            {
                "raw_content": "I wonder if we're gonna get a new demo? I missed the last one sadly",
                "author": "Notathroway69"
            },
            {
                "raw_content": "Lmao 20 minutes after I made [this](https://www.reddit.com/r/GamingLeaksAndRumours/s/S2kFCldHFd) comment, here’s another February game added. Shaping up to be a great month.",
                "author": "Greatsnes"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Seems like the SOMA update brought with it a teaser for the next Frictional Game",
        "score": 112,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I fucking love soma. I cant wait to see what they are cooking next.",
                "author": "epiccodtion"
            },
            {
                "raw_content": "[Video in question](https://www.youtube.com/watch?v=CyVUDnIUON8)",
                "author": "Slarg232"
            },
            {
                "raw_content": "Soma balls",
                "author": "Ok_Challenge_165"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "State of Play confirmed for September 24",
        "score": 941,
        "text_content": "[Tune in for 35+ minutes of reveals and news from PlayStation Studios and developers around the world](https://x.com/PlayStation/status/1970488481483739200) [Previous Rumor](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1ni0bsx/natethehate_sony_has_a_presentation_soon/)",
        "comments": [
            {
                "raw_content": "Nate does it again! S+ tier",
                "author": "respectablechum"
            },
            {
                "raw_content": "\"We’ll share new looks at anticipated third-party and indie titles, plus updates from some of our teams at PlayStation Studios – including an extended look at Saros, Housemarque’s mysterious new title arriving next year. Look forward to nearly five minutes of gameplay captured on PS5.\" I love Returnal this is music to my ears",
                "author": "OptimusPrimalRage"
            },
            {
                "raw_content": "I hope they announce Balan Wonderworld 2",
                "author": "Financial-General163"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Resident Evil Requiem pre order",
        "score": 32,
        "text_content": "I’m not sure if this is new but RE9 has become available to pre order in the uk this morning as far as I can tell. It’s on Amazon,, HMV and Smyths Toys from what I’ve seen. The price is between £70 and £60 depending on the retailer or platform. I’ve only found it for PS5, Xbox Series consoles and Nintendo Switch 2. This means it is likely to be announced some time today either at the state of play or the Capcom TGS show that I’ve seen people mention that is today Amazon: https://www.amazon.co.uk/s?crid=395P8L4DMVLMI&k=resident%20evil%20requiem&ref=glow_cls&refresh=1&sprefix=resident%20ev%2Caps%2C98 Smyths Toys: https://www.smythstoys.com/uk/en-gb/search?text=Resident+evil+requiem HMV: https://hmv.com/search?searchtext=Resident+evil+requiem&searchcategory= Edit: If this is old news and not something leaked by retailers then I’ll delete it Edit 2: I’ve checked a couple of other retailers, most that I’ve seen sell games in the past have it listed with the same temporary cover art and the same price range. The only place with cover art is Play Asia. I think the cover art there is temporary too but currently it is the only place that doesn’t seem to call the art temporary.",
        "comments": [
            {
                "raw_content": "The fact the cover is still not being shown makes me think Leon is on it.",
                "author": "Soren319"
            },
            {
                "raw_content": "Not the first time we've gotten an RE9 retailer leak. It only popping up for current-gen systems makes me think Dusk Golem caught wind of the Switch 2 version, and speculated that they're making a PS4 version from there.",
                "author": "lattjeful"
            },
            {
                "raw_content": "I definitely think this has some credibility to it. The only pre-orders that have been up have been from smaller 3rd party sites or with Capcom’s distributor Plaion in Spain. These listings being from big retailers and not mentioned before this must mean that it might be at state of play + expanded upon on that panel on the 27th/28th!",
                "author": "ImmersedClaudette"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Kojima's new horror game OD could be connected to Silent Hills",
        "score": 618,
        "text_content": "Fans have already figured out what is behind the redacted text in the [new trailer](https://www.youtube.com/watch?v=eHCqxLtwy5g) [https://www.reddit.com/r/OD\\_Kojima/comments/1noc535/seems\\_right/](https://www.reddit.com/r/OD_Kojima/comments/1noc535/seems_right/) The text reads: \"TEN YEARS SINCE THE LEGENDARY HORROR GAME \"P.T.\" THE CURSED SURVIVORS HAVE ONCE AGAIN VENTURED INTO THE FORBIDDEN. \\[...\\]\" This could just be a reference to Kojima's old project but calling out P.T. directly by name in the trailer like that feels like there might be more to it Previous rumour: https://www.reddit.com/r/GamingLeaksAndRumours/comments/18fuz3e/hideo_kojima_and_xboxs_od_trailer_had_some_blink/",
        "comments": [
            {
                "raw_content": "He’s literally hinted that this is the case every time OD has been talked about. Not that OD is directly connected to silent hills but OD will in essence contain what his larger vision for PT actually was",
                "author": "Dull-Caterpillar3153"
            },
            {
                "raw_content": "Is this gonna be a max payne/alex casey from Alan wake 2 situation?",
                "author": "Carlosless-World"
            },
            {
                "raw_content": "Here we go again.",
                "author": "DaisyMarioTennisSexy"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Argos UK has leaked the price of the ROG Xbox Ally non-X (it's £499.99)",
        "score": 168,
        "text_content": "Source: https://www.reddit.com/r/XboxAlly/comments/1noiosm/i_work_at_argos_and_seems_to_be_pre_orders_atart/ Images: https://preview.redd.it/3irv8k5bbxqf1.jpg?width=1848&format=pjpg&auto=webp&s=6b22eca39e624d4bde0ea1a3e04cac8b089bd6f8 https://preview.redd.it/37j74hfbbxqf1.jpg?width=1848&format=pjpg&auto=webp&s=2ad0008d607b8c3e6e99153af80670163e3cb45b If you exclude VAT and convert to USD, this would be roughly ~$540 which would line up pretty closely with the Best Buy leak and billbil-kun's reporting (both said $549.99 USD for the base model)",
        "comments": [
            {
                "raw_content": "My speculation: the tariff situation might be impacting Microsoft's decision making here. If I remember correctly consoles are included in the tariffs but computers are excluded for now. I wonder what these handheld things are considered since they are an Xbox (this might explain why we don't have pricing yet when we really should)",
                "author": "Fidler_2K"
            },
            {
                "raw_content": "Just ordered a Legion Go S because it was £300. Looks like I made the right choice because a quick Google search tells me the SoC is better in that than the Xbox Ally.",
                "author": "Dannypan"
            },
            {
                "raw_content": "I love my Steam Deck but I feel like despite the many variations and power differences these uber strong PC handhelds are still ultimately going to be running late PS4-PS5 era games at 30-40fps, while being massive loud battery hogs. I don't see the point right now until a major evolution comes along. Star Wars Outlaws on Switch 2 is definitely contributing to that outlook. Feels like that system will fare much better with future games than these other handhelds which are brute forcing the PC versions. Best use cases for them imo are portable indies, emulation, PS4 and before games as well as really old games from like 2006 that are not on modern consoles. But the Steam Deck can do all that just fine, more power is redundant.",
                "author": "DemonLordDiablos"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Paul Tassi: Marathon won't be at the State of Play",
        "score": 283,
        "text_content": "[https://www.forbes.com/sites/paultassi/2025/09/23/bungies-marathon-not-at-sonys-new-state-of-play-next-look-months-away/](https://www.forbes.com/sites/paultassi/2025/09/23/bungies-marathon-not-at-sonys-new-state-of-play-next-look-months-away/) >Marathon is not at the State of Play. No release date, nothing. Marathon is not about to be imminently discussed in some longer Bungie presentation after “going dark.”, earliest we will see something more from Marathon is November, \"maybe\" for now",
        "comments": [
            {
                "raw_content": "Good",
                "author": "SuddenDepact"
            },
            {
                "raw_content": "They are probably preparing for a re-reveal. Showcase all the progress and changes they have made since the closed alpha back in April.",
                "author": "Zhukov-74"
            },
            {
                "raw_content": "I really do hope that Bungie is able to turn things around with Marathon. But man, I wish so much that it wasn't an extraction shooter.",
                "author": "jwhudexnls"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "After 9 months, how much has the b580 improved now?",
        "score": 3,
        "text_content": "So, even though great card, the arc b580 had a lot of overhead and some driver issues on release. I mean the price had skyrocketed as well but every card was above its msrp anyways. So how much of the problems would you say have been solved since release I really do wanna buy the card.",
        "comments": [],
        "subreddit": "intel"
    },
    {
        "post_name": "Graphics Driver Support Update for 11th Generation through 14th Generation Intel Processor Graphics",
        "score": 8,
        "text_content": "",
        "comments": [],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD Ryzen 7 9800X3D now selling for $429, 10% off retail - VideoCardz.com",
        "score": 147,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I bought a 9800x3d at launch for msrp and was fully expecting this thing to go down in price. Amd is normally pretty aggressive with price cuts and the rest of zen 5 got discounted in 2 months after launch. We are only getting a 50 dollar discount now cause intel shit the bed hard and gave no competition. The biggest competition amd has is to themselves with the 7800x3d lol.",
                "author": "averjay"
            },
            {
                "raw_content": "7800X3D consistently on ebay for $300. That’s the AM5 X3D CPU to get at that price",
                "author": "Sgt_Dbag"
            },
            {
                "raw_content": "Been almost a year, and price only went down 10%, while demand was likely incredible. Congratulations AMD, you found a winner Release date * November 7, 2024 * US $479 Now * 23 Sept 2025 * US $429",
                "author": "WarEagleGo"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Wall Street falls from all-time highs as Fed chairman warns of unseen risk to the US economy | Fed Governor “concerned that, in the current environment, declines in house prices could accelerate, posing downside risks”",
        "score": 373,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You know the economy is broken when houses becoming affordable is seen as a bad thing.",
                "author": "Likely_a_bot"
            },
            {
                "raw_content": "Oh, okay. Message to house sellers, never reduce prices and never sell because nobody can afford it. This is the sign of a healthy economy.",
                "author": "a_little_hazel_nuts"
            },
            {
                "raw_content": "Even the most uneducated look at a graph of housing prices reveals the creation of an RE bubble as a result of the Fed's zero interest rate policy. Not only is an adjustment welcome, it's necessary. But I expect it to take 2-4 years. Housing is slow.",
                "author": "followedthemoney"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage Rates Expected to Move Below 6 Percent by End of 2026",
        "score": 71,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I feel like I’ve heard this before",
                "author": "Bigdaddyblackdick"
            },
            {
                "raw_content": "They have no fucking idea",
                "author": "CookabrryJiglet"
            },
            {
                "raw_content": "Rates would need to drop to 3.5 to 4% again to have a meaningful impact on affordability. Of course that is well below the historical average and would just cause further distortion in the housing market. It would also require a Fed funds rate of 0-2% depending on the yield curve. Those rates would reignite inflationary pressures, especially given how much cash is sitting in the system. A sub 6% rate by the end of 2026 isn’t going to save house prices. They will continue to soften until affordability normalizes again. We could even see an over correction as the market tends to do in each direction.",
                "author": "Clever_droidd"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Data shows the \"Wall Street is buying America\" narrative is a myth. Small landlords (1-5 properties) own 87% of investor-held homes, while mega-investors (<2%) have been net sellers for 6 consecutive quarters.",
        "score": 81,
        "text_content": "The BatchData InvestorPulse Q2 housing report seems to challenge the dominant narrative about who owns investor-held real estate in the US. The findings are based on a refined analysis of 17 million properties. Here's the breakdown of ownership: * **1-5 properties:** 87% (14.5 million homes) * **6-10 properties:** 3.9% (653,000 homes) * **11-50 properties:** 4.5% (753,000 homes) * **51-100 properties:** 1.0% (168,000 homes) * **100-1,000 properties:** 1.6% (270,000 homes) * **1,000+ properties:** 2% (345,000 homes) What's striking is that mega-investors (1,000+ homes) have been **net sellers for the last six quarters**. In Q2 2025 alone, they sold 5,800 homes and only bought 4,069. The report suggests they are pivoting from buying existing homes to financing new build-to-rent developments, adding supply rather than competing for it. This raises a question: Are policies aimed at curbing institutional buying targeting the right group? It seems the vast majority of investor-owners are small-scale, local players. **Source:** BatchData Q2 2025 Investor Pulse Report: [`https://batchdata.io/investor-pulse-q2-2025`](https://batchdata.io/investor-pulse-q2-2025)",
        "comments": [
            {
                "raw_content": ">Are policies aimed at curbing institutional buying targeting the right group? What policies?",
                "author": "NorCalJason75"
            },
            {
                "raw_content": "Well yeah, we've spent the last 30+ years telling the middle and upper-middle classes that small-time landlording is the best way to generate passive income. And based on my renting experience it's honestly worlds better to rent from those small-timers. You can build up a personal relationship and if you're a good tenant you can have a wonderful - and under market value cost - time.",
                "author": "Less-Fondant-3054"
            },
            {
                "raw_content": "Who says that an institutional buyer can’t make smaller LLC’s or what not to mask its identity?",
                "author": "kaiserwongze"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Single-family rent growth is starting to show new weakness",
        "score": 72,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It makes sense that the rate of rent increase is slowing, but it is important to note that rents are not falling. With many potential buyers waiting for lower rates, there seems to be plenty of available renters.",
                "author": "Aromatic_Tomato8651"
            },
            {
                "raw_content": "KEY POINTS * Single-family rent prices in July increased 2.3% from the same month last year, which is slower than the 3.1% average increase a year ago, according to the latest data from Cotality. * Rent growth has now fallen below the lower end of the 10-year average range of pre-pandemic growth. * “Even markets like Los Angeles, which had been buoyed by post-wildfire demand, are now cooling off,” said Molly Boesel, senior principal economist at Cotality. After strengthening in the first half of this year, single-family home rents began to slow in July. This could be a sign that as the consumer struggles, landlords are going to have to move to meet them. Single-family rent prices in July increased 2.3% from the same month last year, which is slower than the 3.1% average increase a year ago, according to the latest data from Cotality. Rent growth has now fallen below the lower end of the 10-year average range of pre-pandemic growth. “After a strong start to the year, single-family rent growth is clearly losing steam,” said Molly Boesel, senior principal economist at Cotality. “In July, we broadly saw weakening in annual single-family rent growth across metro areas and price tiers.” Rent growth was just 0.2% higher in July compared with June, which is far below the historical July average monthly growth of 0.7%. That is a notable shift from monthly gains that had been stronger than usual earlier this year. “Even markets like Los Angeles, which had been buoyed by post-wildfire demand, are now cooling off. Chicago stands out as the exception, leading the nation in rent growth amid tight inventory and resilient demand,” said Boesel. Looking just at the 10 largest metropolitan markets, Chicago was in the lead at 5.1% rent growth, and the New York City metropolitan area came in second at 3.7% growth. Philadelphia and Washington, D.C., followed, and while Los Angeles is slowing, it still rounds out the top five for rent growth. Dallas and Miami were the lowest of the 10, with Miami seeing no rent growth at all. Compare that to 2022, when pandemic-driven migration to the Suth caused Miami’s annual rent growth to soar 40%. Rent growth also weakened at all price points. For high-end properties, national average rents increased 2.9% from a year ago, down from the 3.2% annual gain seen last July. The same trend was seen in low-end rents, which increased 1.6% annually in July, down from the 2.8% gain in July 2024. Single-family rents had been doing much better than apartment rents over the last few years, as an enormous amount of supply came on the multifamily market. Single-family rentals were also in high demand due to the skyrocketing prices in the for-sale market. Families, which tend to be buyers, were opting for rental homes in good school districts instead. Single-family rental REITs, like Invitation Homes and American Homes 4 Rent, have actually been building more rental communities just to keep up with that demand, so it will be interesting to see if this latest weakening causes them to pull back. As Property Play noted in July, the largest single-family rental REITs were selling more homes than they were buying, according to a count by Parcl Labs. That, however, was because they were trying to consolidate away from standalone properties and more into full rental communities, some of which they were building.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "It takes a lot to get rent growth to slow down as land lords/property managers rarely do that and especially with advent of property management software which prioritize rent increase. But the fact that we are seeing is quite a sight and will start pressuring RE investors and we might start seeing more trying to sell of their RE investments.",
                "author": "Dmoan"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "U.S. Home Prices Ticked Up 0.2% in August",
        "score": 61,
        "text_content": "",
        "comments": [
            {
                "raw_content": "ah, so almost negating that rate cut. Cool.",
                "author": "Alexandratta"
            },
            {
                "raw_content": "* U.S. home prices rose 0.2% from a month earlier in August on a seasonally adjusted basis. * On a year-over-year basis, home prices rose 3.1%, the slowest rate recorded in Redfin Home Price Index (RHPI) data going back to 2012. * 26 of the 50 most populous U.S. metros saw month-over-month price declines. U.S. home prices rose 0.2% from a month earlier in August on a seasonally adjusted basis, up slightly from the 0.0% monthly growth rate posted in July. August marks the first time since January that the rate of home-price growth increased compared to the prior month. On a year-over-year basis, home-price growth slowed to 3.1%, the lowest rate recorded in Redfin Home Price Index (RHPI) data going back to 2012. This is according to the Redfin Home Price Index (RHPI), which uses the repeat-sales pricing method to calculate seasonally adjusted changes in prices of single-family homes. The RHPI measures sale prices of homes that sold during a given period, and how those prices have changed since the last time those same homes sold. It’s similar to the S&P Cotality Case-Shiller Home Price Indices, but is a month ahead. August data covers the three months ending August 31, 2025. Read the full RHPI methodology here. Home price growth slowed this year as inventory returned to pre-pandemic levels, while would-be homebuyers remained on the sidelines due to near-record prices, elevated rates and economic uncertainty. With buyer demand remaining low, sellers also recently started backing off; the number of sellers declined in July for the first time in two years. “The tug-of-war in today’s housing market may actually be creating an opening for both buyers and sellers,” said Redfin Senior Economist Sheharyar Bokhari. “With more inventory available, intense bidding wars are in the rearview mirror, so buyers have room to negotiate. At the same time, sellers who price their homes realistically are still finding buyers, and overall, prices are holding steady. This middle ground could leave a window of opportunity open for both sides.” Metro-Level Summary: Redfin Home Price Index, August 2025 Home prices fell in 26 of the 50 most populous U.S. metro areas on a seasonally adjusted basis in August, month over month. The biggest decline in August was in San Diego (-1.4%), followed by Los Angeles (-1.1%) and Fort Lauderdale, FL (-1%). Prices increased most in San Francisco (1.5% month over month), Philadelphia (1.5%) and Charlotte (0.8%). On a year-over-year basis, prices in New York (11%) rose the most, followed by Nassau County, NY (8.9%) and Newark, NJ (8.6%). Prices fell the most in Austin, TX (-3.7% year over year), Tampa, FL (-3.5%), and Oakland, CA (-2.1%).",
                "author": "SnortingElk"
            },
            {
                "raw_content": "What was the inflation for August? Any price increase below inflation is actually a price cut.",
                "author": "LackingTact19"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "U.S. mortgage rates tumble for consecutive weeks in September",
        "score": 65,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Then when the rates go back up from 6.25% to 6.35% it will be a called \"a slight tick up\" if it's acknowledged at all.",
                "author": "throwaway2492872"
            },
            {
                "raw_content": "I love how the media works, rates drop ,05% and the headline says \"tumble\".",
                "author": "Aromatic_Tomato8651"
            },
            {
                "raw_content": "\"Tumble\" I'm guessing... what... 3/4ths of a point? update: ...lol, what? >The 30-year mortgage rate was 6.26% for the week ending Sept. 18, down from 6.35% the previous year. A year ago, rates stood at 6.09%. wait... it was 6.26 for this week, down from 6.35% from \"the previous year\" but... a year ago... rates were 6.09% so, even lower a year ago? I am... confounded by this sentence.",
                "author": "Alexandratta"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Certainly an isolated incident, nothing to see here.",
        "score": 27,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Condos are most vulnerable due to the fact that Condo Boards are made of elected owners from the condominium...which is dumb. It means that, when things are going well, the condo board is likely going to manage their funding easily. when stuff gets hard, like rates going up... well then there needs to be adjustments to Maintenance fees. Fees go up, value is going to drop - because Maint. Fees directly affect home price.",
                "author": "Alexandratta"
            },
            {
                "raw_content": "Jesus, that guy is in a rut. I'm all for throwing tomatoes at the \"homes only go up, whoops I can't resell for a profit after a year\" crowd, but this is a military veteran trying to deal with a car accident and sudden increases in expenses, and is just trying to get out of a condo \"the right way.\"",
                "author": "Judge_Wapner"
            },
            {
                "raw_content": "Now that it's becoming obvious that housing is a deflating bubble, be prepared for lots of stories like this.",
                "author": "NorCalJason75"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Another isolated, meaningless incident.",
        "score": 22,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I actually posted 1 minute faster than you, but I'll bow out and comment instead. This buyer and spouse both had student loans which the lender didn't count against them. The fact that he/she was approved is absolutely ridiculous. \"Highly qualified buyers\" indeed.",
                "author": "beardko"
            },
            {
                "raw_content": "It used to be normal for sellers to dump a house, knowing that it would save them money in the long-run. This thinking needs to be rediscovered. I mean what else are they looking for?",
                "author": "reedthemanuel"
            },
            {
                "raw_content": "Holy crap! Making $45k/yr and $415k left on the mortgage, with no cash available to bring to the closing table just to walk away and be done with it. This one will end ugly. Anybody notice posts like this one are coming in at a faster clip lately? It used to be a couple each week, now it’s one or two doozies daily.",
                "author": "SOLA-REX"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The race is on",
        "score": 384,
        "text_content": "",
        "comments": [
            {
                "raw_content": "1TW is 1/3 of global energy usage. FYI",
                "author": "IgnisIason"
            },
            {
                "raw_content": "https://preview.redd.it/35klq9joxzqf1.png?width=96&format=png&auto=webp&s=abb9d339e8f7d034e52aefc4f35fae5a48dfec62",
                "author": "Imaginary-Koala-7441"
            },
            {
                "raw_content": "That's like competing for which car uses more gasoline instead of which one is the fastest.",
                "author": "arko_lekda"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Chinese Film Edit Alters Gender of Gay Character Using Face Swap",
        "score": 102,
        "text_content": "[https://www.bloomberg.com/news/articles/2025-09-23/chinese-version-of-horror-film-together-alters-gay-couple-likely-using-ai](https://www.bloomberg.com/news/articles/2025-09-23/chinese-version-of-horror-film-together-alters-gay-couple-likely-using-ai) A gay couple in an Australian horror movie was digitally altered into a heterosexual one for its release in mainland China, a move that likely involved AI and signals a new frontier in censorship. In *Together*, the thriller starring Dave Franco and Alison Brie, one of the men in a same-sex relationship was replaced with a woman’s face. The edit sparked backlash from viewers, many of whom only noticed after social media posts compared the altered scene with the original.",
        "comments": [
            {
                "raw_content": "the funny thing is, this is a movie about couples being fused together into one person. the two men got fused into a man. the big reveal at the end of the movie is >!dave franco & allison brie fuse into an androgynous nonbinary person becuz they are both different genders!< so this alteration completely fucks with the lore and makes it make less sense",
                "author": "petermobeter"
            },
            {
                "raw_content": "Why not make them chinese when you already changing faces?",
                "author": "tomassko"
            },
            {
                "raw_content": "Can't wait for ai race, gender and sexuality swapped releases of the same movie for different demographics.",
                "author": "RobertoAbsorbente"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"Immortality sucks\" ? Skill issue",
        "score": 1237,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Add to the list \"But I'd get bored eventually\" \"What if I feel ennui\" So many people like this. Lack of imagination.",
                "author": "anaIconda69"
            },
            {
                "raw_content": "I find that most people who say they wouldn't want to live forever change their mind if I ask them if every night before bed they could take a pill to not age the next day, how long do they think it would be before they decided to stop taking it? Suddenly, people want to take it forever.",
                "author": "Delmoroth"
            },
            {
                "raw_content": "Immortality might suck, but getting old sucks more.",
                "author": "johnjmcmillion"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI, Oracle, and SoftBank expand Stargate with five new AI data center sites",
        "score": 130,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This sub is incredibly distracted. Some of the most monumental AI infrastructure undertakings are already under construction or soon entering construction, and the proportion of GDP being spent is on the scale of the Apollo missions, and they are equivalent to the power consumption of millions of homes, and it barely makes a splash in the subreddit called singularity. All you guys enjoy are cool robotics demos, Gemini announcements, bashing AI, or dooming about AI's economic consequences. Most things related to the actual undertaking of the unfolding singularity get completely ignored.",
                "author": "Glittering-Neck-2505"
            },
            {
                "raw_content": "does this basically mean in ~2027 openai is going to have 20GWs worth of compute? they are kinda cooking",
                "author": "Sxwlyyyyy"
            },
            {
                "raw_content": "Imagine what Sora is going to look like by then.",
                "author": "Regular_Eggplant_248"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Scientists found a protein that carries \"old age signals\" through the body — and blocking it literally reversed the damage.",
        "score": 63,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Previous studies show increasing it extends lifespan....",
                "author": "1a1b"
            },
            {
                "raw_content": "![gif](giphy|uDwKGxTFrADvO)",
                "author": "Accomplished-Tank501"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Incredible Wan 2.2 Animate model allows you to act as another person. For movies this is a game changer.",
        "score": 422,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That OF account you’ve been paying monthly, it was this dude the entire time. 🤣",
                "author": "Talic"
            },
            {
                "raw_content": "Yeah, for movies. Right.",
                "author": "SoupOrMan3"
            },
            {
                "raw_content": "Everyday it becomes harder for me not to start an onlyfans to make money off of these technologies",
                "author": "Sarenai7"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "AI2027 estimated 7e27 flops/month worth of compute in 2027. With the new stargate plans, 1GW of GB200’s is about 2e28 flops/month.",
        "score": 50,
        "text_content": "Just wanted to say it’s getting more and more realistic",
        "comments": [
            {
                "raw_content": "Flops/month is a bit challenging for me to understand. The problem is FLOPS stands for floating point operations per second. Do you mean 2e28 floating point operations per month for 1GW of GB200 or they are adding an additional capacity of 2e28 FLOPS every month going forward?",
                "author": "That_Chocolate9659"
            },
            {
                "raw_content": "I think eventually we'll reach a point where we can just brute force AGI into existence. Even if no more innovations happen anytime soon, eventually just scaling up compute will continue to lead to higher and higher intelligence levels. Maybe it won't be true AI, but if the compute is high enough maybe it can simulate intelligence enough so it's passable to do most robotic things.",
                "author": "Weekly-Trash-272"
            },
            {
                "raw_content": "When is Stargate supposed to be operational? 2027?",
                "author": "ReadSeparate"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "GPT-5 Codex is now available in API with same pricing as GPT-5",
        "score": 159,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Junior devs getting nuked",
                "author": "FarrisAT"
            },
            {
                "raw_content": "I'm happy that OAI allowed PLUS usage of Codex for free - this is really great. However, am I the only one or is GPT-5-Codex absolutely dogshit compared to agents like Cline or RooCode? Perhaps I'm doing something wrong because in Roo or Cline GPT-5 is doing **amazing** things and I absolutely love it... Once I try to use it with sub on Codex CLI it absolutely fails even simpliest changes or simpliest one-shot apps. Any tips to solve skill issue on Codex CLI?",
                "author": "FoxB1t3"
            }
        ],
        "subreddit": "singularity"
    }
]