[
    {
        "post_name": "In lawless America, make sure you always have a dashcam",
        "score": 830,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Don’t get out of your car",
                "author": "Trooph-Hurts"
            },
            {
                "raw_content": "The unchecked importation of 3rd worlders is leading the USA into a self-imposed surveillance state.",
                "author": "FREN"
            },
            {
                "raw_content": "It's a common trick. https://www.youtube.com/watch?v=ZQzAnHOeazY Back up into someone, claim they hit you from behind. Insurance claim, $$$$. The freeloader class shares notes with each other on how to game the system.",
                "author": "fskfsk"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Now they are making threats to come after Trump's team again.. these people never stop.",
        "score": 729,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hey retard, unlike Obama's people, Trump's have done nothing illegal. Sorry that its such a hard concept to understand.",
                "author": "POTUS_DonnieJ"
            },
            {
                "raw_content": "I'm a simple man, I see that guy's face, I downvote.",
                "author": "FREN"
            },
            {
                "raw_content": "Don't post this faggot's twitter. He's getting views and money for it. At best, post a pic of the tweet.",
                "author": "uxername27"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "AOC wears her mom jeans as she goes fully insane threatening Republicans with “consequences” for not conforming to her ideals of communism.",
        "score": 705,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Retarded whore could at least wear a tight dress/skirt and show us what's left of her communist tits and ass since she's just started hitting the wall this past 2 years. She failed even at that.",
                "author": "AlaskaBrO93"
            },
            {
                "raw_content": "There are consequences to eating a whole pizza by yourself",
                "author": "Eddie_LeBec"
            },
            {
                "raw_content": "She gettin THICC",
                "author": "South_Florida_Guy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Turns out from declassified intelligence that Vladimir Putin had no Kompromat on Donald Trump -- no pee tape, no nothing -- but he had a massive file on Hillary Clinton which he could use to blackmail her and control her as the president he really preferred",
        "score": 901,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hillary has always had ties and connections to Russia and yet the Democrat retards willfully chose to ignore it all while they smeared Trump for basically what Hillary was guilty of. Textbook liberal socialist Marxist bullshit.",
                "author": "sully"
            },
            {
                "raw_content": "Hillary Clinton threw up in a limo in Moscow. The media like to cover that up. Maybe with sawdust.",
                "author": "magnokor"
            },
            {
                "raw_content": "No fucking duh, she sold massive amounts of uranium to putin for their nuclear weapons.",
                "author": "Modernturnkey"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I’m looking at the large amount of money owed by the Democrats, after the Presidential Election, and the fact that they admit to paying, probably illegally, Eleven Million Dollars to singer Beyoncé... YOU ARE NOT ALLOWED TO PAY FOR AN ENDORSEMENT. IT IS TOTALLY ILLEGAL TO DO SO.",
        "score": 1370,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wake me up when somebody is arrested for it",
                "author": "PapaPepe"
            },
            {
                "raw_content": "Never above the law, never gets arrested.",
                "author": "DeplorachuIChooseYou"
            },
            {
                "raw_content": "Nobody is above the law...",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Someone tell me why we’re paying $3 billion to renovate a private corporation’s building?",
        "score": 1228,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Now ask the same question about Israel for the past 30 years",
                "author": "staroframphansbhole"
            },
            {
                "raw_content": "Fun fact: There are no bathrooms in Versailles.",
                "author": "NeoDragoon"
            },
            {
                "raw_content": "We aren't paying them $3 billion, because that number will rise to $7 billion by next week.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Networks aren’t allowed to be political pawns for the Democrat Party. It has become so outrageous that, in my opinion, their licenses could, and should, be revoked! MAGA",
        "score": 993,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# Repeal Obama's Smith–Mundt Modernization Act now 📃",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "🎶 I've been waiting for this moment for all my life, hold on 🎶",
                "author": "ToxicAvengerOhio"
            },
            {
                "raw_content": "Do it!",
                "author": "Trunalimunumaprzur"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Alex Jones : I believe from what I have observed over the years you are a good man, but until we start seeing arrest of high level globalist this nation is doomed. The Trump admin must destroy the deep state or they will destroy us! DO WHAT MUST BE DONE and DO IT FAST!!",
        "score": 1562,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Bongino should shut the fuck up until he says “we have charged and arrested…” SPEZ: ALL of them should shut the fuck up until they say: ....",
                "author": "fthecoup"
            },
            {
                "raw_content": "Arrests of those who turned the frickin' frogs gay.....also 0.",
                "author": "Bellababeala"
            },
            {
                "raw_content": "Alex Jones is right...AGAIN. Fuck all the haters.",
                "author": "Throwawayanother1776"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "‘AOC broke House rules to attend Met Gala with beau Riley Roberts, is told to pay additional $2,700 for ‘Tax The Rich’ gown, other accessories’",
        "score": 925,
        "text_content": "",
        "comments": [
            {
                "raw_content": "She needs an IRS forensic audit. This is insignificant.",
                "author": "Tinyfingerbrains"
            },
            {
                "raw_content": "Oh no the multimillionaire owes $2700. What will she ever do",
                "author": "For_All_Mankind"
            },
            {
                "raw_content": "Her ass got too fat on the defeat oligarchy tour to wear that again.",
                "author": "ThirdRateSlacker"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Rep. Mike Haridopolos : I’ve been inside the Fed, they make the Ritz-Carlton look like a Holiday Inn. They’re blowing money on luxury while Americans struggle with sky-high rates. It’s time to cut the spending AND the interest rates.",
        "score": 1311,
        "text_content": "",
        "comments": [
            {
                "raw_content": "End it altogether",
                "author": "Mungo"
            },
            {
                "raw_content": "The Jewish Taj Mahal. Jews have to do a pilgrmage to The Fed at least once in their life.",
                "author": "glsmith5150"
            },
            {
                "raw_content": "I work telcom IT in the late '90s early 2000's in Southern California and up in Hollywood... Trust me I've seen the obscene absurd despicable pissing away of money... I remember going in to the headquarters of global crossing... Remember them... It was like walking into Versailles... Vulgar beyond belief... I've seen Hollywood executives and agents offices in Beverly Hills On rodeo drive... Were the underground parking spots for their car were small apartments with carpeting and original artwork... You cannot believe the excess and pissing away of money by some of these people It takes your breath away",
                "author": "Tophat9000"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "School Choice: Let's make this what replaces forced government schools",
        "score": 822,
        "text_content": "",
        "comments": [
            {
                "raw_content": "My choice is to shut them ALL down if you can't dissolve the teachers unions.",
                "author": "MythArcana"
            },
            {
                "raw_content": "School choice is very important up until the 4th grade, age 9-10. That's all you ever learn in life that you need. The middle school and high school are for sports and socializing needs. If you pay for private school at least from K-4 you can save for college from 5-12. Ours were in Montessori up till 6th grade, the foundational formative years and I home schooled them. You can't afford the big dream house so be ok with sacrifices you make. I would place children's education on top priority over the big house all over again now that we have school back in the States, especially now. This is a very big decision and advice for younger families. You may have to move and downsize because how could you possibly have known the future and how priorities shifted.",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "I used to be for school choice until they started shipping low iq, gorillas to my nice suburban school. We pay a lot for the niceness of that school and some kid with a voucher can just come in and be a fucking animal? No. I don’t know what the solution is, but there’s a reason we all run from the cities, and this ships the cities to us. I don’t want to run anymore.",
                "author": "Aisle-is-closed"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Trump on Hamas: “They don’t want peace. They want to die.”",
        "score": 968,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There are no American hostages in Gaza. This is not our problem.",
                "author": "dogofwar"
            },
            {
                "raw_content": "They want US to die.",
                "author": "PUNCHSPLOSION"
            },
            {
                "raw_content": "Nah, they want the Jews to die....let's not confuse their goals with our desired outcome. Let them fucking kill each other off, not my damn problem.",
                "author": "ciaramella_is_gay"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔪 Breaking: 7 People STABBED as suspect goes on STABBING SPREE at Walmart in Traverse City, MI...",
        "score": 1080,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Let's see Michigan and a stabbing spree. Well we know the perps and the motive.",
                "author": "klunniclowns2"
            },
            {
                "raw_content": "Snackbar “Motive unknown”. Lmao. It’s called Islam",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "If I were a betting man...",
                "author": "HappyNewYear2025"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Very Important. Republicans must play to win. Clear the 135. So badly needed!",
        "score": 1244,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I hate the republicans more than I hate the Dems…. At least with the Dems, you know what your enemy will do…",
                "author": "Purple_Drank"
            },
            {
                "raw_content": "Thune and Johnson are going to make sure they don't get through. Meanwhile Tom Cotton is showing his deep state cards more and more. I hate these pieces of SHIT.",
                "author": "TrumpLandslide20201"
            },
            {
                "raw_content": "Has anyone fumbled a mandate this hard. I just want the republicans to do something with the power they have before they lose it",
                "author": "TrumpInAus"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"Ilhan Omar mocks \"American stupidity\". United States average IQ: 100. Somalia average IQ: 67\"",
        "score": 1249,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We created the light bulb. They created the light bulb head.",
                "author": "TheAftermath"
            },
            {
                "raw_content": "She is right though. Democrats were stupid enough to let her into America.",
                "author": "AVeryNakedMan"
            },
            {
                "raw_content": "She raised Somalia's IQ two points just by leaving.",
                "author": "zooty"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "LA Mayor Karen Bass hired CCP-intel linked bankers to transition team after they bankrolled her campaign",
        "score": 903,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And paid for the ballots that were injected after the election so she would \"win\".",
                "author": "TEXinLA"
            },
            {
                "raw_content": "How the eff is she still the Mayor after such devastating fire?",
                "author": "travelfeet"
            },
            {
                "raw_content": "Commies are gonna commie",
                "author": "R3tro"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Connie Chung says that she fears CBS News as we know it is coming to an end.",
        "score": 1155,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Came to an end decades ago - it's certainly not the CBS news I grew up watching as a kid in the 70s-80s, no less the CBS news of my father's younger days in the 50s-60s.",
                "author": "Ghostphaez"
            },
            {
                "raw_content": "Fuck, we hope so. We've been trying to take that shit off the air for decades now.",
                "author": "MythArcana"
            },
            {
                "raw_content": "Watch it, round eye.",
                "author": "brutustyberius"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "U.S. Immigration and Customs Enforcement: All your exes might live in Texas (or Florida) but if they’re here illegally — we’ll be happy to assist with their deportation.",
        "score": 1332,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Give them a call To get rid of your Mother in Law...",
                "author": "TEXinLA"
            },
            {
                "raw_content": "Based. Imagine falling in the thirst-trap that is \"latinas\"",
                "author": "darkmodeforgotpass"
            },
            {
                "raw_content": "Breaking up with your illegal alien ex over text - woke Breaking up with your illegal alien ex by calling ICE on them - based",
                "author": "henri_derelicte"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🩸 Cincinnati Jazz Festival Horror: A white couple was BRUTALLY beaten at a jazz festival by a black \"teen mob\" in Cincinnati yesterday—0 national coverage...",
        "score": 347,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sick feral Black racists, ship them to Africa and let them live like bush people..",
                "author": "roadrunner0"
            },
            {
                "raw_content": "This is why all races hate black people",
                "author": "Buff_cousin_Elroy"
            },
            {
                "raw_content": "Stay away from large gatherings open to the public.",
                "author": "Cville123"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Lefties are insanely retarded...",
        "score": 993,
        "text_content": "",
        "comments": [
            {
                "raw_content": "These people vote….",
                "author": "Purple_Drank"
            },
            {
                "raw_content": "This girl has never done a minute of thinking.",
                "author": "Slickyslim33"
            },
            {
                "raw_content": "Amazing all someone has to do is not do drugs or hurt people, And you don't go to jail. And to not fuck \"any\"/every whore that moves. Hard to believe that it's too much to ask.",
                "author": "Mathelm"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Intel shares its Foundry has zero \"significant\" customers (10Q filing)",
        "score": 234,
        "text_content": "**Intel Q2 2025 10Q Filing:** [**intc-20250628**](https://www.intc.com/filings-reports/all-sec-filings/content/0000050863-25-000109/intc-20250628.htm) **Date:** July 24, 2025 In the 10Q, Intel speaks much more plainly: >We have been unsuccessful to date in attracting significant customers to our external foundry business. Thus, Intel's previously-touted deals (e.g., Amazon) were not significant and ***no*** nodes have significant customers. \\* What is a 10Q? *The SEC Form 10-Q is a comprehensive unaudited report of financial performance that must be submitted quarterly by all public companies to the Securities and Exchange Commission (SEC).* The 10-Q is very much a **legal** and **government** filing, meaning publicly-traded companies *need* to be more blunt and be *overly* cautious. Imagine if you needed to explain your business & its risks to someone that didn't know anything & might run your business one day: what risks would you detail? // some other tidbits; share any more below From Q1 2025, but repeated: Intel paid SK Hynix $94 million related to \"certain penalties\": >In connection with the second closing, we entered into a final release and settlement agreement with SK hynix primarily related to certain penalties associated with the manufacturing and sale agreement between us and SK hynix, recognizing a net charge of $94 million within *Interest and other, net* for the amount paid to SK hynix during the first quarter of 2025. Foundry has a lot of assets; 18A & 18A-P are part of the \"significant majority\" >We had over $100 billion of property, plant, and equipment, net on our balance sheet as of June 28, 2025, the substantial majority of which we estimate relate to our foundry business. While the significant majority of this relates to our existing and in-development nodes, including Intel 18A and Intel 18A-P, with each transition to a new node we continue to utilize some R&D and manufacturing assets from prior nodes. Intel Foundry is making around $50 million in revenue per half-year: >External revenue was $53 million, roughly flat with YTD 2024. Intel has no long-term contract with TSMC >We have no long-term contract with TSMC, and if we are unable to secure and maintain sufficient capacity on favorable pricing terms, we may be unable to manufacture our products in sufficient volume and at a cost that supports the continued success of our products business. Higher hyperscale-related demand: >DCAI revenue increased $432 million from YTD 2024, primarily driven by higher server revenue due to higher hyperscale customer-related demand which contributed to an increase in server volume of 15%. But lower selling prices due to competition: >Server ASPs decreased by 9% from YTD 2024, primarily due to pricing actions taken in a competitive environment. DCAI has increased income, partially due to reduced headcount: >DCAI operating income increased $549 million from YTD 2024, primarily due to $998 million of favorable impacts related to lower operating expenses, driven by lower payroll-related expenditures as a result of headcount reductions taken under the 2024 Restructuring Plan and the effects of various other cost-reduction measures. These favorable YTD 2025 impacts were partially offset by unfavorable impacts to operating income, primarily due to period charges of $361 million related to Gaudi AI Accelerator inventory-related charges recognized in YTD 2025. Intel CCG / client has $1b lower income and higher inventory reserves vs YTD 2024, but saved $400 million in reduced headcount: >CCG operating income decreased $1.0 billion from YTD 2024, primarily due to $1.5 billion of unfavorable impacts attributable to lower product profit due to lower revenue in YTD 2025, as well as higher period charges related to higher inventory reserves and higher one-time period charges of $188 million. These unfavorable YTD 2025 impacts were partially offset by YTD 2025 favorable impacts of lower operating expenses of $406 million due to lower payroll-related expenditures as a result of headcount reductions taken under the 2024 Restructuring Plan and the effects of various other cost-reduction measures. \\^\\^ FWIW, I did not find \"one-time period charge\" of $188 million explained anywhere. Any clues? Gaudi AI has plenty of inventory: >Consolidated gross profit also decreased in Q2 2025 due to higher one-time period charges of $209 million, and higher period charges related to Gaudi AI accelerator inventory reserves taken in Q2 2025. $797 million in Foundry assets have \"no remaining operational use\" due to weaker demand for Intel products & Intel services >Our Q2 2025 results of operations were also affected by an impairment charge and accelerated depreciation related to certain manufacturing assets that were determined to have no remaining operational use. This determination was based on an evaluation of our current process technology node capacities relative to projected market demand for our products and services. These non-cash charges of $797 million, net of certain items, were recorded to cost of sales in Q2 2025, impacting the results for our Intel Foundry segment. Intel has \\~$52 billion in debt & long-term liabilities, down from $56 billion in Dec 2024: >Q2 2025: 44,026 m debt + 7,777 m long-term liabilities >Q4 2024: 46,282 m debt + 9,505 m long-term liabilities Some of the comparisons above are YoY while others are YTD, so the numbers change, but Intel reports both if you CTRL+F / ⌘ + F.",
        "comments": [
            {
                "raw_content": "After disastrous delays of 10nm and 7nm and the cancellation of 20A, how can Intel assure potential customers that 14A will arrive on schedule and work as expected? Imagine if a company (i.e. Apple) can't get its billion-dollar product (i.e. iPhone) out on time because of Intel's delays.",
                "author": "mockingbird-"
            },
            {
                "raw_content": "Holy shit. $100 billion in assets primarily relared to the foundry, $100 million in annual revenue related to the foundry. That's the worst investment I've basically ever heard of for any company ever. EDIT: I somewhat misread this, so my comment was a bit misleading. The $100B doesn't refer just to assets dedicated to the external foundry business, but rather to the assets for the entire Intel foundry business, including those used for internal manufacturing. So, it's more the case that Intel is unsuccessfully attempting to use its extensive foundry assets to diversify into manufacturing for external clients than that Imt actually has $100B in assets dedicated to its miniscule external foundry business.",
                "author": "Pchardwareguy12"
            },
            {
                "raw_content": "With nails I'm being hammered into Intel's coffin at an accelerating pace, I've been wondering who picks up the pieces? The company is a disaster but they hold onto some really important assets, the x86-64 licensing scheme and their E-UV come to mind. Who gets that when they fail? Is it sold for parts, or is there some sort of industry conglomerate to buy collective ownership? Does the US allow TSMC to acquire those lithography machines as long as they stay in the US? These things all seem so complicated to handle I wonder if there isn't already policy in place for them.",
                "author": "According_Builder"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Echelon kills smart home gym equipment offline capabilities with update",
        "score": 438,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TLDR: - Smart home devices for over 5 years had offline capability and supported third party software. - An update broke both of that. Echelon retroactively requires their customers to use their subscription-based app, which starts at $40 per month, and the equipment must remain connected to Echelon's servers to function (which means no exercising during an internet outage). On a side note, may I interest you in a dishwasher that requires a constant WiFi connection with an internet account to use basic features?: https://www.youtube.com/watch?v=5M_hmwBBPnc",
                "author": "Blueberryburntpie"
            },
            {
                "raw_content": "Immediate full refund of the product is what I'd get. Full. No bs. Pull my receipt and return the exact amount.",
                "author": "CrankedOnDaPerc30"
            },
            {
                "raw_content": "This shit should be illegal. It shouldn't ever be possible to permanently degrade the experience of hardware with a software update except in specific security or safety circumstances - and those updates should still be opt-in only.",
                "author": "AnimalShithouse"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel to Lay Off 15% of Workers, Cancel Billions in Projects in Bid for Rebound",
        "score": 162,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You are welcome to discuss r/hardware moderation on r/hardware, but please do so in a dedicated [Meta] thread Please do not discuss other subreddits’ actions, moderators, or rules on r/hardware",
                "author": "Echrome"
            },
            {
                "raw_content": "Can someone explain why there isn't at least one large company wanting to use Intel fabs for the newer nodes like 14A? Sure it may not be as top tier as the latest TSMC, but TSMC is probably a lot more expensive and delayed anyways because of how many orders they already get. Are companies actually willingly to delay their own semiconductor products just to wait for a slot at at a TSMC fab, rather than go with a potentially cheaper sooner Intel one?",
                "author": "silverpixie2435"
            },
            {
                "raw_content": "After disastrous delays of 10nm and 7nm and the cancellation of 20A, how can Intel assure potential customers that 14A will arrive on schedule and work as expected? Imagine if a company (i.e. Apple) can't get its billion-dollar product (i.e. iPhone) out on time because of Intel's delays.",
                "author": "mockingbird-"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "9to5Mac: \"Apple may be Intel's last hope in the foundry business\" [Nvidia and Apple show interest in producing Intel 14A test chips according to analyst Jeff Pu]",
        "score": 95,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Apple loves throwing its weight around when it comes to suppliers. But when it comes to fabs, it has little room to push TSMC around. Sure they’ve had their long partnership, but TSMC has been increasing prices healthy double digits node on node. If they have a complete majority they’re going to squeeze fabless customers hard. They already have something like a 50% margin. If Lip-Bu Tan could succeed in getting Apple or NVIDIA he would have saved Intel fabs. It would be worth doing so even at enormous discount. Apple has shown a willingness to go with not as good of a solution so long as they can meaningfully lower their BOM, such as going with in house 5G modems.",
                "author": "yabn5"
            },
            {
                "raw_content": "Ah, the test chip confusion again. Everybody gets test chips of every node. It's nothing special. Does not mean Apple is going with 14A.",
                "author": "ElementII5"
            },
            {
                "raw_content": "After disastrous delays of 10nm and 7nm and the cancellation of 20A, how can Intel assure customers that 14A will arrive on schedule and work as expected?",
                "author": "mockingbird-"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Leak confirms NVIDIA N1X PC chip features 20 CPU cores and 6144 CUDA cores - VideoCardz.com",
        "score": 78,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Really curious whether all is a missundedstanding and this is just the sparx ai computer or whatever but no Windows on ARM release.",
                "author": "RealisticMost"
            },
            {
                "raw_content": "Looks to be a 10+10 CPU based on the 2 clusters. Based on the 4ghz clock I'm betting one of those clusters is Cortex X cores. No idea of the other, but some A7xx cores would make sense for E-cores on a beefy PC chip. The article claims X925 and A725 cores, and I believe that makes sense for the clocks and apparent size of this chip. GPU is the same size as the 5070. I'm expecting performance close to the 5070tiM, as going a little wider and a little slower than that GPU's 5888 Cuda cores would be a bit more efficient. A reasonable compromise for a premium SoC. I doubt it's literally a 5070 strapped in there, as in a GB205 die, but it could be the same configuration. 5x10 total with 1 TPC disabled. Could also be 4x12 fully-enabled, but that would drop it to 64 ROPs.",
                "author": "Affectionate-Memory4"
            },
            {
                "raw_content": "Am I reading it wrong or does it say worse than 2050 and a couple lines down says competes or outperforms 5070?",
                "author": "Marv18GOAT"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Chinese Lisuan Tech 7G106 GPU plays Black Myth Wukong at 4K, scores below RTX 5050 in 3DMark - VideoCardz.com",
        "score": 117,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I mean, not great but still, given how hard GPUs are that is quite the achievement.",
                "author": "Jeep-Eep"
            },
            {
                "raw_content": "I welcome all competition. This is great news. I look forward to their future!",
                "author": "XavandSo"
            },
            {
                "raw_content": "I suspect we are a decade away from mainland GPUs being a great option.",
                "author": "jhenryscott"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Inside China’s mass conversion of GeForce RTX 5090 gaming cards into “AI-Ready” GPUs",
        "score": 73,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If you follow GPU repair channels you knew this for over a year already. Northwestrepair & Co. told us viewers ages ago, that you get super cheap 4090 and 5090 boards from China in large volume because they're lifting them the memory and core and sauter them onto custom boards. Another GPU repair tech ChrisFix even hinted that China is basically extending offers to all European PC builders who have a shipping damaged RTX 5090s. If the core is functional they are paying above regular market price.",
                "author": "constantlymat"
            },
            {
                "raw_content": "RTX 5090 is a full fat die. 750mm2 which is near the EUV recticle limit. So in theory, it has as much hardware in it as a GB100 which costs ~$30k. Just needs more RAM for AI inferencing.",
                "author": "auradragon1"
            },
            {
                "raw_content": "Looking at the PCB they're transplanting harvested chips onto, does anyone recognise the design? I'm just curious where they got it from/who might be manufacturing it for them. A GPU PCB is a pretty complex design after all, is it likely stolen IP? I know previously they had a 3090 PCB they transplanted harvested GPUs onto and lightly modified it to accept 4090 GPUs later but this seems like a new design I think.",
                "author": "shugthedug3"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nvidia supplier SK Hynix says on track to double high-end AI chip sales",
        "score": 22,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "How i feel after Bananza",
        "score": 1676,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wario deserves to be big too. Donkey Kong is back,Kirby is back with Forgotten Land,Yoshi is back too,just Wario is left from all the major Nintendo platformers.",
                "author": "Safe-Elk7933"
            },
            {
                "raw_content": "![gif](giphy|Dfk5q64stLdRu)",
                "author": "StockHumor4768"
            },
            {
                "raw_content": "Warioland that looks like odyssey/bananza would be amazing",
                "author": "Plz_PM_Steam_Keys"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo may have accidentally posted a picture of a Super Mario Bros 40th Anniversary graphic last night.",
        "score": 344,
        "text_content": "Sources: [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1ma5gw2/an\\_icon\\_relating\\_to\\_super\\_marios\\_40th\\_anniversary/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1ma5gw2/an_icon_relating_to_super_marios_40th_anniversary/) [https://xcancel.com/geno4smash/status/1948940526654300395?s=46](https://xcancel.com/geno4smash/status/1948940526654300395?s=46) There is another image that was posted by a different person but that one appears to be copying this image and putting it on a different web page.",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/wu5feccz4cff1.png?width=454&format=png&auto=webp&s=06f7b6707d480e0fd84ae82ff308baa68e7c47ac Here's it zoomed in Edit: with the amount of issues this image has had, I can't out right prove that it's fake but my opinion has changed to that I personally think it's fake. I think the multiple people claiming they also saw it were either alt accounts & friends of the hoaxer or were unrelated hoaxers capitalizing on the claim.",
                "author": "MacksNotCool"
            },
            {
                "raw_content": "Another All-Stars(esque) anniversary collection perhaps? Edit: And for anyone wondering what the Japanese text is on u/MacksNotCool 's image is it just says Super Mario Brothers. https://preview.redd.it/31o01e715cff1.png?width=710&format=png&auto=webp&s=7583982e335fe1ae03426ce55fd34adbe0e476a4",
                "author": "StockHumor4768"
            },
            {
                "raw_content": "Cool, if it's true I'm just glad they're gonna do SOMETHING for it",
                "author": "escalator929"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Me rn:",
        "score": 817,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I will never get rid of Galaxy. Best Mario game Nintendo has ever made",
                "author": "darkfawful2"
            },
            {
                "raw_content": "Can’t wait for the DK Bananza is bad videos in a couple of months",
                "author": "Shehzman"
            },
            {
                "raw_content": "Actually, Bananza made me want to boot up Odyssey on my Switch 2 and it made me appreciate it even more. I beat it on Switch, and I’m enjoying it more now.",
                "author": "MrGamePadMan"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "It's a good idea in concept, even with Discord existing, but...",
        "score": 132,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Me who has no friends to use this feature",
                "author": "deckervender"
            },
            {
                "raw_content": "I fidget press it just to hear the noise sometimes",
                "author": "elbatcarter"
            },
            {
                "raw_content": "Only one of my gaming friends chose to purchase a Switch 2 and we still use Discord.",
                "author": "josephfry4"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Is the the pro controller 2 worth it if I have the pro controller 1?",
        "score": 88,
        "text_content": "So I already have the original pro controller and it’s still working good, but I’ve also heard that the new model is a massive upgrade. Is it worth the price when I already have something similar, or should I stick with what I’ve got? The price is definitely a big factor for me",
        "comments": [
            {
                "raw_content": "For me it was. I like having an audio jack finally. The back buttons are nice on a game by game basis but not necessarily needed. The main thing are the sticks. They are smooth as butter and comparing it to the OG gave me flashbacks to moving from the N64 controller to the Gamecube. I being slightly over dramatic when it comes to this but the control sticks no longer grind against the side and there is also some added dampening to make it and the buttons quieter. Truthfully, the best thing to do is to go to a store that has a switch 2 display and see how the controller feels to you in person.",
                "author": "wernette"
            },
            {
                "raw_content": "I think \"massive upgrade\" is an oversell. It's an upgrade: it's more comfortable to hold, it has a more premium finish, I find the triggers more responsive and the sticks easier to grip. But those are small changes considering the asking price. I'd wait until your original Pro controller gives out.",
                "author": "NickVersus"
            },
            {
                "raw_content": "Yes, it’s the best controller I’ve ever used",
                "author": "froot_loop_dingus_"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "on a scale of 1 to nin10ndoland how dramatic are you",
        "score": 655,
        "text_content": "everybody has been telling how dead this game is what is literally isn’t",
        "comments": [
            {
                "raw_content": "Everyone is playing games they want to play OH NO!",
                "author": "tsulegit"
            },
            {
                "raw_content": "If only there was a new first party Nintendo game that was really fun out at this time? Seriously what a bunch of clickbait crap.",
                "author": "Rirse"
            },
            {
                "raw_content": "These sorts of Youtubers have become the internet equivalent to Fox News and MSNBC. They're actors, trolling people's emotions in the pursuit of riches. I quit paying attention to them, and I stronger suggest the rest of you do the same.",
                "author": "Sixdaymelee"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Donkey Kong Banaza feels like the next evolution of Mario Oddessey like how TotK evolved from BotW",
        "score": 298,
        "text_content": "Donkey Kong open world feels more tight and better designed than Mario Oddessey. Some moons in Odyssey feels thrown here and there randomly where in Banaza feels intended and precise. BotW does feel a bit empty and TotK was able to fix it. Feels like DKB took the same evolution step as TotK did.",
        "comments": [
            {
                "raw_content": "DKB is amazing, but this comparison is pretty diffrent, since one is more a sequel and one is like a spirtual successor",
                "author": "Rawkhawkjayhawk"
            },
            {
                "raw_content": "I feel like TOTK wasn’t that much of an evolution at all from BOTW lol",
                "author": "jacobflicks"
            },
            {
                "raw_content": "Bro didn’t even try to spell Odyssey",
                "author": "GamerOverThere"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "this game is a beautiful love letter to the franchise.",
        "score": 590,
        "text_content": "i just finished the game and man... i am so jealous of all of you who get to experience finishing the main story for the first time because i will never get that back. my jaw couldn't take it anymore with how much it was dropping. my favorite game ever is donkey kong country 2 and this is very close to claiming that spot. i just beat the main story last night and have no idea about anything after that. had an absolute last collecting the gems, experimenting with the movement and letting my creativity shine with the puzzle solving. i think it's going to be a very long time until i play another game like this masterpiece. enjoy, everyone!",
        "comments": [
            {
                "raw_content": "I also just finished it. The ending is phenomenal. 10/10 for me.",
                "author": "Sandy12315"
            },
            {
                "raw_content": "Goty",
                "author": "Basic_Protection_295"
            },
            {
                "raw_content": "This game honestly is a masterpiece. It's kind of insane how much I've been basically every second of this game.",
                "author": "Financial-General163"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "An icon relating to Super Mario’s 40th Anniversary has apparently been spotted on the EShop, displaying an error message under it titled: “error404_2025-07-25_10:06”",
        "score": 451,
        "text_content": "https://xcancel.com/geno4smash/status/1948940526654300395?s=46 Not saying whether or not this may be true, but I do think it is something to consider that next week’s rumored direct may end up being something akin to the Mario 35th Anniversary direct. The Mario Movie sequel is 9 months away and we know zip about it, there were two rumored characters for Mario Kart World DLC floating around, and a lot of people have speculated the big holiday game for 2025 could be Mario Maker 3 **EDIT:** Another user claimed to have seen this image as well, except this time it was tied to the Mario Jamboree newsletter. The images appear to be slightly different. The twitter post clearly has a Nintendo logo in the top left hand corner, but the one from r/leaksandrumors doesn’t. The backgrounds on them also look slightly different. I’m not saying it’s confirmation, but THAT is weird. https://www.reddit.com/r/LeaksAndRumors/s/SenkLacVyV",
        "comments": [
            {
                "raw_content": "Bring back Super Mario 35 cowards!",
                "author": "shadow0wolf0"
            },
            {
                "raw_content": "Why would it display “error 404”",
                "author": "snospiseht"
            },
            {
                "raw_content": "\"Error404\" c'mon man I'm supposed to huff copium over this?",
                "author": "Jasen_The_Wizard"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Gears of War: E-Day and State of Decay 3 are coming to PS5",
        "score": 363,
        "text_content": "Looks like this will be the first SoD game to debut on Playstation (if it ever comes out) [source](https://mp1st.com/news/report-gears-of-war-e-day-and-state-of-decay-3-are-coming-to-ps5)",
        "comments": [
            {
                "raw_content": "Was beginning to wonder if state of decay 3 was even coming to xbox.",
                "author": "Fenseven"
            },
            {
                "raw_content": "I don't understand why this is such a big news. Everyone with a few braincells knows at this point that every new Xbox Game will come to. PlayStation. Why on Earth would Microsoft made GoW Reloaded for PS5 if they didn't intend to bring E-Day to PS5?",
                "author": "markusfenix75"
            },
            {
                "raw_content": "EVERYTHING IS GOING EVERYWHERE!!! except Nintendo",
                "author": "Jkstatus"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Almost 40 minutes of Battlefield 6 gameplay",
        "score": 427,
        "text_content": "[https://www.youtube.com/watch?v=JhUkNWI4vfs](https://www.youtube.com/watch?v=JhUkNWI4vfs)",
        "comments": [
            {
                "raw_content": "Well after seeing the comments, This is old footage, they updated the recoil system,so i won't judge it until i see next trailer MP",
                "author": "michaeljean737"
            },
            {
                "raw_content": "I really hope they nail this.",
                "author": "Dirtycoinpurse"
            },
            {
                "raw_content": "I’m already sensing that we need a megathread",
                "author": "Scary-Sea-9546"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "39 seconds of Battlefield 6 gameplay",
        "score": 271,
        "text_content": "Source: [https://www.reddit.com/r/Battlefield/comments/1m9q2ll/looks\\_like\\_dice\\_finally\\_brought\\_their\\_battlefield/](https://www.reddit.com/r/Battlefield/comments/1m9q2ll/looks_like_dice_finally_brought_their_battlefield/)",
        "comments": [
            {
                "raw_content": "YouTube is filled with hours of BF6 gameplay.",
                "author": "RomeoSierraAlpha"
            },
            {
                "raw_content": "I’m getting my clown makeup on cause I’m honestly kind of thinking the trailer and gameplay look good. Still will wait for reviews though. Got burned by 5 and never even played 2042 lol",
                "author": "NewDamage31"
            },
            {
                "raw_content": "People are saying don't trust the trailer because 2042's trailer was also good, but you've got to admit this leaked gameplay looks 20x better than 2042",
                "author": "zrkillerbush"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Battlefield 6 Vehicle gameplay",
        "score": 123,
        "text_content": "https://youtu.be/6wn7_gb9fXU?si=5HaXfAdLdxLPgXTX",
        "comments": [
            {
                "raw_content": "Are we going to need a megathread for BF6 leaks? I'm pretty sure there are tons of posted videos",
                "author": "LoloTheWarPigeon"
            },
            {
                "raw_content": "I dunno man. Is DICE cooking with this one? I genuinely like whats been leaking out of this leaky ship..",
                "author": "SilverKry"
            },
            {
                "raw_content": "It looks good but I know EA is not going to be satisfied with that given their player count goals. I don't trust this game not to get monetized into oblivion at or post launch.",
                "author": "dragon-mom"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Looking to Spin and Sell its Networking and Edge Business",
        "score": 45,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Intel networking used to be bulletproof but getting worst every gen.",
                "author": "tablepennywad"
            },
            {
                "raw_content": "Is the NEX not profitable? It gives 5-6B revenue I guess.",
                "author": "MrEU1"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "I found this old AMD CPU from 2007",
        "score": 94,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That is an AMD Turion 64 X2 RM-70 introduced in 2008 (2007 is just the copyright). It's a mobile (yes, a socket in mobile) 2Ghz dual-core with a 31 watt TDP.",
                "author": "toetx2"
            },
            {
                "raw_content": "Yes, you did it",
                "author": "Limp-Ocelot-6548"
            },
            {
                "raw_content": "It was cool when laptop CPUs were socketed. You could just upgrade the CPU in old laptops, like on desktops. Unfortunately nowadays everything is soldered to the mainboard, often times even the RAM and SSD.",
                "author": "ProjectPhysX"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Ryzen Threadripper 9000X for enthusiasts launches July 31, 64-core 9980X costs $5000",
        "score": 43,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Finally a price and confirmed date! Im surprised it has 92 PCI-e lanes on the none pro line. I need threadriper for the PCI-e lanes, but i only need 52, i was expecting 64 lanes, but wow 92 is generous. Meanwhile Normal ryzen is still limited to 24.",
                "author": "DrWhatNoName"
            },
            {
                "raw_content": "So I have a 3970x and I'm tempted to replace it with the new 32 core threadripper.... but because aMD Screwed us TRX40 users, I moved to intel 13900k then 9950x3d and I'm back on consumer boards. I still have the 3970x but during that time the single core and multi core performance of those two consumer chips are better (single core) or as good or almost as good (Multi core)... that the only thing I really need is PCIE lanes. My problem with threadripper is single core performance always lagging behind the consumer chips... but at the same time the pci lanes are gimped on purpose on those consumer chips. I feel like I'm being screwed at both ends by AMD.",
                "author": "GestureArtist"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Best Mini PC under 450 Dollars? Chuwi AuBox with AMD Ryzen 7 8745HS review",
        "score": 28,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Chuwi is not a bad brand, for the ultra low end. Another good option at the low end, but with an 8845HS instead, is the GMKTec Nucbox K8 Plus. Pretty similar price, but with a slightly better CPU, and an excellent selection of ports, like Oculink. Good cooling as well, the fan is only really audible during gaming. Bought one a couple months ago and I'm considering getting another as a spare, it's that good. Wifi is only mediocre though, 2-300mbps right next to the router. So it's either ethernet, an external Wifi adapter or modding with external antennas. I did the latter and now get 5-600 mbps reliably.",
                "author": "ConsistencyWelder"
            },
            {
                "raw_content": "I got a Beelink Ser8 with the 8745HS and 32GB of Ram for $480 on Amazon last week. I nuked Windows and switched to Bazzite and have been extremely happy with it.",
                "author": "CptBlewBalls"
            },
            {
                "raw_content": "Spend $50 more for a Mac mini",
                "author": "sl0wjim"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "MSI Claw A8 with Ryzen Z2 Extreme to launch between August 4-10 in Germany at €999, first firmware update now available",
        "score": 14,
        "text_content": "",
        "comments": [
            {
                "raw_content": "10% performance difference over an ROG Ally for double the price",
                "author": "tribes33"
            },
            {
                "raw_content": "1k might sound just a little steep, but they know handholders are the biggest marks of them all.",
                "author": "The_Zura"
            },
            {
                "raw_content": "The Z2 is a bit of a disappointment performance wise based on some of benchmarks I saw. A real shame, perhaps drivers will get better?",
                "author": "chaosxq"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Bosgame M4 Neo test - the affordable alternative to expensive mini PCs",
        "score": 7,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "Real Estate Broker Says $600K Homes Will Hit $1 Million — 'I Hate To Burst Your Bubble, But There Is No Bubble And There Never Will Be'",
        "score": 245,
        "text_content": "https://finance.yahoo.com/news/real-estate-broker-says-600k-173104085.html",
        "comments": [
            {
                "raw_content": "Never ask a barber if you need a haircut.",
                "author": "Iwillgetasoda"
            },
            {
                "raw_content": "In the stock market, this would be the sell signal. When the FOMO and price predictions get comical.",
                "author": "MH_75"
            },
            {
                "raw_content": "Who is gonna pay that kind of money? 40-50 year mortgages? Your children that don’t exist yet will be paying off the loan",
                "author": "DrAtizzle"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The American housing market is in a deep freeze—Even lower prices aren’t enough to convince stubborn buyers",
        "score": 665,
        "text_content": "[https://archive.ph/g3J6m](https://archive.ph/g3J6m) What a shit-tier article. You think cutting prices 2% after rising 60%+ will make a meaningful difference? Fuck you. Lower the price. No stupid gimmicks like rate buy downs, first time homebuyer credit, down payment assistance, etc. Lower the fucking price or else have fun holding the bag with your never-ending monthly carrying costs.",
        "comments": [
            {
                "raw_content": "It’s not just the prices. It’s the prices combined with the economy. There are a lot of industries right now that are just laying people off on a whim. Getting hired is taking a year, the idea of locking myself into a 5k mortgage not knowing what my employment status is going to be day to day is not happening.",
                "author": "Low-Goal-9068"
            },
            {
                "raw_content": "Why buy anything big when jobs are shaky, pay’s flat, rates are brutal, and insurance bleeds you dry? Hard pass.",
                "author": "stein63"
            },
            {
                "raw_content": "Stubborn buyers? Or stubborn sellers lol",
                "author": "coldshowerss"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Canceled home sales surge as fed-up buyers and sellers walk away",
        "score": 509,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sellers have gotten too used to the fact that real estate has consistently gone up without realizing that potential buyers monthly payment has now doubled compared to a few years ago due to interest rate hikes",
                "author": "Blurple11"
            },
            {
                "raw_content": "Good. I’m tired of these people thinking they’re entitled to double their money in 3 years.",
                "author": "JWaltniz"
            },
            {
                "raw_content": "We just need a housing reset in the worst way. Absolutely insane real estate prices, even in some of the cheapest states to buy homes.",
                "author": "AbsoluteRook1e"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Home sales are down. So why are prices at an all-time high?",
        "score": 129,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Because sellers would rather pull their house off the market than cut the price 10% - 20%.",
                "author": "Fuckaliscious12"
            },
            {
                "raw_content": "In states that allow new construction homes without a ton of red tape (Arizona, Colorado, Nevada, Carolinas, Florida, Texas, etc), prices are dropping fast because builders are pricing their brand new homes cheaper than existing homes and are offering 5% mortgages. In states where there is barely any new construction (Illinois, Michigan, northeast, etc) prices are still going up or flat because there is not enough inventory.",
                "author": "MikeMak27"
            },
            {
                "raw_content": "Most bought their house for 200 dollars and 3 gallons of milk and need 1M + for it to retire. They look at us as their “exit liquidity”",
                "author": "Suspicious_Safe_6150"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The 10 most ‘impossibly unaffordable' housing markets in the world— 5 are in the U.S.",
        "score": 66,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Living in The Golden State is not cheap. It’s “impossibly unaffordable” to buy a home in four major California metropolitan areas — San Jose, Los Angeles, San Francisco, and San Diego — according to a May study by the Chapman University Center for Demographics and Policy. The study compared the median home price to median incomes of 95 housing markets in the third quarter of 2024. The Honolulu area, where the median home price is 10 times the median income, also made the top 10 list of unaffordable housing markets. Of the markets analyzed, 12 were classified as “impossibly unaffordable,” and not a single one was deemed “affordable,” the study found. “Impossibly unaffordable” housing markets had price-to-income ratios of nine or higher, while an “affordable” market was one where the median home price was no more than three times the area’s median annual income. The most unaffordable market was Hong Kong, where the median house price was more than 14 times the median income of a worker in the city. Australia was also notably unaffordable. Metropolitan areas of Sydney, Adelaide and Melbourne were all in the top 10 as well. **Top 10 least affordable housing markets and their house price-to-income ratios** 1. Hong Kong 14.4 2. Sydney 13.8 3. San Jose, California 12.1 4. Vancouver, Canada 11.8 5. Los Angeles 11.2 6. Adelaide, Australia 10.9 7. Honolulu 10.8 8. San Francisco 10 9. Melbourne, Australia 9.7 10. San Diego, California 9.5 The product of policies that ‘limit growth’ “These high prices are largely the product of policies that seek to limit growth on the periphery, which has been the usual way that cities have grown,” Joel Kotkin, director of the Center for Demographics and Policy at Chapman University, said in the study. In California, for example, the state is working to conserve more natural land while promoting the development of higher-density housing, such as apartment buildings and accessory dwelling units like tiny homes and backyard cottages. However, increasing housing density won’t necessarily fix the affordable housing crisis because newly constructed units — often small and expensive — rarely meet the needs or preferences of many middle-income buyers, said Wendell Cox who authored the Chapman report. Less homebuying and longer home searches The deterioration of affordable housing, “has been the principal driver of the present cost of living crisis affecting the middle and working classes,” David Leis, president of the Frontier Centre for Public Policy, said in the report. In the U.S., many homebuyers have budgets well below current home prices, forcing them to rent for longer periods. This leaves little room for discretionary savings, making it even harder to save for a down payment, MaryAnne Gucciardi, a certified financial planner in Cambridge, Massachusetts, told CNBC Make It in January. In the same article, Andrew Herzog, a CFP in Texas, said, “more often than not, I’ve simply advised people to prolong their search, while still saving for an emergency fund and retirement.”",
                "author": "SnortingElk"
            },
            {
                "raw_content": "It's weird that Hong Kong and NYC have similar population sizes, yet Hong Kong has 752 homeless people and NYC has 350,000. And Hong Kong is far more unaffordable. Anecdotally, the last time I was in HK, I had zero people ask to bum a cigarette off me, and the last time I was in NYC, I had like 350,000 people ask.",
                "author": "pantiesdrawer"
            },
            {
                "raw_content": "Crazy that California is just making the choice to be wildly unaffordable to like 99% of people.",
                "author": "BlazinAzn38"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "There’s hope… “The Philippine condo bubble/market popped due to a reddit post”",
        "score": 8,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "No Income, No Employment, No Problem!",
        "score": 50,
        "text_content": "Just got this email from a mortgage broker in Plantation, FL. I wonder what HUD program requires no income or employment document verification. Was this part of the BBB? I assume down payment might have to be substantial, gonna call it the Pablo loan in Miami.",
        "comments": [
            {
                "raw_content": "Oh, I’ve seen this one before. In 2007",
                "author": "wrenches42"
            },
            {
                "raw_content": "Return of no-doc loans?",
                "author": "Physical-Flatworm454"
            },
            {
                "raw_content": "“Income that’s tough to document traditionally” Like arms dealing? Boosting cars? Cooking Meth? Come on down!",
                "author": "DJDevine"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "I believe. But help me understand",
        "score": 0,
        "text_content": "I believe correction is coming, but I struggle with these two facts: There’s a ton of people who invested in the stock market coming out of Covid. Stocks are setting new highs often and with info readily available a lot of people making a lot of money. Money supply is up 40% or more depending on if you’re going m1 or m2. Wouldn’t it make sense for everything to go up 40% that hasn’t been made cheaper by a new discovery in that field. Supplies and labor aren’t cheaper today than 2019. I’ve been looking at houses in my area and have seen prices drops like crazy and when I look for recently sold. There’s still a good 10% for most houses in my price range before most recent comps. But every weekend I go to an open house I see 7-8 people out and about at the house or they’ve signed in. I don’t think realtors are lying on these sign in sheets. Although, I wouldn’t out it up above them. But I’ve seen the foot traffic. Wells Fargo said loans were up for the first time in a while. So, how do y’all process both sides of the coin on this? Do you see 2019 levels for most areas? Thanks!",
        "comments": [
            {
                "raw_content": "Take a trip to Florida or Texas. It will get to your town sooner or later.",
                "author": "DragAccomplished1731"
            },
            {
                "raw_content": "I am one of the 7-8 people at an open house. The prob is I’m not paying for the price they are listing. I’m gonna keep coming to your open houses. My presence is going to let you know your price is too high, cause I’m not going to make an offer till it makes sense. That’s when things get real. I’m seeing it now in Reno, finally. Prices are starting to come down. But, man, it’s freaking slow. It’s a freaking stand off right now. Thats why no one has extra cash. Vegas is dead and so is every other non essential entertainment. Owners are trying to hold price, and they are slowly losing their patience and anything they might have had saved up.",
                "author": "thisseemslikeagood"
            },
            {
                "raw_content": "The funniest thing about someone like you is how much smarter you think you are than others who disagree with you. [Even tho anyone can just look at your post history and laugh at what they see. ](https://old.reddit.com/r/economicCollapse/comments/1lmywaj/largest_crash_very_soon/n0c24d2/?context=3) So do me a favor, okay big guy? Get off the T, it's making you yell at how you're losing money in Florida investing on the internet. If you want a higher T count, drink less beer, hit the gym more. [And, maybe just maybe, do some reading up on what a mortgage origination is, since you earnestly seem to think they are up...?](https://fred.stlouisfed.org/series/RCMFLOORIG) Maybe develop a personality beyond \"I go to disneyworld, like money and do drugs\" since you've hit middle age...?",
                "author": "Jumpy-Ad8831"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Tencent releases open-source 3D world generation model that enables you to generate immersive, explorable, and interactive 3D worlds from just a sentence or an image",
        "score": 499,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So are these persistent? (Ie, could I run around and do stuff for a while and then turn off the model, would the environments it generated still exist and be acessible?) Edit: Looks like yes, there's the ability to export meshes. Here's the github https://github.com/Tencent-Hunyuan/HunyuanWorld-1.0",
                "author": "-illusoryMechanist"
            },
            {
                "raw_content": "We are so close to Text2game.",
                "author": "The_Scout1255"
            },
            {
                "raw_content": "What, is this real? That’s insane. I honestly didn’t know we were so close to entering a sentence on a website and getting an explorable digital world in return.",
                "author": "Low_Key_Trollin"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Trump says AI companies shouldn’t have to pay authors everytime AI learns from their content “Learning isn’t stealing”",
        "score": 503,
        "text_content": "https://www.techpolicy.press/transcript-donald-trumps-address-at-winning-the-ai-race-event/",
        "comments": [
            {
                "raw_content": "Meanwhile AI guys: \"Stop making your model learn by using ours.\"",
                "author": "Stetto"
            },
            {
                "raw_content": "A broken clock is right twice a day. Finally something i agree with Trump on!",
                "author": "Silver-Chipmunk7744"
            },
            {
                "raw_content": "100% correct. The law, such that it is, applies to outputs not inputs.",
                "author": "harmlessfugazi"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "New AI from Tencent builds entire 3D worlds from just a sentence or a picture.",
        "score": 200,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Tencent released a new AI called HunyuanWorld 1.0. It's a tool that can generate a whole 3D scene from a simple text prompt or a single image. Pretty interesting step for creative AI. Official Site: https://3d.hunyuan.tencent.com/sceneTo3D GitHub: https://github.com/Tencent-Hunyuan/HunyuanWorld-1.0",
                "author": "pseudoreddituser"
            },
            {
                "raw_content": "AI is going to do a lot of things for us in the future, but real time generation and exploration of 3d environments with persistent NPCs is going to be the thing that touches society in a way we aren't prepared for.",
                "author": "Pseudo-Jonathan"
            },
            {
                "raw_content": "So all someone has to do is hook this up to VR and you've got like v0.1 of a holodeck.",
                "author": "Klutzy-Snow8016"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The first ~100% effective HIV prevention drug is approved and going global, requires 2 injections a year",
        "score": 416,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The important part is prevention not cure. The cure part is hard.",
                "author": "Red-candy5577"
            },
            {
                "raw_content": "Truvada PrEP with 99% effectiveness and essentially 100% when used correctly has been around for over a decade. The benefit of this new drug is that it could be given to people where daily pills just dont stick.",
                "author": "eugay"
            },
            {
                "raw_content": "Please revive Asimov",
                "author": "nitonitonii"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Chinese Premier Li strongly calls for global AI cooperation, says that China is willing to share its AI developments with others, promote rapid open-source rollouts, and open up further. He emphasized the need for joint efforts to advance AI for the benefit of all humanity",
        "score": 1431,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I hope this competition between the two AI powers bring prosperity to the whole world",
                "author": "evnaczar"
            },
            {
                "raw_content": "There should be an international treaty",
                "author": "BBAomega"
            },
            {
                "raw_content": "you know people the AI 2027 thought experiment was made to make you critically think, not to blindly follow its speculations as truth. Don’t assume China is unnuanced or blankly evil in their intentions, it’s a complicated af country just like America",
                "author": "Oreare"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Chinese home appliance brand Haier launches its first household humanoid robot",
        "score": 504,
        "text_content": "Chinese home appliance brand Haier has launched its first household humanoid robot, aiming to bring this robotic butler into the homes of Haier's global 1 billion users.",
        "comments": [
            {
                "raw_content": "I won't believe it until I see 10 independent reviews. That said, this is cool as hell and definitely the future. Send me one and an SDK.",
                "author": "createthiscom"
            },
            {
                "raw_content": "Cool concept, but I would never let robots at this stage in development touch anything that could cause a fire. If I had a robot right now it would be mostly for doing laundry, sweeping floors, and doing dishes. If I had a robot ten years from now I would treat it more like a companion and relegate more executive household functions to it.",
                "author": "LeftBullTesty"
            },
            {
                "raw_content": "Cleans the toilet and then cooks your dinner",
                "author": "Objective_Mousse7216"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "ChatGPT Therapy Sessions May Not Stay Private in Lawsuits, Says Altman",
        "score": 173,
        "text_content": "",
        "comments": [
            {
                "raw_content": "ChatGPT is NOT your confidant for anything",
                "author": "dalek-predator"
            },
            {
                "raw_content": "He’s basically saying the other side can subpoena their spouse’s ChatGPT and use it against one another in a divorce.",
                "author": "etakerns"
            },
            {
                "raw_content": "People... if you put something on the internet... don't kid yourself into thinking it's private. It exists somewhere now forever. It will sit on a server til the end of time, a server most likely getting grandfathered and becoming more and more exploitable every passing moment. There will always be new people to exploit and ransom your information, even if we catch them all today. There will be new ones tomorrow. There are probably even bad actors in this very sub. [The NSA data breach literally lost EVERYONE's data](https://www.youtube.com/watch?v=fxqcwK5OMag). Yeah. I mean everyone. They were trying to map the entire planet and guess what? All of those juicy datapoints got stolen and ransomed, along with a plethora of hacking tools that make your security look like a chihuahua. Then, when the ransoms were not paid, the bad actors disappeared. They only caught two of them. *Maybe.* The rest of them are still out there, running amok through entire mountains of code. Code they now own. We must always assume that our data is already in the hands of bad actors and there is nothing we can do about it. The NSA hack was called \"the greatest data breach in history\"... and this is just the stuff we *know* about. When it comes to keeping your data confidential, it's already a nightmare scenario. We *lost* the privacy war a long time ago. If there's real-world information you don't want people to access... keep it off the internet. Literally everything you ever posted... everything you've ever tried to hide... it's already in the bad guy's hands. You're just not a target. Yet.",
                "author": "WiseauSrs"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Reddit might be a terrible place to assess how useful AI really is in most industries",
        "score": 75,
        "text_content": "As someone who works in AI + scientific simulations, I feel like I have a pretty good understanding of where large language models (LLMs), RAG pipelines, and automation tools actually provide value in my field. At least in my domain, I can tell when the hype is justified and when it's not. But admittedly, when it comes to other industries, I have no way of really knowing the status of AI when it comes to potential replacements of workers. I don’t have firsthand experience, so naturally I turn to places like Reddit to see how professionals in those fields are reacting to AI. Unfortunately, either the progress sucks in pretty much every other field or Reddit just isn't telling the truth as a whole. I’ve visited a lot of different subreddits (e.g. law, consulting, pharmacy, programming, graphic design, music) and the overwhelming sentiment seems to be summed up in one simple sentence. \"These AI tools sucks.\" This is surprising because at least in my profession, I can see the potential where these tools + RAG + automation scripts can wipe out a lot of jobs. Especially given that I am heading one of these operations where I predict that my group count could go down by 80-90% in the next 5 years. So why does it suck so bad in pretty much every other field according to Reddit? But here’s where I start to question the signal-to-noise ratio: * The **few people** who claim that AI tools have massively helped them often get **downvoted or buried**. * The **majority opinion** is often based on a couple of low-effort prompts or cherry-picked failures. * I rarely see concrete examples of people truly *trying* to optimize workflows, automate repetitive tasks, or integrate APIs — and still concluding that AI isn’t useful. So I’m left wondering: Are people being honest and thoughtful in saying “AI sucks here”? Or are many of them just venting, underestimating the tech, or not seriously exploring what's possible? Also, yes, we haven't seen a lot of displacement yet because it takes time to build a trustworthy automation system (similar to the one that we are building right now). But contrary to most people's beliefs, it is not just AI(LLM) that will replace people but it will be AI(LLM) + automation scripts + other tools that can seriously impact many white collar jobs. # So here’s my real question: **How do you cut through the noise on Reddit (or social media more broadly) when trying to assess whether AI is actually useful in a profession (or if people are just resistant to change and venting out)?**",
        "comments": [
            {
                "raw_content": "In addition to what you raise - A lot of the value is being captured in spaces under NDA that can't share it. Workflows are difficult to share convincingly and the value is also subjective and difficult to evaluate objectively. It's both \"if you know you know\" but also \"how do I write good evals for this\" which is boring and bad for engagement, the lifeblood of social media. A lot of the AI evangelists are incompetently using obviously AI generated posts to share what they learned, which makes their message ineffective. tldr; Social media is not going to be a truth source here, period. You have to experiment and find the value for yourself. And it would be better to be cautious in the format you choose to share your message as well, or you just create more useless noise.",
                "author": "YoAmoElTacos"
            },
            {
                "raw_content": "We're in a don't ask don't tell period as well. I'm in the game industry and talking about AI has cost me friendships/work relationships before. AI tools accelerate some parts of work. Unintelligent people trying AI say it sucks when the AI does not perfectly do everything. I see AI as the equivalent of a bulldozer or a nailgun: very useful but unable to do the work by itself.",
                "author": "PwanaZana"
            },
            {
                "raw_content": "I'm an oil painter and mostly paint nudes. The tools are pretty much lobotomized specifically to be useless for me I can see how they could be very helpful. But right now spending thousands of dollars for a PC capable enough to run models locally just to avoid censorship and countless hours rendering and fixing mistakes via inpainting to achieve worse results than I can just draw in a single hour isn't a valuable proposition",
                "author": "veinss"
            }
        ],
        "subreddit": "singularity"
    }
]