[
    {
        "post_name": "DO WHAT HAS TO BE DONE!!!",
        "score": 407,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Every member of the Seditious Six should get the maximum 10 years. Less fining, more imprisoning",
                "author": "magapatriot_pa"
            },
            {
                "raw_content": "Crazy how Biden’s DOJ just did what they thought needed to be done without him having to tweet about it for a month first",
                "author": "Taqiyya_Mockingbird"
            },
            {
                "raw_content": "Call me when it actually happens. Nothing but hot air so far on all this shit that should be OBVIOUSLY handled swiftly. If it was the Dems in charge heads would be rolling and the rivers running with blood.",
                "author": "PsychoDodo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I nominate James Woods for: \"Shit-poster-in-chief.\"",
        "score": 319,
        "text_content": "",
        "comments": [
            {
                "raw_content": "In the ass, probably",
                "author": "Say_what_again"
            },
            {
                "raw_content": "Up the ass",
                "author": "redditadminssuckit"
            },
            {
                "raw_content": "Interesting picture.",
                "author": "Maxmax"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I think somebody gave Trump some really good coffee or something, he was on fire today.",
        "score": 282,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The looks on their faces as they turn away…knowing he’s beaten them yet again. 🤣 ( Dangit! He kicked my ass AGAIN!” )",
                "author": "Well_Shave_MY_Taint"
            },
            {
                "raw_content": "Lol, comedy Gold.",
                "author": "Beelzy"
            },
            {
                "raw_content": "You get to fly on Air Force 1, the world's most exclusive and expensive private jet. You're flying with the President of the United States of America and you have the chance to ask him questions and \"will you release your MRI?\" is the best you can come up with? I would've been the asshole to look her straight in the eye and ask her if she could read it? Where'd she do her radiology residency? These people are repugnant.",
                "author": "Moose_Antlers"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "MN DHS Employees Spill the Tea on Gov. Tim Walz's 'Inveterate' Lying, Complicity in Somali Fraud",
        "score": 270,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Tim walz, Why are you grey?",
                "author": "Bohemyth_2"
            },
            {
                "raw_content": "Wow, it makes me wonder if Kamala knew what she was doing by having this retard be her VP pick.",
                "author": "TheJakeFroggy"
            },
            {
                "raw_content": "Let's start pushing legislation that makes it a crime for government employees to provide benes to illegals. Please create a one page document that contains legislation enacting laws that ciminally charge and fine government employees complicit in supplying illegal immigrants with government benefits meant for us citizens United States Illegal Benefits Enforcement Act of 2025An Act to Prohibit and Penalize Government Employees for Complicity in Providing Federal Benefits to Undocumented ImmigrantsBe it enacted by the Senate and House of Representatives of the United States of America in Congress assembled,SECTION 1. SHORT TITLE.This Act may be cited as the \"Illegal Benefits Enforcement Act of 2025\" or \"IBEA 2025\".SECTION 2. FINDINGS AND PURPOSE.(a) Findings.—Congress finds that: (1) Federal benefits programs, including but not limited to Social Security, Medicare, Medicaid, SNAP, housing assistance, and unemployment insurance, are funded by taxpayer dollars and intended exclusively for United States citizens and lawful permanent residents. (2) The provision of such benefits to undocumented immigrants undermines the integrity of these programs and imposes undue financial burdens on American taxpayers. (3) Government employees who knowingly facilitate or are complicit in such provisions violate public trust and existing federal immigration laws.(b) Purpose.—The purpose of this Act is to establish criminal penalties and fines for government employees complicit in supplying federal benefits to undocumented immigrants, thereby ensuring accountability and deterring future violations.SECTION 3. DEFINITIONS.For the purposes of this Act: (a) Government Employee means any individual employed by a federal, state, or local government agency, including contractors and agents acting on behalf of such agencies. (b) Undocumented Immigrant means any non-citizen present in the United States without lawful immigration status under the Immigration and Nationality Act (8 U.S.C. § 1101 et seq.). (c) Federal Benefits means any assistance, grant, loan, entitlement, or subsidy provided under federal law and intended for U.S. citizens or lawful residents. (d) Complicit means knowingly or recklessly aiding, abetting, facilitating, or failing to report the provision of federal benefits to an undocumented immigrant.SECTION 4. PROHIBITIONS AND PENALTIES.(a) Prohibition.—It shall be unlawful for any government employee to be complicit in the approval, distribution, or facilitation of federal benefits to any undocumented immigrant. (b) Criminal Penalties.— (1) Any government employee who violates subsection (a) shall be guilty of a felony and, upon conviction, shall be imprisoned for not less than 1 year nor more than 5 years. (2) If the violation results in benefits exceeding $10,000 in value, the term of imprisonment shall be not less than 3 years nor more than 10 years. (c) Civil Fines.—In addition to criminal penalties, violators shall be subject to a civil fine of not less than $5,000 nor more than $50,000 per violation, payable to the United States Treasury. (d) Additional Consequences.—Conviction under this section shall result in immediate termination of employment and permanent ineligibility for future government employment or benefits.SECTION 5. ENFORCEMENT.(a) The Attorney General of the United States, in coordination with the Department of Homeland Security and the Inspector General of relevant agencies, shall investigate and prosecute violations of this Act. (b) Whistleblower protections shall apply to any individual reporting violations, pursuant to the Whistleblower Protection Act of 1989 (5 U.S.C. § 2302(b)(8)).SECTION 6. EFFECTIVE DATE.This Act shall take effect 180 days after the date of enactment.Passed the House of Representatives [Date]. Passed the Senate [Date]. Approved by the President [Date]. Explain whistleblower protections Similar state-level laws Make penalties more severe",
                "author": "MocksFordComma"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "America never had a revenue problem… We have a theft problem.",
        "score": 1112,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Pretty much. Can't imagine what our lives would be like without the theft. We'd have the best of everything.",
                "author": "airborne3502"
            },
            {
                "raw_content": "When a child gets given $10 and proceeds to spend it all on useless junk, you stop giving it money and tell them that they have to earn it themselves. When the government gets trillions of dollars and spends it on useless junk, taxpayers are still forced to foot the bill or else they go to jail for the rest of their lives. Seems pretty ridiculous.",
                "author": "IamM"
            },
            {
                "raw_content": "Yup!! No parties all a criminal cartel. Government should be cut 89%",
                "author": "Wupta"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: Director of National Intelligence Tulsi Gabbard says MORE DOCUMENTS EXPOSING BARACK OBAMA and his leadership role in the Russiagate hoax are going to be released to the American people this week.",
        "score": 995,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wish the DOJ would move on this stuff. .",
                "author": "airborne3502"
            },
            {
                "raw_content": "Well that's F***ING great but without charges of TREASON what good will it do? Because there is no FAFO for what they have done, they will simply continue to do it again after Trump is out of office while continuing to obstruct his administration with rogue judges.",
                "author": "saltyviewer123"
            },
            {
                "raw_content": "Does anyone else just read \"BREAKING\" and basically have your brain automatically disregard whatever comes after those words? Like the boy who cried wolf, but for our brains.",
                "author": "American-Patriot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "TRUMP: Ban on third-world migration is PERMANENT",
        "score": 1598,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Unless it's put into Law, the next Democrat president will just override it and open the borders wide open.",
                "author": "Landslide_2020"
            },
            {
                "raw_content": "Unfortunately India isn't considered a 3rd world country..",
                "author": "Sidewinder24"
            },
            {
                "raw_content": "If only congress would do something...",
                "author": "CounterStrike"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Pete Hegseth : For your Christmas wish list…",
        "score": 806,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I voted for this",
                "author": "Phaded"
            },
            {
                "raw_content": "I swear I saw this on here a day or so ago and then SoW Hegseth posted this. There are definitely people in the senior level (or their aids) of the US government browsing here and taking the best memes or AI images and posting it.",
                "author": "Scatter-Shot"
            },
            {
                "raw_content": "Pepe 🐸 #1 friend.",
                "author": "OldZilla"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The New York Times is reporting that President Donald Trump’s new East Wing ballroom proposal would be larger than the White House itself",
        "score": 873,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You need lots of ballroom when you have big balls",
                "author": "austford"
            },
            {
                "raw_content": "* doesnt cost taxpower a cent.",
                "author": "computer7723"
            },
            {
                "raw_content": "Who gives a flopping fuck. We got problems.",
                "author": "DefineTheLine"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Andrew Wolfe's mother talks about his condition. From yesterday.",
        "score": 954,
        "text_content": "",
        "comments": [
            {
                "raw_content": "God bless this family.",
                "author": "GuerillaYourDreams"
            },
            {
                "raw_content": "My Brother died from a head injury. In the end it was the Brain Swelling that killed him on the 7th day. God Bless tis Patriot. Pray for him. His worst days are just ahead of him. He'll need all our prayers to survive this",
                "author": "ACActual"
            },
            {
                "raw_content": "\"we are wanting for nothing\" - white culture.",
                "author": "freedom-thinker"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump on AF1: Ilhan Omar married her brother… she shouldn’t be allowed to serve and we should throw her the hell out of the country",
        "score": 1416,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We should elect Trump president so he can install a director of the United States Citizenship and Immigration Services that will get the job done.",
                "author": "BirthHole"
            },
            {
                "raw_content": "Yet she's still in office... Sure wish there was some type of authority figure that could take action",
                "author": "PhoneBandit"
            },
            {
                "raw_content": "\"I will be calling the attorney general into my office tomorrow to discuss this egregious abuse of the immigration system and theft of a congressional seat\" That's the sentence he should have said next so \"muh doomers\" like me don't have to come here and complain about more do-nothing words from the person in power. If only he put pressure on his own cabinet the same way he does with these buttfuck countries and other non-MAGA issues.",
                "author": "assblast"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Tariff Revenue Surges To Record High Of $31.4 Billion In October",
        "score": 1068,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Cool, can’t wait to still file taxes",
                "author": "panic_scam"
            },
            {
                "raw_content": "Even that is pocket change in comparison to the debt and even the deficit. The spending and money printing is still going \"BURRRRRRRRRRRRRRRRRRR.\"",
                "author": "armyofpedes4usa"
            },
            {
                "raw_content": "We are paying over 100 billion a month in interest on the debt. Doge didnt do enough, if anything to reduce it. Congress must act or everything Trump does will be reversed in the future.",
                "author": "CounterStrike"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Presidential Ballroom, which I am building at the White House, with all private donations and funding (ZERO cost to the American Taxpayer!), will be, at its completion, the most beautiful and spectacular Ballroom anywhere in the World!",
        "score": 1060,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fuck the ballroom, I want retribution and arrests.",
                "author": "The1776Man"
            },
            {
                "raw_content": "The events are never small. The social pages say he’s got the biggest balls of all.",
                "author": "Thomm"
            },
            {
                "raw_content": "Link https://truthsocial.com/@realDonaldTrump/115641123675257358",
                "author": "I-am-Orlando"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "73rd Time's the Charm...",
        "score": 1031,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is part of the money laundering. They send this guy to a counselor that double charges the state along with a parole officer which is double charging the state and probably some kind of therapy which is double charging the state. They make more money off these crooks going through the system than they do putting them behind bars.",
                "author": "snakeoil"
            },
            {
                "raw_content": "After a certain point, the death penalty should be mandatory. If you've sufficiently proven that you cannot function as a human being, that's it. You're done.",
                "author": "Powdered_Sugar"
            },
            {
                "raw_content": "“He dindu nuffin” - CNN",
                "author": "iteachfuckinscience"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Late Sunday Gunday, Glock edition",
        "score": 652,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That ain't no Glock I ever seen.",
                "author": "Rope_Tree_Journalist"
            },
            {
                "raw_content": "Coulda just said Beretta.",
                "author": "GallowsTime"
            },
            {
                "raw_content": "The new Glock V series definitely jam. RIP Glock.",
                "author": "brassmule"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Rationality",
        "score": 1776,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yep. Logic for the win. Go back. Leave now or its going to get scarier. MAGA AF",
                "author": "Mulletgunning"
            },
            {
                "raw_content": "Go home to mommy.",
                "author": "utfanx2"
            },
            {
                "raw_content": "Which fear is worse? Fear of mean old dictator fascist ORANGE DEMON Trump and all his evil white demon hordes of huwhite people? Or the friendly neighborhood Taliban jihadi who speaks their language, oppresses them in their own religion, and treats them precisely as the Prophet Mohammad commands in the Book Which Cannot Be Questioned or Changed? It's time for them to go home to their nice, stable tribal wilderness where we left it exactly the same way we found it 20 years ago.",
                "author": "Moose_Antlers"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Minnesota government workers blame Walz for 'massive fraud' amid allegations against Somali community - More than 400 current staff members say governor 'systematically retaliated' against whistleblowers",
        "score": 1383,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm just willing to bet that that little dwarf is a real fuckhead to internal personnel who don't immediately toe the line. I haven't forgotten his momentary rage face at his own kid.",
                "author": "MocksFordComma"
            },
            {
                "raw_content": "I'm a broken record on this faggot. He's complicit. He's not just turning a blind eye... he's *complicit.* Him and his precious Chinese school in the Twin Cities tells you everything you need to know.",
                "author": "Bidensmellslikepiss"
            },
            {
                "raw_content": "If only there is a Bureau in the Federal level of the government that investigates these thing.",
                "author": "Scatter-Shot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "More GOP senators likely to defect from Trump over military action in Venezuela, Sen. Tim Kaine predicts🙄",
        "score": 806,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Probably the other way around. The useless GOP love their forever wars",
                "author": "mty_green_go"
            },
            {
                "raw_content": "They don’t do shit for Americans now. Who cares? All the knowinglys.",
                "author": "PatriotSkorzeny"
            },
            {
                "raw_content": "Timmy boy was never for this country and only cares about the same things all the uniparty kidfuckers care about.... money and power.",
                "author": "Dev404"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"HEY MIJO.. WHERE THE EBT CARD GO.. THERE NO MONEY!\"",
        "score": 1254,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Seize EVERYTHING. they come here illegally, they deserve nothing",
                "author": "Wrexxis780"
            },
            {
                "raw_content": "All of a sudden, ISIS, Al Shabob, ISIS in Mali, and the Haitian Nous Ensomme all disappear into the mists of time.",
                "author": "learntocode"
            },
            {
                "raw_content": "Long, long overdue. No remittances by illegals.",
                "author": "TDAF"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Yes, Illhan Omar DID marry her brother. Yes, Illhan Omar should be denaturalized and deported. Immediately!!!",
        "score": 754,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nothing will happen.",
                "author": "OrangeManNotBad"
            },
            {
                "raw_content": "Let's fucking gooooooo already! Pam Blondi is useless!",
                "author": "AgnesDomini"
            },
            {
                "raw_content": "For the 9th straight year: yes and yes. Out and get her the fuck out.",
                "author": "SCP0073"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Samsung's new breakthrough NAND flash storage uses 96% less power, more details at CES 2026",
        "score": 485,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Strange an article refers to a academic paper from Nature but doesn’t include any link to it. I’m guessing this is the Nature paper: https://www.nature.com/articles/s41586-025-09793-3 behind a paywall sadly.",
                "author": "GunZinn"
            },
            {
                "raw_content": "Keep in mind it does say \"up to 96%\". Who knows what the average figure will be? Could be anywhere from 1% to 95%.",
                "author": "Nuck_Chorris_Stache"
            },
            {
                "raw_content": "Like 96% better power consumption in sleep mode or active read/writes?",
                "author": "Big-Conflict-4218"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[LTT] Building the PERFECT Linux PC with Linus Torvalds",
        "score": 406,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Most of the video is just a Q&A, very little focus on building the PC, just due to the casual conversation. Honestly made the video a lot more fun. You still get the reasons for everything but the GPU, which was added in video comments. This is the reason: \"Talking about the ARC GPU Choice - It was never clarified in the video because both Linus/Linus ended up continuing their conversations after being side tracked and never circled back. In our original email communications it is because Linus T drives 2 x 6K displays and needed something more than integrated graphics without being an annoying loud or power hungry \"gaming\" class GPU. It was suppose to be a Intel Arc B50 but we could not get one in time of shooting. Linus T clarified he was still more than ok at the time of filming with this GPU being used. Sorry this wasn't in video form, but they just had so much fun talking we all forgot to circle back to this point. - Elijah\"",
                "author": "parentskeepfindingme"
            },
            {
                "raw_content": "Pretty fascinating conversation. Torvalds comments on AI are probably going to ruffle some feathers, he is right of course but he is never one to mince his words on any topic.",
                "author": "jenny_905"
            },
            {
                "raw_content": "dental plan! Linus has braces",
                "author": "Loose_Skill6641"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung to unveil HBM4 chip that's 40% faster early next year",
        "score": 59,
        "text_content": "",
        "comments": [
            {
                "raw_content": "faster chips is cool but I really just want affordable high capacity, I'd even accept generationally slower speeds to have it",
                "author": "rageling"
            },
            {
                "raw_content": "I’m sort of curious of HBM generations represent obsolescence points of AI chipsets. Or maybe it doesn’t matter that much.",
                "author": "NewKitchenFixtures"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nvidia may raise prices as it pays Samsung double for future HBM4 AI memory modules with 3.3 TB/s bandwidth",
        "score": 51,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"Nvidia may have to raise prices\" Lmao like Nvidia doesn't have 75% margins right now.",
                "author": "DerpSenpai"
            },
            {
                "raw_content": "This is bad news for big data centers.. for normal consumers it’s inconsequential, they don’t put HBM on their gaming cards.",
                "author": "SuperDuperSkateCrew"
            },
            {
                "raw_content": "Nvidia: \"Earning 2000% of the manufacturing cost isn't enough, lets make it 3000% so the CEO can keep buying islands, mansions and build underground cities so he and his friends can stay away from the normal human being\"",
                "author": "MotherFunker1734"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Chinese GPU Maker Demos Its Next-Gen Fuxi A0 GPU Based on Imagination DXD GPU IP: Features 5nm Core, 12 GB VRAM, Ray Tracing & Super-Res Support",
        "score": 108,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So apparently this is an evolution of the PowerVR architecture... that takes me back. They're claiming 2.3TFLOP, 72GTexel/sec: https://www.imaginationtech.com/product/img-dxd-72-2304-mc1/ That would put its theoretical performance at less than a GTX 1650 and a little ahead of a GTX 1050Ti...and of course raw numbers don't mean anything without good drivers.",
                "author": "jenny_905"
            },
            {
                "raw_content": "While this is a welcome development, we have to keep our expectations realistic. There hasn't been a desktop class PowerVR graphics core in like 25 years. Scaling up a design built for cellphones is going to be informative for them and maybe in a generation or two they might actually have something going, but it's going to be a slow progression. Just look at Intel's struggles to break through.",
                "author": "nismotigerwvu"
            },
            {
                "raw_content": "Even OpenCL 3.0 support, nice!",
                "author": "ProjectPhysX"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Asianometry] Let’s Break Down the 45nm Process Node",
        "score": 8,
        "text_content": "",
        "comments": [
            {
                "raw_content": "An incredible (hour long!) deep dive into the 45nm node from Asianometry.",
                "author": "iDontSeedMyTorrents"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung reportedly nears December verdict on Nvidia HBM4 tests",
        "score": 6,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "[GamersNexus] GPU Prices Crater Before Inevitable Opportunity to Screw Consumers",
        "score": 10,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The fact that Nvidia is no longer bundling memory with the GPUs should tell you everything you need to know about what is coming.",
                "author": "jigsaw1024"
            },
            {
                "raw_content": "I miss when Gamers Nexus reviewed products.",
                "author": "ihadagoodone"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "DOOM Eternal looks great on the Switch 2 !",
        "score": 425,
        "text_content": "I was trying to record myself playing for a video, and while I did a bad job framing it, it gave me an opportunity to play the game again on Switch 2, and what a surprise ! I forgot how good that port was. Here's hoping Id Software or Panic Button are working on a Switch 2 patch. I was a bit uncomfortable with the controls as it's been a while since I last played but the game really does not look that bad considering it's stretched to a 1080p display. Try it if you haven't already !",
        "comments": [
            {
                "raw_content": "Wonder if we'll get Switch 2 upgrades for this and 2016 when the inevitable Dark Ages port releases?",
                "author": "SomeBoxofSpoons"
            },
            {
                "raw_content": "https://preview.redd.it/x1wrcec3ph4g1.jpeg?width=1471&format=pjpg&auto=webp&s=4f4b1e7bd162abfd023afb96f907fb0ab36ea489 Peak game is peak",
                "author": "MetroidFREAK21"
            },
            {
                "raw_content": "Does it really? It's still locked to 30 fps and is still the damn same version as on the Switch 1. I bought the Switch 2 on day one but saying that I'm disappointed in Nintendo witholding dev kits and therefore blocking Switch 2 updates for about almost every game out there is a huge understatement. When I got the Switch 2 I bought so many Switch 1 games thinking that they'll be updated soon but so far only 1 out of a 100 has been updated, which is Dave the Diver. What a letdown, really! So much potential, unused!",
                "author": "KobraKay87"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Now that it's been fixed, if you are looking for an excellent game to play on your Switch 2, I really recommend you look into Nier Automata.",
        "score": 856,
        "text_content": "Dude, this game is seriously one of the best I've ever played, and even though the Switch 1 port is a bit downgraded, it still looks pretty good, especially on handheld. And the FPS are rock solid on the Switch 2. Totally worth it and a must-play game, no matter the platform.",
        "comments": [
            {
                "raw_content": "it's fixed?! fuck yeah, downloading again now",
                "author": "Happy-For-No-Reason"
            },
            {
                "raw_content": "I can't believe I waited so long to play this, it's one of the most subversively creative games I've ever seen",
                "author": "ntwild97"
            },
            {
                "raw_content": "I loved dmc3 and astral chain. If I were to get this and Bayo, which should I get first?",
                "author": "iwannabethisguy"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Metroid Prime 4 is out *this week*. People have been waiting close to a decade since it was announced, and nearly 2 since the previous game. We're in the final stretch now, be safe out there",
        "score": 25,
        "text_content": "Look twice when crossing the road Stay on the right side of the tracks Follow your doctor's orders Turn off the Christmas lights before bed Stand behind the yellow line (no, even further back than that, yeah, there you go) Do not go skydiving Stay away from the edges of the enclosures at the zoo Fugu is strictly off the menu Do not fly with Nepal Airlines, Lion Air, or Ariana Afghan Airlines Turn down that invite to the grand opening of Jurassic Park If you encounter Hell's Angels, yakuza or >!space !<pirates, just turn and walk away Do not poke bears (or Ridley) with a stick And take care of your hands and fingers - do not operate a nineteenth century loom, do not hand feed a baby crocodile You've made it this far, stay safe for 3 more days!",
        "comments": [
            {
                "raw_content": "Mp4 out without a dedicated direct is WILD",
                "author": "neukolln"
            },
            {
                "raw_content": "It's finally here but I won't be able to play until the 17th. The wait continues.",
                "author": "Legion_Lavoie"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "For those of you trying to save money on Nintendo games, Costco is selling Nintendo gift cards at 20% off this week.",
        "score": 174,
        "text_content": "You also get a 2% Costco discount. I just loaded $300 of Nintendo gift cards to my Nintendo Switch 2 for $234. I'm only planning to use this money on the major releases that release at full-price (i.e. Mario Kart World, Prime 4, etc.). Hope this helps someone!",
        "comments": [
            {
                "raw_content": "Just a reminder that you can now also use the gift cards on Nintendo hardware and physical games they sell, so you can get a Switch 2 for 20% off (assuming it's in stock).",
                "author": "MotorolaRazorRamon"
            },
            {
                "raw_content": "I grabbed mine. I plan on getting the 2 vouchers with it and grabbing the new Metroid prime and deciding on another game. New Prime + 2nd game, $80. Not bad.",
                "author": "nrthrnlad"
            },
            {
                "raw_content": "So the $100 packs they usually sell for $90 are only $80?",
                "author": "benrodgers77"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Switch 1/2 Games Releasing The Rest Of 2025",
        "score": 142,
        "text_content": "A lot of people complained about all the consoles being in a specific consoles subreddit (which is fair) so Here's all the Switch 1/2 Games Releasing The Rest Of 2025! If I missed anything let me know and if you want a link: https://docs.google.com/spreadsheets/d/1EbGHsJjxt4VrpD8_0jPZn2JMB7WNz945S1hFgfXWddg/edit?usp=drivesdk",
        "comments": [
            {
                "raw_content": "Next week is freaking *stacked*, there's four games I want to buy! Marvel Cosmic Invasion, AC Shadows, Metroid Prime 4 and Octopath Traveler 0, gonna have to make tough choices.",
                "author": "AxLD"
            },
            {
                "raw_content": "Any local multiplayer games that would be good for a nine-year-old, six-year-old, and four-year-old to play simultaneously?",
                "author": "CanadianSZ24"
            },
            {
                "raw_content": "Stardew Valley Switch 2 Edition is supposed to come out this fall.",
                "author": "PurimPopoie"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Would you buy game key card games if they have a good sale?",
        "score": 171,
        "text_content": "I've been wanting to pick up Sonic X shadow generations ever since it came out but wanted to wait until it was on sale. I was so let down when it came to light it was a game key card. I typically only buy first party games for my nintendo consoles but $35 CAD ($25 USD) seems like a great deal so would you buy game key card games when they are on sale or should I just get it digitally",
        "comments": [
            {
                "raw_content": "If is a game I want I'll buy in whatever format. I don't care whether is a GKC or not. I just want to play.",
                "author": "paccodemongrel"
            },
            {
                "raw_content": "Imho I could not care less about whether GKCs will work in 30 years. However, ir does seem to me like a \"worst of both worlds\" situation: when I buy digital, it is for the convenience of not having to load and unload cartridges, and the negative side is that I have to use up storage space on the console. When I buy physical, I save storage space but have to fidget with cartridges more often. To have to deal with the negative sides of both experiences still sounds insane to me.",
                "author": "Melodic_Ad_1652"
            },
            {
                "raw_content": "Yes. Just bought Star Wars Outlaws GKC on sale. Was cheaper than the digital version.",
                "author": "marratj"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I got to try Prime 4! (spoilers covered)",
        "score": 36,
        "text_content": "I don't have a switch 2 but I got to try it during games fair in my city. The demo let me play the prologue >!up to the part where they were transporting the logo thing and tutorial boss comes up!<. The visuals were nice and the gameplay is buttery smooth. On a personal note, as someone who only plays on consoles and controllers: as much as it is intuitive to just drop your right joycon and switch playstyles, I found it a bit clunky. And between switching playstyles + the lock on feature, the controls for the camera became a bit disorienting. Obviously it's a non issue for anyone sticking to one playstyle, I just thought mixing it up would be fun The prologue reminds me so much of prime 3, cool action scenes, elaborate setpieces, and it drops Samus right into the chaos. It's making me consider getting a switch 2 😩",
        "comments": [
            {
                "raw_content": "You do know you can play it on Switch 1? It obviously won't look as good and you can't play with Mouse Mode, but it will still be playable at 60fps so you are hardly getting a bad experience (unless you are playing on a 4k TV, since I would think that the potential 9 times multiplier of resolution is highly significant). I would not buy a Switch 2 if this is the only game you care about and you have the Switch 1 though, since the game is cheaper by upgrading with an NSO voucher anyway so you may as well wait until exclusives you care about release, at which point you can buy the Switch 2 Edition if you feel like another play through.",
                "author": "WeekendUnited4090"
            },
            {
                "raw_content": "This game is top of the uk eshop charts right now",
                "author": "Potential-Bug-9633"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Just bought a Switch 2 Pro Controller and the A button is uneven with the other buttons is this normal?",
        "score": 5,
        "text_content": "I’m not sure if it just my controller 😭",
        "comments": [
            {
                "raw_content": "Yes!",
                "author": "Trami_Pink_1991"
            },
            {
                "raw_content": "Yes Most a buttons/buttons on that location are like that Cuz their off on the edge.",
                "author": "zaadiqoJoseph"
            },
            {
                "raw_content": "Yeah its actually mentioned in welcome tour",
                "author": "mafenide"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Former Rockstar Employee Demo Reel",
        "score": 1188,
        "text_content": "I came across this reel on reddit and thought it might be early footage/concept mo-cap work for multiple rockstar games (including GTA VI). Doesn’t appear to have been shared elsewhere or surfaced in recent leak-roundups. https://vimeo.com/1115554961 EDIT: Video got taken down. Here’s a [mirror](https://streamable.com/r96864)",
        "comments": [
            {
                "raw_content": "Finally, a new GTA 6 leak that is actually real",
                "author": "Elevatorisbest"
            },
            {
                "raw_content": "Dude labels and timestamps the first few clips specifically as GTA VI in the description. That’s pretty brutal because I feel like things like this could be under NDA",
                "author": "SuicideSkwad"
            },
            {
                "raw_content": "Good catch",
                "author": "deekaydubya"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "MP1st: Turok Origins Aims Release in 2026.",
        "score": 186,
        "text_content": "https://mp1st.com/news/report-turok-origins-aims-release-in-2026",
        "comments": [
            {
                "raw_content": "They really need to show some gameplay. All we got is that gamescom footage a few months back but it’s hard to find direct footage of it without commentators and it being 480p. What they showed initially only looked like your everyday team based raid/looter pve game but since that it looks more like a traditional turok game with n64 inspirations, a single player campaign and of course first person view (thank god) hope more is revealed soon.",
                "author": "DekuSussyBaka"
            },
            {
                "raw_content": "[My honest reaction to this information.](https://www.youtube.com/watch?v=OC-7Guw9lo0)",
                "author": "Spiritual-Ad-6110"
            },
            {
                "raw_content": "I would hope so",
                "author": "ESF007"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "User who claims to have gotten an early Metroid Prime 4 copy from a store (image shown), states that the controversial Myles MacKenzie character \"comes up very seldomly outside the first section\" but is \"not tutorial exclusive\". The game is \"awesome\".",
        "score": 668,
        "text_content": "Source, check the comments for the description of the game: [https://www.reddit.com/r/gamecollecting/comments/1p9ytkz/my\\_black\\_friday\\_pickups\\_minus\\_one\\_game\\_i\\_had\\_to/](https://www.reddit.com/r/gamecollecting/comments/1p9ytkz/my_black_friday_pickups_minus_one_game_i_had_to/) EDIT: Image of the game on their Switch directly, shared via DMs: [https://imgur.com/a/kl7znEI](https://imgur.com/a/kl7znEI)",
        "comments": [
            {
                "raw_content": "when do yall reckon reviews will go up? Tuesday?",
                "author": "ion_force"
            },
            {
                "raw_content": "Context matters. The reason Myles doesn't show up later on is cause he is replaced by other NPCs who join you in missions.",
                "author": "XulManjy"
            },
            {
                "raw_content": "at this point just wait and see for yourself. I wouldn’t blindly believe a reddit comment either",
                "author": "super_elite_gamer"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Jez Corden says Geoff Keighley's desert picture is teasing a Diablo 4 expansion but also something else",
        "score": 645,
        "text_content": "\"so it's really an expansion teaser? damn\" Jez: \"yes but also, more\" [https://xcancel.com/JezCorden/status/1995065300539347395#m](https://xcancel.com/JezCorden/status/1995065300539347395#m)",
        "comments": [
            {
                "raw_content": "#Jez Corden is a Tier 2 - Generally Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Yeah it did really look like something straight out of Diablo. It didn’t fit god of war at all imo",
                "author": "MrFOrzum"
            },
            {
                "raw_content": "I think it might be Switch2 launch since it was rumoured and confirmed by Nate that it is eventually going to be on Nintendo.",
                "author": "Mascarpon5"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[Need4Games] Details about Don't Nod's Cancelled Sci-Fi Project",
        "score": 202,
        "text_content": "Context: Don't Nod cancelled a project that was in pre-production due to layoffs, it was 9 months in development, from September 2023 to June 2024, it had around 15 to 20 developers working on it. \"As for the genre of the game, it was a new IP, a very ambitious Sci-Fi Singleplayer Action RPG in Unreal Engine 5. Unfortunately, we couldn’t find out much about the game’s art design or other details, as it was also in pre-production.\" After it was canned, the team was moved to work on a \"very ambitious\" new project that is similar to the previous one mentioned, but also Open World, still years away from launch. Source --> [https://need4games.ro/en/exclusive-details-about-dont-nods-cancelled-and-upcoming-ips](https://need4games.ro/en/exclusive-details-about-dont-nods-cancelled-and-upcoming-ips)",
        "comments": [
            {
                "raw_content": "Don't Nod is such an interesting developer, it's like they use narrative adventure games to pay the bills while also making weird pure mechanics focused games (Jusant) and RPGs in the side.",
                "author": "Stuglle"
            },
            {
                "raw_content": "Sounds like this morphed into the upcoming **[Aphelion](https://youtu.be/_oUUnfGffCQ?si=zMY9Lw4v5tqP5ii9)**. **Edit** - *Reading this again, I don't think that timeline could feasibly match up. Ignore me. I am a silly goose.*",
                "author": "Respawn-Delay"
            },
            {
                "raw_content": "Remember Me was an underrated game imo. Great art design and a fun combat system where you build craft your combos.",
                "author": "Fullbryte"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Core Ultra 9 285K gains 9% performance and cuts power use on Linux one year later",
        "score": 64,
        "text_content": "",
        "comments": [
            {
                "raw_content": "intel relying on microsoft for scheduler improvements really massacred the potential of heterogeneous designs. AMD learned this the hard way when they shipped Zen and microsoft just never bothered preventing unnecessary hopping between CCDs. honestly microsoft still creates problems for no reason. originally the performance mode in win11 would target P cores first for demanding background workloads like renders, but for some reason the latest releases bounces work to E cores again even with P cores not fully utilized. I didn't even realize it was happening until work was taking unusually longer to complete. I set the damn thing to performance, give me performance! Somewhat resolved using coredirector.",
                "author": "topdangle"
            },
            {
                "raw_content": "Dumb article from VideoCardz only shows the average increase. The original article shows some things doubled or more in performance while others barely changed. https://www.phoronix.com/review/core-ultra-9-285k-2025",
                "author": "innovator12"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Finally upgraded after 8 years. Vega 56 -> 9070",
        "score": 549,
        "text_content": "",
        "comments": [
            {
                "raw_content": "56CU to 56CU. Kinda crazy to see the improvements per CU like that.",
                "author": "Affectionate-Memory4"
            },
            {
                "raw_content": "I know it's unrelated, but can i ask what keyboard is that?",
                "author": "Mobian_"
            },
            {
                "raw_content": "nice I upgraded from a Vega 56 to a RX 9060 XT earlier this year :)",
                "author": "fabianbuettner"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "‘Weaker job growth and lower inflation’: It’s all lining up perfectly for a Fed cut in December | Fortune",
        "score": 180,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lower inflation my a**. Maybe in flat screen TVs but not necessities",
                "author": "BrianChange704"
            },
            {
                "raw_content": "Not happening. Half of the heads of Fed said last week that they see no reason for a cut in December.",
                "author": "hereditydrift"
            },
            {
                "raw_content": "[removed]",
                "author": "None"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage and refinance interest rates today, November 30, 2025: The 6% 30-year mortgage is back, could 5% be next?",
        "score": 37,
        "text_content": "According to the latest numbers from Zillow, the average for that popular 30-year fixed mortgage is now 6.00%. A week ago, the 30-year fixed rate averaged 6.23%. This really goes to show how fast things can change in the mortgage world. If the rate keeps inching lower, getting into the 5s could really encourage more people to jump into the market as buyers or to refinance their existing homes.",
        "comments": [
            {
                "raw_content": "I am stuck in a 6.99% fixed rate. Because of that fact alone, there is a floor on mortgage rates, the universe won’t let mortgage rates fall to a point where refinancing makes sense for me.",
                "author": "AndreLinoge55"
            },
            {
                "raw_content": "Mortgages News Daily shows 6.22%. I don’t think Zillow went from 6.23% to 6.00% in a week. I think you’re conflating MND daily from a week ago with Zillow from today. Whether you’re doing it on purpose is another question",
                "author": "realdevtest"
            },
            {
                "raw_content": "MND reports 6.22% but we will see how things changed on Monday. I trust MND more because it tracks pretty well with quotes I've gotten. Anyways 5% sounds like it's not going to happen for a while. I think the 10Y is going to be sideways for a while. Institutional investors are pricing in a volatile geopolitical and macro environment, and the treasury has to refinance an absolute fuck ton of debt next year. Unless we see the AI bubble pop or some private credit fuckery causing a contagion in a spectacular fashion, I think we'll be lucky if it dips below 5.75% in the next 12 months.",
                "author": "HinduGodOfMemes"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Zillow Removes Climate Risk Scores From Home Listings",
        "score": 94,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That’s too bad - I liked that feature. For those that haven’t used it - it basically showed the property on map layers that showed overall risk of flood, fire, air quality, in the future. It saves you from guessing if you’re in a flood zone, for example.",
                "author": "Pristine-Prior-504"
            },
            {
                "raw_content": "Someone in Florida likely sued since they're now underwater on their home. Insurance will be the ultimate arbiter of risk and will absolutely destroy Florida home values over the next decade.",
                "author": "Contemplationz"
            },
            {
                "raw_content": "OT but autotrader removed the free Carfax reports too. Also, I noticed that when I do vehicle searches and reload a page, the \"No Accidents\" filter will clear each time while leaving all the other filters in place. Feels like these websites are trying to do whatever they can to drive transactions.",
                "author": "marvology"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Perplexity permabanned me in their official sub for citing their own documentation to expose \"Deep Research\" false advertising and massive downgrade.",
        "score": 722,
        "text_content": "# I am writing this as a warning to anyone paying for Perplexity Pro expecting the advertised \"Deep Research\" capabilities. **TL;DR:** I proved, using Perplexity's own active documentation and official launch blog, that their \"Deep Research\" agent is severely throttled and not meeting its contractual specifications. The community validated my findings (my post reached **280+ upvotes**, **65 comments**, **100+ shares**, and reached the **top of the sub's front page**). Instead of addressing the issue, the moderators **permanently banned me** and removed the thread to silence the discussion. ***(EDIT: All references to the official sub, including the link to the original post, have been removed from this text and redacted in the screenshots to comply with Reddit Rules.)*** ***(EDIT 2: I have pinned the link to the original deleted thread on my user profile so you can verify the full context yourself.)*** **The Full Story:** I have been a Pro subscriber specifically for the \"Deep Research\" feature, which is sold as an \"Autonomous Agent\" that \"reads hundreds of sources\" and takes \"4-5 minutes\" to reason through complex tasks and deliver a comprehensive report. To prove that these are the official specs, I am providing both the current live links and archived snapshots from the Wayback Machine (to prove these have been the consistent standard for months and to prevent potential stealth edits). * **Official Help Center Documentation:** \\[[Current Live Link](https://www.perplexity.ai/help-center/en/articles/10738684-what-is-research-mode)\\] | \\[[Wayback Machine Snapshot (Sept 8, 2025)](https://web.archive.org/web/20250908222004/https://www.perplexity.ai/help-center/en/articles/10738684-what-is-research-mode)\\] * **Official Launch Blog:** \\[[Current Live Link](https://www.perplexity.ai/es/hub/blog/introducing-perplexity-deep-research)\\] | \\[[Wayback Machine Snapshot (Aug 2, 2025)](https://web.archive.org/web/20250802233115/https://www.perplexity.ai/es/hub/blog/introducing-perplexity-deep-research)\\] *(Note: I attempted to capture fresh snapshots of the pages today to confirm their current state, but the Wayback Machine is returning errors/incomplete rendering for the new captures. The provided snapshots from Aug/Sept are the most recent stable versions and confirm these specs have been the published standard for months.)* Recently (some months), the service degraded massively. My \"Deep Research\" queries were finishing in 30 seconds with only 10-15 sources, essentially behaving like a standard search wrapper but sold at a premium. I posted a detailed analysis on their official subreddit. I didn't attack anyone; I simply compared their **Official Help Center Documentation and Launch Blog** against the actual **Product Output**: * **Advertised Spec:** \"Reads hundreds of sources\" / \"Takes 4-5 minutes\". * **Actual Reality:** Reads \\~10 sources / Takes \\~30 seconds. The community **rallied** behind my post. **280+ upvotes**, **65 comments**, **100+ shares**, and reached the **top of the sub's front page** during the 24 hours my post was up. It became a hub for other users confirming the same throttling. It was a legitimate customer complaint backed by data. https://preview.redd.it/l4fle87woh4g1.png?width=798&format=png&auto=webp&s=a6dfb47907c82dd4948e5037c21c84147fd8a98a **Today, I received a Permanent Ban and the thread got deleted.** No warning. No explanation of which rule I broke. Just a permanent ban for the 'offense' of holding them accountable to their own written promises. https://preview.redd.it/ofy9otr0ih4g1.png?width=365&format=png&auto=webp&s=46467b16902f09beec44c239b4332fc64569f2d2 **The Takeaway:** This confirms that Perplexity is likely throttling compute on their premium features to save costs and is using censorship to hide it. If you rely on Perplexity for your workflow, be careful. They will degrade the product you rely on without warning, and the moment you provide evidence of the decline, they will silence you rather than fix it.",
        "comments": [
            {
                "raw_content": "Ironically this will end up drawing more attention given how much bigger r/Singularity is /streisanded",
                "author": "micaroma"
            },
            {
                "raw_content": "Never Never believe Perplexity. Garbage",
                "author": "Freespeechalgosax"
            },
            {
                "raw_content": "They started heavily throttling deep research shortly after Comet was released to pro subscribers, I also got my post removed in Perplexity's sub when I brought it up. Switch to Gemini, their deep research feature is significantly better, especially with the latest Gemini 3 update.",
                "author": "cartel132"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Stanford scientists just cured type 1 diabetes in mice - permanently",
        "score": 111,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Given how many cures exist for mice, at this point we’re gonna have them be immortal",
                "author": "Beeehivess"
            },
            {
                "raw_content": "User has a counter response: https://www.reddit.com/r/HotScienceNews/s/bvpzglUurw",
                "author": "NunyaBuzor"
            },
            {
                "raw_content": "They have cured hairloss in mice in 1000 different ways. None worked in humans.",
                "author": "BagholderForLyfe"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "ChatGPT is now 3 years old!",
        "score": 662,
        "text_content": "A lot has happened in the AI field over the last 3 years and I believe the next 3 years from now to Nov 30, 2028 will be even more disruptive. The simple reason is that there’s way more investment and intrigue in building AGI than ever and nobody wants to fall behind. I also believe a great majority of data centers will be fully online.",
        "comments": [
            {
                "raw_content": "Reasoning models (o1, etc.) are barely 1 year old, let that sink in!",
                "author": "kernelic"
            },
            {
                "raw_content": "I remember the very first time I saw it in action. A guy I followed on Twitter posted a screen recording in which he prompted it to build a small app. It immediately began spitting out chunks of code, very quickly. I watched, in disbelief, as the lines of code just appeared out of nowhere and formed a simple, but fully functional app. I mean, I'd already been aware of LLMs for a couple of years prior, but just seeing it like that in action, like a real programmer but automated, was mind-blowing. AI went from sci-fi to reality for me that day. I will never forget that moment.",
                "author": "wjfox2009"
            },
            {
                "raw_content": "Jesus, It feels like the past 3 years have packed in a decade of change. The next 5 years would be more mind blowing",
                "author": "Beeehivess"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "CEO of Telegram Durov annoucned Cocon - Decentralized Private AI Compute Network!",
        "score": 150,
        "text_content": "Durov (CEO of Telegram) just announced the launch of Cocoon — their decentralized network for confidential AI computations. This is the end of the era of expensive middlemen like Amazon and Microsoft: now AI queries are processed with 100% confidentiality, no tracking, and at prices below market rate. Key features: Privacy first: Your data doesn't leak — everything runs in trusted execution environments (TEE). For GPU owners: Connect your graphics cards and contribute your compute power. The first queries are already rolling in. Scaling ahead: More GPUs and developers coming in the next few weeks. Telegram users will soon get new AI features (like message translation) with full privacy. This is a step toward truly decentralized AI, putting control back in users' hands. Game-changer? [https://cocoon.org/architecture](https://cocoon.org/architecture)",
        "comments": [
            {
                "raw_content": "Ok that's great if it works and we get more gpu providers. But just to mention, there are at least three options that are very similar: vast.ai, runpod.io, and at least one other one that I don't remember the name. There might be several by now. It's definitely been an idea involving cryptocurrency for awhile.",
                "author": "ithkuil"
            },
            {
                "raw_content": "SETI@home",
                "author": "AverageBoredDad"
            },
            {
                "raw_content": "Obvious astroturfing post",
                "author": "Acrobatic_Dish6963"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Aristotle from HarmonicMath just proved Erdos Problem #124 !",
        "score": 411,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Gcd conditions removed, still great, but really hate the way people shill their stuff without any rigor to explaining the process. A lot of things become very easy when you remove a simple condition. Heck reimann hypothesis is technically solved for function fields over finite fields. But nowadays in the age of hype, a tweet post would probably say “Reimann hypothesis oneshotted by AI” even though that’s not true.",
                "author": "Junior_Direction_701"
            },
            {
                "raw_content": "[Vlad ](https://en.wikipedia.org/wiki/Vlad_Tenev)is the Robinhood CEO and founder of [Harmonic](https://harmonic.fun/). [Reuters article](https://www.reuters.com/business/robinhood-ceos-math-focused-ai-startup-harmonic-valued-145-billion-latest-2025-11-25/) 5 days ago about the funding of the company.",
                "author": "airduster_9000"
            },
            {
                "raw_content": "This is the original paper with the conjecture. You can see it's different. https://mathweb.ucsd.edu/~ronspubs/96_05_integer_powers.pdf Still awesome though, we just need true creativity now. Seems they’re already very good at Olympiad style problems",
                "author": "Junior_Direction_701"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "I've been working on/with agents since Claude 3.5 Sonnet, Opus 4.5 is amazing",
        "score": 8,
        "text_content": "Ngl this is actually intelligence. I'm head down not thinking too much my computer is doing crazy shit.",
        "comments": [
            {
                "raw_content": "Yeah man Claud cli is the shiz. I’ve been building mega projects in like a couple of weekends. I’ve been programming for more than 20 years now and I’ve never been so productive. So good.",
                "author": "smick"
            },
            {
                "raw_content": "reported for spam. i can't believe the mods are letting this crap through. anthropic is not a competitive model. it can't even prove a basic statement in math. yes, they do a bunch of copy/paste coding and applying diffs, but big deal. that sort of insipid programming is quickly becoming obsolete because of AI and is no longer enough to make a dent. it's like when 4GLs came out, everyone was wow, this is the end of programming. But what happened is coding just moved on from what you could do with 4GLs",
                "author": "kaggleqrdl"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Amazon release AI-generated english dub for Banana Fish",
        "score": 310,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I did not hit her, I did not. Oh hi Mark.",
                "author": "robertshuxley"
            },
            {
                "raw_content": "I'm not opposed to the IDEA of auto dubbing but holy shit this is hilariously bad and nowhere near ready",
                "author": "Nukemouse"
            },
            {
                "raw_content": "What's truly annoying is that anyone else with enough effort and today's tech could easily produce excellent quality. (Just look at Elevenlabs for fuck's sake) We've seen it already plenty of times, so why a billion-dollar company fails at what freelancers have done is inexcusable. It's almost like this was released this way on purpose and there's no way people who greenlit it weren't aware. Why fan anti-ai sentiment willingly makes little sense.",
                "author": "Stunning_Monk_6724"
            }
        ],
        "subreddit": "singularity"
    }
]