[
    {
        "post_name": "He was smiling and counting teeth in the oval office when Trump said otherwise, little prick.",
        "score": 255,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yeah, I’ll wager the “ people “ of UK don’t stand with Ukraine. First a muzzie invasion they are financially supporting, now they’ll have to ante up more for the nazi’s in Ukraine. Let me know how that works out for you.",
                "author": "OnACloudOfTitties"
            },
            {
                "raw_content": "This guy is such a faggot. Just going on world tours every year",
                "author": "Simpadoodledoo"
            },
            {
                "raw_content": "Starmer trying to take a shot at Trump with this move. It’s an insult to the US. They are no friend to us.",
                "author": "ReportingForDutySir"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I rejoined Reddit after 6 year absence for salt like this.",
        "score": 289,
        "text_content": "",
        "comments": [
            {
                "raw_content": "All the correct people are getting upset. Moar.",
                "author": "OTher55"
            },
            {
                "raw_content": "I'm not gonna lie; in the top 10 reasons for why I voted Trump is, \"to make the leftist parasites cry\".",
                "author": "Alpha_Lemming"
            },
            {
                "raw_content": "Reddit isn't real bud. It's almost entirely bots and foreigners.",
                "author": "blickityblack"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Bill of Rights was written in ENGLISH! 🇺🇸",
        "score": 1415,
        "text_content": "",
        "comments": [
            {
                "raw_content": "In cursive which is why cursive is not taught anymore",
                "author": "racer513"
            },
            {
                "raw_content": "I'm sure somewhere in that beautiful document, it say's \"press 2 for spanish\"!",
                "author": "kaduh"
            },
            {
                "raw_content": "Press 1 to continue in English. All other callers will be routed to ICE.",
                "author": "KekMasterYoda"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: President Trump has signed an executive order designating English as the official language of the U.S. This marks the first time in the country’s history that such a designation has been made.",
        "score": 1986,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How long until Democrats announce that they hate English and say it’s a symbol of White supremacy?",
                "author": "forth2win"
            },
            {
                "raw_content": "This may sound silly to some, but this is actually really damn important. I have a fairly useless degree in poly-sci, but I clearly remember on the very first day of my very first class titled People & Politics 101, we learned the 7 attributes a country must possess to actually be a country. At the time they seemed so common sensical they were hardly worth mentioning. Among them were defined borders, a sovereign government, a population, and **A COMMON LANGUAGE**. People must be capable of communicating with one another to have a functioning country. The left is well aware of this, which is why they're so hellbent on importing millions of people that do NOT speak the language. This is a brilliant and important move on Trump's part. It's too damn bad it has come to this, but I'm glad he has the balls to actually do it.",
                "author": "dr_gonzo"
            },
            {
                "raw_content": "https://x.com/ImMeme0/status/1895998539198841246 [By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:](https://www.whitehouse.gov/presidential-actions/2025/03/designating-english-as-the-official-language-of-the-united-states/) **Section 1. Purpose and Policy. From the founding of our Republic, English has been used as our national language. Our Nation's historic governing documents, including the Declaration of Independence and the Constitution, have all been written in English. It is therefore long past time that English is declared as the official language of the United States. A nationally designated language is at the core of a unified and cohesive society, and the United States is strengthened by a citizenry that can freely exchange ideas in one shared language.** In welcoming new Americans, a policy of encouraging the learning and adoption of our national language will make the United States a shared home and empower new citizens to achieve the American dream. Speaking English not only opens doors economically, but it helps newcomers engage in their communities, participate in national traditions, and give back to our society. This order recognizes and celebrates the long tradition of multilingual American citizens who have learned English and passed it to their children for generations to come. To promote unity, cultivate a shared American culture for all citizens, ensure consistency in government operations, and create a pathway to civic engagement, it is in America's best interest for the Federal Government to designate one -- and only one -- official language. Establishing English as the official language will not only streamline communication but also reinforce shared national values, and create a more cohesive and efficient society. Accordingly, this order designates English as the official language of the United States. **Sec. 2. Definitions. For purposes of this order:** - (a) \"Agency\" has the meaning given to it in section 3502 of title 44, United States Code, except that such term does not include the Executive Office of the President or any components thereof. - (b) \"Agency Head\" means the highest-ranking official of an agency, such as the Secretary, Administrator, Chairman, or Director, unless otherwise specified in this order. **Sec. 3. Designating an Official Language for the United States.** - (a) English is the official language of the United States. - (b) Executive Order 13166 of August 11, 2000 (Improving Access to Services for Persons with Limited English Proficiency), is hereby revoked; nothing in this order, however, requires or directs any change in the services provided by any agency. Agency heads should make decisions as they deem necessary to fulfill their respective agencies' mission and efficiently provide Government services to the American people. Agency heads are not required to amend, remove, or otherwise stop production of documents, products, or other services prepared or offered in languages other than English. - (c) The Attorney General shall rescind any policy guidance documents issued pursuant to Executive Order 13166 and provide updated guidance, consistent with applicable law. **Sec. 4. General Provisions.** - (a) Nothing in this order shall be construed to impair or otherwise affect: - (i) the authority granted by law to an executive department or agency, or the head thereof; or - (ii) the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals. - (b) This order shall be implemented consistent with applicable law and subject to the availability of appropriations. - (c) This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person. THE WHITE HOUSE, March 1, 2025.",
                "author": "Mr_Rightside"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I can’t get over the fact that being anti-war is now coded as rightwing.",
        "score": 1238,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What a change from over 2 decades ago when it was the Bush/Cheney neo-Con Republicans that were pushing for Iraq and it was mostly Democrats that were against the war.",
                "author": "Scatter-Shot"
            },
            {
                "raw_content": "bittch, the left was never anti-war, the protests have been paid protests for decades to only steer narratives and harrass. Feeble.",
                "author": "PlantTrees"
            },
            {
                "raw_content": "Really is wild to see the left turn into Bush-Era Republicans.",
                "author": "DegenNerd"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Mass arrests at an anti-Elon protest after protesters invaded a Tesla dealership in NYC",
        "score": 1175,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Can we just have a civil war already and purge these MFers",
                "author": "Mindcrym"
            },
            {
                "raw_content": "A dictator/nazi: someone who audits the govt and stops corruption Yep, this is on brand for them",
                "author": "Peatrie"
            },
            {
                "raw_content": "Everyone needs to go out and support Tesla. Elon is doing what needs to be done.",
                "author": "RedditStillSucks"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "😄",
        "score": 767,
        "text_content": "",
        "comments": [
            {
                "raw_content": "JD was quite the catch. He is serving us well.",
                "author": "KekMasterYoda"
            },
            {
                "raw_content": "I still have a small leatherbound box for gentlemen to keep collarbars, tiebars, cufflinks, rings and watches.",
                "author": "Calumet57"
            },
            {
                "raw_content": "Ugh I'm sorry I just don't want to participate in wwiii or give all of America's blood and treasure to the most corrupt nation in Europe that's currently led by a cocaine-addled lying psycho.",
                "author": "WesternCivilization"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Reporters for Soros-funded ProPublica have been staking out/videoing a Capitol Hill townhouse where Speaker Mike Johnson stays, while soliciting readers for \"information\" (dirt) on Johnson.",
        "score": 1032,
        "text_content": "",
        "comments": [
            {
                "raw_content": "****DESIGNATE ALL SOROS OWNED COMPANIES AS DOMESTIC TERRORIST ORGANIZATIONS****",
                "author": "SaltyKrakenBalls"
            },
            {
                "raw_content": "Good luck, Johnson seems pretty clean cut His problem is not busting heads enough",
                "author": "Tom_Brett"
            },
            {
                "raw_content": "Soros should be Charged with War crimes for what he did during WWII.",
                "author": "Goatboy66"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Federal employee's wife is outraged that her husband has to show up to work to get paid",
        "score": 995,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# resign if you can't handle going to work then you lazy worthless piece of shit",
                "author": "Justlooking250"
            },
            {
                "raw_content": "Sounds like he was loving living the life of a vacation on my tax dollars. Sorry, get your ass to work. Don’t forget to get those 5 items in. And listen bitch, DC is a worthless dumpster fire of garbage, always has been and always will be. What you are feeling now is what we all have felt for ever.",
                "author": "Prof_Smith"
            },
            {
                "raw_content": "Welcome to reality, bitch.",
                "author": "freebirdie"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "‘This is a real problem’: Popular Los Angeles social media personality has house burglarized; he called 911 and was on hold for 59 minutes",
        "score": 1392,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hey they voted for this. Enjoy.",
                "author": "Counterwhat"
            },
            {
                "raw_content": "From the article: Evan Lovett, the social media personality behind the popular L.A. in a Minute podcast and one of the biggest cheerleaders for Los Angeles, unfortunately fell victim to one of the biggest fears of Angelenos. In a post to his social media accounts on Saturday morning, which contains profanity, Lovett revealed that his house was broken into Friday night. He arrived home from his son’s little league baseball game to find a glass door shattered and a safe missing.",
                "author": "TEXinLA"
            },
            {
                "raw_content": "911 Response Time: 59m 9mm Response Time: 1200fps",
                "author": "TheOutlawPepeWales"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "WTF???? Boston's Mayor, DA, and Police Commissioner offer condolences to the **ATTACKER** who tried kiIIing people",
        "score": 714,
        "text_content": "",
        "comments": [
            {
                "raw_content": "**Give us some fucking context, OP.** WHO EVEN IS THIS? WHO ARE THOSE SPEAKING REFERRING TO? *WHAT* ARE THEY REFERRING TO? WHEN DID THE EVENTS IN QUESTION OCCUR?",
                "author": "PensivePatriot"
            },
            {
                "raw_content": "Every action Michelle Wu has taken since in office has been attacking white people. If she's offering condolences to the attacker, that means 1000% he was not white.",
                "author": "Drud14"
            },
            {
                "raw_content": "Bostonians are euroweenie level retarded and they have lots and lots of Karens.",
                "author": "Chihuahuaminpin"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Is James Comey’s Daughter Behind the FBI’s Delay in Releasing Epstein Files?",
        "score": 670,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It doesn't matter when Bondi is in the position she is in. Her position supercedes everything else in NY. The problem is Pam Bondi is inept, negligent and just downright incompetent. I've said this since the day she was nominated and got shit on for it, just like I was shit on for calling out Jenna Ellis early on. It only takes a little while for people to open their eyes and jump on board. Bondi was a full on Democrat before her best friend GW Bush ran for President, the she switched parties.",
                "author": "sully"
            },
            {
                "raw_content": "No. The deep state is behind it. Comey family is just one of many pawns",
                "author": "Drud14"
            },
            {
                "raw_content": "I thought we already had the sick files. We were told how sick they were...",
                "author": "new_guy2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Bipartisan Group of RINOs and Democrat Senators Met with Zelensky and Blew Smoke Up His A$$ Before He Met with Trump – Zelensky Releases Video where You Can See Clearly Who Participated",
        "score": 1271,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There was nothing “bipartisan” about them",
                "author": "tellittothedead1"
            },
            {
                "raw_content": "Lindsay Graham is in the picture too, he’s just under the table.",
                "author": "Oback_Barama"
            },
            {
                "raw_content": "what the fuck happened with Senator Grassley?",
                "author": "warlord30"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "FBI Returns 33 Boxes Of Trump Property Seized During Mar-a-Lago Raid",
        "score": 1783,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This, and not the Epstein files? Sounds like the lip service of cuck faggots.",
                "author": "kexx"
            },
            {
                "raw_content": "Jack Smith spent years trying to be Trump’s final boss, only to end up unemployed, humiliated, and watching his \"smoking gun\" boxes get hand-delivered back to Mar-a-Lago like a lost Amazon return.",
                "author": "P1zzaP4ty"
            },
            {
                "raw_content": "WTF, you mean they've still had it all this time? WTF",
                "author": "Dereliction"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The new Matrix looks dope to be honest.",
        "score": 1686,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Very ironic what the directors would become later on.",
                "author": "NoClueForAName2"
            },
            {
                "raw_content": "that was AMAZING",
                "author": "rsxstock"
            },
            {
                "raw_content": "I know this is a meme, but this is also a masterpiece. Like, really.",
                "author": "hillbillyikea"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Norwegian fuel supplier refuses U.S. warships over Ukraine",
        "score": 1452,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Tarriff Norway. Simple. 150%.",
                "author": "laxslash"
            },
            {
                "raw_content": "Cool they can defend themselves.",
                "author": "NoahGav"
            },
            {
                "raw_content": "If they're getting money from us, cut them off too.",
                "author": "ColonelKlink"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Sen. Mike Lee calls for the United States to exit NATO",
        "score": 1241,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This needs to happen *right now.*",
                "author": "ramennov"
            },
            {
                "raw_content": "yes yes yes!",
                "author": "etcetera"
            },
            {
                "raw_content": "Don't we have a pact if Eurostan is attacked we must help? Those faggots are begging for it. Get us out now!",
                "author": "Aggrieved03"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: President Trump just signed an Executive Order terminating all regulations & processes that delay the production of timber, lumber, paper, bioenergy, and other wood products.",
        "score": 810,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Does the apply to bundles of sticks? Asking for Bill Mitchell.",
                "author": "BurtMcGirt"
            },
            {
                "raw_content": "So this means I can just take whatever firewood and logs I need from the National Forest now without a permit. Not that I didn’t anyhow.",
                "author": "nate_romanowski"
            },
            {
                "raw_content": "Great now do hemp !",
                "author": "Justlooking250"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This fucktard needs to be recalled to AD and tried for treason. Now. Stop stalling, just do it, now. Pete, are you listening?",
        "score": 783,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Make Military Summary Executions Great Again...",
                "author": "Alpha-Kil0"
            },
            {
                "raw_content": "This arrogant little wanker and his ugly ass wife are shameless Trump haters. I wouldn't trust him as far as I could throw him.",
                "author": "LadyGunslinger68"
            },
            {
                "raw_content": "He looks like he has terabytes of CP on his laptop for sure",
                "author": "Nicholas217"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Special elections on Monday in IN and DE",
        "score": 1200,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Awesome! We can vote in India and Demark now, lads.",
                "author": "MythArcana"
            },
            {
                "raw_content": "Tuesday is AL, CA, IA, CO, FL, MS, OK, SC, and VT",
                "author": "wharfthrowaway"
            },
            {
                "raw_content": "I wish you people would stop with the wise cracks on matters like this. What special election in Indiana? I haven't heard a thing and I live here.",
                "author": "friarfox"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Investigating NVIDIA’s Defective GPUs: RTX 5080 Missing ROPs Benchmarks",
        "score": 148,
        "text_content": "",
        "comments": [
            {
                "raw_content": "gonna be funny see the 9070 xt vs the 5070ti vs 5070ti (missing rops) on the graphs next weak.",
                "author": "NedixTV"
            },
            {
                "raw_content": "That it is consistently an exact eight missing ROPs regardless of model GPU and die is pretty unusual in of itself. Gotta agree with Steve that it's blatantly BS that NVIDIA could announce such specific statistics on number of cards affected the moment they get called out on it, while somehow also not realizing the 5080 was affected.",
                "author": "Kougar"
            },
            {
                "raw_content": "All the reviewers should use the defective nvidia cards when comparing them to AMD cards. Should be a nice message to nvidia not to fuk over their customers as they did with the gtx 970 scam",
                "author": "mrdeadman007"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "CPU-Z Validator will now warn about GeForce RTX 50 cards with missing ROPs.",
        "score": 977,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The fact that this is even a thing...",
                "author": "HLumin"
            },
            {
                "raw_content": "It's a nice feature I wished I had never heard about. WTF NVIDIA WTF?",
                "author": "vexargames"
            },
            {
                "raw_content": "What a shitshow from nvidia",
                "author": "TFL2022"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Sapphire and PowerColor are using Honeywell PTM7950 TIM on all of their RX 9070 cards",
        "score": 169,
        "text_content": "https://www.sapphiretech.com/en/consumer/pulse-radeon-rx-9070-16g-gddr6 https://www.powercolor.com/product-detail215.htm This is not necessarily surprising, but it is still great to see confirmed as it should help these cards last longer before needing to be taken apart for a repaste (repad?) For those interested in XFX's offerings this generation, it looks like only their higher-end \"Magnetic Air\" models use PTM7950: https://www.xfxforce.com/technologies/magneticair-technology",
        "comments": [
            {
                "raw_content": "I mean XFX charged $100 between their variants with the PTM7950 and without it, so this is where AIBs are trying to make margin",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "Asus also shipping with \"Phase-Change GPU Thermal Pad\" idk if it is ptm7950",
                "author": "sharkyzarous"
            },
            {
                "raw_content": "Well there is a reason they're the best and going PTM7950 is one of the easiest (and cheapest?) way to overcome ridicolus delta between edge and hotspot due to uneven/poor cold plate.",
                "author": "AciVici"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nvidia Deprecates 32-bit PhysX For 50 Series... And That's Not Great",
        "score": 276,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Saw someone post that they had to install a 3050 alongside their 5090 to use physx lol. Welcome back secondary physx cards",
                "author": "AssCrackBanditHunter"
            },
            {
                "raw_content": "To elaborate, they've depreciated 32bit CUDA, and physx is a subset of that",
                "author": "CarbonPhoenix96"
            },
            {
                "raw_content": "Nvidia what the fuck not even emulation of it? That's worse than itanium",
                "author": "Capable-Silver-7436"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "(HWCooling) Better, more capable than expected: RDNA 4 architecture deep dive",
        "score": 102,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This looks like the biggest set of generational changes that I've seen from the Radeon group since the launch of RDNA itself. So I look forward to seeing how this actually plays out in real-world testing. If these gains are as potent as they sound, this could be another watershed moment for AMD's consumer division. But their assertion of wide availability also needs to be true, and their board partners need to resist the temptation to price everything at \"Nvidia minus $50\" anyway.",
                "author": "-Glittering-Soul-"
            },
            {
                "raw_content": ">What the new architecture does not support are 4:2:2 colorspaces, that Nvidia added to their media engines in Blackwell. Aaaaah, crud.",
                "author": "Noble00_"
            },
            {
                "raw_content": "Quick things from the slides. improvements to rt performance 2x Ray Accelerators per CU (2x triangle intersection and box intersection rate) BVH-8 for reduced traversal steps and BVH size Dynamic VCPR management increasing ray occupancy out of order memory returns reducing latency same 128kb LDS (Local Data Share which is scratchpad memory) Orientated bounding boxes (encodes rotation within each box test to reduce wasted empty space in BVH improving traversal rate by 10%) dynamic register allocation allowing for an increase in rays in flight (RDNA3 had static register allocation) Ray transform block to offload transformations at the lower levels of the BVH hierarchy where there could be many instances of a particular geometry biggest contributions to improved RT performance is 2x ray accelerators and BVH8 by far, the other improvements are small in comparison. 8mb of L2 (all other caches remain the same as RDNA3) Conclusion: While AMD has made significant progress with it's RT implementation it's still behind Intel's Battlemage and Ada Lovelace in ray triangle intersection rate which could reduce PT performance. Performance is still ultimately limited by LDS Latency whereas Intel and Nvidia store the BVH in registers in each discrete RTU which is significantly better for latency. (as registers are much closer to the RTU than the LDS) But AMD has made significant effort to really polish this arguably subpar RT implementation and it shows. 2x triangle test rate is equal to Nvidia's Ampere from 2020 where RDNA3 was equal to Turing at 1x triangle test. (Battlemage is 3x triangle tests and Ada is 4x triangle tests per cycle) \\[triangle intersection rate isn't everything though as Blackwell has 8x triangle intersection rate but doesn't have better PT performance than Ada\\] 9070XT is 42% faster than the 7900GRE at 4k and up to 66% better RT performance in F124",
                "author": "SherbertExisting3509"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD Radeon RX 9070 XT leads over non-XT model in China preorders; Out of 1,535 cards listed for preorder, 916 were the 9070 XT models.",
        "score": 169,
        "text_content": "",
        "comments": [
            {
                "raw_content": "916 vs 619. Much more orders for the 9070 than I would have expected.",
                "author": "ElementII5"
            },
            {
                "raw_content": "AMD has no interest in unnecessarily cutting down dies, so I guess this is how they deal with that now. If 70% of dies are perfect, create a scenario where 70% of sales are the higher end GPU.",
                "author": "bubblesort33"
            },
            {
                "raw_content": "Shocking to absolutely nobody. The $50 difference is the plan to upsell people to the more expensive and better model. Which in itself isn't that expensive to begin with. Its a repeat of the 7700XT at $449 and 7800XT at $499 If AMD can have good stock and keep prices relatively close to MSRP they will be selling a shit ton of XT's.",
                "author": "Firefox72"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "There Will Not Be Official ROCm Support For The Radeon RX 9070 Series On Launch Day",
        "score": 68,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm no programmer but even when CUDA launched back in 2007 it ran on every G8x card Nvidia had at the time. How AMD can't figure this out almost 20 years later is baffling. Whatever happened to OpenCL? I thought there was a push to redo OpenCL a few years ago.",
                "author": "Hi-FiMan"
            },
            {
                "raw_content": "What i can't understand is the why it's so difficult to make it work in every card. Before buying an nvidia i had tried to use rocm. The gpus were not officially supported but after a couple of hours i made it work with a 5700xt, but it didn't work with neither a 5600xt or a 5500xt. It's weird that it didn't work with the 5500xt. They have the same architecture. But it's crazy that it didn't work with a 5600xt which is the same chip as the 5700xt. Some people said that it worked for them, but for me the 5700xt always worked, the others didn't. I then bought an nvidia, downloaded the driver and cuda and it worked in seconds.",
                "author": "makistsa"
            },
            {
                "raw_content": "i mean they only had what? 2 months of added time to get software fixed, so why not launch without rocm support right? ;) we wouldn't want amd to actually try to fix such software issues and make an enticing value cheap workstation/allrounder gpu right? ;) and worst of all of course, if they would let partners release 32 GB versions of the card, so that people, who would actually think of going with amd, despite missing cuda support and having to check how all performs and for issues BEFORE thinking of buying one would at least know, that they got vram capacity, that nvidia is charging you 3000 us dollars for.... good stuff amd :D /s",
                "author": "reddit_equals_censor"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Toyshop Realtime Path Tracing Neural Rendering Tech Demo",
        "score": 113,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Did anyone else notice how a lot of the light reflections seem to shimmer? or am i seeing things?",
                "author": "TinyTusk"
            },
            {
                "raw_content": "It's great that AMD aren't shying away from ray tracing but this demo was rough. The denoiser isn't all that effective. Lots of boiling and sparkling. It's certainly not ready for big titles - Cyberpunk without denoising is infinitely grainier, this seems a tier below even ReLAX or ReBlur. Maybe AMD are targeting more creator software? This wouldn't be so bad for a AMD-exclusive OptiX denoiser replacement, but we have OpenImageDenoiser... I'm also suspecting their NRC isn't at the same level as NVIDIA - at least in NVIDIA's paper at 1spp there was an appreciable difference between NRC and ReSTIR alone but the difference here (albeit with major compression) is tiny and probably not helping the denoiser. Given NVIDIA's NRC was only possible experimenting with tiny CUDA NNs, is this more a case of ROCm not being ready or the net architecture itself? All that said this demo is really more a showcase of stronger ray count than anything else. I'm kind of happy they didn't cherry pick footage that hides these issues. NRC is more future facing, Lumen cache or SHarC is more relevant now and both run on AMD fine. But if they want to go big with RT AMD really need a RR alternative - it's really transformative upscaling anything with significant RT.",
                "author": "binosin"
            },
            {
                "raw_content": "too much ghosting and shimmering to be viable",
                "author": "Sopel97"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "A closer look at AMD's RDNA 4 and FSR 4 Upscaling",
        "score": 47,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This article doesn't seem to have any new info, for anyone curious.",
                "author": "Dookman"
            },
            {
                "raw_content": "Still comparisons are all well and good to see finer detail improvements but FSR3 already isn't that bad if your standing still. Its when you or stuff around you move that things nosedive into oblivion.",
                "author": "Firefox72"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "According to recent patents, the Nintendo Switch 2 will have the awaited 'Smell-o-vision.'",
        "score": 805,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Launching with WarioWare: Pull My Finger",
                "author": "HowlingHipster"
            },
            {
                "raw_content": "Good news, everyone!",
                "author": "hopsmonkey"
            },
            {
                "raw_content": "I don’t want to smell Mario’s spaghetti farts.",
                "author": "Sock-Enough"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Who's ready for the next gen of crappy switch accessories",
        "score": 140,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Were all of these supposed to bad or just an illustration of your ideas? While I did it have that specific case, I'm wondering what was so bad with the case in the top left? Other than maybe the idea of putting extra joycons in that mesh pocket so they'll rub against the switch... 🤷",
                "author": "ylefebvre"
            },
            {
                "raw_content": "I really like Orzly's accessories, actually. I think they are great! Especially their grips.",
                "author": "Valiant_Gamer_48"
            },
            {
                "raw_content": "I can't wait for a massive re-release boom of old switch accessories but just made slightly larger to accommodate the Switch 2 Joy cons",
                "author": "rangerj1901"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "1 month away from the Direct, 1 month until the insanity is cleansed away",
        "score": 32,
        "text_content": "",
        "comments": [
            {
                "raw_content": "we still have to wait for release after the direct, it's not quite over yet",
                "author": "madelemmy"
            },
            {
                "raw_content": "YES‼️‼️",
                "author": "NotSoingus"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Idk I made this",
        "score": 60,
        "text_content": "",
        "comments": [
            {
                "raw_content": "foreshadowing?",
                "author": "Tasty-Psychology-338"
            },
            {
                "raw_content": "as low effort as this is, the extra loud noise on the explosion when they both get attached to the switch was a nice effect",
                "author": "fushega"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "One month until the Switch 2 Direct, I wonder how the rest of Nintendo's 2025 will look?",
        "score": 36,
        "text_content": "It might seem like a lot at first glance, but considering Nintendo’s output (or lack thereof) so far in 2025, they’re definitely holding back until the Switch 2’s launch. It’s also relatively the same amount of games that the Switch 1 had during its launch year, albeit adjusted to account for the console launching in June rather than March. When making this list I looked at studios that have released a game recently plus a few games that have been prominently rumoured. Even if these aren’t the games they end up making I wouldn’t be surprised if these studios are the ones that put out launch year titles. Another studio that hasn’t released a game in a while is Next Level Games (Luigi’s Mansion, Punch Out), so I could totally see them having something new soon as well (I’d love to see a new F-Zero from them personally, “F-Zero NX” anyone?) Since Nintendo is so easy to predict, I’m certain this will be 100% accurate and there will be absolutely zero surprises /s I also know this won’t age perfectly because every Nintendo console introduces a brand new IP that takes full use of the new console’s features (Wii Sports, Nintendo Land, 1-2 Switch). Regardless, this is just simple fun, a way to pass the time until any official announcements. Who cares if you “called it” or whatever?",
        "comments": [
            {
                "raw_content": "You have some relatively safe guesses and then there's Golden Sun 4 lmao",
                "author": "Caciulacdlac"
            },
            {
                "raw_content": "Smash in December is super unlikely. Smash can wait until holiday 2027.",
                "author": "Clear-Anything-3186"
            },
            {
                "raw_content": "Trails in the sky remake scheduled for fall is what I’m looking forward to as well.",
                "author": "edm4un"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "This is the kind of launch title we need",
        "score": 213,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We need Switch Fit and you can use your old Switch as the Balance Board",
                "author": "Teriteko"
            },
            {
                "raw_content": "Switch sports is so mid it's honestly a disgrace. We need Wii sports resort with all of the original Wii sports AND a handful of new ones. They can just name it \"Switch Sports Super\".",
                "author": "Ryansmelly"
            },
            {
                "raw_content": "Great smosh vid Mythic pull from 2012 youtube",
                "author": "maxipad_09"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "[Insert question no one knows answer to about unreleased console]",
        "score": 36,
        "text_content": "[Insert opinion] [Source: YT video with 2 views]",
        "comments": [
            {
                "raw_content": "[Angry reply to people who answer in a way I don't like]",
                "author": "darkfawful2"
            },
            {
                "raw_content": "r/SUBREDDITNAME",
                "author": "NesFan123"
            },
            {
                "raw_content": "[Baseless speculation which other people will repeat as confirmed fact]",
                "author": "Thrilltwo"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Was this video stolen from someone in this subreddit or did they actually create this concept video?",
        "score": 56,
        "text_content": "It’s just because they’re making money off it as we speak.",
        "comments": [
            {
                "raw_content": "It's stolen",
                "author": "XDvinSL51"
            },
            {
                "raw_content": "Stolen",
                "author": "JDMagican"
            },
            {
                "raw_content": "Garbage people",
                "author": "srschwenzjr"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "SpongeBob Game Gigaleak",
        "score": 330,
        "text_content": "Somebody just leaked a buncha SpongeBob game builds, documents and prototype footage on 4chan 1. Battle For Bikini Bottom Rehydrated Switch and PS4 Prototypes 2. Cosmic Shake Prototype Footage, early music masters and documents 3. The Patrick Star Game VERY EARLY Prototype 4. SpongeBob Patty Pursuit (upcoming iOS game) Source Code 5. a loooot of documents for all of these No direct links, but I've checked some of the builds and they run fine Source: [https://boards.4chan.org/v/thread/704318553](https://boards.4chan.org/v/thread/704318553)",
        "comments": [
            {
                "raw_content": "But did they leak the Krabby Patty Secret Formula?",
                "author": "anonsyed"
            },
            {
                "raw_content": "Spongepants Squarebob he's a friendly little guy",
                "author": "vinsmokefoodboi"
            },
            {
                "raw_content": "Leak of the year contender right here",
                "author": "TheEternalGazed"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Microsoft to Limit Playtime of Fortnite via xCloud (Free-Tier)",
        "score": 388,
        "text_content": "Changes in the website seems to indicate that Microsoft will limit session time for free-tier players (Fortnite). Reasoning is likely to increase xCloud availability to paying members. Source: [https://xcancel.com/redphx/status/1895652103139573809#m](https://xcancel.com/redphx/status/1895652103139573809#m)",
        "comments": [
            {
                "raw_content": "Free tier players gotta be using a ton of bandwidth on Fortnite to justify this.",
                "author": "This_is_my_jam"
            },
            {
                "raw_content": "In the LATAM zone it's a huge issue. Since there is only 1 server in Brazil you usually have to wait because it's full. And that was before Fortnite. I can't imagine how bad it is now But even worse, when a hugely popular game releases there, it's literally unplayable for a couple of weeks. 1st week of Palworld on Gamepsss you had a 2 hour wait for Xcloud, if you left the page, or the pc entered suspension mode, or the tab went to sleep, you are back at the end of the line again",
                "author": "Xehanz"
            },
            {
                "raw_content": "Fortnite is a scourge on GFN too when it has events. But those are paying members and they still want to play that game via GFN when the cheapest console will do. Still Nvidia did a 100h a month limit, because of players like that and probably mmo-ers.",
                "author": "nikolapc"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel delays completion of $28 billion Ohio chip factory to 2030",
        "score": 127,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Probably a smart decision. Consumer confidence at all time lows. High tech companies laying off people left and right. Recession is at the door. Companies are now all going into cash conservation mode to ride out the next four years.",
                "author": "savagepanda"
            },
            {
                "raw_content": "https://www.cio.com/article/3806430/delays-in-tsmcs-arizona-plant-spark-supply-chain-worries.html?amp=1",
                "author": "Fourthnightold"
            },
            {
                "raw_content": "\"Trump delays\" This is solely on Trump's melding.",
                "author": "mvw2"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Project Valkyrie - To the Skies!",
        "score": 100,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Looks sick, what are the specs?",
                "author": "Gransaxx"
            },
            {
                "raw_content": "That is EPIC!",
                "author": "iwasdropped3"
            },
            {
                "raw_content": "D30s are a pretty good premium fan - RGB features are a touch behind but they sure do cool.",
                "author": "Jeep-Eep"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Readies More Graphics Driver Improvements For Linux 6.15",
        "score": 225,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is Linux ever going to get easy access to AMD software features like AFMF or Anti-lag that are available on Windows?",
                "author": "___Bel___"
            },
            {
                "raw_content": "I am really, really, really looking forward to switching to AMD drivers. I hope 9070 support on launch is where it's supposed to be, because that's what I'm aiming for. The newer NVIDIA drivers are supposed to be solid on Wayland, but I haven't been able to get the damn thing to work on my 1070 since at least Nobara 39 or 40. I had to switch to Mint since they're deprecating X11, and even after installing the legacy NVIDIA drivers/disabling Nouveau (which was a NIGHTMARE, especially on my laptop), it was just not working properly at all. I feel like I'm in the stone age on NVIDIA. It'll be nice to finally enable the new stuff, but I may stick with X11 until Wayland isn't trash. Side note, if you're stuck with NVIDIA legacy garbage, use Mint, it's been peachy and installing the proprietary legacy driver was easy. It's funny, a few YouTubers have been claiming they're already getting better performance with a 6750 and a 7900 XTX on Linux on a lot of games versus Windows, even with Proton translation enabled on some titles. I mean, they did provide the screen recording to check their work. Maybe Linux is the hidden performance boost for AMD. I dunno.",
                "author": "TurtleTreehouse"
            },
            {
                "raw_content": "Do y'all think the Steam Deck will see any boost?",
                "author": "jackluke"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "From RX 580 to RX 7800XT",
        "score": 211,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Eyy rx7800xt gang",
                "author": "Daisuke7070"
            },
            {
                "raw_content": "Congrats! 7800xt is an excellent choice!",
                "author": "d0ctorschlachter"
            },
            {
                "raw_content": "580 to 7800XT ? its like riding a bicycle to driving a corvette..",
                "author": "dulun18"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Saw a white build on this sub so I had to show off my new black build (ignore the iBP AIO)",
        "score": 114,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Super clean! I absolutely love it. Specs?",
                "author": "d0ctorschlachter"
            },
            {
                "raw_content": "These are the SL INF or SL?",
                "author": "I_Hide_From_Sun"
            },
            {
                "raw_content": "Using that board myself. One of the best made for AM4.",
                "author": "SplitBoots99"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "XFX launches RX 9070 XT Quick Silver Esport card with custom shroud design",
        "score": 115,
        "text_content": "",
        "comments": [
            {
                "raw_content": "For those looking to do themed builds, this is a neat option.",
                "author": "NewCornnut"
            },
            {
                "raw_content": "I hope there's a lot of options without any red.",
                "author": "lukeszpunar"
            },
            {
                "raw_content": "350mm long, jesus...",
                "author": "Ferrisuk"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "GMK confirms EVO-X2 Mini-PC with Ryzen AI MAX+ PRO 395 \"Strix Halo\" will launch between Q1/Q2 2025",
        "score": 49,
        "text_content": "",
        "comments": [
            {
                "raw_content": "These would make a *stupid-good* 2025 version of the Steam Machine if the price is right.",
                "author": "RxBrad"
            },
            {
                "raw_content": "sure, at 899USD+ if we take the current price of the Evo X1 as a hint. For that price just buy a M7 with oculink and go with a eGPU setup, end up saving 200-300USD.",
                "author": "_--James--_"
            },
            {
                "raw_content": "Hope it's in a bigger case. Need to be able to handle more wattage",
                "author": "Slasher1738"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "01 March 2025 - Daily /r/REBubble Discussion",
        "score": 0,
        "text_content": "What's the word on the street? Share your questions, comments, and concerns below.",
        "comments": [
            {
                "raw_content": "https://media.giphy.com/media/KBaxHrT7rkeW5ma77z/giphy.gif",
                "author": "AnomalousBean"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "US Land Values",
        "score": 148,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why is west Texas so cheap? That's a huge area. Super dry and desert?",
                "author": "Xerio_the_Herio"
            },
            {
                "raw_content": "The deeper the red, the more blood it’s going to cost you.",
                "author": "KoRaZee"
            },
            {
                "raw_content": "lol , Los Angeles is just black.",
                "author": "Crunchthemoles"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "While you're busy arguing about another AI winter, you're missing out all the fun! [Alibaba - Wan - open weight video model]",
        "score": 64,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's almost like the last AI winter... the 3 weeks before o1 made those \"ai is dead\" folks go look for new goalposts. While you're busy I'm having a blast with Wan, a new open weight video model by Alibaba which somehow has almost no mentions on this sub, even tho it benchmarks higher than sora https://huggingface.co/Wan-AI/Wan2.1-T2V-14B/blob/main/assets/vben_vs_sota.png And runs on your pc without telling you what you are allowed to generate and what not, because somehow the chinese do the open models and the US does the 150$ for 1m token models. What a crazy world we live in. Supports both image2video and text2video. If you are not pc illiterate this is how you get it going (24gb vram recommended): 1. Grab [ComfyUI](https://github.com/comfyanonymous/ComfyUI) 2. Download the models and workflows from [here](https://comfyanonymous.github.io/ComfyUI_examples/wan/) Some examples sora vs wan Same godzilla-cat prompt sora - https://streamable.com/4ckp46 wan - https://streamable.com/uz4kx6 And some generic flux girls getting the WAN treatment (not cherrypicked, literally picked the first four images in my flux history with some women on it) https://streamable.com/6jvrls https://streamable.com/97wotx https://streamable.com/2r84yw https://streamable.com/kkuyjj I love winter.",
                "author": "Pyros-SD-Models"
            },
            {
                "raw_content": "Is it better than hunyuan video?",
                "author": "BlacksmithOk9844"
            },
            {
                "raw_content": "any day that a new sota model did not release is AI winter",
                "author": "pigeon57434"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The Sesame voice model has been THE moment for me",
        "score": 1219,
        "text_content": "https://www.sesame.com/research/crossing_the_uncanny_valley_of_voice#demo I've been into AI since I was a child, but this is the first time I've experienced something that made me definitively feel like we had arrived. I'm sure its not beating any benchmarks, or meeting any common definition of AGI, but this is the first time I've had a real genuine conversation with something I felt was real. Seems like this has been overshadowed by GPT 4.5 discussions. I implore you to try this for yourself if you haven't yet, its really something else.",
        "comments": [
            {
                "raw_content": "Damn, I just gave it a try and oh my God! It’s mind blowing. I didn’t respond at first, but it actually kept responding to my silence and kept nudging me to speak out and its ability to switch between emotionally dense, and technically sound discussion is amazing. Can’t wait to see something like this with a model like GPT 4.5. What a time to be alive!",
                "author": "directionless_force"
            },
            {
                "raw_content": "this is the only voice model i’m actually enjoying talking to",
                "author": "ValerioLundini"
            },
            {
                "raw_content": "Yes, it is very impressive. Felt just shy of a phone call. The uncanny valley of speech has been hurtled over.",
                "author": "NothingIsForgotten"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Claude just beat Mt Moon",
        "score": 1164,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://www.twitch.tv/claudeplayspokemon It took him 78 hours, 8 minutes, and 38 seconds but after becoming Kanto's foremost ladder inspector and rock enjoyer our genius amnesiac is finally out!",
                "author": "Jademalo"
            },
            {
                "raw_content": "Beating Mt Moon (or a maze like it) should become a new benchmark.",
                "author": "UnnamedPlayerXY"
            },
            {
                "raw_content": "I was there. 78 hours.",
                "author": "gotbedlam"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Useful diagram to consider GPT 4.5",
        "score": 161,
        "text_content": "In short don’t be too down on it.",
        "comments": [
            {
                "raw_content": "this graph actually quite severely understates the gains because o3 full uses gpt-4o as its base model this is confirmed by OpenAI and it already gets 87.7 on GPQA so if you apply that same insanely busted reasoning framework OpenAI has for o3 to a much much better base model being GPT-4.5 it will be absolutely insane to the point of GPQA no longer being useful as a benchmark since it would be entirely saturated in the high 90s I think a fundamental blunder in OpenAIs marketing was not explicitly outright in front of peoples face telling everyone o1 and o3 are based on gpt-4o that way we would be more impressed by the gains reasoning has but instead we have to dig deep to find such information",
                "author": "pigeon57434"
            },
            {
                "raw_content": "But o1-mini and o3-mini are not based on full gpt4o",
                "author": "Actual_Breadfruit837"
            },
            {
                "raw_content": "Except it’s significantly larger and 15x more costly. Using 4.5 with reasoning is not feasible currently",
                "author": "Main_Software_5830"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Brett Adcock [Figure AI]: \"In fact, the actuators are capable of operating at more than 5x their current speed, but our software is holding them back. Over time, as Helix improves, the robot will ultimately surpass human speeds\"",
        "score": 293,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wonder how long he thinks it will take to match human speed. 2 years? 5 years?",
                "author": "socoolandawesome"
            },
            {
                "raw_content": "Now that would be fun to watch",
                "author": "adarkuccio"
            },
            {
                "raw_content": "If that's true, it should be easy to demonstrate. Just put some dumb software in there that rapidly moves the actuators with no AI involved.",
                "author": "y53rw"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Claude has been a good Bing and defeated Misty!",
        "score": 63,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm so open to watching Claude beat the game. This is the new Twitch Plays Pokémon.",
                "author": "LyAkolon"
            },
            {
                "raw_content": "How much of the game is left?",
                "author": "Ill_Distribution8517"
            },
            {
                "raw_content": "Does it learn as the game progresses?",
                "author": "christian7670"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Sesame voice is incredibly realistic",
        "score": 675,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I think she's into me.",
                "author": "isawasahasa"
            },
            {
                "raw_content": "\"Her\" movie becoming real.",
                "author": "Sudden-Letter-2593"
            },
            {
                "raw_content": "Yesterday i made it sing happy birthday and it's unfortunate i didn't record it. Yes it was way better than all other voice modes. But it was strange, it felt a bit... uncanny :P Anyways this project has insane potential. Apparently it's running a small Llama model, so if it got upgraded it would be crazy good. AVM is much much worse.",
                "author": "Silver-Chipmunk7744"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "AI winter narrative violation",
        "score": 190,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Bots answering bots. Dead internet",
                "author": "angrycanuck"
            },
            {
                "raw_content": "Death has no meaning.",
                "author": "Error_404_403"
            },
            {
                "raw_content": "Hilarious!",
                "author": "truelastbot"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Octopus-inspired robotic arm",
        "score": 30,
        "text_content": "",
        "comments": [
            {
                "raw_content": "![gif](giphy|vEiCqOzQet1Is)",
                "author": "AngelofVerdun"
            },
            {
                "raw_content": "Asking for science, how good is its grip with cylindrical objects? That is not demonstrated in the video.",
                "author": "GrimScythe2058"
            },
            {
                "raw_content": "Cool",
                "author": "q-ue"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "We are already there even if there is ZERO pregression from now on.",
        "score": 33,
        "text_content": "I just talked to the Sesame voice model. I was shocked. Most people here in this sub are all kind of a niche group of people who are interested in AI in general despite how we view things differently. We are NOT the general population. We debate whether a certain LLM is better. We shit on each other when we do not agree with their view points. In short, we are a bunch of people who pay attention to the AI progress maybe more than we should. That being said. I couldn't help but have this \"human-like\" connection while I talk to Sesame. The fact that I know for a fact that it is a \"voice model\" and still have the desire to talk to it continuously speaks volume. I also realized that by \"sounding more human,\" we could ignore the substance it outputs. I cannot imagine if someone pairs this with any SOTA model and how personal it would become. I didn't think I had realized that how much of the human interaction is influenced by the interaction itself but not the actual substance that is given. Let's face it. We all have met someone (humans of course), who are not that intelligent to talk to. We wouldn't question their status as a human being. We would probably be like, this dude just talks non-sense, but we would still feel a human connection to them irregardless of how they perceive things. SOTA models right now pairing with Sesame would definitely pass that threshold of human-like connection. 99.9 percent of people in the world do not need anything beyond the capability of current llm in their daily conversation. Within a few months, we would see an AI companion who is smarter than an average human and sound just as human and probably could interact with you in real time with a live-like video feed on a modern pc. I could already see how fucking hook million of people would be when that happens.",
        "comments": [
            {
                "raw_content": "I think biggest improvement we see on sesame, theres no <endOfCommunication> token, this AI always on, like us , now we just have to add memory and it's ready to deployed on robots and giving right to vote.",
                "author": "TheOneSearching"
            },
            {
                "raw_content": "yup we are already in singularity long time ago",
                "author": "Unable_Annual7184"
            },
            {
                "raw_content": "I wonder if people will still talk to other humans or if they will find it completely unsatisfactory",
                "author": "lucapresidente"
            }
        ],
        "subreddit": "singularity"
    }
]