[
    {
        "post_name": "Adam Schiff may be in serious trouble in a case that should be easy to prove. The man who was one of the Russia Hoax’s biggest shills now stands accused of serious fraud and constitutional wrongdoing.",
        "score": 550,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I keep seeing these pinned Adam Shitstick posts…and yet nothing happens. Can you refrain from stickying utter nonsense until that bug eyed faggot is in handcuffs?",
                "author": "Pener_Parker"
            },
            {
                "raw_content": "Did he throw a Dildo though?",
                "author": "EdBuck"
            },
            {
                "raw_content": "If he, Letitia, Brennan, Wray, Comey don't go to prison, there is no justice in america If I were Trump I would not allow plea bargains. We already have it all. There is no new information we can get from them that will safve them.",
                "author": "5DchessWatch"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "IT’S MIDNIGHT!!! BILLIONS OF DOLLARS IN TARIFFS ARE NOW FLOWING INTO THE UNITED STATES OF AMERICA!",
        "score": 356,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yay! Can we end income tax yet? Lol sorry for the concern troll post. I really am a supporter. Grocery prices need to come down though that would be nice. Thank you for your attention to this matter!",
                "author": "Songofsixpence"
            },
            {
                "raw_content": "Can I get a few of those? Kinda tired of 12 hour days",
                "author": "BlockWorks"
            },
            {
                "raw_content": "I like to think the madman didn’t schedule that truth, but stayed up to hit send",
                "author": "MAGATHREAD"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Texas joins EBT/SNAP junk food ban wagon.",
        "score": 304,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If you're eating off someone else's money, you don't get a say in what they choose to give you.",
                "author": "Kaarous"
            },
            {
                "raw_content": "ban wagon i like it.",
                "author": "SHILL_DETECTOR"
            },
            {
                "raw_content": "Now take away their ability to by premium cuts of meat and chicken. Limit it to basic ingredients to sustain them temporarily. I’ve seen jigs with filet mignon and lobster tails and racks of ribs using govt handouts, fuck that.",
                "author": "BoomShtick"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Obama Gave the Game Away in 2016 NPR Interview",
        "score": 254,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The most evil clown the world has ever seen. The problem really is, that Obama is just a puppet originally placed in office by the Chicago system, but now controlled by a more extensive network of globalists.",
                "author": "Necrovoter"
            },
            {
                "raw_content": "I remember the run up to the election. The first talking point the media had about Trump and Russia was that Trump was a businessman, not a politician, and that he would be out of his depth in dealing with Russia. They mocked him and said he had no real political connections, and wouldn't know how to operate as a politician. Then suddenly, they created a whole narrative to say the opposite. The media flipped their script and said whatever Obama and Hillary wanted them to say. Show no mercy. Smash the Democrat party and send the bad actors to prison, or put them to death.",
                "author": "Wallllllllllllllllll"
            },
            {
                "raw_content": "Fag will look better in an orange jumpsuit",
                "author": "awsure"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "LET'S GOOOOOOOO!",
        "score": 1154,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They need to do a census NOW (and only of citizens) and correct the errors of the 2020 census that likely cost the republicans a dozen seats in the house.",
                "author": "Light_HIV_Effect"
            },
            {
                "raw_content": "Could they also move back to winner-take-all for it's electoral votes?",
                "author": "duckduck"
            },
            {
                "raw_content": "Just no end to the cheating and rigging Democrats set up. Please do it Nebraska!!",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "More people have been arrested for throwing dildos at WNBA games than trying to overthrow the duly elected President of the United States.",
        "score": 765,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We are not a serious country.",
                "author": "GallowsTime"
            },
            {
                "raw_content": "Dildo dash is the only thing that made the wNBA watchable.",
                "author": "QSWO1"
            },
            {
                "raw_content": "Have they been officially charged, and convicted yet? Will they face anything more then few hours of community service?",
                "author": "Jackhererer"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "It’s starting! American is trying to use her EBT Food Stamps, and is outraged as the Walmart worker confirms that the majority of her items are no longer covered by Food Stamps Her sugary juice, snacks, Reese’s candy, muffins and more are no longer eligible",
        "score": 1089,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How about you sell that fuckin' gold chain and spend it on shit you want rather than expecting everyone else to pay for it.",
                "author": "Build_Back_Bankrupt"
            },
            {
                "raw_content": "Any bets those Carnival Cruises will suddenly become more civil?",
                "author": "Tikk"
            },
            {
                "raw_content": "Right at the end she said if they don’t take all this stuff then “what’s the point of having it”. WOW.",
                "author": "Marianasoctober"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The two most powerful men in the world are once again aligned and there is a gang of poor young street thugs in DC who are about to find out what it means when THE JIG IS UP!",
        "score": 929,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This isn't a D.C. problem, it's a national problem. They do have the extra burden of a 46% black population there, but every major city is like this now.",
                "author": "MythArcana"
            },
            {
                "raw_content": "They could use AI and Palantir tech to solve street crime. Most of the crime in any area is caused by a limited number of people committing a lot of crimes. Identify and neutralize that small number and overall crime will drop by a lot. If we’re going to have Orwellian surveillance tech we might as well use it for good.",
                "author": "Kimball_Kinnison"
            },
            {
                "raw_content": "We need to start killing violent offenders. Publicly.",
                "author": "FiresideRant"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "KENTUCKY could also jump into the 2026 redistricting war by drawing out the single Democrat district located in the north-central part of the state. It's deep red. Supermajorities in each chamber of the legislature.",
        "score": 656,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is like most states. Solidly red but for the one big city that got taken over by the Ds and now they are stuffed to overflowing with the shithole tide that was just brought over. If you look at state demographics 90%+ of any minority class will be bottled up in that city with the rest of the state solidly white and R. Even in shithole california once you cross over from the LA county line it goes right back to solidly white and R. The only reason cali is 'blue' is due to the tens of millions of illegals they stuffed into the cities over the decades to game the census and steal state and national seats of power.",
                "author": "SquiggyMcPepe"
            },
            {
                "raw_content": "Needs a MAGA Gov.",
                "author": "TEXinLA"
            },
            {
                "raw_content": "Do it. Also KY stop voting for McConnells.",
                "author": "FuckReddit4545"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "WOW! US Attorney for DC Jeanine Pirro goes on a rampage against the DC Council for tying her hands - she CAN'T jail many \"youth\" criminals because of current law. She's fuming.",
        "score": 1054,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Go after the fucking PARENTS!",
                "author": "MrMcGreenGenes"
            },
            {
                "raw_content": "The genius of putting Judge Pirro in this position is her media savvy. This is not a fight that can be won in the courts -- this is a fight that needs to be waged on the airwaves. And he's got someone used to being on Fox News every night ready to go.",
                "author": "thepalagoon"
            },
            {
                "raw_content": "“Youths” = future felons, a product of sheboonery and no father",
                "author": "MedicallyReddit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: \"No bag policy\" has been implemented for tonight's WNBA game in an attempt to crack down on dildo throwers.",
        "score": 1443,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What a great time to be alive.",
                "author": "KuzoKevin"
            },
            {
                "raw_content": "HAHA I just had this conversation at work with a co worker. Women dont need a bag to hide that!",
                "author": "Duce30"
            },
            {
                "raw_content": "The guys throwing them will just come them jammed up their ass, not sure how this policy will help anything.",
                "author": "Trump_is_GEOTUS"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Homeland Security :We’re taking father/son bonding to a whole new level.",
        "score": 876,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is basically the happy ending in *Starship Troopers*… Dad and son, together at last, fighting alien scum.",
                "author": "NADSAQ"
            },
            {
                "raw_content": "Neighbor is a cop, his kid just came back from the military. He's thinking about ICE, because he sees all the teamwork they're doing. No solo rides like police or border patrol.",
                "author": "billybaldwin2"
            },
            {
                "raw_content": "Can you join ice if you have a past felony from 25 years ago that was expunged? Asking for a friend…",
                "author": "m0ntsta"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "When ICE takes deportation to the fast lane",
        "score": 915,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I want to see a belt-fed catapult with a v-24 twin-turbo engine burning nitromethane that can deport 250 Juans per second!!",
                "author": "sola_scriptura"
            },
            {
                "raw_content": "Impressive speed. 🏁 🐸👍",
                "author": "MythArcana"
            },
            {
                "raw_content": "Go ICE, faster, deport 200 IPH faster!",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔥HELL YES! Ken Paxton just launched an INVESTIGATION into Beto O'Rourke for UNLAWFULLY funding the runaway Democrats! Tick tock for those who took a BETO BRIBE!",
        "score": 1818,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Tick Tock would you look at the time on the clock! It’s about two more weeks o’clock",
                "author": "BidenSniffsLittleKid"
            },
            {
                "raw_content": "If you say “Tick Tock”—in regards to anything—your opinion or political analysis will be immediately dismissed. Thank you for your attention to this matter!",
                "author": "BlackFolk"
            },
            {
                "raw_content": "i'll wait for the arrests.....",
                "author": "Badfinz_FL"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "‘Payeth us what thou oweth - ugh!’",
        "score": 1133,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I just spit up my cocktail at this meme. If you made it, OP, take a victory lap.",
                "author": "War_Hamster"
            },
            {
                "raw_content": "This will end up being all the wnba is known for and it's hilarious.",
                "author": "JimmyRussler"
            },
            {
                "raw_content": "Even after 10 years this board can still bring the spice.",
                "author": "asdrubael_was_right"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The only way France does anything / A Moroccan man has been arrested after using the Eternal Flame at the Tomb of the Unknown Soldier in Paris to light a cigarette, an act widely condemned as disrespectful and offensive.",
        "score": 687,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://x.com/TRobinsonNewEra/status/1953149971617767538 Moroccan identified as the POS who lit his cigarette on the Eternal Flame of the Tomb of the Unknown Soldier in Paris. Ministers say his permanent residency right will be revoked.",
                "author": "PiratePatriotParrot"
            },
            {
                "raw_content": "Guess France *does* have limits on what they'll allow their invaders to do.",
                "author": "AmericanJawa"
            },
            {
                "raw_content": "It is concerning how much of our shared heritage they are allowing to be desiccated and which will undoubtedly be destroyed if Muslims take majority control of Europe. Those savages already pillaged the Middle East and they have their sights on Europe.",
                "author": "D-Dub"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "American Bald Eagle View",
        "score": 499,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is that Barron?",
                "author": "Moebius"
            },
            {
                "raw_content": "Sorry I try to took a complete picture of Barron Trump. I ran out of space on my hard drive. You got to live with a partial picture.",
                "author": "DT170x"
            },
            {
                "raw_content": "Only haters will claim this is fake. Barron is part sasquatch.",
                "author": "hillaryforprison"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "That USAID funding needed to be diverted somewhere…",
        "score": 990,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Inside prosthetic limb slot. Pay for 1 ticket for a guy with a fake arm/leg and stick it in there. The DEI hires at security don't even know that's a thing.",
                "author": "CMDRConanAAnderson"
            },
            {
                "raw_content": "I will call this operation. Operation Prison Wallet.",
                "author": "DT170x"
            },
            {
                "raw_content": "Hookers off backpage can smuggle in pleanty",
                "author": "Formerlurker92"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🤣",
        "score": 1100,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Green Dildo is jockeying for the #1 position",
                "author": "sola_scriptura"
            },
            {
                "raw_content": "Someone just needs to sneak into the arena, place a box with a remote on the ceiling, and let them all fall out onto the court.",
                "author": "Jackhererer"
            },
            {
                "raw_content": "# PaY uS wHaT YoU oWe uS Best i can do is green dildo",
                "author": "Redditcensorsyouandi"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Go woke go broke corporate media",
        "score": 862,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Don’t forget the woke steaming pile of Sarah Jessica Parker crap known as And Just Like That",
                "author": "HockeyMom4Trump"
            },
            {
                "raw_content": "&#65038; *It's just a 6 month hiatus, they promised us!* &#65038;",
                "author": "BallotsOnRubysUSB"
            },
            {
                "raw_content": "That's what happens when you run out of USAID money.",
                "author": "McFatty7"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump vows 100% tariff on chips, unless companies are building in the U.S.",
        "score": 634,
        "text_content": "The clown show never ends",
        "comments": [
            {
                "raw_content": "The \"Extortionist In Chief\" , season 1, episode 7. I can hear a collective \"Whaaaat theee fuuuuck\" in many offices across the globe.",
                "author": "rebelSun25"
            },
            {
                "raw_content": "This guy wants to drive the American economy right into the dump.",
                "author": "Sillypugpugpugpug"
            },
            {
                "raw_content": "“But the good news for companies like Apple is if you’re building in the United States or have committed to build, without question, committed to build in the United States, there will be no charge,” How much does a commitment cost? Foxconn? Wisconsin?",
                "author": "Evilbred"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "TSMC employees reportedly stole 2nm trade secrets to share with Rapidus — accused are said to have shared 'hundreds of process integration technical photos'",
        "score": 98,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://asia.nikkei.com/business/technology/tokyo-electron-fires-employee-over-alleged-tsmc-trade-secret-theft Tokyo Electron just said they’ve fired the employee involved. Taiwanese media reported that the case involved thousands of photos taken inside TSMC plant that illegally ended up with Tokyo Electron, the biggest backer of Rapidus. Some analysts suggest it might have been a careless mistake. TSMC is Tokyo Electron’s largest customer of semiconductor gears. It’s possible that an engineer with severe lack of infosec awareness took the photos in violation of the rules and sent them to a partner.",
                "author": "MizunoZui"
            },
            {
                "raw_content": "I was like \"man... China at it again...\" then saw it was Japanese company. LOL",
                "author": "helloWorldcamelCase"
            },
            {
                "raw_content": "Information wants to be free",
                "author": "JaguarEqual5907"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Former Intel board members: America's champion is likely to retreat, and we still need a leading-edge chip manufacturer",
        "score": 57,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Reminder: Intel’s board was *terrible* and oversaw a decade of mismanagement. Anyone who was there has barely a leg to stand on. Step aside and let people who know what they’re doing figure this stuff out.",
                "author": "logically_musical"
            },
            {
                "raw_content": "Did these same former board members do anything to stop Pat burning tens of billions to make fabs with the build-and-they-will-come appoach, which ended up being cancelled anyway?",
                "author": "Professional-Tear996"
            },
            {
                "raw_content": ">US advanced semiconductor manufacturing has been withering for some time. The once-leading Intel appears to be dropping out of the race. Missed deadlines, poor execution, and a misguided strategy to retain manufacturing within Intel while also serving as a foundry for its fabless chip competitors resulted in a dearth of customers. Recommendations (including those from the four of us) to split off Intel’s foundry business and create a fully independent entity to supply its competitors, thereby giving itself a fighting chance, have never been adopted. ... All of these announcements strongly imply a gradual exit from the chip manufacturing business, turning Intel into a fabless company over time. Given that Intel’s internal demand is no longer big enough to justify continued capital investment in leading-edge technology, this may be the right strategy for Intel.",
                "author": "imaginary_num6er"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Former TSMC staff arrested for alleged theft of chipmaker’s technology",
        "score": 245,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TSMC had issues with former employees that went to samsung(South Korea) and SMIC(China) not too long ago. Now Tokyo Electron(Japan) is joining the party?",
                "author": "KR4T0S"
            },
            {
                "raw_content": "Archived full article: https://archive.is/NAjQM",
                "author": "dbcoopernz"
            },
            {
                "raw_content": "Lol the headline doesn't mention it was a Japanese company because the writers want you to assume it was China. The reason this happened is because Japan fears China taking Taiwan and further squeezing Japan's ability to compete in key industries. This is a preemptive move.",
                "author": "Still_There3603"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD's Post-RDNA 4 Patent Filings Signal Major Changes Ahead",
        "score": 65,
        "text_content": "**(To Mod/Disclaimer)** Everything written here is reporting and selective analysis of patent filings. The implications are hypothetical not finalized so please don't take any of it as fact. No one knows how many of these patent filings will end up in RDNA 5/UDNA or later architectures. But as with my previous post looking through patent filings can reveal the priorities of AMD R&D and signal possible shifts ahead. After all lots of them do end up in finalized silicon and shipping products. This isn't an exhaustive indication of the possible changes that lie ahead so as we near EoY 2025 and enter 2026 more filings are certain to surface leading up to the launch of AMD's nextgen GPU architecture. This post was made in response to the patent filings shared by u/Kepler_L2 in the NeoGAF forums a yesterday and complete lack of proper coverage of the patents by the tech media. I am no expert so take everything with a grain of salt and be critical. I you find any mistakes please let me know. # Dense Geometry Format (DGF) Kepler\\_L2 called this basically HW level nanite, but IDK how accurate that description is. This is the [AMD patent filing for DGF](https://www.patents-review.com/a/20250131639-dense-geometry-format.html), that they announced in February [via GPUOpen](https://gpuopen.com/learn/problem_increasing_triangle_density/). The Dense Geometry Format is all about making the BVH footprint as small as possible while reducing redundant memory transactions as per the blog: *\"DGF is engineered to meet the needs of hardware by packing as many triangles as possible into a cache aligned structure. This enables a triangle to be retrieved using one memory transaction, which is an essential property for ray tracing, and also highly desirable for rasterization.\"* It'll be supported in hardware by future AMD GPU architectures. RDNA 4 hasn't mentioned support so this is reserved for nextgen. [Another patent filing](https://www.patents-review.com/a/20250131640-intersection-testing-dense-geometry-data-triangle.html) adresses RT issues with BW use by adding a low precision prefiltering stage where bulk processing of primitive packets are done by default for prefiltering nodes (an alternative route to DGF) and only for inconclusive results are full precision intersection tests required. Both DGF and Prefilter nodes have major benefits in terms of lowering the area required (low precision), eliminating redundant duplicative data, reducing node data fetching, and increase compute-to-memory ratio of ray tracing. Here is the full quote from the paper: *\"In the implementations described herein, parallel rejection testing of large groups of triangles enables a ray tracing circuitry to perform many ray-triangle intersections without fetching additional node data (since the data can be simply decoded from the DGF node, without the need of duplicating data at multiple memory locations). This improves the compute-to-bandwidth ratio of ray traversal and provides a corresponding speedup. These methods further reduce the area required for bulk ray-triangle intersection by using cheap low-precision pipelines to filter data ahead of the more expensive full-precision pipeline.\"* In conclusion the prefilter and DGF nodes allow a massively reduced load on the memory subsystem while permitting fast low precision bulk processing of triangles resulting in a speedup. All this while having an even lower area cost. # Multiple Ray Tracing Patents Filings I won't repeat all the patents from the previous post I made months ago so this is only the patent filings shared by Kepler\\_L2. [One about](https://www.patents-review.com/a/20250182377-configurable-rayedge-testing-convex-polygon-groups.html) configurable convex polygon ray/edge testing which allows sharing of results from edges between polygons eliminating duplicative intersection tests. This has the following benefit: *\"By efficiently sharing edge test results among polygons with shared edges, inside/outside testing for groups of polygons can be made more efficient.\"* It can be implemented via full or reduced precision and makes ray tracing more cost-effective. Three other patent filings leverage displaced micro-meshes (DMMs) and a accelerator unit (AU) that creates them. [The first patent filing](https://www.patents-review.com/a/20250200890-prism-volumes-displaced-subdivided-triangles.html) introduces prism volumes for displaced subdivided triangles (inferred from DMM). AU creates an bounding volume around DMM mesh, it then adds more bounding volumes thereby creating a prism (3D triangle) shape around the base triangle corresponding to the three corners and the low and high of interpolated DMM normals. The AUs then *\"...determine whether a ray intersects the prism volume bounding the first base triangle of the DMM\"* [The second patent filing](https://www.patents-review.com/a/20250200865-ray-tracing-displaced-micro-meshes-bounding-prism-hierarchy.html) concerns ray tracing of DMMs using a bounding prism hierarchy. A base mesh is used which can be broken down into micro-meshes which can be adjusted with displacement to accurately showcase the scene detail. Method for intersection described same as in the other filings, except this one also mentions prisms at the sub base triangle level together making one big prism in accordance with first filing. [The third](https://www.patents-review.com/a/20250218104-systems-methods-detecting-ray-intersections-displaced.html) talks about the specific method for detecting ray intersections with DMMs. This method is as follows: *\"Instead of detecting intersection with the bilinear patches directly, tetrahedrons that circumscribe the bilinear patches can be used instead. The two bases and the three tetrahedra make fourteen triangles. The device tests for potential intersection with the displaced micro-mesh by testing for an intersection with any of the fourteen triangles. Various other methods and systems are also disclosed.\"* I cannot figure out how this DMM implementation differs from NVIDIA's now deprecated DMM implementation in Ada Lovelace, but it sounds very similar although some differences are probably to be expected. IDK what benefits are to be expected here except perhaps lower BVH build cost and size. # Streaming Wave Coalescer (SWC) [The Streaming Wave Coalescer ](https://www.patents-review.com/a/20250068429-streaming-wave-coalescer-circuit.html)implements thread coherency sorting similar to Intel's TSU and NVIDIA's SER implementations. It does this by using sorting bins and hard keys to sort divergent threads across waves following the same instruction path, thereby coalescing the threads into new waves. The [spill-after programming model](https://www.patents-review.com/a/20250130811-spill-after-programming-model-streaming-wave-coalescer.html) offers developers granular control over when and how thread state is spilled to memory when reordering executions to different lanes. This helps avoid excessive cache usage and memory access operations resulting in large increases in latency and costly front-end stalls when leveraging SWC. Just like SER the SWC would help boost path tracing performance, although the implementation looks different and enabled by default. # Local Launchers and Work Graph Scheduler [One patent filing](https://www.patents-review.com/a/20250217195-local-launch-workgroup-processors.html) mentions that each Workgroup Processer (WGP) can now use local launchers generate work/start shader threads independent of the Shader Program Interface (SPI). They maintain their own queues and ressource management but ask for help via SPI and lease ressources for each shader thread. Scheduling and dispatching work locally results in reduced latency, more dynamic work launches and reduced GPU frontend bottlenecks. [This patent filing](https://www.patents-review.com/a/20240111574-work-graph-scheduler-implementation.html) introduces a hierarchical scheduler made out of a global scheduler and one or more local schedulers called Work Graph Schedulers (WGS) located within each Shader Engine. Tasks are stored in a global mailbox/shared cache fed by the global scheduler and when a task (work item) is ready it then notifies one WGS to fetch it. Meanwhile scheduling and management of the work queue is offloaded to the local WGS. Each WGS independently schedules and maintains its own work queue for the WGPs and has its own private local cache. This resulting in quicker accesses and lower latency scheduling while at the same time enabling much better core scaling especially in larger designs as explained here: *\"In an implementation, the WGS* ***306*** *is configured to directly access the local cache* ***310***\\*, thereby avoiding the need to communicate through higher levels of the scheduling hierarchy. In this manner, scheduling latencies are reduced and a finer grained scheduling can be achieved. That is, WGS\\* ***306*** *can schedule work items faster to the one or more WGP* ***308*** *and on a more local basis. Further, the structure of the shader engine* ***304*** *is such that a single WGS* ***306*** *is available per shader* ***304***\\*, thereby making the shader engine\\* ***304*** *more easily scalable. For example, because each of the shader engines* ***304*** *is configured to perform local scheduling, additional shader engines can readily be added to the processor.\"* En essence each SE becomes its own pseudo-autonomous GPU that handles scheduling and work queue independently of the global scheduler. Instead of the orchestrating everything and micromanaging, the global scheduler can simply provide work via the global mailbox thereby offloading scheduling of that work to each Shader Engine. The patent filing also mentions that WGS may communicate with each other and that WGPs can assist in scheduling. The implementation is such that the WGS schedules work and sends a work schedule to the Asynchronous Dispatch Controller (one per Shader Engine). The ADC builds waves and launches work for the WGPs in the Shader Engines. When a WGS is underutilized it can communicate that to the global scheduler and request more work. When it's being overloaded work items are exported to an external global cache. This helps with load balancing and keeping Shader Engines fed. It's possible that a local scheduler might become overburdened, but AMD has another [patent filing](https://www.patents-review.com/a/20250068464-hierarchical-work-scheduling.html) adressing this by allowing each WGS to offload work items to the global scheduler if they overwhelm its scheduling capabilities. These are redistributed to one or more other WGS residing within different scheduling domains/Shader Engines. # A Few Important Patents Filings The [RECONFIGURABLE VIRTUAL GRAPHICS AND COMPUTE PROCESSOR PIPELINE](https://www.patents-review.com/a/20250131640-intersection-testing-dense-geometry-data-triangle.html) patent filing allows shaders (general purpose) to emulate fixed function HW and take over when a fixed function bottleneck is happening. Another patent filing talking about [ACCELERATED DRAW INDIRECT FETCHING](https://www.patents-review.com/a/20240192994-accelerated-draw-indirect-fetching.html) leverages fixed function hardware (Accelerator) to speed up indiret fetching resulting in a lowered computational latency and allows *\"...different types of aligned or unaligned data structures are usable with equivalent or nearly equivalent performance.\"*",
        "comments": [
            {
                "raw_content": "> The Streaming Wave Coalescer implements comprehensive out-of-order execution (RDNA 4 only has OoO memory requests). It does this by using sorting bins and hard keys to sort divergent threads across waves following the same instruction path, thereby coalescing the threads into new waves. This isn't really \"out of order execution\" as you'd see in a CPU. GPUs already switch to other waves to avoid the pipeline stalling an in-order CPU working on a single thread sees. This patent is more about divergence within a wave - if there's a conditional (like an \"if\" block) in a shader and the entire wave (32/64 threads depending on mode) doesn't end up taking *exactly* the same path, all paths need to be executed and the results simply ignored on the paths it \"shouldn't\" have run in. The same with loops - the entire wave takes as long as the largest iteration count of any single shader. So in cases where you're traversing through data structures that might have significant, unpredictable divergence at runtime (such as, for example, ray tracing BVH nodes) you can end up paying a *lot* for the long tail of shaders that happen to need a large number of node iterations, as they pin the entire wave they are are submitted with onto the GPU, even if much of the time they're executing is on things that will simply be ignored and wasted. Now this would be OK if you could, say, collect all the \"long running\" shader instances together into the same wave, so the \"quick\" instances can be completed without the longer running examples slowing it down. *That* seems to be what the particular patent is about, not really \"out of order\" execution. Similar to Nvidia's SER at a high level, but likely with implementation specifics differing and pos (RDNA4 already has some level of ability to resort and reorder shaders, but it's limited and requires a fair bit of \"software\" handholding, it looks to me like this patent is bringing more of the logic into hardware, presumably to make it more flexible and less costly) And I'm not sure calling DGF \"Hardware Nanite\" really makes sense - it's \"simply\" a more compact geometry representation, \"nanite\" is more about geometry virtualisation - so while GDF *could* be used in this path, it seems more like it's just side effect of \"Smaller geometry formats mean lower memory use, less bandwidth, and takes less cache space\" rather than anything directly related to virtualisation. It'll also benefit any other geometry users, as less memory use is always good.",
                "author": "Jonny_H"
            },
            {
                "raw_content": "Once again really cool things to dig up from the patents and awesome to see so much active development from Team Red. These look like the types of changes that might roll out over the course of a few generations before being all checked off, but massive scheduling and RT overhauls are pretty much what I expect for a supposedly brand-new architecture like UDNA. The distributed scheduling thing is very interesting in the context of a potential chiplet GPU. They call out lower latency and the ability to pass things up to a higher scheduler. That strikes me as maybe each chiplet having it's own scheduler, and a master center die hosting maybe I/O, memory controllers, and global scheduling.",
                "author": "Affectionate-Memory4"
            },
            {
                "raw_content": "RemindMe! next saturday",
                "author": "fibercrime"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "US lawmaker questions Intel CEO's ties to China in letter to company board chair",
        "score": 18,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Apple says Samsung will supply chips from Texas factory",
        "score": 34,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The article only specifies that they’re making the image sensor chips for iPhone and nothing else. I’d imagine TSMC will still be making their A/M-series processors.",
                "author": "SuperDuperSkateCrew"
            },
            {
                "raw_content": "Is this factory called Texas Instruments?",
                "author": "imaginary_num6er"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel CEO Lip-Bu Tan Questioned by US Senator About China Investments",
        "score": 6,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "China ships first NIL lithography tool as 300-plus firms mobilize to rival EUV tech",
        "score": 156,
        "text_content": "**NIL seen as EUV alternative** NIL is seen as a next-gen patterning method with the potential to replace or rival EUV and other conventional lithography techniques. It works by pressing nanoscale patterns onto a wafer using a mold, then etching the features into circuit structures. While the concept is simple, achieving semiconductor-level precision and yield demands rigorous control over mold quality, materials, system accuracy, and cleanroom environments — technical hurdles comparable to EUV. Canon launched its own NIL tool for advanced chipmaking in 2023. The latest version, the FPA-1200NZ2C, was delivered in 2024 to the Texas Institute for Electronics (TIE) in the US. Pulin's PL-SR series uses inkjet-based step-and-repeat NIL technology designed for sub-10nm nodes and is directly benchmarked against Canon's flagship system. It incorporates proprietary modules for mold profile control, inkjet resist dispensing, precise alignment, and residual layer control. The company claims advances in key metrics, including imprint aspect ratios, resist thickness uniformity, and material compatibility. The PL-SR system has completed initial process validation for use in memory, silicon photonics, advanced packaging, and microdisplay applications. Its step-and-repeat function supports 12-inch wafer stitching, making it viable for future high-volume deployment.",
        "comments": [
            {
                "raw_content": "Article's paywalled. Here's the full text: > Report: China ships first NIL lithography tool as 300-plus firms mobilize to rival EUV tech > Amid tightening US export controls on EUV lithography systems and related technologies, China's chip equipment sector has made a breakthrough. On August 1, Pulin Technology (Hangzhou) shipped its first domestically developed semiconductor-grade step-and-repeat nanoimprint lithography (NIL) tool, the PL-SR series, to a customer focused on specialized chip manufacturing. > If NIL proves scalable for mass production of advanced chips, it could challenge ASML's dominance in next-gen lithography. The milestone also signals China's progress toward achieving greater autonomy in high-end chip fabrication. > NIL is seen as a next-gen patterning method with the potential to replace or rival EUV and other conventional lithography techniques. It works by pressing nanoscale patterns onto a wafer using a mold, then etching the features into circuit structures. While the concept is simple, achieving semiconductor-level precision and yield demands rigorous control over mold quality, materials, system accuracy, and cleanroom environments — technical hurdles comparable to EUV. > Canon launched its own NIL tool for advanced chipmaking in 2023. The latest version, the FPA-1200NZ2C, was delivered in 2024 to the Texas Institute for Electronics (TIE) in the US. > Pulin's PL-SR series uses inkjet-based step-and-repeat NIL technology designed for sub-10nm nodes and is directly benchmarked against Canon's flagship system. It incorporates proprietary modules for mold profile control, inkjet resist dispensing, precise alignment, and residual layer control. The company claims advances in key metrics, including imprint aspect ratios, resist thickness uniformity, and material compatibility. > The PL-SR system has completed initial process validation for use in memory, silicon photonics, advanced packaging, and microdisplay applications. Its step-and-repeat function supports 12-inch wafer stitching, making it viable for future high-volume deployment. > Precision alignment remains the core hurdle Achieving sub-nanometer alignment accuracy remains a major challenge in chip manufacturing. Pulin's PL-SR addresses this through full-stack co-optimization of hardware, materials, and software, achieving average residual layer thickness under 10nm with less than 2nm variation. > Pulin aims to push alignment precision below 10nm and ultimately approach the 1nm range, bringing NIL into the same technical and economic territory as EUV systems. > The company stressed that tackling these challenges requires collective effort. It plans to strengthen partnerships with local research institutes and precision equipment firms to establish a self-reliant domestic supply chain for advanced chipmaking tools. > The shipment of the PL-SR marks the first commercial deployment of a China-developed step-and-repeat NIL system. Industry insiders see it as a significant shift from lab prototype to practical manufacturing tool. > Founded in 2017, Pulin has focused on core R&D and holds over 50 invention patents. Its NIL platform spans equipment, materials, and processing, placing it among the few globally with end-to-end capabilities in this space. > Over 300 Chinese players engaged in advanced lithography R&D China's progress in lithography was on display at the 2025 Advanced Lithography Technology Symposium in Suzhou, which drew participation from more than 300 domestic research institutes and companies. The event focused on next-gen lithography processes, equipment R&D, and materials innovation, reflecting China's broader push for self-sufficiency in chipmaking. > Key academic participants included Huazhong University of Science and Technology, Fudan University, and the Chinese Academy of Sciences. Domestic equipment makers like AMIES Technology and Hefei Haoyu Xinguang Technology presented progress in EUV laser components, multi-beam lithography, and packaging tools. > With global semiconductor supply chains growing more fragmented, China's push to build indigenous exposure and processing equipment could reshape the global competitive landscape. > Although China still trails global leaders like ASML and Canon in lithography, companies like Pulin are emerging as credible challengers with the potential to replace foreign tools in select applications.",
                "author": "throwaway12junk"
            },
            {
                "raw_content": "china is at least forward looking and realising that depending on single entity for your computer needs is bad idea in todays world.. US on the other hand has decided to go the other way and plans to give that coal thing another shot..",
                "author": "Redd411"
            },
            {
                "raw_content": "https://youtu.be/8UdNB3ZY4Ks?si=3ipaPmJy2_dDBS8S Asianometry did a report on the tech. It's far from a cutting edge process process node, but it could be very useful and incredibly cost effective for large scale memory production. Or like those L3 cache chiplets, it sounds like to me. Maybe some entry levelgaming GPUs, or car electronics, etc. I think it's like 14nm or so, so you could probably make a bunch of the RX 580 tier GPUs.",
                "author": "bubblesort33"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Digital Foundry on the current Dev Kit situation for Switch 2",
        "score": 565,
        "text_content": "Hopefully",
        "comments": [
            {
                "raw_content": "also for the love of god upgrade the XBC trilogy....",
                "author": "Rashimotosan"
            },
            {
                "raw_content": "Same thing with the new katamari, switch 2 port is heavily delayed. I'm done buying switch 1 games for the most part at this point and waiting for games is not something I'm looking forward to.",
                "author": "doctorhino"
            },
            {
                "raw_content": "I'm really curious, do we know why nintendo is being so stingy with Dev kits? I keep hearing it's an issue but there's gotta be a reason why, yeah?",
                "author": "OpeningConfection261"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "It’s unbelievable how detailed dk bananza is. Gold is a soft material,so dk leaves his footprints on it",
        "score": 571,
        "text_content": "",
        "comments": [
            {
                "raw_content": "But why does gold explode???? lol",
                "author": "greyleafstudio"
            },
            {
                "raw_content": "Is this really that unbelievable? Lol",
                "author": "Craft_Bubbly"
            },
            {
                "raw_content": "Ima be real with you, this is nothing special lol",
                "author": "carbine234"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "don't think that was supposed to happen",
        "score": 361,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If you went a little to the left, you would have found the item glitch chest! /s",
                "author": "Unhappy_Gazelle392"
            },
            {
                "raw_content": "Good to know Cyberpunk 2077 is still Cyberpunk 2077ing.",
                "author": "VaughnFry"
            },
            {
                "raw_content": "At least you got a safe landing after falling through the ground?",
                "author": "Hyperdragoon17"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Darksiders 1 on Switch 2",
        "score": 16,
        "text_content": "Has anyone tried Darksiders 1 on Switch 2? I bought all 4 games and started playing for the first time today. I've noticed that the cutscenes occasionally have some issues... like they slow down, causing the video and audio to be out of sync. Has anyone else noticed the same problem? I tried it on Switch Lite and everything runs normally.",
        "comments": [
            {
                "raw_content": "I just bought this too and was hoping it would run okay because I didn’t see anything. Would be interested to know how the other Darksiders games run. I know 3 runs a lot better.",
                "author": "MrAri"
            },
            {
                "raw_content": "I'm playing that also on my Switch 2 and I didn't get any problem on that part. Maybe try to re-download the game or check if that's the updated version.",
                "author": "VannofThursday"
            },
            {
                "raw_content": "Any problems during gameplay?",
                "author": "zalustep"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Lunchbreak Switch 2 Setup",
        "score": 95,
        "text_content": "On my 3D printed Skadis cubicle panel and with a third party Amazon dock. Innocn 13\" portable monitor",
        "comments": [
            {
                "raw_content": "is that a 3rd party switch dock ??",
                "author": "Competitive_Zone306"
            },
            {
                "raw_content": "Apex legends in mouse mode also dope on this setup",
                "author": "thewoodulator"
            },
            {
                "raw_content": "I recommend to 3D print this for that dock so you can have the proper airflow that the regular Switch 2 dock gives: https://makerworld.com/models/1596726",
                "author": "micbro12"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Mario Party Jamboree + TV Clarification",
        "score": 10,
        "text_content": "So , I've been SUPER confused as to what you get with the switch 2 version of jamboree. I was under the impressions from reviews and other reddit posts , that , if you want to play the classic mario party boards , you had to play the switch 1 version of the game on the cartridge , with no graphic upgrades , which was a bummer , and if you wanted all the new tacked on stuff , then you had to go over to the jamboree TV side and play those with the 1440p upgrades. I almost just bought a used copy of jamboree for switch 1 but said screw it , and just took the plunge and got the switch 2 version. To my surprise , you can totally play all of the original Mario party jamboree boards just like you would on the switch 1 version but through the TV side, and you DO get the 1440p graphics upgrade that way . The only difference is , you cant earn the boards yourself , everything is just already unlocked. which..... fine . lol So it almost begs to question.... why even keep the old switch 1 game attached to it ? It just made things super confusing and it really doesn't serve much of purpose, unless you really like the flight school or something . Anyway, i didn't know this , most of you probably did , but for those that don't , YES you can play full Mario party jamboree boards in 1440p if you buy the switch 2 version of the game . Its just weird how you have to do it . Mainly just archiving this for googles search people to run across in the future. Because Nintendo made this as confusing as humanly possible.",
        "comments": [
            {
                "raw_content": "There are a few things that require you to boot the S1 Version which should be included in Jamboree + TV: \\- Pro Rules for the party mode are locked behind S1 Jamboree. For that you have Team Mode and the short Sprint mode in S2 Jamboree party mode. \\- The Boss Battle Minigames can only appear in S1 Jamboree party mode.",
                "author": "Kadji100"
            },
            {
                "raw_content": "I think there are the minigames in the switch 1 version that aren't in the switch 2 version. My memory might be wrong, but Nintendo Lite did a video about it.",
                "author": "chemistrybonanza"
            },
            {
                "raw_content": "Jamboree has a ton of game modes, not just the boards. Those didn’t get upgraded so you still need to access them via the Switch 1 version.",
                "author": "dxsanti"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Hot Take: I think Game Key Cards are not the worst thing to ever exist",
        "score": 264,
        "text_content": "https://preview.redd.it/06n2s7eiidhf1.png?width=1569&format=png&auto=webp&s=75362d16afd2e50b79aefc9c2407642028e4bd26 Hear me out before you Rage. Yes i prefer full physical games any day over game key cards or eshop only downloads. But Game Key Cards are way better then code in a box/eshop only stuff. Its basically a ps4/ps5 disk with the difference you need a internet connection to download it once. Thats it. The Key card can still be given to a friend or sold and they can still use it since its tied to the card not to a Nintendo account. Don't get me wrong i prefer if 3rd Partys release their games in full on card (like cyberpunk 2077) but until there are more Storage sizes available (which are supposedly being worked on) i vastly prefer a game key card release over a code in a box or eshop only releases. Maybe they should have reused the old switch 1 cards and used them as a install card or something like that so that it doesn't need internet. In short Physical>Game Key Cards>eshop only>Code in a box",
        "comments": [
            {
                "raw_content": "Nintendo invented a way to trade and sell digital games, something people have been asking for ever since digital began, and somehow that's a bad thing",
                "author": "Wipedout89"
            },
            {
                "raw_content": "First of all, they haven’t replaced code in a box. There are several codes in boxes for Switch 2. Secondly, I want real physical games. I won’t buy GKC, and I won’t buy digital only either.",
                "author": "JetstreamGW"
            },
            {
                "raw_content": "It's not that game key cards are the worst thing ever, but the issue is that they are replacing physical cartridges. They're fine as an option, but not as a replacement.",
                "author": "BothTwist"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "So NHL 26 was announced and it’s not coming to Switch 2 (or PC)",
        "score": 75,
        "text_content": "I wanted to make a post for this as a lot of people including myself were hoping to get this game. I’m pretty disappointed, hopefully it comes next year but I don’t see any reason to be optimistic.",
        "comments": [
            {
                "raw_content": "would be cool to have a good hockey game on the switch",
                "author": "Taller_Ghost_Joop"
            },
            {
                "raw_content": "Considering we are getting madden I will be shocked if we don’t get this moving forward",
                "author": "hokahey23"
            },
            {
                "raw_content": "I’ll play nhl ‘06 for GameCube since it’s pretty much the same game as nhl ‘26",
                "author": "skip-bo"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Tom Henderson: Activision Leadership Isn’t Worried About Battlefield 6 Because Call of Duty is “Too Big to Fail”",
        "score": 630,
        "text_content": "https://insider-gaming.com/battlefield-6-vs-call-of-duty/ > Speaking with sources who wished to remain anonymous because they were not authorised to talk about Activision’s internal conversations, it’s been said that although Activision is keeping a close eye on Battlefield, they are not worried about the game outcompeting its flagship franchise. > > It’s said that Activision leadership believes that Call of Duty is “too big to fail” and will remain a profitable, annually released franchise for many years to come. At the time of writing, an annual Call of Duty title is penciled in for the next four years at least.",
        "comments": [
            {
                "raw_content": "#Tom Henderson is a Tier 1 - Very Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "They're not wrong... The worst reviewed Call of Duty games are still the best selling games of the year, even when the fanbase is vocal about how bad they are.",
                "author": "MuptonBossman"
            },
            {
                "raw_content": "COD Infinite Warfare was one of the most disliked CODs and BF1 was one of the most hyped BFs. Yet COD IW wiped the floor with BF1 financially. No matter how good BF6 and how bad COD BO7 will become, COD will be bigger.",
                "author": "turkoman_"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Alleged PS6 Orion APU specs vs. alleged next gen XBox(?) APU specs",
        "score": 47,
        "text_content": "| Feature | Orion APU (PlayStation 6) | Magnus APU (Next-generation Xbox) | |---|---|---| | **CPU Cores** | 8 Zen 6 cores [1] | 3 Zen 6 cores + 8 Zen 6c cores (11 cores total) [1] | | **GPU Compute Units** | 40-48 RDNA 5 CUs [1] | 68 RDNA 5 CUs [1] | | **GPU Clock Speed** | 3+ GHz [1] | Not specified | | Memory Tech | GDDR7 SDRAM [1] | GDDR7 SDRAM [1] | | **Memory Bus/Size** | 160-bit or 192-bit bus [1]; 640-768 GB/s bandwidth [3]; 24 GB of RAM speculated [2] | 192-bit bus [1]; up to 24 GB of RAM speculated [1] | | **Design** | Chiplet [1, 4] | Chiplet (CPU and GPU on separate dies) [1] | | **Production Process** | TSMC N2 or N3 (3nm/2nm) nodes [1] | TSMC 3nm process [1] | | **Die Size** | Not specified | CPU: 144mm²; GPU: 264mm² [1] | | **Thermal Design Power (TDP)** | Around 160W TBP [1] | Not specified | | **Performance Target** | 3x PS5 raster performance; 10x PS5 ray tracing performance [1, 4] | Native 4K at 120 FPS; up to double the performance of a PS5 Pro [1] | | **Primary Focus** | Power efficiency, cost constraints, and improved ray tracing [1] | Modular design for a family of devices [1, 4] | Footnotes: * [1] Leaks from technology YouTuber \"Moore's Law Is Dead\" and associated leaked documents. * [2] Speculation from Digital Foundry experts. * [3] Information from a leaked AMD presentation. * [4] Recent leaks and reports from various tech news outlets.",
        "comments": [
            {
                "raw_content": "Can't believe we are getting close to PS6 it feels like PS5 came out 2 years ago lol",
                "author": "ItsBooy"
            },
            {
                "raw_content": "Microsoft APU looks to be more powerful. Will the extra Teraflops win Microsoft the console race /s",
                "author": "pratyush_1991"
            },
            {
                "raw_content": "no way in fuck it's 4k at 120 fps",
                "author": "aybbyisok"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Sekiro anime web domain registered by Kadokawa",
        "score": 274,
        "text_content": "https://xcancel.com/Wario64/status/1953100767453220870?t=iz6xK4M9z4jiv38cxmgW5g&s=19",
        "comments": [
            {
                "raw_content": "I for sure welcome a Sekiro anime. I wonder who'd be animating it as Kadokawa is a publisher and not an animation studio",
                "author": "Jedi_Pacman"
            },
            {
                "raw_content": "Finally some news on this. Last thing I heard was that they were still looking for animators.",
                "author": "Dark_Dragon117"
            },
            {
                "raw_content": "Wait, so it was real?",
                "author": "Moth_LovesLamp"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[Presspost Early, and Removed] RedOctane Games comes back",
        "score": 177,
        "text_content": "More info on all pressoutlets immenently. << Veterans of the rhythm game genre have announced the establishment of new video game developer RedOctane Games. The studio is focused on \"solely on advancing the rhythm game genre, combining the past with the future.\" Its first rhythm game will be announced later this year. RedOctane Games is led by the former production director on several Guitar Hero titles at Neversoft Simon Ebejer. He was also the former former studio head at Vicarious Visions and vice president of operations at Blizzard Entertainment.>>",
        "comments": [
            {
                "raw_content": "I truly believe there’s a market for a GH/Rock Band resurgence. At least from my biased perspective because I really miss those games.",
                "author": "PM_ME_YOUR_DANKNESS"
            },
            {
                "raw_content": "https://www.youtube.com/watch?v=SMpdAXrO3tk https://www.redoctane.games/",
                "author": "JustNicked"
            },
            {
                "raw_content": "Also partnered with (or under the same umbrella company) as CRKD, the company who recently released new guitar hero-style controllers and tons of Fortnite Festival controllers.",
                "author": "ThrottlePeen"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel confirms AVX10.2 512b support for 'future Intel Core' series",
        "score": 20,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Finaly ...",
                "author": "Michal_F"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Exclusive: US lawmaker questions Intel CEO's ties to China in letter to company board chair",
        "score": 238,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wasn't the previous company he was the CEO at caught selling secrets to China?",
                "author": "Possible-Put8922"
            },
            {
                "raw_content": "Peng Bai now runs a semiconductor concern in China: https://www.oregonlive.com/silicon-forest/2025/01/former-intel-oregon-executive-will-run-chinese-chipmaker.html",
                "author": "Palmer_Eldritch666"
            },
            {
                "raw_content": "Guys is just another accountant in a long list of accountants that ran Intel. Just to be clear, even though some of those CEOs were electrical engineers, they acted like accountants. I say this because technologists need to run technology companies.",
                "author": "Longjumping-Ad8775"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Remember Intel APO?",
        "score": 24,
        "text_content": "Remember when they falsely marketed the 14th gen intel cpus as “Designed For APO”. Mid-october 2024 they released an article tht included 12 new games on the list of APO-enabled games. It’s been almost a year and we still haven’t received anything. The app hasn’t been updated for a very long time and even motherboard vendors haven’t updated any of their drivers (most still in 2024) These 12 new games include huge ones like Fortnite, CP2077, CS2, Dota 2, and more. Remember, R6 Siege got around a 30% uplift in performance, so imagine how much potential there is. Let alone the shred of integrity that intel can redeem, which oh god they do need. Why is this not getting more media coverage? I hope this post blows up because maybe Intel likes to be reminded of their shortcomings. Hopefully this reminds them to get them working back on things they promised their customers, and didn’t deliver on.",
        "comments": [
            {
                "raw_content": "If you ask why the **Media,** Tech media these days are prefering to cover Bad news about Intel or Paint news to look bad about Intel It generates more Traffic for them. since the community are happy reading bad news about Intel recent example is about Intel Core 120 which is 12400F refresh for LGA 1700 socket, Media Coverage about it is bad yada yada yada Despite competitor already doing this for years Ryzen 3800 XT (Rebrand 3700X) 5600 GT(Rebrand 5600G) 5600(Rebrand 5600X), 5700X(Rebrand 5800X) 5700X 3D(Rebrand 5800x 3D) Despite they do same thing, Relaunching Old Die with New Name, to refresh the pricing because the old pricing on market already so eroded, They might not as expensive as the initial launch price of Old name, but it just to make sure street pricing aren't dropping below acceptable margin",
                "author": "heickelrrx"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Future of VPRO",
        "score": 6,
        "text_content": "What is the future of VPRO? Intel is looking to sell Network and Edge Group (NEX) so does it mean that VPRO, Intel's unique tech, will be completely abadoned? Is your company concerned about latest news? (eg. https://www.sdxcentral.com/analysis/the-5-firms-who-could-buy-intels-network-business/ ) Extra question: what has happened to new Intel Xeon-D processors (Emerald Rapid)? (1800 series) I see no (SuperMicro X14 with Xeon-D) products available.",
        "comments": [
            {
                "raw_content": "Intel will not be selling it as a whole, the deal will be like the Altera one. So Intel will retain either 51% or 49%",
                "author": "Tradeoffer69"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "XFX confirms its Radeon AI PRO R9700 will launch through system builders, featuring AMD reference design",
        "score": 43,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Glad to see there's still a huge market for these bitcoin mini- I mean AI cards.",
                "author": "got-trunks"
            },
            {
                "raw_content": "From what I've seen, the two models with HDMI are from Gigabyte and Asus. The others have four Displayport. And they all use the 12V High Failure Rate connector, and all use blower coolers.",
                "author": "Nuck_Chorris_Stache"
            },
            {
                "raw_content": "Essentially, this is the 9070 reference model. It's like we've gone back five years to the RDNA1 era.",
                "author": "Public_Standards"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Here Come the HELOCs: Mortgages, Housing-Debt-to-Income-Ratio, Serious Delinquencies, and Foreclosures in Q2 2025",
        "score": 53,
        "text_content": "https://wolfstreet.com/2025/08/06/here-come-the-helocs-mortgages-housing-debt-to-income-ratio-serious-delinquencies-and-foreclosures-in-q2-2025/ Here Come the HELOCs: Mortgages, Housing-Debt-to-Income-Ratio, Serious Delinquencies, and Foreclosures in Q2 2025 | Wolf Street Taxpayers and investors are mostly on the hook this time, not banks. By Wolf Richter for WOLF STREET.",
        "comments": [
            {
                "raw_content": "Wolf Richter sounds like the name of the antagonist in my unauthorized and unpublished erotica fan-fiction novel set in the 1980s Die Hard universe",
                "author": "acqua_di_hoomertears"
            },
            {
                "raw_content": "Just as an N = 1, my family member recently had to sell a vacation rental due to this last month. Maxed out credit cards just to pay the mortgage because of the variable rate payment increase.",
                "author": "boboman911"
            },
            {
                "raw_content": "From the article: \"So far, so good: delinquencies and foreclosures dipped and are low. Serious delinquencies ticked down in Q2 and are low for both, mortgages and HELOCs. Mortgage balances that were 90 days or more delinquent dipped to 0.82% of mortgage balances outstanding, which is below the historic lows before the Free-Money era (red in the chart below). HELOC balances that were 90 days or more delinquent dipped to 0.85% in Q2, below the prepandemic range and a little higher than in the pre-2006 years (blue). Foreclosures declined and are low. The number of consumers with foreclosures in Q2 dipped to 52,800, and remained below the range of the Good Times in 2018-2019 of 65,000 to 90,000... What is keeping foreclosures still low currently is that home prices exploded during the Free-Money era... As a result, most struggling homeowners can sell their home for more than they owe on it, pay off the mortgage, and exit with some cash. But in markets where home prices have already dropped significantly, this option is slipping away from the relatively small number of buyers who’d bought near the peak.\" So much for those waves of panic sellers...",
                "author": "PoiseJones"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "10-year Treasury yields rise after weak auction",
        "score": 110,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I've got a bet on another sub that the 10y yield won't go below 4% before 2030. Persistent high deficits, persistent high inflation, and a huge existing debt load means that the US is going to be an elevated credit risk for a long time.",
                "author": "ThisKarmaLimitSucks"
            },
            {
                "raw_content": "Bond markets never lie.",
                "author": "PorgCT"
            },
            {
                "raw_content": "Waiting for Trump to pressure Fed to cut rates but find out the hard way, Fed doesn’t control treasury rates they can only influence it by cutting Fed funds rate. if there is inflation or countries and institutions start questioning the inflation #s are being cooked. No one is going to be willing to buy treasuries which will be cause rates to diverge which is very very bad thing. It will be something if Fed fund rate is around 200 bps or less while 10 yr is hovering over 4.5%",
                "author": "Dmoan"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The Housing Market Is ‘Out of Whack.’ How to Make Sense of It All.",
        "score": 56,
        "text_content": "",
        "comments": [
            {
                "raw_content": "On the surface, the housing market looks inhospitable for both buyers and sellers. But under the hood, economists are closely watching the data for signs of a shift. Shifting to what, exactly, is unclear: if certain movements are more than a blip, that could foreshadow a housing correction in the form of lower prices as buyers continue to balk, while other changes could usher in a sales pickup. “There are a few things that we have seen that have been kind of out of whack lately,” says Joel Berner, a senior economist at Realtor.com. Here are three housing data points to follow closely in the coming months: Days on the Market It wasn’t long ago that houses couldn’t stay on the market long enough to be counted accurately in monthly data collection. Now, they’re sitting for longer than before the pandemic, according to recent Realtor.com data. (Barron’s and Realtor.com operator Move are both owned by News Corp). In July, homes spent a median 58 days on the market, Realtor.com’s data show, the most for any July since 2017. It could be a blip, but the stat is “something we’re keeping a really close eye on,” says Berner. “If they get much slower than they were prepandemic, then we might be seeing something that looks like a—not to use an ugly word—but like a correction,” he says. A correction may be an ugly word to sellers and homeowners—but not buyers. Prospective buyers shopping for deals might find them in places where homes are sitting longer. About a fourth of the 100 largest metropolitan areas had their slowest July since at least 2016, Realtor.com data show, including Los Angeles, Dallas, Phoenix, San Francisco, and Seattle. But buyers can only benefit from lower prices if sellers keep their houses on the market. Delistings have recently gone up, Bermer notes. “People who have the option are looking at the market and deciding, you know, now is not the right time for us,” Berner says. “There’s not enough demand in some of these markets to keep up with the number of listings that are on the market, and so people are deciding to delist,” he says. Construction Data New homes represent just a sliver of the overall housing market—but changes in data related to home building carries broader implications. Data show single-family home builders slammed on the brakes in recent months. In June, builders started construction on new homes at the slowest seasonally adjusted pace in about a year, Census data show. Authorizations to build new homes dropped to their slowest level since March 2023, foreshadowing a steeper slowdown to come. “Builders are extremely good at forecasting future housing demand,” says Orphe Divounguy, a senior economist at Zillow. “They are increasingly wary of rising input costs in a falling price environment.” It should concern buyers who planned to look to the new home market in search of lower mortgage rates or other perks. While the typical homeowner might be unwilling to shoulder costs to lower a buyer’s mortgage rate or upgrade their countertops, builders often do to keep homes selling, even at the expense of their margins. In July, 62% of builders responding to an industry survey said they offered some sort of sales incentive, the National Association of Home Builders said last month. A pullback in housing starts could be a sign that the days are numbered for widespread discounts on new homes. That could be a plus for investors, but presents more hurdles for buyers. “The recent builder pullback does not bode well for closing large persistent housing deficits,” Divounguy said. Employment and Inflation Data President Donald Trump might not be happy with the latest jobs report. But it gave those shopping for a lower mortgage rate reason to celebrate. July’s weaker than anticipated jobs report and prior months’ revisions shocked markets—and dragged down mortgage rates in the process. Mortgage rates tend to move with the 10-year Treasury yield, which dropped in the wake of the employment report. On Tuesday, the yield was at its lowest level since April 30. The decline looks to have shaved nearly 0.2 percentage point off mortgage rates, according to Mortgage News Daily readings. The website’s survey was showing a 30 year fixed rate of 6.58% on Tuesday, down from 6.75% on Thursday. Because of the close connection between home financing costs and economic indicators, employment and inflation data bears watching from here. Signs of a strong economy and rising prices, such as hotter-than-expected inflation data or strong jobs numbers, could send mortgage rates back up. But weak readings, like last week’s employment data, could drive them lower. It could take time—and sustained declines—to dramatically change demand. Mortgage applications during the week ended last Friday rose a seasonally adjusted 2% from the week prior. “Small movements have not unleashed the pent-up demand,” notes Jessica Lautz, the National Association of Realtors’ deputy chief economist. But “if mortgage rates dropped, there would be a considerable increase in housing demand,” she says.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "Correction is an ugly word to ~~bagholders~~ homeowners and investors. The market, especially in the sunbelt, melted up beyond where willing buyers can get approved for. What they can afford wasn’t really the brick wall, but when lending standards changed and they can’t get approved for it, the market starts to correct. Liquidity, not rates themselves are the issue. Also, buying an already overpriced house and putting money in it to flip it above what the neighborhood will actually support seems like a game people lost at before, this time the banks won’t get their hands dirty. In my area, nobody will build anything because of the timeline. There’s long timelines for getting work done whether it’s cheap or expensive lately, and if it costs you more to build, you want maximum return because you can’t shorten your cycle time and get it finished to get a return. Things have melted up too far, and the talking heads are telling you the gravy train will get going again with just a slight change. When most places are 40%+ over “normal”, 10% off that isn’t a deal to the buyer. It’s a problem when that’s where your available inventory is.",
                "author": "oldsmoBuick67"
            },
            {
                "raw_content": "Is 295 days on the market a sign?",
                "author": "HighStreetHo"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Milwaukee Is Holding Up Better Than Any Other Major U.S. Housing Market, Las Vegas is Cooling the Fastest",
        "score": 92,
        "text_content": "",
        "comments": [
            {
                "raw_content": "* The majority of America’s most resilient housing markets are located in the Rust Belt and are seeing an increase in home sales and prices. * The fastest-cooling U.S. markets are concentrated in Sun Belt states, where soaring inventory is causing prices to fall in some places. The U.S. housing market has been losing steam due to high homebuying costs and economic uncertainty, but some areas—particularly the Rust Belt— are proving more resilient than others. Milwaukee is holding up better than any other major U.S. housing market, with home sales up 12% year over year, prices up 8.2%, and the typical seller fetching more than their list price. It’s followed by another Midwest hub: Chicago, which in addition to rising prices and sales is seeing a drop in inventory and an uptick in market speed—also signs of a resilient market. Rounding out the top 10 list are Philadelphia, Minneapolis, New York, Cincinnati, Detroit, Newark, NJ, Pittsburgh, and Virginia Beach, VA. Rust Belt Housing Markets Are Holding Up Best This is according to a Redfin analysis that ranks U.S. metropolitan areas based on year-over-year changes in the following metrics as of June 2025: homes sold, median sale price per square foot, share of homes that went under contract within two weeks, average sale-to-original-list price ratio, median days on market and inventory. Redfin analyzed the 50 most populous U.S. metropolitan areas and included in this analysis the 49 with sufficient data (Kansas City, MO is the metro excluded). Here are a few traits the metros holding up best have in common: * Location: Six of the 10 metros holding up best are in the Rust Belt, whereas the fastest-cooling metros—which we focus on in the final section of this report—are concentrated in the Sun Belt. The Rust Belt, a once-booming steel manufacturing region that grappled with decades of economic decline, is experiencing less out-migration than it has in recent years as the pandemic-era population shift to the South slows. * Affordability: Home prices are up 5.9% year over year on average across these 10 metros holding up best, compared with a nationwide gain of just 0.5%. Still, most of these metros have prices lower than the national median. Affordability often begets home-price growth because buyers are drawn to affordable places when housing costs are elevated. That said, affordability is relative; many locals have been priced out of Rust Belt markets and would no longer consider these places affordable. * Rising demand, relatively small gains in supply: Home sales are up 6.4% year over year on average in these 10 metros versus a nationwide gain of 3.8%. Inventory is up 7.3%, compared with a nationwide gain of 11.8%. While supply is rising, it’s still historically low in many of these metros. Limited supply paired with solid demand can fuel homebuyer competition and buoy prices. In general, the housing markets holding up best are markets where sellers likely have the upper hand, while the markets cooling fastest are more likely to be buyer’s markets where sellers may be open to negotiation. Milwaukee Homes Are Attracting Bidding Wars, Selling for Above the Asking Price “Is our market white hot? No. But is it red hot? Yes,” said W.J. Eulberg, a Redfin Premier real estate agent in Milwaukee. “Unlike much of the country, Milwaukee is not a buyer’s market. While homes no longer get 15 offers and sell for $80,000 over the asking price like they did during the pandemic, they still get snapped up quickly because we continue to face an inventory shortage.” Eulberg recently had a listing in South Milwaukee that went live on a Thursday and got an offer within three hours. By Saturday, the seller had seven offers. The home ended up selling for about $50,000 over the $256,000 list price because it was fairly priced, in good shape and in a decent location, he said, adding that Milwaukee’s proximity to Chicago is a selling point for many buyers. Milwaukee’s inventory shortage is being driven by a variety of factors. Many homeowners are hesitant to put their houses on the market because they don’t want to lose the ultra-low mortgage rate they scored during the pandemic—a trend that rings true across the country. The Midwest (and Northeast) have also been building fewer homes than the South and West, which are now seeing home prices fall in some areas amid a pileup of inventory. There’s not much room left to build in Milwaukee proper, Eulberg said, and many of the homes that have been built in the area recently aren’t priced for the typical first-time buyer. Las Vegas Is the Fastest-Cooling U.S. Housing Market Las Vegas is cooling faster than any other major U.S. housing market, with home sales down 10.2% year over year and inventory up a whopping 44.8%—the largest gain among the metros Redfin analyzed. Prices in the pandemic boomtown are unchanged from last year, but the typical home fetches roughly 4% less than its list price. It also takes 51 days to sell—15 days slower than last year. By comparison, the typical U.S. home takes 40 days to sell—just six days slower than last year. “Buyers have more inventory to choose from than they’ve had in years, so they feel like they can take their time. Even when they find a home they really like, they often wait to find something better,” said Cherra Bergman, a Redfin Premier real estate agent in Las Vegas. “House hunters are cost-conscious because mortgage rates are high, so many are opting for new-construction homes since builders here are offering great incentives like mortgage-rate buydowns and money toward closing costs in order to offload inventory.” Sacramento, CA is the second-fastest-cooling housing market, followed by Denver, Fort Lauderdale, FL, Orlando, FL, San Diego, Miami, Seattle, Washington, D.C. and Oakland, CA. Many of these metros are home to Sun Belt cities that exploded in popularity during the pandemic, and in turn experienced a surge in home prices and homebuilding. Now, these markets are slowing because the number of homes for sale is rising but there are fewer people who can afford to buy them. This narrative is especially strong in Florida, which is also grappling with increasing natural disasters and soaring insurance and HOA costs. Three of the 10 metros cooling fastest are in Florida, and three are in California, which faces an especially intense housing affordability crisis. Prices are now declining in a handful of the fastest cooling markets, down 4.6% year over year in Oakland, and down roughly 1%-2% in Denver, San Diego, Orlando and Fort Lauderdale. In most of these metros, inventory is posting double-digit increases, which causes homes to sit on the market and empowers buyers to negotiate. On average, less than one-third (30.3%) of homes in the 10 metros cooling fastest sell within two weeks, compared with 38% nationwide.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "As someone born and raised in Milwaukee I’m so confused by why our housing market has been so hot the last couple years. The city has its charms but personally I just don’t think we are at all worth this amount of hype and competition, I would move away if all my family didn’t live here.",
                "author": "GoodTwin94"
            },
            {
                "raw_content": "Been watching the Vegas market for the last eight months. Listings with sellers who think they can fetch 2022 prices are just sitting. Flippers who paid top dollar late last year and then listed early this year are getting hammered with languishing listings and are forced to do six figure reductions. (YAY!) The post-pandemic run-up in Vegas was ridiculous: $300K homes becoming $500-$600K homes, $600-700K homes becoming $1M+ homes. Waiting out the summer to see how the market looks in the fall/winter and to find out who's really motivated to sell...",
                "author": "UnimaginativeRA"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "why are people here so bitter towards people selling homes ?",
        "score": 3,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’ve been visiting that sub a lot. Must have gotten my vibe. Many of those parroting about their hate of being hated, are the biggest problem with our American housing market. They want everything easy on their own terms. Fuck the lot of them.",
                "author": "Prestigious-Ice-2742"
            },
            {
                "raw_content": "i found the comments here pretty funny it’s like a venting session for nearly out-of-work realtors, ‘investors’ who are in the process of being slow-roasted alive, and frightened housepoors remember *love letters*? lol. we are in for some prime entertainment",
                "author": "acqua_di_hoomertears"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Resiliency Continues Across the U.S. Apartment Market",
        "score": 16,
        "text_content": "",
        "comments": [
            {
                "raw_content": "FUCK REALPAGE ESPECIALLY AS A NEWS SOURCE",
                "author": "8P8OoBz"
            },
            {
                "raw_content": "High supply relative to demand = softer rental market BUT it seems that high supply is meeting high demand so absorption is strong while rent growth remains weak until supply is absorbed. It’s really simple economics. Supply won’t turn on again until rents move up to make development economically feasible - high construction costs plus tariffs coupled with higher rates on debt and higher equity return hurdles will keep supply low until the numerator (rents) increases.",
                "author": "Beginning-Mud9676"
            },
            {
                "raw_content": "The U.S. apartment market saw occupancy and rent growth continue to hold steady in July, motivated by falling supply and mounting demand. For the second consecutive month, U.S. apartment occupancy registered at 95.5%, according to July data from RealPage Market Analytics. That was down just a shade from the peak of 95.6% from April and May, and just a shade above the market’s five-year average of 95.4%. Year-over-year, occupancy was up 140 basis points (bps). Effective asking rents were up 0.2% year-over-year across the U.S. While any rent growth at all after the historic supply wave the country just came through is impressive, this was the market’s lowest annual price increase in 10 months. Thus, operators continue to preserve occupancy at the expense of pushing prices. Aiding in the ability to preserve occupancy, apartment demand keeps hitting new highs. The nation recorded record absorption of over 794,000 units in the year-ending 2nd quarter, topping the peaks from 2021 and 2022. While supply volumes remain robust in historic terms, they are declining rapidly. Over 535,000 units were completed across the U.S. in the year-ending 2nd quarter. While that volume easily stands above the nation’s long-term average, it came in below the all-time high recorded just two quarters ago. Ongoing construction volumes have come down every quarter since peaking in early 2023 and, as of 2nd quarter, hit a decade low. At the same time, multifamily permitting has waned. Moving forward, this could help firm up occupancy and inspire the return of rent growth. The Northeast and Midwest remain the nation’s occupancy leaders, with rates of 96.8% and 96.4%, respectively. The West region is holding tight at 95.5% alongside the nation overall, while the South – where supply volumes have been the most extreme – has the most vacancies, with occupancy at 94.8%. Markets with the Most Rent Growth Tech-heavy coastal markets like San Francisco, New York and San Jose were among the largest 50 apartment markets with the most rent growth, with prices climbing 3% to 7% in the year-ending July. Other markets with big rent growth in the past year include Chicago, Pittsburgh and Cincinnati. Tourism Markets See Weakness Meanwhile, markets that saw the deepest rent cuts in the past year were those that depend on tourism, such as Orlando, Nashville and Las Vegas. Softness in tourism-dependent markets can be an early sign of economic weakness as consumers tighten discretionary spending on travel. Other markets that continue to see deep rent cuts are supply-heavy areas like Austin, Denver, Phoenix and San Antonio. Click below to view all the table data on rents- https://www.realpage.com/analytics/july-2025-data-update/",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Genie 3 turns Veo 3 generated drone shot into an interactive world you can take control mid-flight",
        "score": 2412,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Insanity",
                "author": "Baphaddon"
            },
            {
                "raw_content": "My quest 2 headset is ready for this.",
                "author": "junior600"
            },
            {
                "raw_content": "Damn, I want to simulate my kitchen and wash the dishes there",
                "author": "Sad_Comfortable1819"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "what does sam mean by this??",
        "score": 653,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It means people are searching for leaks in Alderaan places",
                "author": "Sapien0101"
            },
            {
                "raw_content": "This is what it means: His AI has a critical flaw that can be exploited by some upstart hick from the outer rim which will result in the complete disintegration of their entire platform, but not before fucking up a bunch of other competitors’ platforms first.",
                "author": "GeeBee72"
            },
            {
                "raw_content": "I don't know man. On the eve of the biggest product launch of your life,you post the death star rising over the earth. That's one way to do it I guess. Maybe metaphor isn't his strong suit.",
                "author": "Gratitude15"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Sam Altman confirms the livestream tomorrow will be about an hour long.",
        "score": 397,
        "text_content": "Could we be getting more than just GPT-5? Sora 2 rumors from the death star image sam posted previously and a possible Disney partnership.",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/8l2zmgdpuihf1.jpeg?width=1284&format=pjpg&auto=webp&s=7edc3825366c91fb2d763601275cdae3f7becda0",
                "author": "tomatofactoryworker9"
            },
            {
                "raw_content": "One day there's going to be a live stream and they're gonna say they've achieved AGI",
                "author": "FateOfMuffins"
            },
            {
                "raw_content": "It will be streamed live from the Death Star",
                "author": "socoolandawesome"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Mark's next target: Genie's dev team",
        "score": 3084,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Remember when the NFT bros told us to buy real estate in the metaverse because it was the future and then it ended up looking like a shitty Dreamcast game https://preview.redd.it/vktp37mg9fhf1.png?width=1930&format=png&auto=webp&s=2fb2a3fc75054601e404ed3da4123353ac21aa9a",
                "author": "recallingmemories"
            },
            {
                "raw_content": "lol it is crazy to think they spent around USD 70 billion developing the metaverse. Imagine if they spent that money on AI R&D and infrastructure instead",
                "author": "fpPolar"
            },
            {
                "raw_content": "Hope everyone realizes there’s significant hardware technology required for this world building to be immersive. That’s really what meta has been working on - along with the software side which AI is now accelerating. This is fantastic for meta. Generative ai is key to the metaverse",
                "author": "typeIIcivilization"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "GitHub leaks GPT-5 Details",
        "score": 259,
        "text_content": "They deleted it but here’s the archived link: https://archive.is/IoMEg",
        "comments": [
            {
                "raw_content": "I wonder if there will be a GPT-5 Pro or otherwise something that Pro subscribers get over Plus",
                "author": "FakeTunaFromSubway"
            },
            {
                "raw_content": "Something interesting to me is that Claude Code is such a fantastic product. To me, OpenAI will need to respond to that product specifically for coding. Unless this model is so, so good that code editors and tools surpass all the agentic abilities of Claude Code - it could still be very close. For a company so focused on product, I’m surprised they have still not responded to this one.",
                "author": "braclow"
            },
            {
                "raw_content": "I’m excited to see which model they’ll use for auto completions. The current one is so good, it picks up the patterns almost perfectly even on somewhat large files it blows my mind every time.",
                "author": "rafark"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Genie 3 Is Insane🤯https://x.com/jkbr_ai/status/1953154961988305384?s=46",
        "score": 856,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No ficking way , they're playing with Genie inside Genie?????",
                "author": "Funkahontas"
            },
            {
                "raw_content": "Look what one of the researchers said… https://preview.redd.it/41qcsgc52ghf1.jpeg?width=828&format=pjpg&auto=webp&s=d2adcb2238f9072ecab79ff3eea6c71f8be1b342",
                "author": "TransitionSelect1614"
            },
            {
                "raw_content": "Please make the video even smaller. There is not enough black padding.",
                "author": "Fast-Satisfaction482"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "GPT-5 pro will be released too",
        "score": 86,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lets see the \"advanced reasoning\" of the model of cost similar to Gemini pro or Claude Sonnet. For me that is the key to verify their real progress",
                "author": "Sockand2"
            },
            {
                "raw_content": "![gif](giphy|KEYEpIngcmXlHetDqz)",
                "author": "141_1337"
            },
            {
                "raw_content": "I’m really glad GPT5 is available to Free, that’s good to see.",
                "author": "DarkBirdGames"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The Hype of Google Genie 3 is already bigger than of OpenAI OSS",
        "score": 550,
        "text_content": "Well played Google. Genie 3 is absolutely insane and came completely out of the Blue. Let‘s See if GPT5 Can live up to the Hype.",
        "comments": [
            {
                "raw_content": "not really a fair comparison though, one is just another LLM and the other is ground breaking generative ai technology, makes more sense to compare Veo 3 with Genie 3, which I'd argue the hype is fairly similar from the reactions we've seen so far.",
                "author": "ThunderBeanage"
            },
            {
                "raw_content": "Yeah well OSS is beaten by pre-existing open source models of its own size so...",
                "author": "THE--GRINCH"
            },
            {
                "raw_content": "Genie 3 is a much bigger deal than OSS. The more people have played around with OSS the worse it looks. Chinese models are still ahead when it comes to open source",
                "author": "ShittyInternetAdvice"
            }
        ],
        "subreddit": "singularity"
    }
]