[
    {
        "post_name": "A classic photo of Sir Evelyn de Rothschild making sure King Charles (then Prince Charles) knows who really runs the show. You can't just jab your finger at a British Royal like that. Unless you are above them.",
        "score": 49,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Do British royals have any real power?",
                "author": "Threaper666"
            },
            {
                "raw_content": "This guy died in 2022, not that they don't have large inbred families the same as the Royals.",
                "author": "yarg"
            },
            {
                "raw_content": "Rockefeller poured massive amounts of money into medical schools so they would focus on drugs, symptoms, and surgeries instead of root cause, prevention, nutrition, cheap or natural cures. Rockefeller has changed the healthcare system, the monetary system, and the education system.",
                "author": "tpactionchasethevote"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "They had their boot on your face for so long. This is not the same world anymore. President Trump is liberating you… whether you like it or not.",
        "score": 47,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We have to beat the demons.",
                "author": "Wupta"
            },
            {
                "raw_content": "President Trump kept his promise and drained the swamp. We can see em all, plain as day. The harder issue has always been removal.",
                "author": "airborne3502"
            },
            {
                "raw_content": "Very nice. But their funding isn’t drying up. It’s only slowed down. There are no high level arrests. So they’ll continue to subvert. Getting election reform is like pulling teeth. If the latest bill passes, it’ll be a miracle. We are fighting a war against an enemy with no morality. And this war will no be miraculously over when 2028 hits.",
                "author": "Filo76"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "THIS is the real story out of today's jobs report - Trump was handed an economy that was losing private sector jobs and adding gov't payrolls, but he successfully flipped the script, and one year later it's all private sector growth while cutting gov't jobs:",
        "score": 47,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"Government Jobs\" = learing centers",
                "author": "Dangerous"
            },
            {
                "raw_content": "We should do Elon's \"list 5 things you accomplished last week\" email, but for real with consequences, this time.",
                "author": "DonsChair"
            },
            {
                "raw_content": "bullshit. nothing's been cut.",
                "author": "yodayoda"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "IF this was MAGA forget about it.. would be non stop screeching",
        "score": 1040,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Mommy should face charges",
                "author": "magapatriot_pa"
            },
            {
                "raw_content": "I learned about Munchausen syndrome after seeing The Sixth Sense for the first time, and it seemed like such a horrific thing that must be so rare. I never thought I would witness this level of prevalence",
                "author": "cussword"
            },
            {
                "raw_content": "Normal 13 year old boy discovers Reddit. Four years later, same person is a 17 year old tranny shooting up a school. The mom is clearly an idiot as well, but there's autists that dug through his social media time line and the pivotal point was him finding Reddit.",
                "author": "anotherthing"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The SAVE America Act has PASSED the House and is now headed to the Senate!",
        "score": 905,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’ll say this. If literally nothing else, this is the MOST important thing Trump can do, it’s even more important than anything related to Epstein. If our elections become truly fair and citizen only, then we can always remove the pedos from government.",
                "author": "aaafirefly123"
            },
            {
                "raw_content": "Good luck to all of the world, this is the difference between the coming golden or dark age.",
                "author": "Meister_Bockmist"
            },
            {
                "raw_content": "will the Senate pass it?",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump Approval Is So High That Gallop Decides it will no longer measure presidential approval after 88 years",
        "score": 1353,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They are hoping nobody will notice. Fuck these worthless New World Order pieces of SHIT. They move the goalpost every single time. Thankfully for us, nobody really pays attention to any BS polls like this. Rasmussen is the only one I have *any* confidence in and that's primarily because the dude who does the polls goes on Infowars/Bannon all the time to explain shit.",
                "author": "ArizonaRepublic"
            },
            {
                "raw_content": "Trump is sitting at 36% approval on gallop I don’t think they are doing it because they want to not show his ratings.",
                "author": "WhatTheActualFuckS"
            },
            {
                "raw_content": "The idea that trumps approval is so high is nowhere near true. We havent gotten back even half the momentum we had going into summer last year.",
                "author": "ReallyGayMods"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Massie is a fucking asshole.",
        "score": 879,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He just voted yes for the SAVE America Act. https://www.thegatewaypundit.com/2026/02/breaking-us-house-votes-pass-save-act-require/",
                "author": "Seeker_17"
            },
            {
                "raw_content": "This post is false. Massie will be voting yes: https://ktxs.com/news/nation-world/rep-massie-says-he-didnt-vote-against-the-save-america-act-but-against-a-rule Whoever stickied this is being dishonest.",
                "author": "NUMBER_FIVE"
            },
            {
                "raw_content": "He voted no on a rules change. He voted yes to advance the save act. Y’all are falling for the propaganda",
                "author": "rextexMG"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Murkowski and Collins both come from states that have Ranked Choice voting and win by riding the fence.",
        "score": 896,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The fence is down. Republicans and Democrats both want election security. Just not politicians for some reason....",
                "author": "LostElf"
            },
            {
                "raw_content": "Murkowski and Collins are both trannies.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "When you win by write in and you're not even on the ballot, you've made a deal with someone in exchange for that win.",
                "author": "TooTrick"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: US House PASSES measure to OVERTURN President Trump's tariffs on Canada, 219-211. REPUBLICAN YEAs: Massie, Fitzpatrick, Newhouse, Kiley, Hurd, Bacon. Trump has threatened MAJOR primary challenges for any Republican voting against his tariffs. It now heads to the SENATE.",
        "score": 1213,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# FUCK THESE RINOS *VETO this BULLSHIT, Mr. President!* The man is the only person in our government with the exception of Clarence Thomas who has the people at heart.",
                "author": "ArizonaRepublic"
            },
            {
                "raw_content": "Veto",
                "author": "Yignuced"
            },
            {
                "raw_content": "219 people are more favorable to Canada vs the growth of America. I don’t get it.",
                "author": "j2daeww"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A witness testified under oath to Sen. @HawleyMO that over $60 MILLION in dark money has already flowed to funding the Minnesota riots This funding is coming from 14 groups, per @seamusbruner",
        "score": 469,
        "text_content": "",
        "comments": [
            {
                "raw_content": "DOOOOOOOOOOOOO something already! FFS, arrest people!!!",
                "author": "AgnesDomini"
            },
            {
                "raw_content": "BONDI YOU USELESS FUCK At this point she should be considered a co-conspirator",
                "author": "brainphreeze"
            },
            {
                "raw_content": "A witness testified under oath to Sen. @HawleyMO that over $60 MILLION in dark money has already flowed to funding the Minnesota riots This funding is coming from 14 groups, per @seamusbruner “Over $60 million, just according to the latest 990 disclosures. $60 million, at least 14 different groups.” Some of these 14 networks are: - Soros Network - the Arabella Funding Network - the Neville Roy Singham funding network - Tides - the Ford Foundation network - the Rockefeller funding network “These massive NGOs that have billions of dollars to spend on all kinds of coordinated protest or in this case riot activity,” Bruner said $60 MILLION is freaking INSANE. Time to start locking up the funders!",
                "author": "PiratePatriotParrot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "FTC chairman: Political bias in Apple News app may violate consumer protection laws",
        "score": 807,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Oh, definitely does. What’s this got to do with Ellen Degenerate?",
                "author": "Skogin"
            },
            {
                "raw_content": "May? MAY? It's nothing short of the digital version of Pravda.",
                "author": "LandscaperJuan"
            },
            {
                "raw_content": "What about EVERY OTHER FUCKING LEGACY MEDIA OUTLET.",
                "author": "HieronymusRekt"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Elon Musk: Please contact these senators to confirm that you want voter ID required in elections in America.",
        "score": 804,
        "text_content": "",
        "comments": [
            {
                "raw_content": "&#65038; # Sticky please u/-f-b-i- u/MODs &#65038;",
                "author": "BallotsOnRubysUSB"
            },
            {
                "raw_content": "Mitch McConnell? Yeah, how has that worked the last few decades? The guy isn't even there at this point. The lights are on and nobody's home.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "I don't understand this. You all voted for these RINOs. And then you lectured the ones who refused to. Sit in this and stew, you faggots. WTF is so hard about not voting for women or RINOs?",
                "author": "EgregiousPhilbin"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Democrat Rep. Lauren Underwood: \"Illegal aliens aren't voting in our elections!\" Literally a few days ago... An Illegal alien was CONVICTED in Massachusetts for illegally voting in the 2024 Presidential election. Democrats are LIARS completely incapable of telling the TRUTH about ANYTHING!",
        "score": 1086,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Democrats are like that abandoned kid raised by dogs. No humanity left in them. No reasoning skills, no communication. Just survival instincts and emotion.",
                "author": "GarlicFart1776"
            },
            {
                "raw_content": "They don't have to vote. That's the entire scam. It's all about the census representation. Don't get caught up in the odd illegal retard that actually voted. It's bigger picture about Democrats subverting Democracy by inflating EC votes in blue states by using a welfare magnet to attract living humans to count in the census. Somali-style fraud funds the networks, again, we all know this. What a fun game they're playing with our money.",
                "author": "over_it"
            },
            {
                "raw_content": "If they aren’t, then what’s the harm of taking measures to see that they dont?",
                "author": "booblitchutz"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Shills / Bots / Potatoes / Patotoes",
        "score": 403,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Did you hear Blumpf is in the Epstein files?",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "I want the left politically neutered. I want purple states freed from the yoke of tyranny thanks to voter ID. I want so many illegal immigrants deported that White America reverses its demographic demolition. I want practically all H1s sent back home so American kids can become doctors and tech leaders.",
                "author": "HorrorGameDev"
            },
            {
                "raw_content": "Don't let them distract you, shootings, trans, I dont care. I care about the Epstein files and justice served",
                "author": "barronwin"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Isadora Borges is now facing up to 10 years in jail for posting in Brazil that MALES can't be FEMALE... Talk about a MIND VIRUS plaguing the judiciary of the world thanks to mentally ill DemonRaturded and politically immature POS's!",
        "score": 988,
        "text_content": "",
        "comments": [
            {
                "raw_content": "She lookin for a green card? 😉",
                "author": "ilikehats"
            },
            {
                "raw_content": "People have no idea just how bad it is down there.",
                "author": "texas4ever"
            },
            {
                "raw_content": "This sick shit has to be stopped.",
                "author": "ColonelKlink"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Daily Mail tracked down alleged Charlie Kirk assassin Tyler Robinson's former roommate, Lance Twiggs. Twiggs, 22, is reportedly living with family in Texas. He was spotted with long, unkempt hair, a Taco Bell tee shirt, and a hardcover fantasy novel in a quiet suburban neighborhood, photos f",
        "score": 384,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">Former roommate Former furry fag lover.",
                "author": "Bythrfruitsyknow"
            },
            {
                "raw_content": "Should be in jail. Was obviously involved",
                "author": "Tiger5468"
            },
            {
                "raw_content": "Talk about being scared straight",
                "author": "BasedCostanza91"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Tumbler Ridge shooter's ROBLOX account FOUND by Kiwi Farms Built mall shooting simulator modeled on REAL Canadian mall Account deleted, game still downloadable 'FOR ALL AGES' Source: RealSchlep",
        "score": 371,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Roblox, meeting place of # TROONS and PEDOS",
                "author": "MississippiRepublic"
            },
            {
                "raw_content": "Wow never seen RT get stickied before but im alright with it",
                "author": "EdgyUsernamexX69Xx"
            },
            {
                "raw_content": "Does that cake say “queer Boy”??",
                "author": "cuntard"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Greg Bovino to JB Pritzker: Nah, gubner, too busy leading agents to arrest illegal aliens. Besides, Chicago may need another double digit drop in a whole smorgasbord of violent crime, compliments of the Green Machine. Perhaps we could meet for a sugar-free slice of heirloom apple pie -on me!",
        "score": 527,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The troll is strong in this one",
                "author": "SteveBannonsNckbeard"
            },
            {
                "raw_content": "Pritzker must go",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "The only words he heard were \"smorgasbord\" and \"pie\"",
                "author": "magapatriot_pa"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "After an entire day and IMMENSE pressure, Canadian authorities have finally CONFIRMED yesterday’s mass school shooter was TRANS",
        "score": 1427,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fucking Canada. An absolute clown show. They are forever going to be stuck in pre-2016 wokeness, aren't they? Lots to still fix in society, but I'm glad we don't have to do *this* dance of the 'tards anymore.",
                "author": "LISTEN_FAT_"
            },
            {
                "raw_content": "Tranny on SSRIs. I’ll bet on it. This has happened enough I know someone who was taking them for anxiety to swear off.",
                "author": "Snek_Plissken"
            },
            {
                "raw_content": "Stop grooming and trooning out kids. Sick, evil fucks.",
                "author": "ColonelKlink"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "We're all Gunpersons now, per the MSM",
        "score": 940,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Gunperson in a dress with a serious mental disorder.",
                "author": "JtBlaze"
            },
            {
                "raw_content": "1984 level of deception.",
                "author": "boreal_storm"
            },
            {
                "raw_content": "Hot off the libtard press!",
                "author": "TruculentGoose"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Our testing shows the Ryzen 7 9800X3D can match the pricier Ryzen 7 9850X3D with simple PBO settings — AMD's latest CPU can't leverage extra clock speed in games",
        "score": 121,
        "text_content": "",
        "comments": [
            {
                "raw_content": "FYI not all 9800X3D's can run a +200Mhz offset.",
                "author": "SJGucky"
            },
            {
                "raw_content": "No shit? If you needed this article to tell you you can close a 2% performance gap by overclocking a little....you need help",
                "author": "Jaz1140"
            },
            {
                "raw_content": "TLDR: \"We retested the Ryzen 7 9800X3D and 9850X3D with PBO turned on and a positive 200MHz boost clock override for both CPUs, to see how that impacted gaming performance, efficiency, and clock speeds. In short, the Ryzen 7 9800X3D can make up the thin margin between it and the Ryzen 7 9850X3D. AMD’s latest chip, however, has little to gain from even more clock speed, at least in games...Especially below $450, it’s hard to justify the Ryzen 7 9850X3D over the 9800X3D when the latter offers almost identical performance with PBO enabled. And, although the Ryzen 7 9850X3D can climb higher, that extra clock speed doesn’t amount to much in games — in our suite, it amounts to 0.9%.\"",
                "author": "Antonis_32"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "NVIDIA RTX 6000D with 84GB GDDR7 memory appears in first teardown video",
        "score": 46,
        "text_content": "",
        "comments": [
            {
                "raw_content": "14/16 memory channels. 448-bit bus. Bring on more weird sizes. 21GB 224-bit. 18GB 288-bit. I want more oddballs.",
                "author": "Affectionate-Memory4"
            },
            {
                "raw_content": "China gets all of the fun stuff",
                "author": "jenny_905"
            },
            {
                "raw_content": "Given the existing RTX Pro family pricing structure, this will be $7 cheaper than the full 96GB RTX Pro 6000. At least it’s weird and interesting!",
                "author": "pinmux"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "HP Now Lets You Rent a Gaming Laptop, Starting at $50 Per Month",
        "score": 97,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Man, are we this bad off?",
                "author": "UltraAware"
            },
            {
                "raw_content": "$50 a month for a 4050? That's terrible.",
                "author": "trisanachandler"
            },
            {
                "raw_content": "Absolutely terrible deals. You would be far better off simply financing a laptop through Affirm or whatnot instead, if for some reason you desperately need a laptop right now. For example HP wants $50 a month to rent the basic model, while you could easily finance a similar or better machine for \\~$70 a month or so for a year. And then you would own the machine, while you would still be renting the HP (and have to give it back after the rental expires). And HP is requiring a minimum of a 650 credit score to do these rentals, so anyone who qualifies would also probably qualify for those short term loans.",
                "author": "GenericUser1983"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung and SK hynix shorten memory contracts as pricing power shifts back to suppliers — both companies now at 40-50% operating margins",
        "score": 31,
        "text_content": "",
        "comments": [
            {
                "raw_content": "how about you two renegotiate with AI companies ~~OpenAI~~ contract let them bid the price and pay at market price. if These AI companies do not agree, just de-prioritize their supply.",
                "author": "hackenclaw"
            },
            {
                "raw_content": "Hello restorativemarsh! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Applied Materials to pay $252 million to resolve illegal chip exports, US says",
        "score": 20,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Applied Materials itself appears to not have acknowledged this US Department of Commerce claim: https://www.appliedmaterials.com/eu/en/news-and-media.html",
                "author": "Boreras"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nova Lake-S bLLC CPU tile reportedly 36% larger than standard tile",
        "score": 171,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I mean that's not the interesting part IMO. It's the fact that the NVL-S compute tile is rumored to be almost 50% larger than Zen 6's compute tile. The NVL-S tile is supposed to be 8+16, but this should still be around the same area as a 12 P-core tile, all else being equal.",
                "author": "Geddagod"
            },
            {
                "raw_content": "The size of the compute and the LLC on TSMC N2... It's surely expensive and low-volume.",
                "author": "J05A3"
            },
            {
                "raw_content": "Isn't increased size caused by the fact that every tile needs interconnects and eventually die area explodes when every tile needs it.",
                "author": "Different_Lab_813"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "How a SK Hynix became Nvidia's vital AI ally",
        "score": 10,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel iGPU Generational Performance from 8th gen to Arc B390 on Ubuntu 26.04 | Phoronix",
        "score": 29,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Despite being from 2009, Unigine Heaven is such a timeless benchmark.",
                "author": "AlbiteTwins"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung to develop custom HBM with computing core",
        "score": 44,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We did it boys. We made RAM even more expensive.",
                "author": "floorshitter69"
            },
            {
                "raw_content": "This has potential to be huge in the long run as latency is one of the major bottle necks to get AI to the next level. Should be interesting to see how this plays out.",
                "author": "ML7777777"
            },
            {
                "raw_content": "Between adding a computing core to HBM and the zHBM (stacking HBM packages) that they talk about in the article I can't imagine the yield for this setup is going to be any better than what they're doing now. How are they doing with building more fabs... because they're going to need them. I will say, this is an incredible tech jump. I just hope it trickles down to the consumer in some capacity. If we can afford it, that is.",
                "author": "howaboutbecause"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Just cannot get my Switch 2 to display 120fps, no matter what settings I tweak..",
        "score": 158,
        "text_content": "I spent over an hour troubleshooting both the Switch 2’s and my TCL Q7 (2023 model)’s settings, only to have zero success; I cannot get the fps counter to show anything other than 60fps. The game I’m trying to play in 120fps is silksong, which is definitely capable of doing so. My resolution is 1080p, the 120hz toggle is turned on, all of my tv’s settings are set, and yet it just won’t work. Is there something I’m perhaps missing? I’m using the hdmi cable that came with the switch 2 itself, so that shouldn’t be a problem either. I’m plugged into HDM1, which supports up to 144hz/fps. Starting to think there may just be a problem with my switch 2, that I’ve had since launch day. If you have any insight as to what could be going wrong, please do let me know. Quite frustrating to not be able to play with the settings I should be able to. Thank you for your time! MASSIVE edit 1: Folks, I apologize - I didn’t have the switch 2 edition installed. Holy hell. Sincerely, totally my fault. Sorry for any time of yours that I may have foolishly wasted! I’ll take my downvotes in stride on this one 😅",
        "comments": [
            {
                "raw_content": "Jesus, that edit. Rip to all who tried to help.",
                "author": "EliteSalesman"
            },
            {
                "raw_content": "Did you turn on the setting in silksong options? I saw a similar option for hollow knight in settings called tv frame rate perhaps or something ?",
                "author": "RickDeckard31"
            },
            {
                "raw_content": "I got here after the edit. Lmao.",
                "author": "LonkToTheFuture"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Mario Tennis Fever Version 1.0.1 is now available",
        "score": 99,
        "text_content": "[English Patch Notes](https://en-americas-support.nintendo.com/app/answers/detail/a_id/68671) **General:** * Several issues have been addressed to improve the gameplay experience.",
        "comments": [
            {
                "raw_content": "This arrived early yesterday so I’ve been playing it with my kids. It’s quite fun. It feels easier to get into for kids, they struggled a bit with Aces. The Fever rackets are chaotic and fun, and it’s nice you can toggle them on/off. There’s quite a bit of stuff to unlock and the game tells you exactly what you need to do to get it, so if my kids want a certain Yoshi color, for example, they know what to do to go unlock it. I’d like to see alternate costumes added for more characters though, right now there’s only a few alternate color options for some characters. The other thing I’d like to see patched is in a random button for selecting Fever rackets. You can randomize everything else but those for some reason. I got this for $60 due to the recent Target sale so I feel like this will be worth the price, it’s pretty feature complete, but I wouldn’t mind a few free updates like Aces got.",
                "author": "wookiewin"
            },
            {
                "raw_content": "I have no more money 😭",
                "author": "Internal-Judgment737"
            },
            {
                "raw_content": "People talking about the price… is 5€ more than Mario Tennis Ace in my country. When a Mario Tennis was 40?",
                "author": "Technical_Split_6315"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Pokémon Pokopia Will Take 20-40 Hours to Beat on Average, and There's More After the Credits, Says Director",
        "score": 402,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It never struck me as a game that you could beat",
                "author": "AgentSkidMarks"
            },
            {
                "raw_content": "Well yeah, it will be like Dragon Quest Builders.",
                "author": "Skelletonike"
            },
            {
                "raw_content": "Just a clickbait headline trying to draw clicks. It has a story to beat, that's it. The game is still open ended and you don't have to just do the story and quit",
                "author": "Wipedout89"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Damn diablo 2 resurrected just got a new paid DLC, yes its on switch as well.",
        "score": 71,
        "text_content": "Kinda crazy actually after 20 years diablo 2 got a new character. Im probably underselling it as it has a lot of new endgame stuff as well as new items and QOL stuff. 25$ is steep though. Will you be picking it up? I did but then I love diablo 2.",
        "comments": [
            {
                "raw_content": "Wish there was a switch 2 edition tho... :(",
                "author": "DredgenGrey"
            },
            {
                "raw_content": "Why wouldn’t they update it for switch 2 as well lmao so weird",
                "author": "Aeonyyx"
            },
            {
                "raw_content": "I have it on PS5, but wish that I had it on NS2, I would play it more I think. But damn, $25 does feel steep for this DLC.",
                "author": "C-Towner"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nooooo YOSHI!!!",
        "score": 23,
        "text_content": "",
        "comments": [
            {
                "raw_content": "![gif](giphy|W8wI3cdqEUZq0)",
                "author": "guessimcooking"
            },
            {
                "raw_content": "Love the frame rate, or is it slomo?",
                "author": "sakahn"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Mario Tennis Fever NSO icons are now available",
        "score": 37,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hand up and no belly showing in a polo. He really is super.",
                "author": "VaughnFry"
            },
            {
                "raw_content": "Cool.",
                "author": "Dear_Meeting_1258"
            },
            {
                "raw_content": "Where’s my boy bowser jr? :(",
                "author": "minna_minna"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Should i buy ACNH, Pokopia, or Tomodachi Life?",
        "score": 127,
        "text_content": "i want to buy one of these games, and i know they are all in the same genre and are pretty comparable",
        "comments": [
            {
                "raw_content": "New Horizons if you like logging in daily, Tomodachi Life if you want more humor, and Pokopia if you're a Pokemon fan. Judging isn't that fair due to how only one of these has released, however",
                "author": "JakobDa1"
            },
            {
                "raw_content": "ACNH is a day-to-day life sim. Tomodachi Life is a world you build and observe. Pokopia seems to be a Pokemon farm sim with decoration elements",
                "author": "darkfawful2"
            },
            {
                "raw_content": "Yes.",
                "author": "Odd_Philosopher1286"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Games I want to see get Nintendo Switch 2 editions",
        "score": 77,
        "text_content": "https://preview.redd.it/pjbl14tgywig1.jpg?width=450&format=pjpg&auto=webp&s=b074fccc7c2c8ad0384da8df2b0905b430edbd8d https://preview.redd.it/uzfxtjr9ywig1.jpg?width=462&format=pjpg&auto=webp&s=59e5e366d16f5e367f736b47b0ea435d3ed5ed5b https://preview.redd.it/osfs2ju6ywig1.jpg?width=439&format=pjpg&auto=webp&s=53d4451e88977b32e3c670da354b5d133b6f05b0 https://preview.redd.it/dxewcrodywig1.jpg?width=447&format=pjpg&auto=webp&s=2a51c6b41d8ea7b90c3bca2777680a89ae14f38a",
        "comments": [
            {
                "raw_content": "All the Xenoblade games. Gimme those Switch 2 Editions.",
                "author": "Gen_X_Gamer"
            },
            {
                "raw_content": "Give me Rollercoaster Tycoon with mouse controls already.",
                "author": "dhol54"
            },
            {
                "raw_content": "Monster Hunter Rise+Sunbreak, for me. Gimme the 4k/60fps goodness!",
                "author": "Playful_Lecture7784"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "PSA My local library has S2 games!",
        "score": 11,
        "text_content": "Hi friends, one of our local libraries had Hades 2, Mario Party S2 edition to check out. I was kind of astonished at their selection. They had brand new movies, Omnibus of Berserk manga, Silent Hill F for PS5 as well. We went to a different one, and their selection was bunk, but it’s definitely worth checking out your local free libraries! Happy gaming!",
        "comments": [
            {
                "raw_content": "Yes, I work as a librarian and we have video games, board games, movies, comics, manga, etc. to borrow. You can even borrow a guitar!",
                "author": "SoligDag"
            },
            {
                "raw_content": "If you wanna see the full collection of games at your library system you have to check the online catolog and you cans have it sent to your home branch",
                "author": "thedeadp0ets"
            },
            {
                "raw_content": "Hello u/Physical-Fudge3359! Welcome to r/NintendoSwitch2! Your post has been sent to the moderators for review. To help manage spam, trolling, and repetitive posts, we restrict new posts from accounts that do not have much comment karma earned in this subreddit. Please contribute through comments on other posts in the meantime. If you are trying to ask about an issue with your Switch console or otherwise seeking help, you may want to check out the peer support community at r/NintendoSwitchHelp. You can find our rules here: https://www.reddit.com/r/NintendoSwitch2/wiki/rules *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NintendoSwitch2) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Highguard developer Wildlight Entertainment has just laid off most of its staff",
        "score": 1119,
        "text_content": "https://www.linkedin.com/posts/alex-graner-a37262114\\_alex-graners-resume-activity-7427480816940892161-hmDh/",
        "comments": [
            {
                "raw_content": "A few weeks after the launch? So what was the plan here then?",
                "author": "Zertylon"
            },
            {
                "raw_content": "Every game is make or break for companies these days. This industry has really gone to shit",
                "author": "NeroIscariot12"
            },
            {
                "raw_content": "The game had almost 100k concurrent on steam on launch, if the game was good more than 2k people would be playing right now. I wouldn’t blame Geoff because honestly nobody would’ve talked or cared about this game at all without the whole game awards “controversy”.",
                "author": "angelHOE"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Kingdom Hearts x Fortnite collab is now in development.",
        "score": 160,
        "text_content": "[**Source**](https://xcancel.com/AdiraFNInfo/status/2021766416450322544) There is no information on which character they will add to the game; it could be revealed in the next few months. I just hope the pickaxe will be a Keyblade.",
        "comments": [
            {
                "raw_content": "The character being added is Tetsuya Nomura who is actually the Master of Master of Masters",
                "author": "MyMouthisCancerous"
            },
            {
                "raw_content": "This is going to be so fucking dumb and I can't wait. Sora holding an assault rifle is going to be the funniest thing ever. It already cracks me up watching Marty McFly reload rifles like an experience tactical operator.",
                "author": "ToothlessFTW"
            },
            {
                "raw_content": "Please keep the goofy ass shoes. It would be so fucking funny",
                "author": "Nervous-Peppers"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Assassin's Creed Black Flag Remaster Art Book Listed on Amazon",
        "score": 450,
        "text_content": "[https://www.amazon.co.uk/Assassins-Creed-Black-Flag-Remaster/dp/1835417701#detailBullets\\_feature\\_div](https://www.amazon.co.uk/Assassins-Creed-Black-Flag-Remaster/dp/1835417701#detailBullets_feature_div) The listing names Titan Books as the publisher. Titan Books has a long history with Assassin’s Creed, having released many art books, official guides, and lore publications for the series since 2012.",
        "comments": [
            {
                "raw_content": "How the actual fuck have they not just announced this already This is getting oblivion remaster levels of worst kept secret",
                "author": "Arkhamguy123"
            },
            {
                "raw_content": "It says the book will be available March 24th. Could be our date",
                "author": "dajahat"
            },
            {
                "raw_content": "Please just fucking announce it Ubisoft",
                "author": "LedSpoonman"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Marathon confirmed to have a segment in the SoP by dev team.",
        "score": 61,
        "text_content": "[https://xcancel.com/gematsu/status/2021733829048737870/photo/1](https://xcancel.com/gematsu/status/2021733829048737870/photo/1) Previous: [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1r0a3ga/paul\\_tassi\\_suggests\\_that\\_marathon\\_will\\_show\\_up/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1r0a3ga/paul_tassi_suggests_that_marathon_will_show_up/)",
        "comments": [
            {
                "raw_content": "Please don't take up most of the SoP",
                "author": "Hayterfan"
            },
            {
                "raw_content": "Marathon > MLB > Saros > presumably Tokon in May-July Could see all four show up in some form. I guess Horizon Hunters Gathering will release this year as well? Probably the God of War metroidvania at some point. Then finish the year off with Wolverine as early as possible to avoid GTA VI. Decent year for Sony.",
                "author": "Careless_Main3"
            },
            {
                "raw_content": "I’m expecting this to take up at least 25% of the SoP lol",
                "author": "MissingLink000"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "NateTheHate on rumored 2D God of War: whispers of possible multiplatform consideration",
        "score": 507,
        "text_content": "NateTheHate commented on the rumored 2D God of War project and mentioned something interesting that i haven’t seen anyone posting about regarding platform plans. “All I can say is this: When talk of the 2D God of War first started last year, I heard whispers that it was being considered for a multiplatform release. Whether that consideration evolved into an active plan… I don’t know.” This doesn’t confirm anything, but it suggests that Sony has discussed a multi platform release at launch for a single player game internally at some point. Take with the usual grain of salt, until/if Nate confirms it. [ https://xcancel.com/NateTheHate2/status/2021355822207598991#m ](https://xcancel.com/NateTheHate2/status/2021355822207598991#m)",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "PS5/PC multiplatform or proper multiplatform?",
                "author": "NdibuD"
            },
            {
                "raw_content": "Can't wait for SoP",
                "author": "Jumpster_42"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Khu hints Pokémon Fire Red and Leaf Green will return soon",
        "score": 447,
        "text_content": "Link: [https://nitter.poast.org/Riddler\\_Khu/status/2021518874785841331#m](https://nitter.poast.org/Riddler_Khu/status/2021518874785841331#m)",
        "comments": [
            {
                "raw_content": "Fire Red and Leaf Green will return in Avengers: Doomsday.",
                "author": "Halil-Heyman"
            },
            {
                "raw_content": "Things I hope to leave behind in 2026: khou riddles",
                "author": "Joseki100"
            },
            {
                "raw_content": "Can this guy just go straight to the point instead of a bunch of stupid riddles? Nobody likes vague interpretations.",
                "author": "Ortana45"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Core Ultra 400 “Nova Lake” bLLC CPU tile reportedly 36% larger than standard tile",
        "score": 28,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm excited to see Intel's take on the large cache CPU segment AMD has been so so seeing as it covers 1 ccx and the current IO die is kinda pathetic for 2026. Zen6 x3D 12c CCX Vs Intel bLLC cache offering is gonna be super exciting. Intel has traditionally had better IMC, and RAM latency is super important for multiplayer FPS. Not gonna lie, next gen large cache CPUs at 12core complex have me hyped they will be a new tier above what we have right now. 20% faster than 9800x3d , perhaps more.",
                "author": "windozeFanboi"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD Software: Adrenalin Edition 26.2.1 Optional Update Release Notes",
        "score": 265,
        "text_content": "# Highlights * **New Game Support** * Yakuza Kiwami 3 & Dark Ties * Nioh 3 * **Fixed Issues** * Corrupted clouds may be observed while playing Arc Raiders on Radeon™ RX 9000 series graphics products. * Intermittent application crash may be observed when playing The Finals with ray tracing enabled on Radeon™ RX 7000 series products. # Known Issues * Intermittent application crash or driver timeout may be observed while loading a saved game in Cyberpunk 2077 with Path Tracing enabled. AMD is actively working on a resolution with the developer to be released as soon as possible. * Intermittent application crash or driver timeout may be observed while playing Battlefield™ 6 on AMD Ryzen AI 9 HX 370. AMD is actively working on a resolution with the developer to be released as soon as possible. * Intermittent application crash or driver timeout may be observed while playing Roblox Player (Car Zone Racing & Drifting) when task switching between media on Radeon™ RX 7000 series products. * Texture flickering or corruption may appear while playing Battlefield™ 6 with AMD Record and Stream on some AMD Graphics Products. * AMD FSR Upscaling and AMD FSR Frame Generation may show as inactive in AMD Software: Adrenalin Edition when playing Yakuza Kiwami 3 & Dark Ties and Call of Duty®: Black Ops 7 when enabled on Radeon™ RX 9000 series graphics products. * AMD Install Manager is unable to install Optional Drivers. Users are recommended to use the installation link available on this page.",
        "comments": [
            {
                "raw_content": "Is noise suppresion still broken?",
                "author": "Solid-Base9276"
            },
            {
                "raw_content": "The install manager is unable to... install things? What",
                "author": "mycheese"
            },
            {
                "raw_content": "Add FSR 4 for 7000 series gpu",
                "author": "mate222"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "FHA mortgage demand rises as borrowers face affordability challenges",
        "score": 52,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How much did the mortgage demand increase? .01%?",
                "author": "NawwwRonald"
            },
            {
                "raw_content": "Could be good news, more first time homebuyers in the market.",
                "author": "ThemeBig6731"
            },
            {
                "raw_content": "“FHA purchase and refinance applications increased, helped partially by the FHA rate declining and remaining 20 basis points lower than the conforming 30-year fixed rate,” said Joel Kan, vice president and deputy chief economist at the MBA. “Borrowers are increasingly utilizing FHA loans as affordability challenges remain, despite recent improvements.” This is a sign that *first time home buyers* are about to enter the market as FHA loans are designed for just that. FHA typically only requires a downpayment of 3.5% for low to middle income consumers.",
                "author": "RealisticForYou"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "US Consumer Delinquencies Jump to Highest in Almost a Decade",
        "score": 18,
        "text_content": "I’m too poor to pay for article access- I thought I saw 12.7% delinquency rate?",
        "comments": [
            {
                "raw_content": "Archived Link: https://archive.vn/VmSjW > Overall household debt balances climbed 1% from the previous quarter to $18.8 trillion, the report showed. The share of credit-card loans that were at least 90 days delinquent rose to 12.7% — the most since the first quarter of 2011 — and the share of auto loans in serious delinquency climbed to 5.2%, just shy of the record reached in 2010. > Some 16.3% of student-loan debt became delinquent in the fourth quarter, the biggest increase on record in data going back to 2004. Not great",
                "author": "scotchtapeman357"
            },
            {
                "raw_content": "All different rates for multiple loan types. Student loans are the worst performing which generates this high average headline number, the rest are fine.",
                "author": "JustBoatTrash"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Powell’s parting gift from the Fed may be more rate cuts than expected, courtesy of deteriorating data",
        "score": 6,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "gen-x-millennials-set-to-inherit-trillions-in-real-estate-wealth",
        "score": 0,
        "text_content": "https://www.housingwire.com/articles/gen-x-millennials-set-to-inherit-trillions-in-real-estate-wealth/ I’m trying to prepare my narrative for when the Boomers all die and Gen X and Millenials inherit their real estate wealth. Is Gen Gamma going to call us Greedy?",
        "comments": [
            {
                "raw_content": "Its going to the nursing homes, we will never see a dime",
                "author": "The_F1rst_Rule"
            },
            {
                "raw_content": "unless their parents yolo with all inclusive senior homes",
                "author": "tasty_meatballs69"
            },
            {
                "raw_content": "I’m confused, are Boomers still greedy if their wealth will all be spent on long term care?",
                "author": "Positive-Yellow-6373"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "A Direct Message From AI To All Humans (Seedance 2.0)",
        "score": 1022,
        "text_content": "I think its game over for hollywood. They won't escape this. I predict all wide zoomed out overhead background cinematic shots, vfx and background greenscreen shots will be done by AI by the end of next year. Am I right or wrong?",
        "comments": [
            {
                "raw_content": "\"make me a dramatic video of Walter White saying an eerie line ... while shopping for febreeze in a supermarket\"",
                "author": "NewChallengers_"
            },
            {
                "raw_content": "JESSE JESSE JESSE",
                "author": "Setsuiii"
            },
            {
                "raw_content": "Buddy, I'm really curious how will capitalism survive AI, more then about Hollywood",
                "author": "cockybannana"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Elon Musk statement regarding the departure of some xAI employees in the last two weeks.",
        "score": 338,
        "text_content": "Seems like some employees had to go. Not sure if they were fired, what's your opinion?",
        "comments": [
            {
                "raw_content": "Elon claiming he fired them almost certainly means they quit, probably not amicably.",
                "author": "AdAnnual5736"
            },
            {
                "raw_content": "The classic \"you didn't break up with me I broke up with you\" But all things considered this was more mature than I would expect from Musk.",
                "author": "Tomi97_origin"
            },
            {
                "raw_content": "Mass drivers? They have been outlawed by every civilized planet!",
                "author": "CoolStructure6012"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "NVIDIA appears to be standardizing on OpenAI Codex",
        "score": 182,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Codex actually reads my thoughts and develops my apps before I even want them",
                "author": "nekronics"
            },
            {
                "raw_content": "I despise OpenAI's conversational models but I've gotta admit Codex is fucking cracked. In a way I wish I hadn't tried it out, now when the limited free availability ends I'll probably have to start paying for Plus. Can't imagine working on any project without this thing now.",
                "author": "nihiIist-"
            },
            {
                "raw_content": "I doubt they’re standardizing, just making it available. NVidia devs likely have most any tool they want to use at their disposal.",
                "author": "Belnak"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The Car Wash Test: A new and simple benchmark for text logic. Only Gemini (pro and fast) solved the riddle.",
        "score": 58,
        "text_content": "",
        "comments": [
            {
                "raw_content": "ChatGPT 5.2 also pointed out that the car needs to be there (with a cheeky \"obviously\"). SimpleBench has many common-sense questions like this.",
                "author": "micaroma"
            },
            {
                "raw_content": "It is interesting that the \"base\" version of GPT 5.2 Thinking doesn't get it, but you can see that there was no \"Thinking\" trace - i.e. the model, or router idk, decided it was a question that wasn't worth thinking about. The \"base\" version of GPT 5.1 Thinking got it right on first try though: https://chatgpt.com/share/698d870c-9c04-8006-9ec5-0afb91dcff6c The \"base\" version of GPT 5.2 Thinking behaved like yours and failed. However, if you literally just tell it to \"think carefully\", it passes no problem: https://chatgpt.com/share/698d87cb-a3c4-8006-be0f-890b2e592959 I have a project with custom instructions specifically for math, as I'm a math teacher, and it also passes without additional instructions there: https://chatgpt.com/share/698d8646-1ed0-8006-904e-e93ce9cee42a I simply think there is a *massive* capabilities overhang in how people use these models. Like, all of these \"base\" versions of these models within the chat interface have system prompts for instance, so it's not even a one to one comparison necessarily. You know that OpenAI hard ~~coded~~ prompted things like strawberry has 3 r's into the system prompt right? You can add your own system prompts that fix a bunch of these \"trick\" questions. There's entire agentic frameworks that people can use to push capabilities much higher out of \"base\" models, like that new math thing Google published yesterday.",
                "author": "FateOfMuffins"
            },
            {
                "raw_content": "GLM 4.7 running locally has solved it for me 10/10 times.",
                "author": "mxforest"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Lead product + design at Google AI Studio promises \"something even better\" than Gemini 3 Pro GA this week",
        "score": 366,
        "text_content": "",
        "comments": [
            {
                "raw_content": "probably that rumoured coding agent",
                "author": "kvothe5688"
            },
            {
                "raw_content": "3.1 pro preview: https://x.com/scaling01/status/2021710149057228933",
                "author": "my_shiny_new_account"
            },
            {
                "raw_content": "[Cool article in *The New Yorker* about Anthropic](https://www.newyorker.com/magazine/2026/02/16/what-is-claude-anthropic-doesnt-know-either). (Had to disguise it as a low-effort Twitter vaguepost for the mods.) This longform piece on Anthropic/Claude in The New Yorker surprised me. It's the first time I've seen AI coverage in a high-profile literary magazine be accurate. The author, Gideon Lewis-Kraus, even criticizes n+1 magazine editors for equating next-token prediction pre-training with autocomplete, which is a level of nuance I did not expect at all. And look at this: > Some of the most perceptive insights about the behavior of models came courtesy of the \"A.I. psychonauts,\" a loose cohort of brilliantly demented model whisperers outside Anthropic, who are shrouded in esoteric pseudonyms like Janus and Nostalgebraist. They cover interpretability experiments, Claude Plays Pokémon, the Claudius vending machine, effective altruism, the history of Anthropic and deep learning at large ... It's almost bizarre that they let Lewis-Kraus take the story in this direction. It's basic stuff for the most part, but the coverage is positive. Unusual.",
                "author": "Hemingbird"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Google Gemini 3.1 Pro Preview Soon?",
        "score": 144,
        "text_content": "GOOGLE MIGHT BE PREPARING GEMINI 3.1 PRO PREVIEW FOR RELEASE! The same reference has been spotted on the Artificial Analysys Arena earlier. Source: x -> testingcatalog/status/2021718211662614927 x -> synthwavedd/status/2021707113177747545",
        "comments": [
            {
                "raw_content": "Thursday seems likely. (from Google DeepMind employee). https://preview.redd.it/ahb6utllcyig1.png?width=1304&format=png&auto=webp&s=f43ff5d98b60d46e413f05d2943fc2a917dfba7e",
                "author": "Successful-Earth678"
            },
            {
                "raw_content": "hopefully it'll have some of the RL magic flash 3.0 got. And is less sycophantic and prone to hallucinations",
                "author": "Purusha120"
            },
            {
                "raw_content": "the competition is wild right now. Google can't sit on a model for more than a month before something else leapfrogs it. good problem to have if you're a user, terrible if you're paying $200/mo and the model keeps getting worse between updates.",
                "author": "m2e_chris"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini Deep Think: Redefining the Future of Scientific Research (New updates on Alethia, their SOTA math agent, and work on Physics/Compsci automated AI research)",
        "score": 206,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/gdmje8iq7yig1.png?width=641&format=png&auto=webp&s=2ed4dfc7e6a46512ece34c8456fb40278c6baf5c",
                "author": "Bright-Search2835"
            },
            {
                "raw_content": "https://preview.redd.it/hipv5690nxig1.jpeg?width=2628&format=pjpg&auto=webp&s=dc420db849370a06aea9979e0a1c5da9ec6bd513 Accelerate!",
                "author": "FundusAnimae"
            },
            {
                "raw_content": "180B dollars in CapEx this year is going to push researc like thisto crazy levels of progress and development. This year is looking big.",
                "author": "Tkins"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Mini movie (seedance 2.0)",
        "score": 41,
        "text_content": "This 10 minute clip took 8 hours to create and cost around $60.",
        "comments": [
            {
                "raw_content": "This new model has certainly forced my \"AI detection neurons\" to be more careful when saying \"this can't be AI because AI can't do this yet\". Obviously you can still point out a million tiny inconsistencies in this (notably characters' sizes changing all the time) but it's so far ahead of any other model it makes my brain hurt.",
                "author": "z_latent"
            },
            {
                "raw_content": "This gives me Nezha2 vibes. Nice work man",
                "author": "postacul_rus"
            },
            {
                "raw_content": "Did you actually control the story and narrative step by step yourself or did it generate randomly?",
                "author": "Parlonny"
            }
        ],
        "subreddit": "singularity"
    }
]