[
    {
        "post_name": "Democrats in October and November",
        "score": 557,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wait a minute, you mean Democrats are **𝙙𝙞𝙨𝙝𝙤𝙣𝙚𝙨𝙩?!**",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "You'd think they'd give a fuck about appearing hypocritical, but Democrats lie like they breathe and I doubt they care about winning anyone over anymore.",
                "author": "seeling0"
            },
            {
                "raw_content": "TDS: tedious.",
                "author": "barwhack"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "REP. CROCKETT: \"One of the reasons people haven't been flying planes into buildings in the United States it's because of our soft power.\" She says sending terrorists medication was \"helping keep us safe.\"",
        "score": 422,
        "text_content": "",
        "comments": [
            {
                "raw_content": "She’s never read Jefferson’s letter to the Barbary Pirates",
                "author": "Easzq8"
            },
            {
                "raw_content": "I don't speak jive.",
                "author": "BarrysOFace"
            },
            {
                "raw_content": "Somebody tell Texas to take their idiot back. The reason you don’t see aircraft being crashed into building is they armored the cockpits and armed some of the pilots. A 9/11 style hijacking might get ugly in the back, but that plane is landing at an airport",
                "author": "Induceddrag"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "He made a bet with a scientist to prove him wrong and show that vaccinated kids were healthier. The study was finished in 2020 but the results were shocking — vaccinated children were 2.5 times more likely to have chronic disease.",
        "score": 911,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They are literally trying genocide.",
                "author": "10gauge"
            },
            {
                "raw_content": "We did a LOT of research on vaccines before our child was born. Read \"Turtles All the Way Down\". It is probably the most thorough, scientifically sound book I've found on the topic. It helped push me over the edge against vaccines. I was skeptical and didn't just want to follow the conspiracy theory crowd, but I'm pretty much 100% against vaccines now. Vaccines contain toxic components called adjuvants. God's design of the cellular and humoral immune systems is good and sufficient. People do stupid things like taking tylenol to lower fevers well before they're approaching a dangerous level when fevers are a good part of God's design that help destroy the microorganisms that are harming the body.",
                "author": "Perseverant"
            },
            {
                "raw_content": "Most disease comes out of a needle.",
                "author": "Tim_Berframer"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"Yesterday in Berkeley, a man professing Christ as King had his cross ripped from his neck by what appears to be a Muslim man. He was punched roughly 15 times in the face. He never threw a punch himself, instead he struggled to retrieve his cross. He was then arrested.\"",
        "score": 1083,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is so fucking misleading. Both he and his attacker were arrested because the scene was confusing as hell. The man has since been released, and his attacker is facing assault and robbery charges.",
                "author": "LawyersPlayDota"
            },
            {
                "raw_content": "God bless this man.",
                "author": "Littleirishmaid"
            },
            {
                "raw_content": "Look at the mongrol cop.",
                "author": "PatriotSkorzeny"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Colombia president orders suspension of intelligence sharing with US until Washington stops attacking boats in the Caribbean - Reuters",
        "score": 1049,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Oh no what will we ever do?",
                "author": "Beaverstatemilitia"
            },
            {
                "raw_content": "Looks like we're just gonna have to blow up every boat leaving there now",
                "author": "South_Florida_Guy"
            },
            {
                "raw_content": "No.",
                "author": "DingleBalls"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Glenn Beck exposes how Muslims are getting around the US Fair Housing Act and making Muslim only communities in America ‌ Muslim Developers are creating communities and then they create a monthly fee for all the homes, “75% of the service fee you're paying goes to the masjid",
        "score": 1030,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So a Muslim HOA?",
                "author": "LogicCircuits"
            },
            {
                "raw_content": "Full post: \"Glenn Beck exposes how Muslims are getting around the US Fair Housing Act and making Muslim only communities in America ‌ Muslim Developers are creating communities and then they create a monthly fee for all the homes, “75% of the service fee you're paying goes to the masjid — so your tax goes to the Mosque” ‌ They say all potential buyers who see that fee aren’t okay with it, they don’t won’t want their money going to the mosque so no one but Muslims will buy the homes ‌ This is fraud. Epic City has already been rebranded into a new development So this is how they do it, this is how Muslims create exclusive Muslim only communities in America\"",
                "author": "PiratePatriotParrot"
            },
            {
                "raw_content": "Jeets are stealing our jobs and homes at a way higher number, why doesn't anybody on the right talk about what the Indian invasion is doing to us?",
                "author": "SupFrens"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Justice Department finds the North Carolina DMV has been registering illegals to vote in American elections “Non-citizens were registered to vote without the person understanding or knowing what had happened” because they don’t speak English",
        "score": 1088,
        "text_content": "",
        "comments": [
            {
                "raw_content": "remember when Barry set all this up on his way out...I do.",
                "author": "BOHICA2021"
            },
            {
                "raw_content": "Time to crack down or lose our country.",
                "author": "RocketSprocket"
            },
            {
                "raw_content": "This is treason. Fuck the Republicans if they don't arrest people over this. I won't vote and I won't donate unless I start seeing more arrests. The left is literally trying to murder and replace us. Frankly I would rather see these people put in gulags through extrajudicial means than vote for moderation. Put the left in gulags.",
                "author": "MasterChief08"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Biden-Appointed Judge Poised to Order Mass Release of Illegal Aliens Detained in ICE’s “Operation Blitz” — Thousands Could Be Dumped Back onto Chicago Streets",
        "score": 808,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I would prefer a civil war over Trump capitulating to these judges’ “orders”",
                "author": "ChimpanzeeFatigue"
            },
            {
                "raw_content": "Let him order it. Then ignore it.",
                "author": "POTUS_DonnieJ"
            },
            {
                "raw_content": "Can't release them if they're dead.............",
                "author": "Coprolite"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump Should Publicly Call Out Keir Starmer and just let him collapse. The escalating chaos documented real-time, transforms Starmer from a merely unreliable partner into a political liability in freefall.",
        "score": 1171,
        "text_content": "",
        "comments": [
            {
                "raw_content": "the uk is a shithole.",
                "author": "Nachos_and_cheese"
            },
            {
                "raw_content": "Ken Starmer is a traitor.",
                "author": "MEME-SUPREME"
            },
            {
                "raw_content": "UK has been Islamified by globohomos. USA must send a stern message.",
                "author": "GA_Logic"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Katie Hobbs is now being investigated for bribery, fraud, conspiracy and racketeering. The Chairman of the Joint Legislative Committee has informed Maricopa County's investigator that the Auditor General will assist in the investigation.",
        "score": 1591,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I won't hold my breath.",
                "author": "Ocineaa"
            },
            {
                "raw_content": "Kari Lake was robbed multiple times. But it’s also worth noting these bribery allegations began back when Biden was still in charge",
                "author": "henri_derelicte"
            },
            {
                "raw_content": "Let the indictments ROLL",
                "author": "MAGAguitar"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "NAILED IT: Brit Hume of FOX News Says Government Shutdown Was All About ‘Democrats Positioning Themselves in Resistance to Trump’ (VIDEO)",
        "score": 439,
        "text_content": "",
        "comments": [
            {
                "raw_content": "✓ Brit Hume ✓ on Fox News ✓ via Gateway Pundit ✓ Posted by /u/thegatewaybandit ✓ Stickied What're we doin here?",
                "author": "IllIllIll"
            },
            {
                "raw_content": "Lurch is right like a blinking VCR clock. He’s got on 12:00/right for the reminder of the year.",
                "author": "RuprechtThaMonkeyBoy"
            },
            {
                "raw_content": "Yup called it the first day anything to stop the Trump agenda.",
                "author": "Wupta"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "“Clinton Corruption Files” – Bondi, Patel Give Congress New Evidence Detailing Clinton Foundation Corruption",
        "score": 945,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'll get excited once we actually see an arrest.",
                "author": "DoMe22"
            },
            {
                "raw_content": "My government should not ever be funding NON-government organizations.",
                "author": "Ricky_CIA"
            },
            {
                "raw_content": "So DOJ & FBI give evidence to Congress, so that Congress can send evidence to DOJ & FBI?",
                "author": "fluffykitten"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Supreme Court Extends Order Blocking Full SNAP Payments",
        "score": 872,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Buckle up because we may see the great jogger run after all soon.",
                "author": "GA_Logic"
            },
            {
                "raw_content": "\"Liberal Justice Ketanji Brown Jackson dissented. There was no opinion.\" lol",
                "author": "Tokens_Worth"
            },
            {
                "raw_content": "Some unelected lower court judge would overrule them again - if the government wasn't about to open.",
                "author": "Scot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🌉🌁 758-meter-long Hongqi bridge collapses in southwest PRC 🇨🇳, months after opening",
        "score": 589,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sum ting Wong",
                "author": "RuprechtThaMonkeyBoy"
            },
            {
                "raw_content": "thats what happens when you build outta cheap plastic",
                "author": "here2red"
            },
            {
                "raw_content": "Me rubble rong time",
                "author": "slangin_paint"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This Is The Way",
        "score": 1746,
        "text_content": "",
        "comments": [
            {
                "raw_content": "WhyNotBoth.jpg",
                "author": "rebuildingMyself"
            },
            {
                "raw_content": "My immigration policy is doing both.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "My immigration policy is deporting all non-citizens and anyone who has voted Democrat since 2020",
                "author": "wharfthrowaway"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "UK announces that it will halt sharing information with the United States on drug smuggling operations in the Caribbean after US strikes on cartel boats.",
        "score": 1080,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We should halt military protection. I mean they have already been invaded so...",
                "author": "FusionBlack"
            },
            {
                "raw_content": "Well well well look who's enabling the drug smugglers",
                "author": "hughjasske69"
            },
            {
                "raw_content": "What an odd thing to say/do.....",
                "author": "tw0scoops"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "If President Trump can be impeached and indicted for the fake Russian collusion story, then Barack Obama should go to prison for creating it",
        "score": 377,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Exactly! Lock him up! Limp Wrist Obama and everyone who worked for his illegitimate administration should be in prison.",
                "author": "Stormeyworld13"
            },
            {
                "raw_content": "The only difference between him and Jussie Smollett is the scale of the crime they planned and carried out. Both targeted Trump and were attempts to fuck with elections.",
                "author": "impera"
            },
            {
                "raw_content": "Obama should be in prison for killing American citizen with that drone strike. But his DOJ said it was legal >The drone strike that killed U.S. citizen Anwar al-Awlaki was conducted under the authority of the President as Commander-in-Chief and was deemed lawful by the Justice Department's Office of Legal Counsel (OLC) at the time, not a crime for which a former president can be prosecuted.",
                "author": "mikethemarine"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Shutdown Was Always Going To End With Democrats Caving And Looking Ridiculous",
        "score": 1048,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We all look ridiculous while we're still paying taxes. The rest of this is theater.",
                "author": "Spawnlingman"
            },
            {
                "raw_content": "They look ridiculous? Aren't we hiring back all the fed fat we just fired? with back pay?",
                "author": "MewThat"
            },
            {
                "raw_content": "What we republicans accomplished was to re-authorize Biden's budget without adding even more ridiculous spending. All branches of government are R controlled and the best they can do is kick the can down the road and keep the drunken sailor levels of spending going. Yay...",
                "author": "keeman"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "NYT: Israel’s Military Response ‘Inevitable’ As Iran Restores Nuke Facilities, Ramps Up Missile Production",
        "score": 719,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hey I've seen this movie over and over again since the 90s",
                "author": "snakeoil"
            },
            {
                "raw_content": "Shapiro and Mark Levin just did the gayest high-five in human history.",
                "author": "Atlis34"
            },
            {
                "raw_content": "Not our problem. We need to fix USA FIRST. American citizens need help!",
                "author": "GA_Logic"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Attorney General Ken Paxton: I'm suing Harris County for unlawfully directing over $1.3 million in taxpayer money to defend illegal aliens from deportation. We must stop the left-wing radicals who are robbing Texans to prevent illegals from being deported by the Trump Administration.",
        "score": 1754,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lawsuits are great and all, but..... Arrests?",
                "author": "BlackJack1776"
            },
            {
                "raw_content": "Only reason I dont want this man in higher offices is because we'll lose him as AG",
                "author": "rebuildingMyself"
            },
            {
                "raw_content": "President Trump needs to follow up with the Commerce Department back when he ordered the Census Bureau not to count illegals in the 2030 Census. The Democrats are clearly pushing through with counting illegals to benefit Blue States and Blue Cities.",
                "author": "McFatty7"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Hardware hacker installs Minecraft server on a cheap smart lightbulb — single 192 MHz RISC-V core with 276KB of RAM, enough to run tiny 90K byte world",
        "score": 563,
        "text_content": "",
        "comments": [
            {
                "raw_content": "192Mhz seems like a lot for a bulb",
                "author": "KnownDairyAcolyte"
            },
            {
                "raw_content": "A curious mind has to tinker.",
                "author": "Cubanitto"
            },
            {
                "raw_content": "Guess I have a potential server cluster in my smart home setup",
                "author": "Valoneria"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Dumb question, but why is there no ARM equivalent for GPUs?",
        "score": 52,
        "text_content": "Hi so I'm an idiot and sorry for the (probably) stupid question, but why arent there small and efficient dGPUs? I was mainly wondering this because most low (ish) cost devices like the raspberry pi, steam deck, budget laptops use iGPUs instead of some small dGPU. Like in the RP case, I imagine the reason would be that, even if something like that existed, the RP would still use iGPUs to save costs, but for higher end devices meant for gaming like gaming handhelds and budget laptops, I feel like they would really benefit for small dGPUs that while might not be as good as say last gens budget hardware, still might be better than integrated graphics. I imagine that, at the end of the day, the reason is cost/weight/size/power, and probably mostly cost as unless it was really cheap and good, it would be better, from a gaming hardware company perspective, to invest more money for a budget current gen GPU or save the cost and use internal graphics. But even then, you could undercut your competitors if the performance gain is notable by pricing your \"aGPU\" laptop at the same price, or a little higher, than their iGPU laptop and if the \"ARM\" (idk the correct term) GPU laptop has a noticeable performance increase there would be no reason not to but the aGPU laptop. Of course there are probably actual reasons for why you can't make an \"ARM\" GPU, but to be honest that is far over my realm of expertise, so can anyone explain this to me because I dont really get it? Cause again, I'm an idiot Tldr: Why isn’t there a gpu equivalent of ARM cpus, small efficient gpus that could be used on lower end devices rather than internal graphics?",
        "comments": [
            {
                "raw_content": "Taking \"ARM\" as the instruction set (compared to x86). All GPUs use different instruction sets, so there is no choice to go for the \"other\" instruction set. Every generation Nvidia, AMD, Qualcomm, Apple, ARM, etc. makes a new instruction set for their new GPU architecture and uses that on their GPUs. If they want better performance in x workload they will just add instructions for that workload. As for actual size and performance. The low end GPU market was completely eaten by integrated GPUs. When you need little GPU performance it makes no sense to build a GPU when you can just put a small one next to the CPU. That way you consolidate the memory and power delivery, make fewer silicon variants and just generally optimize costs.",
                "author": "Just_Maintenance"
            },
            {
                "raw_content": "One of the main issues is power. ARM devices are system-on-a-chip (SOC) designs. This is because moving a lot of data within the same chip is a lot more power efficient than moving the data between two chips. So an iGPU will always have this power savings. ARMs best marketshare is in small battery-powered devices where low power is key. On the other hand, discrete GPUs can be more powerful than iGPUs in a desktop or laptop also because of power. For the CPU, there is a limit of how much power can be delivered to the socket, so moving the GPU to another board allows for a much higher power limit. Of course, for a SOC in a handheld battery powered device those levels are power don't make sense anyways, so a separate GPU board is not needed.",
                "author": "TurtlePaul"
            },
            {
                "raw_content": "Arm has a gpu, it's called Mali. They use them as an igpu, because there they can share the ram with the cpu. If you build a dedicated gpu with it, you need to give it vram, which adds cost. It also makes the board/device design more complex because you now have to cool two separate chips. It adds costs without any benefits. You want a big dedicated gpu for gaming, but games are programmed for x86, not arm. Even if you had great X86 emulation, which Microsoft is still struggling with, you will still run into compatibility problems with games. Scaling up a small igpu design into even a midrange gpu is hard. Intel basically failed doing it. Their gpus needed 50% more die space than the competition for the same performance, so they made a loss with every card sold. Not even talking about the billions they spend developing the gpus.",
                "author": "psi-storm"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "DARPA and Texas Bet $1.4 Billion on a Unique Foundry",
        "score": 27,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"DARPA predicts silicon-on-silicon stacking will result in no more than a 30-fold boost in performance over [...] 2D integration. By contrast, doing it with a mix [of materials] could deliver a 100-fold boost\" I am a but confused. What are they getting at? How are they getting a performance boost over silicon-on-silicon? Are they talking power circuits or really about compute? Are they comparing better stacked compute devices?",
                "author": "EloquentPinguin"
            },
            {
                "raw_content": "From elsewhere on the DARPA site, \"Three-dimensional heterogeneous integration (3DHI) currently employed in microsystems is limited to stacking of low-power logic tiers. Successful stacking of multiple high-power logic, radio frequency, and other functional tiers promises to unleash unprecedented advancements in military and commercial microsystems capabilities. This is currently not feasible, due in part to insufficient thermal management capabilities limiting in-plane and out-of-plane heat acquisition from each tier, poor thermal isolation between functional blocks, and unacceptably large heat transmission and rejection hardware.\"",
                "author": "patrickhenrypdx"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Insights] Memory Spot Price Update: DRAM Chip Spot Prices Surpass Modules, Signaling Imminent Surge",
        "score": 2,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">Notably, quotes for DRAM chips (US$ per Gb) have already surpassed quotes for modules of the same capacity, and the price difference is substantial. TrendForce believes that in the short term, the spot market will see a rapid rise in module prices, narrowing the gap with chip prices. The average spot price of mainstream chips (i.e., DDR4 1Gx8 3200MT/s) has increased by 7.10% from US$11.071 last week to US$11.857 this week.",
                "author": "imaginary_num6er"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel CTO and AI Chief Sachin Katti Departs for OpenAI",
        "score": 64,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That is where the money is.",
                "author": "Cubanitto"
            },
            {
                "raw_content": "Generational bag getter Sachin",
                "author": "mrgorilla111"
            },
            {
                "raw_content": "Cements NEX as a dying group, but OpenAI is past its peak as well. GPT has poor corporate penetration at least in the tech world",
                "author": "gburdell"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD or Intel for Budget PC Gaming? 7500F vs. 12400F",
        "score": 42,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TLDW: Current Prices: i5-12400F: $135 (USA), $190 (AUS) Ryzen 5 7500F: $165 (USA), $200 (AUS) 12 games average: 1080P Medium Settings: Ryzen 5 7500F was 20% faster than the i5-12400F 1080P Ultra settings: Ryzen 5 7500F was 18% faster than the i5-12400F",
                "author": "Antonis_32"
            },
            {
                "raw_content": "In most of the world 7500F is a no brainer but where I live unfortunately DDR5 prices and AM5 motherboards too never went down so 12400F as a whole platform is considerably cheaper.",
                "author": "__Rosso__"
            },
            {
                "raw_content": "Sigh The 12**6**00KF is a price parity match and has more cores. than the 7500F.",
                "author": "ecktt"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Do Gen5 SSD perform differently on AMD and Intel platforms?",
        "score": 0,
        "text_content": "I just got a Kingston Fury Renegade G5 and put it in my rig. With some quick testing, I found my results differed slightly from the testing online. The largest deviation was the RND4K Q1T1 results. Mine results were 30% lower than expected. I wonder if the difference was due to the platform. My setup was 9800X3D and X670E and those testings were from LGA1700. I have some faint memory about some articles mentioning Gen5 SSD perform differently on AMD and Intel platforms. I couldn’t find the articles for the time being though.",
        "comments": [
            {
                "raw_content": "They shouldn't provided you put it in the correct M2 slot as some go directly to the CPU and some go through the chipset.",
                "author": "reveil"
            },
            {
                "raw_content": "I was wondering too since I noticed this on the [review for Adata Mars XPG 980](https://www.tweaktown.com/reviews/11075/adata-xpg-mars-980-blade-2tb-ssd-14-000-mb-on-the-cheap/index.html). I'm not too familiar with SSD benchmarking, but it looks like there are (considerable) differences depending on the test used between AMD and Intel systems.",
                "author": "Rain08"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Pokémon Pokopia is a game key card.",
        "score": 808,
        "text_content": "Everyone complaining about this will look like Homer Simpson.",
        "comments": [
            {
                "raw_content": "I'm surprised it gets a physical release at all. It seemed more like a digital only game to me.",
                "author": "Williekins"
            },
            {
                "raw_content": "I couldnt care less about the key card. But the fact that they’re charging 70 is insane to me",
                "author": "X_J_9"
            },
            {
                "raw_content": "Is there anybody in the middle that just doesn't care? Like when I have someone explain to me the downsides of game key cards I genuinely just think \"Okay, so what?\"",
                "author": "OVO_ZORRO"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "New Update now shows Peak Brightness on HDR Settings.",
        "score": 663,
        "text_content": "You have to press Y to show the value. If you know the peak brightness of your TV you can now set it without having to guess.",
        "comments": [
            {
                "raw_content": "A good step. I'd also appreciate the ability to show the paper white value - that one is also way too vague atm",
                "author": "Pinkernessians"
            },
            {
                "raw_content": "that's a huge improvement, big fan",
                "author": "superamigo987"
            },
            {
                "raw_content": "THIS IS BIGGER THAN THEMES",
                "author": "Both_Leading_4578"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo please merge your apps into one, each app can be just a tab.",
        "score": 429,
        "text_content": "Having 4 Nintendo apps on the screen is insane! They should merge all of them into one Nintendo app because each app is simple enough to be just a tab. Maybe kill “today” app, the news tab in the Nintendo Store app is what Today is supposed to look like: clean and direct!",
        "comments": [
            {
                "raw_content": "I agree but i understand having the music one separated.",
                "author": "linkling1039"
            },
            {
                "raw_content": "You drew a penis",
                "author": "ChemG8r"
            },
            {
                "raw_content": "Im fine with the music app and store being separate I want the Nintendo switch app and Nintendo today together.",
                "author": "zaadiqoJoseph"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Xenoblade Chronicles X: Definitive Edition backwards compatibility now fixed on Nintendo Switch 2",
        "score": 193,
        "text_content": "No Switch 2 performance upgrade unfortunately :(",
        "comments": [
            {
                "raw_content": "I was excited and thought this was an Upgrade announcement. Boo!",
                "author": "KingBrave1"
            },
            {
                "raw_content": "Pls give 60fps",
                "author": "MXC_Vic_Romano"
            },
            {
                "raw_content": "I’d guess the enhancement upgrade proper (with the datamined 60fps toggle it’s the closest thing to a confirmed “future upgrade” we have) will either be paired with a Xenoblade Switch 2 Edition or the next Xenoblade game. Whichever comes out within the next year or so.",
                "author": "SomeBoxofSpoons"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The Legend of Zelda: Hyrule Warriors: Age of imprisonment game share is pretty nice",
        "score": 68,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How’s performance? I’m interested considering the SW2 is kinda rendering an entire second screen here. I’m guessing same as split screen at 30fps…",
                "author": "Keaten88"
            },
            {
                "raw_content": "Can my buddy play with me from his house or is it a local only thing?",
                "author": "NoveliBear"
            },
            {
                "raw_content": "The black borders shrinking the screen size would be a deal breaker for me.",
                "author": "tsckenny"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Apart from the new game card icons in the home menu, it seems there are new sounds as well!",
        "score": 115,
        "text_content": "I didn’t see anyone posting about this and is such a nice little detail. Nintendo is slowly adding more personality to the OS in general. Themes anyone??? One can only hope.",
        "comments": [
            {
                "raw_content": "I actually love it",
                "author": "Pokeguy211"
            },
            {
                "raw_content": "One step closer to custom themes",
                "author": "ALEXLAMOUETTE"
            },
            {
                "raw_content": "Pong intensifies. Nice find",
                "author": "DDub__"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Broken Sword Reforged has had a Nintendo Switch 2 Edition shadowdropped",
        "score": 90,
        "text_content": "£24.99 in the UK, or a £4.99 upgrade pack. Adds 4K docked, native 1080p handheld, and Joy-Con mouse controls! Haven’t seen this posted anywhere, not even the dev’s X account.",
        "comments": [
            {
                "raw_content": "I know I’m not the only one feeling that way but I’ll say it. Seeing all these indies and small games get Switch 2 Edition while Persona 5 Royal still looks like vaseline smeared with shit in handheld, while NieR Automata is flat out broken, is nothing short of insufferable.",
                "author": "Medd-"
            },
            {
                "raw_content": "heck yeah to devs releasing S2Es.... love to see it.",
                "author": "borghe"
            },
            {
                "raw_content": "FINALLY a point and click game that makes use of mouse controls on Switch 2!",
                "author": "Pessimistic_Gemini"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Riggie Fils-Aime on Switch 2 launch: \"I’m surprised that Xbox has not yet fully embraced the platform\"",
        "score": 513,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I am surprised too.",
                "author": "Ttm-o"
            },
            {
                "raw_content": "where tf is halo mcc on switch",
                "author": "SolidStudy5645"
            },
            {
                "raw_content": "remember when they made a deal to bring cod to [nintendo consoles for 10 years when they were buying activation blizzard and then did nothing ](https://www.polygon.com/23497945/call-of-duty-nintendo-microsoft-10-year-deal-steam-activision-blizzard/#:~:text=Microsoft%20signs%20deal%20to%20bring%20Call%20of%20Duty%20to%20Nintendo%20for%2010%20years&text=In%20a%20significant%20coup%20for,its%20consoles%20for%2010%20years)",
                "author": "Wolventec"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Mooreslawisdead - \"If you're a fan of @valvesoftware, check the news in around 16 hours...\"",
        "score": 544,
        "text_content": "[https://xcancel.com/mooreslawisdead/status/1988432610951852284](https://xcancel.com/mooreslawisdead/status/1988432610951852284) Steam Frame guaranteed or is everyone just farming engagement? Regardless, I think the bigger question here is what comes after the Steam Frame. Are they getting ready to roll out the red carpet for something else? HTC Vive led to the Lab (demo) Valve Index eventually led to Half Life Alyx (fullfat game) Steam Deck led to the small scale Aperture Desk Job (demo) Steam Frame will lead to...? Gabefollower hinted that the Frame might have smaller demos attached to it. But also, the Index did get some small knuckle-based demos for the Lab as well. Remember that the Frame's main gimmick is supposedly being able to comfortably play flat screen PC games as well.",
        "comments": [
            {
                "raw_content": "![gif](giphy|wf510uTbXPUHQ1JxM2) Ricochet 2!!",
                "author": "Mariosonicpac"
            },
            {
                "raw_content": "Please not just hardware... Please not just hardware...",
                "author": "pway_videogwames_uwu"
            },
            {
                "raw_content": "So Steam Frame tomorrow and HLX next week?",
                "author": "FluffyFluffies"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Kurakasis 10 hours ago: Gaben, do it 😈",
        "score": 137,
        "text_content": "[https://xcancel.com/Kurakasis/status/1988309847046340713](https://xcancel.com/Kurakasis/status/1988309847046340713)",
        "comments": [
            {
                "raw_content": "Here come the other “leakers” echoing what the popular leakers are saying to appear as though they have more insider knowledge than they actually do.",
                "author": "REDOREDDIT23"
            },
            {
                "raw_content": "If HL3 ACTUALLY happens this time, it will feel weird. We've been \"memeing\" this game for literally years, and the fact that it's actually happening feels weird, though. *But a welcome surprise.*",
                "author": "Astraliguss"
            },
            {
                "raw_content": "Yeah by noon tomorrow the internet will either be up in flames or celebrating like the Death Star just blew up",
                "author": "ballviewer"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "shpeshal_nick: \"if what I was just DMd is actually true (big if), next week GTA 6 could actually have it's thunder stolen on the hype scale lmao\"",
        "score": 1761,
        "text_content": "[https://xcancel.com/Shpeshal_Nick/status/1988221134622630153](https://xcancel.com/Shpeshal_Nick/status/1988221134622630153) I can't imagine a lot of games that can possibly remotely match the hype of GTA6. Like genuinely I think there's not a single game that could match its hype. But still let's run through the possibilities: * Todd Howard recently just said that TES is still in development. Zero chance. * We recently just heard rumors of a League of Legends 2. An update to one of the biggest games in the world? Hype is there but I feel they would have shown this at Worlds 2025 a few days ago. * Anything Fromsoft related? Even Bloodborne 2 isn't that big, Duskbloods is still on the table, and Sony is having a State of Play soon. Also Souls ain't THAT big yet. * CDPR has been a bit of an openbook so no surprise Witcher of Cyberpunk stuff probably. * Mihoyo teased their new far far off AAA Unreal project. * Stuff like \"Minecraft 2\", \"PUBG 2\", \"Terraria 2(?)\" [INSERT BIG GAME] 2, etc. seem unlikely as well. So is this it? The meme? The white whale? You know the one. Edit: Another thing to note. We're talking about a potential reveal that is gonna happen weeks before The Game Awards. Who is the only studio or publisher that can get away with skipping out on millions of impressions because they can do their own random announcement?",
        "comments": [
            {
                "raw_content": "Half-Life 3",
                "author": "Navar4477"
            },
            {
                "raw_content": "Orange Box vol.2 - TF 3, Half-Life 3, Left for dead 3, portal 3",
                "author": "Academic_Hearing"
            },
            {
                "raw_content": "Keep in mind this guy told us Bloodborne Remaster was real and he had proof, that was 3 years ago.",
                "author": "FlannOff"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "(Partial) list of developers & publishers for today's State of Play has been leaked",
        "score": 565,
        "text_content": "This games from the same person who also had a leak like this back in September: [https://www.resetera.com/threads/state-of-play-japan-announced-tuesday-at-2pm-pt-5pm-et.1348552/post-147537526](https://www.resetera.com/threads/state-of-play-japan-announced-tuesday-at-2pm-pt-5pm-et.1348552/post-147537526) * Koei Tecmo * Arc System Works * From Software * Pocketpair * Square Enix * Serafini Productions * Team Ninja * Spike Chunsoft * 91Act * Bandai Namco * Also a Dragon Ball as the background image September leak: [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1npiehq/incomplete\\_list\\_of\\_studiospublishers\\_present\\_at/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1npiehq/incomplete_list_of_studiospublishers_present_at/)",
        "comments": [
            {
                "raw_content": "FromSoftware? Aren't they the guys that made King's Field?",
                "author": "Cubelock"
            },
            {
                "raw_content": "Brb, going to do some blood rituals for Ace Combat 8.",
                "author": "Battlefire"
            },
            {
                "raw_content": "Square enix... please don't give me hope....",
                "author": "Galacticrusader"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Team Fortress 3 in the works?",
        "score": 657,
        "text_content": "https://tech4gamers.com/team-fortress-3-production-evidence/ Surprised I haven't seen a post about this on here. There were a few articles that came out some months ago. \"The game is allegedly half a decade away, but Valve may release a playable build two years before launch.\" \"Credible Valve insider Tyler McVicker says he is straight up confident that Valve is moving forward with Team Fortress 3 production.\"",
        "comments": [
            {
                "raw_content": "Half Life 3, Knack 3 and Team Fortress 3 will all be confirmed in the next three weeks.",
                "author": "MuptonBossman"
            },
            {
                "raw_content": "Tyler himself said it's \"possible\" that they are doing something with Team Fortress but not concrete proof that it's TF3. He even made a giant disclaimer for this too",
                "author": "HiddenNightmares"
            },
            {
                "raw_content": "Portal 3 wait goes on....",
                "author": "Retro1088"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Screenshots from the recently rumored Ubisoft MP Shooter",
        "score": 154,
        "text_content": "* Codenamed \"Scout\" * Made in UE5 [screenshots](https://xcancel.com/6leaksgg/status/1988397275266334782/photo/2) [previous rumor](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1ougwtd/ubisoft_working_on_another_competitive)",
        "comments": [
            {
                "raw_content": "Can Ubi just stop with the live service games that die in 2 months ?",
                "author": "KittenDecomposer96"
            },
            {
                "raw_content": "My friends lost their jobs after the collapse of XDefiant, I could not care less for any new shooter they release after that cos I have zero faith they'll keep it alive.",
                "author": "TAJack1"
            },
            {
                "raw_content": "I'll be interested to see how this goes. I thought XDefiant was a pretty decent shooter and I was bummed to see it canned so fast, especially since Ubisoft is generally good at supporting struggling games. Hope this one turns out good.",
                "author": "ToothlessFTW"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "PS5 Digital Edition - Japanese Language only console announced - 55,000 yen",
        "score": 194,
        "text_content": "[Source](https://xcancel.com/Wario64/status/1988376308724727907?t=9dpo1I6uDY7G3RKVp3JNzg&s=19) [Previous rumor](https://www.reddit.com/r/GamingLeaksAndRumours/s/bF9xFyBpiF)",
        "comments": [
            {
                "raw_content": "This is still about ¥15,000 more than the introductory price of the digital PS5",
                "author": "PCMachinima"
            },
            {
                "raw_content": "This was clearly a state of play trying to make japanese people to buy more ps5s, but I don't feel they managed to do it with this event",
                "author": "Mcreation86"
            },
            {
                "raw_content": "PS5: Tariffs/Weak Yen/\"Nintendo owns Japan\" Edition",
                "author": "blackthorn_orion"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Insider Gaming: Fortnite is adding gambling in a future update",
        "score": 541,
        "text_content": "Source: [https://insider-gaming.com/fortnite-adding-gambling-in-future-update-leaks-reveal/](https://insider-gaming.com/fortnite-adding-gambling-in-future-update-leaks-reveal/) \"With this update, V-Bucks will be directly available to spend on items that provide random rewards, though it’s unclear at this stage what exactly that will entail, and it will likely depend on the experience being played.\" \"Epic Games has reached out to Insider Gaming to deny the addition of gambling mechanics, though we disagree with their classification\"",
        "comments": [
            {
                "raw_content": "#Insider-Gaming is a Tier 2 - Generally Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Maybe Fortnite doing it will finally get governements to reclassify it as gambling...",
                "author": "KitsuneKamiSama"
            },
            {
                "raw_content": "I believe Roblox currently has something similar. I mean what can you even say. We live in hell.",
                "author": "sufferingphilliesfan"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "AMD presents new Zen CPU roadmap, confirms Zen 7 with new matrix engine - VideoCardz.com",
        "score": 289,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Will the new \"Matrix Engine\" be a separate NPU unit or Matrix extensions build into the ISA like Intel's AMX?",
                "author": "Isacx123"
            },
            {
                "raw_content": "So nothing about staying on AM5 or a possible AM6 yet, as far as I can tell.",
                "author": "chipsnapper"
            },
            {
                "raw_content": "Looking at TSMC wafer pricing, all I know for sure is Zen 6 and 7 will be ridiculously expensive.",
                "author": "max1001"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "More than 40% of US homeowners don’t have mortgages — and that number is growing",
        "score": 753,
        "text_content": "https://nypost.com/2025/10/30/real-estate/more-than-40-of-us-homeowners-dont-have-mortgages/ A growing share of US homeowners are living without a mortgage, as aging baby boomers and long-term demographic shifts reshape the housing landscape. According to a new analysis from ResiClub based on US Census Bureau data, 40.3% of owner-occupied homes in the country were mortgage-free in 2024, marking a record high and a modest uptick from 39.8% the year prior. The share has climbed steadily over the past decade, up from 32.8% in 2010, signaling that more Americans are aging into debt-free homeownership.",
        "comments": [
            {
                "raw_content": "I'm house hunting. It seems like the houses on the market fall into 2 categories: 1, Paid off boomer houses that need a ton of work 2. Houses that were bought in 2020-2024 and are back on the market already. So yeah, the 40% number for zero mortgages sounds about right.",
                "author": "EstateGate"
            },
            {
                "raw_content": "40% have no mortgage. How many more bought before 2022/23 and have quite a bit of positive equity and a very manageable mortgage payment. Would guess those populations combined are closer to 70-80% of all home owners, but maybe even higher. Point being, a lot of very financially healthy home owners out there.",
                "author": "zorg-18082"
            },
            {
                "raw_content": ">In the coming years, ResiClub anticipates a rise in equity-based products like reverse mortgages, as more older homeowners who’ve paid off their properties seek ways to access their home equity without putting their homes on the market, the report noted. >The trend underscores how the American dream of homeownership is evolving: less about buying, more about holding — and increasingly, about aging in place. Cool... so, the aging population will be handing their assets back to financial institutions instead of transferring that wealth to the next generation.",
                "author": "Jets237"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Just over half (52.5%) of mortgaged US homeowners have a rate below 4%",
        "score": 300,
        "text_content": "https://www.redfin.com/news/rate-lock-q2-2025/ 80.3% of mortgaged U.S. homeowners have a rate below 6%, down from a record 92.7% in the second quarter of 2022. Just over half (52.5%) of mortgaged homeowners have a rate below 4%, down from 65.1% in 2022. Here’s the full breakdown of where today’s homeowners fall on the mortgage-rate spectrum: Below 6%: 80.3% of mortgaged U.S. homeowners have a rate below 6%, down from a record 92.7% in the second quarter of 2022. Below 5%: 70.4% have a rate below 5%, down from a record 85.6% in the first quarter of 2022. Below 4%: 52.5% have a rate below 4%, down from a record 65.1% in the first quarter of 2022. Below 3%: 20.4% have a rate below 3%, down from a record 24.6% in the first quarter of 2022.",
        "comments": [
            {
                "raw_content": "My first rate, prime credit, was 4.5%, its just what the rates were when I bought. I refinanced over covid to 2.68 and dropped to a 15 year. It was a free money time, lowest ever.",
                "author": "archercc81"
            },
            {
                "raw_content": "6.5% last month 😭😭😭",
                "author": "No_Seaworthiness3625"
            },
            {
                "raw_content": "Went from a 30 year at 5.75% to a 15 year at 2.35% in December of 2020. Basically the same payment. Can’t even think about moving now.",
                "author": "Purple-Possible-7429"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "50 Year Mortgage Numbers for a 500k Property",
        "score": 197,
        "text_content": "500k, 20% down, 6.3%. You would be better off renting and putting the HOA, repair, and insurance savings into an index fund; you would make more money after 30 or 50 years almost certainly without the idiosyncratic risks of any one asset in any one location. This is a massive life long gamble on inflation and housing policy. For selling or refinancing you are going to be underwater with this mortgage for 10 years even with 20% down assuming the house you bought always increases 3% per year. If there is a correction you are underwater for longer than 10 years. The median time to live at one location is around 12 years. In response to the refinance later argument, remember that you might pay 5% of the remaining balance to refinance, and for a 50yr loan with 20% down, even if you refinance in 25 years **you are paying a 5% fee on over 80% of the original loan value**. Might as well grab an adjustable rate mortgage because this is gambling rates only ever go down, and you are sure how finance is going to look in the 2050s, 2060s, and 2070s. Notice that 50 year loans span more than half of human total life expectancy in any country. This is making a bet on market conditions when people are well into their retirement age. This loan term is: 64% of total life expectancy in the US 70% of remaining adult life expectancy 90% of remaining adult life expectancy just after college 112% of life expectancy for the median first time home buyer today 100% of life expectancy for the median first time buyer in the 1970s, 80s and 90s. A new college grad would be taking on a debt commitment for 90% of their remaining life. But remember that's median, \\~40% of new grads taking that deal will have been deceased by term end. A new college grad will have 50% remaining balance on this loan at retirement. A median first time buyer will have 87% remaining balance at the median retirement age. A median first time buyer in the 1970s, 80s, and 90s would have 72% remaining balance by retirement. You might as well take on intergenerational 100yr loans and start taking bets on asset valuations in the 22nd century.",
        "comments": [
            {
                "raw_content": "Why would you pay 10% to refinance? But yeah, 50 year mortgage is one of the dumbest things I’ve seen in a while.",
                "author": "Responsible_Knee7632"
            },
            {
                "raw_content": "All I see is it allows you to pay more interest. Your monthly payment is only slightly lower than a 30 year. It’s just nuts",
                "author": "BMP77777"
            },
            {
                "raw_content": "Financial literacy is so bad in the US that, this needs to be charted out and explained why it’s bad. Common sense and basic financial literacy should immediately lead to red flags.",
                "author": "AoeDreaMEr"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Trump calls his 50-year mortgage idea 'not even a big deal' while insisting 'the economy is the strongest it's ever been' | Fortune",
        "score": 112,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A lot of these homes on the market won’t be standing in 50 years without major renovations.",
                "author": "ChadsworthRothschild"
            },
            {
                "raw_content": "[removed]",
                "author": "None"
            },
            {
                "raw_content": "The problem is a 50 year mortgage will raise home prices and become the floor just like the current floor is the 30 year mortgage not the 15...",
                "author": "Then_North_6347"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The one chart that shows how the American Dream fell apart in just five years",
        "score": 45,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That chart is just the interest rate. High rates mean lower affordability if prices don’t come down in response. Especially if high rates immediately follow a decade of the lowest rates in 80 years.",
                "author": "SpaceyCoffee"
            },
            {
                "raw_content": "Property ownership caps.",
                "author": "MarketCrache"
            },
            {
                "raw_content": "you cant endlessly print money and not have a consequence, the covid influx of gov cash was no good, and it was mr trump at the helm. people always forget. if you already are stable you def feel it but are navigating, if you are just starting out your are so far behind.",
                "author": "BeepGoesTheMinivan"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Sonder to File Bankruptcy and Liquidate After Marriott Cuts Ties",
        "score": 27,
        "text_content": "Sonder announces bankruptcy plans; tells guests to vacate hotel rooms: 'People were scrambling' Short-term rentals firm Sonder on Monday announced plans to file for bankruptcy. The news came a day after Marriott said a licensing agreement between the two companies had abruptly ended. Some Sonder guests said they were told to vacate their hotel rooms in less than 24 hours. https://www.cnbc.com/amp/2025/11/11/sonder-to-file-for-bankruptcy-travelers-told-to-leave-hotels-next-day.html The one-time unicorn, which was valued at $1.9 billion..",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Miami-Dade tops flood-prone counties with residents moving out. It’s not the only reason",
        "score": 10,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "This is probably my favorite thing I've made with AI. It uses a local LLM (Gemma) to watch your screen and simulate Twitch chat.",
        "score": 1122,
        "text_content": "",
        "comments": [
            {
                "raw_content": "this is so funny",
                "author": "oimrqs"
            },
            {
                "raw_content": "Have this running while you program and it constantly roasts your code.",
                "author": "yaosio"
            },
            {
                "raw_content": "[My attempt at watching a kung fu movie with Gemma3:27b](https://imgur.com/a/O2XBW8j)",
                "author": "MrMacduggan"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini 3.0 Pro's release candidate checkpoint is now on LMArena as \"riftrunner\". It created this pelican SVG:",
        "score": 46,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ok this is by far, like by waaaay faar the best svg of a pelican on a bike. It still kinda sucks but I cannot over emphasis how much better it is than anything ever seen from an LLM before. I would love to see what it does if you point it to a wiki article of an 8bit game and ask it to implement it.",
                "author": "bambin0"
            },
            {
                "raw_content": "Reminder that SVG illustration quality says more about how much SVG-specific data was used in training than it does about general intelligence. [Small models can create way better SVG illustrations than we see from frontier models, if you just train them on a lot of SVG data.](https://omnisvg.github.io/)",
                "author": "simulated-souls"
            },
            {
                "raw_content": "Holy nerf",
                "author": "OGRITHIK"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Some ukrainian media claims Russia debuted its first AI humanoid robot in Moskow (trustworthy?)",
        "score": 254,
        "text_content": "Note: Russia has humanoid robots like FEDOR(2017) it went to ISS in 2019.",
        "comments": [
            {
                "raw_content": "The late reaction of the black sheet 😂 *chef's kiss*",
                "author": "solidwhetstone"
            },
            {
                "raw_content": "First ethanol powered robot",
                "author": "_valpi"
            },
            {
                "raw_content": "dont give robot vodka before show",
                "author": "will_dormer"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Full Replication of Google's Nested Learning Paper in PyTorch – code now live",
        "score": 163,
        "text_content": "Some of you may have seen Google Research’s [**Nested Learning paper**](https://research.google/blog/introducing-nested-learning-a-new-ml-paradigm-for-continual-learning/). They introduced HOPE, a self-modifying TITAN variant with a Continuum Memory System (multi-frequency FFN chain) + deep optimizer stack. They published the research but no code (like always), so I rebuilt the architecture and infra in PyTorch over the weekend. Repo: https://github.com/kmccleary3301/nested_learning ## Highlights - Level clock + CMS implementation (update-period gating, associative-memory optimizers). - HOPE block w/ attention, TITAN memory, self-modifier pathway. - Hydra configs for pilot/mid/target scales, uv-managed env, Deepspeed/FSDP launchers. - Data pipeline: filtered RefinedWeb + supplements (C4, RedPajama, code) with tokenizer/sharding scripts. - Evaluation: zero-shot harness covering PIQA, HellaSwag, WinoGrande, ARC-E/C, BoolQ, SIQA, CommonsenseQA, OpenBookQA + NIAH long-context script. ## What I need help with: 1. Running larger training configs (760M+, 4–8k context) and reporting W&B benchmarks. 2. Stress-testing CMS/self-modifier stability + alternative attention backbones. 3. Continual-learning evaluation (streaming domains) & regression tests. If you try it, please file issues/PRs—especially around stability tricks, data pipelines, or eval scripts. Would love to see how it stacks up against these Qwen, DeepSeek, Minimax, and Kimi architectures.",
        "comments": [
            {
                "raw_content": "I don't understand any of this, but kudos to you for helping advance the technology...",
                "author": "gizeon4"
            },
            {
                "raw_content": "Thank you! Out of curiosity what sort of training runs have you done with it so far (if any of note)",
                "author": "-illusoryMechanist"
            },
            {
                "raw_content": "I second the user who suggested posting this in /r/machinelearning. You might also post it in /r/opensource. and /r/aideepresearch.",
                "author": "Megneous"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Despite of all the anti-AI marketing, Hollywood A-listers keep embracing AI. Michael Caine and Matthew McConaughey have teamed with AI audio company ElevenLabs to produce AI replications of their famous voices",
        "score": 99,
        "text_content": "\"To everyone building with voice technology: keep going. You’re helping create a future where we can look up from our screens and connect through something as timeless as humanity itself — our voices,\" McConaughey says. This in a year when we already saw James Cameron joining Stability AI board and Will Smith collaborating with an AI artist. I am sure more will be coming very soon. [https://www.rollingstone.com/culture/culture-news/james-cameron-stability-ai-board-1235111105](https://www.rollingstone.com/culture/culture-news/james-cameron-stability-ai-board-1235111105) [https://x.com/jboogx\\_creative/status/1890507568662933979](https://x.com/jboogx_creative/status/1890507568662933979)",
        "comments": [
            {
                "raw_content": "There are (going to be) two types of movie/video game companies. 1. Those that use AI 2. Those that use AI, but don't admit it in a Don't Ask Don't Tell fashion.",
                "author": "PwanaZana"
            },
            {
                "raw_content": "Yes people care about money. Most antis would change their tune if they got paid despite the many issues they have with ai.",
                "author": "Setsuiii"
            },
            {
                "raw_content": "They are going to resurrect Casey Kasem aren’t they?",
                "author": "Oxjrnine"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Meta chief AI scientist Yann LeCun plans to exit to launch startup",
        "score": 692,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not surprising considering how Meta seems to just be sort of flailing around in the AI space. Regardless of one’s view on the possibility of success for JEPA, at least LeCun had a bold plan for the next step in AI development.",
                "author": "The_proton_life"
            },
            {
                "raw_content": "I hope he stays true to his philosophy and stays as open source as possible.",
                "author": "__Maximum__"
            },
            {
                "raw_content": "I would too if I was made to report to the CEO of a data labelling company. This comes after Meta announced record spending on building super intelligence. This is gonna go a well as the Metaverse",
                "author": "qaswexort"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The so-called russian humanoid robot Aidol (EN-US translation)",
        "score": 41,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Are they trying to replace Vitas? https://i.redd.it/o4o68h3psq0g1.gif",
                "author": "Weltleere"
            },
            {
                "raw_content": "That thing is way more terrifying than a terminator.",
                "author": "LOLMANTHEGREAT"
            },
            {
                "raw_content": "If I know anything about Russians, this is ChatGPT and simple robot which is moved by a guy with an xbox controller behind the curtain 🤣",
                "author": "ThatMrPuddington"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "This video is 18 months old now. The Advanced Voice is still nowhere this good.",
        "score": 600,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yeah they killed the nice voice pretty early on",
                "author": "AnnualAdventurous169"
            },
            {
                "raw_content": "I was in the beta of advanced voice and yes it was a lot like this. It also did *exceedingly* weird things. What they rolled to prod was nothing like the beta. It was hard for me to even see them as the same product.",
                "author": "Over-Independent4414"
            },
            {
                "raw_content": "It has improved in the last two weeks with the ability to deal with background noise a bit better. Hopeless knowledge, always wrong, must be a very small model.",
                "author": "1a1b"
            }
        ],
        "subreddit": "singularity"
    }
]