[
    {
        "post_name": "🚨🚨🚨 President Trump is visiting the Federal Reserve THURSDAY to check on Jerome Powell’s $2.5 BILLION “renovations” to the building Powell attempted to BLOCK White House staff from visiting, so Trump decided he was PERSONALLY going.",
        "score": 1041,
        "text_content": "",
        "comments": [
            {
                "raw_content": "President Trump discovers a coat of paint and new doorknobs. This is definitely something he knows about.",
                "author": "airborne3502"
            },
            {
                "raw_content": "2.5 BILLION FUCKING DOLLARS to RENOVATE a building. There's no way that's legit. After I went internet hunting Edited to add: Anyone old enough to remember the movie Money Pit? That's what the renovation looks like. Seriously, fuck the audacity of these people. How was this all approved on the tax payers dime when supposedly it isn't even really a government agency? There's a video a little way down this page showing the renovations... I'll admit I couldn't make it to the end. Imagine a con man coming into your home and soaking you for every penny he can get. That's what it looks like. 🤣. https://www.federalreserve.gov/faqs/building-project-faqs.htm",
                "author": "SaltiTaralli"
            },
            {
                "raw_content": "Is Fort Knox next?",
                "author": "JoeBidensDementia1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Another JustTheNews scoop RE: operation \"Artic Frost\"",
        "score": 712,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They can shout \"Epstein\" all they want, but a multi-pronged attack will keep them on their heels. President Trump's DOJ can make this look like a reckoning for an avalanche of treason, corruption and crime. Because it is. DOJ and FBI are going to have to do some legitimate, honest, work for a change. Hope the MAGAFORCE President Trump has in place doesn't let us down. Tulsi stepped up, now it's time for everyone else to.",
                "author": "airborne3502"
            },
            {
                "raw_content": ">The \"Arctic Frost\" operation served as the foundation for Special Prosecutor Jack Smith's false elector case, in which President Donald Trump was charged with conspiracy to defraud the United States over his campaign's efforts to assemble alternate slates of electors—actions portrayed as an attempt to overthrow the U.S. government during the 2020 election.",
                "author": "projectarcturus"
            },
            {
                "raw_content": "Keep turning the screws",
                "author": "Muttsbitetoo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"What @POTUS has said is number one — we're NOT going to do amnesty in this country,\" says @VP . \"We're actually not going to tell people who have come into the country illegally that they're allowed to break our laws and be rewarded for it. We're just not going to do that.\"",
        "score": 823,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's becoming mainstream that the Democrats and the Blue States want to import all these illegals to vote for them and to skew the 2030 Census in the Blue States' favor. Even bullshit scripted lines like \"family reunification\" is just a bullshit scheme to keep more and more people physically in Blue States long enough to be counted in the Census. That's why [20 Dem states have sued the Trump admin to KEEP benefits for ILLEGAL ALIENS.](https://patriots.win/p/19BaD2Gk8E/20-dem-states-have-sued-the-trum/c) They need your money and benefits to sustain them long enough to be counted in the 2030 Census.",
                "author": "McFatty7"
            },
            {
                "raw_content": "The politicians advocating for amnesty have to go.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "Anyone pushing for amnesty is a traitor and should be executed on live television.",
                "author": "cjcivicx"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Don't let these lying traitors claim they never said, \"Russia hacked the election\"",
        "score": 706,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You don't hate these people enough.",
                "author": "JackOfAllTirades"
            },
            {
                "raw_content": "And they never required you to get the vaccine......",
                "author": "Datamancer"
            },
            {
                "raw_content": "Just look at the old TIME magazine covers like the one where the Kremlin was engulfing the white house. This was their narrative for years.",
                "author": "BlackPilledMAGA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The thing that never happens, happens again: the dead voted in NYC primary.",
        "score": 1441,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It doesn’t change until people go to jail.",
                "author": "TrueTemper2"
            },
            {
                "raw_content": "If a thing happens but is ignored by those in charge, did it really happen?",
                "author": "bidensmissingbrain"
            },
            {
                "raw_content": "Many of these so called, Dead Voters, are also collecting government benefits. Follow the money.",
                "author": "BugsleyKAG"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "House panel directs chairman to subpoena Bill and Hillary Clinton in Epstein probe — Fox",
        "score": 1413,
        "text_content": "",
        "comments": [
            {
                "raw_content": "His name was Seth Rich.",
                "author": "RedWave26"
            },
            {
                "raw_content": "i. did not have. sexual relations. with that woman. (looks at hillary)",
                "author": "kek-is-tan"
            },
            {
                "raw_content": "Are they going to send the sergeant at arms if/when the Clintons don’t come?",
                "author": "Illuminaughty"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "World Economic Forum 'rigged data' to make Brexit look like a failure, leaked reports show",
        "score": 1325,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What? Noooo. They have no reason to do such a thing! /s",
                "author": "fazaman"
            },
            {
                "raw_content": "Not to mention the british government did everything in their power to secure the worst deals possible and sabotage the whole thing.",
                "author": "anotherrandomname"
            },
            {
                "raw_content": "No surprise. The real problem is the UK is lost. Too many muzzie rapists and street shitters.",
                "author": "gaijin_ronin"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Big Mike is big mad!",
        "score": 1084,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The wood is getting laid",
                "author": "lovemylibs"
            },
            {
                "raw_content": "FBI about to raid Big Mikes boxer shorts drawer",
                "author": "FuckAllDemocrats"
            },
            {
                "raw_content": "Thanks for the laugh. 🤣",
                "author": "HiddenDekuScrub"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Wow! What a random shell formation…🤔😱",
        "score": 900,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ahhhh nature",
                "author": "GrizzlyT55"
            },
            {
                "raw_content": "&#65038; The tides have definitely turned on him. &#65038;",
                "author": "BallotsOnRubysUSB"
            },
            {
                "raw_content": "To bad they reduced the sentence to less than ten years from up to life/death.",
                "author": "tralbolh"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "More than 24 State AGs signed onto a letter urging the NCAA to strip trans athletes of their records and titles. The letter called for NCAA President Charlie Baker to strip males who competed on female teams of awards and give them to REAL WOMEN who earned those awards.",
        "score": 1207,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://x.com/libsoftiktok/status/1948122535180341280 It's up to 28 now. 27 states, and the territory of Guam signed the letter. - Alabama - Alaska - Arkansas - Florida - Georgia - Guam - Idaho - Indiana - Iowa - Kansas - Kentucky - Louisiana - Mississippi - Missouri - Montana - Nebraska - New Hampshire - North Dakota - Ohio - Oklahoma - South Carolina - South Dakota - Tennessee - Texas - Utah - Virginia - West Virginia - Wyoming AG Dave Sunday of Pennsylvania is the only Republican AG not to sign the letter.",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "The award is cool and all, but their golden moment was already tarnished. Their photo and memory was destroyed",
                "author": "Simpadoodledoo"
            },
            {
                "raw_content": "Charlie Baker is a piece of shit liberal. MA liberals loved him as a \"Republican\" governor, that tells you all you need to know. He says anything that people want to hear",
                "author": "derpstater"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Jasmine Crockett, in broken English, says \"dark money\" will be used by Democrats to come on top during the midterms. “I’m sho some dark money gon' pour in on da behalf of the American people.”",
        "score": 1038,
        "text_content": "",
        "comments": [
            {
                "raw_content": "She followed her comments with an extremely drawn-out \"Sheeeeeeeeeeeeeeeit.\" and then began twerking.",
                "author": "seeling0"
            },
            {
                "raw_content": "She is a fucking gem of a retard",
                "author": "TheAttackTitan"
            },
            {
                "raw_content": "uhhh... no Jasmine... that's *not* what 'dark money' is.",
                "author": "Th3Cho0sing0ne"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Appeals court panel finds President Trump’s order ending birthright citizenship unconstitutional and upholds the block - AP",
        "score": 977,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Supreme court here we go!",
                "author": "Here_we_go"
            },
            {
                "raw_content": "It was always headed to the Supreme Court where Roberts and ACB will side with the liberals. I have high hopes but low expectations for this policy's ultimate fate. I hope I'm wrong.",
                "author": "Zskills"
            },
            {
                "raw_content": "Arrest, try, and execute all judges that rule against the Constitution.",
                "author": "cjcivicx"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Whoa! CLAPPER admits he has \"Lawyered Up\" on CIANN!!!",
        "score": 688,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I hope he saved some of that money he stole. The lawyers are going to steal it back.",
                "author": "AfterGlow"
            },
            {
                "raw_content": "He says he has been lawyered up since 2017. Why would he need that if he did nothing wrong?",
                "author": "sperge420"
            },
            {
                "raw_content": "Clapper will fold first. Confirmed. (Also: he sounds drunk)",
                "author": "basedboston"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "U.S. DOJ announces formation of \"strike force\" to investigate Obama over Russiagate.",
        "score": 1436,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The strongest worded letter and FOX News appearances are incoming. Buckle up boys.",
                "author": "TheChuckSays"
            },
            {
                "raw_content": "Investigate what?! *WE HAVE THE FUCKING EVIDENCE!!!!!! (According to the press conference today)* I'll be colored surprised when this goes absolutely nowhere. Arrest him or fuck off. Once again, they want to waste time and put on a dog-and-pony show to make the normies feel like something will finally be done in the likes of justice. 🤓",
                "author": "drmrboy"
            },
            {
                "raw_content": "If the \"strike force\" doesn't include SEAL TEAM SIX, as was used against Roger Stone, it's a fraud. EDIT: \"Strike Force\" as in Team America?? Fuk Yeah!",
                "author": "GoldwaterVoter"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "20 Dem states have sued the Trump admin to KEEP benefits for ILLEGAL ALIENS.",
        "score": 1108,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is national suicide.",
                "author": "Clarice357"
            },
            {
                "raw_content": "Illegals are their voter base, its their power source. This will be the hill they die on.",
                "author": "invalid_data"
            },
            {
                "raw_content": "Wait. We were told they were not getting benefits...s\\",
                "author": "TEXinLA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨🚨HUGE BREAKING — SCOTUS allows Trump to FIRE Democrat commissioners on CPSC after federal judge earlier blocked it. 6-3.",
        "score": 1027,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"Allows\"",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "The lower judges rule against Trump over 90%. Weeks to months go by. SCOTUS overturning them over 90%. Delay, delay, delay. That’s the tactic: I don’t know how to get ahead of the lefty judges.",
                "author": "10MeV"
            },
            {
                "raw_content": "Is SCOTUS normally this busy in late summer???",
                "author": "GoldwaterVoter"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Homeland Security",
        "score": 886,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I really like this kind of art. She's chasing away the riff-raff and getting things squared away for some big money with no whammies (there were whammies, but it's a long story).",
                "author": "MythArcana"
            },
            {
                "raw_content": "This is incredibly based. The Indians were rapey, violent savages who tortured women and children to death. When the White man settled America he truly did CIVILIZE it.",
                "author": "Wexit-Delecto"
            },
            {
                "raw_content": "I love that Manifest Destiny is back!",
                "author": "Internet_hugs"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 REPORTER: Are you referring former President Obama to the DOJ for criminal implications? DNI TULSI GABBARD: \"Correct.\"",
        "score": 1950,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nobody is above the law! Even if you have a D.",
                "author": "Iremembermypassword"
            },
            {
                "raw_content": "Tulsi was almost the DNC nominee for president. Now she's this generation's Joe McCarthy. I dont hate it. I just hope she knows what she's in for.",
                "author": "GrizzlyT55"
            },
            {
                "raw_content": "Good thing there is precedent for arresting and charging former presidents",
                "author": "NamendaBiden"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Hillary's temper has been known for a while now",
        "score": 1315,
        "text_content": "",
        "comments": [
            {
                "raw_content": "0% chance \"black eye\" is a sex act",
                "author": "HuntsBiden"
            },
            {
                "raw_content": "Yeah, 50+ dead acquaintances was a good clue",
                "author": "Sea_Still"
            },
            {
                "raw_content": "So she attacked and harmed a US president?????? Omg treason! Execute immediately",
                "author": "Wrexxis780"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "C3: Here it is… The exact moment John Brennan committed perjury. The Russiagate documents Tulsi Gabbard released prove this is 100% a lie. Lock him up. (VIDEO)",
        "score": 1640,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fun fact: Brennan is a Muslim shitbag",
                "author": "Sea_Still"
            },
            {
                "raw_content": "Should I say it? Nothing will happen to this commie.",
                "author": "ImYourHuckleberry24"
            },
            {
                "raw_content": "Kash Patel sitting behind gowdy?",
                "author": "sixfingerdildo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Nintendo Switch 2 Is the Fastest-Selling Gaming Hardware in U.S. History - IGN",
        "score": 217,
        "text_content": "",
        "comments": [
            {
                "raw_content": "off-setting their consoles from Xbox and PlayStation may end up being the best decision Nintendo ever made",
                "author": "cquinn5"
            },
            {
                "raw_content": "I love it people complain about them and their prices and the fact you dont 'own' it and its the fastest selling, Nvidia of the Console world.",
                "author": "SSJNinjaMonkey"
            },
            {
                "raw_content": "Took one look at the game prices and knew I'd never own one unless someone quickly jailbreaks it.",
                "author": "shugthedug3"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Kioxia unveils highest capacity SSD at 245.76 TB – Blocks and Files",
        "score": 5,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Instead of selling to Meta, S.Korean AI chip startup FuriosaAI signed a huge customer: LG",
        "score": 55,
        "text_content": "",
        "comments": [
            {
                "raw_content": "In the title, \"selling to Meta\" should be \"selling itself to Meta\" or \"being acquired by Meta.",
                "author": "1mVeryH4ppy"
            },
            {
                "raw_content": "I don’t get how startups can do this but Intel cannot sell shit.",
                "author": "RandomFatAmerican420"
            },
            {
                "raw_content": "How unfortunate. In hindsight they will wish they sold themselves to Meta cause thats the only way any Korean AI company is going to make money. They just don't have the capital and brainpower that China and the US has due to local work policies that makes all of their talent flee to other countries. Plus, where do they plan on getting access to leading edge nodes for their chips? TSMC is booked and Samsung foundry is circling the drain. Its going to be difficult for them to gain more customers with chips built on inferior nodes that use more energy and generate more heat, but oh well, wish them luck I guess.",
                "author": "REV2939"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD Ryzen Threadripper PRO 9000WX series now available: 96-cores at $11,700",
        "score": 67,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The Pro WX CPUs are available to buy here in the UK as retail products. Looks like Non Pro X CPUs are releasing on the 31st July.",
                "author": "Greenecake"
            },
            {
                "raw_content": "I was in for five of these but $1.99 shipping killed the deal.",
                "author": "milk-jug"
            },
            {
                "raw_content": "[9995WX review, die shot and overclock from Asus China PM on Bilibili.](https://www.bilibili.com/video/BV1688wzvEUb/) No subtitles tho.",
                "author": "antifocus"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nintendo Direct to be announced tomorrow. Source: My Panda Express fortune cookie",
        "score": 482,
        "text_content": "",
        "comments": [
            {
                "raw_content": "if this isn't true I'll downvote every post you've ever made",
                "author": "Valsera"
            },
            {
                "raw_content": "Considering we had someone use tarot cards for switch 2 information, this is one of the lesser crazy sources.",
                "author": "Trainrot"
            },
            {
                "raw_content": "This is as reliable as every other leaker's predictions.",
                "author": "C-Towner"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Official switch camera was largely ignored",
        "score": 252,
        "text_content": "https://www.nintendolife.com/news/2025/07/nintendos-official-camera-attach-rate-with-switch-2-revealed-for-us Looks like software and accessories have generally done well based off early data released. It however looks like early adopters do not giving a flying f word about this camera. Curious what nintendo expected the attach rate to be.",
        "comments": [
            {
                "raw_content": "There's really no reason to buy it when cheaper alternatives exist. And I mean a lot cheaper.",
                "author": "StockHumor4768"
            },
            {
                "raw_content": "It's not proprietary, which explains why. It's also not mandatory for vast majority of games.",
                "author": "Paperdiego"
            },
            {
                "raw_content": "I can’t imagine they had any sort of expectations for the camera. If they’d wanted it to sell well, they wouldn’t have allowed unofficial cameras to work.",
                "author": "twili-midna"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "DK Artist",
        "score": 311,
        "text_content": "Messing around in it. A little finicky but its fun.",
        "comments": [
            {
                "raw_content": "That's pretty good",
                "author": "vinnieg007"
            },
            {
                "raw_content": "How long did it take you to do this? I haven't had a chance to mess around with this.",
                "author": "starstufft"
            },
            {
                "raw_content": "A perfect use of the feature!",
                "author": "Eevee-Fan"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "We have the Switch 2 with Mario Kart and Donkey Kong at home",
        "score": 563,
        "text_content": "I haven’t picked up the new Donkey Kong yet, but I will soon",
        "comments": [
            {
                "raw_content": "It even has the superior version of Wind Waker, which immediately objectively triples the console's value.",
                "author": "DSMidna"
            },
            {
                "raw_content": "Wii U walked so the Switch/Switch 2 could run",
                "author": "Extra-Ad5925"
            },
            {
                "raw_content": "Tropical Freeze is criminally underrated",
                "author": "DM_ME_KUL_TIRAN_FEET"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Walmart \"Onn\" brand SD card dead within days",
        "score": 162,
        "text_content": "Just a PSA for those looking to potentially save some money with the Onn brand cards from Walmart. I bought a 512GB card earlier this week and it appears to have already failed. Not worth the gamble",
        "comments": [
            {
                "raw_content": "Looks like your Onn card… turned off. Mine still is going strong.. exchange it for another one.",
                "author": "richbrehbreh"
            },
            {
                "raw_content": "First I've heard of this. I have an Onn card, it's working just fine for me.",
                "author": "Odd_Insurance8400"
            },
            {
                "raw_content": "Did you try to exchange it? It is very possible that you got a defective product. That doesn’t mean the entire brand is defective.",
                "author": "Neomastermind"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Even $85 Switch 2 controllers just flew off store shelves",
        "score": 230,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It’s absolutely worth it. It’s a fantastic controller.",
                "author": "LiarInGlass"
            },
            {
                "raw_content": "It should be the default controller tbh. If they offered a bundle with it it’d be really nice",
                "author": "HGLatinBoy"
            },
            {
                "raw_content": "It’s tied with the ps5 controller for my favorite controller ever. Super comfortable and worth the price",
                "author": "NewDamage31"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The Nintendo Switch 2 Is the Fastest-Selling Gaming Hardware in U.S. History - IGN",
        "score": 903,
        "text_content": "",
        "comments": [
            {
                "raw_content": "When it was forecasted to do very well, saw a comment that was confused thinking there was zero hype and questioning if they were in an echo chamber. Yes, you were random redditor.",
                "author": "dixie12oz"
            },
            {
                "raw_content": "OH, BANANA! #🍌 #🤪",
                "author": "__-_-_--_--_-_---___"
            },
            {
                "raw_content": "Online echo chambers punching the air furiously right now.",
                "author": "Lavosking"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "First time with bananza on 14 hours flight.",
        "score": 230,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I immediately thought that picture of the sore hand was due to all your DK activity 😂",
                "author": "straxusii"
            },
            {
                "raw_content": "Having all that time to game is such a great feeling at the start, it is a struggle towards the end of the flight though if you can't sleep.",
                "author": "coletrain93"
            },
            {
                "raw_content": "The Bioshock 1 starting scene fits much better in this situation than dkb in case someone is watching at your screen",
                "author": "jemensch"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "[Dusk Golem] Silent Hill 1 Remake started development 3 years ago, possibly launching in 2027, Townfall launching next year",
        "score": 279,
        "text_content": "[Source](https://xcancel.com/AestheticGamer1/status/1948195564803572136?t=YUm86X_N_8YO7EB0nT2jwA&s=19)",
        "comments": [
            {
                "raw_content": "If true that is fucking crazy holy shit.",
                "author": "dpanim"
            },
            {
                "raw_content": "Bloober remaking SH1 too right?",
                "author": "RudeRehash"
            },
            {
                "raw_content": "I was a doubter but recently got SH2 Remake as it was on sale for $30 on PC recently and my balls were blown clean off by how good it is. If they can keep that quality up for the eventual SH1 and 3 remakes I’ll be a happy guy.",
                "author": "Crimsonclaw111"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "IGN has prematurely revealed a LEGO GameBoy set for $59.99 USD, featuring cartridges for Super Mario Land & Link’s Awakening",
        "score": 412,
        "text_content": "https://www.ign.com/articles/lego-game-boy-set-revealed I only say “prematurely,” as IGN themselves are acting like LEGO fully revealed this, but the link they put in their article is non-functional, and I can’t see where LEGO has officially revealed this anywhere **EDIT:** LEGO did reveal that a GameBoy set was in the works a few months ago, but IGN are the first ones to post photos of it and revealing other details. You can say LEGO technically did already reveal this, but they certainly didn’t reveal everything like IGN are currently doing, to the extent where they posted a broken link",
        "comments": [
            {
                "raw_content": "Legoleaks just reaffirmed it, it's true.",
                "author": "Midnight_M_"
            },
            {
                "raw_content": "IGN top leaker",
                "author": "OwnAHole"
            },
            {
                "raw_content": "It's up on the [LEGO Store](https://www.lego.com/en-us/product/game-boy-72046?CMP=AFC&CMP=AFC-AffiliateUS-FKSJxY2VJAk-1324061-1606623-10) now, so this only went up a few minutes early (or LEGO is a few minutes late)",
                "author": "VolksDK"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Rebs Gaming: Direct proof that 343 Industries investigated Unreal Engine for Halo Infinite in 2017 and why they chose Slipspace Engine instead.",
        "score": 310,
        "text_content": "Source: https://youtu.be/ZBzHWRbQYcg?si=Wcml-oj0_XYj4kxH As explained in Rebs video report, he discovered an official Halo Infinite documentary on a former developers Vimeo that was created in 2017 to pitch Infinite to Microsoft and secure funding. The documentary, which is now unavailable because the source set it to private, confirms 343 investigated Unreal Engine for Halo Infinite in 2017 for a few months. They held a vote with leadership who voted 85% in favor of Slipspace mainly because it would’ve taken at least 2 years to develop the foundation of Infinite in Unreal. Also, their investigation proved that the Halo feel can be recreated in Unreal Engine which is a good sign for future Halo games. Reb’s video includes screen shots of the documentary and directly confirms Bloomberg’s report from December 2021 about 343 investigating Unreal Engine.",
        "comments": [
            {
                "raw_content": "As much as I like proprietary engines, this was a disastrous choice for a company that uses so much contracted work.",
                "author": "RinRinDoof"
            },
            {
                "raw_content": "> mainly because it would’ve taken at least 2 years to develop the foundation of Infinite in Unreal it took like 4 years with Slipspace lol",
                "author": "Inevitable_Judge5231"
            },
            {
                "raw_content": "343 is one of the funniest developers out there. It’s a miracle halo infinite came out",
                "author": "Setther"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Resident Evil Movie Leak Reveals Link to Games",
        "score": 20,
        "text_content": "[Source](https://insider-gaming.com/resident-evil-movie-leak-reveals-link-to-games/)",
        "comments": [
            {
                "raw_content": "As long as Constantin Films is involved in making these, I have zero confidence in any Resident Evil movie.",
                "author": "everythingsc0mputer"
            },
            {
                "raw_content": "If true, attaching the Resident Evil name to it with no subtitle just seems like a horrible idea lol I can already see angry fans that this movie has no ties to RE besides the world and references. What's funny is that Zach Cregger is writing it so chances are it'll be good",
                "author": "Powerful_Offer_7045"
            },
            {
                "raw_content": "Oh finally something about this movie... oh damn its source is Daniel RPK",
                "author": "Midnight_M_"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[billbill-kun] Battlefield 6 to be €80 on PS5 and Xbox",
        "score": 529,
        "text_content": "- €70 on PC for the base edition - €100 for Phantom Edition on PC and €110 for consoles - No early access via preorders/premium edition or via subscription Cover art for the Phantom Editon: https://ibb.co/HDByq4Pg Source: https://www.dealabs.com/magazine/battlefield-6-date-de-sortie-editions-prix-precommande-on-vous-devoile-toutes-nos-infos-inedites-60267",
        "comments": [
            {
                "raw_content": "#BilBil-Kun is a Tier 2 - Generally Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "These fools underestimate my backlog!",
                "author": "BattlebornCrow"
            },
            {
                "raw_content": "Doesn’t mean the game is 80$ US on PS/Xbox btw. FC26 on Steam is 70 Euros as well, but 80 euros on PSN/XBL, despite the US price being the same between the two.",
                "author": "oilfloatsinwater"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Battlefield 6 additional information from dataminer 1BF",
        "score": 344,
        "text_content": "- On July 31, the multiplayer trailer will be presented, and pre-orders will also open there. - The length of tomorrow’s trailer is 2 minutes 21 seconds. - The current release date is October 10 but may still be postponed so not a 100% lock yet - The game will also have a “Phantom Edition” - Pre-orders will tentatively open on July 31. - Game price is expected to be $70/100 for standard and deluxe respectively. Game Description: “Lock & load for the ultimate all-out warfare experience. Fight in high-intensity infantry combat. Rip through the skies in aerial dogfights. Demolish your environment for a strategic advantage. In a war of tanks, fighter jets, and massive combat arsenals, your squad is the deadliest weapon. This is Battlefield 6.” Source: 1BF via Telegram",
        "comments": [
            {
                "raw_content": "No mention of naval warfare but that could come later as DLC potentially",
                "author": "ZamnBoii"
            },
            {
                "raw_content": "Do you guys think EA has learned from their broken unfinished Games like Mass Effect Andromeda, Anthem, Battlefront 2, Battlefield 5, Jedi Survivor, Battlefield 2042, etc.?",
                "author": "Lymbasy"
            },
            {
                "raw_content": "Asking for played the test: do vei:cles actually spwan on the map like bf3/4 or you need to spawn into them like Bf1 and onward?",
                "author": "Lz537"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Hyrule Warriors Age of Imprisonment has been rated in Brazil",
        "score": 279,
        "text_content": "https://xcancel.com/necrolipe/status/1947994561927885250 Officially Nintendo has not announced a firm release window for the game, but since it now got rated in Brazil that must mean it’s somewhat close",
        "comments": [
            {
                "raw_content": "Yeah that direct is happening soon",
                "author": "Aftermoonic"
            },
            {
                "raw_content": "But was it rated in PH Brazil?",
                "author": "weallfloatdownhere7"
            },
            {
                "raw_content": "Hope they don't back down on the time travel aspect because of people whining about the previous game. If anything, they should go even harder considering TotK is already very time travel focused. Age of Calamity's story was fun fanservice which is really all you need for a game like this, and the movesets and character identities were mostly solid. I want Kass and Tulin to be in the roster at minimum.",
                "author": "Lerkpots"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "A new Metro game could be revealed soln",
        "score": 364,
        "text_content": "https://xcancel.com/InsiderGamingIG/status/1947710734101844477#m 4A games has been inactive on social media since february this year, they recently have started to post frequently. Media speculates that a reveal 'might' happen at Gamescom in August.",
        "comments": [
            {
                "raw_content": "Soln",
                "author": "DeepRelative"
            },
            {
                "raw_content": "Not soln enough.",
                "author": "Lolkimbo"
            },
            {
                "raw_content": "Old rumours said, game was in production since 2023…announcement should be imminent",
                "author": "Aromatic_Flight6968"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "INTEL Arc Graphics 32.0.101.6972",
        "score": 29,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Biggest thing in this update for me is finally they allowed iGPU memory allocation for Intel Core Ultra Series 1 & 2. This is huge! I haven't tested this drivers on my MSI Claw yet, really excited to use this features because it can solve a lot of texture issue and low memory warning in the game where it only detect Arc integrated graphics with 128MB vram.",
                "author": "no_salty_no_jealousy"
            },
            {
                "raw_content": "I get crashing in ALL games when attempting to use the new Speed Sync option on this driver. Specs are: Ryzen 9700x, Arc B580, 32GB DDR5 RAM, 2tb SSD. (Will make an actual post for more visibility)",
                "author": "Hippieman100"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Can't seem to get the website working.",
        "score": 4,
        "text_content": "I have tried for two days now to download the software updates for my intel hardware, but every time I click \"Download all\" or even just \"Download\" it does nothing. https://preview.redd.it/qcb9vcj5zoef1.png?width=1793&format=png&auto=webp&s=ac0e776ff0c8e44cbec3d54c49e451279642abd3 Am I missing something super simple here?",
        "comments": [
            {
                "raw_content": "have you tried another browser? Are you using some security tools or extensions that might be blocking this?",
                "author": "ACiD_80"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Steam Deck 2 rumored to be in the works — and it may arrive with a massive AMD APU upgrade",
        "score": 127,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"According to Moore's Law Is Dead...\" Oh, okay, so it isn't happening yet. Figured.",
                "author": "JoshJLMG"
            },
            {
                "raw_content": "may arrive with apu upgrade? gee it almost seems like it would be pointless to even make one without an upgrade.",
                "author": "WayDownUnder91"
            },
            {
                "raw_content": "If they call it the Steam Deck 2, we gotta be ready for it to be the last handheld in the Steam Deck line.",
                "author": "AllyTheProtogen"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "MSI Claw A8 First Look! Ryzen Z2 Extreme Is Finally Here!",
        "score": 25,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The Z2 Extreme is faster than its predecessor, but it doesn't seem to be an exciting one. I was hoping for more, but at least it's not a regression, given our current times.",
                "author": "pullupsNpushups"
            },
            {
                "raw_content": "Expensive for sure. I want a PC handheld but I want to wait for RDNA4/UDNA to come to an APU.",
                "author": "Washington_Fitz"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Ryzen Threadripper PRO 9000WX series now available: 96-cores at $11,700",
        "score": 23,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Do I want one, oh gawd yes. Would most of it be idle, oh gawd yes. Can I afford it, f no.",
                "author": "Zombie256"
            },
            {
                "raw_content": "Any of you buying one?",
                "author": "Celcius_87"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Today’s housing market is so upside down there are more senior citizens buying homes than Gen Z and Millennials",
        "score": 734,
        "text_content": "[https://archive.ph/04CUW](https://archive.ph/04CUW) I'm sure this is going to end well. * In 2024, more homes were bought by people over 70 than by those under 35, according to National Association of Realtors data. * Older baby boomers (aged 70–78) accounted for 22% of purchases; younger millennials (aged 26–34) and Gen Zers (under 25) made up just 14% and 5%, respectively. * The median age of first-time buyers rose from 28 in 1991 to 38 in 2024. * Overall homebuyer median age hit a record 56 in 2024, up from 46 in 2021, driven by high prices and steep mortgage rates.",
        "comments": [
            {
                "raw_content": "Growing up with a single mom she always used to brag that she made it work making 30k in 1995. We had a 1500 sq foot that she had built in 1993. She sold it in 2013 for 265k. Just looked it up and is now going for 670k. So what a single mother was able to achieve in 1995 now takes two high earning professionals to afford. The location was Litchfield, NH. Sleepy little suburb with next to nothing in it. Its fucking bullshit.",
                "author": "G90_G54"
            },
            {
                "raw_content": "[removed]",
                "author": "None"
            },
            {
                "raw_content": "Boomers will keep on preying on younger generations until the end.",
                "author": "Dry-Interaction-1246"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Housing market flashes fresh red alert as key signal crashes to 30‑year low",
        "score": 185,
        "text_content": "",
        "comments": [
            {
                "raw_content": "1995 interest rates, 2023 prices.",
                "author": "Likely_a_bot"
            },
            {
                "raw_content": "And 1995 was the start of nothing nice",
                "author": "DirtyRotter"
            },
            {
                "raw_content": "From the article: > Home sales are set to plunge to a 30-year low — with experts warning the slump could deepen into a full‑blown collapse. > **Just four million transactions are expected in the US this year**, according to new data from Realtor.com. > **That would mark lowest level since 1995**, according to the National Association of Realtors.",
                "author": "ColorMonochrome"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Home Sales Drop in June to Their Lowest Level in 9 Months as Prices Hit New All-Time High",
        "score": 188,
        "text_content": "",
        "comments": [
            {
                "raw_content": "In other words the trend of the middle and lower end of the market freezing solid while only the upper end moves continues on.",
                "author": "AwardImmediate720"
            },
            {
                "raw_content": "When June is lower than the fall, things are fucked.",
                "author": "Dry-Interaction-1246"
            },
            {
                "raw_content": "Bizarro Market. The housing MARKET is the only market that prices go up when demand declines and inventories rise. Ridiculous and disgusting corporate and investment bank market manipulation.",
                "author": "davecskul"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Stuck in a house we don’t want",
        "score": 12,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The delusion of the OOP is incredible to behold. Zero research, didn't know what they really wanted, now looking for a get out of jail free card in a rapidly softening market. Fantastic.",
                "author": "vblade2003"
            },
            {
                "raw_content": "Unf in my social circle got a few friends who are in similar situation. They bought homes they cannot afford after they rushed to buy it without any due diligence during covid housing boom.",
                "author": "Dmoan"
            },
            {
                "raw_content": "This time is different, buyers are highly qualified.",
                "author": "Original-Debt-9962"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Institutional landlords see new competition from an unexpected source",
        "score": 75,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yes, let's see how thousands of new rentals entering the market all at once will work out for these people.",
                "author": "Likely_a_bot"
            },
            {
                "raw_content": "Saved you a click >Now some frustrated sellers are deciding to de-list their properties and instead offer them on the rental market. >",
                "author": "RAITguy"
            },
            {
                "raw_content": "Just wait for: - The extra cost fixing all the damage - Regular maintenance on two homes - Decrease rental rates due to more availability - A lower price when it comes to selling because I would think twice before buying a house that was a rental.",
                "author": "VacationAgreeable912"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Dow jumps 500 points, S&P 500 closes at another record on Trump trade deal optimism",
        "score": 4,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Stocks rose on Wednesday as the latest trade developments spurred optimism on Wall Street that the U.S. would reach more deals before its impending tariff deadline. The Dow Jones Industrial Average added 507.85 points, or 1.14%, ending at 45,010.29 and missing a record close by about four points. The S&P 500 climbed 0.78% for a record close of 6,358.91 — its 12th of the year. The broad-market index also hit a new all-time intraday high in the session. The Nasdaq Composite rose 0.61%, settling at 21,020.02 — its first close above the 21,000 threshold. Trump said in a Truth Social post Tuesday night that the U.S. had completed a \"massive Deal\" with Japan. The agreement includes \"reciprocal\" tariffs of 15% on the nation's exports to the U.S. The president also said the U.S. is meeting with European officials in a push to reach a trade deal with the European Union. Stocks received a bit of a boost later Wednesday after the Financial Times reported that the U.S. is closing in on a 15% tariff agreement with the European Union, saying that it would echo the U.S.-Japan deal. Bloomberg also confirmed the progress between the U.S. and the EU, citing diplomats briefed on the negotiations. The U.S. has been looking to reach trade deals with other countries ahead of an Aug. 1 deadline. Earlier this week, the White House revealed that the U.S. and Indonesia agreed to the framework of a trade agreement. That follows a number of other trade agreements the U.S. has reached with other countries, including China and the United Kingdom. The developments come after Trump on April 2 sent markets into turmoil, with his announcement of sweeping levies that he then pushed off. \"So far, the tariff strategy Trump is pursuing looks very inspired, generating serious income, resulting in major investments in the U.S. to avoid the tariffs, and has yet to cause the disruptions and inflation that the naysayers said were certain,\" said Louis Navellier, founder and chief investment officer at Navellier & Associates. \"The stock market certainly reflects no fear of negative consequences.\" Wednesday's moves follow a second straight day concluding at a high for the S&P 500.",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The national median existing-home price in June rose to $435,300, a record in data going back to 1999 and a 2% increase from a year earlier",
        "score": 27,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Definitely could not afford that on a Walmart wage today, but back in 2012, I could!",
                "author": "Select_Factor_5463"
            },
            {
                "raw_content": "denial stage",
                "author": "Acrobatic-Reply-1561"
            },
            {
                "raw_content": "and I ohp—",
                "author": "searsnotwillistower"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Single-Family Home Sales Drop Below 1995, Supply Highest since 2016. Condo Sales at Low in the Data, Supply at Housing Bust Level",
        "score": 2,
        "text_content": "https://wolfstreet.com/2025/07/23/single-family-home-sales-drop-below-1995-supply-highest-since-2016-condo-sales-at-low-in-the-data-supply-at-housing-bust-level/ Single-Family Home Sales Drop Below 1995, Supply Highest since 2016. Condo Sales at Low in the Data, Supply at Housing Bust Level | Wolf Street",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "GPT-5 is the smartest thing. GPT-5 is smarter than us in almost every way - Sama",
        "score": 336,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Every Sam interview: “I used our newest model this morning and it really changed my life” “Someone I know uses it for like everything in their life” “I feel like privacy is important” “Imagine we had a device listening to everything in your life” “This is coming very soon” “I can’t see the future”",
                "author": "Routine-Addendum-532"
            },
            {
                "raw_content": "He's saying this for two reasons: 1. He wants people to think AGI is here ASAP so he can cut out Microsoft via their contract 2. Hype helps him raise money",
                "author": "UnknownEssence"
            },
            {
                "raw_content": "My first prompt: \"make me my own chat GPT-6\"",
                "author": "PhilosopherWise5740"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Trump signs MAJOR executive orders on artificial intelligence. \"Winning the Race: America’s AI Action Plan”: accelerating AI innovation, building AI infrastructure, and establishing the U.S. as a leader in AI globally",
        "score": 415,
        "text_content": "https://youtu.be/4t6H5Yan0oI?si=RttcQsohDkn1gemx https://time.com/7304994/trump-ai-regulation-plan/ “From this day forward, it’ll be a policy of the United States to do whatever it takes to lead the world in artificial intelligence,” Trump said at the event.",
        "comments": [
            {
                "raw_content": "Maybe the AI will release the Epstein Files",
                "author": "Weekly-Fortune2611"
            },
            {
                "raw_content": "Same signature as on his buddy Epstein’s bday card?",
                "author": "Precious_Tritium"
            },
            {
                "raw_content": "Remember when he used to gleefully sign executive orders? He just doesn’t seem really into it as much anymore. I wonder what’s on his mind? /s",
                "author": "ItsJustJames"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Demis Hassabis VS Sam Altman on 'Winning' the AI Race",
        "score": 171,
        "text_content": "",
        "comments": [
            {
                "raw_content": "When the video loops around for the second view it's comedy gold! The contrast omg. You should have put the Demis video first!",
                "author": "_Divine_Plague_"
            },
            {
                "raw_content": "Demis is a class act",
                "author": "Brazilll"
            },
            {
                "raw_content": "“Me Me Me” Guy vs an Adult",
                "author": "tsekistan"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Trump doesn't want xAI to get government contracts, white house says.",
        "score": 170,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We all knew the breakup between these two was going to be hilarious. It has not disappointed.",
                "author": "Sota4077"
            },
            {
                "raw_content": "The Pentagon gave xAI a 200m contract yesterday, soooo....",
                "author": "One_Fuel3733"
            },
            {
                "raw_content": "Didn't they just sign a $200 mil contract with the DOD? 🤔",
                "author": "ExoTauri"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"What if AI gets so smart that the President of the United States cannot do better than following ChatGPT-7's recommendation, but can't really understand it either? What if I can't make a better decision about how to run OpenAI and just say, 'You know what, ChatGPT-7, you're in charge. Good luck.\"",
        "score": 197,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Id rather have AI than 99% of politicians",
                "author": "AlvinChipmunck"
            },
            {
                "raw_content": "Current president could be replaced with ChatGPT 3.5 and we'd be better off!",
                "author": "Singularity-42"
            },
            {
                "raw_content": "This reminds me of that situation in 3 Body Problem where the world has to follow what 3 people plan in their heads Except that this would be GPT-7 and I’d trust GPT-7 more than the vast majority of humans. Just look at the world right now",
                "author": "terrylee123"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Tesla Optimus Freezes as Starlink Chokes on Opening Day of Tesla Diner",
        "score": 424,
        "text_content": "https://electrek.co/2025/07/23/tesla-teleoperated-robot-fail-serving-popcorn-first-day-new-diner/",
        "comments": [
            {
                "raw_content": "\"Hey bud, while youre on the phone maybe can I get my popcorn?\"",
                "author": "HomoProfessionalis"
            },
            {
                "raw_content": "Teleoperated?",
                "author": "otarU"
            },
            {
                "raw_content": "This is because unlike the Figure bots, Tesla bots lack built in intelligence and will have it around the same time Tesla finally delivers real safe FSD.",
                "author": "ataylorm"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "VP of Research at Google Deepmind Says the Big AI Labs are Technically Already Working Together.",
        "score": 585,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They're all inside Zuckerberg's recruitment group chat",
                "author": "averagebear_003"
            },
            {
                "raw_content": "They are all friends. They all go to the same parties. They hang out at the same bars. They're all roommates. They all have one topic they like talking about. It's informal, but the labs share ideas both accidentally and intentionally.",
                "author": "Iamreason"
            },
            {
                "raw_content": "Through the researchers recruitment",
                "author": "FeathersOfTheArrow"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "LAST CALL BEFORE A.G.I",
        "score": 313,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Excellent and disturbing. Very well made.",
                "author": "neoneye2"
            },
            {
                "raw_content": "Great job, stepped up again, love it.",
                "author": "fake_agent_smith"
            },
            {
                "raw_content": "Apt depiction of the humanity's end game where most of us have time to play maybe one more card before it all comes to an end, for better or worse.",
                "author": "strangeapple"
            }
        ],
        "subreddit": "singularity"
    }
]