[
    {
        "post_name": "Trump Truth: I am pleased to inform our many U.S.A. Patriots that I am designating ANTIFA, A SICK, DANGEROUS, RADICAL LEFT DISASTER, AS A MAJOR TERRORIST ORGANIZATION.",
        "score": 2693,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fuck. Yes. Edit: And praise God!!! Thank you, Father!",
                "author": "b00nis"
            },
            {
                "raw_content": "Is this a happening? For real?",
                "author": "xBigCoffinHunter"
            },
            {
                "raw_content": "Patriots dot win posts an open letter calling for antifa to be declared terrorists (and their funding investigated). Less than a week later GEOTUS declares them terrorists and uses the word patriots in the post. You’re welcome, America.",
                "author": "asdrubael_was_right"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "They never say what they mean, and never mean what they say",
        "score": 837,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Perfect",
                "author": "Define_Assault"
            },
            {
                "raw_content": "The movie JFK with Kevin Costner has a great scene in it where his wife is yelling at him for how much danger he's put their family in by investigating JFK's assassination. She eventually asks why he continues to push forward on the investigation and he said something that's always stuck with me. He told her the reason why he keeps going forward is that his eyes have been opened to the truth and he can not shut them or go back to the way he was before he knew what he's found out. It's the redpill in shorter terms but the reality for all of us is that once we see the world for what it really is, there's no turning back. We either fight on or die. What we know about our society, especially after Charlie's slaying, will never leave our minds. We see the world differently and more clearly now. More and more people are going through this change everyday and it should terrify the fuck out of the left and the lies they have been telling them for so long.",
                "author": "jlange94"
            },
            {
                "raw_content": "Based",
                "author": "djpat"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "American Antifa are almost an entirely domestic network, but they do maintain links with Antifa in Canada and Europe. Secretary of State @SecRubio @marcorubio should consider declaring the international manifestations of Antifa as foreign terrorist entities to the U.S. government.",
        "score": 696,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Antifa up here in leafland is fucking terrifying. Please drone them. https://www.thebureau.news/p/discord-chat-platform-scrutinized https://archive.ph/f6R4V",
                "author": "Wexit-Delecto"
            },
            {
                "raw_content": "All enemies, foreign and domestic.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "follow the money.",
                "author": "ChyNahAzzWhole1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 Jimmy Kimmel faces FEDERAL investigation after telling viewers Charlie Kirk suspect Tyler Robinson was MAGA",
        "score": 1596,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# FUCK # AROUND # FIND # OUT",
                "author": "1-800-GET-MAGA"
            },
            {
                "raw_content": "Shoulda just kept doing got girls on trampolines",
                "author": "DingleBalls"
            },
            {
                "raw_content": "Gloves are off. Love to see it. Voted for it, even.",
                "author": "PresidentialPepe"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Kirk-Chad Wins",
        "score": 1613,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Flawless Victory. # F A T A L I T Y",
                "author": "BlackPiIIedMAGA"
            },
            {
                "raw_content": "Charlie Kirk is becoming a lightning rod these communists can't resist touching. Keep it going and all of these motherfuckers will fry themselves. Good. ABC, cbs, etc dont give a shit about charlie, or the things their minions say on the air.. They think that one of these people will finally push us over the edge, and while they're all communist cocksuckers, they don't want to be the one that finally does push someone over the edge because they correctly surmise that they will probably be the first ones to die. That's why they're really afraid.",
                "author": "CLF3"
            },
            {
                "raw_content": "BUT BUT CHARLIE WOULD NOT HAVE WANTED KIMMEL TO BE CANCELLED..... PLEASE WITHDRAW AND GIVE US TIME TO REBUILD AND SHOW US YOUR EXPOSED BELLY!!!! ~ Basically libs",
                "author": "based_trekkie"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Based Sinclair",
        "score": 1506,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They need to clean up ABC Radio. Fucking commies.",
                "author": "HoganP"
            },
            {
                "raw_content": "Wonder what the angle is. Sinclair is conservative like mitt Romney",
                "author": "SanityGumby"
            },
            {
                "raw_content": "American may be healing.",
                "author": "Chickensaurus"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨🚨 BREAKING: Nexstar, who controls almost two-dozen ABC stations in MAJOR American cities, just announced they will NO LONGER AIR Jimmy Kimmel’s show",
        "score": 2165,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good news!",
                "author": "Trythisagain"
            },
            {
                "raw_content": "This is a real FAFO.",
                "author": "TrumpKirkGod"
            },
            {
                "raw_content": "Something is happening behind the scenes. In the past years media company's would be fine with loosing money.",
                "author": "saltyviewer123"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "In less than 250 days, 2 MILLION illegal aliens have left the United States.",
        "score": 1921,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Moar! That needs to be ten times higher.",
                "author": "Backlash11B"
            },
            {
                "raw_content": "That's great! But way behind pace. We still have at least 33m to go.",
                "author": "South_Florida_Guy"
            },
            {
                "raw_content": "This is before the massive injection of funds to ICE from the Big Beautiful Bill.",
                "author": "blackswans"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Disney’s ABC is PULLING Jimmy Kimmel off-air nationwide effectively IMMEDIATELY and indefinitely following his remarks about Charlie Kirk’s kiIIing, per WSJ. This might be the END of Kimmel’s career! FAFO, you piece of trash.",
        "score": 1775,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He can restart The Man Show as The Trans Show, sponsored by Bud Light.",
                "author": "OutlawPurpleHairDye"
            },
            {
                "raw_content": "When the FCC Chairman says \" we can do this the easy way or the hard way\" that would tend to get Bob iger's attention. Kimmel is just the sacrificial lamb so they don't get their licenses pulled. Either way it's glorious.",
                "author": "LandscaperJuan"
            },
            {
                "raw_content": "Probably just using this as a reason to cancel it, and project blame, Since there's no way they were making any money off this show w/ its viewership numbers.",
                "author": "Maga_Gator"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔴 JD Vance: \"To my friends on the political Right: I understand the feeling that people are putting words into Charlie Kirk's mouth. At some level, I agree and share your frustration\"",
        "score": 1070,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Charlie was a moderate. You haven’t seen “right” Mr. VP.",
                "author": "AlphaNathan"
            },
            {
                "raw_content": "Charlie would've hated thus post. Or loved it. Or felt indifferent to it Idk man, I just wanted to comment. Love Charlie though, he really grew on me. Didn't care for him or years, past two I became a real fan of his. Good man who blessed us all with his hard work and vigor.",
                "author": "MagaJay02"
            },
            {
                "raw_content": "WWCD",
                "author": "24601"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Exclusive: PDF of the pro-terror NGOs that Soros’ Open Society gave $80 million to.",
        "score": 992,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lets classify George Soros’s Open Society Foundations as a terrorist organization",
                "author": "CounterStrike"
            },
            {
                "raw_content": "Freeze all assets, confiscate.",
                "author": "CMDRConanAAnderson"
            },
            {
                "raw_content": "Hot diggity dang! It got sticky on PDW. Download and READ NOW!",
                "author": "BeauHD"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "KEK",
        "score": 1250,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm fucking ODing on salt today",
                "author": "UsernameChexOut"
            },
            {
                "raw_content": "The salt must flow!",
                "author": "TheSonOfGadsden"
            },
            {
                "raw_content": "He spent too much time on Reddit, bought their stupid lies hook line and sinker. Did he learn from his mistake or will he double down? I think we all know the answer",
                "author": "Pepe_longcockings"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "THIS",
        "score": 1229,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hello, my name is Huge Cock. No...no need to measure. It's my name.",
                "author": "Th3Cho0sing0ne"
            },
            {
                "raw_content": "Same tactic as \"The Federal Reserve\"",
                "author": "Johnrgalt"
            },
            {
                "raw_content": "How could you not support the \"Affordable Care Act?\" It's affordable you idiot. Says so right in the name. What? You don't approve of the \"Patriot Act\" either? Well, you must not be a patriot then.",
                "author": "adm0079"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "We got you, Charlie!",
        "score": 1640,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is anyone on the left funny? Like at all?",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "Going to attend a prayer vigil for Charlie tonight. I'm stoked. WE are NOT going to BACK DOWN. Amen.",
                "author": "BeauHD"
            },
            {
                "raw_content": "Serious Question: Does anyone under 70 watch late night TV in 2025?",
                "author": "OutlawPurpleHairDye"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Liberal Influencer Kendra James (thekendrajames2) made videos celebrating Charlie Kirk being assassinated She then made a video pretending she got fired from her job and made a GoFundMe, she’s already made $40k in one day It was a lie, she still has her job and is cashing in",
        "score": 981,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Has the attorney general in her home state been made aware of the fraud?",
                "author": "togger"
            },
            {
                "raw_content": "Dats fraud, yo",
                "author": "DingleBalls"
            },
            {
                "raw_content": "I'm not a doctor, but I think that's some kind of fraud",
                "author": "OneTypoComment"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: US House REJECTS removing Ilhan Omar from her committees and censuring her after she justified Charlie Kirk's assassination, 214-213. 4 RINO's voted with Democrats: Reps. Mike Flood (Nebraska), Tom McClintock (California), Jeff Hurd (Colorado) and Cory Mills (Florida).",
        "score": 1419,
        "text_content": "",
        "comments": [
            {
                "raw_content": "President Trump, please step in and personally Deport this disgusting invader.",
                "author": "TheAftermath"
            },
            {
                "raw_content": ":She should be deported... along with Reps. Mike Flood (Nebraska), Tom McClintock (California), Jeff Hurd (Colorado) and Cory Mills (Florida).",
                "author": "Bullet3250"
            },
            {
                "raw_content": "If it were the other way around the Democrats would have voted in lockstep. We're fucking weak.",
                "author": "Justjayce"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "AMAZING! More fearless patriots are on campus debating left-wingers, carrying on the legacy of Charlie Kirk. Carry the torch! 🇺🇸",
        "score": 1880,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good for them. They are better than I. I don't have a thing to say to anyone over on the left at this point.",
                "author": "airborne3502"
            },
            {
                "raw_content": "This is literally the best way to honor CK",
                "author": "indigo_truther"
            },
            {
                "raw_content": "Inspired by Charlie Kirk and communicating better than the adults in our country. I'm proud of them and this is real pride in their leader, their work and purpose.",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Charlie Kirk just one month ago: “Jimmy Kimmel says ‘repulsive’ liberal voices drive people away from Democrat Party but somehow fails to admit he's one of them.”",
        "score": 1194,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Charlie Kirk is a time traveller. Prove me wrong.",
                "author": "Get_Off_Big_Tech"
            },
            {
                "raw_content": "Bittersweet irony.",
                "author": "AgnesDomini"
            },
            {
                "raw_content": "Another miracle, Charlie Kirk cancels Kimmel from heaven. Charlie made some awesome comments, good find Op. This is the best about this horrible timeline, them getting cancelled.",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "JD Vance refuses to blame both sides for the rhetoric, saying Charlie Kirk is dead because of left-wing political radicalization, and he excoriates the media for lying.",
        "score": 2008,
        "text_content": "",
        "comments": [
            {
                "raw_content": "2028.. no doubt about it",
                "author": "ChyNahAzzWhole1"
            },
            {
                "raw_content": "Good on JD for refusing to back down.",
                "author": "ThreeTimeTrumper"
            },
            {
                "raw_content": "Imagine having a real VP the first time around instead of a leftist cuck?",
                "author": "MySaltIsBigger"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "LAND WHALE ---> BREAKING: Director of Health Promotion and Advocacy at Ball State University in Indiana has been FIRED after disgusting comments justifying Charlie’s ass*ssination Another one bites the dust! 💥😂",
        "score": 1061,
        "text_content": "",
        "comments": [
            {
                "raw_content": "She.... promotes...health? I'm confusioned.",
                "author": "Th3Cho0sing0ne"
            },
            {
                "raw_content": "Would someone please explain to me why they hire these ridiculously fat people and put them in a position of public health? It’s insane. Other than being meant to demoralize us, why do it???",
                "author": "GuerillaYourDreams"
            },
            {
                "raw_content": "If Sally Struthers and Jabba the Hutt had offspring...",
                "author": "Tikk"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "China bans tech companies from buying Nvidia’s AI chips",
        "score": 1143,
        "text_content": "Beijing’s regulators have recently summoned domestic chipmakers such as Huawei and Cambricon, as well as Alibaba and search engine giant Baidu, which also make their own semiconductors, to report how their products compare against Nvidia’s China chips, according to one of the people with knowledge of the matter. They concluded that China’s AI processors have reached a level comparable to or exceeding that of the Nvidia products allowed under export controls, the person added.",
        "comments": [
            {
                "raw_content": "Well I'll be dipped: it looks like they've actually gone and done it this time, rather than just threatening it. Though given the timing of the anti-trust investigation results - which were already widely accused of being a negotiating tactic for this week's trade talks - I have to assume this is similarly intended to be negotiating leverage. I'd be a quite a bit surprised if it were a complete and long-term ban.",
                "author": "Verite_Rendition"
            },
            {
                "raw_content": "That’s a matter of national interest and security. It was bound to happen sooner or later, even if they face some inefficiencies along the way. The U.S. push and sanctions have only strengthened China’s motivation to develop not just hardware, but also software and AI within its own borders.",
                "author": "r2vcap"
            },
            {
                "raw_content": "https://www.investopedia.com/china-bans-top-tech-firms-from-buying-nvidia-chips-report-says-11811683 no paywall here.",
                "author": "TwiKing"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "A19 Pro SoC microarchitecture analysis by Geekerwan",
        "score": 154,
        "text_content": "Youtube link available now: https://www.youtube.com/watch?v=Y9SwluJ9qPI Important notes from the video regarding the new A19 Pro SoC. A19 Pro P core clock speed comes in at 4.25Ghz, a 5% increase over A18 Pro(4.04Ghz) In Geekbench 6 1T, A19 Pro is 11% faster than A18 Pro, 24% faster than 8 Elite and, 33% faster than D9400. In Geekbench 6 nT, A19 Pro is 18% faster than A18 Pro, 8% faster than 8 Elite and 19% faster than D9400. In Geekbench 6 nT, A19 Pro uses 29% LESSER POWER! (12.1W vs 17W) while achieving 8% more performance compared to 8 Elite. A great part of this is due to the dominating E core architecture. In SPEC2017 1T, A19 Pro P core offers 14% more performance (8% better IPC) in SPECint and 9%(4% better IPC) more performance in SPECfp. Power however has gone up by 16% and 20% in respective tests leading to an overall P/W regression at peak. However it should be noted that the base A19 on the other hand acheives a 10% improvement in both int and FP while using just 3% and 9% more power in respective tests. Not a big improvement but not a regression at peak like we see in the Pro chip. In SPEC2017 1T, the A19 Pro Efficiency core is extremely impressive and completely thrashes the competition. A19 Pro E core is a whopping 29% (22% more IPC) faster in SPECint and 22% (15% more IPC) faster in SPECfp than the A18 Pro E core. It achieves this improvement without any increase in power consumption. A19 Pro E core is generations ahead of the M cores in competing ARM chips. A19 Pro E is 11.5% faster than the Oryon M(8 Elite) and A720M(D9400) while USING 40% less power (0.64 vs 1.07) in SPECint and 8% faster while USING 35% lower power in SPECfp. A720L in Xiaomi's X Ring is somewhat more competitive. Microarchitectually A19 Pro E core is not really small anymore. From what I could infer from the diagrams (I'm not versed in Chinese, pardon me), the E core gets a wider decode (6 wide over 5 wide), one more ALU (4 over 3), a major change to FP that I'm unable to understand, a notable increase in ROB entry size and a 50% larger shared L2 cache (6MB over 4MB). Comparatively the changes to the A19 P core is small. Other than an increase to the size of the ROB, there's not a lot I can infer. The A19 Pro GPU is the star of the show and sees a massive upgrade in performance. It also should benefit from the faster LPDDR5X 9600 memory in the new phones. In 3D Mark Steel Nomad, A19 Pro is 40% FASTER than the previous gen A18 Pro. The base A19 with 1 less GPU core and less than half the SLC cache is still 20% faster than the A18 Pro. It is also 16% faster than the 8 Elite. Another major upgrade to the GPU is RT (Raytracing) performance. In Solar Bay Extreme, a dedicated RT benchmark, A19 Pro is 56% FASTER than A18 Pro. It is 2 times faster (101%) than 8 Elite, the closest Android competition. Infact the RT performance of A19 Pro in this particular benchmark is just 2.5% slower (2447 vs 2558) than Intel's Lunar Lake iGPU (Arc 140V in Core Ultra 258V). It is very likely a potential M5 will surpass an RTX 3050 (4045) in this department. A major component of this increased RT performance seems to be due to the next gen dynamic caching feature. From what I can infer, this seems to be leading to better utilization of the RT units present in the GPU (69% utilised for A19 vs 50% utilised for A18). The doubled FP16 units seen in Apple's keynotes are also demonstrated (85% increase). The major benefits to the GPU upgrade and more RAM are seen in the AAA titles available on iOS which make a night and day difference. A19 Pro is 61% faster (47.1 fps vs 29.3fps) in Death Stranding, 57% faster (52.2fps vs 33.3fps) in Resident Evil, 45.5 faster in Assasins Creed (29.7 fps vs 20.4fps) over A18 Pro while using 15%, 30% and 16% more power in said games respectively. The new vapour chamber cooling (there's a detailed test section for native speakers later in the video) seems to help the new phone sustain performance better. In the battery section, the A19 Pro flexes its efficiency and ties with the Vivo X200 Ultra with its 6100mah battery (26% larger battery than the iPhone 17 Pro Max) for a run time of 9h27min. ADDITIONAL NOTES from youtube video: E core seems to use a unified register file for both integer and FP operations compared to the previous split approach in A18 Pro E. The scheduler for FP/SIMD and Load Store Units have been increased in size massively (doubled) P core seems to have a better branch predictor. SLC (Last Level Cache in Apple's chips) has increased from 24MB to 32MB. The major GPU improvements is primarily due to the new dynamic caching tech. RT units by themselves seem to not have improved all that much. But the new caching systems seems much more effective at managing registers size allocated for work. This benefits RT very much since RT is not all that suited for parallelization. TLDR; P core is 10% faster but uses more peak power. E core is 25% faster GPU is 40% faster GPU RT is 60% faster Sustained performance is better. There's way more stuff in the video. Camera testing, vapour chamber testing etc, for those who are interested and can access the link.",
        "comments": [
            {
                "raw_content": "Growing the E core into a medium core is really important and something I was worried apple might miss out on, but this means they should be able to keep up in multicore as trends point to flooding CPUs with E cores. They really ~~buried~~ deleted the lede by not even mentioning the E core improvements beyond the cache and undersold the GPU. I suppose this means we should expect a lot of bragging in the M5 keynote.",
                "author": "VastTension6022"
            },
            {
                "raw_content": "I cannot wait to see what's in store for 2026 Mac Studios and the M5 CPU. Especially if M5 Ultra makes its debut. AI workloads should see a significant performance boost by 3-4x? I wonder if M5 Ultra will offer 1000GB/s memory bandwidth.",
                "author": "meshreplacer"
            },
            {
                "raw_content": "I would be so curious about a die shot and GPU architecture of the A19 vs 8 Elite. Because Apple went from very little rt not so long ago to leading the charts. Like how many RT-Acceleration units are used in the GPU and how other components play into that. Definetly exciting times, I think that the major players, Qualcomm, Apple, and Mediatek, are not so far away from each other, the leader can change in a generation or two, which hasn't been the case often in recent history. Especially interesting will be how AMD client will turn out in 2026, if they are still on the charts (we expect Zen 6 clients on N3) or if Qualcomm will top windows charts, and Apple overall all the charts.",
                "author": "EloquentPinguin"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "8 Elite Gen 5 has SVE2 and SME",
        "score": 43,
        "text_content": "Features used by Geekbench: neon aes sha1 sha2 neon-fp16 neon-dotprod sve i8mm sme-i8i32 sme-f32f32 High ST score at 3831 too. https://browser.geekbench.com/v6/cpu/13864869",
        "comments": [
            {
                "raw_content": "So this might be a head to head with A19 Pro, if real devices perform on this level, and do not increase power consumption. SME2 beauty is Object Detection gaining 70% gen-on-gen. This is also big for Snapdragon X Elite Gen 2 (or whatever), which will hit probably above or around 4000 GB6, going strong against M4 (entry models being ~3700, high end ~4000), and might even compete with the M5. If WoA has improved a lot (and I hope we see some in depth testing of compatibility/emulation and stuff) and the GPU is not dogwater (both driver and performance wise) this could be a turning point, going from \"Somewhat faster to x86, nice battery, terrible compatibility\" to \"Much much faster than x86, very nice battery, good compatibility\" or anything in between.",
                "author": "EloquentPinguin"
            },
            {
                "raw_content": "Beating Apple to market on SVE2? Not too shabby",
                "author": "Salkinator"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Framework Desktop review: Mini PC wrapped in a mini-ITX body",
        "score": 10,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hello -protonsandneutrons-! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Why is the fan installed backwards and without the fan duct?",
                "author": "a12223344556677"
            },
            {
                "raw_content": "I don't understand this --- desktops are already repairable and upgradeable?",
                "author": "barkappara"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Zenji Nishikawa's 3DGE: AMD's efforts in AI high-definition technology \"FSR Redstone\" and neural rendering technology",
        "score": 42,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The modern renderer picks and choses from Raster and Ray/Path Trace where the fit is best, and I just kind of assumed Neural would be added to that, but just part of the stack where it makes the most sense, w/o replacing the other two entirely.",
                "author": "Innovictos"
            },
            {
                "raw_content": "I'm not sure I fully understand. ML2CODE is converting the model from requiring Tensors to accelerate, to executable via Shaders? Is ML2CODE a static library that performs this conversion? Is it an ML-based neural conversion system? I have so many questions... if it's performant, then why wouldn't/couldn't any other Tensor-based operation be converted to run on Shaders alone? I don't know what to expect from Redstone. This article is discussing running the model via Shaders; other speculation (and working on Windows and Linux) is running a compiled, special version of FSR4 via INT4/8 and/or WMMA. So—AMD may have a way to run FSR4 across various Tensors, and even accelerate it on pure Shaders?",
                "author": "Shidell"
            },
            {
                "raw_content": ">FSR Redstone is being developed using AMD ML2CODE (Machine Learning to Code), a research project of ROCm. The core part of the neural rendering technology is converted into optimized Compute Shader code by using ML2CODE. This means that the neural rendering core of FSR Redstone can also be run on GPUs made by other companies .",
                "author": "Jeep-Eep"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "China trials its first advanced DUV tools for AI chipmaking",
        "score": 27,
        "text_content": "According to the Financial Times, China’s largest foundry SMIC is currently trialing a deep ultraviolet (DUV) lithography machine developed by Shanghai-based startup Yuliangsheng (裕量晟). DUV equipment is widely used in semiconductor manufacturing, and until now China had relied heavily on ASML tools. However, with new imports effectively blocked by U.S.-led sanctions, efforts to localize production are accelerating. The new system uses immersion technology, fundamentally supporting the 28nm process. With multiple patterning, it could produce chips down to the 7nm class. Some experts believe attempts at 5nm production might also be possible, though yields and stability would face major limitations. Meanwhile, domestic efforts toward EUV development are also underway. Shenzhen-based SiCarrier is pursuing an EUV lithography project under the codename “Mount Everest.” But this remains at an early stage, and the outlook for real mass production is still highly uncertain. Meanwhile, China’s semiconductor industry has announced plans to triple its production capacity by 2026. However, most of this expansion will inevitably rely on previously acquired ASML DUV equipment, and the newly developed domestic tools are not expected to be deployed in mass production lines until after 2027",
        "comments": [
            {
                "raw_content": "Thought so too. There were rumors that Huawei was going to trial local EUV machines by end of 2025. That would be too good to be true. You can't just jump to an EUV machine without developing DUV first.... Looks like those rumors were actually for DUV, not EUV.",
                "author": "IBM296"
            },
            {
                "raw_content": "China has too much resources and brain power, it looks like 3nm is really the \"threshold\" or so to speak anyway, we will be using 3nm for years, because later processes arent that much denser, and also are much more expensive.",
                "author": "Quatro_Leches"
            },
            {
                "raw_content": "Looks like they never managed to get SMEE's SSA800i working reliably huh. That was delivered about a year ago now and was in validation last time I heard about it. Wonder what's the future for SMEE if SiCarrier can just slip ahead of them in development.",
                "author": "logosuwu"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "LattePanda IOTA is a single-board PC with Intel N150 and up to 16GB LPDDR5 RAM",
        "score": 21,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Maybe going on a tangent but if we can make such small boards with anything we could ever need, why isn't there no one picking up on the netbook market, I found an ancient EEE asus netbook, and it felt so good to use besides the chip being impossible to use for anything.",
                "author": "zerinho6"
            },
            {
                "raw_content": "There’s also this website https://www.prnewswire.com/news-releases/lattepanda-iota-debuts-palm-sized-x86-single-board-computer-with-intel-n150-delivers-significant-performance-leap-302559314.html which has a statement by LattePanda.",
                "author": "AbhishMuk"
            },
            {
                "raw_content": "That's some serious RAM, curious about its performance",
                "author": "TheAppropriateBoop"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Am I missing something, or are firmware rootkits a possible and devastating attacks?",
        "score": 0,
        "text_content": "For years I have been thinking about the BIOS or UEFI firmware, and how closed source they are. Isn't this a really an extremely dangerous concept? Can't the firmware contain malicious code? Is the UEFI firmware able to access, and control everything within the OS, or are there protections in place somehow? What could we possibly do to even detect such behavior if manufacturers are including malware in their code? What about batches of motherboards sent to a target or a government? What is there to do?",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nailed it",
        "score": 230,
        "text_content": "Pauline knew I could do it… I had my doubts at certain points along the way.",
        "comments": [
            {
                "raw_content": "![gif](giphy|3EiNpweH34XGoQcq9Q|downsized)",
                "author": "dreadpiratedusty"
            },
            {
                "raw_content": "The game looks fun. Im gonna get it soon.",
                "author": "Opposite_Cheap"
            },
            {
                "raw_content": "That’s insane",
                "author": "knotbeginning"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Game Boy Advance – September 2025 Games Update",
        "score": 85,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Woah, Mr.Driller 2! I played shitton of that when i was young, i'm happy to see in on virtual console, i'll play that for sure! I never played Klonoa, maybe i'll give a try on that too. Nice update tbh.",
                "author": "LordAzuren"
            },
            {
                "raw_content": "Klonoa 👁️👄👁️",
                "author": "voltvirus"
            },
            {
                "raw_content": "Seeing Klonoa here is such a big deal, Im so happy",
                "author": "TyleNightwisp"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "New games for the collection",
        "score": 79,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nice. I am enjoying Hitman on my Switch 2",
                "author": "WeAreNephilim"
            },
            {
                "raw_content": "Needs more Toaplan",
                "author": "darkfawful2"
            },
            {
                "raw_content": "I thought patapon was a PlayStation exclusive. Neat.",
                "author": "ImpressiveJohnson"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Just managed to get a copy of two of the greatest games of all time! (At a very low price)",
        "score": 129,
        "text_content": "That’s the price for Amazon Spain plus I had a coupon of 10€ if I went to get my package instead of receiving at home (which is convenient since I’m working from 8:00 to 16:00). Damn, I’m so excited. These are my all time favorite games ever. I cannot express with words how much they mean to me, they changed my childhood and the way I see and love games as a whole. Glad more people will be able to experience it.",
        "comments": [
            {
                "raw_content": "Nice! Never played the Galaxy games debating on picking them up but just so packed with games for the rest of the year",
                "author": "Strict_Donut6228"
            },
            {
                "raw_content": "That's an absolutely legit prize in my opinion.",
                "author": "Themightygloom44"
            },
            {
                "raw_content": "Mario Galaxy was my first ever Mario game and is still my favourite one (I’ve only dabbled in some of the switch 1 games and never got into them fully) So I’m very excited to play it again and play galaxy 2 for the first time. I’m looking forward to the Bee planet the most",
                "author": "Complete_Bad6937"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Switch 1 games that got paid DLC announcements before release just like Pokemon Z-A",
        "score": 444,
        "text_content": "I am noticing a lot of chatter about the upcoming Pokemon DLC where people are at least insinuating this is some new tactic by Nintendo they don't like. But this has actually been done a few times in the past for other franchises. Here are the Switch 1 games with paid DLC announcements before the game even released: **The Legend of Zelda: Breath of the Wild** **DLC announced:** February 2017 **Game released:** March 2017 **Xenoblade Chronicles 2** **DLC announced:** November 2017 **Game released:** December 2017 **Fire Emblem: Three Houses** **DLC announced:** July 2019 **Game released:** July 2019 **Xenoblade Chronicles 3** **DLC announced:** June 2022 **Game released:** July 2022 **Fire Emblem Engage** **DLC announced:** December 2022 **Game released:** January 2023",
        "comments": [
            {
                "raw_content": "Didn't Smash Ultimate also get it's DLC announced before release?",
                "author": "PerfectFrost"
            },
            {
                "raw_content": "As long as the DLC is beefy enough, I don't really mind it. The prices are usually fair for the amount of content, I do wonder if that will be the case with Pokemon however.",
                "author": "Skelletonike"
            },
            {
                "raw_content": "Yeah I was thinking this too. This is something that has been done many times by both Nintendo and other publishers. It's strange how some people are only noticing it when Pokémon is in the picture",
                "author": "acewing905"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Rumour / Leak: Missions, Rewards, and Achievements coming to Nintendo Switch Online",
        "score": 216,
        "text_content": "Spanish leaker Nash Weedle posted that Nintendo Switch Online may soon add a new system: * Rewards based on the games you play (icons, wallpapers, points, etc.) * Points can be redeemed for rewards, and some rewards unlock directly by completing in-game achievements (like defeating a boss without damage) * You can see what rewards/achievements other users have earned * Some rewards can be traded if certain conditions are met * Favorite rewards can be auto-redeemed when you have enough points * Nintendo Switch Online membership is required [https://xcancel.com/NWeedle/status/1968291685776887912](https://xcancel.com/NWeedle/status/1968291685776887912)",
        "comments": [
            {
                "raw_content": "![gif](giphy|PjU0WtzRVbQUO4qe6v) So it's a random spanish account who made some wildly incorrect leaks in the past... yeah sure I'll believe it...",
                "author": "TyleNightwisp"
            },
            {
                "raw_content": "I am skeptical about this in general, but I would hope that if these are true, they are retroactively unlocked. I don't want to need to redo something like getting 100% in Mario Kart World or DK Bananza again if I already have done it before, for the unlocks were put into place.",
                "author": "Chase64Cubed"
            },
            {
                "raw_content": "how reliable is this guy?",
                "author": "sirms"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "New stuff!",
        "score": 17,
        "text_content": "https://x.com/nintendoamerica/status/1968480592434999556?s=46",
        "comments": [
            {
                "raw_content": "Oh dang, neat, couple of cult classics",
                "author": "Playful_Lecture7784"
            },
            {
                "raw_content": "Where's the GameCube game of the month",
                "author": "Sky_Rose4"
            },
            {
                "raw_content": "Now reminded I forgot ta buy Klonoa's comeback Remake!",
                "author": "Alarming-Active-5909"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Sony is looking to licence out Decima engine to more devs",
        "score": 602,
        "text_content": "Please take this as massive grain of salt. Was talking to an apparent ex London Studio employee at the London Death Stranding event. (We were standing waiting for Kojima to leave to get stuff signed but the sneaky bugger left via a different exit... And probably a cardboard box) We were chatting away and I was asking some questions and a group of us git chatting, sadly he wouldn't say much because he still had a NDA even after being made redundant but one thing he mentioned was that he had personally used Decima before, wouldn't say what for. I pressed for more but he wouldn't say anything other than that Sony are trying to shop around Decima to more developers. Not sure if he meant just first party or third. Don't think any of us got anything more out of him. He mentioned having tried Horizon Online (maybe he worked with Decima on this) but he wouldn't say anything at all, aside ftom when I asked if I should be excited for it and he just said \"No\" He mentioned that Last of Us online was super fun untill Bungie came on and shat on it. Again please take this as a pinch of salt. For all I know this guy was chatting pish and never even worked at Studio London at all. He seemed genuine though. I've tried to remember as much interesting info as I can, we were waiting for around 2 hours for Kojima to come out and he never did! Got a signature from Norman Reedus though!",
        "comments": [
            {
                "raw_content": "Wouldn't surprise me tbf. Arguably one of the best open world engines out there with good visuals and performance",
                "author": "jumper62"
            },
            {
                "raw_content": "This feels like bait with your later remarks about bungie. Naughty dog couldn't sustain the game that's it.",
                "author": "Sans_bear27"
            },
            {
                "raw_content": "People underestimate VASTLY how much work would go into making an internal engine available to third party studios, let alone the public like Unreal. Thousands of dev hours would go into documentation and support alone, not to mention clean up and testing so it can run on a range of machines and dev environments, not just ones in your studio. An engine as powerful and versatile as Unreal or Unity on the market is rare for a reason.",
                "author": "dinodares99"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Leaked early development gameplay from Marvel 1943: Rise of Hydra",
        "score": 310,
        "text_content": "Source: https://mp1st.com/news/first-look-gameplay-marvel-1943-rise-of-hydra-surfaces",
        "comments": [
            {
                "raw_content": "Heres to hoping this one doesnt get canceled or delayed. Such a shame we’re getting so many new Marvel yet DC is getting neglected, although dont get me wrong its not like Im not enjoying all these.",
                "author": "RockRik"
            },
            {
                "raw_content": "The amount of people complaining when the title literally says “EARLY DEVELOPMENT” leaked gameplay is very concerning.",
                "author": "Various_Carob_5752"
            },
            {
                "raw_content": "Black Panther - Arkham Knight",
                "author": "Bannedwith1milKarma"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Famous fighting game content creator Maximillian Dood might’ve just accidentally leaked unannounced characters coming to Invincible VS",
        "score": 83,
        "text_content": "In the clip, he talks about characters he does and doesn’t know from the show “Invincible” in relation to his work on “Invincible VS” and which characters he did and did previously know about. This can be taken to be him talking about characters in the game! And some of the characters he talks about haven’t been announced yet. These characters are Allen The Alien, Conquest, Robot, Thragg, and Cecil. Could he just be listing random characters from Invincible, or did he just accidentally leak some unnanounced roster members? Only time will tell. Here is the link to the clip https://imgur.com/a/gxHwT1v",
        "comments": [
            {
                "raw_content": "This is like saying Luigi is going to be in the Mario Galaxy movie. It’s quite obvious these characters will be in the game.",
                "author": "Caba008"
            },
            {
                "raw_content": "max is friendly with the people making the game but i think hes a lot smarter than to do this, he’s just listing characters from Invincible as an IP that hes aware of, not necessarily characters hes seen in the fighting game they’ll all probably be in the game though, no doubt, i just have never seen max slip up when it comes to something confidential and not stop himself",
                "author": "boltinolegfan"
            },
            {
                "raw_content": "Maximillian Dood Tier 1 leaker",
                "author": "Super_UGA_SaiyanDawg"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Metroid Prime 4 - Japanese promotional case",
        "score": 132,
        "text_content": "Found these on facebook >! According to the translation it seems the rumoured time travel component is indeed happening. There was also some speculation that the NSO requirement had something to do with multiplayer, but as you can see it is indeed one player only !< If anyone can translate more, please do so. https://imgur.com/a/z2CVcOm",
        "comments": [
            {
                "raw_content": "Nintendo switch online mention is for cloud data saving",
                "author": "Alone-Ad6816"
            },
            {
                "raw_content": "Rough TL of the back of the case: >!\"With the hopes vested in [her/you], and [her/your] new powers, [...] return home from an unknown planet.\" (the last kanji are hidden by the light, so I can't tell if this sentence is addressed to you or nobody, in the latter case the subject would be samus)!< >!\"Having been transported across space and time to the unknown planet Viewros, Samus [Aran] must [carve a] path with her newfound powers in order to return to her original world.\" (again, the light obscures some parts of this sentence, but what's missing is easier to guess/make out)!< \"First person adventure - FPA METROID: Explore a full 360 degree world from Samus's viewpoint.\" \"Psychic Abilities: To honor the wishes of the people of this planet, make full use of the powers they grant to Samus and solve mysteries.\" \"Viola: Cut through the vast expanse of Viewros.\" No swords here. And yes, NSO is for cloud data. edit: added spoiler tags. tagged content reveals the same stuff as OP's tagged content.",
                "author": "aRandom_Encounter"
            },
            {
                "raw_content": "Metroid got his powers from the moon and has a sword 🤯",
                "author": "KMoosetoe"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Yakuza Kiwami 3 leaked on the RGG website",
        "score": 654,
        "text_content": "Source: https://xcancel.com/tdkumon/status/1968278220245176605 Just search this on Google >\"龍が如く 極 3\" site:http://ryu-ga-gotoku.com and it appears under the first search result on RGG's website. >NEWS · ***龍が如く 極3*** · 龍が如く 極2 · 龍が如く 極 · 龍が如く0 · キャンペーン · 龍が如く8外伝 · 龍が如く8 · 龍が如く7外伝 ...",
        "comments": [
            {
                "raw_content": "Yakuza fans excited to actually play Yakuza 3 for the first time",
                "author": "Gabrielhrd"
            },
            {
                "raw_content": "Yakuza 3 is one of my favorites, one of the best stories of Kiryu, only the gameplay is a bit janky. A kiwami version will do it wonders.",
                "author": "powerhcm8"
            },
            {
                "raw_content": "I'm ready to witness the onion cutting scene in 4k.",
                "author": "Arumhal"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Rumour/ Leak: Missions, Rewards, and Achievements coming to Nintendo Switch Online",
        "score": 288,
        "text_content": "Spanish leaker Nash Weedle posted that Nintendo Switch Online may soon add a new system: * Rewards based on the games you play (icons, wallpapers, points, etc.) * Points can be redeemed for rewards, and some rewards unlock directly by completing in-game achievements (like defeating a boss without damage) * You can see what rewards/achievements other users have earned * Some rewards can be traded if certain conditions are met * Favorite rewards can be auto-redeemed when you have enough points * Nintendo Switch Online membership is required [https://xcancel.com/NWeedle/status/1968291685776887912](https://xcancel.com/NWeedle/status/1968291685776887912)",
        "comments": [
            {
                "raw_content": "There's already a very basic version of this, where you get points for playing certain games which you can then use to purchase avis and backgrounds. I guess they're just developing the idea further.",
                "author": "Natural-Wedding2622"
            },
            {
                "raw_content": "\\>Nash Weedle Yeah, that's pretty much like Zippo, but from Spain.",
                "author": "Beteoto"
            },
            {
                "raw_content": "Nash is not a great source but this sounds believable, more than a proper \"achievement\" system it seems to be an expansion of the Platinum Points system that already exists across Switch/Switch 2 and the web My Nintendo portal. NSO subscribers can already collect points playing NSO games or mobile apps and spend them for PC/mobile wallpaper for example. I farm FEH exclusively to get the Switch icons.",
                "author": "Joseki100"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Frustration grows over Ryzen Z2 Extreme handheld launches",
        "score": 70,
        "text_content": "",
        "comments": [
            {
                "raw_content": "2x the price for 1.15 better performance is a bad deal.",
                "author": "max1001"
            },
            {
                "raw_content": "So if Z2 handhelds are double Z1 handhelds price, does it mean Z3 handhelds are going to be triple Z2 handhelds price? Soon handhelds will just die out because the price is so astronomically high, it will become a niche hobby product..",
                "author": "TheEDMWcesspool"
            },
            {
                "raw_content": "$1350 for the Legion Go 2 is a complete joke, at that point you might as well get the $1400 GPD WIN 5 with the AI MAX 385 for significantly more performance. You might think that you would rather not have to carry an additional external battery's worth of weight, but the Go 2 weighs the same as the WIN 5 **with** the battery attached to the back. And the thing with having a external battery is that you can rest it on a table or in your pocket/bag instead of having all that extra weight on your palms.",
                "author": "Kionera"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD introduces Ryzen PRO 9000 series, Ryzen 9 PRO 9945 features 12 Zen5 cores",
        "score": 20,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "ONEXGPU Lite eGPU with Radeon RX 7600M XT debuts at $699, \"USB5\" becomes USB4 v2",
        "score": 16,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I have some choice words for whoever's behind USB naming convention because it's a fuckin mess",
                "author": "HankThrill69420"
            },
            {
                "raw_content": "OneXGPU has an rX 7600M Xt.. It should be called the TwoXGPU so for that reason I’m out.",
                "author": "spencer2294"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD launches EPYC 4005 Embedded, Zen5 CPUs for AM5 socket",
        "score": 9,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "Mortgage Rates HIGHER (Not Lower) After Fed Rate Cut",
        "score": 255,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ill explain it like your 5: Fed rate is the amount that banks pay other banks to use their money overnight. Treasury rates are the amount the government pays people to borrow their money for 10 years. Treasury rates are a very important number when it comes to mortgage rates. The Fed Rate has very, very little to do with mortgage rates.",
                "author": "AttachedHeartTheory"
            },
            {
                "raw_content": "Are you new to this?",
                "author": "UteForLife"
            },
            {
                "raw_content": "Rates are not my concern. It’s principal cost being over inflated. If the price is still screwed, the rate is irrelevant because I’m not financing that price at any rate.",
                "author": "DJDevine"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage refinance demand spikes nearly 60%, as interest rates drop sharply",
        "score": 436,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Note, when this report came out the 30 yr rates were at 6.39%.. today they are another quarter point lower (-0.26) Wonder how much demand that will create over the next few weeks?",
                "author": "SnortingElk"
            },
            {
                "raw_content": "Looks like a lot of people successfully dated the rate.",
                "author": "PoiseJones"
            },
            {
                "raw_content": "Is it even worth it with closing costs?",
                "author": "VendettaKarma"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Fed lowers rates by a quarter point, first cut since 2024",
        "score": 194,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Man, you are all missing the fact why rates were lowered. It has to do with the job market. It's weakening. I guess housing can only go up when people can't find jobs, right?",
                "author": "coldshowerss"
            },
            {
                "raw_content": "**Fed approves quarter-point interest rate cut and sees two more coming this year** WASHINGTON – The Federal Reserve on Wednesday approved a widely anticipated rate cut and signaled that two more are on the way before the end of the year as concerns intensified over the U.S. labor market. In an 11 to 1 vote that signaled less dissent than Wall Street had anticipated, the Federal Open Market Committee lowered its benchmark overnight lending rate by a quarter percentage point. The decision puts the overnight funds rate in a range between 4%-4.25%. Newly installed Governor Stephen Miran was the only one of those voting against the quarter-point move, instead advocating for a half-point cut. Governors Michelle Bowman and Christopher Waller, looked at for possible additional dissents, both voted for the 25 basis point reduction. All were appointed by President Donald Trump, who has badgered the Fed to cut not merely in its traditional quarter-point moves but to lower the fed funds rate quickly and aggressively. In the post-meeting statement, the committee again characterized economic activity as having “moderated” but added language saying that “job gains have slowed” and noted that inflation “has moved up and remains somewhat elevated.” Lower job growth and higher inflation put the Fed’s twin goals of stable prices and full employment in conflict. “Uncertainty about the economic outlook remains elevated” the statement said. “The Committee is attentive to the risks to both sides of its dual mandate and judges that downside risks to employment have risen.” Along with the rate decision, officials in their closely watched “dot plot” of individual expectations pointed to two more cuts before the end of the year. The grid, however, showed a wide level of disparity, with one dot, possibly Miran’s, pointing to a total of 1.25 percentage points in additional reductions this year. The plot is done anonymously, with one dot for each meeting participant, but Miran has been an advocate for much lower rates. Nine of the 19 participants indicated just one more reduction this year, while 10 saw two, which would indicate moves at the October and December meetings. One official did not want any cuts, including Wednesday’s. The plot indicated one cut in 2026, significantly slower than current market pricing of three. Traders had fully priced in this week’s move. Officials also indicated another reduction in 2027, as the Fed approaches the long-run neutral rate of 3%. A half-dozen officials saw the long-run rate below the median neutral level. Projections released following the meeting on general economic conditions saw slightly faster economic growth than the June projections, while the outlook for unemployment and inflation was unchanged. A stunning level of political drama preceded the meeting, especially for an institution that generally does its business quietly and with few dissenting voices. A year ago, against similar worries that a gradual rise in the unemployment rate could be signaling broader weakness, the FOMC approved a jumbo half-point reduction that Trump has said was politically motivated to influence the presidential election in favor of his Democratic opponent, Kamala Harris. Trump’s hectoring of the Fed and Miran’s appointment have raised questions over the traditional independence the central bank has had from political influence. Miran also has openly criticized Chair Jerome Powell and his colleagues and is generally seen as a loyalist vote for the president and his desire for significantly lower rates. The president has said lower rates are needed to bolster the moribund housing market and to lower financing costs for government debt. There was an additional layer of political intrigue this week as a court blocked Trump from removing Governor Lisa Cook, an appointee under former President Joe Biden. The White House has accused Cook of mortgage fraud involving federally backed loans she received for homes she purchased, though no charges have been brought. Cook was among those who joined the majority in voting for the quarter-point move. Recent signals have shown that economic growth remains solid and consumer spending topping forecasts, though the labor market has been a point of contention. On the jobs front, the unemployment rate hit 4.3% in August, still relatively tame by historical standards but the highest since October 2021. Job creation has been stagnant this year, and a recent update from the Bureau of Labor Statistics showed that the economy created nearly a million fewer jobs than initially reported in the 12-month period prior to March 2025. Governor Waller in particular has expressed concern that the Fed should ease policy now to head off future issues in the labor market. His name also has been in the mix as a potential replacement for Powell, whose term expires in May 2026. https://www.federalreserve.gov/newsevents/pressreleases/monetary20250917a.htm",
                "author": "SnortingElk"
            },
            {
                "raw_content": "That's great and all, but the interest rates will go down, and the home prices will go up, always seems to happen when rates go down. Is that safe to assume that is correct?",
                "author": "Select_Factor_5463"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The Fed’s cutting interest rates as the U.S. labor market deteriorates",
        "score": 81,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We now have some very tasty stagflation. Interest rates should not have been lowered in my estimation.",
                "author": "Responsible_Year1206"
            },
            {
                "raw_content": "It's funny how like many innovations, AI is being used by companies to cut jobs. Provision touted as a way to increase efficiency and help workers, workers are being used for data and essentially \"training\" their AI replacement. We need some sort of law or bill that penalizes companies who replace workers with AI.",
                "author": "blehbleh1122"
            },
            {
                "raw_content": "IMO the American consumer is spooked by the shenanigans going on and the unpredictability of this administration. People will be very careful with their finances going forward.",
                "author": "SageMaverick"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The average American homeowner lost $9,200 in home equity",
        "score": 14,
        "text_content": "The data [the article](https://fortune.com/2025/09/17/housing-market-not-collapse-long-term-correction-home-equity-decline/) presents is from Cotality and the real estate advisor quoted is calling it a long-term market correction and not a collapse. But they also go on to say: *“It’s definitely more of a concern for homeowners who bought at market peaks, are experiencing more pronounced local market declines, and have higher sale urgency.”* Anyone here on this end of things? Where are you and what are you seeing locally compared to this? Do you think it's actually a healthy correction or will things continue to decline? I'm just trying to see what this overview is like compared to actual property owners' experiences.",
        "comments": [
            {
                "raw_content": "I'm still planning to live in my house for several years so this means nothing to me. Also, I've still gained around $100k of potential value in the past 5 years.",
                "author": "TheophrastBombast"
            },
            {
                "raw_content": "I’m in what’s supposed to be one of the harder hit housing markets in the state of Florida, But I’m still apparently sitting on “350k” worth of equity, but it’s probably down 12-15k from the high estimates. But what does it matter, with our sub 2.75% interest rate, homestead property tax cap, the golden handcuffs are real. I have no plans on moving out in the next 5 to 10years, and if the price wouldn’t be right at that time I would just rent it out. I don’t even consider the current value of my house in my networth considerations. It’s just a very nice place for me and my family to live, in a safe area. Sometimes this subreddit just assumes our houses are treated like equities by their owners, but what does the paper value matter if we don’t need to sell?",
                "author": "GeneralTaosFowl"
            },
            {
                "raw_content": "They didn’t lose anything. Equity/gains aren’t realized until the house is sold.",
                "author": "OptimalFunction"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "10-year Treasury yield rises after widely expected quarter-point cut by Fed",
        "score": 101,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Predictable. Some people swore that rates would continue to fall because they're convinced that mortgage rates are tied to the funds rate. The drop in rates from the last couple of weeks was due to the quarter point cut already being priced in.",
                "author": "beardko"
            },
            {
                "raw_content": "Recession fears or long term inflation expectation?",
                "author": "boboman911"
            },
            {
                "raw_content": "I posted this to the RE sub [link](https://imgur.com/a/ckrMZZ1). They fail to understand that it's not a forecast, but literally implied by current spot rates. RE sub only knows mortgage rates but apparently doesn't understand how the yield curve or forward rates works.",
                "author": "SevereSignificance81"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Map shows only 14 states where homeowners have not lost equity",
        "score": 107,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Equity loss is meaningless if you don't intend to sell.",
                "author": "fuckexoticroots"
            },
            {
                "raw_content": "*The average U.S. homeowner lost approximately $9,200 in equity during the past year, but that still leaves the average borrower with about $307,000 in accumulated home equity.* That is the third highest in recorded history? Doesn’t sound like there is an issue.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "My house has doubled in price since I bought in 2017. Ohh no I lost some of that equity. Ohh no it's retracted as couple percent! lol",
                "author": "fenderputty"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Fed forecasts only one rate cut in 2026, a more conservative outlook than expected",
        "score": 39,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Powell is out in May. Things will get interesting for sure... only 1 rate next year? Ok...",
                "author": "SnortingElk"
            },
            {
                "raw_content": "Only one cut in 2026 but 2 more in 2025.",
                "author": "azmanz"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "AheafFrom achieves faces with human like expressions with AI, new Science article",
        "score": 893,
        "text_content": "No uncanny valley,just ultra-humanlike robots that feel natural. Hangzhou-based AheafFrom isn’t just building emotional humanoid robots, but replicas of future humans. They collaborate with artists to craft beautiful appearances, powered by CharacterMind, a system that gives robots “emotions.” It understands tone, expressions, and gestures, then responds with voice, facial expressions, eye contact, and body language,making interactions feel like talking to a real person. https://x.com/CyberRobooo/status/1968272187820999133",
        "comments": [
            {
                "raw_content": "Well... Westworld is closer than I thought.",
                "author": "Impressive-Mouse-964"
            },
            {
                "raw_content": "https://i.redd.it/p6ulmcvjaqpf1.gif",
                "author": "Pleasant_Ball3192"
            },
            {
                "raw_content": "The Botox is strong in this one.",
                "author": "gabber2694"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Deep Think achieves Gold Medal at the ICPC 2025 Programming Contest",
        "score": 660,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Long $goog",
                "author": "BaysQuorv"
            },
            {
                "raw_content": "Yeah, but the answers lacked “soul” and it was just stealing from the prior work of real mathematicians. /s",
                "author": "only_fun_topics"
            },
            {
                "raw_content": "apparently [openai also got the medal](https://x.com/MostafaRohani/status/1968360976379703569), solved 12/12 rather than 10/12",
                "author": "frogContrabandist"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI is shifting its focus from maths/coding competition to scientific advancements!",
        "score": 429,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Well there aren't many contests left. They've gotten gold on all of them except Putnam which hadn't happened yet (but they already claimed their IMO gold model actually does better on Putnam questions than IMO) The only thing harder is to actually assist in research Like maybe the physical sciences Olympiads, but kinda hard for AI to do the labs",
                "author": "FateOfMuffins"
            },
            {
                "raw_content": "I hope the obliterate Cancer and other major diseases this decade. Mental Illness Cures next. Longevity Non Invasive Operations There is so much good that can happen. My hope is progress accelerates and democratizes so fast that it is impossible to monopolize and heavily monetize these things.",
                "author": "ConstructionFit8822"
            },
            {
                "raw_content": "I know we're all concerned about how exactly we'll handle big issues like job losses, income inequality, and even climate change. But I think we underestimate the potential contributions from AI towards these subjects and many more. We may feel that a vastly better economic model with much lower inequality, for example, is far away or maybe impossible. But with ever-improving AI involved, we may be much closer than we think.",
                "author": "Ignate"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI Reasoning Model Solved ALL 12 Problems at ICPC 2025 Programming Contest",
        "score": 543,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yeah they outshined google here, google only got 10/12. GPT-5 itself got 11/12 as well. https://x.com/MostafaRohani/status/1968361268475215881",
                "author": "socoolandawesome"
            },
            {
                "raw_content": "coding with a proper llm is crazy, you can learn so much just by asking questions",
                "author": "Jabulon"
            },
            {
                "raw_content": "> We received the problems in the exact same PDF form, and the reasoning system selected which answers to submit **with no bespoke test-time harness whatsoever.** [I spoke about how currently people can squeeze a LOT more juice out of current AI models with harnesses](https://www.reddit.com/r/singularity/comments/1new4ql/autonomous_agent_that_completed_terry_taos_strong/ndssghq/), like how individuals were able to reach 5/6 on the IMO with just Gemini 2.5 Pro (and IIRC even hit 4/6 with Gemini 2.5 Flash) just by using a multi agent system. Noam Brown mentioned before with the Pokemon benchmark that he didn't like people were building scaffolds for the model the play the game. His opinion was just that the model should be able to play it entirely on its own. IIRC between Google and OpenAI researchers on Twitter, there was a tweet about how it seems like their approaches were different (sorry I can't find it rn, if someone else could [Edit: Found it, from Noam Brown](https://x.com/polynoamial/status/1947398531259523481?t=pB4cmShfBzDpBovy4t4ejA&s=19)). That is to say, their experimental model didn't work the same way as Gemini DeepThink, which, alongside Grok Heavy and GPT Pro, seem to work by harnessing multiple agents simultaneously to maximize test time compute usage. It seems like OpenAI is doubling down on that? Making the models themselves more capable, rather than harnessing the models in more effective ways.",
                "author": "FateOfMuffins"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Advanced version of 2.5 Deepthink solves question no other university teams could",
        "score": 306,
        "text_content": "Seems like superintelligence ain’t too far out to be honest.",
        "comments": [
            {
                "raw_content": "Nice! Congratulations to the team, of course.",
                "author": "absolutely_regarded"
            },
            {
                "raw_content": "Gemini 3 gonna live up to its hype hopefully",
                "author": "ethotopia"
            },
            {
                "raw_content": "Yep, we will have many narrow super intelligent systems coming online in the next year. That’s singularity enough for me.",
                "author": "Enormous-Angstrom"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Nvidia CEO says he's 'disappointed' after report China has banned its AI chips",
        "score": 545,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So Trump threatened China with China's own long term strategy?",
                "author": "mooman555"
            },
            {
                "raw_content": "tbf it makes sense from the chinese point of view. Nvidia chips cant be trusted- theyve been cut off from import now multiple times and might on a whim be cut off again. You cannot build an infrastructure on sporadic imports liable to frequent outage. So- the government bans Nvidia imports altogether, forcing local manufacturers to pick up pace instead and fill the hole that was left. This is a long term investment for the Chinese government.",
                "author": "DaHOGGA"
            },
            {
                "raw_content": "Man the surprised pikachu faces in the NVIDIA boardroom must have been priceless.",
                "author": "beigetrope"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "A.Wei confirms the experimental model that scored 12/12 in ICPC is the same one used in the IMO gold and IOI",
        "score": 111,
        "text_content": "",
        "comments": [
            {
                "raw_content": "release that shit NOW",
                "author": "blazedjake"
            },
            {
                "raw_content": "Got my answer then. I can’t imagine the offers A.Wei must be turning down. Would be interesting to know if the model is being used to help distil itself.",
                "author": "wNilssonAI"
            },
            {
                "raw_content": "also what does “new horizons beckon” and one last run imply? imminent release of the model before working on a new paradigm internally?",
                "author": "blazedjake"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"AI fares better than doctors at predicting deadly complications after surgery \"",
        "score": 42,
        "text_content": "[https://hub.jhu.edu/2025/09/17/artificial-intelligence-predicts-post-surgery-complications/](https://hub.jhu.edu/2025/09/17/artificial-intelligence-predicts-post-surgery-complications/) \"\"We demonstrate that a basic electrocardiogram contains important prognostic information not identifiable by the naked eye,\" said senior author [Robert D. Stevens](https://profiles.hopkinsmedicine.org/provider/robert-david-stevens/2702555), chief of the [Division of Informatics, Integration, and Innovation at Johns Hopkins Medicine](https://anesthesiology.hopkinsmedicine.org/integration-and-information-management/). \"We can only extract it with machine learning techniques.\"\"",
        "comments": [
            {
                "raw_content": "[here's the study ](https://www.bjanaesthesia.org/article/S0007-0912(25)00546-X/abstract) A) this study doesn't compare AI vs doctors, it compares an older algorithm for risk assessment with a deep learning model. B) this is exactly the sort of methodology that would have been called \"machine learning\" or \"data science\" 10 years ago but university marketing departments are learning to rebrand everything as \"AI\" to add to the hype. C) the ROC for the optimal method (use of both EKG and clinical data that is part of the older algorithm) is decent but not amazing (AUC 0.83). They're definitely leaving some variance explained on the table by focusing so much on cardiac electrophysiology. D) Opaque deep learning models are difficult to implement widely in clinical settings. It looks like they've already started working on interpretability here, which should be useful for a less opaque and more implementable method suitable for broad use.",
                "author": "bigthama"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "AI's ability to displace jobs is advancing quickly, Anthropic CEO says",
        "score": 157,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Title seems wrong? >The ability of AI displace humans at various tasks is accelerating quickly, Anthropic [CEO Dario Amodei](https://www.axios.com/2025/05/28/ai-jobs-white-collar-unemployment-anthropic) said These are 2 different statements. He is correct AI right now is really good at TASKS. The problem is for things that takes humans more than 8 hours, then the AI is not that great.",
                "author": "Silver-Chipmunk7744"
            },
            {
                "raw_content": "The anthropic ceo says a bunch of things",
                "author": "Pen-Entire"
            },
            {
                "raw_content": "What he says always seems to be in contention with what Sam and other head execs say in public. Makes me wonder if this is what they actually believe in private. All this investment must be returned in some meaningful form.",
                "author": "Stunning_Monk_6724"
            }
        ],
        "subreddit": "singularity"
    }
]