[
    {
        "post_name": "I love Trump",
        "score": 615,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I love him tooooo",
                "author": "grannylovestrump"
            },
            {
                "raw_content": "And he's still on schedule to receive his morning briefing at 6 AM. The dude is a fucking machine.",
                "author": "LawyersPlayDota"
            },
            {
                "raw_content": "Epic??? What exactly epic about it.",
                "author": "starjello"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "REAL",
        "score": 146,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Putin could invade the UK and it would instantly be 100x better.",
                "author": "dc53dc53"
            },
            {
                "raw_content": "As Finnish I can confirm the media propaganda is on steroids about this. Constant fear propaganda how they will attack us soon. Makes me wonder if they do a false flag soon - exploding bomb and saying it was Russians. Media doesn't allow anyone in their shows that would encourage peaceful negotiations towards Russians. It's sickening how one sided everything is here. I'm afraid they will start soon jailing people who think peace is the solution. Media is pushing for war along with our politicians. Awakened peoples are resigning from army. I did too. It's clearly not my war anymore. Meanwhile they are letting immigrants in waiting to replace the white population. Disgusting. I'm looking to relocate in a few months of time but it's tough.",
                "author": "thisdyyd"
            },
            {
                "raw_content": "Yes, except Russia is a yuge nuclear power unlike Iraq! Fucking globohomo wants desperately to trigger WWIII, because they think they will be able to survive in their underground bunkers!",
                "author": "patrioticwinning3"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I love this timeline. New plaques added to the presidential hall of fame in the White House.",
        "score": 117,
        "text_content": "",
        "comments": [
            {
                "raw_content": "obama didn't devastate just the coal industry, he completely killed the domestic lead mining and refining industry. I applaud Trump for this, I'm glad I voted for it.",
                "author": "Stlpoolguy"
            },
            {
                "raw_content": "Is this real?",
                "author": "stevethefish76"
            },
            {
                "raw_content": "Executive order that removing the plaques will be considered defacing public property and vandalism. Immediately. Let’s see the Balls we built that Ballroom for, sir.",
                "author": "Taqiyya_Mockingbird"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BRAVO YOUNG LADY",
        "score": 91,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Funny Reiner is all over Q and fags continue to deny. Reiner was a pedo traitor, fuck all the troglodytes.",
                "author": "ProtestantPatriot"
            },
            {
                "raw_content": "I can look past Rob Reiner being a part of a televised psyop and the political involvement just enough to not wish death upon him. But that's what sets humans apart from the unhinged trannies.",
                "author": "TooBright"
            },
            {
                "raw_content": "Didn't Rob Reiner rape that Poltergeist girl to death?",
                "author": "WheresMyStimmy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🏆 𝐖𝐈𝐍𝐍𝐈𝐍𝐆: The U.S. House just 𝙋𝘼𝙎𝙎𝙀𝘿 MTG’s Protect Children’s Innocence Act—CRIMINALIZING transgender transitions on minors: surgeries, puberty blockers, hormones!",
        "score": 1330,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Transgenderism is # a SIN and now creating it is # a CRIME",
                "author": "Ballots0nRubysUSB"
            },
            {
                "raw_content": "Anything that passes the House also needs to pass the Senate or it's useless. BREAKING! BOOM! JUST NOW!",
                "author": "OutlawPurpleHairDye"
            },
            {
                "raw_content": "Good. It should be illegal for ANYONE to be \"transed\". The medical monsters doing it deserve life in prison.",
                "author": "perma-maga"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ICE Agents don't show ID",
        "score": 1037,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why would they need to show ID? IT SAYS ICE IN 8 INCH LETTERS ON THEIR CLOTHES. Furthermore, you don't care if they show ID, you just want to stop it from occurring at all",
                "author": "H0rse"
            },
            {
                "raw_content": "If Dems are unhappy about opening the door for fraud and deception, they should think about Biden letting in 10M illegals.",
                "author": "VoteThing"
            },
            {
                "raw_content": "This meme has gotten so abused.",
                "author": "Viewer01"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Merry Christmas! Another narco terrorist boat was just blown out of the water. 🎄🎁",
        "score": 1073,
        "text_content": "",
        "comments": [
            {
                "raw_content": "From what I can tell the two biggest things the left is outraged about right now are blowing up drug boats and the White House ballroom. Both are hilarious.",
                "author": "OutlawPurpleHairDye"
            },
            {
                "raw_content": "# FUCK AROUND and # FIND OUT",
                "author": "USMC1234O10"
            },
            {
                "raw_content": "This is one of the only uses of my taxes that I have approved of in my entire life",
                "author": "Zskills"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Ambassador Mike Waltz : We are “DOGE-ing” the United Nations. - cutting 2,600 UN bureaucrats - slashing the budget by 15% in year one - 25% cut to peacekeepers",
        "score": 651,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Kick the U.N. out of America right now and stop screwing around. It's a terrorist organization and they can't even pay their extremely high bills. OUT, OUT, OUT!",
                "author": "MythArcana"
            },
            {
                "raw_content": "SHUT IT DOWN.",
                "author": "donkeyKang"
            },
            {
                "raw_content": "Cut off the UN and they can clean their own house. America first.",
                "author": "Get_Off_Big_Tech"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Democratic Party Approval Rating 🟢 Approve: 18% (-55) 🔴 Disapprove: 73%",
        "score": 898,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yet they somehow they still win a lot of elections... Hmmm.",
                "author": "BadManOrange"
            },
            {
                "raw_content": "Never underestimate Dems to pull 81,000,000 votes out of their asses.",
                "author": "buckeyeminuteman"
            },
            {
                "raw_content": "Cool. Now do RINOs.",
                "author": "Get_Off_Big_Tech"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "California: 473 gas stations will be shutdown in 2026",
        "score": 856,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What a horrific state.",
                "author": "TrumpIsTheVictor"
            },
            {
                "raw_content": "Considering there are about 11,000+ gas stations in CA [[source](https://www.energy.ca.gov/data-reports/energy-almanac/transportation-energy/california-retail-fuel-outlet-annual-reporting)] ... ~500 gas stations is about 4% - 5% of the state's retail gas supply (almost 1/20). Not catastrophic, but still more retardation that makes life harder for Californians for very little benefit.",
                "author": "IllIllIll"
            },
            {
                "raw_content": "Coming soon to a town/city/state/country run by an anti-carbon cultist near you. It's all about meeting the 'climate goals' set by their Davos masters before the magical year of 2030. They are all obsessed with 2030. Look it up.",
                "author": "knnbccb"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Vance Just Put a Brick through the Overton Window",
        "score": 1649,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Was isn't yet an appropriate descriptive. DEI is everywhere alive and well.",
                "author": "Voiceofreason72"
            },
            {
                "raw_content": "Just to be clear that article is about a bunch of Jew millennials who can’t get jobs in Hollywood as writers. The only reason DEI got shelved is because it stated blowing back on the long noses. White men are still fucked.",
                "author": "asdrubael_was_right"
            },
            {
                "raw_content": "If they could read they’d be very upset right now.",
                "author": "thoughtcriminal"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Mohamed Mansarry was arrested in Sioux Falls, SD, after he reportedly livestreamed a video of himself threatening to burn down a building while claiming to have a gun and lighting things on fire. He has been charged with making terroristic threats.",
        "score": 983,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What the fuck is that head shape",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "Inbred light bulb headed Somali scum",
                "author": "RandyQuaidsBeard"
            },
            {
                "raw_content": "All I heard was the name \"Mohammad\". Full stop. That's all I need to know. Deport.",
                "author": "DJT4MoreYears"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I will be leaving my position with the FBI in January. I want to thank President Trump, AG Bondi, and Director Patel for the opportunity to serve with purpose. Most importantly, I want to thank you, my fellow Americans, for the privilege to serve you. God bless America…",
        "score": 1340,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Congratulations on your total lack of success. He did literally nothing he promised to do.",
                "author": "Goozmania"
            },
            {
                "raw_content": "He cried about it for years. And then you bail. Useless.",
                "author": "MEME-SUPREME"
            },
            {
                "raw_content": "Won't be listening in. You blew it.",
                "author": "MEME-SUPREME"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Rep. AOC announces she’d “STOMP” JD Vance in the 2028 presidential election",
        "score": 839,
        "text_content": "",
        "comments": [
            {
                "raw_content": "All she has to do is promise shit and she will win. Especially if we're continuing to get fucked for the next 3 years.",
                "author": "Goozmania"
            },
            {
                "raw_content": "Don't underestimate voter fraud and commie infestation.",
                "author": "Yeti2"
            },
            {
                "raw_content": "Next election won't have shit to do with debates or presentation or policies. Sides have been taken, the middle is gone. It'll be 100% down to turnout, fraud, attempts to circumvent fraud, and lawfare.",
                "author": "seeling0"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "LIVE: President Trump Delivers an Address to the Nation - 12/17/25",
        "score": 646,
        "text_content": "",
        "comments": [
            {
                "raw_content": "19 minute version > https://www.youtube.com/watch?v=CWoR0-rPnj4 link by OP is hours long with extended commentary by 'journalists'.",
                "author": "PiratePatriot"
            },
            {
                "raw_content": "So, not an Oval Office address. Just more fluff. Zzzzzzzzz. . .",
                "author": "MemeWarsVet"
            },
            {
                "raw_content": "I love this. Im so tired of this false politeness as the left steals the future for my children. Tell it like it is Donald!",
                "author": "Zippythekid"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "California Democrats are actually doing it, Reparations for black people was just signed by the the San Francisco Board of Supervisors. Democrats are going to take from citizens who never owned slaves, to give to people who were never slaves, in a state that never had slaves.",
        "score": 1321,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Blacks have already been given trillions through welfare",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "Except that this is the San Francisco board of supervisors and that not any money has actually gone into this fund. Also it has nothing to do with slavery. People should actually watch the video.",
                "author": "SurfandTurf"
            },
            {
                "raw_content": "It never had slaves because it wasn't even a state at the time slavery was ended in the U.S. So, they were never even involved with U.S. slavery one way or another.",
                "author": "TheThreeSeashells"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: The U.S. House has just PASSED the Republican healthcare plan that lets people buy insurance in groups to save money on premiums, WITHOUT Democrats' ACA subsidies extension for Big, Rich Insurance. The vote was 216-211. One \"Republican\" NO: Thomas Massie",
        "score": 773,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Of course faggot Massie",
                "author": "Axiom502"
            },
            {
                "raw_content": "Government faggots shouldn't be involved in Healthcare insurance at all! FREE the MARKET!",
                "author": "golinveaux"
            },
            {
                "raw_content": "How about we just break up the fucking insurance cartels?",
                "author": "orange_kek_great"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Pam Bondi hasn’t made 1 significant arrest yet. John Thune has yet to pass a single safe election law. Mike Johnson hasn’t impeached 1 activist Judge. Something has to change.",
        "score": 801,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The Khazars are gonna get full control with Ted Cruz at the helm. How’s that for change ?",
                "author": "SpeekFreely"
            },
            {
                "raw_content": "The Snake Poem. Silly us.",
                "author": "PatriotSkorzeny"
            },
            {
                "raw_content": "The government will never change until we the people do it, and all my life only one side is doing it… and it’s the evil side",
                "author": "SquirreleeDan"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Seriously, man!",
        "score": 1187,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Oh shit. Did the Babylon Bee just draw a picture of Mohammad? Does this mean a terrorist attack is incoming to their HQ? We probably should all be drawing photos of him just to overwhelm them.",
                "author": "SteelDriver"
            },
            {
                "raw_content": "Mohammed was a false prophet, violent warlord, slave owner and kid diddler. Christ is king. Bill Clinton is a rapist. Trump won 2020. Etc etc",
                "author": "malooch"
            },
            {
                "raw_content": "They love the left and media running cover for them. It's called Taqiyya. They keep their true intentions and beliefs hidden when they are in the minority.",
                "author": "Zskills"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Marco Rubio posted a photo JD Vance's said he'd pay the photographer $1,000 to make Rubio look especially bad. JD Vance: \"I guess I owe that guy $1,000\"",
        "score": 285,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You tards. Rubio leaned into the meme.",
                "author": "Snek_Plissken"
            },
            {
                "raw_content": "I don’t get it",
                "author": "WheresMyStimmy"
            },
            {
                "raw_content": "Embrace the meme, then the left cannot hurt you with it. Then they cry, then we make memes of them crying.",
                "author": "Brownwaterboys"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The current state of MLO implementation for consumer Wi-Fi 7 router -> They all have the most basic implementation required!",
        "score": 236,
        "text_content": "Hey all! For those who didn't know, MLO is a required feature for Wi-Fi 7 certified router, but the standard only forces a minimal implementation of the feature. The marketing around MLO is wild. Companies promise enormous improvements in speed, latency and stability, and while all of that is theoretically true from what MLO \\*could\\* be, it turns out that from all 25 Wi-Fi 7 routers that I had access to, ALL OF THEM had the most basic MLO implementation possible (well technically 22 out of 25 since there were 3 Netgear router that were \"WiFi7\" not \"Wi-Fi 7\" and had no MLO implementation whatsoever...) The big thing that bugs me, is that when buying a Wi-Fi 7 router, you have no way of knowing how MLO is implemented, since tech specs won't give you those details. So, we captured the Beacon Frame of each router we had access to get the information out, and put it in a nice reference table. Hopefully, this information can be useful to some of you!",
        "comments": [
            {
                "raw_content": "Do I read it right that Netgear is out right scamming people with fake \"wifi\" name instead of \"Wi-Fi\"?",
                "author": "Scheig"
            },
            {
                "raw_content": "A few important notes because it is a terrible mess, but I believe this is missing this foundational knowledge to understand why (and it is bad, but it is important to know why): 1. Wi-Fi Alliance and IEEE are two independent bodies. Wi-Fi 7 Certified is not the same as the complete IEEE 802.11be specification. In fact, the Wi-Fi Alliance **picks and chooses** what it wants from the IEEE drafts (and yes, drafts, before they released). The marketing certification is not required to take every feature that IEEE has developed. 2. In fact, Wi-Fi Alliance traditionally **rejects** some features from IEEE, especially in the first Release. 3. Wait, first release? Yes. I hate to be the bearer of bad news, but Wi-Fi Alliance for the past three generations, has split every Wi-Fi release into a Release 1 and Release 2. We had Wi-Fi 5 and [**Wi-Fi 5 Wave 2**](https://www.wi-fi.org/news-events/newsroom/wi-fi-certified-ac-brings-new-advances-in-wi-fi-performance); we had Wi-Fi 6 and [**Wi-Fi 6 Release 2**](https://www.wi-fi.org/news-events/newsroom/wi-fi-certified-6-release-2-adds-new-features-for-advanced-wi-fi-applications). We have Wi-Fi 7 and [**Wi-Fi 7 Release 2 is due in less than a quarter**](https://documentation.meraki.com/Wireless/Design_and_Configure/Architecture_and_Best_Practices/Wi-Fi_7_(802.11be)_Technical_Guide) (late 2025 / early 2026). 4. These are **hardware** releases. It is unlikely your Wi-Fi 6 Release **1** AP nor STA / client will ever get Uplink MU-MIMO, even though that was heavily marketed for Wi-Fi 6. The Wi-Fi Alliance decided that feature needed \"more time\" for implementation and pushed it to Wi-Fi 6 Release 2. 5. This is why all the early marketing is so dangerous: that marketing comes from reading the IEEE specifications, but it has nothing to do with the Wi-Fi Alliance and its releases. 6. So Wi-Fi Certified 7 was announced by the Wi-Fi Alliance on [January 4, 2024](https://www.wi-fi.org/news-events/newsroom/wi-fi-alliance-introduces-wi-fi-certified-7). But IEEE was still tweaking IEEE 802.11be until [**August 2024**](https://www.ieee802.org/11/Reports/802.11_Timelines.htm). So in strict terms, the Wi-Fi Alliance \"jumped the gun\" by \\~three quarters. Why? IEEE is, as you expect, an engineering body, but Wi-Fi Alliance is a marketing / standards body. >The last three modes are MLMR (Multi-Link Multi-Radio) operation modes. ***Only STR is part of Wi-Fi 7 R1. NSTR and EMLMR modes have significant implementation complexity and are not adopted in Wi-Fi 7***. Thus, what does the Wi-Fi 7 Release 1 actually require? // Now, some optional features basically *never* get implemented by *some* routers and clients. This is because it is too complex, too expensive, not reliable enough, too power-hungry, etc. It's usually the same reason why we don't have 4x4 laptops or 3x3 smartphones. It costs more, it consumes more power, and the difference is relatively marginal. For example, I would *not* be surprised if simultaneous MLO (aka STR) will never be widely implemented in consumer mobile devices (some high-end exceptions of course): why? It consumes more power to transmit on 2 or 3 bands *at once* . We do not get 1.5+ Gbps transfer rates \"for free\", unfortunately. // The general advice I give to people: if you buy a Release 1 device, don't expect most of the marketing for *that* generation to be true. The Wi-Fi Alliance has **ensured** you will not get most of the marketing features (that news articles actually take from IEEE months / years earlier) for *that* generation. But you *should* get most, if not all, Release 2 features of the *previous* generation. So a Wi-Fi 7 Release 1 AP or client should confidently get you Wi-Fi **6** Release 2 features. // The chart, if you need it: |Wi-Fi Alliance CERTIFIED 7|\\# of Radios Required|Required for Wi-Fi CERTIFIED 7 R1 / Release 1?| |:-|:-|:-| |Multi-link Single Radio (MLSR)|1|❌| |Enhanced Multi-link Single Radio (EMLSR)|1|❌| |Simultaneous Tx & Rx (STR)|2 or more|✅| |Non-Simultaneous Tx & Rx (NSTR)|2 or more|❌ (not in Wi-Fi 7)| |Enhanced Multi-link Multi Radio (EMLMR)|2 or more|❌ (not in Wi-Fi 7)| Notice the critical # of radios. Most devices (smartphones, laptops) do not have two radios for Rx & Tx.",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": "This whole thing is a complete clusterfuck. I keep seeing \"Wi-Fi 7\" routers that don't even have a 6 GHz band. At first I thought it was just shady marketing, but nope, turns out the spec doesn't actually require a 6 GHz radio at all. Like… what the actual fuck? The entire point of Wi-Fi 7 is higher throughput, lower latency, and stuff like 320 MHz channels and MLO. All of which make the most sense on 6 GHz. But apparently you can slap a \"Wi-Fi 7\" label on a router that’s basically just \"Wi-Fi 6E-minus\" and call it a day. How is that not misleading as hell? So now \"Wi-Fi 7\" tells you basically nothing unless you dig through the spec sheet like a lawyer. Great job, Wi-Fi Alliance. Absolutely nailed it. Somehow this makes even the USB-IF naming mess look reasonable.",
                "author": "No-Improvement-8316"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nvidia reportedly plans 30-40% cut in GeForce GPU production in early 2026",
        "score": 1388,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Can we have just one piece of good PC hardware news, I'm begging at this point...",
                "author": "PhantomWolf83"
            },
            {
                "raw_content": "It has been a good time. I start looking for a new hobby after my current GPU dies.",
                "author": "klazander"
            },
            {
                "raw_content": "> I am altering the deal. Pray I don't alter it any further.",
                "author": "jenesuispasbavard"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[EUV lithography] How China built its ‘Manhattan Project’ to rival the West in AI chips",
        "score": 140,
        "text_content": "In a clandestine, state-led initiative likened to a \"Manhattan Project,\" China has reportedly developed a functional prototype of an Extreme Ultraviolet (EUV) lithography machine in Shenzhen, signaling a potential leap toward semiconductor self-sufficiency by 2028–2030. Orchestrated by Huawei under the oversight of the Central Science and Technology Commission, the project relies heavily on a workforce of former ASML engineers recruited via aggressive financial incentives and protected by high-security protocols, including the use of aliases. Technically, the prototype is significantly larger than ASML’s commercial units and utilizes a combination of reverse-engineered components, secondary-market optics from Japanese firms like Nikon and Canon, and domestic light-source breakthroughs from the Changchun Institute of Optics. While the system successfully generates EUV light, it has yet to achieve the precision optics and reliability required for high-yield chip production; however, the acceleration of this timeline challenges Western assumptions regarding the efficacy of multi-lateral export controls and the projected decade-long gap in China’s lithography capabilities.",
        "comments": [
            {
                "raw_content": "Kinda insane propaganda to liken china's lithography machines to america's weapons of mass destruction, no?",
                "author": "VastTension6022"
            },
            {
                "raw_content": "I told you it would happen.",
                "author": "LargeSinkholesInNYC"
            },
            {
                "raw_content": "I seriously hope so, I am fucking done of overpriced hamburger technology",
                "author": "worldarkplace"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD Ryzen 7 9850X3D appears at retailers with early pricing above 9800X3D",
        "score": 189,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why wouldn't it cost more it has 50 more points",
                "author": "R12Labs"
            },
            {
                "raw_content": "8 core | 120W TDP | 96MB L3 Cache | 5.6GHz boost",
                "author": "K33P4D"
            },
            {
                "raw_content": "I’m curious how well they’ll end up selling. The marked for ram is so crazy now that significantly less is willing to upgrade. So it’s mostly 7000 series people, maybe? That’s willing to shell out.",
                "author": "imKaku"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Meta \"Pauses\" Third-party Headset Program, Effectively Cancelling Horizon OS Headsets from Asus & Lenovo",
        "score": 10,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "[News] SOCAMM2 War Heats Up: Samsung Reportedly Delivers Samples to NVIDIA, Ramping Early 2026",
        "score": 11,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">In September, Etoday and DealSite indicate that NVIDIA has placed next-year SOCAM module orders with Samsung, SK hynix, and Micron, likely distributing allocations evenly across the three, alongside Rubin deployments. If confirmed, the shift would indicate NVIDIA’s intent to lean more heavily on Korean suppliers, the reports suggest.",
                "author": "imaginary_num6er"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Digital Foundry] AMD FSR Redstone Frame Generation Tested: Good Quality, Bad Frame Pacing",
        "score": 70,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If you saw the similar Hardware Unboxed video from a few days ago, this one agrees with it and presents the info in a different way. AMD urgently needs to fix this.",
                "author": "TerriersAreAdorable"
            },
            {
                "raw_content": "Very clear Redstone needed more time in the oven. Also it's going to struggle to gain traction unless they add support for older cards.",
                "author": "OwlProper1145"
            },
            {
                "raw_content": "Maybe Nvidia was up to something with their Flip Metering stuff. The frame pacing of DLSS FG/MFG is flawless.",
                "author": "Just_Maintenance"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "PCWorld | A truly fanless laptop future? Ventiva's CEO thinks so [28:19]",
        "score": 5,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ventiva was at the OCP Global Summit two months back: [From Laptops to Data Center Racks: Ventiva’s Thermal Play at OCP - Articles](https://techarena.ai/content/from-laptops-to-data-center-racks-ventivas-thermal-play-at-ocp)",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": "This Adam guy is so clueless at PCworld, can’t believe they have him as the front man. Everytime he talks on the fullnerd podcast I’m facepalming so hard. Can’t they get someone more knowledgeable than this ?",
                "author": "NightHawkQc"
            },
            {
                "raw_content": "they never really talk about power consumption. Dust still gather as long as no air filter and air is moving. how reliable is that tiny thin cable? It is strong enough take shock attack? They never seems to able to claim this thing is as reliable as a good quality fan. ( a good fan can last years even a decade without breaking down)",
                "author": "hackenclaw"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Hypothetically, how would you use ternary and quaternary units on otherwise normal chips?",
        "score": 2,
        "text_content": "Let's assume that magically, small units using ternary and quaternary logic existed, and the microcode running them was decently advanced, maybe like coffee lake strength compared to nova lake. There would be 6x 81 trit wide registers, with 81 the full width, then 27, 9, and 3. There would be 8x 256 quat/quad units, with 256 the full width, then 64, 16, and 4. The weird number of registers is to decrease register pressure. Given the astronomical differences in potential values between binary, trinary, and quaternary, imagine an instruction set that would allow for easy interoperability. For example, trit/quad registers can magically overflow into binary GPRs/SIMDs, `movqq rax/rcx/rdx/rsi/rdi/rbp/r11/r12, 4rax` `vmovdqqa ymm0, ymm1, ymm2, ymm3, 4rax` or go in the other direction (binary -> ternary or quaternary). If you have other instruction ideas, it would be neat to see. Imagine if they were 100% accurate, or if they were less than 100% accurate and things like temp or fluctuations in power could mess with them. Also imagine if they could either be general purpose registers or SIMD registers. What could you see them being used for?",
        "comments": [
            {
                "raw_content": "My understanding is that that's really just an electrical engineering question. It's worth noting that because we typically interact with bytes not bits, 256 permutation based chips shouldn't be too different to use.",
                "author": "Johns3rdTesticle"
            },
            {
                "raw_content": "Any power of 2 base can be very effectively emulated by binary systems by simply grouping bits. A 32-quad system is also a 64-bit system, which is also a 16-digit hexadecimal system. Other than that, ternary is actually pretty interesting. I sadly can't speculate on the performance of a ternary machine, but I can share some things I find interesting about it. Performance questions may be better answered on the math subreddits actually, as we're driving out of hardware discussions and into theoretical computer science. There are different ways to encode it, so first you have to decide which way you implement it. It could be: * balanced: -1, 0, 1 * unbalanced: 0, 1, 2 * \"fuzzy\": 0, ?, 1 Further, it could be quantum, like how we have quantum binary qubits. A qutrit would be a complex unit vector in 3 dimensions. There's been some proposals for optical computing to use balanced ternary, with 0 being dark, and -1 and 1 being perpendicular polarization of the light. It is used in some neural networks, often dubbed \"1.58-bit\" networks. These networks have weights restricted to the balanced ternary values. I see some interesting potential for these if dedicated ternary hardware could be built to work with a traditional system.",
                "author": "Affectionate-Memory4"
            },
            {
                "raw_content": "no idea for cpus, but it's interesting that we do actually already use quaternary in SSDs (QLC)",
                "author": "LuminanceGayming"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Current state of community",
        "score": 1486,
        "text_content": "The whole internet right now.",
        "comments": [
            {
                "raw_content": "I played the final fantasy 7 remake demo off of the eShop and it looks and plays great especially for a demo version. I will definitely be picking that up and resident evil requiem up when that comes out.",
                "author": "Sad-Background-7447"
            },
            {
                "raw_content": "Both protagonists are pretty and athletic blondes 💇‍♂️💇‍♀️",
                "author": "kunheguh"
            },
            {
                "raw_content": "I post a lot of inauthentic takes on the sub, but I'll keep it real for a moment - I've played games all my life. I love games, all sorts of games, new games, and old games. I'm not surprised that people are quick to move on to new things (although FF7R is technically old) because that's just how it's always been. But, if you are looking for a way to have fun while spending less, I highly recommend you look into older games instead of constantly riding these hype cycles. There's been a lot of pessimism about the Switch 2. I don't disagree with all of it, either, but I love my Switch 2, and I've used it to almost exclusively play old games this year. Games that got dedicated (free) updates. Games that didn't get official updates but just play better. Games that got neither but just happen to be a lot cheaper in 2025. I've played more fantastic games this year than I've played in maybe any other year of my life. I guess all I'm saying is that games don't become bad just because they've been out for more than 2 weeks. Don't stress the trends and feel encouraged to pick up the games you missed instead of the \"latest\" stuff \"everyone\" is talking about.",
                "author": "BadThingsBadPeople"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "There is a rumor going around about nintendo producing smaller switch 2 game-cards.",
        "score": 704,
        "text_content": "Whether or not this rumor turns out to be true....we'll have to wait and see.",
        "comments": [
            {
                "raw_content": "This is what Nintendeal said: \"I can confirm that smaller capacity Switch 2 game cards are in production but due to chip shortages it will take time before we see widespread availability Despite the smaller capacity, these cards will still be expensive due to rising cost of materials Game-Key Cards are not going away\"",
                "author": "StarPlatinum55"
            },
            {
                "raw_content": "I don’t have any friends who play Nintendo, so biggest reason I collect physical is to save in storage space. I don’t bother with Game Key Cards if I can just have it on my system instead of trying to find the card. I really hope Game cards are in more sizes, because having Poyuo Tetris as a key card is just embarrassing",
                "author": "Rent-Man"
            },
            {
                "raw_content": "Hopefully the price decrease will be good.",
                "author": "Pokeguy211"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Dispatch coming to Switch 2, Switch on January 29, 2026",
        "score": 757,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ooh I was about to consider getting it on Steam. I will hold off for now",
                "author": "ChilliWithFries"
            },
            {
                "raw_content": "With everything I’ve seen about this game, it feels like a perfect fit for the Switch",
                "author": "GooseSl4yer2003"
            },
            {
                "raw_content": "More of this, I want my Switch 2 to be my main indie platform.",
                "author": "Nimble_Natu177"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Stardew Valley creator ConcernedApe will \"announce something very soon\" on the farming sim's Switch 2 edition: \"Sorry about the long wait\"",
        "score": 189,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A Nintendo Switch 2 Edition was announced via a Nintendo Direct back in September with the additions of mouse controls, 4 player split-screen co-op and GameShare. [Source](https://www.youtube.com/watch?v=8ac2-LRIAeU)",
                "author": "Amiibofan101"
            },
            {
                "raw_content": "Begun, the Switch 2 Edition wars have.",
                "author": "Medd-"
            },
            {
                "raw_content": "It's good to see there are still developers that's not out to nickle-and-dime and steal your jobs and women.",
                "author": "weaklingoverlord"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Total Number Of Games Each Publisher Is Publishing On Switch 2",
        "score": 101,
        "text_content": "I already did this like 2ish months ago but in preparation for the new year I tried get the rest of the games that have been announced for Switch 2 and this is the total number I got! Of course I may have made mistakes and if I did let me know. Also I tried to only do publishers with 2 or more games confirmed for Switch 2.",
        "comments": [
            {
                "raw_content": "WHO IS HAMSTER BRO?!?!",
                "author": "LonelyDummmyy"
            },
            {
                "raw_content": "20 from Nintendo?! Which ones?",
                "author": "GroceryConscious7155"
            },
            {
                "raw_content": "Bethesda with 3? I can only think of fallout 4 and Skyrim, what's the other? Also OP I think itd be good if you also have us a list of each game from each publisher so we know what games they've published",
                "author": "Lucybug05"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Trails in the Sky 2nd Chapter remake launching worldwide in September 2026 for Switch 1 and Switch 2",
        "score": 25,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Easy day 1 buy for sure but I really hope they do end up doing the 3rd next I can wait longer for a from zero remake",
                "author": "Strict_Donut6228"
            },
            {
                "raw_content": "[deleted]",
                "author": "None"
            },
            {
                "raw_content": "So I have plenty of times to finish the 1st chapter.",
                "author": "Additional_Prior_634"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Switch 2 Was The Second Best Selling Console Of November",
        "score": 250,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The main takeaway from this data is that gaming in general has had a terrible month. Nintendo Switch 1+2 combined sold 10% less than Switch 1 did last November. PS5 down 40% YoY Xbox Series S/X down 70% (!!) YoY Obviously different degrees of alarm for each of the console manufacturers, but none of them will be happy with these numbers. Source: https://www.ign.com/articles/video-game-physical-software-and-hardware-sales-just-had-the-worst-november-in-the-us-since-1995",
                "author": "KingoftheBRUCE"
            },
            {
                "raw_content": "Because there was black friday where PS5 had a big discount, while Switch 2 didn't.",
                "author": "Caciulacdlac"
            },
            {
                "raw_content": "This is US only, to be clear, but it makes sense. Sony increased the price of the PS5 and then put it on sale for essentially the original price. Anyone who was on the fence or waiting for a major discount to buy one would realize that’s not going to happen and pick it up while it’s at least “reasonable.”",
                "author": "twili-midna"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Switch 2 Editions, the floodgates have opened",
        "score": 389,
        "text_content": "It's been one announcement after the other in the past few weeks. It's starting to sound like either Nintendo didn't want too many of those in the first 6 months (stands to reason they don't want Switch 2 to be seen as a better Switch 1, focus had to be on new games) or the devkit situation is resolved and it's now showing. We also heard last month about Panic Button being a key element in upgrading first party games. An external studio poking with actual Mario's internal code. It's just not the same Nintendo, is it? 2026 is the year of GTA, Persona 30th Anniversary. I expect a Switch 2 Edition for GTA trilogy very soon and one for Persona 5 Royal (question is, upgrade path or not?).",
        "comments": [
            {
                "raw_content": "MH Rise switch 2 upgrade please",
                "author": "gunmasterltd"
            },
            {
                "raw_content": "Still waiting for Switch 2 upgrades for Xenoblade Chronicles 1-3 and X. There isn't even an announcement.",
                "author": "MelvinSmiley83"
            },
            {
                "raw_content": "I am waiting for re trilogy and rdr 2 when it comes",
                "author": "Competitive-Monk-996"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Windows Central - Starfield new update in 2026 to feature improved space exploration, PS5/Switch 2 versions, and Bethesda is “quite stretched” trying to capitalize on Fallout TV success",
        "score": 297,
        "text_content": "article by Jez Corden edit: [https://www.windowscentral.com/gaming/xbox/is-xboxs-starfield-going-to-get-its-cyberpunk-2-0-moment-rumors-swirl-around-a-secret-event-and-a-ps5-launch](https://www.windowscentral.com/gaming/xbox/is-xboxs-starfield-going-to-get-its-cyberpunk-2-0-moment-rumors-swirl-around-a-secret-event-and-a-ps5-launch) Jez also mentions how the improvements to loading-free space exploration in the Starfield update will carry forward to future games. Perhaps for sailing in Elder Scrolls 6? “Creation Engine has reportedly undergone some large technical improvements to facilitate some of these types of (space exploration) systems, that will also carry forward to future games.“",
        "comments": [
            {
                "raw_content": "They're a bit late in trying to capitalize on the Fallout show. It's gonna be long over by the time anything notable comes out.",
                "author": "PolarBearOdyssey"
            },
            {
                "raw_content": "I imagine Bethesda is working on: • Elder Scrolls 6 • Fallout 5 (fallout 3 remake being made by another developer) • Starfied DLC and ports. I really don’t understand why Microsoft doesn’t put Obsidian on a Fallout game while Bethesda does ES6. A New Vegas type game",
                "author": "Chessh2036"
            },
            {
                "raw_content": "improved space exploration is cool but what that game really needs is a proper handcrafted location where I can spend more than 10 minutes on",
                "author": "DeathStalker131"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "KiwiTalkz claims Elder Scrolls 6 coming 2028 at the earliest, possible 2029 delay",
        "score": 246,
        "text_content": "Source: [https://xcancel.com/kiwitalkz/status/2001419132265549892#m](https://xcancel.com/kiwitalkz/status/2001419132265549892#m) Saw this on [r/TESVI](https://www.reddit.com/r/TESVI/). I'm fairly certain this is an opinion rather than a claim of industry insight, but seeing as his word is taken into consideration quite a bit I thought it was worth sharing. He claims \"That’s what I’ve heard internally and former devs believe the same, I’ve got receipts from the latter cause of my interviews\" when questioned on the providence of this.",
        "comments": [
            {
                "raw_content": "if it releases later than 2028, it will have taken longer from 5 to 6 than the entire series release from 1-5.",
                "author": "MrMojoRising422"
            },
            {
                "raw_content": "Any schmuck could make this guess. The \"possible delay\" rumour of a game that is allegedly, at the earliest, still over two years away made me laugh though.",
                "author": "Scottoest"
            },
            {
                "raw_content": "Weird how the entire GTA V era will have happened between TES releases.",
                "author": "Waste-Technology-381"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[Tyler McVicker] New HLX (Upcoming Half-Life) strings found in recent Dota 2 update, upcoming video going into detail teased",
        "score": 695,
        "text_content": "[https://xcancel.com/Tyler\\_McV/status/2001331835373265408](https://xcancel.com/Tyler_McV/status/2001331835373265408) He states \"based on how the Half-Life community lately, should I even make a video detailing the dump of new information found in the latest DOTA 2 update? I don't know... I guess this game doesn't exist.... Oh well....\", but to me this is clearly just a joke. The twitter post itself also shows some strings, game is not cancelled! **EDIT: Leaks verified by community members, see the** [**miro board**](https://miro.com/app/board/uXjVINqBTwM=/) **for more info!** (u/ThatDudeDronex) **EDIT 2:** [**Here is the update code itself**](https://github.com/SteamDatabase/GameTracking-Dota2/commit/5688664efb6b3a0e6a52abec53f8d0d7990d1f71)**, not smart enough to find HLX stuff, but it should all be in there** (u/i1u5)",
        "comments": [
            {
                "raw_content": "this post will now singlehandedly keep r/HalfLife alive for a month",
                "author": "Cursed_69420"
            },
            {
                "raw_content": "It seems the satanic rituals they performed in the Half-Life subreddit worked.",
                "author": "Midnight_M_"
            },
            {
                "raw_content": "![gif](giphy|ZxBECi61MF9oeSJyqi)",
                "author": "MyMouthisCancerous"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Nvidia to cut gaming GPU production by 30-40% starting 2026",
        "score": 837,
        "text_content": "Source: https://overclock3d.net/news/gpu-displays/nvidia-plans-heavy-cuts-to-gpu-supply-in-early-2026/",
        "comments": [
            {
                "raw_content": "That's specifically for the 50 series due to memory shortages, title reads like that's a permanent change",
                "author": "mage_irl"
            },
            {
                "raw_content": "Those who don’t own or are planning on getting a PC later should just pull the trigger now and get a prebuilt. Cus building one yourself ain’t worth shelling out $400 for 32gigs of ram",
                "author": "HoleIntheAce12"
            },
            {
                "raw_content": "I really, really hope this isn't the case. The hardware situation for gaming recently is bad enough with what's been going on already.",
                "author": "TheVoidDragon"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Nintendeal: Nintendo making smaller capacity Switch 2 carts",
        "score": 328,
        "text_content": "[https://bsky.app/profile/did:plc:porwhxzwut6vszlqjcvnmmag/post/3ma6x4jlgkk2u?ref\\_src=embed](https://bsky.app/profile/did:plc:porwhxzwut6vszlqjcvnmmag/post/3ma6x4jlgkk2u?ref_src=embed) > >I can confirm that smaller capacity Switch 2 game cards are in production but due to chip shortages it will take time before we see widespread availability Despite the smaller capacity, these cards will still be expensive due to rising cost of materials Game-Key Cards are not going away",
        "comments": [
            {
                "raw_content": "President “Market Conditions” really fucking up gaming specifically",
                "author": "locke_5"
            },
            {
                "raw_content": "Of course key cards aren’t going away. It’s a pretty smart concept and with the price of all storage components it turned out to be a major cost saver.",
                "author": "GoldenTriforceLink"
            },
            {
                "raw_content": "I'll only believe in this once a good source confirms it. To me, smaller cart sizes won't fix anything. They will be even slower than the current 64Gb ones and probably won't even be that much cheaper... I also don't think that third parties will do a 180 and start supporting game carts after a year (or even more, depending on when these are released, if they even do) of GKC.",
                "author": "Vanilla_Baunilha"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[HYPEX] Spongebob and Patrick are coming to Fortnite as Sidekicks",
        "score": 110,
        "text_content": "Along with their voicelines and an \"Imagination\" emote Source: Hypex https://xcancel.com/i/status/2001408317621473738",
        "comments": [
            {
                "raw_content": "#HypeX is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "![gif](giphy|215wIDncTLsfS) If only....",
                "author": "Mariosonicpac"
            },
            {
                "raw_content": "Fortnite really is more of a marketing platform at this point",
                "author": "LitheBeep"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Steam Machine leaked start-up video",
        "score": 431,
        "text_content": "https://xcancel.com/SadlyItsBradley/status/2001123100914802980",
        "comments": [
            {
                "raw_content": "It’s confirmed. The machine will turn on.",
                "author": "hoopedchex"
            },
            {
                "raw_content": "![gif](giphy|10bTCLE8GtHHS8)",
                "author": "DrJokerX"
            },
            {
                "raw_content": "The Half Life subreddit will take this as a sign HL3 is coming soon",
                "author": "Loose_Society9485"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Dispatch for Nintendo Switch 1 & 2 in the AU eShop",
        "score": 248,
        "text_content": "Switch 2 https://ec.nintendo.com/AU/en/titles/70010000110139 Switch https://ec.nintendo.com/AU/en/titles/70010000105332",
        "comments": [
            {
                "raw_content": "Reveal must be imminent since the pre-order is up and on sale + it releases January 29th",
                "author": "Joshdabozz"
            },
            {
                "raw_content": "Awesome game, love that more people are going to get to play it.",
                "author": "swamp_mentality"
            },
            {
                "raw_content": "I think that's the first proper early eShop listing we've had in a hot minute!",
                "author": "PlanetaryIceTea"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Compute Runtime 25.48.36300.8 brings more performance optimizations & Xe3 fixes",
        "score": 19,
        "text_content": "",
        "comments": [
            {
                "raw_content": "LOL, after upgrading to kernel 6.18, XPU LLM + Intel Arc GPU just stopped working for me. The GPU is detected, but VRAM can’t be queried at all. I’ve filed a bunch of bug reports, and it really looks like Intel changed something in the new kernel / Xe stack. So far no one has a real fix.",
                "author": "plumlis"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "This is the most powerful 16-inch AMD Lenovo laptop: ThinkPad P16s Gen 4 review with Ryzen AI 9 HX",
        "score": 27,
        "text_content": "",
        "comments": [
            {
                "raw_content": "AMD still not shipping their discrete graphics in laptops in 2025 is an own goal.",
                "author": "CataclysmZA"
            },
            {
                "raw_content": "Still no Stix Halo 128gb laptop other than that single 14 inch HP one. I'd call it a phantom launch but there are many mini PCs with that chip. It makes no sense.",
                "author": "Qaxar"
            },
            {
                "raw_content": "bring back the z16 line, with haltic touchpads and no numpads. Hx 370 or strix halo",
                "author": "New-Tomato7424"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Ryzen 7 9850X3D appears at retailers with early pricing above 9800X3D",
        "score": 137,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "the higher rated cpu is more than the lower rated cpu? shocker...",
                "author": "CMDR_omnicognate"
            },
            {
                "raw_content": "In other words, grab the 9800x3d on sale while you still can before AMD increases the price of 9800x3d to make 9850x3d more appealing.",
                "author": "UnobjectionableBloke"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD FSR Redstone Frame Generation Tested: Good Quality, Bad Frame Pacing",
        "score": 83,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wouldn't know. My 7900 XTX isn't worthy enough apparently.",
                "author": "Mercennarius"
            },
            {
                "raw_content": "The pacing issue is so dumb and feels obvious when playing. Embarrassing that they didn't fix it before release.",
                "author": "thedupuisner"
            },
            {
                "raw_content": "Dogshit frame pacing after all this time. Rip",
                "author": "JamesLahey08"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Ryzen AI 7 445 \"Gorgon Point\" 6-core CPU leaks out, features Radeon 840M iGPU",
        "score": 37,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "I don’t understand why they won’t make one with 6 cores and 16cus with no npu for gaming handhelds. We don’t need 12 freaking cores in our handhelds, it’s actually detrimental considering it pulls power from the tdp starved gpu.",
                "author": "sittingmongoose"
            },
            {
                "raw_content": "Soo rdna3.5? How much the improvement from 740m?",
                "author": "yusnandaP"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Unboxing shows Sapphire RX 9070 XT Phantom Link model with GC-HPWR adapter",
        "score": 14,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "\"We Are Not as Wealthy as We Thought We Were\": Elevated American Household Net Worth Reflects Poverty, Not Wealth Why rising home prices reflect housing scarcity—and why more homebuilding is the solution",
        "score": 150,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Vacancy tax. I just don't see the negative in it.",
                "author": "MidnightGloomy7016"
            },
            {
                "raw_content": "Definitely need to build more homes",
                "author": "DizzyMajor5"
            },
            {
                "raw_content": "The author recommends increasing the housing supply to lower prices relative to incomes. With limited city space, you can only build vertically. The suburbs are more spread out, with new construction being built horizontally, leaving little land for new houses.",
                "author": "TGAILA"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage rates move higher after the Fed rate cut, causing loan demand to drop",
        "score": 203,
        "text_content": "",
        "comments": [
            {
                "raw_content": "…because mortgage rates more closely track the 10 year T-Bill, not the fed rate.",
                "author": "majessa"
            },
            {
                "raw_content": "Anyone else catch homebuilder Lennars guidance for 2026 this morning? Was not good 🫣",
                "author": "MadeForTeaVea"
            },
            {
                "raw_content": "I hope now people stop with the “mortgage rates will drop when the Fed cuts” crap. At this point, if you peddle that shit, you’re either stupid or dishonest",
                "author": "BrianChange704"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "In a frozen luxury housing market, buyers are asking to ‘try before they buy’ and having sleepovers in multimillion-dollar mansions | Fortune",
        "score": 37,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The Suburbs of St. Louis Are the Most Affordable Place in the U.S. to Buy a Home",
        "score": 101,
        "text_content": "",
        "comments": [
            {
                "raw_content": "St. Louis has some gorgeous suburbs. Seriously.",
                "author": "NiceUD"
            },
            {
                "raw_content": "to bad its in a shithole state. best move i ever did was get out of it.",
                "author": "digital121hippie"
            },
            {
                "raw_content": "Loving all the stl hate. Keep it up, we don’t want to compete with you for our affordable housing.",
                "author": "mr_mufuka"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Zombie mortgage debts making WallStreet rich",
        "score": 17,
        "text_content": "A hidden housing crisis is sweeping the US as debt collectors revive forgotten mortgages to seize homes. Bloomberg reporters uncover how outdated laws and predatory tactics have left millions at risk. [https://youtu.be/2U9kSz1pFhs?si=WUpa80kYG6DDzVns](https://youtu.be/2U9kSz1pFhs?si=WUpa80kYG6DDzVns) Looks like piggyback loans from 00 housing boom/crises is now coming back as wallstreet bought these loans and is now coming after homeowners who didn’t pay.",
        "comments": [
            {
                "raw_content": "Vampire Squid",
                "author": "Nuvuser2025"
            },
            {
                "raw_content": "they have a second mortgage they forgot about? tough nuggets. goodbye home.",
                "author": "HormoneDemon"
            },
            {
                "raw_content": "From 2000? or 2020?",
                "author": "EstateGate"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "What started as a 31-day stay became a ‘nightmare’ for D.C. Airbnb host",
        "score": 39,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A D.C. property owner said a woman stopped paying rent and claimed tenant rights to keep from being evicted.",
                "author": "jakallan3"
            },
            {
                "raw_content": "I don't understand how any investor would see the rental of a DC rowhome as a good investment",
                "author": "Professional-Sir7048"
            },
            {
                "raw_content": "Bro if you actually landlorded, alarm bells should be blaring when someone tries to book a 31 day stay in your STR. That just screams squatter/adverse possession to me.",
                "author": "MaimonidesNutz"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "JPMorgan (JPM) Pulls $350 Billion from the Fed. Here’s Why It’s Buying Treasuries",
        "score": 58,
        "text_content": "",
        "comments": [
            {
                "raw_content": "To lock in higher interest rates",
                "author": "ShortFinance"
            },
            {
                "raw_content": "What should I switch my 401k to because these mf know",
                "author": "The_F1rst_Rule"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "A really good point being made amid all the hate towards Expedition 33 for successfully using AI",
        "score": 1466,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I saw a post in Grimdank (warhammer memes) where people zoom all the fuck in on an image, then debate for pages and pages if the small visual bugs in a machine are caused by AI, and thus, are heresy.",
                "author": "PwanaZana"
            },
            {
                "raw_content": "This is just an argument against tools. We should just ban game engines.",
                "author": "boinkmaster360"
            },
            {
                "raw_content": "With how current coding agents are, basically *any* piece of software you use in the future would have at least in part AI generated code.",
                "author": "FateOfMuffins"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "2025 Summed Up",
        "score": 330,
        "text_content": "",
        "comments": [
            {
                "raw_content": "how far we've come from Bard though I do wonder if/when Gemini can overtake ChatGPT in terms of users and mindshare. The general public still strongly associates AI with ChatGPT",
                "author": "micaroma"
            },
            {
                "raw_content": "Whats up with the creepy Google posts? Calm down.",
                "author": "Turbulent_Talk_1127"
            },
            {
                "raw_content": "The Google glaze is crazy. Subjectively, I've found 5.2 better than 3.0 at almost everything. Opus 4.5 is far better for coding. Objectively, doesn't 5.2 beat 3.0 in most benchmarks as well?",
                "author": "NotYetPerfect"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini 3.0 Flash is out and it literally trades blows with 3.0 Pro!",
        "score": 1486,
        "text_content": "",
        "comments": [
            {
                "raw_content": "wtf, results in arc-agi 2 even better than 3 pro",
                "author": "Silver_Depth_7689"
            },
            {
                "raw_content": "Holy fcuk, I've never seen such a strong lite model",
                "author": "Working_Sundae"
            },
            {
                "raw_content": "That's just crazy",
                "author": "panic_in_the_galaxy"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Reuters is reporting that China's classified EUV project has reverse engineered and successfully built a prototype EUV machine with the help of former ASML engineers",
        "score": 462,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This leaves out that they don’t think it will start producing working chips till 2028 at the earliest, but more likely 2030",
                "author": "socoolandawesome"
            },
            {
                "raw_content": "I can't believe China has reverse engineered Europa Universalis 5...",
                "author": "PostingLoudly"
            },
            {
                "raw_content": "Even a bad EUV changes the game…",
                "author": "KIFF_82"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "google won in 4 acts",
        "score": 1196,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sorry Dave I’m afraid I cannot open the hatch to the gooncave",
                "author": "Ireallydonedidit"
            },
            {
                "raw_content": "Hey Google, generate 10gb goon folder",
                "author": "Chickenological"
            },
            {
                "raw_content": "There’s much less censorship in Gemini. OpenAI is overly restrictive.",
                "author": "hukep"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini 3 Flash is the most cost-efficient frontier model",
        "score": 78,
        "text_content": "Artificial Analysis Intelligence Index score and cost wise.",
        "comments": [
            {
                "raw_content": "Grok Fast and DS V3.2 look way more cost efficient, according to these charts",
                "author": "usernameplshere"
            },
            {
                "raw_content": "I'm guessing this is the model free users will get access to now on the app as less limited model after a few Pro prompts? I haven't used ChatGPT in forever, which model do you get as a free user? I'm not talking about 2-3 prompts from the better model, the one you can use with a much more lenient rate limit. Thankfully we're past the days of GPT-3.5 Turbo poisoning the well for people's experience of LLMs.",
                "author": "CheekyBastard55"
            },
            {
                "raw_content": "can anyone with codex confirm its better than opus 4.5? All these benchmarks are meaningless until a programmer tells me they prefer it over Claude's cream of the crop model.",
                "author": "AirGief"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Tencent announces HY-World 1.5. An open source interactive world model that runs at 480p 24 FPS on consumer hardware.",
        "score": 170,
        "text_content": "They have it up on their website at https://3d.hunyuan.tencent.com/sceneTo3D. It is not in English and currently has a waiting list. However they have provided the files needed to run it on your own hardware. Gitbhub: [https://github.com/Tencent-Hunyuan/HY-WorldPlay](https://github.com/Tencent-Hunyuan/HY-WorldPlay) Surprisingly it can run on consumer GPUs with a minimum VRAM requirement of 14 GB with model offloading. Perfect for my 12 GB card. 😤 Huggingface: [https://huggingface.co/tencent/HY-WorldPlay](https://huggingface.co/tencent/HY-WorldPlay) Technical Report: [https://3d-models.hunyuan.tencent.com/world/world1\\_5/HYWorld\\_1.5\\_Tech\\_Report.pdf](https://3d-models.hunyuan.tencent.com/world/world1_5/HYWorld_1.5_Tech_Report.pdf)",
        "comments": [
            {
                "raw_content": "This was just 8 months ago. https://www.reddit.com/r/gaming/comments/1jteaze/microsoft_unveils_aigenerated_demo_inspired_by/",
                "author": "ramakitty"
            },
            {
                "raw_content": "This is friggin insane",
                "author": "itshifive"
            },
            {
                "raw_content": "This is sorcery, holy cow.",
                "author": "Practical-Hand203"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Google releases Gemini 3 Flash: Ranks #3 on LMArena (above Opus 4.5), scores 99.7% on AIME and costs $0.50/1M plus Benchmarks.",
        "score": 454,
        "text_content": "**Sources:** * [Google Blog](https://blog.google/products/gemini/gemini-3-flash/) * [LMSYS Leaderboard Tweet](https://x.com/arena/status/173641...)",
        "comments": [
            {
                "raw_content": "That's pretty crazy for a 'small' model. Even higher than 3.0 Pro in some benchmarks.",
                "author": "GlowingNec"
            },
            {
                "raw_content": "The jump from 2.5 Flash, which I even enjoyed and built things with, to this is just insane! ![gif](giphy|YnBntKOgnUSBkV7bQH)",
                "author": "acoolrandomusername"
            },
            {
                "raw_content": "Damn! Gemini-Flash beating all major models - GPT 5.1,5.2 and Opus 4.5??! 🤯",
                "author": "jbcraigs"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "GPT Image 1.5 vs Nano Banana Pro realism test",
        "score": 959,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/kt37g5serq7g1.png?width=315&format=png&auto=webp&s=577d80723ce255616985a1d72b80131db5facd36 💀",
                "author": "LordGronko"
            },
            {
                "raw_content": "It seems like Chatgpt were trained on online stock images while nano banana was trained on our private google drive images.",
                "author": "rudshaug"
            },
            {
                "raw_content": "Do share the prompts used please.",
                "author": "JoeyJoeC"
            }
        ],
        "subreddit": "singularity"
    }
]