[
    {
        "post_name": "Is it just me, or is black history month canceled this year?",
        "score": 596,
        "url": "https://patriots.win/p/19AdbiiMQD",
        "comments_count": 77,
        "posted_at": "2025-02-24 00:53:45 UTC",
        "text_content": "",
        "comments": [
            {
                "raw_content": "so is Juneteenth day off still on the menu?  asking for a colored friend ",
                "author": "DenturesNancy",
                "replies": [
                    {
                        "raw_content": "Juneteenth... so chirpers don't feel left out on Father's Day",
                        "author": "ArshesNei8",
                        "replies": [
                            {
                                "raw_content": "They should make June 19th the National Smoke Detector Battery Change Day.",
                                "author": "WassermanSchultz",
                                "replies": [
                                    {
                                        "raw_content": "They still wouldn't be able to figure it out.",
                                        "author": "budesonide"
                                    },
                                    {
                                        "raw_content": "Those are not smoke detectors, they are cooking timers.",
                                        "author": "LibsRcrazy"
                                    }
                                ]
                            },
                            {
                                "raw_content": "Juneteenth... a holiday that sounds as illiterate as it's celebrants",
                                "author": "UncleTedsWoodshop",
                                "replies": [
                                    {
                                        "raw_content": "It is celebrants?",
                                        "author": "posedgeclk"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "raw_content": "That one is now an official holiday that was inroduced to buy black votes (who tf heard of 'juneteenth' more than a couple years ago?). And now many Godless companies have taken away Good Friday as a paid day off to make room for this negro day of retardation on their PTO calendars.",
                        "author": "ecto_coolest",
                        "replies": [
                            {
                                "raw_content": "It was made to ramp up racial animosity and make turn key civil war and regime change a possibility.",
                                "author": "learntocode",
                                "replies": []
                            },
                            {
                                "raw_content": "Ironically, I heard about it in 1991.  I was an AF Reservist in Texas and was having breakfast with a black co-worker on a Saturday morning during drill weekend that month.  It was probably June.  He simply asked if I had heard of Juneteenth, and I told him no, so he explained what it was.  And then we kept eating breakfast.  That was pretty much it. I'm stunned it ever became a National holiday.",
                                "author": "BlitheringIdiot2",
                                "replies": [
                                    {
                                        "raw_content": "It was a local Texas thing and Obama elevated. Complete bullshit.\r\n\r\nNow, I DO celebrate my Juneteenth. See here:\r\n\r\nhttps://m3.gab.com/media_attachments/df/2b/53/df2b5301141bf7f86bc66660708a3639.jpeg",
                                        "author": "TruthyBrat"
                                    }
                                ]
                            },
                            {
                                "raw_content": "Never got Good Friday off myself",
                                "author": "Froynlavenfroynlaven",
                                "replies": []
                            },
                            {
                                "raw_content": "I lived in Texas and never heard of it. The origin based on the usually made up negro account of history.",
                                "author": "SanityGumby",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "raw_content": "At least juneteenth as stupid as it sounds is a real thing worth celebrating especially by stupid republicans who gave them the damned reason to celebrate. Thank a republican day!",
                        "author": "Stanwyk74",
                        "replies": [
                            {
                                "raw_content": "I just want my bike back.",
                                "author": "BidensPrisonWallet",
                                "replies": [
                                    {
                                        "raw_content": "My daughter wants her tip from last night waitressing.",
                                        "author": "Stanwyk74"
                                    },
                                    {
                                        "raw_content": "Oh you too?",
                                        "author": "Stanwyk74"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "raw_content": "Which color?",
                        "author": "cwo5al",
                        "replies": []
                    }
                ]
            },
            {
                "raw_content": "Odd how people celebrate history by skin color.",
                "author": "ColonelKlink",
                "replies": [
                    {
                        "raw_content": "If they're biracial like Obama, do they only celebrate half the month? ",
                        "author": "26magarat",
                        "replies": []
                    }
                ]
            },
            {
                "raw_content": "Maybe everyone is secretly sick of things and Trump made it okay to be honest about it?",
                "author": "Leftist_Lemming",
                "replies": [
                    {
                        "raw_content": "Absolutely.  All the closet Trump supporters are emerging from their long winter.",
                        "author": "Svaap",
                        "replies": []
                    }
                ]
            },
            {
                "raw_content": "It's nice not being blasted by every form of media about it. ",
                "author": "WildernessBro",
                "replies": []
            },
            {
                "raw_content": "I still hear radio stations bringing up black history month",
                "author": "LogicCircuits",
                "replies": [
                    {
                        "raw_content": "And they complain about it being the shortest month too.",
                        "author": "HRpumpanddump",
                        "replies": [
                            {
                                "raw_content": "There's radical extremists in NYC still pushing it\n\nBut it's smaller. Most people aren't down the radical black supremacist train and when they're not being forced to by the media they don't really promote that shit\n\nSame with gender. If Trump can take out the trans industrial complex a lot of people will simply stop using pronouns because they won't be forced to..",
                                "author": "Hillaryisbadd",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "post_name": "Likely new German Chancellor Friedrich Merz slams Trump and urges Europe to gain \"independence\" from the U.S. after election victory.",
        "score": 483,
        "url": "https://patriots.win/p/19AdbiiMUM",
        "comments_count": 162,
        "posted_at": "2025-02-24 01:01:53 UTC",
        "text_content": "",
        "comments": [
            {
                "raw_content": "Europe doesn't care about Europe. ",
                "author": "Leftist_Lemming",
                "replies": [
                    {
                        "raw_content": "European “leadership” that is groomed and hand-selected in Brussels and Davos doesn’t care about Europe",
                        "author": "Groundpounder",
                        "replies": [
                            {
                                "raw_content": "The American deep state completely shaped Europe into what it is today. They haven't had to experience the real world in over 70 years.",
                                "author": "Prudentwait",
                                "replies": [
                                    {
                                        "raw_content": "I'm fine with Europe becoming independent from the United States.. They don't have a first amendment and it shows\n\nThe USAA should care about the USA and Europe can fight its own battles\n\nThe American military is legally mandated to be large enough to take on both Russia and China at the same time..\n\nAmerica never needed Europe\n\nI will see how long it takes them to realize that europe needed America",
                                        "author": "Hillaryisbadd"
                                    }
                                ]
                            },
                            {
                                "raw_content": "Brussels one of biggest pedo scandals ever ",
                                "author": "Sunnybats2",
                                "replies": [
                                    {
                                        "raw_content": "That dude looks like he'd fit right in with that. ",
                                        "author": "BurtMcGirt"
                                    },
                                    {
                                        "raw_content": "Got refs?",
                                        "author": "posedgeclk"
                                    }
                                ]
                            },
                            {
                                "raw_content": "Not really. A majority are voting and electing their leaders. The fault lies with them. Americans have tried to save them for nearly a century, but the Eurotrash are hell bent on suicide.\r\n\r\nFuck them. Once they are completely replaced by third world scum and Islamists have seized control, an absolute inevitably now, we and Russia should launch a first strike on them because there is no way Islamist can control nukes in Europe. Then we will repopulate with our European descendents. Obviously the real men left Europe for America a century ago and left the pathetic and dumb cucks behind.",
                                "author": "JackLemon",
                                "replies": [
                                    {
                                        "raw_content": "So you magically became a raging leftist when Obama was elected,  twice, or when Joe Biden was “elected”? I didn’t. I believe their parliamentary system and, most importantly, not having a Constitution that defines and protects their rights and freedoms is the biggest problem they face. But even  “Republican” presidents and party officials within the US have merely slowed our decline, at best ",
                                        "author": "Groundpounder"
                                    }
                                ]
                            },
                            {
                                "raw_content": "Do they use voting machines with closed source code? I bet Yes",
                                "author": "snoopy3210",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "raw_content": "They say that after they got cut off. kek",
                        "author": "ColonelKlink",
                        "replies": [
                            {
                                "raw_content": "i want to see them have to fund their socialized medicine *and* their own defense; i'm betting they can't do both.",
                                "author": "snuggs316",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "raw_content": "The E.U. is also not Europe. It's important to remember that the E.U. is a libtard vanity project intended to undermine the individual sovereignty of its nation state members. That's why Nigel Farage fought hard to free the UK.",
                        "author": "MAGAWIN47",
                        "replies": []
                    },
                    {
                        "raw_content": "I think we'd be much much better off aligning with Eastern Europe and yes Russia. Sorry not sorry.",
                        "author": "drattastic1",
                        "replies": []
                    }
                ]
            },
            {
                "raw_content": "Do it.  We want you to stop mooching, and now you want to stop mooching.  Sounds good. ",
                "author": "Powdered_Sugar",
                "replies": [
                    {
                        "raw_content": "This ☝️",
                        "author": "Whoopies_tds",
                        "replies": []
                    },
                    {
                        "raw_content": "Haha, they’ll still beg for money",
                        "author": "Illuminaughty",
                        "replies": [
                            {
                                "raw_content": "They're begging for money here.  This is borderline girlfriend emotional blackmail logic.  \"You won't go in debt to pay may bills while I constantly nag and lecture you, so you're obviously an ogre who doesn't care about me.\". They'll talk about \"independence\", but they'll be shopping for another fool as soon as they hit the door, and finally try to claw their way back when no one will give them a better deal.",
                                "author": "RStroud",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "raw_content": "They are like teenagers;\r\n\r\n“Fine, I’ll do my own laundry!”",
                        "author": "bahhumbugger",
                        "replies": []
                    }
                ]
            },
            {
                "raw_content": "US bases in Germany out!",
                "author": "12points",
                "replies": [
                    {
                        "raw_content": "200% tariff. Full energy embargo.",
                        "author": "Prudentwait",
                        "replies": []
                    },
                    {
                        "raw_content": "Last straw that breaks their economy",
                        "author": "whingdingdilly",
                        "replies": []
                    },
                    {
                        "raw_content": "Yesterday! What a joke we defend them still! ",
                        "author": "Stanwyk74",
                        "replies": []
                    },
                    {
                        "raw_content": "",
                        "author": "",
                        "replies": []
                    }
                ]
            },
            {
                "raw_content": "Germany shuffled its chairs on the titanic to sink faster",
                "author": "FuckAllDemocrats",
                "replies": []
            },
            {
                "raw_content": "Let that fucker keep running his mouth.  Pull out our resources and support from Germany and these demonic liberal shit holes.  In short time he’ll be sucking dick through a knot hole in a truck stop lavatory.",
                "author": "Exsultate",
                "replies": [
                    {
                        "raw_content": "He likely does that already.",
                        "author": "Overtaxed",
                        "replies": []
                    },
                    {
                        "raw_content": "That is extremely graphic. And I'm here enjoying it! 🤣",
                        "author": "TearsAficionado",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "post_name": "FBI Director Kash Patel has fired multiple employees, sources confirm. \r\n",
        "score": 270,
        "url": "https://patriots.win/p/19AdbiiMtC",
        "comments_count": 22,
        "posted_at": "2025-02-24 01:30:08 UTC",
        "text_content": "",
        "comments": [
            {
                "raw_content": "why does every firing of some low level fucktard require a press release now?",
                "author": "Badfinz_FL",
                "replies": [
                    {
                        "raw_content": "Because the press is desperate to pretend we’re in the end of days. They don’t understand that a super majority of Americans think this is wonderful ",
                        "author": "TheEmperorProtects",
                        "replies": []
                    },
                    {
                        "raw_content": "What else do they have to talk about?",
                        "author": "Viewer01",
                        "replies": []
                    },
                    {
                        "raw_content": "good question",
                        "author": "f00k_me",
                        "replies": []
                    },
                    {
                        "raw_content": "Because it hasn't happened in 40 years in DC?\n",
                        "author": "GTHAYS",
                        "replies": []
                    }
                ]
            },
            {
                "raw_content": "We're not really serious until people start getting locked the fuck up.",
                "author": "TheRedPilledArtist",
                "replies": [
                    {
                        "raw_content": "Are they still keeping their security clearances?\n\nStrip all of them of their clearances, and watch them cry even louder.",
                        "author": "McFatty7",
                        "replies": []
                    }
                ]
            },
            {
                "raw_content": "Sounds like he got the mole that kept leaking then at least.",
                "author": "Websitesdown",
                "replies": []
            },
            {
                "raw_content": "if it isnt 'all of them', its not enough.",
                "author": "BirthHole",
                "replies": []
            },
            {
                "raw_content": "When are the Epstein Files going to be released?",
                "author": "posedgeclk",
                "replies": []
            }
        ]
    },
    {
        "post_name": "Dan Bongino has been named Deputy Director of the FBI.",
        "score": 100,
        "url": "https://patriots.win/p/19AdbiidPC",
        "comments_count": 15,
        "posted_at": "2025-02-24 01:44:59 UTC",
        "text_content": "",
        "comments": [
            {
                "raw_content": "Let this be true😀",
                "author": "Dogpile1",
                "replies": [
                    {
                        "raw_content": "It’s true, pedes.",
                        "author": "HiimHillaryClinton",
                        "replies": []
                    }
                ]
            },
            {
                "raw_content": "OH WOW did not see that one coming AT ALL.... Congrats!!!",
                "author": "Colorado-Living",
                "replies": []
            },
            {
                "raw_content": "fucking BRUH",
                "author": "assblast",
                "replies": []
            },
            {
                "raw_content": "Awesome if true. I can't find anything confirming this, but could just be news lag.",
                "author": "AsaNisiMAGA",
                "replies": [
                    {
                        "raw_content": "Dan just tweeted it. https://twitter.com/dbongino/status/1893839865864745168\r\n\r\nAnd here is the Trump Truth as well. https://truthsocial.com/@realDonaldTrump/posts/114056317037035302",
                        "author": "IncredibleMrE1",
                        "replies": []
                    }
                ]
            },
            {
                "raw_content": "Winning!",
                "author": "TruculentGoose",
                "replies": []
            }
        ]
    },
    {
        "post_name": "So you did absolutely nothing... GOT IT. ",
        "score": 1378,
        "url": "https://patriots.win/p/19AdbihXg1",
        "comments_count": 170,
        "posted_at": "2025-02-23 22:56:54 UTC",
        "text_content": "",
        "comments": [
            {
                "raw_content": "Those 5 things she mentioned can be condensed into one thing: \"I virtue signalled in an attempt to elicit engagement on my social media accounts.\" ",
                "author": "LibertyFox",
                "replies": [
                    {
                        "raw_content": "Those 5 nothings become 1 nothing. ",
                        "author": "SALTYinSeattle",
                        "replies": [
                            {
                                "raw_content": "She forgot number 6: [Eat a salad with a comb](https://archive.ph/kiWHM)",
                                "author": "McFatty7",
                                "replies": [
                                    {
                                        "raw_content": "7. Humiliated and berated my staff.",
                                        "author": "SurveilThis"
                                    },
                                    {
                                        "raw_content": "\"Klobuchar then directed the aide to clean the comb after she had finished.\"\n\nSlay, Queen!  ",
                                        "author": "Bohemyth_2"
                                    }
                                ]
                            },
                            {
                                "raw_content": "\"I support the current thing\"",
                                "author": "caKAG",
                                "replies": []
                            },
                            {
                                "raw_content": "You don't understand, what Musk is doing with the email is fucking retarded. \r\nFeds work on classified info and OPM is not their supervisor to ask for what they did. FBI,DOD and all other fed agencies have told their employees not to respond. You cannot put classified info on an email to those who need not know what you are working on. This means DoD is not allowed to tell OPM on what they are working on daily because OPM doesn't need to know what DoD is working on. \"NEED TO KNOW\" is a big thing in the gov when you get security clearances. You cannot violate that NEED TO KNOW because it's a fucking crime, can be changed with a crime of you violate NEED TO KNOW.\r\nThese type of Emails needs to come from respective agency heads. NOT OPM.\r\nThis is why Fed agencies have given directions to their employees not to respond until further notice.\r\nSome have said do not respond at all.\r\nWhat Musk did with the email is fucking retarded as if he has never held a security clearance.\r\nIf he wants to weed out ghost employees like he clarified on his X. Then he needs to find another way to do it because this Email thing is utterly fucking retarded. ",
                                "author": "7PC_Principle",
                                "replies": [
                                    {
                                        "raw_content": "The email thing isn't about finding out what each employee is doing. It's a CAPTCHA to find out which employees are even a person.",
                                        "author": "SALTYinSeattle"
                                    },
                                    {
                                        "raw_content": "So what you're saying is that the office of personnel management is worthless and unable to do what it is intended to do? ",
                                        "author": "BulletProof_Prezdnt"
                                    },
                                    {
                                        "raw_content": "What you are saying is fucking retarded. You need to learn what classification, accountability, oversight work then come back. If you have a clearance it should be revoked because you don’t seem to understand what that means. ",
                                        "author": "SanityGumby"
                                    },
                                    {
                                        "raw_content": "It depends on the organization.\n\nGSA HR sent the letter from their own systems and indicated it was necessary to also CC their respective manager.\n\nYou don't seem to understand how reporting actually work. You don't need to provide details to state you were in X meetings with another department, writing code or doing daily activities. \n\nAnyone who is actually doing anything can pick some significant activity and provide non-descript details. Everyone else who is employed does this quite a bit.",
                                        "author": "Snek_Plissken"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "raw_content": "Don’t forget treason ",
                        "author": "yepyep",
                        "replies": []
                    },
                    {
                        "raw_content": "With the primary goal of getting campaign donations.",
                        "author": "TD_Covfefe_Crusader",
                        "replies": []
                    },
                    {
                        "raw_content": "I mean, her social media followers are pretty retarded soooo this probably works.",
                        "author": "Ihateeveryone2",
                        "replies": []
                    }
                ]
            },
            {
                "raw_content": "Eff this retarded C word",
                "author": "ShutItAllDown",
                "replies": [
                    {
                        "raw_content": "Fuck this retarded cunt. There. I said it. ",
                        "author": "SALTYinSeattle",
                        "replies": [
                            {
                                "raw_content": "C",
                                "author": "CmonPeopleGetReal",
                                "replies": [
                                    {
                                        "raw_content": "U",
                                        "author": "SurveilThis"
                                    }
                                ]
                            },
                            {
                                "raw_content": "She actually thought she was going to be President.😂",
                                "author": "SteveRogers42",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "raw_content": "The only thing she fought was her fork amd dinner plate.  Maybe the toilet.",
                "author": "Dashmoomoo",
                "replies": [
                    {
                        "raw_content": "She uses a plastic comb to eat salad.Yes it'. s true",
                        "author": "Mulletgunner",
                        "replies": []
                    },
                    {
                        "raw_content": "She is getting seriously fat. You’d think someone in her inner circle would tell her to put down the fork.",
                        "author": "current_horror",
                        "replies": []
                    }
                ]
            },
            {
                "raw_content": "Did she ever press Biden to pay attention to rising household costs?",
                "author": "Obamas_Goatse_Party",
                "replies": [
                    {
                        "raw_content": "Reason for rising housing costs:\r\n\r\nIllegal Aliens. \r\n\r\nSo she kept her mouth closed. ",
                        "author": "Filo76",
                        "replies": [
                            {
                                "raw_content": "Don't forget BLM burning down $4.2 billion worth of buildings which had to be rebuilt. Also, them ballooning inflation by spending like drunken sailors which required hiking interest rates. ",
                                "author": "anotherthing",
                                "replies": [
                                    {
                                        "raw_content": "that had nothing to do with rising inflation it was post covid printing billions as handouts and the government wasting taxpayer funds ",
                                        "author": "logan34"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "raw_content": "I thought the same thing. Where has she been for the last 4 years?",
                        "author": "KravMaga",
                        "replies": []
                    }
                ]
            },
            {
                "raw_content": "I fought for this and pushed for that\n\n\nWhat got done?\n\n\n\nNothing \n\n\n",
                "author": "Sea_Still",
                "replies": []
            }
        ]
    },
    {
        "post_name": "From Elon…",
        "score": 1103,
        "url": "https://patriots.win/p/19AdbihXoC",
        "comments_count": 80,
        "posted_at": "2025-02-23 23:04:02 UTC",
        "text_content": "",
        "comments": [
            {
                "raw_content": "I love King Troll 😄 ",
                "author": "Mark4-40",
                "replies": [
                    {
                        "raw_content": "The best part is, there are numerous \"resist' pages where essentially this exact type of memo is circulating. There's one called the \"Alt national park service\" where this morning they were sharing a GOTCHA DRUMPFT post where they said to include more or less the same sort of thing, and were masturbating one another about how there was nothing that Elon could do about it. \n\nI just lol'd and was like, this is the exact type of response they are expecting. \n\nFucking dumbasses. ",
                        "author": "CAPTAIN_TENDY_PLATE2",
                        "replies": [
                            {
                                "raw_content": "I liked the last sentence!\n",
                                "author": "Tynyyn",
                                "replies": [
                                    {
                                        "raw_content": "nipples protruding, very disrespectful ",
                                        "author": "CAPTAIN_TENDY_PLATE2"
                                    },
                                    {
                                        "raw_content": "If they use similar phrases repeatedly, Elon is going to see it and fire them all. Federal employees are not smart.",
                                        "author": "snoopy3210"
                                    }
                                ]
                            },
                            {
                                "raw_content": "I mean...is there something they can do about it?",
                                "author": "Deadline",
                                "replies": [
                                    {
                                        "raw_content": "At this point, sit back and watch the fireworks, baby. I swear we're entering into something amazing right now. ",
                                        "author": "CAPTAIN_TENDY_PLATE2"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "raw_content": "You know if you put that Bullshit in an official e-mail and they're demonstrably false that's 'Making a False Official Statement'...a Federal Crime.\n\n'Making a False Statement to a Federal Agency', 18 U.S.C. § 1001\n\nAt the very least you'd be terminated for cause and lose everything...  ",
                        "author": "Moebius",
                        "replies": [
                            {
                                "raw_content": "That's why the items were supposed to be unverifiable. Though a couple of the ones in this example don't quite fit they description.",
                                "author": "Deadline",
                                "replies": [
                                    {
                                        "raw_content": "Supposed to be. But all that stuff really is verifiable, just how far deep do you want to dig? And it looks like Doge wants to dig pretty deep.  Hell, I can follow up on that database query optimization and catch that bullshit.  ",
                                        "author": "BidenTaintMyPrez"
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "raw_content": "To be fair if my work organisation tried this with me I’d tell them to fuck off. My performance is monitored by my output weekly by my inline supervisors. If I wasn’t performing it’s on them to monitor. \nI’d just respond by saying I did my job as required.",
                "author": "Cianevalies",
                "replies": [
                    {
                        "raw_content": "My output was X and is supervisor monitored.  Those tasks require me to do A B C D and E.  This is not complex.  And yes I have been asked by a new supervisor or company leader before.\n\nThey are looking for people that did not even respond to the email that is stupid easy.  ",
                        "author": "yukondave",
                        "replies": []
                    },
                    {
                        "raw_content": "That's because in the private sector output can actually be quantified, in the government there is no output, everything is overhead",
                        "author": "CmonPeopleGetReal",
                        "replies": [
                            {
                                "raw_content": "If you can't measure it with metrics, it can't be managed.",
                                "author": "bringbackthe80s",
                                "replies": []
                            },
                            {
                                "raw_content": "Hard to measure output when your revenue stream is *guaranteed*",
                                "author": "realPhantomFuck",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "raw_content": "And for the vast majority of fed workers, it's not even \"their\" organization. OPM is its own agency and has no authority or oversight over other agencies that I'm aware of. ",
                        "author": "alex_coopersmith",
                        "replies": [
                            {
                                "raw_content": "That's why most Center Directors I think are telling everyone not to respond until further notice.  The email is extremely non-professional, from outside anyone's chain of command, and so brief it literally matches what phishing emails look like.",
                                "author": "Error404",
                                "replies": [
                                    {
                                        "raw_content": "Mine told people who were working today but not tomorrow, to go ahead and respond. Everyone else hold off until tomorrow's instructions. Truly bizarre. ",
                                        "author": "alex_coopersmith"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "raw_content": "while i agree and if evey week they ask this. then that BS, but its a one off its searching for people who don't even check emails or can't even say \"i run xxxxx message my boss for proof\" if you are paid to do a job and you dont even read your emails. then they might nor fire you but they will look at you futher\n\nits looking for the 100,000s of workers at home getting paid while doing minor jobs. maybe a meeting every 2 weeks.  the are so many cracks these people can fall in. Bosses change and no one checks on them and they just keep getting paid. \n\n",
                        "author": "Justtoaskwhy",
                        "replies": []
                    }
                ]
            },
            {
                "raw_content": "This was a question for GRok.    LOL",
                "author": "FudgyFudgeBots",
                "replies": [
                    {
                        "raw_content": "yes i think they posted this as don't even attempt to use AI to answer we know the AI responses ",
                        "author": "OG_BACONndEGGs",
                        "replies": []
                    }
                ]
            },
            {
                "raw_content": "I dont get it\r\n",
                "author": "LawyersPlayDota",
                "replies": [
                    {
                        "raw_content": "Showing how easy it is to make up bullshit about your work. Here I’ll do it right now\n\nToday I led a new initiative at our board meeting focusing on more nuanced ways to increase sales and attention to our brand. \n\nAlso started on-boarding process for 3 new employees, and set up an additional few interviews as well!",
                        "author": "MedicallyReddit",
                        "replies": [
                            {
                                "raw_content": "YOU GET A RAISE",
                                "author": "MAGA_____bitches",
                                "replies": []
                            },
                            {
                                "raw_content": "You can just tell a chatbot to make up five points.",
                                "author": "sleepyspar",
                                "replies": []
                            },
                            {
                                "raw_content": "",
                                "author": "",
                                "replies": []
                            },
                            {
                                "raw_content": "🤣\n\n---\n\n**Weekly Performance Report**  \n**Employee: [REDACTED]**  \n**Clearance Level: TPS-COVER-SHEET-APPROVED**  \n\n1. **Interdepartmental Beverage Resource Mediation**  \n   *Executed multi-stakeholder conflict resolution initiative regarding caffeination protocol discrepancies (Ref: CFR 42.☕.1984). Established ad hoc task force to explore liquid consumable equity frameworks.*  \n\n2. **Temporal Resource Allocation Optimization**  \n   *Pioneered theoretical application of quantum workflow dynamics, achieving 124% productivity via chrono-synclastic infundibulation methodology (Peer-reviewed via breakroom consensus).*  \n\n3. **Verbal Interface Calibration**  \n   *Performed 37 iterative feedback loop closures via strategic deployment of \"per my last email\" protocols, enhancing cross-functional resource alignment.*  \n\n4. **Critical Asset Recovery Operation**  \n   *Coordinated high-precision retrieval of Office Supply Code 37A (stapling apparatus) from unsecured logistical node B-12R. Full chain-of-custody documentation pending notarization.*  \n\n5. **Paperwork Streamlining Innovation**  \n   *Developed recursive administrative efficiency matrix by documenting meta-procedures for reducing procedural documentation (Form 1024-EX/Rev. 3 submitted in triplicate).*  \n\n**Additional Merit Citation**  \n*Executed Classified Material Neutralization Protocol 12(b) via rapid digestive assimilation, preserving national security interests through enhanced bioavailability pathways.*  \n\n---  \n\n*All achievements compliant with Department of Redundancy Department Standards (DORD-2025.BSv3.1). Fiscal impact: $0.00 (self-funded via existential dread).*",
                                "author": "McFatty7",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "raw_content": "It's showing the shit Fed workers do: nothing",
                        "author": "DrWeeGee",
                        "replies": []
                    },
                    {
                        "raw_content": "Elon asked his Grok AI to answer the five things for him, and then turned it in.",
                        "author": "WassermanSchultz",
                        "replies": []
                    },
                    {
                        "raw_content": "This email isn't actually about figuring out employees productivity. It's about weeding out money laundering.",
                        "author": "LessSwampMoreMAGA",
                        "replies": []
                    }
                ]
            },
            {
                "raw_content": "This has been Copy-Paste-Submitted 10,000 times by federal workers by now. Just run a big de-duplicate. Then take the result and de-duplicate the people. ",
                "author": "SurveilThis",
                "replies": []
            }
        ]
    },
    {
        "post_name": "LIVE LOOK: Every Federal Employee Right Now",
        "score": 1050,
        "url": "https://patriots.win/p/19AdbihXfu",
        "comments_count": 98,
        "posted_at": "2025-02-23 22:52:42 UTC",
        "text_content": "",
        "comments": [
            {
                "raw_content": "DOGE is weeding out the federal daycare program for otherwise unemployable women. All those moronic college majors we laugh at were just a pipeline to infest the government with DEI.\n\nIt's over for them.",
                "author": "LostElf",
                "replies": [
                    {
                        "raw_content": "And now you know why almost every entry-level job just-so-happens to conveniently only be located within college networks.\n\nFor 4 Years, they brainwash the students and mold them into the 'type' of person they want you to be (blue voter). When they graduate, they know they have no skills, so they're going to cling onto whatever pays the most (UBI Government jobs).\n\nIf entry local jobs were available to the public, there would be no need to go to college, and most people would vote Republican to keep taxes and regulations low.\n\n* The Problem: No entry level jobs publicly available\n\n* Their Solution: You have to pay the college just for the opportunity to apply to entry-level jobs\n\nIt's a giant racket.",
                        "author": "McFatty7",
                        "replies": [
                            {
                                "raw_content": "The problem: Not enough Americans starting their. own local brick and mortar small businesses and passing them down to their children",
                                "author": "PowerOfBlues",
                                "replies": [
                                    {
                                        "raw_content": "Oh that is changing.",
                                        "author": "V4Baretta"
                                    },
                                    {
                                        "raw_content": "They see it and some are pissed...",
                                        "author": "V4Baretta"
                                    }
                                ]
                            },
                            {
                                "raw_content": "Not only that, but you come out in massive debt. So unions sound good, government handouts feel necessary, and anyone that opposes them becomes your enemy.\n\n",
                                "author": "Forgototherpassword",
                                "replies": []
                            },
                            {
                                "raw_content": "You don't understand, what Musk is doing with the email is fucking retarded. Feds work on classified info and OPM is not their supervisor to ask for what they did. FBI,DOD and all other fed agencies have told their employees not to respond. You cannot put classified info on an email to those who need not know what you are working on. This means DoD is not allowed to tell OPM on what they are working on daily because OPM doesn't need to know what DoD is working on. \"NEED TO KNOW\" is a big thing in the gov when you get security clearances. You cannot violate that NEED TO KNOW because it's a fucking crime, can be changed with a crime of you violate NEED TO KNOW. These type of Emails needs to come from respective agency heads. NOT OPM. This is why Fed agencies have given directions to their employees not to respond until further notice. Some have said do not respond at all. What Musk did with the email is fucking retarded as if he has never held a security clearance. If he wants to weed out ghost employees like he clarified on his X. Then he needs to find another way to do it because this Email thing is utterly fucking retarded.",
                                "author": "7PC_Principle",
                                "replies": [
                                    {
                                        "raw_content": "You sound like a FISA court loser. \r\n\r\nThat secret shield bullshit is over.\r\n\r\nShut up and comply without divulging state secrets.\r\n\r\nEven if challenged, Musk and team have fairly high clearances.",
                                        "author": "skywalk"
                                    },
                                    {
                                        "raw_content": "I wish Elon was as smart as you.",
                                        "author": "makersmarx"
                                    },
                                    {
                                        "raw_content": "Moron or guvment worker?",
                                        "author": "RichieSprouse"
                                    },
                                    {
                                        "raw_content": "I think you posted this on the wrong comment.",
                                        "author": "McFatty7"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "raw_content": "This is a lot more true than anyone could ever imagine. \n\nSource: worked in the fed, in wildland fire aviation, for 20+ years among a couple of different agencies. \n\nIf you remove the 52 year old white women, who stay at home and use \"WFH\" as a means to allow for child care of their grandchildren, you'd eliminate a sizeable portion of the entire fucking federal government. \n\nFor every ONE dude there is, that does his job and actually provides a benefit to the taxpayers who pay his salary, there are 14 posers hiding behind desks -or worse, claiming to \"work\" from home, but disappear entirely so they can wear their jammies all day and take care of grandkids and dogs and go shopping and get starbucks. \n\nIt's not even a meme, it's 1000% true. \n\nThey're all collectively having a fucking meltdown, too, because they know the jig is finally up. They're getting kicked out on their asses, as they RIGHTLY should have been years ago. \n\nOnce this all blows over, we'll find that the only thing that really happened, was the useless ass people got the boot, and the people who actually do shit were fine. \n\nAgain, ask me how I know. \n\nThere's no way they're firing helo pilots, for example. People who are vital to operations. \n\nThey are, however, firing do nothing karens who have titles like \"operations and logistics support specialist\" because they do literally nothing. \n\nMy cock couldn't be harder, seeing these people FINALLY get what I've wanted to see for YEARS. ",
                        "author": "CAPTAIN_TENDY_PLATE2",
                        "replies": []
                    },
                    {
                        "raw_content": "Thank Godddddd n DOge",
                        "author": "V4Baretta",
                        "replies": []
                    }
                ]
            },
            {
                "raw_content": "What, would you say, ya do here?",
                "author": "Speechify",
                "replies": [
                    {
                        "raw_content": "This one lady is even funnier than all the writers on that movie!",
                        "author": "MyDadLikedBiden",
                        "replies": []
                    }
                ]
            },
            {
                "raw_content": "Sadly,,,typical.  There are so many absolute losers \"working\" foir the government...so many.",
                "author": "OftenDisgusted",
                "replies": [
                    {
                        "raw_content": "Rampant government hiring was used to pad 'new jobs' numbers for previous underperforming administrations.",
                        "author": "TDAF",
                        "replies": []
                    },
                    {
                        "raw_content": "Yep. Called one out and they've been going after my comments the whole day.\r\n\r\nSome funny shit.",
                        "author": "TallyWacker",
                        "replies": [
                            {
                                "raw_content": "Welcome to the downvote bot pool. You pissed off one the coordinators apparently. Now I'm really sure it is being paid for with USAID money. Normally, it just targets new accounts. Take your downvotes with pride. I do.",
                                "author": "Snek_Plissken",
                                "replies": [
                                    {
                                        "raw_content": "The mods could very easily track these bots and ban them. They don't ",
                                        "author": "TheGreatWhiteShadow"
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "raw_content": "Name 5 things you did last week.\n\nDRUMPF IS A FELON!",
                "author": "conservativefrank",
                "replies": [
                    {
                        "raw_content": "They are going batshit over on r/fednews. It's like the end of the world. It's like, welcome to the real world.\n\n```\nBethFromPHL\n•\n1d ago\nThis has become flat out harassment.\n```",
                        "author": "Snek_Plissken",
                        "replies": [
                            {
                                "raw_content": "It is, for them ",
                                "author": "IlhanOmarsFagBrother",
                                "replies": []
                            },
                            {
                                "raw_content": "All the threads in that sub read like they're written by the same person (AI).",
                                "author": "TwoArizonaPedes",
                                "replies": []
                            },
                            {
                                "raw_content": "Leftists are claiming this is like the Holocaust.",
                                "author": "conservativefrank",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "raw_content": "I remember when this broad lied to the nation about Kavanaugh raping her",
                "author": "Taqiyya_Mockingbird",
                "replies": []
            }
        ]
    },
    {
        "post_name": "Peak reddit. These people think they are heroes lol",
        "score": 1346,
        "url": "https://patriots.win/p/19AdbigiSk",
        "comments_count": 188,
        "posted_at": "2025-02-23 20:28:35 UTC",
        "text_content": "",
        "comments": [
            {
                "raw_content": "Holy kek, this is as delusional as Orange Man Hitler. ",
                "author": "Mountaineer",
                "replies": [
                    {
                        "raw_content": "Reeeeananmen Square",
                        "author": "D__1",
                        "replies": [
                            {
                                "raw_content": "underrated comment",
                                "author": "retry",
                                "replies": [
                                    {
                                        "raw_content": "👆🏻😁",
                                        "author": "SuperHonkey"
                                    }
                                ]
                            },
                            {
                                "raw_content": "Damn, that's some top tier PUNishmet",
                                "author": "DemPanicAtTheDisco",
                                "replies": []
                            },
                            {
                                "raw_content": "This is gold, Jerry!",
                                "author": "NickOTeen",
                                "replies": [
                                    {
                                        "raw_content": "Gold!",
                                        "author": "MegoThor"
                                    }
                                ]
                            },
                            {
                                "raw_content": "Kek!",
                                "author": "Covfefe_And_Justice",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "raw_content": "Complete inversion.",
                        "author": "Friendly_B",
                        "replies": [
                            {
                                "raw_content": "*But muh ev*",
                                "author": "LoobintheToobin",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "raw_content": "This \"meme\" found a way to divide by zero.\n\nCommies using a historical incident of a man standing up to commies turned into commies standing up to fascists by using some sort of leftist political UNO reversal card.",
                        "author": "Build_Back_Bankrupt",
                        "replies": [
                            {
                                "raw_content": "I hope they keep using it and then wonder why they're banned from all the Chinese owned forums and the chicom bots stop upvoting them. ",
                                "author": "Smurfection",
                                "replies": []
                            },
                            {
                                "raw_content": "\"\"\"\"\"fascists\"\"\"\"\"",
                                "author": "Graycliff",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "raw_content": "With a $2 Trillion deficit, doubled from the pre-scamdemic $1 Trillion during the O'Biden regime, these deep state government pricks actually believe budget cuts and trimming non-essential workers is equivalent to communist tyranny.  And standing up to it is heroic.\r\n\r\nOh wait, I forgot, literally everything Democrats say is projection.  They are the communist tyrants, a pattern they know very intimately.",
                        "author": "ConvergenceMan",
                        "replies": []
                    }
                ]
            },
            {
                "raw_content": "I bet this shit hits so hard if you’re retarded. ",
                "author": "Swaraj_",
                "replies": [
                    {
                        "raw_content": "I've been commenting on this behavior for several years. I started to notice it back during the first round of Trump election riots and blue haired feminists shoving their fists in the air. \n\nThis photo actually perfectly supports my hypothesis. \n\nIf you go back and look at some of those george floyd riots and \"peaceful protests\" the ones where white college aged women pose for photos of them kneeling with their hands up in the air... There's always something pretty common with them. \n\nEach and every one of these people have constructed carefully crafted costumes that they wear. They have thought up this idea in their heads, of what they believe is a diversity, inclusion, and equity superhero. It's usually someone with a sickle and hammer shirt or other clothing, brightly colored hair, piercings and jewelry adorning their face, skinny jeans, and boots. \n\nI've said before, my hypothesis is basically two fold/interconnected. First, they view this as an in-vogue fashion statement. It's \"hip\" to \"bash the fash\" or whatever the fuck else they call it. Standing on a sidewalk, kneeling down in front of cameras, and raising your fist in the air is a fashion statement as much as it is a political statement. \n\nSecondly, they have taken careful steps to ensure that the photo opportunities mimic what they saw in their classrooms when they were on the civil rights chapters of classroom civics. \n\nSeriously, go back and look at a lot of those photos. They always jump through hoops to make sure they're seen posing with picket signs, or a fist up in the air, or in some \"clash\" with people. \n\nIt starts to make even more sense when you look at more footage of these events to have better context. \n\nThese people only start behaving in this way, once they realize the cameras are on them. Many of them don't even go to these \"protest\" for any reason other THAN to get in front of a camera. \n\nThey've all imagined themselves to be some social justice crusader, whom they believe will become the next middle school textbook photograph, or cover to time magazine. \n\nThey don't give two fucking shits about george floyd. Or racial whatever. \n\nThey're only out there screaming and pissing because it's an opportunity for attention. It's an opportunity to make it about them. \n\nOtherwise, why would they spend so much time and energy crafting the perfect costume for the event? It's very obvious these ones have put extensive amounts of energy into building their outfits up. \n\nAnd secondly, why else would they go to such lengths to get in front of someones camera? \n\nIt's narcissism all the way down. \n\nThis OP photo more or less confirms what I'm saying. It's an iconic historic photo where they're trying to twist it into a modern \"protest\". \n\nThese people don't even know what they're protesting or crying about. \n\nThey know Elon Musk and Orange Man bad, but they don't know why, and they don't care. All that matters is the ideology, above all else. \n\nThe ideology told them Elon is the target, so by god they're going to target him, and they're going to do it in stylish fashion and they're going to do it in such a way that they can get mileage out of it for themselves and their own image. \n\nPure, fucking unadulterated, distilled, 100% home grown narcissism. ",
                        "author": "CAPTAIN_TENDY_PLATE2",
                        "replies": [
                            {
                                "raw_content": ">It was always the women, and above all the young ones, who were the most bigoted adherents of the Party, the swallowers of slogans, the amateur spies and nosers-out of unorthodoxy.\n\n— George Orwell, 1984",
                                "author": "spezisacuckold",
                                "replies": [
                                    {
                                        "raw_content": "Absolutely visionary. And if you really think abut it, why wouldn't women be the ones?\n\nAcross all of western society, women have been held to almost zero standards, zero consequences for their actions. Or rather, when consequences DO arrive, they come wearing kids gloves. \n\nSo why wouldn't women take this opportunity to screech like harpies about emotional issues that, again, are a trait of the fairer gender?",
                                        "author": "CAPTAIN_TENDY_PLATE2"
                                    }
                                ]
                            },
                            {
                                "raw_content": "Radical Chic always appeals to the morally adrift narcissist.\r\n  -Tom Wolfe, probably.",
                                "author": "Neonentity",
                                "replies": []
                            },
                            {
                                "raw_content": "Antifa trains in how to stage \"direct action\" for the cameras, with such principles as\n* How to put the target of your protest in a damned if you do, damned if you don't situation. (If you occupy property and they let you, you win. If you get footage of the police removing you from the property, you win.)\n* How to create a sympathetic character. (Every time one of these protests happens, an archetype of a pseudo-hero emerges for the cameras, like the \"line of moms\" blocking the police from the black lives matter protesters or whatever. This is staged on purpose. They literally create a character for their story and sell it as a narrative.)\n* How to ensure that you get all the right camera angles and get your footage to the sympathetic media. (Carefully hand-picked so the media sells your narrative for you.)",
                                "author": "Amaroq64",
                                "replies": [
                                    {
                                        "raw_content": "In short, they're fake and gay. ",
                                        "author": "CAPTAIN_TENDY_PLATE2"
                                    }
                                ]
                            },
                            {
                                "raw_content": "Tl;dr- they would take effort to get the \"office worker with groceries\" look perfected, in ironic defiance of the fact that tank man was just a random office worker taking groceries home.\r\n\r\nThere was video of a \"nurse\" protesting, where he ran into a cross walk during a signal change, unfolded his sign for five seconds worth of pictures, then ran back to the curb he started from.  Their \"grassroots resistance\" is carefully crafted and staged, every time. \"Symbolic arrests\", anyone?",
                                "author": "ParticleCannon",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "raw_content": "Haha.",
                        "author": "Ordoyou",
                        "replies": []
                    },
                    {
                        "raw_content": "KEK!",
                        "author": "DemPanicAtTheDisco",
                        "replies": []
                    },
                    {
                        "raw_content": "Now, imagine if you're Chinese.",
                        "author": "BlitheringIdiot2",
                        "replies": []
                    }
                ]
            },
            {
                "raw_content": "Tank Man was taken away and never seen again.\n\nDo they really want to go down that route?",
                "author": "kippo_hard",
                "replies": [
                    {
                        "raw_content": "I hope so. I'm getting pretty sick of them.",
                        "author": "Ordoyou",
                        "replies": []
                    },
                    {
                        "raw_content": "Someone should ask them what the tanks were doing.\n\n(They were going to stop students who were protesting the exact thing Elon is uncovering and stopping).",
                        "author": "NomadicKrow2",
                        "replies": [
                            {
                                "raw_content": "They were LEAVING the Square.  It was a great propaganda photo, and the opportunity to question the tankies on WHAT they'd just done, but they'd already carried out the atrocity by that point and were leaving.",
                                "author": "AussieTrumpFan",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "raw_content": "He was also protesting communists.",
                        "author": "BarneyFrank",
                        "replies": []
                    },
                    {
                        "raw_content": "The [fake accounts](https://x.com/elonmusk/status/1893657900851278115) do!",
                        "author": "MyDadLikedBiden",
                        "replies": []
                    }
                ]
            },
            {
                "raw_content": "They know Cybertrucks have accident avoidance systems that slam on the brakes if someone is in front of it and wouldn’t be able to run them over.",
                "author": "Apersonofinterest",
                "replies": [
                    {
                        "raw_content": "Risk and consequence are the kryptonite of the left",
                        "author": "ParticleCannon",
                        "replies": [
                            {
                                "raw_content": "Also accountability ",
                                "author": "DrWeeGee",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "raw_content": "But lefties aren't people",
                        "author": "AussieTrumpFan",
                        "replies": []
                    }
                ]
            },
            {
                "raw_content": "Op is a fag for posting this with the name blurred it. We should be trolling the fuck out of these people! Weak sauce!!",
                "author": "burneraccount5000",
                "replies": [
                    {
                        "raw_content": "Probably their account. ",
                        "author": "cjcivicx",
                        "replies": [
                            {
                                "raw_content": "He wants to play both sides.  Get the sympathy upvote and the rage bait upvote. \n\nThe dopamine high from that must be amazing!  Like a speedball or something. ",
                                "author": "MoldyLocksNesMonste",
                                "replies": [
                                    {
                                        "raw_content": "I wish they'd do away with points altogether on here. I get that it's meant to push liked ideas to the top, but it's far too easy to mess with it. ",
                                        "author": "cjcivicx"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "raw_content": "Agreed. None of these crazies ought to have their usernames blurred.",
                        "author": "TickleTh1sElmo",
                        "replies": []
                    },
                    {
                        "raw_content": "9 times out of 10, these accounts that are brought to our attention are protected, ie: you can’t respond to them. Usually their already bitched up, but certainly by the time we wanna swarm in for some secondhand trolling.",
                        "author": "JDBlanch47",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "post_name": "So-called “Author” Michael Wolff’s new book is a total FAKE JOB, just like the other JUNK he wrote.",
        "score": 786,
        "url": "https://patriots.win/p/19AdbihoSR",
        "comments_count": 30,
        "posted_at": "2025-02-23 23:22:32 UTC",
        "text_content": "",
        "comments": [
            {
                "raw_content": "*Checks Michael Wolff's early life section on wikipedia*",
                "author": "wharfthrowaway",
                "replies": [
                    {
                        "raw_content": "He looks as stereotypical as you could imagine.",
                        "author": "nakedjay",
                        "replies": [
                            {
                                "raw_content": "[Heh.](https://upload.wikimedia.org/wikipedia/commons/5/5b/Michael_Wolff_-_NYC_Trump_court_trial_2024-05-28_264_(cropped).jpg)",
                                "author": "XlDEN",
                                "replies": [
                                    {
                                        "raw_content": "Oy vey",
                                        "author": "nakedjay"
                                    }
                                ]
                            },
                            {
                                "raw_content": "I kvetch your drift. ",
                                "author": "m0ntsta",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "raw_content": "They're getting better at \"sanitizing\" it. Better check the edits before those get changed, too.",
                        "author": "KekistanPM",
                        "replies": []
                    },
                    {
                        "raw_content": "i see noticing is becoming very quick thing. In earlier days he might even have been a sniveling, furiously  handrubbing Bolshevik. ",
                        "author": "Lysander_Spooner",
                        "replies": []
                    },
                    {
                        "raw_content": "_Morpheus voice_: Sometimes, you don't have to check, you just know",
                        "author": "staroframphansbhole",
                        "replies": []
                    }
                ]
            },
            {
                "raw_content": "I love that Trump is willing to punch low. And it's not even that he punches low.. the madlad just throws haymakers in every direction. No directional discretion necessary. ",
                "author": "SALTYinSeattle",
                "replies": []
            },
            {
                "raw_content": "Trump shit right in his mouth in front of the world. ",
                "author": "MAGA_____bitches",
                "replies": []
            },
            {
                "raw_content": "Anyone know the juicy lies in this one? I'd like to know the source when I start hearing things from the libtards. ",
                "author": "Pederella",
                "replies": [
                    {
                        "raw_content": "https://archive.is/IIlf9",
                        "author": "NancyCirrhosi",
                        "replies": [
                            {
                                "raw_content": "unreadable fluff",
                                "author": "zippy2",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "raw_content": "\"because here I am in the White House, refusing to take his calls.\"",
                "author": "Faintlight",
                "replies": [
                    {
                        "raw_content": "you keep on knockin but u cant come in wooooooooooooooo",
                        "author": "OG_BACONndEGGs",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "post_name": "Lmao UK police really are clowns",
        "score": 1073,
        "url": "https://patriots.win/p/19Adbigze5",
        "comments_count": 106,
        "posted_at": "2025-02-23 21:26:55 UTC",
        "text_content": "",
        "comments": [
            {
                "raw_content": "Well that's frivolous and impractical. I figure it must be a comedy skit. ",
                "author": "Celtic93",
                "replies": [
                    {
                        "raw_content": "Real police would be wearing a helmet",
                        "author": "geckogreen",
                        "replies": [
                            {
                                "raw_content": "Real police in UK are safely behind Thier desk arresting it's British patriots for criticising Labour on social media",
                                "author": "Jojobelle1000",
                                "replies": [
                                    {
                                        "raw_content": "That's more like it. They like to do high speed car chases though. ",
                                        "author": "Saxonlady"
                                    },
                                    {
                                        "raw_content": "👆🏻this. ",
                                        "author": "takumargirl"
                                    }
                                ]
                            },
                            {
                                "raw_content": "Real UK police would be wearing lipstick and nail polish. ",
                                "author": "Aut_MAGA_Aut_Nihil",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "raw_content": "Almost looks like they were going for a Monty Python kind of thing, but didn’t quite stick the landing. ",
                        "author": "YT45",
                        "replies": []
                    },
                    {
                        "raw_content": "def is cause the police officer would have arrested the people recording instead of the thief",
                        "author": "Fox_Dragon",
                        "replies": []
                    }
                ]
            },
            {
                "raw_content": "WHY THE FUCK IS THIS STICKIED?\r\n\r\n\r\nI'm so tired of this honeypot and can't wait for ROLCON to get fired as well. ",
                "author": "FuckCommies",
                "replies": [
                    {
                        "raw_content": "What are you upset about? What do you want stickied? Is there something wrong with laughing at inept cops in a land of muslims? ",
                        "author": "MixedBlacknWhite",
                        "replies": [
                            {
                                "raw_content": "Nothing wrong at all. But stickies should be for important things, non \"lel dumb UK, lol\".",
                                "author": "localhost",
                                "replies": []
                            },
                            {
                                "raw_content": "it's not funny at all. it's sad. it's depressing",
                                "author": "Fussbudget",
                                "replies": [
                                    {
                                        "raw_content": "There are 2 kinds of people on this site. MAGA, and WOKE RIGHT who incorrectly believe themselves to be MAGA.\n\nGuess which ones think this is funny?",
                                        "author": "MAGALAUGHSLAST"
                                    }
                                ]
                            },
                            {
                                "raw_content": "Did you read what he wrote? He doesn't like the poster that being highlighted. The sticky is directing views to a poster on X who's profiting off of this. There are sensationalist a-holes who make shitposting on social media their day-to-day job and many of us don't want to reward that kind of nonsense.\n\nI don't know this particular poster, but if you post anything from The Gateway Pundit or to a lesser extent Laura Loomer, you'll trigger the same response from me. I'm getting better at spotting these \"Paytriots.\"",
                                "author": "Moose_Antlers",
                                "replies": [
                                    {
                                        "raw_content": "That wasn't my point. Clearly over your head. ",
                                        "author": "FuckCommies"
                                    },
                                    {
                                        "raw_content": "It’s still funny.",
                                        "author": "SurveilThis"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "raw_content": "I'm pretty sure if we just stickied and posted what you want, this would be a pretty boring site.  Have you seen some of the boredom going on in New?  ",
                        "author": "Smurfection",
                        "replies": [
                            {
                                "raw_content": "People forget this place has always been a place to shit on retards while also being informed about current events. \n\nPeople seem to forget if they want a sanitized news experience they should just be reading from the Gateway Pundit home page instead of only lurking here.\n\nhttps://www.thegatewaypundit.com/",
                                "author": "2WOMPSlewandowski",
                                "replies": [
                                    {
                                        "raw_content": "I agree.  the funny stuff and memes and dumb comments and crazy true jokes are the whole reason to be here.  We're a forum community, not a new aggregator although we're a pretty good news aggregator too. \n\nRemember people, it's our erudite memes, frog fanatics and sides-in-orbit jokes that got Trump elected. ",
                                        "author": "Smurfection"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "raw_content": "Only certain people get their post stickied & its not any of us.  It gets old and I try to not go to the stickied page because its always the same people.   If it gets worse I'll abandon this site. ",
                        "author": "MajorClark",
                        "replies": []
                    },
                    {
                        "raw_content": "Yeah, the comments are 99% fake too.",
                        "author": "GarbagePailKid",
                        "replies": []
                    }
                ]
            },
            {
                "raw_content": "When I was scrolling through the X comments I found this much more impressive takedown by a Chinese police officer.\r\nhttps://x.com/clashreport/status/1878748250381111348",
                "author": "lothrop_evola",
                "replies": [
                    {
                        "raw_content": "I bet the policeman was like \"Finally!!! This is it!!! This is the moment I get to use my spider monkey move!!!\"",
                        "author": "KekistanPM",
                        "replies": []
                    },
                    {
                        "raw_content": "That’s a police demonstration. It’s not real life. ",
                        "author": "XlDEN",
                        "replies": [
                            {
                                "raw_content": "it's pretty impressive though.",
                                "author": "NoahGav",
                                "replies": [
                                    {
                                        "raw_content": "It really is. Those black belt guys can do some wicked shit.",
                                        "author": "XlDEN"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "raw_content": "booyaka booyaka, 619!",
                        "author": "Covidrrhea",
                        "replies": []
                    },
                    {
                        "raw_content": "I think that was a demo. Not an actual perp. ",
                        "author": "74lampshades",
                        "replies": []
                    }
                ]
            },
            {
                "raw_content": "He can’t skate for shit. Gotta bend them knees",
                "author": "analog_shitposter",
                "replies": [
                    {
                        "raw_content": "Like Trump's opponents",
                        "author": "bigdickhangsright",
                        "replies": [
                            {
                                "raw_content": "Low blow.  (Kek)",
                                "author": "Dashmoomoo",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "raw_content": "These are not serious people ",
                "author": "MAG_n_KAG",
                "replies": []
            }
        ]
    },
    {
        "post_name": "Want to see the biggest mistake ever made by the leader of a sovereign nation.",
        "score": 2075,
        "url": "https://patriots.win/p/19AdbhZyAS",
        "comments_count": 260,
        "posted_at": "2025-02-23 17:44:42 UTC",
        "text_content": "",
        "comments": [
            {
                "raw_content": "Zelenskyy is playing with fire if he thinks he is going to cross the banker class.",
                "author": "FaggotsOnRubysBUS",
                "replies": [
                    {
                        "raw_content": "umm.... got news for you buddy.  he IS in the banker class, or at least his cousins are.",
                        "author": "MAG_n_KAG",
                        "replies": [
                            {
                                "raw_content": "Zelenskyy is the first Jewish president of Ukraine; with Volodymyr Groysman as prime minister, Ukraine became the first country other than Israel to simultaneously have a Jewish head of state and head of government",
                                "author": "JuneYourMint",
                                "replies": [
                                    {
                                        "raw_content": "No wonder he is so willing to fight Russia down to the last Christian cannon fodder.",
                                        "author": "StayoutOfit"
                                    },
                                    {
                                        "raw_content": "We also have the first Jewish President of Mexico.... what's going on here? Why are Jews in everyone's country?",
                                        "author": "Ordoyou"
                                    },
                                    {
                                        "raw_content": "How many Volodymyr’s are there? Vladimir vs Volodymyr is already the dumbest Mario/Wario shit ever. ",
                                        "author": "Bushwookiee07"
                                    },
                                    {
                                        "raw_content": "Not so. The Bolsheviks accomplished this 100 years ago with Vladimir Lenin. Of course in a communist government, the head of state and head of government are the same entity. \r\n\r\nIn addition, over 80% of the original Soviet politburo was Jewish despite jews only comprising 2% of their population. The very first law they passed was making anti-semitism a capital punishment crime. This as they burned hundreds of Christian churches to the ground claiming religion to be the opiate of the masses. ",
                                        "author": "dr_gonzo"
                                    }
                                ]
                            },
                            {
                                "raw_content": "That's okay, they have their own infighting ",
                                "author": "NikolaiVsevolodovich",
                                "replies": [
                                    {
                                        "raw_content": "When they aren’t infucking ",
                                        "author": "madeaprofilejustforu"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "raw_content": "A good rule of life is don't piss off people with money. I'm not talking those people with just fuck you money either. I'm talking fuck you and your entire family, extended family, friends, and pets money.\r\n\r\nI would love for Zelensky to get turbo fucked by the elites for his bullshit. After they are done, had him over to the families whose husbands they have murdered forcing them to fight in the globohomo's war.",
                        "author": "Cmon",
                        "replies": [
                            {
                                "raw_content": "That’s where Bernie Madoff fucked up - he stole from rich people. Can’t do that, so they brought the hammer down on him. Stealing from poor people though? Totally fine and even encouraged.",
                                "author": "Slugbert",
                                "replies": [
                                    {
                                        "raw_content": "He didn’t just steal from rich people.  He stole from (((rich))) people.\n\nThat was his mistake.",
                                        "author": "Sgt_Hulka"
                                    },
                                    {
                                        "raw_content": "sadly true because they’ll never get good lawyers.. makes me think why the dems panicked and removed Cuomo as NY governor because he was about to be sued for his covid policies that killed many rich influent NY people.. they resurfaced sexual improprieties as an excuse but he was really removed because of Covid lawsuits by rich New Yorkers",
                                        "author": "snoopy3210"
                                    },
                                    {
                                        "raw_content": "The wolf of Wallstreet stole from poor people, and he got a Dicaprio movie. Big difference.",
                                        "author": "Side_o_beef_curtains"
                                    },
                                    {
                                        "raw_content": "and most of them got their money back",
                                        "author": "the-new-style"
                                    }
                                ]
                            },
                            {
                                "raw_content": "Dead man walking.   People forget, Cuba as a country still has an embargo due them taking over the banks and all the off shore money hidden in those accounts by the elite.",
                                "author": "yukondave",
                                "replies": [
                                    {
                                        "raw_content": "Good thing the interwebs means no more \"off shore money hidden\".   \n\nCould the planning for today go back before the Panama Papers ?",
                                        "author": "Standingoak"
                                    }
                                ]
                            },
                            {
                                "raw_content": "He's desperate now because if the war ends, the flow of money ends. Those controlling him know he knows stuff - they won't want him to talk. When the flow of money stops, those in control will kill Zelensky. He's literally fighting for his life now. If the war ends, he ends.",
                                "author": "conservativefrank",
                                "replies": [
                                    {
                                        "raw_content": "Those terms are acceptable. Live by the sword, die by the sword",
                                        "author": "Sparks1017"
                                    }
                                ]
                            },
                            {
                                "raw_content": "I will never forgive that scumbag when I saw that guy with mental retardation on the front lines. Zelensku can die a slow painful death",
                                "author": "Here_we_go",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "raw_content": "He's a jew and part of them you fool.  Jews run this shit. ",
                        "author": "BunnyPicnic",
                        "replies": []
                    },
                    {
                        "raw_content": "You got that right",
                        "author": "JKillen",
                        "replies": []
                    }
                ]
            },
            {
                "raw_content": "Every dumb ass politician that oked funds to this clown should have thier pay docked until they are out of office. ",
                "author": "FusionBlack",
                "replies": [
                    {
                        "raw_content": "They'd still get theirs on the back end. Their congressional pay is a pittance to their actual, ill-gotten  income sources.",
                        "author": "realsolidsnakeoil",
                        "replies": [
                            {
                                "raw_content": "Though ti we’re talking about Barry getting it in his back end ",
                                "author": "KamamblaToe",
                                "replies": [
                                    {
                                        "raw_content": "It’s tough work, I’ll be honest with you.",
                                        "author": "MikesDong"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "raw_content": "Why stop when they are out of office?  Take their pensions and file liens against everything they own!",
                        "author": "Allister",
                        "replies": [
                            {
                                "raw_content": "Exactly, put them in prison-like shackles and force them to work until the toll is paid in full. That would make them think long and hard about greenlighting theft in such abysmal magnitudes.",
                                "author": "TheMrStone",
                                "replies": []
                            },
                            {
                                "raw_content": "Yeah they need every single asset seized and given back to the citizenry. Then they can go to jail for life. ",
                                "author": "DeaduponArousal",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "raw_content": "You should be running it",
                        "author": "JKillen",
                        "replies": []
                    },
                    {
                        "raw_content": "take their assets",
                        "author": "magaspif",
                        "replies": []
                    }
                ]
            },
            {
                "raw_content": "One of the most corrupt countries in the world decided to steal our money? \n\nSurprised Pikachu face.",
                "author": "McFatty7",
                "replies": [
                    {
                        "raw_content": "I'm sure Biden told him it was a gift and not a loan. And that's a problem without solution. The money is lost. Keep the DemonRATs out of government to avoid losing more taxpayer money is the only thing left to do.",
                        "author": "Brannvesen",
                        "replies": [
                            {
                                "raw_content": "And the money is all gone. Their country is bankrupt. They have no working age males. They're going to be dependent for a generation at least. ",
                                "author": "MaxineWaters4Prez",
                                "replies": [
                                    {
                                        "raw_content": "The jewish NGOs now wants to flood Ukraine with third world trash. They're basically fucked and I don't think the Ukrainian women will return home. They stay in western Europe.",
                                        "author": "Brannvesen"
                                    }
                                ]
                            },
                            {
                                "raw_content": "Then you take it out of his ass.",
                                "author": "KernalMustard",
                                "replies": []
                            },
                            {
                                "raw_content": "It was probably written up like the PPP loans during covid",
                                "author": "AngryPoop",
                                "replies": [
                                    {
                                        "raw_content": "Doubt it, it's yet another one of Bidens fuckups, or shall I say his handlers. They see these things as investments for their own personal gains, at the taxpayers expense. In this case they didn't achieve their goal. But the money is lost.",
                                        "author": "Brannvesen"
                                    }
                                ]
                            },
                            {
                                "raw_content": "Not lost, Trump will manage to get twice what was lost in mineral rights. ",
                                "author": "BigMikesChef",
                                "replies": [
                                    {
                                        "raw_content": "How will he do that without provoking Russia? Biden and crackhead trying to extract these minerals were the reason Russia had to invade in the first place. They don't want Americans that close to their border.",
                                        "author": "Brannvesen"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "raw_content": "It’s amazing how just a short time ago that’s what was being said that country.  The only thing that changed is Dems figured out how to use that to their advantage ",
                        "author": "suckmycorona",
                        "replies": []
                    }
                ]
            },
            {
                "raw_content": "okay, now “grant” us some rare earth minerals",
                "author": "Hanging_Chad",
                "replies": [
                    {
                        "raw_content": "This is the BEST reply yet.  Loved it.",
                        "author": "patmd99",
                        "replies": []
                    },
                    {
                        "raw_content": "We don’t need anymore electric cars. Or am I mistaking this for lithium?",
                        "author": "covok48",
                        "replies": [
                            {
                                "raw_content": "Lithium is a rare earth, but there are others. I think pretty much all electronics involves various rare earths, and smartphones will keep the lithium market going unless we find a better battery tech.",
                                "author": "MapleBaconWaffles",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "raw_content": "> sovereign nation\n\n> Ukraine\n\nIs it really, though?",
                "author": "AmericanJawa",
                "replies": [
                    {
                        "raw_content": "In pretend world yes",
                        "author": "Babymaker5000",
                        "replies": [
                            {
                                "raw_content": "We live in pretend world",
                                "author": "try4gain",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "raw_content": "I hope we get to see a Ukraine drawn and quartered before this is all over.",
                        "author": "FakeHistory1",
                        "replies": []
                    },
                    {
                        "raw_content": "Suzerain nation then",
                        "author": "charliesean",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "post_name": "Remember, fam.  No sorrow.  No mercy.  ",
        "score": 1773,
        "url": "https://patriots.win/p/19AdbhaF9V",
        "comments_count": 81,
        "posted_at": "2025-02-23 18:32:22 UTC",
        "text_content": "",
        "comments": [
            {
                "raw_content": "Liberal logic: But you need to be vaxed to work from home",
                "author": "WhereMyCountryGone",
                "replies": [
                    {
                        "raw_content": "The biggest vector for coof's spread was computer screen to computer screen.",
                        "author": "IncredibleMrE1",
                        "replies": [
                            {
                                "raw_content": "Insert Bill Gates. Who profitted off both computer viruses and covid viruses ",
                                "author": "WhereMyCountryGone",
                                "replies": [
                                    {
                                        "raw_content": "Bill Gates never profited off of computer viruses.",
                                        "author": "TheMoreYouKnowOkay"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "raw_content": "Liberals also forced remote learning college students to be vaxxed.\n\nOh, and no reduction in tuition & fees for shutting down the campuses during the lockdowns.\n\nPay full price.",
                        "author": "McFatty7",
                        "replies": [
                            {
                                "raw_content": "College should just be free...professors should work for free and the janitors too",
                                "author": "WhereMyCountryGone",
                                "replies": [
                                    {
                                        "raw_content": "Exactly that's essentially what they want when they want healthcare to be \"free\".\n\nWe have a word for demanding labor from someone for free...",
                                        "author": "Jankle"
                                    },
                                    {
                                        "raw_content": "im ok with people working for money.  how about the professor charge a fee for his time and it no longer needs to be jacked up 1200% so the \"prestiege\" of the building can have their cut",
                                        "author": "bicentennial_john"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "raw_content": "They are evil people. My husband's former job had this 500 lb (no joke) karen \"nurse\" that was always threatening people into taking the clot shot. Turned out she lied about getting the shot herself.",
                        "author": "ColonelKlink",
                        "replies": [
                            {
                                "raw_content": "Dr. Death",
                                "author": "WhereMyCountryGone",
                                "replies": []
                            },
                            {
                                "raw_content": "those threats were her grifting bread and butter",
                                "author": "bicentennial_john",
                                "replies": []
                            },
                            {
                                "raw_content": ">500 lb (no joke) karen \"nurse\" \n\n She's the smart one.    \nShe's ready for the 3 year famine ( that will never happen. ).     \n&#65038;   \nImagine how many pallets of  cookies she's hidden in her house.    \n&#65038;   \n\n",
                                "author": "BallotsOnRubysUSB",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "raw_content": "Cry bullies.",
                "author": "ColonelKlink",
                "replies": [
                    {
                        "raw_content": "Man, I haven't heard that term in a long time. It's so apt for those Karens. ",
                        "author": "BigMikesSwingingCock",
                        "replies": [
                            {
                                "raw_content": "The defining characteristic of these people (broadly termed liberals/leftists) is that they can't handle what they dish out. For example, look at the sheer magnitude of the attacks on Trump - bogus criminal charges, frivolous lawsuits, obvious assassination attempts - but the Dems are SCREAMING \"oppression!!!\" when we retaliate with just 1% of what they did to us",
                                "author": "UCantStumpTheTrump",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "raw_content": "That’s why I’m enjoying every bit of this. No remorse from me.",
                "author": "TheSonOfGadsden",
                "replies": [
                    {
                        "raw_content": "Same. They wanted me fired from my job for not being vaxxed. I was discriminated against, denied service for not wearing a mask, and treated like diseased vermin. Fuck these people. Karma is a bitch.",
                        "author": "Aquamine-Amarine",
                        "replies": [
                            {
                                "raw_content": "They made my friend Amanda take the vaxx to keep her job. Her digestive system shut down, and her hair started falling out. She was in and out of the hospital the next year or so. She was a beautiful girl and just couldn't handle it anymore.\n\nRest in Heaven, Amanda. I will never forgive the snakes who did this. They should be hanging from trees.\n\n",
                                "author": "VirPopulus",
                                "replies": [
                                    {
                                        "raw_content": "Sorry for your loss. Did she die from vaccine injury or did she take her life?",
                                        "author": "BloodElfSupporter"
                                    }
                                ]
                            },
                            {
                                "raw_content": "I am glad people like us are finally getting a sense of justice, no matter how \"round about\" it might have been. It's fucking ***GLORIOUS*** watching this shit unfold. \n\nI've had an erection for at least 3 weeks straight now. ",
                                "author": "CAPTAIN_TENDY_PLATE2",
                                "replies": []
                            },
                            {
                                "raw_content": "They could have continued stealing $500Billion a year for themselves and no one would have even lifted a finger to stop them.\n\nThat wasn't enough for them though.  They wanted YOU homeless.  For that fuck every last one of them.  You lose sir, you win nothing, good day sir!",
                                "author": "USDMaga",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "raw_content": "I remember the day HR brought me in and told me I had to supply my vaccination card or start getting daily tests to come to work or get fired. I told him to nah, and I had a chat with the CEO about what was going on, and we didn't do any of that crap. I later got promoted to CFO, but holy shit, I will never forgive the Dems for jeopardizing me and my families livelihood. Never.",
                        "author": "Cemlub",
                        "replies": []
                    },
                    {
                        "raw_content": "The straight up fucking SMUGNESS they all had, as they WILLINGLY grasped onto what they believed was institutional power, that they felt they were wielding, over the non-vaxed, to PROVE to everyone how powerful and important they were by telling you that ONLY VAXXED PEOPLE ARE ALLOWED, is ***precisely*** the same smugness I will have in return, when I gleefully support every last one of them being fired. ",
                        "author": "CAPTAIN_TENDY_PLATE2",
                        "replies": []
                    }
                ]
            },
            {
                "raw_content": "They are sadistic. ",
                "author": "Saltyminer11",
                "replies": [
                    {
                        "raw_content": ".... and we love reciprocity ....",
                        "author": "julianleroux",
                        "replies": [
                            {
                                "raw_content": "We're not even close to reciprocity they wanted to take our kids and houses and throw people in jail over the vax.",
                                "author": "Jankle",
                                "replies": [
                                    {
                                        "raw_content": "We're getting closer to seeing justice",
                                        "author": "UCantStumpTheTrump"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "raw_content": "Psychos tend to be.",
                        "author": "TheGreatWhiteNorth",
                        "replies": []
                    }
                ]
            },
            {
                "raw_content": "Trump laid off probationary employees, if they had a job in 2021 they are not probationary. Fucking morons. ",
                "author": "Geralt_of_Rivia1",
                "replies": []
            }
        ]
    },
    {
        "post_name": "USAID employees getting fired.. 👀",
        "score": 1382,
        "url": "https://patriots.win/p/19AdbigRPk",
        "comments_count": 255,
        "posted_at": "2025-02-23 19:50:08 UTC",
        "text_content": "",
        "comments": [
            {
                "raw_content": "Anyone who thinks we're ever going to get along with these freaks is an idiot.   These people are our enemy ",
                "author": "ACActual",
                "replies": [
                    {
                        "raw_content": "Imagine applauding people that stole from you and gave to the rich.\n\nEdit:  FOREIGN rich. ",
                        "author": "Gadsden",
                        "replies": [
                            {
                                "raw_content": "Like those who applauded the masked \"Frontline\" medical staff jabbing the life out of people.",
                                "author": "MAGAguitar",
                                "replies": [
                                    {
                                        "raw_content": "And then dancing about it in the hallways of the hospitals.",
                                        "author": "NomadicKrow2"
                                    },
                                    {
                                        "raw_content": "Frontline medical staff weren’t the ones giving the jab.",
                                        "author": "Wehavelawsforareason"
                                    }
                                ]
                            },
                            {
                                "raw_content": "Guaranteed that 95% of the people didn't know about USAID was before this was all exposed. It's literally just \"support the liberal cause/support whatever Trump is against\" ",
                                "author": "Obamas_Goatse_Party",
                                "replies": [
                                    {
                                        "raw_content": "They all think it's US - AID. But no. It's USA - ID  aka the United States AGENCY for INTERNATIONAL DEVELOPMENT. The clever PR faggots who came up with USAID earned their bonus with this doublespeak title. Now 90% easily duped women and other assorted retards just think it's some kind of AID organization that helps the world.  They won't even bother to do the 10 second search required to read the real title.  \n\nAnd what is international development? Oh you know shit like color revolutions, regime change, or just funding a bunch of universities with officers earning 7 figure salaries like Stanford. ",
                                        "author": "retry"
                                    },
                                    {
                                        "raw_content": "I only knew about some of the fraud thanks to Glenn Beck lesson with his obligatory chalk board lessons over the years.",
                                        "author": "BidenShowerDrool"
                                    },
                                    {
                                        "raw_content": "It's called \"The current thing\" as in, \"I support *the current thing*\" and USAID is just today's iteration after Ukraine, LGBT, etc. ",
                                        "author": "RolandDelacroix"
                                    }
                                ]
                            },
                            {
                                "raw_content": "GIVE MY WIFE BACK HER CAREER PATH SHE WAS FIRED FROM AFTER SIX MONTHS OF PUBLIC MARXIST STRUGGLE SESSIONS.\r\n\r\nGive her back the two years of depression she got from being fired just months after receiving two awards for her performance.\r\n\r\nNever mind.  Burn their whole Macavellian structure down.\r\n\r\nShe's a stay-at-home mother tending to livestock now, and being supported by me, and has never been happier.",
                                "author": "Friendly_B",
                                "replies": [
                                    {
                                        "raw_content": ">SIX MONTHS OF PUBLIC MARXIST STRUGGLE SESSIONS.\n\nWhoa what happened ",
                                        "author": "DrVSGGEOTUSPhD"
                                    }
                                ]
                            },
                            {
                                "raw_content": "These are the cat ladies JD was talking about.",
                                "author": "Wallllllllllllllllll",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "raw_content": "Funny how every single one of them looked exactly like what I imagine a deep state government bureaucrat prick to look like.\r\n\r\n(Soy boys, lesbians, and mother hens [think English teacher shoveling commie propaganda into their student's heads]...the only one missing is the ghetto DEI hire)",
                        "author": "ConvergenceMan",
                        "replies": [
                            {
                                "raw_content": "fat gay guys and childless cat ladies. Yeah what a fun bunch. I bet a lot of brain power was being utilized in the building. ",
                                "author": "Trump4Infinity",
                                "replies": [
                                    {
                                        "raw_content": "What, we should expect the 1 HP engine to output 1HP.  It's doing it's job after all....  as pointless as that may be.",
                                        "author": "Aoikaze2000"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "raw_content": "It's nice their family members should up with signs! 😁",
                        "author": "imnotdeadyet",
                        "replies": []
                    },
                    {
                        "raw_content": "The masks. LOL!!!",
                        "author": "HRpumpanddump",
                        "replies": [
                            {
                                "raw_content": "First thing I noticed. Anyone still wearing that shit is either a criminal, an idiot, or both. ",
                                "author": "TruthyBrat",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "raw_content": "I too clapped and cheered as they were fired.   ",
                "author": "JBlaze056",
                "replies": [
                    {
                        "raw_content": "We should organize a TikTok COVID Nurse Dance for them",
                        "author": "ParticleCannon",
                        "replies": [
                            {
                                "raw_content": "Kek!! Yes ",
                                "author": "Chelsmobetta",
                                "replies": []
                            },
                            {
                                "raw_content": "Dancing to celebrate USAID firings when you should be working is all-time irony.",
                                "author": "bigdickhangsright",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "raw_content": "Trump bringing the Unity",
                        "author": "julianleroux",
                        "replies": []
                    },
                    {
                        "raw_content": "That 'lady' at the 0:16 mark look just like the one in the banner on the [We The Builders](https://www.wethebuilders.org/) website",
                        "author": "McFatty7",
                        "replies": []
                    },
                    {
                        "raw_content": "Wrll thats one thing we have in common!",
                        "author": "Saltyminer11",
                        "replies": []
                    }
                ]
            },
            {
                "raw_content": "I'm 54. I've been fired/layed off 5 times since 18. .  Just get another fucking job. ",
                "author": "MAGA_____bitches",
                "replies": [
                    {
                        "raw_content": "It's different when it happens to liberals. Like \"Superstorm\" Sandy. ",
                        "author": "RonPaulWasRight",
                        "replies": [
                            {
                                "raw_content": "Hurricane Sandy was fucking huge.\n\nhttps://www.click2houston.com/weather/2012/10/31/hurricane-sandy-dwarfed-other-notable-hurricanes-in-recent-years/",
                                "author": "ADAM_SCHITT",
                                "replies": [
                                    {
                                        "raw_content": "Because when shit happens to them its always more important than everyone else’s.  I have been through 5 major hurricanes  and we are forgotten about as fast as the storm leaves.",
                                        "author": "lostremote-"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "raw_content": "Unlike you, these people have absolutely zero skills, knowledge, or experience that is relevant or useful to society.  Suckling the taxpayer teat is the only thing they know and they are completely helpless now that the rug was pulled from their grift.  Fortunately for them, the world still needs ditchdiggers.",
                        "author": "KMacsBinder",
                        "replies": [
                            {
                                "raw_content": "No chance they will pick up a shovel and do real work after this. They will milk their unemployment until someone gives them another cushy desk job where they can get paid to do nothing.",
                                "author": "PDWUsername",
                                "replies": []
                            },
                            {
                                "raw_content": "Shovel ready jobs\r\n",
                                "author": "XLNutts",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "raw_content": "I came here to post this . In my 40’s and I job hop intentionally every 3-5 years mainly from boredom. These people act like a job is their identity or part of their family, they get so emotional and attached to it. It’s bizarre ",
                        "author": "Pubacabra",
                        "replies": [
                            {
                                "raw_content": "THIS\n\nPost of the thread",
                                "author": "mav7579",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "raw_content": "It wasn't a job as you and I think of the word. Trust me they won't fit in anywhere else without learning to sit down shut up and work.",
                        "author": "Trump4Infinity",
                        "replies": []
                    }
                ]
            },
            {
                "raw_content": "Thieves.",
                "author": "ColonelKlink",
                "replies": []
            },
            {
                "raw_content": "A heartwarming video that could only warm my heart more if it were a steady stream of thousands ",
                "author": "Jalapeno_gringo",
                "replies": []
            }
        ]
    },
    {
        "post_name": "I can't stand this guy! I hope he is in store for another dissapointment. Lets give 30 days then silence him once and for all when he is wrong again!",
        "score": 1029,
        "url": "https://patriots.win/p/19Adbigze4",
        "comments_count": 152,
        "posted_at": "2025-02-23 21:26:33 UTC",
        "text_content": "",
        "comments": [
            {
                "raw_content": "Please do sit back and do absolutely nothing. I have no complaints about that. ",
                "author": "HiimHillaryClinton",
                "replies": [
                    {
                        "raw_content": "It makes me think he's secretly working *with* Trump on this.\n\nOr he's completely out of touch.",
                        "author": "TGNX",
                        "replies": [
                            {
                                "raw_content": "He is completely out of touch because this was the guy convinced that come all it would be president and he said so publicly on more than one occasion and right at the end as well, despite the ample evidence that was not true.\n\nOne thing that Democrats use the sky for is fundraising. He goes out there and says everything‘s going to be fine so that they can continue to raise funds. His interviews are all about the money. And I think he does it to stay relevant in his retirement years",
                                "author": "Kek_The_World",
                                "replies": [
                                    {
                                        "raw_content": "I don't believe the sky is a dem.",
                                        "author": "BigMikesChef"
                                    },
                                    {
                                        "raw_content": "It’s like he’s wishing it to happen. He’s delusional.",
                                        "author": "SomecatsareMAGA"
                                    }
                                ]
                            },
                            {
                                "raw_content": "This chick and Paul Krugman both claim imminent collapse every time a Democrat is out of power. According to them humanity was toast 25 years ago when we refused to enact ecological communism in 1989. ",
                                "author": "bangbus",
                                "replies": []
                            },
                            {
                                "raw_content": "He's a Clinton guy. They're gonna try something",
                                "author": "Side_o_beef_curtains",
                                "replies": [
                                    {
                                        "raw_content": "He knows where all of the Democrat bodies are buried.",
                                        "author": "golinveaux"
                                    }
                                ]
                            },
                            {
                                "raw_content": "His wife  changed party registration to Libertarian once Trump got elected so it is probably a big stretch. Who knows what these dinosaurs might pull as their final trick.\n\nhttps://en.wikipedia.org/wiki/Mary_Matalin",
                                "author": "f00k_me",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "raw_content": "I think he's on target with that one. The Democrats are looking like clowns showing up to grandstand and disrupt while real work is getting done. They are only appeasing their most rabid base who are lighting up their phones right now. \n\nAlso, there is a window--I don't know if it's as short as 6 weeks--during which Trump needs to show improvements on the economy. The DOGE check could help things a lot because reduced deficits and reduced national debt aren't a tangible for most of us. This is really a genius idea. But pretty quickly the leftist talking heads are going to start hammering on the idea that he is losing support because he hasn't lowered inflation, improved unemployment, etc. I'm sure he has this in mind and is planning for it. But we should be prepared to be hearing this non-stop. ",
                        "author": "redgreenyellowblu",
                        "replies": []
                    }
                ]
            },
            {
                "raw_content": "Imagine being as retarded as James Carville",
                "author": "Trumpwonbidencheated",
                "replies": [
                    {
                        "raw_content": "Like Steven King and Mark Hamil. These morons aren't even getting USAID. They are just full blown retarded. ",
                        "author": "DontDoxMeBro1",
                        "replies": [
                            {
                                "raw_content": "Steven King, Mark Hamill and Robert DeNiro. The 3 stooges.",
                                "author": "snoozeflu",
                                "replies": [
                                    {
                                        "raw_content": "Cher, Madonna, and Ashley Judd?",
                                        "author": "Hawksendoom"
                                    }
                                ]
                            },
                            {
                                "raw_content": "Retarded. Yes. That, kek.",
                                "author": "SeikoPsycho",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "raw_content": "That’s an insult to retards ",
                        "author": "DJTLandSlide2020",
                        "replies": []
                    },
                    {
                        "raw_content": "He's actually one of the more grounded liberal advisors out there. But that's not saying much.",
                        "author": "AlphaMan",
                        "replies": []
                    },
                    {
                        "raw_content": "There has been some transformation of this guys mental faculties.  The Vaxx is destroying his brain",
                        "author": "45isthebomb",
                        "replies": []
                    }
                ]
            },
            {
                "raw_content": "Bro is gaslighting knowing damn ell the democrat party is in absolute shambles ",
                "author": "Deltamyass",
                "replies": [
                    {
                        "raw_content": "Is he on that USAID?",
                        "author": "DontDoxMeBro1",
                        "replies": []
                    },
                    {
                        "raw_content": "THIS.\r\n\r\nFunny thing is, Carville is one of the MAIN reasons for them being in absolute shambles.\r\n\r\nHe's a major fraud himself so he can't imagine anything working without fraud and deceit.",
                        "author": "TruthWillOut",
                        "replies": []
                    }
                ]
            },
            {
                "raw_content": "Honestly I think someone is paying Carville to spew hopium to lost Dems so they will calm down, not harm themselves or others, not commit acts of violence or vandalism. \n\nThis hidden hand is betting that as disclosure occurs, more Dems will take the red pill, wake up from the matrix, and start coming to terms with their cultish dogmatism and blind knee jerk herd behavior.",
                "author": "CleanUpPhillyTrump24",
                "replies": [
                    {
                        "raw_content": "Carville is often right about when they’re losing, and why.\n\nAnd then when it’s all over, hes back on the air pretending they didn’t just fuck up in every single manner he was describing weeks or months ago.",
                        "author": "ELGSES",
                        "replies": []
                    }
                ]
            },
            {
                "raw_content": "It's funny because as delusional as his take about the admin is, he's right about the Dems being their own worst enemy and never knowing when to shut up.",
                "author": "IncredibleMrE1",
                "replies": [
                    {
                        "raw_content": "He needs to take his own advice then. This dude has been saying stupid shit for as long as I can remember. He's one of the reasons back in high school in 2002 or so, I said I never wanna be like that guy or share his line of political thought. The guy is a lunatic. Look back at his Islamic pandering talks and how the US should bend the knee. ",
                        "author": "VoteMAGA",
                        "replies": []
                    },
                    {
                        "raw_content": "It's more garbage-in garbage-out than delusion.\n\nHe's old-school from back when we had exit polls and so the national polls actually tried to be accurate.\n\nSo he's trusting the polls, not realizing that the ones showing 39% support are fake poll.",
                        "author": "fauxgnaws",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "post_name": "Federal Employees",
        "score": 538,
        "url": "https://patriots.win/p/19AdbiiMMA",
        "comments_count": 17,
        "posted_at": "2025-02-24 00:51:09 UTC",
        "text_content": "",
        "comments": [
            {
                "raw_content": "c/FatPeopleHate",
                "author": "uxername27",
                "replies": [
                    {
                        "raw_content": "There are communities!?!?!?",
                        "author": "honestonions",
                        "replies": [
                            {
                                "raw_content": "Yes.  I frequently almost repost to the cat one when I'm on the shitter.",
                                "author": "HelluvaEngineer",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "raw_content": "I don’t see waist",
                "author": "Hanging_Chad",
                "replies": [
                    {
                        "raw_content": "And he hasn't seen his pecker in a long time.",
                        "author": "cwo5al",
                        "replies": []
                    },
                    {
                        "raw_content": "Shit that's funny",
                        "author": "Chachiex",
                        "replies": []
                    }
                ]
            },
            {
                "raw_content": "JB Pritzker is getting mighty stout lately. ",
                "author": "MythArcana",
                "replies": []
            },
            {
                "raw_content": "Unless it's the FBI.\r\n\r\nThey can ignore DOGE.",
                "author": "airborne3502",
                "replies": [
                    {
                        "raw_content": "Least corrupt government agency",
                        "author": "ArchRespawnsAgain",
                        "replies": []
                    }
                ]
            },
            {
                "raw_content": "Is that an actual person or an AI thingy?",
                "author": "cwo5al",
                "replies": [
                    {
                        "raw_content": "It's an AI picture of Chris Christie after fasting for a year.",
                        "author": "dc53dc53",
                        "replies": [
                            {
                                "raw_content": "\"Yarr, Thats no man. That be an eating machine.\"",
                                "author": "SpellingContable",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "post_name": "Gretchen Whitmer Under Fire for Paying Cabinet Members Sweet Bonuses in 2024",
        "score": 1255,
        "url": "https://patriots.win/p/19AdbigRXv",
        "comments_count": 59,
        "posted_at": "2025-02-23 19:56:14 UTC",
        "text_content": "",
        "comments": [
            {
                "raw_content": "How much did she pay the fbi agents to plot to kidnap her? ",
                "author": "NikolaiVsevolodovich",
                "replies": [
                    {
                        "raw_content": "Probably zero. That was probably USAIDS money. ",
                        "author": "BurtMcGirt",
                        "replies": [
                            {
                                "raw_content": "You mean MY money",
                                "author": "ParticleCannon",
                                "replies": [
                                    {
                                        "raw_content": "why did you pay them, patriot",
                                        "author": "NomadicKrow2"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "raw_content": "She ain't called Stretchin' Gretchin for nothin'!",
                        "author": "RabidZoo2",
                        "replies": [
                            {
                                "raw_content": "",
                                "author": "",
                                "replies": []
                            },
                            {
                                "raw_content": "Asshole whistles while she walks. ",
                                "author": "ChuckBrown",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "raw_content": "She is one of the worst people in the world.",
                "author": "MAGA_____bitches",
                "replies": [
                    {
                        "raw_content": "... If only Tudor dixon had been electable ...",
                        "author": "kwakkles",
                        "replies": [
                            {
                                "raw_content": "Women need to be banned from government there. Women captured the government and will only allow in more women with crazy/naughty eyes in to replace them.",
                                "author": "posedgeclk",
                                "replies": [
                                    {
                                        "raw_content": "Yep, and the more people that wake up the sooner that can get fixed also.",
                                        "author": "Sideiron"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "raw_content": "Hope she gets run over.",
                        "author": "ecto_coolest",
                        "replies": []
                    }
                ]
            },
            {
                "raw_content": "What a bishwhoarkhoont!",
                "author": "SeikoPsycho",
                "replies": [
                    {
                        "raw_content": "Is that Navajo?",
                        "author": "bigdickhangsright",
                        "replies": []
                    }
                ]
            },
            {
                "raw_content": "We need intervention, Our state Censured her and her crony AG and SOS refused to accept the legal signatures. \r\n\r\nEven the pinkos in this state loathe her, and she just lost the cannabis vote that \"placed\" her there by trying to push an additional 35% tax \"to fix the roads\"... the same platform she bamboozled the morons with in 2018.\r\n\r\nShe is the heiress of Blue Cross Blue Shield and a complete demon. I didn't think I could ever find anyone as vile as Hillary, and this witch including her coven has her beaten in spades. \r\n\r\nThey need to get her cuffed-up, because I bet anything they run her in 28. She's evil but sharp tongued. Not stupid by a long shot. \r\n\r\nAs an orthodox christian that gardens and fishes the great lakes, she angers me to my core. The \"eucharist\" stunt still makes me dream of a second crusade. ",
                "author": "FuckCommies",
                "replies": [
                    {
                        "raw_content": "We had a $3B budget surplus just a few years ago and now she tries to ram through a huge tax hike as they're about to shut down and redo 696 for some reason. Even Granholm managed to do a couple good things while she was busy fucking up the state; not little anal Annie.",
                        "author": "killedmytv",
                        "replies": [
                            {
                                "raw_content": "haha. thats a new one, I'm using it because Stretched Gretch on the Booger Sugar is a few years old. ",
                                "author": "FuckCommies",
                                "replies": [
                                    {
                                        "raw_content": "\"Little anal Annie\" was from her days at state when she'd let five guys from the team run train on her at a sparty party, then have daddy get her out of trouble/pay for an abortion. It amazes me how trashy girls from rich families can be.",
                                        "author": "killedmytv"
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "raw_content": "Someone really needs to investigate Michigan’s “controlled” top 3 Commies. With the Gov, AG, and SOS all crooked there is no one able to investigate or press charges against them. 😡",
                "author": "MIpon2",
                "replies": [
                    {
                        "raw_content": "They’re probably going the way of the Illinois politburo. Basically everyone senior who wasn’t a billionaire has wound up with a federal indictment. This crew has to be near the top of the investigative list. ",
                        "author": "bangbus",
                        "replies": []
                    },
                    {
                        "raw_content": "&#65038;   \nWhat?    \nthe same politicians who had approximately 340,000 PHANTOM registered voters in 2020 on Michigan's voter rolls?       \nhttps://patriots.win/p/11RNodc2GC/340000-phantom-registered-voters/c    \n&#65038;   \n&#65038;   \n# EDIT:    10 downvotes    \nby my Deep State/DNC PDW Stalker's Bots --- WTF? Are my tax $ going to Ukraine/Israel/India to censor my FREE SPEECH? &#65038;   \n&#65038;   \n\n",
                        "author": "BallotsOnRubysUSB",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "post_name": "The way witchcraft works. You just lie and everyone believes it. Makes it real in the minds of the believers.",
        "score": 673,
        "url": "https://patriots.win/p/19AdbihoOO",
        "comments_count": 41,
        "posted_at": "2025-02-23 23:19:12 UTC",
        "text_content": "",
        "comments": [
            {
                "raw_content": "yep....all their power relies on people believing them...they are human placebos ",
                "author": "Gunmolester",
                "replies": [
                    {
                        "raw_content": "how many movies have we watched where if you stop believing in the government it stop existing.\r\n\r\nI mean santa.",
                        "author": "AmericanBrave",
                        "replies": [
                            {
                                "raw_content": "I think it was the fairy in that British [pedo](https://www.dailymail.co.uk/news/article-1032076/The-monster-Neverland-How-JM-Barrie-did-Peter-Pan-stole-couples-children.html)’s story?\n\nno, the other pedo, wait, how many are there, oh shit holy fuck",
                                "author": "MyDadLikedBiden",
                                "replies": [
                                    {
                                        "raw_content": "Mark Twain famously said that it is easier to continue lying to people rather than to make them believe they have been lied to.",
                                        "author": "InternetSolutions"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "raw_content": "BUT BUT BUT WE DESTROYED THEIR GDP. \n\nMeanwhile the only metric that counts is how many artillery shells you can roll out. \n\nOur “elites” are fucking retarded and coasting off the wealth of the greatest generation and have absolutely squandered it. \n\nIt’s fucking retarded that Russia, with a population of like 130 million is a peer force to the EU who has 700 million plus. ",
                        "author": "Viewer01",
                        "replies": [
                            {
                                "raw_content": "Most liberal women and women professors are witches. ",
                                "author": "Stolen",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "raw_content": "What also floats?",
                        "author": "HelluvaEngineer",
                        "replies": [
                            {
                                "raw_content": "A duck!",
                                "author": "Kraken_V_Algorithm",
                                "replies": []
                            },
                            {
                                "raw_content": "Small rocks? ",
                                "author": "newuser8",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "raw_content": "Satan is the father of lies after all",
                        "author": "PM-Melania-feet-pics",
                        "replies": []
                    }
                ]
            },
            {
                "raw_content": "Tell a lie long enough and some people will believe.",
                "author": "LegXIII",
                "replies": [
                    {
                        "raw_content": "The illusory truth effect (also known as the illusion of truth effect) is the tendency to believe false information to be correct after repeated exposure.",
                        "author": "TrumpAndGodWin",
                        "replies": [
                            {
                                "raw_content": "No it's not 😜🤪",
                                "author": "Jankle",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "raw_content": "\"There are five lights\"\n\n\"We've always been at war with Eastasia\"\n\n\"Two weeks to stop the spread\"\n\n\"Russian Collusion\"\n\n\"The USS Liberty incident was an accident\"\n\nAnd other such classics.",
                        "author": "Jankle",
                        "replies": [
                            {
                                "raw_content": "Five lights?",
                                "author": "SqRt7744",
                                "replies": [
                                    {
                                        "raw_content": "It's a reference to a *Star Trek* episode which is referencing Orwell's *1984*, in which Picards captor is showing him four lights and asking him to say how many he sees (in 1984, it's holding up fingers). When he says \"four\", he is shocked and told \"no, there are five.\" This is repeated, essentially trying to break his mind into believing what not what his own mind knows is real, but instead what his captor says is real.\n\nMuch like the other examples I gave, in which they repeated lies so much not because they thought it was the truth, but because they wanted us to *agree* with their falsehood.",
                                        "author": "Jankle"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "raw_content": "Pretty much all my in-laws, for the record.",
                        "author": "HelluvaEngineer",
                        "replies": []
                    },
                    {
                        "raw_content": "Klobitchar appears to believe it based on the other post.",
                        "author": "Forgototherpassword",
                        "replies": []
                    }
                ]
            },
            {
                "raw_content": "Europe still suffers from the woke mind virus and the Russia, Russia, Russia retardation.\r\n\r\nThe world is laughing at them and they don't even realize it.",
                "author": "I-am-Orlando",
                "replies": [
                    {
                        "raw_content": "&#65038;   \nA show I listen to, the Getty & Armstrong Show, pretty funny and entertaining, anti-communist, is still even now on the anti-Russian tirade.     Must be being fed some $ from someone.   I'll still listen but ignore this message they're spewing.   \n&#65038;   \n",
                        "author": "BallotsOnRubysUSB",
                        "replies": []
                    }
                ]
            },
            {
                "raw_content": "The Great Deceiver would be so proud",
                "author": "UncleTedsWoodshop",
                "replies": []
            },
            {
                "raw_content": "What a horrible site. Non stop ads. ",
                "author": "Whatinthehell3",
                "replies": [
                    {
                        "raw_content": "OP posts a lot of clickbait garbage and spam sites. ",
                        "author": "AsaNisiMAGA",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "post_name": "Wayans family, Kamala Harris honored at NAACP Image Awards",
        "score": 906,
        "url": "https://patriots.win/p/19AdbihGE9",
        "comments_count": 64,
        "posted_at": "2025-02-23 21:37:15 UTC",
        "text_content": "",
        "comments": [
            {
                "raw_content": "Kamala Harris certainly has existed on this planet and breathed air. Might as well hand her a Nobel prize.",
                "author": "MinnieWhittaker",
                "replies": [
                    {
                        "raw_content": "Obama got a Nobel peace prize for being black (and droning a bunch of kids in the Middle East) so anything is possible!",
                        "author": "Filo76",
                        "replies": []
                    },
                    {
                        "raw_content": "She also talked about talking about the significance of the passage of time. That's important.",
                        "author": "rae-lynngivens",
                        "replies": [
                            {
                                "raw_content": "Just like Stephen Hawking.",
                                "author": "XlDEN",
                                "replies": [
                                    {
                                        "raw_content": "How dare you compare that idiot to the great Kamala?",
                                        "author": "Gunmolester"
                                    },
                                    {
                                        "raw_content": "He went to Epstein Island",
                                        "author": "Hawksendoom"
                                    }
                                ]
                            },
                            {
                                "raw_content": "reptilians like her and zuckerberg are hard to understand.",
                                "author": "DeportThemAllForever",
                                "replies": []
                            },
                            {
                                "raw_content": "",
                                "author": "SeikoPsycho",
                                "replies": [
                                    {
                                        "raw_content": "Your account is literally just two hours old. What the fuck do you know?\n\n",
                                        "author": "rae-lynngivens"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "raw_content": "I have too. Where’s my prize?",
                        "author": "LogicCircuits",
                        "replies": []
                    },
                    {
                        "raw_content": "Kek",
                        "author": "SeikoPsycho",
                        "replies": [
                            {
                                "raw_content": "I laughed out loud on this one!",
                                "author": "imnotdeadyet",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "raw_content": "No one cared about this stuff before, but now people are hyper aware how they try to create unearned power by taking over these organizations and doling out awards to each other. This is just Tuesday as far as I'm concerned, this isn't 2014 anymore. ",
                "author": "terribletwos",
                "replies": []
            },
            {
                "raw_content": "Harris isn't even black. And she also didn't do anything, she didn't even win her own party's primary. Why would she get a black award?",
                "author": "duckduck",
                "replies": [
                    {
                        "raw_content": "She's not White. That's all they care about ",
                        "author": "rebuildingMyself",
                        "replies": []
                    }
                ]
            },
            {
                "raw_content": "I miss when the Wayans brothers did shit like Handy Man and Don't Be A Menace To South Central While Drinking Your Juice In The Hood. Now they're just more house negroes bending the knee to keep their money and fame lol. ",
                "author": "cjcivicx",
                "replies": [
                    {
                        "raw_content": "In living color would have been cancelled. \r\nhttps://youtu.be/j_BzOkDJhPk",
                        "author": "IvIA6A",
                        "replies": []
                    },
                    {
                        "raw_content": "This movie would be so cancelled nowadays.",
                        "author": "Vanny1776",
                        "replies": [
                            {
                                "raw_content": "100%. In Living Color would have never gotten the go ahead either. ",
                                "author": "cjcivicx",
                                "replies": [
                                    {
                                        "raw_content": "The great thing about that show is they took shots at everyone. They didn't give a fuck.\n\nAnd those were the based Fox early days, when their programming had all the \"right\" people looking for their fainting couches. ",
                                        "author": "rambler045"
                                    },
                                    {
                                        "raw_content": "GloboHomey don't play that!",
                                        "author": "ItsFunToSay-M-A-G-A"
                                    }
                                ]
                            },
                            {
                                "raw_content": "That scene where all the white girls are singing along dropping hard Rs gets me every time ",
                                "author": "f_bastiat",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "raw_content": "Lol... That's funny shit.",
                "author": "loooooof",
                "replies": [
                    {
                        "raw_content": "100% agree",
                        "author": "SeikoPsycho",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "post_name": "The unhinged reaction is proof the culture of the federal government workforce is rotten and needs dramatic transformation, not incremental change.",
        "score": 1968,
        "url": "https://patriots.win/p/19AdbhZhJp",
        "comments_count": 163,
        "posted_at": "2025-02-23 17:12:43 UTC",
        "text_content": "",
        "comments": [
            {
                "raw_content": "I had a manager that demanded this of us on a WEEKLY basis. Many complained about it but at the end of the year it was extreamly easy to populate our review documents.\r\n\r\nThe left wants compensation without merit, which is why they HATE these sort of things. It's peak retardedness because those it only HELPS them.",
                "author": "RuprechtThaMonkeyBoy",
                "replies": [
                    {
                        "raw_content": "Leftists DEI ensures leftism in management based on not being white.\nWhich would usually move up based on skill and accomplishments...\n\n100%.",
                        "author": "DudeOfMood",
                        "replies": [
                            {
                                "raw_content": "Looks like someone was mad you noticed the ongoing White genocide. Who would down doot this comment?",
                                "author": "Wexit-Delecto",
                                "replies": []
                            },
                            {
                                "raw_content": "Clearly enough planes haven't crashed upside down yet, nor have enough cities burned to the ground.",
                                "author": "ConvergenceMan",
                                "replies": [
                                    {
                                        "raw_content": "It wasn't a high speed wreck and it didn't kill. everyone onboard.  It was in fact, just low a speed parking accident most passengers were able to walk away from.\n\nAnd the helicopter thing.  Yeah she got rear ended, so totally not her fault.  Even if she did position herself perfectly to get clobbered.\n\nIt's not about the fuckups and crashes.  Destroyed equipment or lives put at risk.  Its about liability.  Women are cheap to insure because it's never their fault.  And on the rare occasion when they do get credit, its because it was only a fender bender. ",
                                        "author": "Jimmyprawns"
                                    }
                                ]
                            },
                            {
                                "raw_content": "DemoFags are lazy fucks, true.\n\nThat is why those retards only moved one state over when their blue shitholes were locked down for Wuhan Flu.\n\nThe firings that are going to come will be highly illuminating - most of this shit is outright fraud like DOGE suspects.",
                                "author": "FrmrAmericanRepublic",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "raw_content": "Look at the articles posted and the comments in MSM.\r\n\r\nThey are using the word \"cruel\" to describe an expectation of an email listing 5 accomplishments from the last week.\r\n\r\n**CRUEL**\r\n\r\n\"Won't someone think of the poor veterans who put on a second uniform to serve in the civil service?  Republicans don't care about veterans!\"\r\n\r\nNo one is entitled to a job.  Your weaselly word tricks aren't gonna work this time, you slime buckets.",
                        "author": "ConvergenceMan",
                        "replies": [
                            {
                                "raw_content": "Everyone that put on a uniform calls themselves a veteran. It's a grift.",
                                "author": "flashersenpai",
                                "replies": []
                            },
                            {
                                "raw_content": "Lazy shaming is unforgivable.",
                                "author": "Jimmyprawns",
                                "replies": []
                            },
                            {
                                "raw_content": "Imagine if someone forced them to get an experimental vaccine....",
                                "author": "business_narwhall",
                                "replies": []
                            },
                            {
                                "raw_content": "If it's cruel to provide proof of work then you probably are not doing any.",
                                "author": "StayoutOfit",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "raw_content": "I am in the design industry and I have to fill out daily timesheets with brief explanations of my work. Because our industry typically bills by the hour, we have to be able to justify the hours billed. I like being able to see all of the things I’ve accomplished. ",
                        "author": "TNgirl4Trump",
                        "replies": [
                            {
                                "raw_content": "I haven’t billed hourly in years but I still keep the practice I learned of journaling my work and how I spent my time. It’s a hugely fvaluable tool even when not mandated and I’m thankful I was forced to learn it. ",
                                "author": "Elencher",
                                "replies": []
                            },
                            {
                                "raw_content": "Similar thing at the accounting firm I work at, although it's more basic where you are just logging how long you spent on certain clients and the broad category of work, but it's also used as a way to judge your productivity when managers look at how much of your time is billable and also how long you spend on certain projects. We're not even the level of asking for quality work from the government though, but literally just 'did you do *any* work?'",
                                "author": "JoyousMischief",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "raw_content": "I agree. \n\nThough I would appreciate if doge would stop doing this stuff on the weekend. I'm tired of getting messages from management and scared coworkers on my time off.\n\nOn that point, it's not actually 48 hours notice if people are doing ad they're supposed to and not working off the clock. ",
                        "author": "Gadsden",
                        "replies": [
                            {
                                "raw_content": "Lol. My work chat blew up again this weekend. Tired of people having breakdowns and crying meetings.",
                                "author": "gravenspine",
                                "replies": [
                                    {
                                        "raw_content": "It's annoying. Even some of my coworkers that voted Trump are crying about it.\n\nMe and the other super Maga guy just sit quietly during the meetings then have a good guffaw over it afterward. ",
                                        "author": "Gadsden"
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "raw_content": "god damn the left is so retarded.\n\nYes it's about cutting the waste for sure. But do they not see the optics of this at all. Average American is going to be like of course my boss wants to know what I did for the week, part of the job. 1 on 1's etc. team meetings. If you are in tech, it's our daily scrum mtg.\n\nSo you are really going to get zero from Americans left right and center when we all give progress reports and also we the Tax payers are paying for this  - we are the fucking boss.",
                "author": "politifox",
                "replies": [
                    {
                        "raw_content": "The thing is I would be mad about this at my job because its so obvious that things at my job are rolling along beautifully. If the board I work for demanded this if we were losing money, failing in every measurable way I would expect nothing less and actually be glad for it. It could be you are doing everything right but some external factor is causing you to fail. But we all know - in most cases - the federal work force is not productive in any way.",
                        "author": "Fren_Request",
                        "replies": []
                    }
                ]
            },
            {
                "raw_content": "It would be hilarious if Trump sent his in first. How the heck would he choose just five?",
                "author": "Framus",
                "replies": [
                    {
                        "raw_content": "That would be epic!\r\n\r\nIt's actually a brilliant idea. Government is by and for the people and transparency and accountability need to spread like a wildfire from the top down to municipal levels.",
                        "author": "RuprechtThaMonkeyBoy",
                        "replies": []
                    },
                    {
                        "raw_content": "Where I work,  all employees submit a weekly report, including the CEO.   It helps reduce unnecessary meetings. ",
                        "author": "Watermelons",
                        "replies": [
                            {
                                "raw_content": "Seriously this one thing can save multiple hours of time for several people every week",
                                "author": "jsphere256",
                                "replies": []
                            },
                            {
                                "raw_content": "Do you submit weekly reports to a company you don't work for? Because that's the equivalent of OPM demanding a service from, say, DoE. ",
                                "author": "alex_coopersmith",
                                "replies": []
                            },
                            {
                                "raw_content": "I work in the food production industry and everyday at the end of our shift we have to record our production numbers, our rejected product numbers, and what products we ran. \n\n\n\n\n\n",
                                "author": "OG_BACONndEGGs",
                                "replies": [
                                    {
                                        "raw_content": "What exactly do ya do O great one?",
                                        "author": "FaggotsOnRubysBUS"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "raw_content": "This week your favorite President did the following:\r\n\r\n1. Confirmed outstanding candidates for many positions including HHS Secretary and FBI Director\r\n\r\n2. Put Zelensky over the knee\r\n\r\n3. Made Keir Starmer cry\r\n\r\n4. Cancelled Joy Reid\r\n\r\n5. Ensured our 51st state never disrespects our national anthem again\r\n\r\nYou're welcome, America!",
                        "author": "jsphere256",
                        "replies": [
                            {
                                "raw_content": "Not good enough. Not even close. 1. We won't know if they are outstanding until they quit slapping each other over bullet point emails, and until crooks start getting arrested at at least the trickle rate that the deportation is happening,  2. Zelensky is still causing trouble and after billions gone...over the knee? Really? That's what we get?  3.Keir Starmer is still causing trouble and who cares if he cries, this is real life not fee fees, 4. Trump didn't cancel Joy Reid, that's a dumb take, and 5. we don't have a 51st State and if we did, no he didn't.\n\nI apologize if I'm flying all of my cynicism flags this morning but some days the memes, jabs, tweets and one liners that are our Government just aren't enough, you know? Sometimes one just wants his leader to cross a frozen river at night and kill the enemy in their sleep on Christmas morning like George Washington did. \n\n",
                                "author": "Framus",
                                "replies": []
                            },
                            {
                                "raw_content": "1. He didn't confirm anyone, he nominated and the senate confirmed.  \n  \n2. I mean, not really? He's also a month behind schedule, wasn't ending the war a day 1 promise?  \n  \n3. Not an accomplishment. \n  \n4. Not an accomplishment.  \n  \n5. Not sure how he did that either, they still booed. \n  \n  \nYou have a low bar for \"winning\". How about lower inflation? Cheaper groceries/gas? No tax on tips/OT? Lowering housing prices? You know, any of the things that matter",
                                "author": "Dogedogedoge",
                                "replies": [
                                    {
                                        "raw_content": "What did you get done this week?",
                                        "author": "jsphere256"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "raw_content": "He didn't say 5, he said \"approximately 5.\" \n\n0 is approximately 5. ",
                        "author": "alex_coopersmith",
                        "replies": [
                            {
                                "raw_content": "Zero is nada, five is something. How do you figure that none is an approximation of some?",
                                "author": "Framus",
                                "replies": [
                                    {
                                        "raw_content": "0 is closer to 5 than are infinitely many integers ",
                                        "author": "alex_coopersmith"
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "raw_content": "We all should be emailing the RINO Senators and Congresspeople asking what they did for us in support of President Trump last week in 5 bullet points to remind them who they work for.",
                "author": "SavingPrivateGrace",
                "replies": [
                    {
                        "raw_content": "Brilliant! I've unfortunately got 2 liberal senators to deal with, but it could be fun.",
                        "author": "Gyrfalcon",
                        "replies": [
                            {
                                "raw_content": "Illinois too?",
                                "author": "SiBear117",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "raw_content": "I’m in Tennessee and my 2 senators, Blackburn and Hagerty already do this via email. If you haven’t signed up for the White House emails, they’re awesome!",
                        "author": "TNgirl4Trump",
                        "replies": []
                    }
                ]
            },
            {
                "raw_content": "Link https://x.com/charliekirk11/status/1893707480557088855",
                "author": "I-am-Orlando",
                "replies": []
            }
        ]
    },
    {
        "post_name": "VA Secretary Doug Collins sets the record straight on VA benefits. VA Healthcare is not being cut, VA benefits are not being cut, VA crisis support line is not being cut. What is being cut? Wasteful spending  and woke contracts so that MORE money goes to veterans’ benefits.",
        "score": 506,
        "url": "https://patriots.win/p/19Adbii5q6",
        "comments_count": 21,
        "posted_at": "2025-02-24 00:38:21 UTC",
        "text_content": "",
        "comments": [
            {
                "raw_content": "NYC council meeting guest speaker Alex Stein will be happy to hear this",
                "author": "Hanging_Chad",
                "replies": [
                    {
                        "raw_content": "If you’re a nine, you’re fine!",
                        "author": "Illuminaughty",
                        "replies": [
                            {
                                "raw_content": "I wonder if the fake news fact checkers will be as quick to rate these Democrat lies as false as they were to fact check every truth we told about Obamacare?\n\nRemember politifact wrote 102 fact checks defending Obamacare when it was being put up for a vote even calling true statements lies\n\nThen when Trump had his health care plan in 2017 and Democrats were outright lying about it there wasn't a single fact check to be found. A true or a false one.. because they didn't want people to know Democrats were lying\n\nThe fact checkers are just Democrat press secretaries.. their job is to spin stories for their party",
                                "author": "Hillaryisbadd",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "raw_content": "Yeah someone in our department talked to people today regarding “the email”. And said a lot of whats coming down the pipe does not apply to the VA. Likely just the woke bullshit being trimmed.",
                "author": "JanOctSept",
                "replies": [
                    {
                        "raw_content": "I'm pretty sure doge already knows who they want to fire and the email thing is just to have a reason to fire them immediately. They aren't going to fire anyone they weren't already planning too (my opinion).",
                        "author": "NoahGav",
                        "replies": [
                            {
                                "raw_content": "I think that’s true. In the deferred resignation email they sent an attachment with a list of roles that were exempt; pretty much everyone that does a daily hands-on function from janitor to doctor was exempt.",
                                "author": "JanOctSept",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "raw_content": "The term 'woke' is simply Marxism with more tax dollars. ",
                "author": "MythArcana",
                "replies": []
            },
            {
                "raw_content": "Democrats were using VA funds for illegals. Will there be consequences for that?",
                "author": "ColonelKlink",
                "replies": []
            },
            {
                "raw_content": "I remember hearing this from liberal vets at work. \r\n\r\nIve told them, countless times, that Trump will not cut benefits for vets. He is the most pro-vet president we've ever had, yet these morons believe he was going to do us dirty. \r\n\r\nAnd reddit. Holy fuck. Those idiots are a lost cause. \r\n\r\nIf youre a liberal and a Vet, you are a special kind of retard. ",
                "author": "thisguy883",
                "replies": []
            }
        ]
    }
]